{
    "id": "22xegmxktbm5wwnhydxwkafr6ggqjzsx",
    "title": "For knowledge",
    "info": {
        "author": [
            "Jérôme Euzenat, INRIA Grenoble Rhône-Alpes"
        ],
        "published": "Dec. 10, 2019",
        "recorded": "October 2019",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2019_euzenat_for_knowledge/",
    "segmentation": [
        [
            "Thank you.",
            "Thank you for the introduction and also for the invitation.",
            "I'm very honored to talk in front of this panel.",
            "Anne.",
            "OK, I did something wrong already, so this talk will be not a plea for knowledge actually, but I'll call 2 brains.",
            "OK, we need your brains to try to deal with."
        ],
        [
            "Some issue that I will try to to present and what I would try to emphasize here is that knowledge is very important not only for the semantic web, but for our way of behaving in general.",
            "And but in particular, in the development of the semantic Web with somewhat lost sight of this, by focusing a bit too much to my test on data.",
            "And this raises problem with respect to developing further knowledge, and I will try to illustrate."
        ],
        [
            "We can deal with that, so this immediately gives the outline of the talk.",
            "I will first argue that our civilization is basically relating on knowledge evolution that the semantic Web has developed quite some good tools that could allow it to take his spot in this knowledge evolution, but the actual data centrism provided very nice success which are very interested interesting.",
            "But somewhat tempers development on the evolution of knowledge, and I will then propose two different track to try to deal with that.",
            "The first one is Semantic E Science, which is rather a direct application of what we already have.",
            "OK, so this is something that we can right now start developing, and then I will come back to something quite different is to try to understand how we can interleave.",
            "Knowledge evolution with the semantic web as it is at the moment."
        ],
        [
            "But there is something else because I thought OK people invited me to talk because I've been around for quite sometimes and maybe I could deliver some point to the younger people and deliver that.",
            "I would like to point out after some quite some time working in research."
        ],
        [
            "Is that a good idea?",
            "Remains a good idea and it's really a good point.",
            "There are people who are really freaking out about the idea of reinventing the wheel.",
            "And but the point is that.",
            "And sometimes a good idea doesn't take off because there are some conditions which are not offered.",
            "So for example, in this example, you can think of the guy who invented the wheel, but you never think about the guy who realize that using more than one will.",
            "Two wheels is important, and maybe the guy will generalize this to any real and etc etc.",
            "And actually, the types tell you that you see good ideas to say, yeah, that's great.",
            "You should work on that.",
            "And then you look back and no one is with you doing it.",
            "But a few years later, suddenly someone rediscovered the name has changed, etc.",
            "So some people would say here they are inventing the wheel.",
            "But then the condition may be better or not, and provide the opportunity to develop this good idea.",
            "So then the lesson of this is, well, if it doesn't take off, maybe you can anyway try to persevere, that's some."
        ],
        [
            "Thing to do?",
            "OK, so this talk is about knowledge and I realized recently that when I talk about knowledge, I think I'm very clear about what I'm talking about, but it's not necessarily the case, especially because the term already is a bit polysemic if you consider it in from an epistemological point of view, knowledge is defined as true belief.",
            "OK, and on the other side on knowledge representation, we rather make a distinction between.",
            "General statement.",
            "And data which are more."
        ],
        [
            "Individual statements and you can think if you do deal about a box, the box of course.",
            "So you can divide this definition in this way you will have an individual or particular belief which is the capital of France is Oakland and individual knowledge saying telling you that the capital of New Zealand is Wellington.",
            "But you can have the same for general statements like you may have the statement that the capital of country is the largest city of that country.",
            "Which is maybe your belief.",
            "OK, but a Synology radar at the capital of a country is located in this country.",
            "I haven't found a counterexample to that."
        ],
        [
            "And so basically what when I'm talking about knowledge I'm talking about what is in red here and not what is in blue.",
            "No, if you working in knowledge graphs, try to think about where you are in this diagram."
        ],
        [
            "OK so I will go ahead with the development now."
        ],
        [
            "I wanted to.",
            "To argue about the idea that knowledge is important for human being, but actually the keynote speaker of yesterday already did this in one slide.",
            "So you have the summary of the following section.",
            "And this is the story of a bunch of good ideas.",
            "OK, and this is basically what I will."
        ],
        [
            "Delivery and so I wanted to look at the future of the semantic Web, and I say, OK, let's try to look at the back at the past and then I look at the path of each path."
        ],
        [
            "Then you can go very far away further away on that and start with vegetables.",
            "For example, in somewhat you in some sense you can say that they sense their environment.",
            "Animals of course do it.",
            "Some of them can memorize such experiment and learn from this experiment.",
            "Some of them can learn from others animals and some imitate."
        ],
        [
            "So the way you can see it is that you've got an individual image environment."
        ],
        [
            "Through perception, it acquires data."
        ],
        [
            "From data it can learn knowledge and then it can use this knowledge in order to add."
        ],
        [
            "On the environment and then it provide a loop which allows you to improve your knowledge relatively continuously.",
            "OK, but usually you don't have one individual in an environment."
        ],
        [
            "You may have several of them OK, and then you've got two ways to consider this.",
            "OK, either reconsider that the other arm."
        ],
        [
            "Have the environment and you just interact with them."
        ],
        [
            "And basically one thing that you can do is imitate them, or you consider."
        ],
        [
            "That the order are somewhat like you and you former SoC.",
            "OK, and then you can start to act with this society in terms of cooperation, for example, and it's allows you even if you don't explicitly transmit knowledge to adapt your knowledge and to change it.",
            "OK, so there is no perception allows you to do that, but also cooperate."
        ],
        [
            "In his orders.",
            "And so this is a first stepping stone.",
            "I would say that when individual interact often the former society and their interaction their way of behaving.",
            "It helps shaping something which is called the character OK, and a culture is something very fast and it's basically a shared way to deal with things.",
            "And this was make the segment of society."
        ],
        [
            "So it leads to things like tradition training, cooperation, also identifying your culture allows you to identify yourself as part of a particular society."
        ],
        [
            "OK. Now when you start to express to be able to express knowledge explicitly, you can do further than that, but communicate this knowledge across individual and this is something which is quite different."
        ],
        [
            "So first thing is that it requires articulated language like or natural language that we have here and this is articulated language that allows for knowledge communication.",
            "OK that you are able to understand statements that you have never heard before, that you have never experienced.",
            "And the very important feature of that is that.",
            "Then you don't have to experience the knowledge that you will have by yourself.",
            "OK, it can be transmitted directly to you.",
            "You don't have to relearn it from scratch.",
            "OK, and both the language that is used for communicating and knowledge are part of culture and this led to."
        ],
        [
            "Things like teaching universities and conferences OK, this is because I'm trying to articulate some knowledge to transmit it to you that we are here."
        ],
        [
            "So this makes difference between two kinds of things in the transmission of knowledge.",
            "Either you can discover it by yourself by observing by experimenting, or it can be transmitted from other people in your society or in other societies so it can start with imitating training, which doesn't require articulated language.",
            "But it can also be obtained by communicating, communicating, direct directly this knowledge, and this is not something that step on.",
            "Top of each other, OK?"
        ],
        [
            "Of course, when you are young, your baby, you start with doing observation, then your experiment by throwing things on the ground and you observe that then when you do that, your mother get upset and but she comes very quickly and after some time you try to understand what she tried to express and then you acquire language and then you start to go to school and between 5 and 25 years you learned a lot of.",
            "A formal, not formally, but articulated knowledge OK. And so this is basically the the proportion, but you never stop experimenting in your life.",
            "You never stop experimenting.",
            "The awkward way of interacting with someone, for example, and then you understand that you were not supposed to do it this way, etc etc.",
            "And you don't have the the need that it is explicitly told to you.",
            "You are still able to learn and this continue to happen.",
            "So this is something that happens from all human beings and.",
            "All along their life."
        ],
        [
            "There is something else which was also mentioned later yesterday, which is quite important.",
            "It's recording OK, like writing because it's important because it allows you to get rid of space and time.",
            "For example, you can still read the book of someone who has written it 2 sent to 2 million 2000 years ago.",
            "And also you can talk with people who are very far away from you.",
            "This improves the transmission accuracy so that it's not because oral tradition as a lot may have a lot of change, but there you can refer to something that was written far away in time and still think that it is."
        ],
        [
            "The Inacurate station and, of course, this led to books libraries."
        ],
        [
            "Join but again, this is where great ideas, but you can think that they did not common in one days OK?",
            "For example, the idea of writing certainly started by rating on sand OK and accuracy and length of conservation of this rating was not very very good.",
            "OK, and it improves over the year.",
            "So this is a technological factor that make that by improving the technology then suddenly become viable an adopted by everyone."
        ],
        [
            "Just a remark that recording and language are two totally different things, especially nowadays we can see this because we have the tendency.",
            "While I have the tendency to consider that writing is the first kind of recording and it's always about the express.",
            "Explicitly expressed knowledge, but actually nowadays a lot of people rely on movies which may not rely on particle language may not.",
            "And of course you can have a culture without language.",
            "Like for example this.",
            "Aka."
        ],
        [
            "So in summary, what is really important is learning communicating."
        ],
        [
            "Recording and the point is that is certainly a unique feature combination of four spaces.",
            "And without which knowledge will have been to relearn, and we should not be able to reach the kind of state in which we are.",
            "Whether you like it or not is."
        ],
        [
            "Another thing and the web in this respect was really an amplifier of that.",
            "OK, it's allows to more easily and readily make possible to publish knowledge and to get access into a lot of people it revolutionize alot of things.",
            "For example, you can think of Stackoverflow which basically changed the way people program or Wikipedia will change the way people do their homework for example.",
            "But I mean, if you were there before the web and after the web, it's kind of totally different word actually."
        ],
        [
            "So the semantic web in all this, the semantic."
        ],
        [
            "It was a very good idea as well.",
            "OK, so the semantic Web is a web not only for machines but also for machines.",
            "So actually the web was already processed by machine, but the point was to be able to express its can't."
        ],
        [
            "OK, but you can distinguish between several types of content.",
            "You can distinguish between meta data, which is not really content and its data about the content, but its first kind of information which is may be exploited.",
            "Then you can consider a specialized data.",
            "I mentioned a few of them agenda address.",
            "It is something that you you actually know what it how it is supposed to be.",
            "An agenda is supposed to be put in an agenda software OK?",
            "And this is basically the kind of information that was in Seminole Semantic Web paper of Scientific America, which was exploited there.",
            "But you may be a bit more ambitious and try to.",
            "Express everything which is a web page.",
            "OK, not only the info box of Wikipedia, but actually the content of the articles."
        ],
        [
            "So I wanted to give an example of that out without knowledge, and so does someone know what is the meaning of this?",
            "Someone who doesn't haven't seen this picture before?",
            "Yeah.",
            "Not yet.",
            "Agriculture, you have seen it already before.",
            "Oh OK.",
            "So the numbers are so very good and we've got very big.",
            "Very accurate presentation, so the numbers are yours, yours before Arias and it's a spread of Agricultural Society.",
            "OK, and actually this."
        ],
        [
            "Maps was in a very influential paper.",
            "The next knowledge Medium 4 from Mark Stefik.",
            "But you can imagine what is a computer face facing a knowledge graph.",
            "OK, instead of such a map."
        ],
        [
            "So when we started along this semantic web idea, there have been development of very important technologies.",
            "I would say which allows you to express data and relation on the web so it is air DEF.",
            "Whatever the format you user.",
            "If you don't like.",
            "Some format you can use another one.",
            "You can express knowledge with ontology language such as DFS and all the old spaces.",
            "Then you can express query rather sophisticated nowadays with sparkle, but also variants and spot of sparkle."
        ],
        [
            "And there are plenty of other language that I won't mention, likely because I know them less."
        ],
        [
            "Anyway, I've been this language.",
            "I've been used in particular for developing a lot of specific ontologies we can, which can be related to very general things.",
            "You can imagine that there is an ontology about provenance.",
            "OK, but get back without the rational for doing this.",
            "Two years ago, and if someone told you I will do an ontology without about provenance, it would have had to explain you what you're talking about.",
            "OK, you've got ontology about work like FL.",
            "Bear with I like very much, so I mention it, but also some very more.",
            "Concrete object like proteins or restaurants you've got."
        ],
        [
            "So this which is available, and so this could have led to a very lively knowledge ecosystem.",
            "In which explicit knowledge can take his spot to do a lot of tasks."
        ],
        [
            "So machines could take advantage of knowledge to correct it.",
            "To provide you application tells you if the restaurant you where you want to go is open at that moment that OK, a very interesting application, but it may also help you, and if it's not open to suggest you another one.",
            "It may help you to elaborate knowledge and I'm thinking about the semantic washing machine which was proposed by Soren Auer and Onions.",
            "Lemon that is, for example using explicit knowledge in order to clean up the data in DB pedia and then to clean up Wikipedia.",
            "But if you a bit more ambitious, you so can also imagine that machine may contribute knowledge OK and so here you are in the realm of artificial intelligence machine trying to.",
            "Mine relatively autonomous, autonomously knowledge, in order to suggest you some new one."
        ],
        [
            "OK Ann, well we're not there.",
            "So the question is."
        ],
        [
            "It went wrong.",
            "So there may be a number of seeing.",
            "It may be that the market was not mature, I don't know, but it did."
        ],
        [
            "Not take off.",
            "OK, So what went wrong is basically that we had all these technologies but we did not add the data to work on an.",
            "It's really not terribly useful for some people.",
            "If you don't have the data and so some very clever people at this idea of linked open data, for instance, and publishing more data on the web and."
        ],
        [
            "That's what happened.",
            "So if you.",
            "Listen to the keynote lecture of Tim Berners Lee two years ago for the Turing Awards.",
            "Basically say what is semantic web, this is schema.org and linked open under link open data Cloud.",
            "OK, so yes, this is success.",
            "Very good success of the semantic web, but."
        ],
        [
            "Mostly focused on on data an this is justified.",
            "We really need this.",
            "We need this."
        ],
        [
            "And this provides us with a lot of interesting applications, statistical data aggregation, and especially at the level of.",
            "Country statistical data.",
            "Semantic sensor network and no semantic coyote digital assistants, which take advantage of this and question answering, and of course such an knowledge search and knowledge graphics pre exploitation.",
            "So."
        ],
        [
            "One of the things that I like very much is for example I can ask for Marie Curie's bonds.",
            "Brother and I can."
        ],
        [
            "Not for the same.",
            "In French, this is changing all the day.",
            "I took this yesterday and two days before it was different, but.",
            "And the system is able directly to answer this question.",
            "And actually when we started in 2000 working on Semantic Web.",
            "If I would have been told that 20 years later and actually 15 years later we would have that, I would have signed OK."
        ],
        [
            "The reason is that at that time I was not very optimistic about semantic search for two reasons.",
            "Search was very, very accurate already.",
            "OK and we were far away to improve on that.",
            "And the second reason is that the major player in search.",
            "We are absolutely not interested in explicit knowledge.",
            "OK, so we would have to beat them directly and that would have been very difficult on the other side there was some new trends, web services OK and there was this semantic web services sings.",
            "Which looks very cool because there was no services at that time.",
            "Basically so it was very easy to beat them and I think semantic Web services is a very good idea.",
            "But I don't know if they are semantic web services people here.",
            "There is no session, yeah?",
            "That's OK, it's doing plenty of things, so it's still following the good ideas.",
            "This is a good example.",
            "Do like Terry.",
            "So there is no semantic web services at the conference anymore."
        ],
        [
            "But these are good ideas and they remain good ideas.",
            "So I think semantic web services maybe not web.",
            "They will have another name, but they will show up later at some point, because being able to opportunistically select the service based on this description is something that has to be done at some point."
        ],
        [
            "OK, So what happened is that we have all this data and we're and the use of this data is as permitted, something basically to unleash the power of machine learning OK, and to provide."
        ],
        [
            "A lot of very impressive application.",
            "OK, so this is really a good thing already, so you can name a number of them behavior classification or object recognition, natural language translation relation discovery and I'm some of you are working on dragging this interaction, for example recommendation and search."
        ],
        [
            "Leslie and so if the question is does that make the web more intelligible to machine?",
            "I would answer definitely OK.",
            "This is really, really really true."
        ],
        [
            "However.",
            "Some of my colleague RB2 enthusiastic about this and they are in the room so they can answer.",
            "So they said recently our fellow computer scientists can both benefit from the additional semantic constructor of the data available in the new web and continue to build on using this structure, creating a vicious virtuous circle.",
            "I."
        ],
        [
            "Actually, what circle are you talking about?",
            "OK, there is no circle.",
            "What?"
        ],
        [
            "Happened at the moment is that we are a company will acquire giant data meshes OK, they required data from the interaction with their services.",
            "OK, eventually this data is open, so of course what they do is is that is to learn OK and you can expect that they are learning knowledge.",
            "But they don't share this knowledge.",
            "This knowledge is it in their cillo and they are only interested into exploiting it.",
            "OK, and actually you you think that you are the people who are able to provide knowledge to this machine but actually they are not interested in it?",
            "OK, they are interested in several things like what you like, what you click on and what you buy and they will train their system on this.",
            "And so the problem is that since this knowledge which is very efficient and very useful is sometimes not.",
            "Explicit but also most of all not share.",
            "It doesn't allow us to improve because no one can improve on it.",
            "It can only come back to the data."
        ],
        [
            "And I found I did not knew the the book which was cited yesterday by the keynote talk, but I think the data centric revolution is exactly the the word to use.",
            "Revolution means coming back to the starting point.",
            "OK, this doesn't mean evolution.",
            "You don't evolve.",
            "You come back.",
            "This is actually very accurate.",
            "Keyboard key which is on this on this paper.",
            "So if you think about what I started with, that is our civilization or civilization is based on knowledge evolution.",
            "This is rather regulation.",
            "OK, we are basically in some kind of dead ends which is.",
            "A nice dead end, but we cannot build on that."
        ],
        [
            "And so the question is, what can be done about?"
        ],
        [
            "That and two proposal that I will try to discuss very briefly, our science and putting knowledge evolution on the web.",
            "That's OK."
        ],
        [
            "We would be on time.",
            "Anne.",
            "So in science is a very obvious use case.",
            "OK?",
            "Because science is about improving knowledge, it's about knowledge sharing and knowledge evolution.",
            "It is all science is also nowadays massively computer supported, so there is no barrier to introduce computer techniques within science.",
            "It also faces some problem of its own.",
            "Problem with credibility and you may have heard about reproducibility, crisis and also information overflow like people cannot read everything which is published at the moment and you may miss things and it may be a problem.",
            "And actually, especially the last problem is a problem where computers are typically typically good at OK, so it would be nice to be able to help.",
            "And last but not least, a lot of has been done already on a science, and even some Ant."
        ],
        [
            "E. Science.",
            "There was very interesting tutorial on that on Sunday.",
            "So this is.",
            "Talking about good ideas, I don't know, but something I was doing and I it was published in 95 and the idea was that scientists would express formally their knowledge, the topic they were working on and theory they had about it and they will be able to submit it to.",
            "Constant what I used to Co consensual knowledge basis OK and then in this conceptual knowledge basis you can take advantage of the fact that it is explicit and that it is formalized tutelo, but this is contradictory, which was what is there or is this redundant?",
            "Or you should formulate this better in order to fit into the actual landscape.",
            "And so it was the goal of the of the researcher to submit knowledge that will be accepted and it was based on the peer review.",
            "Protocol OK, but this did not took off OK, we don't do that at the moment, but maybe someday we will do that or some other will do."
        ],
        [
            "So as I said.",
            "We can do semantically science nowadays, so I will try to give a small example of that.",
            "So usually people start with.",
            "There are people doing research and they write paper."
        ],
        [
            "1st paper site."
        ],
        [
            "Papers papers may be able to describe experiments."
        ],
        [
            "Experiments may be an alteration of another existing experiment."
        ],
        [
            "And the goal of this experiment is to test an hypothesis both."
        ],
        [
            "The experiment, while the iPod is this, would be about some objects and the experiment will manipulate this object.",
            "It may."
        ],
        [
            "Also use software and hardware."
        ],
        [
            "And finally, it will produce data."
        ],
        [
            "This data will support some results."
        ],
        [
            "And you can also use statistical tests in order to qualify the confidence.",
            "The significance of the result that you have obtained OK.",
            "So this is basically the representation of an experiment in a paper.",
            "This is a bit more complex than that, but I want to elaborate on this.",
            "So the point is that we already have a lot of."
        ],
        [
            "Ontologies which allows to do that.",
            "OK, so all the technology that we have is able to do that and we have examples of projects which are about this.",
            "This kind of things and when you are in this state."
        ],
        [
            "You can start to take advantage of this knowledge.",
            "For example, is there a paper that contradicts what I'm writing in my paper?"
        ],
        [
            "This hypothesis are I'm making.",
            "Does it subsume or is it subsumed by another hypothesis that has been published?"
        ],
        [
            "That's my experiment is prone to refute my hypothesis or not OK, that is very important, because otherwise the experiment is not useful at all."
        ],
        [
            "And as a result, support or.",
            "Contradicts the hypothesis."
        ],
        [
            "All the tests apply to the result.",
            "All this Red Arrows are application that."
        ],
        [
            "Actually requires knowledge to be implemented and there would be very useful for scientists.",
            "Actually, for me as a scientist, that would be very useful for me.",
            "There is some important points that could be used at design time or post talk.",
            "So what I discribed is an experiment described in the paper, but it's not very good to think about that because once you have described the experiment in the paper, it has been carried out etc and you'd better know before if it's refute or not.",
            "It's problem to refute or not the hypothesis.",
            "OK, so it's interesting to have this at design time.",
            "It's helps you to design your experiments.",
            "It may be used to probe experiment registration, so experiment priority registration is something that as some people try to promote at the moment, this is, in my opinion a very good idea, but it may not take off because there is a lot of people that don't agree with that.",
            "What is the idea is that when you plan to test something in hypothesis, instead of doing all the work and submitting a paper at the Journal, you will first submit.",
            "The design of your experiment with the hypothesis and what you're supposed to do.",
            "This has actually three benefits.",
            "The first one is that the reviewer can tell you earlier that they don't like your experiment on why OK, and the corollary of that is that if they like it basically one they have accepted the experiment.",
            "The paper is accepted.",
            "This has another corollary, which is it goes against bias that we only publish positive results.",
            "Actually, if the experiment is testing a relevant hypothesis and the result is negative, it is worth publishing OK, but.",
            "If you submit very good improvement of a system and a knowledge Raptor I SWC and you show by experiment that it doesn't work very well, your paper will be rejected.",
            "I can tell you OK so maybe this could be implemented as well in this Community, writes better with Ronald and conferences.",
            "And there is a last point with experiment registration.",
            "That I don't remember.",
            "I would make come back on this later, but that's OK, but this is really a very, very nice idea."
        ],
        [
            "Moreover, what I presented only applies proven technology.",
            "We don't really need.",
            "I'm.",
            "Paradigm change or whatever in order to be able to implement that.",
            "OK, so as I."
        ],
        [
            "Some people are doing this and it may be applied to other fields.",
            "I mentioned that so people in mathematics are using more and more theorem provers, for instance, and they could use it a bit more widely.",
            "But you can also think about observation over Sciences, which are a bit different than the kind of experiment that I presented here."
        ],
        [
            "And of course, this is data also under the description itself is data, so it could be used through machine learning which could help you to clean up your information or mining some interesting fact from the basis of experiment that has been published."
        ],
        [
            "OK, and so I think for this kind of idea the really important thing is incentive.",
            "OK, this is the obstacle for this to take off if people do not fill in, sensitize to do it, they won't do it.",
            "And I can tell you, for example, for my work, I really would love to have all the tools for for doing it 'cause it provide me safeness.",
            "OK, in what I publish.",
            "OK I have more.",
            "More.",
            "I'm able to to have more insurance on the result that I'd get if I can test it more formally."
        ],
        [
            "OK, so the last issue is back to evolution."
        ],
        [
            "So the idea is that yeah, knowledge as to evolve.",
            "It doesn't say it, it has to change.",
            "I talked about scientific knowledge, but all knowledge is not scientific knowledge and it doesn't evolve in the same way.",
            "OK, we've got Methodology's which have been elaborated for a certain level of safety, but we are."
        ],
        [
            "Actually using knowledge even where if we are not sure of it, OK and it has to be evolved why it is being used."
        ],
        [
            "OK.",
            "So.",
            "One of the principles that you can take advantage of to consider this problem is cultural evolution.",
            "Cultural evolution stems from anthropology.",
            "It is basically natural evolution applied to culture and culture.",
            "So people don't talk about culture generally in this domain they focus on some particular aspects like both designs, language, social structure and they looked at how it evolved under under.",
            "And their history.",
            "And this has also been applied to science.",
            "It's called evolutionary."
        ],
        [
            "Is dermology.",
            "So there is a quote that I like very much from this recent book is a cultural fast Lane of cultural evolution bypassing the traffic jam of genetic evolution becausw the point of a number of people is that actually?",
            "Genetic evolution takes quite a lot of time.",
            "OK, not to other necessarily a mutation, but for it to spread cultural revolution becausw it spread more freely, like when talking in conference in conferences, then it's allows to evolve knowledge far more quickly than genes evolve."
        ],
        [
            "So natural evolution can be seen as an abstract control mechanisms based on tree principle, variation, selection, transmission."
        ],
        [
            "And this has been implemented in computer already, so you have heard and or knows very well genetic or evolutionary programming or algorithm.",
            "But there is also experimental cultural evolution that has been developed by some auto."
        ],
        [
            "1st.",
            "And so basically the idea of experimental curves or evolution is that you've got population of agent bearing knowledge.",
            "OK, so when you apply this to knowledge, this is their culture and they are using their knowledge to interact with each other.",
            "OK, this tell them how to interact, why?",
            "What answer they will give 22 orders and at the issue of each interaction they will adapt their knowledge.",
            "So this."
        ],
        [
            "Basically you've got agent like that.",
            "They have knowledge which is actually the cause of their behavior.",
            "Then have the pressure of the environment and the other agent through their behavior and given the result of the interaction then they will add up their knowledge and you run experiment with bunch of agent like that and you can observe out there.",
            "Depending on the kind of adaptation that they do, the kind of protocol that you're using, the red."
        ],
        [
            "But you are, so it has been used for abstract culture by Accel Rd, Natural Language Evolution by Luc Steels, which did a lot of work on that topic and in this community by a number of other people to provide ontology alignment, evolution."
        ],
        [
            "But you can think about it more widely.",
            "OK, now imagine that you have a search engine which is and enhance by, let's say by knowledge.",
            "OK, like the one I presented before.",
            "And since this search engine is using knowledge for answering this question and that.",
            "It receives feedback the usual way he's able to know.",
            "For example, if the answer that he gives accurate or not OK, so it could use also adaptation operator in order to adapt the knowledge that he has used in order to be more accurate than next time.",
            "OK, and you can imagine this to be applied to meta search engine or community of search engine which interact with each other.",
            "OK so it is not just agent in the lab but this is a kind of of application that would allow."
        ],
        [
            "Evil knowledge.",
            "So what has to be done to do that?",
            "There are two important things.",
            "The first one is understanding the general principle of knowledge evolution, because we're not able to tell at the moment and the second one is its articulation of this with the semantic web in general."
        ],
        [
            "On the 1st aspect, this can be investigated theoretically by defining formally what is happening and finding the properties of the mechanisms.",
            "Or you can test this mechanism experimentally, which is mostly be done at the moment.",
            "It can also be done in relation with the social science and the humanities in order to have an idea of how it works for us."
        ],
        [
            "For the articulation with the semantic web, you really need the mechanisms in order to implement the adaptation of knowledge.",
            "You really need the red white to it, because if you want to share knowledge, you should be able to publish it and you also need nonbreaking operability, interoperability.",
            "OK, so we've got the four organizations, which is very well known, and when the user receives four page, this is not the end of the world.",
            "OK, maybe it will fix this.",
            "You or I maybe will look to another site in order to have the answer to this question.",
            "So it should not be the end of the world when some knowledge expressed is inconsistent.",
            "OK, we will should have something to cope with that."
        ],
        [
            "So it's time for me to conclude."
        ],
        [
            "Where are we?",
            "So if you remember the diagram I showed before, basically the semantic web is still a baby.",
            "OK, it's still using a lot too much data and not enough knowledge, so it's basically the."
        ],
        [
            "Point and the semantic Web may be used to fill sealers to the benefit of some commercial interests that learn knowledge but don't make it evolve.",
            "Don't make it public, etc.",
            "And it can be used to help contribute to the knowledge of the humanity both.",
            "Maybe pursuit there is no problem with that, but maybe it could be interesting to be sure that following the first thread does not.",
            "Uh.",
            "Prevent following the second one.",
            "OK, that would be my message."
        ],
        [
            "And on the positive side, remember.",
            "Be optimistic.",
            "A good idea remains a good idea and if you persevere, maybe you will see it happen.",
            "OK."
        ],
        [
            "So for finishing what I some of what I expressed here and in a different way is in a paper which is to be published in the January issue of the Semantic Web Journal.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you for the introduction and also for the invitation.",
                    "label": 0
                },
                {
                    "sent": "I'm very honored to talk in front of this panel.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "OK, I did something wrong already, so this talk will be not a plea for knowledge actually, but I'll call 2 brains.",
                    "label": 0
                },
                {
                    "sent": "OK, we need your brains to try to deal with.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some issue that I will try to to present and what I would try to emphasize here is that knowledge is very important not only for the semantic web, but for our way of behaving in general.",
                    "label": 0
                },
                {
                    "sent": "And but in particular, in the development of the semantic Web with somewhat lost sight of this, by focusing a bit too much to my test on data.",
                    "label": 1
                },
                {
                    "sent": "And this raises problem with respect to developing further knowledge, and I will try to illustrate.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We can deal with that, so this immediately gives the outline of the talk.",
                    "label": 0
                },
                {
                    "sent": "I will first argue that our civilization is basically relating on knowledge evolution that the semantic Web has developed quite some good tools that could allow it to take his spot in this knowledge evolution, but the actual data centrism provided very nice success which are very interested interesting.",
                    "label": 1
                },
                {
                    "sent": "But somewhat tempers development on the evolution of knowledge, and I will then propose two different track to try to deal with that.",
                    "label": 0
                },
                {
                    "sent": "The first one is Semantic E Science, which is rather a direct application of what we already have.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is something that we can right now start developing, and then I will come back to something quite different is to try to understand how we can interleave.",
                    "label": 0
                },
                {
                    "sent": "Knowledge evolution with the semantic web as it is at the moment.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But there is something else because I thought OK people invited me to talk because I've been around for quite sometimes and maybe I could deliver some point to the younger people and deliver that.",
                    "label": 0
                },
                {
                    "sent": "I would like to point out after some quite some time working in research.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is that a good idea?",
                    "label": 0
                },
                {
                    "sent": "Remains a good idea and it's really a good point.",
                    "label": 1
                },
                {
                    "sent": "There are people who are really freaking out about the idea of reinventing the wheel.",
                    "label": 0
                },
                {
                    "sent": "And but the point is that.",
                    "label": 0
                },
                {
                    "sent": "And sometimes a good idea doesn't take off because there are some conditions which are not offered.",
                    "label": 0
                },
                {
                    "sent": "So for example, in this example, you can think of the guy who invented the wheel, but you never think about the guy who realize that using more than one will.",
                    "label": 0
                },
                {
                    "sent": "Two wheels is important, and maybe the guy will generalize this to any real and etc etc.",
                    "label": 0
                },
                {
                    "sent": "And actually, the types tell you that you see good ideas to say, yeah, that's great.",
                    "label": 0
                },
                {
                    "sent": "You should work on that.",
                    "label": 0
                },
                {
                    "sent": "And then you look back and no one is with you doing it.",
                    "label": 0
                },
                {
                    "sent": "But a few years later, suddenly someone rediscovered the name has changed, etc.",
                    "label": 0
                },
                {
                    "sent": "So some people would say here they are inventing the wheel.",
                    "label": 0
                },
                {
                    "sent": "But then the condition may be better or not, and provide the opportunity to develop this good idea.",
                    "label": 0
                },
                {
                    "sent": "So then the lesson of this is, well, if it doesn't take off, maybe you can anyway try to persevere, that's some.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thing to do?",
                    "label": 0
                },
                {
                    "sent": "OK, so this talk is about knowledge and I realized recently that when I talk about knowledge, I think I'm very clear about what I'm talking about, but it's not necessarily the case, especially because the term already is a bit polysemic if you consider it in from an epistemological point of view, knowledge is defined as true belief.",
                    "label": 0
                },
                {
                    "sent": "OK, and on the other side on knowledge representation, we rather make a distinction between.",
                    "label": 0
                },
                {
                    "sent": "General statement.",
                    "label": 0
                },
                {
                    "sent": "And data which are more.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Individual statements and you can think if you do deal about a box, the box of course.",
                    "label": 0
                },
                {
                    "sent": "So you can divide this definition in this way you will have an individual or particular belief which is the capital of France is Oakland and individual knowledge saying telling you that the capital of New Zealand is Wellington.",
                    "label": 0
                },
                {
                    "sent": "But you can have the same for general statements like you may have the statement that the capital of country is the largest city of that country.",
                    "label": 0
                },
                {
                    "sent": "Which is maybe your belief.",
                    "label": 0
                },
                {
                    "sent": "OK, but a Synology radar at the capital of a country is located in this country.",
                    "label": 0
                },
                {
                    "sent": "I haven't found a counterexample to that.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so basically what when I'm talking about knowledge I'm talking about what is in red here and not what is in blue.",
                    "label": 0
                },
                {
                    "sent": "No, if you working in knowledge graphs, try to think about where you are in this diagram.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK so I will go ahead with the development now.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I wanted to.",
                    "label": 0
                },
                {
                    "sent": "To argue about the idea that knowledge is important for human being, but actually the keynote speaker of yesterday already did this in one slide.",
                    "label": 0
                },
                {
                    "sent": "So you have the summary of the following section.",
                    "label": 0
                },
                {
                    "sent": "And this is the story of a bunch of good ideas.",
                    "label": 1
                },
                {
                    "sent": "OK, and this is basically what I will.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Delivery and so I wanted to look at the future of the semantic Web, and I say, OK, let's try to look at the back at the past and then I look at the path of each path.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then you can go very far away further away on that and start with vegetables.",
                    "label": 0
                },
                {
                    "sent": "For example, in somewhat you in some sense you can say that they sense their environment.",
                    "label": 1
                },
                {
                    "sent": "Animals of course do it.",
                    "label": 0
                },
                {
                    "sent": "Some of them can memorize such experiment and learn from this experiment.",
                    "label": 1
                },
                {
                    "sent": "Some of them can learn from others animals and some imitate.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the way you can see it is that you've got an individual image environment.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Through perception, it acquires data.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From data it can learn knowledge and then it can use this knowledge in order to add.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the environment and then it provide a loop which allows you to improve your knowledge relatively continuously.",
                    "label": 0
                },
                {
                    "sent": "OK, but usually you don't have one individual in an environment.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You may have several of them OK, and then you've got two ways to consider this.",
                    "label": 0
                },
                {
                    "sent": "OK, either reconsider that the other arm.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Have the environment and you just interact with them.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And basically one thing that you can do is imitate them, or you consider.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That the order are somewhat like you and you former SoC.",
                    "label": 0
                },
                {
                    "sent": "OK, and then you can start to act with this society in terms of cooperation, for example, and it's allows you even if you don't explicitly transmit knowledge to adapt your knowledge and to change it.",
                    "label": 0
                },
                {
                    "sent": "OK, so there is no perception allows you to do that, but also cooperate.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In his orders.",
                    "label": 0
                },
                {
                    "sent": "And so this is a first stepping stone.",
                    "label": 0
                },
                {
                    "sent": "I would say that when individual interact often the former society and their interaction their way of behaving.",
                    "label": 0
                },
                {
                    "sent": "It helps shaping something which is called the character OK, and a culture is something very fast and it's basically a shared way to deal with things.",
                    "label": 1
                },
                {
                    "sent": "And this was make the segment of society.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So it leads to things like tradition training, cooperation, also identifying your culture allows you to identify yourself as part of a particular society.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK. Now when you start to express to be able to express knowledge explicitly, you can do further than that, but communicate this knowledge across individual and this is something which is quite different.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So first thing is that it requires articulated language like or natural language that we have here and this is articulated language that allows for knowledge communication.",
                    "label": 1
                },
                {
                    "sent": "OK that you are able to understand statements that you have never heard before, that you have never experienced.",
                    "label": 0
                },
                {
                    "sent": "And the very important feature of that is that.",
                    "label": 0
                },
                {
                    "sent": "Then you don't have to experience the knowledge that you will have by yourself.",
                    "label": 0
                },
                {
                    "sent": "OK, it can be transmitted directly to you.",
                    "label": 0
                },
                {
                    "sent": "You don't have to relearn it from scratch.",
                    "label": 1
                },
                {
                    "sent": "OK, and both the language that is used for communicating and knowledge are part of culture and this led to.",
                    "label": 1
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Things like teaching universities and conferences OK, this is because I'm trying to articulate some knowledge to transmit it to you that we are here.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this makes difference between two kinds of things in the transmission of knowledge.",
                    "label": 0
                },
                {
                    "sent": "Either you can discover it by yourself by observing by experimenting, or it can be transmitted from other people in your society or in other societies so it can start with imitating training, which doesn't require articulated language.",
                    "label": 0
                },
                {
                    "sent": "But it can also be obtained by communicating, communicating, direct directly this knowledge, and this is not something that step on.",
                    "label": 0
                },
                {
                    "sent": "Top of each other, OK?",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course, when you are young, your baby, you start with doing observation, then your experiment by throwing things on the ground and you observe that then when you do that, your mother get upset and but she comes very quickly and after some time you try to understand what she tried to express and then you acquire language and then you start to go to school and between 5 and 25 years you learned a lot of.",
                    "label": 0
                },
                {
                    "sent": "A formal, not formally, but articulated knowledge OK. And so this is basically the the proportion, but you never stop experimenting in your life.",
                    "label": 0
                },
                {
                    "sent": "You never stop experimenting.",
                    "label": 0
                },
                {
                    "sent": "The awkward way of interacting with someone, for example, and then you understand that you were not supposed to do it this way, etc etc.",
                    "label": 0
                },
                {
                    "sent": "And you don't have the the need that it is explicitly told to you.",
                    "label": 0
                },
                {
                    "sent": "You are still able to learn and this continue to happen.",
                    "label": 0
                },
                {
                    "sent": "So this is something that happens from all human beings and.",
                    "label": 0
                },
                {
                    "sent": "All along their life.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There is something else which was also mentioned later yesterday, which is quite important.",
                    "label": 0
                },
                {
                    "sent": "It's recording OK, like writing because it's important because it allows you to get rid of space and time.",
                    "label": 1
                },
                {
                    "sent": "For example, you can still read the book of someone who has written it 2 sent to 2 million 2000 years ago.",
                    "label": 0
                },
                {
                    "sent": "And also you can talk with people who are very far away from you.",
                    "label": 0
                },
                {
                    "sent": "This improves the transmission accuracy so that it's not because oral tradition as a lot may have a lot of change, but there you can refer to something that was written far away in time and still think that it is.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The Inacurate station and, of course, this led to books libraries.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Join but again, this is where great ideas, but you can think that they did not common in one days OK?",
                    "label": 0
                },
                {
                    "sent": "For example, the idea of writing certainly started by rating on sand OK and accuracy and length of conservation of this rating was not very very good.",
                    "label": 0
                },
                {
                    "sent": "OK, and it improves over the year.",
                    "label": 0
                },
                {
                    "sent": "So this is a technological factor that make that by improving the technology then suddenly become viable an adopted by everyone.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just a remark that recording and language are two totally different things, especially nowadays we can see this because we have the tendency.",
                    "label": 0
                },
                {
                    "sent": "While I have the tendency to consider that writing is the first kind of recording and it's always about the express.",
                    "label": 0
                },
                {
                    "sent": "Explicitly expressed knowledge, but actually nowadays a lot of people rely on movies which may not rely on particle language may not.",
                    "label": 0
                },
                {
                    "sent": "And of course you can have a culture without language.",
                    "label": 1
                },
                {
                    "sent": "Like for example this.",
                    "label": 0
                },
                {
                    "sent": "Aka.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in summary, what is really important is learning communicating.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Recording and the point is that is certainly a unique feature combination of four spaces.",
                    "label": 1
                },
                {
                    "sent": "And without which knowledge will have been to relearn, and we should not be able to reach the kind of state in which we are.",
                    "label": 0
                },
                {
                    "sent": "Whether you like it or not is.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another thing and the web in this respect was really an amplifier of that.",
                    "label": 0
                },
                {
                    "sent": "OK, it's allows to more easily and readily make possible to publish knowledge and to get access into a lot of people it revolutionize alot of things.",
                    "label": 0
                },
                {
                    "sent": "For example, you can think of Stackoverflow which basically changed the way people program or Wikipedia will change the way people do their homework for example.",
                    "label": 1
                },
                {
                    "sent": "But I mean, if you were there before the web and after the web, it's kind of totally different word actually.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the semantic web in all this, the semantic.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It was a very good idea as well.",
                    "label": 0
                },
                {
                    "sent": "OK, so the semantic Web is a web not only for machines but also for machines.",
                    "label": 1
                },
                {
                    "sent": "So actually the web was already processed by machine, but the point was to be able to express its can't.",
                    "label": 1
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, but you can distinguish between several types of content.",
                    "label": 0
                },
                {
                    "sent": "You can distinguish between meta data, which is not really content and its data about the content, but its first kind of information which is may be exploited.",
                    "label": 0
                },
                {
                    "sent": "Then you can consider a specialized data.",
                    "label": 0
                },
                {
                    "sent": "I mentioned a few of them agenda address.",
                    "label": 0
                },
                {
                    "sent": "It is something that you you actually know what it how it is supposed to be.",
                    "label": 1
                },
                {
                    "sent": "An agenda is supposed to be put in an agenda software OK?",
                    "label": 0
                },
                {
                    "sent": "And this is basically the kind of information that was in Seminole Semantic Web paper of Scientific America, which was exploited there.",
                    "label": 0
                },
                {
                    "sent": "But you may be a bit more ambitious and try to.",
                    "label": 0
                },
                {
                    "sent": "Express everything which is a web page.",
                    "label": 1
                },
                {
                    "sent": "OK, not only the info box of Wikipedia, but actually the content of the articles.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I wanted to give an example of that out without knowledge, and so does someone know what is the meaning of this?",
                    "label": 0
                },
                {
                    "sent": "Someone who doesn't haven't seen this picture before?",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Not yet.",
                    "label": 0
                },
                {
                    "sent": "Agriculture, you have seen it already before.",
                    "label": 0
                },
                {
                    "sent": "Oh OK.",
                    "label": 0
                },
                {
                    "sent": "So the numbers are so very good and we've got very big.",
                    "label": 0
                },
                {
                    "sent": "Very accurate presentation, so the numbers are yours, yours before Arias and it's a spread of Agricultural Society.",
                    "label": 0
                },
                {
                    "sent": "OK, and actually this.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Maps was in a very influential paper.",
                    "label": 0
                },
                {
                    "sent": "The next knowledge Medium 4 from Mark Stefik.",
                    "label": 0
                },
                {
                    "sent": "But you can imagine what is a computer face facing a knowledge graph.",
                    "label": 0
                },
                {
                    "sent": "OK, instead of such a map.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So when we started along this semantic web idea, there have been development of very important technologies.",
                    "label": 0
                },
                {
                    "sent": "I would say which allows you to express data and relation on the web so it is air DEF.",
                    "label": 1
                },
                {
                    "sent": "Whatever the format you user.",
                    "label": 0
                },
                {
                    "sent": "If you don't like.",
                    "label": 0
                },
                {
                    "sent": "Some format you can use another one.",
                    "label": 0
                },
                {
                    "sent": "You can express knowledge with ontology language such as DFS and all the old spaces.",
                    "label": 0
                },
                {
                    "sent": "Then you can express query rather sophisticated nowadays with sparkle, but also variants and spot of sparkle.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there are plenty of other language that I won't mention, likely because I know them less.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anyway, I've been this language.",
                    "label": 0
                },
                {
                    "sent": "I've been used in particular for developing a lot of specific ontologies we can, which can be related to very general things.",
                    "label": 0
                },
                {
                    "sent": "You can imagine that there is an ontology about provenance.",
                    "label": 0
                },
                {
                    "sent": "OK, but get back without the rational for doing this.",
                    "label": 0
                },
                {
                    "sent": "Two years ago, and if someone told you I will do an ontology without about provenance, it would have had to explain you what you're talking about.",
                    "label": 0
                },
                {
                    "sent": "OK, you've got ontology about work like FL.",
                    "label": 0
                },
                {
                    "sent": "Bear with I like very much, so I mention it, but also some very more.",
                    "label": 0
                },
                {
                    "sent": "Concrete object like proteins or restaurants you've got.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this which is available, and so this could have led to a very lively knowledge ecosystem.",
                    "label": 0
                },
                {
                    "sent": "In which explicit knowledge can take his spot to do a lot of tasks.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So machines could take advantage of knowledge to correct it.",
                    "label": 1
                },
                {
                    "sent": "To provide you application tells you if the restaurant you where you want to go is open at that moment that OK, a very interesting application, but it may also help you, and if it's not open to suggest you another one.",
                    "label": 1
                },
                {
                    "sent": "It may help you to elaborate knowledge and I'm thinking about the semantic washing machine which was proposed by Soren Auer and Onions.",
                    "label": 0
                },
                {
                    "sent": "Lemon that is, for example using explicit knowledge in order to clean up the data in DB pedia and then to clean up Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "But if you a bit more ambitious, you so can also imagine that machine may contribute knowledge OK and so here you are in the realm of artificial intelligence machine trying to.",
                    "label": 0
                },
                {
                    "sent": "Mine relatively autonomous, autonomously knowledge, in order to suggest you some new one.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK Ann, well we're not there.",
                    "label": 0
                },
                {
                    "sent": "So the question is.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It went wrong.",
                    "label": 0
                },
                {
                    "sent": "So there may be a number of seeing.",
                    "label": 0
                },
                {
                    "sent": "It may be that the market was not mature, I don't know, but it did.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Not take off.",
                    "label": 0
                },
                {
                    "sent": "OK, So what went wrong is basically that we had all these technologies but we did not add the data to work on an.",
                    "label": 0
                },
                {
                    "sent": "It's really not terribly useful for some people.",
                    "label": 0
                },
                {
                    "sent": "If you don't have the data and so some very clever people at this idea of linked open data, for instance, and publishing more data on the web and.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That's what happened.",
                    "label": 0
                },
                {
                    "sent": "So if you.",
                    "label": 0
                },
                {
                    "sent": "Listen to the keynote lecture of Tim Berners Lee two years ago for the Turing Awards.",
                    "label": 0
                },
                {
                    "sent": "Basically say what is semantic web, this is schema.org and linked open under link open data Cloud.",
                    "label": 1
                },
                {
                    "sent": "OK, so yes, this is success.",
                    "label": 1
                },
                {
                    "sent": "Very good success of the semantic web, but.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mostly focused on on data an this is justified.",
                    "label": 0
                },
                {
                    "sent": "We really need this.",
                    "label": 0
                },
                {
                    "sent": "We need this.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this provides us with a lot of interesting applications, statistical data aggregation, and especially at the level of.",
                    "label": 1
                },
                {
                    "sent": "Country statistical data.",
                    "label": 0
                },
                {
                    "sent": "Semantic sensor network and no semantic coyote digital assistants, which take advantage of this and question answering, and of course such an knowledge search and knowledge graphics pre exploitation.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One of the things that I like very much is for example I can ask for Marie Curie's bonds.",
                    "label": 0
                },
                {
                    "sent": "Brother and I can.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Not for the same.",
                    "label": 0
                },
                {
                    "sent": "In French, this is changing all the day.",
                    "label": 0
                },
                {
                    "sent": "I took this yesterday and two days before it was different, but.",
                    "label": 0
                },
                {
                    "sent": "And the system is able directly to answer this question.",
                    "label": 0
                },
                {
                    "sent": "And actually when we started in 2000 working on Semantic Web.",
                    "label": 0
                },
                {
                    "sent": "If I would have been told that 20 years later and actually 15 years later we would have that, I would have signed OK.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The reason is that at that time I was not very optimistic about semantic search for two reasons.",
                    "label": 1
                },
                {
                    "sent": "Search was very, very accurate already.",
                    "label": 0
                },
                {
                    "sent": "OK and we were far away to improve on that.",
                    "label": 0
                },
                {
                    "sent": "And the second reason is that the major player in search.",
                    "label": 0
                },
                {
                    "sent": "We are absolutely not interested in explicit knowledge.",
                    "label": 0
                },
                {
                    "sent": "OK, so we would have to beat them directly and that would have been very difficult on the other side there was some new trends, web services OK and there was this semantic web services sings.",
                    "label": 0
                },
                {
                    "sent": "Which looks very cool because there was no services at that time.",
                    "label": 0
                },
                {
                    "sent": "Basically so it was very easy to beat them and I think semantic Web services is a very good idea.",
                    "label": 0
                },
                {
                    "sent": "But I don't know if they are semantic web services people here.",
                    "label": 0
                },
                {
                    "sent": "There is no session, yeah?",
                    "label": 0
                },
                {
                    "sent": "That's OK, it's doing plenty of things, so it's still following the good ideas.",
                    "label": 0
                },
                {
                    "sent": "This is a good example.",
                    "label": 0
                },
                {
                    "sent": "Do like Terry.",
                    "label": 0
                },
                {
                    "sent": "So there is no semantic web services at the conference anymore.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But these are good ideas and they remain good ideas.",
                    "label": 1
                },
                {
                    "sent": "So I think semantic web services maybe not web.",
                    "label": 1
                },
                {
                    "sent": "They will have another name, but they will show up later at some point, because being able to opportunistically select the service based on this description is something that has to be done at some point.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, So what happened is that we have all this data and we're and the use of this data is as permitted, something basically to unleash the power of machine learning OK, and to provide.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A lot of very impressive application.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is really a good thing already, so you can name a number of them behavior classification or object recognition, natural language translation relation discovery and I'm some of you are working on dragging this interaction, for example recommendation and search.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Leslie and so if the question is does that make the web more intelligible to machine?",
                    "label": 0
                },
                {
                    "sent": "I would answer definitely OK.",
                    "label": 0
                },
                {
                    "sent": "This is really, really really true.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "However.",
                    "label": 0
                },
                {
                    "sent": "Some of my colleague RB2 enthusiastic about this and they are in the room so they can answer.",
                    "label": 0
                },
                {
                    "sent": "So they said recently our fellow computer scientists can both benefit from the additional semantic constructor of the data available in the new web and continue to build on using this structure, creating a vicious virtuous circle.",
                    "label": 1
                },
                {
                    "sent": "I.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Actually, what circle are you talking about?",
                    "label": 0
                },
                {
                    "sent": "OK, there is no circle.",
                    "label": 1
                },
                {
                    "sent": "What?",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Happened at the moment is that we are a company will acquire giant data meshes OK, they required data from the interaction with their services.",
                    "label": 1
                },
                {
                    "sent": "OK, eventually this data is open, so of course what they do is is that is to learn OK and you can expect that they are learning knowledge.",
                    "label": 0
                },
                {
                    "sent": "But they don't share this knowledge.",
                    "label": 0
                },
                {
                    "sent": "This knowledge is it in their cillo and they are only interested into exploiting it.",
                    "label": 0
                },
                {
                    "sent": "OK, and actually you you think that you are the people who are able to provide knowledge to this machine but actually they are not interested in it?",
                    "label": 0
                },
                {
                    "sent": "OK, they are interested in several things like what you like, what you click on and what you buy and they will train their system on this.",
                    "label": 0
                },
                {
                    "sent": "And so the problem is that since this knowledge which is very efficient and very useful is sometimes not.",
                    "label": 0
                },
                {
                    "sent": "Explicit but also most of all not share.",
                    "label": 0
                },
                {
                    "sent": "It doesn't allow us to improve because no one can improve on it.",
                    "label": 0
                },
                {
                    "sent": "It can only come back to the data.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I found I did not knew the the book which was cited yesterday by the keynote talk, but I think the data centric revolution is exactly the the word to use.",
                    "label": 0
                },
                {
                    "sent": "Revolution means coming back to the starting point.",
                    "label": 1
                },
                {
                    "sent": "OK, this doesn't mean evolution.",
                    "label": 0
                },
                {
                    "sent": "You don't evolve.",
                    "label": 0
                },
                {
                    "sent": "You come back.",
                    "label": 0
                },
                {
                    "sent": "This is actually very accurate.",
                    "label": 0
                },
                {
                    "sent": "Keyboard key which is on this on this paper.",
                    "label": 0
                },
                {
                    "sent": "So if you think about what I started with, that is our civilization or civilization is based on knowledge evolution.",
                    "label": 0
                },
                {
                    "sent": "This is rather regulation.",
                    "label": 0
                },
                {
                    "sent": "OK, we are basically in some kind of dead ends which is.",
                    "label": 0
                },
                {
                    "sent": "A nice dead end, but we cannot build on that.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so the question is, what can be done about?",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That and two proposal that I will try to discuss very briefly, our science and putting knowledge evolution on the web.",
                    "label": 0
                },
                {
                    "sent": "That's OK.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We would be on time.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "So in science is a very obvious use case.",
                    "label": 1
                },
                {
                    "sent": "OK?",
                    "label": 0
                },
                {
                    "sent": "Because science is about improving knowledge, it's about knowledge sharing and knowledge evolution.",
                    "label": 1
                },
                {
                    "sent": "It is all science is also nowadays massively computer supported, so there is no barrier to introduce computer techniques within science.",
                    "label": 0
                },
                {
                    "sent": "It also faces some problem of its own.",
                    "label": 0
                },
                {
                    "sent": "Problem with credibility and you may have heard about reproducibility, crisis and also information overflow like people cannot read everything which is published at the moment and you may miss things and it may be a problem.",
                    "label": 0
                },
                {
                    "sent": "And actually, especially the last problem is a problem where computers are typically typically good at OK, so it would be nice to be able to help.",
                    "label": 1
                },
                {
                    "sent": "And last but not least, a lot of has been done already on a science, and even some Ant.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "E. Science.",
                    "label": 0
                },
                {
                    "sent": "There was very interesting tutorial on that on Sunday.",
                    "label": 0
                },
                {
                    "sent": "So this is.",
                    "label": 0
                },
                {
                    "sent": "Talking about good ideas, I don't know, but something I was doing and I it was published in 95 and the idea was that scientists would express formally their knowledge, the topic they were working on and theory they had about it and they will be able to submit it to.",
                    "label": 0
                },
                {
                    "sent": "Constant what I used to Co consensual knowledge basis OK and then in this conceptual knowledge basis you can take advantage of the fact that it is explicit and that it is formalized tutelo, but this is contradictory, which was what is there or is this redundant?",
                    "label": 0
                },
                {
                    "sent": "Or you should formulate this better in order to fit into the actual landscape.",
                    "label": 0
                },
                {
                    "sent": "And so it was the goal of the of the researcher to submit knowledge that will be accepted and it was based on the peer review.",
                    "label": 0
                },
                {
                    "sent": "Protocol OK, but this did not took off OK, we don't do that at the moment, but maybe someday we will do that or some other will do.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So as I said.",
                    "label": 0
                },
                {
                    "sent": "We can do semantically science nowadays, so I will try to give a small example of that.",
                    "label": 0
                },
                {
                    "sent": "So usually people start with.",
                    "label": 0
                },
                {
                    "sent": "There are people doing research and they write paper.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "1st paper site.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Papers papers may be able to describe experiments.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Experiments may be an alteration of another existing experiment.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the goal of this experiment is to test an hypothesis both.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The experiment, while the iPod is this, would be about some objects and the experiment will manipulate this object.",
                    "label": 0
                },
                {
                    "sent": "It may.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also use software and hardware.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And finally, it will produce data.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This data will support some results.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you can also use statistical tests in order to qualify the confidence.",
                    "label": 0
                },
                {
                    "sent": "The significance of the result that you have obtained OK.",
                    "label": 0
                },
                {
                    "sent": "So this is basically the representation of an experiment in a paper.",
                    "label": 0
                },
                {
                    "sent": "This is a bit more complex than that, but I want to elaborate on this.",
                    "label": 0
                },
                {
                    "sent": "So the point is that we already have a lot of.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ontologies which allows to do that.",
                    "label": 0
                },
                {
                    "sent": "OK, so all the technology that we have is able to do that and we have examples of projects which are about this.",
                    "label": 0
                },
                {
                    "sent": "This kind of things and when you are in this state.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can start to take advantage of this knowledge.",
                    "label": 0
                },
                {
                    "sent": "For example, is there a paper that contradicts what I'm writing in my paper?",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This hypothesis are I'm making.",
                    "label": 0
                },
                {
                    "sent": "Does it subsume or is it subsumed by another hypothesis that has been published?",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's my experiment is prone to refute my hypothesis or not OK, that is very important, because otherwise the experiment is not useful at all.",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And as a result, support or.",
                    "label": 0
                },
                {
                    "sent": "Contradicts the hypothesis.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All the tests apply to the result.",
                    "label": 0
                },
                {
                    "sent": "All this Red Arrows are application that.",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Actually requires knowledge to be implemented and there would be very useful for scientists.",
                    "label": 0
                },
                {
                    "sent": "Actually, for me as a scientist, that would be very useful for me.",
                    "label": 0
                },
                {
                    "sent": "There is some important points that could be used at design time or post talk.",
                    "label": 1
                },
                {
                    "sent": "So what I discribed is an experiment described in the paper, but it's not very good to think about that because once you have described the experiment in the paper, it has been carried out etc and you'd better know before if it's refute or not.",
                    "label": 0
                },
                {
                    "sent": "It's problem to refute or not the hypothesis.",
                    "label": 0
                },
                {
                    "sent": "OK, so it's interesting to have this at design time.",
                    "label": 0
                },
                {
                    "sent": "It's helps you to design your experiments.",
                    "label": 0
                },
                {
                    "sent": "It may be used to probe experiment registration, so experiment priority registration is something that as some people try to promote at the moment, this is, in my opinion a very good idea, but it may not take off because there is a lot of people that don't agree with that.",
                    "label": 0
                },
                {
                    "sent": "What is the idea is that when you plan to test something in hypothesis, instead of doing all the work and submitting a paper at the Journal, you will first submit.",
                    "label": 0
                },
                {
                    "sent": "The design of your experiment with the hypothesis and what you're supposed to do.",
                    "label": 0
                },
                {
                    "sent": "This has actually three benefits.",
                    "label": 0
                },
                {
                    "sent": "The first one is that the reviewer can tell you earlier that they don't like your experiment on why OK, and the corollary of that is that if they like it basically one they have accepted the experiment.",
                    "label": 0
                },
                {
                    "sent": "The paper is accepted.",
                    "label": 0
                },
                {
                    "sent": "This has another corollary, which is it goes against bias that we only publish positive results.",
                    "label": 0
                },
                {
                    "sent": "Actually, if the experiment is testing a relevant hypothesis and the result is negative, it is worth publishing OK, but.",
                    "label": 0
                },
                {
                    "sent": "If you submit very good improvement of a system and a knowledge Raptor I SWC and you show by experiment that it doesn't work very well, your paper will be rejected.",
                    "label": 0
                },
                {
                    "sent": "I can tell you OK so maybe this could be implemented as well in this Community, writes better with Ronald and conferences.",
                    "label": 0
                },
                {
                    "sent": "And there is a last point with experiment registration.",
                    "label": 0
                },
                {
                    "sent": "That I don't remember.",
                    "label": 0
                },
                {
                    "sent": "I would make come back on this later, but that's OK, but this is really a very, very nice idea.",
                    "label": 0
                }
            ]
        },
        "clip_82": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Moreover, what I presented only applies proven technology.",
                    "label": 1
                },
                {
                    "sent": "We don't really need.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "Paradigm change or whatever in order to be able to implement that.",
                    "label": 0
                },
                {
                    "sent": "OK, so as I.",
                    "label": 0
                }
            ]
        },
        "clip_83": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some people are doing this and it may be applied to other fields.",
                    "label": 1
                },
                {
                    "sent": "I mentioned that so people in mathematics are using more and more theorem provers, for instance, and they could use it a bit more widely.",
                    "label": 0
                },
                {
                    "sent": "But you can also think about observation over Sciences, which are a bit different than the kind of experiment that I presented here.",
                    "label": 0
                }
            ]
        },
        "clip_84": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of course, this is data also under the description itself is data, so it could be used through machine learning which could help you to clean up your information or mining some interesting fact from the basis of experiment that has been published.",
                    "label": 0
                }
            ]
        },
        "clip_85": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, and so I think for this kind of idea the really important thing is incentive.",
                    "label": 0
                },
                {
                    "sent": "OK, this is the obstacle for this to take off if people do not fill in, sensitize to do it, they won't do it.",
                    "label": 0
                },
                {
                    "sent": "And I can tell you, for example, for my work, I really would love to have all the tools for for doing it 'cause it provide me safeness.",
                    "label": 0
                },
                {
                    "sent": "OK, in what I publish.",
                    "label": 0
                },
                {
                    "sent": "OK I have more.",
                    "label": 0
                },
                {
                    "sent": "More.",
                    "label": 0
                },
                {
                    "sent": "I'm able to to have more insurance on the result that I'd get if I can test it more formally.",
                    "label": 0
                }
            ]
        },
        "clip_86": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so the last issue is back to evolution.",
                    "label": 0
                }
            ]
        },
        "clip_87": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the idea is that yeah, knowledge as to evolve.",
                    "label": 1
                },
                {
                    "sent": "It doesn't say it, it has to change.",
                    "label": 1
                },
                {
                    "sent": "I talked about scientific knowledge, but all knowledge is not scientific knowledge and it doesn't evolve in the same way.",
                    "label": 1
                },
                {
                    "sent": "OK, we've got Methodology's which have been elaborated for a certain level of safety, but we are.",
                    "label": 0
                }
            ]
        },
        "clip_88": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actually using knowledge even where if we are not sure of it, OK and it has to be evolved why it is being used.",
                    "label": 0
                }
            ]
        },
        "clip_89": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "One of the principles that you can take advantage of to consider this problem is cultural evolution.",
                    "label": 0
                },
                {
                    "sent": "Cultural evolution stems from anthropology.",
                    "label": 1
                },
                {
                    "sent": "It is basically natural evolution applied to culture and culture.",
                    "label": 1
                },
                {
                    "sent": "So people don't talk about culture generally in this domain they focus on some particular aspects like both designs, language, social structure and they looked at how it evolved under under.",
                    "label": 0
                },
                {
                    "sent": "And their history.",
                    "label": 1
                },
                {
                    "sent": "And this has also been applied to science.",
                    "label": 0
                },
                {
                    "sent": "It's called evolutionary.",
                    "label": 0
                }
            ]
        },
        "clip_90": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is dermology.",
                    "label": 0
                },
                {
                    "sent": "So there is a quote that I like very much from this recent book is a cultural fast Lane of cultural evolution bypassing the traffic jam of genetic evolution becausw the point of a number of people is that actually?",
                    "label": 1
                },
                {
                    "sent": "Genetic evolution takes quite a lot of time.",
                    "label": 0
                },
                {
                    "sent": "OK, not to other necessarily a mutation, but for it to spread cultural revolution becausw it spread more freely, like when talking in conference in conferences, then it's allows to evolve knowledge far more quickly than genes evolve.",
                    "label": 0
                }
            ]
        },
        "clip_91": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So natural evolution can be seen as an abstract control mechanisms based on tree principle, variation, selection, transmission.",
                    "label": 0
                }
            ]
        },
        "clip_92": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this has been implemented in computer already, so you have heard and or knows very well genetic or evolutionary programming or algorithm.",
                    "label": 0
                },
                {
                    "sent": "But there is also experimental cultural evolution that has been developed by some auto.",
                    "label": 0
                }
            ]
        },
        "clip_93": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "1st.",
                    "label": 0
                },
                {
                    "sent": "And so basically the idea of experimental curves or evolution is that you've got population of agent bearing knowledge.",
                    "label": 0
                },
                {
                    "sent": "OK, so when you apply this to knowledge, this is their culture and they are using their knowledge to interact with each other.",
                    "label": 0
                },
                {
                    "sent": "OK, this tell them how to interact, why?",
                    "label": 0
                },
                {
                    "sent": "What answer they will give 22 orders and at the issue of each interaction they will adapt their knowledge.",
                    "label": 1
                },
                {
                    "sent": "So this.",
                    "label": 0
                }
            ]
        },
        "clip_94": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Basically you've got agent like that.",
                    "label": 0
                },
                {
                    "sent": "They have knowledge which is actually the cause of their behavior.",
                    "label": 0
                },
                {
                    "sent": "Then have the pressure of the environment and the other agent through their behavior and given the result of the interaction then they will add up their knowledge and you run experiment with bunch of agent like that and you can observe out there.",
                    "label": 0
                },
                {
                    "sent": "Depending on the kind of adaptation that they do, the kind of protocol that you're using, the red.",
                    "label": 0
                }
            ]
        },
        "clip_95": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But you are, so it has been used for abstract culture by Accel Rd, Natural Language Evolution by Luc Steels, which did a lot of work on that topic and in this community by a number of other people to provide ontology alignment, evolution.",
                    "label": 0
                }
            ]
        },
        "clip_96": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But you can think about it more widely.",
                    "label": 0
                },
                {
                    "sent": "OK, now imagine that you have a search engine which is and enhance by, let's say by knowledge.",
                    "label": 0
                },
                {
                    "sent": "OK, like the one I presented before.",
                    "label": 0
                },
                {
                    "sent": "And since this search engine is using knowledge for answering this question and that.",
                    "label": 0
                },
                {
                    "sent": "It receives feedback the usual way he's able to know.",
                    "label": 0
                },
                {
                    "sent": "For example, if the answer that he gives accurate or not OK, so it could use also adaptation operator in order to adapt the knowledge that he has used in order to be more accurate than next time.",
                    "label": 0
                },
                {
                    "sent": "OK, and you can imagine this to be applied to meta search engine or community of search engine which interact with each other.",
                    "label": 1
                },
                {
                    "sent": "OK so it is not just agent in the lab but this is a kind of of application that would allow.",
                    "label": 0
                }
            ]
        },
        "clip_97": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Evil knowledge.",
                    "label": 0
                },
                {
                    "sent": "So what has to be done to do that?",
                    "label": 0
                },
                {
                    "sent": "There are two important things.",
                    "label": 0
                },
                {
                    "sent": "The first one is understanding the general principle of knowledge evolution, because we're not able to tell at the moment and the second one is its articulation of this with the semantic web in general.",
                    "label": 0
                }
            ]
        },
        "clip_98": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On the 1st aspect, this can be investigated theoretically by defining formally what is happening and finding the properties of the mechanisms.",
                    "label": 0
                },
                {
                    "sent": "Or you can test this mechanism experimentally, which is mostly be done at the moment.",
                    "label": 0
                },
                {
                    "sent": "It can also be done in relation with the social science and the humanities in order to have an idea of how it works for us.",
                    "label": 1
                }
            ]
        },
        "clip_99": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For the articulation with the semantic web, you really need the mechanisms in order to implement the adaptation of knowledge.",
                    "label": 1
                },
                {
                    "sent": "You really need the red white to it, because if you want to share knowledge, you should be able to publish it and you also need nonbreaking operability, interoperability.",
                    "label": 0
                },
                {
                    "sent": "OK, so we've got the four organizations, which is very well known, and when the user receives four page, this is not the end of the world.",
                    "label": 0
                },
                {
                    "sent": "OK, maybe it will fix this.",
                    "label": 0
                },
                {
                    "sent": "You or I maybe will look to another site in order to have the answer to this question.",
                    "label": 0
                },
                {
                    "sent": "So it should not be the end of the world when some knowledge expressed is inconsistent.",
                    "label": 0
                },
                {
                    "sent": "OK, we will should have something to cope with that.",
                    "label": 0
                }
            ]
        },
        "clip_100": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So it's time for me to conclude.",
                    "label": 0
                }
            ]
        },
        "clip_101": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Where are we?",
                    "label": 0
                },
                {
                    "sent": "So if you remember the diagram I showed before, basically the semantic web is still a baby.",
                    "label": 0
                },
                {
                    "sent": "OK, it's still using a lot too much data and not enough knowledge, so it's basically the.",
                    "label": 0
                }
            ]
        },
        "clip_102": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Point and the semantic Web may be used to fill sealers to the benefit of some commercial interests that learn knowledge but don't make it evolve.",
                    "label": 1
                },
                {
                    "sent": "Don't make it public, etc.",
                    "label": 0
                },
                {
                    "sent": "And it can be used to help contribute to the knowledge of the humanity both.",
                    "label": 1
                },
                {
                    "sent": "Maybe pursuit there is no problem with that, but maybe it could be interesting to be sure that following the first thread does not.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "Prevent following the second one.",
                    "label": 0
                },
                {
                    "sent": "OK, that would be my message.",
                    "label": 0
                }
            ]
        },
        "clip_103": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And on the positive side, remember.",
                    "label": 0
                },
                {
                    "sent": "Be optimistic.",
                    "label": 0
                },
                {
                    "sent": "A good idea remains a good idea and if you persevere, maybe you will see it happen.",
                    "label": 1
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_104": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So for finishing what I some of what I expressed here and in a different way is in a paper which is to be published in the January issue of the Semantic Web Journal.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}