{
    "id": "27r6di55irpniyb22ebf47g2dizqmuc3",
    "title": "Data Science for Social Impact: Case Studies, Challenges, and Opportunities",
    "info": {
        "author": [
            "Rayid Ghani, Center for Data Science and Public Policy, University of Chicago"
        ],
        "published": "Oct. 6, 2016",
        "recorded": "September 2016",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/eswc2016_ghani_data_science/",
    "segmentation": [
        [
            "So the C. Eventually it will work.",
            "So here's what I'm gonna try to do it in the morning.",
            "It's early, so wake up slowly.",
            "We're going to go talk about a lot of different things that will go a lot of breadth 1st and not death.",
            "So if any of the things you are interested in going deeper just to stop me and ask me more details and we'll go deeper into those things.",
            "So I'm going to talk about a lot of different examples around using all the things you've been hearing about the last few days on using data science machine learning.",
            "All the difference.",
            "This takes AI buzzwords.",
            "How do you use them to think about real problems that people have and how to start thinking about solving them?",
            "A couple of things to keep in mind.",
            "None of the work I'm going to talk about is mind if other people are doing it and I'm just talking about it.",
            "So lots of students and postdoctoral researchers on my team has been doing a lot of this work.",
            "And if you're interested in getting involved in any of this, let me know and happy to get you involved in any capacity you're interested in so the other couple things are.",
            "The the thing to keep in mind is everything.",
            "I'm going to talk about.",
            "I'll talk about the data piece in the data science and machine learning piece.",
            "But one thing to keep in mind is and we all know that is.",
            "That doesn't make any impact by itself, right?",
            "So we can do all the analysis we want on our computer is sitting on her nightclub.",
            "Nothing will change.",
            "And so it always requires some people afterwards to do something about it, and so it's as much our job to do the analysis as it is, then convince people to take that analysis and change policy, change some actions, and that's true for regardless of whether, in academia, in industry or doing these type of things.",
            "But you know, data is a small piece, it's a necessary piece, but it's not sufficient.",
            "OK, so I'll start with a few examples.",
            "Some of them will be US centric, some will be non USO.",
            "Start with a couple of questions first."
        ],
        [
            "This is an example that a lot of you should be very fine."
        ],
        [
            "But given all the media attention, which is police, an USO police people police officers typically.",
            "Over the last few years, you've seen and heard about lots of shootings from police officers.",
            "Lots of use of force, lots of injuries, and that's bad.",
            "Now what's worse is you would think that these police departments have not done anything about it at all.",
            "It turns out that police departments have."
        ],
        [
            "A system which called in early intervention system and with that system does is it raises alerts and raises a flag when a police officer.",
            "They think things with office is at risk of doing something bad.",
            "And we can define bad in a bunch of different ways, But for now it's not defined.",
            "That is what you would think if they are using too much force when the arresting somebody there arresting somebody illegally.",
            "If they're getting lots of complaints about them.",
            "If there is any sort of weapon use that shouldn't have been used.",
            "So if you assume that they have these systems in place.",
            "The problem is that systems don't work.",
            "They've been in place for many years and he's out there.",
            "Systems are built, so this is actually a screenshot from that system.",
            "One you can see it's Internet, so it's not a problem by itself, but it was probably built in the 80s after blood, and Marco felt there not meant stuff.",
            "But the way the system is really a few people saw 10 under table and thought what could be potential things that could predict police officers doing these things and say, well.",
            "Maybe it's a number of times they get complaints, so OK, let's do that.",
            "So they put in.",
            "If an officer gets 3 complaints in 180 day.",
            "Raise the flag and or it's if they've had three uses of force in a 90 day.",
            "Raise the flag, or if they.",
            "Taking too much time off, raise a flag.",
            "That's OK. That sounds about right.",
            "We built the system we move on.",
            "And that was it, right?",
            "So 10 years later, turns out the system doesn't work.",
            "And when you evaluate the system, but it turns out what it's doing is, it's raising a flag for pretty much when we looked at this about 60% of the police officers, which makes it automatically pretty useless.",
            "More importantly, even after pretty much saying yes to almost half or half the people, it's still only finding maybe 6070% so slightly better than random off the officers were going to go on.",
            "To do one of these things right so slightly, doing random and that's what most police departments in the US use.",
            "So when we started working with them, the first thing we want to do is we will look at let Steven first evaluate the system with the number I'm telling you they never knew these numbers.",
            "They just thought we built this so it must work.",
            "Let's keep going.",
            "So we've got their data.",
            "So we worked with a couple of police department's one in state Carolina, another one in different states you this morning and they realized they had a problem.",
            "They realized this wasn't working.",
            "They didn't know why.",
            "They didn't know what they should do, so we started working with them and got access to.",
            "All of their data internally about every police officer they have anything about their demographics, their age, address, sender ethnicity, every every behavior, every stop they made everybody this stop every arrest, every time a call came in and they were dispatched every complaint against them.",
            "Whether it was sustained and nonsustained everything they knew better.",
            "Police officer.",
            "Spend some time in the generating a bunch of features that we always do, and then build the machine learning system that would predict which officer is likely to be at risk of doing one of these things, and even the very first iteration of that, just because it was much more based on data will significantly better, so we're able to do.",
            "But cut the these false positives into about half so it would only raise flags at half the people and find about 20% more officers who are at risk.",
            "So even the first you know in the first few months we were able to get huge improvements just by using basic machine learning and building the system and starting from there.",
            "So that's one example.",
            "We can come back to come back to that.",
            "So second example I'm going to be."
        ],
        [
            "It is also strange phenomenon.",
            "the US which is lead poisoning.",
            "I don't know if you guys heard about a few months ago there was this water and lead and kids drank with water from these pipes and they were getting lead poisoning and that poisoning is really bad because."
        ],
        [
            "You get a lot of these horrible outcomes you have hearing loss, IQ loss, memory problems, learning those people.",
            "Basically, you know kids who get.",
            "There's a lot of studies that have shown kids who get exposed to lead.",
            "Early age they never recover after that.",
            "And it turns out in the US, every home built before 1978 has lead paint in their heads.",
            "Paint that has led and it's fine if lead paint stays in the wall.",
            "What happens is as well as get old lead paint starts coming down.",
            "So kids when they're young they crawl to pick up lead, dust it in that mouth.",
            "It goes into your bloodstream.",
            "Some point basically starts, you know.",
            "Being used instead of calcium and the biggest problem with these things is that none of these effects have reversible.",
            "Once lettuce in your bloodstream, you can't do anything to fix it.",
            "So how do these?",
            "How do governments deal with it?",
            "Well, they wait until somebody gets that poisoning because it's too expensive to go fix all the homes 'cause the way to fix it is you go into a home.",
            "You get all the feet out of all you scrape it off, you take windows and doors that are painted.",
            "You take them out, you put new ones in and that's too expensive because too many homes have that problem.",
            "So to be efficient, they wait until somebody gets less poisoning.",
            "And the way to do that is they typically have mandated blood tests that people just so if any or some age 1234 they do a blood test.",
            "They see if you have a high blood lead level, and if there's a high enough level.",
            "They will send somebody to your home to check for that, and there's that indebted drill into there and they find, of course defined lab.",
            "And if I'm glad, they try to figure out how to fix it.",
            "Now you can see the problem with that right?",
            "It's the problem is already happening.",
            "You're not preventing it.",
            "You providing it for future children who live in that home.",
            "So they basically use kids as sensors because they're really accurate sensors for left as they put it in their mouth, the blood level goes up and you can detect lead very efficiently, but it's pretty much useless for to save the kid again to do a lot of their credit after many, many years of doing this to figure out, maybe we can do it.",
            "Thanks for the obvious, but how do we do that so that I've talked a lot of cities that would do this and a lot of them don't do anything because they realized well if we do this it's going to be too late so let's not do anything.",
            "Some cities fix it afterwards, some things don't fix it.",
            "It's a very pretty bad right now.",
            "So so talk to them about how can you do it earlier.",
            "Same thing.",
            "Can we predict early which kids are going to get that poisoning before they get it?",
            "And so how do we do that?",
            "Well, we it turns out for a lot of these things the data already exists, and they had access to data for all the blood tests that have happened in the past 15 years or every every kid they had access to.",
            "All the inspections of homes that have happened in the past 15 years.",
            "So we could take that data and say, OK, let's take the kid who is just born at that point.",
            "They haven't had in time to get close to lead and figure out everything we know about Kitty.",
            "So who the kid is there a difference in gender, ethnicity, parents where they live?",
            "Have there been other lab tests in nearby in that home in the in that area have been positive in them?",
            "Another blood test, almost different things and predict what's the probability of this kid getting lead poisoning in the next few months.",
            "And if that probability is higher than a certain number, than the health Department goes and fixes the problem.",
            "It sounds simple, but getting to the first part of that was just trying to see can we do it accurately enough so they don't have to go and inspect every home?",
            "'cause that's the problem is they don't have resources to go fix every home.",
            "Because initially you could say, well, I can just find every building that's built before 1978 and just fix all of them.",
            "Well, it's too many buildings, then you can, and many of those buildings might not have kids in there, so that is fine as long as it's not around kids.",
            "So you have to 1st figure out where kids are.",
            "But even if you if you have a computer kid living in one of these homes, you may not be at risk because your behaviors may be fine.",
            "So basically we took the system we built.",
            "This thing predicted which kids are likely to and then started sending home inspectors to check for that page.",
            "So the what's happening right now is that's being implemented into the health Department.",
            "But more Interestingly, also implementing this into hospital systems.",
            "So the idea is when a pregnant woman goes into a hospital for a check up, the same system can predict when the kid if you're pregnant, the kids going to be born in six months, three months, two months, one month from now.",
            "That kid is at high risk of lead poisoning, so now the health Department has many more months available.",
            "Rated before as soon as you see that this is a high risk you have to go fix it and you can't really plan very well.",
            "So now that you have few months you can use this information to plan.",
            "Which homes do I inspect first, which means right later?",
            "Which ones will fix first?",
            "How many homes do I have to do?",
            "So now it gives you much more time because you're doing it much, much much, much, much earlier.",
            "And right now we're sort of again the one of the things.",
            "Think about it, this these type of things.",
            "You know what you're looking at is you're never going to be able to fix every home, at least never.",
            "As you know, in the next 1020 years.",
            "So you're trying to figure out is if you can only fix 2003 thousand 4000 whatever number of homes, how do you best pick the ones that are most rich?",
            "And for that, it's one of the things you know when you're looking at your.",
            "When you're building machine learning models and one of the things you're using to evaluate them is what's your accuracy?",
            "And in this case you don't care about accuracy, right?",
            "Because 80% of the homes you don't care about because you can't get to them.",
            "And also they don't matter because they're not going to have lead paint in there, so you only care about the small number at the top.",
            "And how do you really measure those things will come back to that a little bit, so that's that's another prob."
        ],
        [
            "OK, so.",
            "A different problem which and this is not just a problem in the states, but it's also a problem in a lot of countries where students need a lot of summer schools to finish something in time, and so in the US, for example, 3035% of people who go to secondary school high school don't finish at the same time.",
            "Alot of programs exist to help them finish.",
            "This is a lot of programs were here that are.",
            "Designed to help people finish school, there are lot of students not finishing.",
            "The problem is that it's really hard to lot of universities and this is high schools in the US to match those people who are the people at risk.",
            "So what they typically do today is very similar to the.",
            "System that I talked about by the Police Department that sit down and say OK what?",
            "What could be an indicator?",
            "So OK if they have if they don't have good grades, that's probably an indicator.",
            "If they miss school a lot, that's probably an indicator.",
            "They are getting a lot of disciplinary actions against them.",
            "That's probably indicator, so they come around and sit down and come up with new three things and then build a system based on that.",
            "And you know, obviously you can imagine you know if you actually use real data.",
            "You could potentially do a lot better, and so here is some."
        ],
        [
            "Results when you start using real data, right so?",
            "If Y axis so X axis is.",
            "If you took all the students and build a model that predicted a probability of not graduating from high school and rank them, X axis is the most confident student living in your listing.",
            "This is student is very very high risk, less less less.",
            "Less rich about this rank list until you're going down this list and on the Y axis is recall just percentage of kids who are going to drop out.",
            "What percentage of those?",
            "Have you captured in your top whatever percentage range right?",
            "So for example, this line here.",
            "Over here it says if you target the top 5% of the kids in your prediction, you will be somewhere between 15 and 35%.",
            "You will get 15 to 35% of the kids who are going to drop out and these different lines are at what grade.",
            "So obviously the day before you're supposed to graduate, you can predict very accurately if you're going to make it or not six years before, it's much, much much harder so, so this is in an 8 year, 60 or 7 eight.",
            "Into the US you finish in year 12, right?",
            "So this is 2 year before and we can sort of see is if you build a system that is kind of this basic one.",
            "It's not a horrible system, we know.",
            "We know that kids who don't get high grades or missed school a lot who get disciplined enough they don't do well, and so if you build that system, you say you can find you know 45% of the students at risk.",
            "If you use this approach machine learning approach when you see is you know you can get if you sort of take so the schools were working with.",
            "They said that they have access to resources that they can put 15% of the kids into programs to help them.",
            "So if you target the top 15% of these kids, you know if you had a random system it would do 15% recall, right?",
            "But we don't want to compare to random system because these students these schools are not doing random things there somewhat smart.",
            "So they're coming up with this number.",
            "But you notice here what you can do is even at 6th grade to six years before graduation, you can capture about 50% off of these students, and then if you go up to the 10th grade, you can get up to 60%.",
            "But what's interesting is if you sort of look at these these things right.",
            "So what you can do is.",
            "If you were over here in 10th, you could get 125 off the 209 students you wanted.",
            "You want to capture.",
            "But using this type of approach you can get the same students several years earlier, so you're not necessarily more accurate.",
            "You're just three years earlier, and that's as important as being more accurate, because now you've got three years to work on these students.",
            "So another way to think about these things is.",
            "You are, you can sometimes measure how accurate you are, and that's useful, but for a lot of these real interventions where you're trying to change behavior, accuracy is not the only metric you care, but you also want to care about other things.",
            "How much time does this teacher have to work with that three years at the same level of accuracy is a long time, and it's much more important to give them the time to fix these problems because you could detect everybody right here and there's no use.",
            "It's completely useless, so you want to be able to do this do this early.",
            "So another problem this question so.",
            "If you would just identified the student, so you have probably had some user able to explain the reasons right?",
            "Yeah, yeah I'll come back to that a little bit, but.",
            "All these systems, one of the recurring theme is you're making fairly important decisions about people's lives, so you don't just want to tell them this person is going to drop out, so do something about it or this police officer is going to shoot somebody, do something about it.",
            "You want to give them a little bit more information about why that's happening now.",
            "You may not be able to tell them why when you have different ways of explaining your predictions and so will come back to come back to that."
        ],
        [
            "Thanks so this is.",
            "Narobi, Kenya.",
            "And so there's some work we've been doing with the company there that puts these toilets in place, so this is a lot of these places.",
            "This is kind of the.",
            "Urban settlements in in Kenya and there is no sanitation, right?",
            "There's no, there are no toilets, and people usually, either on the street or go in a corner somewhere.",
            "Put in a bag for the bag over somewhere else.",
            "And so with this company is trying to do is there are making these portable toilets and there are getting individuals, small stores, schools, different organizations to to take these toilets, install them.",
            "And then they charge people very small amounts of money to actually use those toilets.",
            "And the idea is that what this company does is they manufacture these toilets.",
            "They sort of franchise them to the small business owners to individuals.",
            "People use these toilets of the local businesses get this money from them, but in this company goes in and they support taking the waste out of these toilets.",
            "Take him to a central facility.",
            "And turned into fertilizer and sell the fertilizer to finance building these toilets with this whole thing of gift toilets.",
            "And the people who actually buy them, they have to support it through the payment and then the fertilizer supports the rest.",
            "It's right now they have about 700 toilets and they've been operating and the obviously doesn't need for many many many many more.",
            "The thing that's stopping them from growing is kind of silly.",
            "It's right now.",
            "In order to do the biggest cost for them is to MTV's toilets because they have to send a person to the if the toilet is full, nobody can use it, right?",
            "It's containing so these containers inside these toilets and fill them.",
            "Nobody can use it.",
            "If it's until what they do today is they basically send a person to every toilet every day.",
            "That's sort of normal.",
            "Different baseline is well, we need to go pick up every toilet and you can imagine here sometimes.",
            "So yeah, come back so their biggest bottleneck is that if they want to build more toilets, they have to hire more people.",
            "And they don't make enough money to hire more people, so they just have 700 toilets.",
            "But they'd like to go is expand much, much, much more to provide more toilets and they need more people, because again, they're doing it.",
            "You know, once a day, every day, which means if they doubled the number of toilets have doubled.",
            "The number of people, so it's in a very linear relationship.",
            "And you can imagine you're thinking about it.",
            "I'm just trying the problem.",
            "Well, some toilets if you go and empty a toilet when it's when it's not full, you're wasting resources.",
            "You shouldn't pick it up, you can skip it.",
            "You can go two days later, three days later.",
            "You have to go every four days because once this stuff has been sitting in there for four days, it becomes unusable that also the Max is 4 days, but anywhere in one in four days.",
            "You could figure that out.",
            "So what we did with them was.",
            "So we built a system where it does a few things, step one.",
            "It basically predicts how full each toilet will be on a given day, every day, right?",
            "So they want to make to weekly schedules for pick up off of these toilets.",
            "The second thing it does is then based on those predictions weekly.",
            "Usage it then comes up with a pickup schedule for each of the toilets, and it turns out that again using very simple things you can get to a point where you can actually.",
            "Reduce the number of pickups by about 2 1/2 times for a given week, and So what that does is."
        ],
        [
            "Other than two pretty easily operate 2 1/2 times more toilets, but more importantly it allows them to serve about 45 thousand at the same cost.",
            "40,000 more people at the same cost they were doing before, so there's an obvious technological solution as well.",
            "It will think of, namely sensors to give some sort of microphone.",
            "Yeah, so it's an obvious solution that we also thought about.",
            "Like you know, why don't you put sensors like?",
            "Of course, you guys are so smart sitting in the US telling us these obvious things like, well, we put sensors in there.",
            "And if you put sensors in that environment, they degrade very quickly, so they haven't been able to put a bunch of different sensors in that container.",
            "It's not reliable, and it just failed.",
            "So they are in a parallel path of putting trying to figure out better sensors, but all the sensors have tried.",
            "They haven't been able to know that was the same idea, I think.",
            "Oh yeah, we didn't think about that.",
            "Thanks for that.",
            "Well, you know, just in case you didn't think about it like up here are sensors.",
            "Yeah, we've talked about a lot of these, but I mean, even when even when you put sensors, you still have to do.",
            "Some.",
            "In this you can now be little bit more efficient because you can still plan slightly longer term based on sensors, so yeah, but would be would be interesting would be what the direct comparison between the predictive analytics and the extra 1 graph.",
            "Yeah yeah.",
            "And right now there are a lot of other something I'm kind of glossing over.",
            "The details are a lot of times when you look at the data.",
            "It turns out you know a lot of times there are.",
            "They pick up so that is supposed to pick up these.",
            "Containers and some containers.",
            "You know you're going in his rural areas for their putting things in the container, putting it on a wheelbarrow and then taking it back all the way.",
            "Sometimes we found in the data like 0.",
            "No wait, no wait, no wait.",
            "No, it is was just it not be used like it was being used.",
            "So what happened with 00?",
            "They had too many different containers so they consolidate it all into one and then left the empty ones back there so Windows wait, it was zero but it wasn't 0 so.",
            "You get all these errors in the data even with even these predictions are.",
            "Or not, as good as they could be, because your data you're getting or somebody just skipped to pick up.",
            "They were supposed to go pick this up, but I don't want to go there today.",
            "So you have or they didn't.",
            "They weren't able to bribe the guy who was supposed to let them go through this place, so there's a lot of these things that happen that create these issues.",
            "So yeah, there's certainly once you are doing some pilots with different sensors.",
            "Once you start doing that, you can see how well you can do.",
            "So coming back to a more first."
        ],
        [
            "Problem.",
            "Where you have sanitation and water pipes.",
            "So this is this is just again US there about quarter million pipes that break every year.",
            "So and that happens in pretty much every every talent.",
            "Every city where there is sanitation and there is water.",
            "Water pipes break and water pipes break.",
            "You don't have water and whoever is running the city or the town has to go in and dig up the street and fix the water pipe.",
            "And then keep going right.",
            "So it turns out that right now pretty much most cities, the way they deal with this problem is very much like every other problem we've talked about.",
            "Is there wait until the pipe works and then they go dig up the road and fix the pipe?",
            "So we're working with a small town in New York State which doesn't have a lot of breaks, but it has 180 breaks a year, which is, you know, every other day there is some some water break an again.",
            "The problem.",
            "The way they deal with it is again they go and just wait until somebody complaints.",
            "They go and look at the problem to fix the problem and then they move on and that obviously costs a lot more money to fix these things after their broken, but not just money.",
            "It's also if you're living in a in an area where there is a water break, you don't get water and you don't really have tanks in your home to store those words.",
            "You kind of.",
            "It's not the best thing now, at least you're lucky you have sanitation and water, so can't complain too much, but when we started doing this work that one of the challenges was, the idea was again, can we predict which?",
            "Water pipes are likely to break in a city, and if you can predict that one can you go fix them in advance for two, what often happens is that you're already planning on doing work on the ropes.",
            "There might be a re paving of the road coming up.",
            "There might be other things that are already happening, so if you had information on this road is more likely to break in the next three years and your order this pipe in this street is likely to break you already doing some work.",
            "How about you dig up a little bit more and check?",
            "And fix it instead of waiting till three years later.",
            "So now this type of thing allows you to coordinate with the roads with other things and start planning.",
            "How do we?",
            "How do we do these things better?",
            "So in this case, what we ended up doing?"
        ],
        [
            "Was when we build this model, haters will be found right if we took our top this this city had about 5000 city blocks in the US.",
            "You know, it's typically a grid system.",
            "When you have these blocks, so $5000.",
            "If we took our top 150 predictions, the top most confident predictions which they found 30.",
            "Two of those had ended up getting getting brakes, right?",
            "That was funny.",
            "They just got got.",
            "Email last night.",
            "I was just I just copied and pasted it here.",
            "So we for this year we made a list.",
            "We sorted everything.",
            "We gave them a list and they just came back and said guess what off the top five predictions, two of them just broke last week, which is bad because we told them but good because they actually believe us they said oh and seven of the top 50 have already broken in the last couple of months and five were off by another block.",
            "And so it looks like you guys were right, so hopefully you know these.",
            "Again, the reason is sort of showing this is that sort of how you want to validate these type of systems right?",
            "Because of the things I've been showing, I've been only showing you the first piece, which is I have historical data of 10 years of data I can hide.",
            "The last year and predict on that here.",
            "Or I can hide the last two years and predict on those years.",
            "But that's not necessarily the best because you still have changes that happen in the future that a lot of things are not stationary, so we want to be able to do is predict for the actual next year and see how accurate you are.",
            "And often would you want to do is is randomized control trials right?",
            "So you are looking at this.",
            "One is an easy problem because to evaluate as you predict which pipes are going to break and you can.",
            "You can watch them break for a year, but for other things you actually want to be much smarter about.",
            "You want to compare with their existing approach so they sound like system approaches.",
            "I wait until they break, but if my existing approach was I'm going to see which pipes have a lot of traffic going near them.",
            "Then you want to compare with that.",
            "So my so as you were.",
            "Talking to said, I was thinking about the ethical issue with no with policemen.",
            "So so do you have it?",
            "Also generally thinking to cope with situations like yeah, let me let me come back in after 2 minutes on that.",
            "For example, that I'll come back to, come back to the interpretation, and at the color, those are the two things I want to talk a bit more about."
        ],
        [
            "So slightly different.",
            "Another example is this is from work with government in Mexico and one of those sort of things that message is about half the population in Mexico is below their level of poverty.",
            "And one of the challenges they face which they have a large number of programs.",
            "So they have this Ministry of Social Services called set this whole that is designed to sort of give people to social services they need.",
            "Except they have sort of two problems there.",
            "One is they don't know who's eligible for what services, and sometimes people themselves don't really know who they are, what they are legible for because there all of these different programs, so they think there are millions of people who are eligible for a service.",
            "Whether it's health care, whether it's some sort of subsidy in the House, who are not getting it on the other hand, they also know that there are people who are under reporting their income.",
            "A.",
            "You know, in order to qualify for this you have you.",
            "Can you have to make up to 20,000 faces, but they're saying, well I only make 5000 so there are people who are not getting the services they need because they don't know.",
            "But then there are people who are getting services that they shouldn't be getting and so the problem they came to us with was can be identified.",
            "Both of these people.",
            "Can you give me a list of people who might be at risk of not getting these services that they should be eligible for?",
            "And can you also help me find people who are getting these services so I can go and validate that and find more information about them?",
            "And see if I can swap right?"
        ],
        [
            "Phone was in both of those cases.",
            "For example we found.",
            "That about so this is again, this is this has been validated yet, so this is an initial we found about 7 million people who were part of these different programs as a meal and health and education and home subsidies and other infrastructure subsidies that are potentially eligible for services that they're not getting.",
            "So what the ministry is doing right now is doing a sample of this and going and talking to them to figure out how much of this is actually true.",
            "And same for the other way around, where we're finding these people may be under reporting that income, they're going to go and add a few more questions in a questionnaire they go for and get.",
            "You don't want to deny them right away, right?",
            "As computer says something questions come up is the computer says this person is at risk.",
            "This person may be under reporting their income.",
            "Cut off all their services.",
            "You don't want to do that.",
            "So you want to give a little bit more information to the person making that decision so they can go deeper and ask them more questions to verify some of their information.",
            "Let me skip this one and come to the last example when."
        ],
        [
            "Give is so.",
            "Again, This Is Us.",
            "There are a lot of people who are sort of stuck in jails and prisons in the US, and then you escorted off all the developed countries just puts too many people into jail and one of the things that happens once you're in jail, then you're much more likely to go into jail again.",
            "So there's people who keep getting stuck over and over and over and over again.",
            "And it turns out when you look at the data more, you find that the people who are spending a lot of time in jail.",
            "They are also interacting with government systems earlier, so there's."
        ],
        [
            "Two systems I think about.",
            "One is an homeless shelter, says homes.",
            "Lots of homeless people.",
            "And they go into homeless shelters and that's one place where a lot of people who end up in jail there in homeless shelters.",
            "Or there are these mental health facilities.",
            "If you have mental health problems, you again interact with the government somehow through those systems.",
            "So the hypothesis on this project that we're doing with several different cities in the US is if we can identify who those people are and give that information to the people dealing with them in the homeless shelters in the mental health facilities in hospitals.",
            "They can do something about it at that time before they end up in jail.",
            "So right now when somebody goes to a mental health facility, they get somebody to talk to them and they try to fix their immediate problem.",
            "If they knew that they were 40% likely to go into jail in the next year, maybe they can talk to them and try to prevent that, right?",
            "We don't know if it's prevention is possible or not, but we know that if we can identify, we can start thinking about whether we can prevent those or not, and that's something to keep in mind for a lot of problems.",
            "Talked about, right prediction is only one part.",
            "After gold prediction is only I can identify, you are at risk and if I can change that then it's pointless.",
            "So I want to be able to make sure that I predict identify it, but then work on interventions that can actually change something in the future.",
            "So here we're doing some early stuff on identifying these people and then working with the hospitals with the homeless shelters at the mental health facilities to see.",
            "Can we prevent these people from getting in there?",
            "And this is some very early work we do."
        ],
        [
            "With one city we found that you know if we flagged.",
            "If we just took the top 200 people in this case.",
            "And.",
            "Intervened and then told somebody about them, we would end up getting."
        ],
        [
            "About 50% of them were going to go on to jail in the next year.",
            "And they were going to stay in jail for about 7000 days combined, right?",
            "So even that simple small number if we just took 200 people in this entire city.",
            "100 of them are going to go on to jail and then it's gonna be 7000 days.",
            "So if you can do anything about this it affects a lot of people and can potentially make outcomes much, much, much better for a lot of these people.",
            "Predicate in the US citizen prisons understand I've actually privatized, so you have more industry and their interest is not is not prevention.",
            "Their interest is getting people into jail and getting the money right?",
            "So this is not.",
            "This is the interest of the city in the state is to prevent people because they don't want to pay them either.",
            "So whether you care about humans or about money and that's one of the one of the things you have to do in these situations, you talking to governments.",
            "Depending on the government, sometimes they care about people.",
            "Sometimes they care about money.",
            "For these, for this I think it's both.",
            "So anytime you prevent 7000 jail days, you help people obviously.",
            "But you also save a lot of money and so that's the thing you have to convince them for.",
            "But and the other thing is the private prisons have just been banned last month.",
            "Yeah, so there are no more private.",
            "Announcing then stock prices.",
            "So there are no good, no more privatized prisons.",
            "But you're right, that's that's a huge problem there right now.",
            "Trying to us.",
            "Sorry you know the US.",
            "Yeah, that was just lost.",
            "Correct?",
            "Open calendar.",
            "But isn't 7000 base with a lot right?",
            "This is my people.",
            "It's 100 people altogether.",
            "It's in the 100 people in the next year combined, or two out of 36,500 days.",
            "Would have been there or about us things about time, but the reason we should have this number is important is that's what allows them to figure out the cost savings is they're paying ridiculously, and so you convince them in both ways, right?",
            "Hundred people.",
            "Then if this 120.",
            "OK, so.",
            "So a couple of you know, as we're talking about all these different."
        ],
        [
            "Things of one of the things that we think about is these problems, all sort of fit into these templates of what I sort of like.",
            "Data science problem templates that are common across these types of problems and social impact, but also industry problems and other problems.",
            "So the first one we talked about was, you know, the lead poisoning it.",
            "Can I detect who's going to get that poisoning early?",
            "And that's a problem we deal with all the time, not just in these situations, but pretty much everywhere, right?",
            "So can I detect something early.",
            "And those are early warning systems that we built for different types of things.",
            "We do it in the corporate world can detect, you know if some machinery is going to break.",
            "Or can I detect if somebody is going to not be a customer in the next 2 years.",
            "Going to detect that early so I can do something about it right?",
            "The second one is sort of this, which I have.",
            "Water pipes I've got 500,000 water pipes in the city.",
            "I can only do something about 50 of them, 5000 of them, 10,000 of them.",
            "I have 300,000 homes in a city or in the country.",
            "I need to inspect them for lead hazards, but I can only have budgets doing inspect 3000.",
            "Which one should they be?",
            "So given my goal, how do I prioritize these type of things?",
            "That's another common problem that keeps coming up.",
            "The third one is slightly different than we didn't really talk about it just for some work with again the government of Mexico on maternal mortality where they have a very high maternal mortality rate compared to other countries.",
            "They couldn't figure out is we have a lot of policies we can change.",
            "It could be that people are not there is maternal mortality because the hospitals are too far or clinics are too far or because they don't have the right equipment in there or because they're not taking the right.",
            "They're not going to the hospitals or they're going, but they're not getting the right care, so they couldn't figure out which policies should be changes.",
            "The government should be building more of them.",
            "Should we build them in certain places?",
            "Should be changed?",
            "Or transit infrastructure?",
            "Should we change insurance?",
            "Policy is how do we do this thing so by use data will be able to do is narrow it down to three or four as opposed to 50 possibilities and come up with here.",
            "The four policies you might want to experiment.",
            "And then they designed experiments over the next two years would run those experiments and see which policy is actually have an impact.",
            "And that's another sort of template of I have access to a lot of policies, model ways to do something I don't have definite data on.",
            "It's not a prediction, it I need to figure out how do I narrow it down to a smaller number?",
            "That I can then experiment with and validate and see which one is actually causing this problem.",
            "The 4th one is pretty common in most places where people often do things.",
            "Cities, companies.",
            "It's not like they all have a plan and they do something more into plastic.",
            "They try a lot of different things, and once those things have happened, they come back into what impact did that have?",
            "So they might increase bus lines in the city and it's not like they had a big plan of, you know, here's what's exactly going to happen, but they changed bus lines and now they want to know how did that affect.",
            "The people how did that affect jobs 100 affect retail 100 affect Commerce and so this is a common problem.",
            "Again it comes back where I change something.",
            "Can you help me evaluate the impact will so I can then figure out what to do in the future.",
            "The last one is little.",
            "Particularly when they're talking.",
            "So for example, this one is a problem we've been working with.",
            "A lot of government agencies on matching employers with employees, people who might have certain skills, and people who need those skills in a job.",
            "How do you match those?",
            "And it turns out you know for a lot of people this is they don't have access to data that can help them do that, right?",
            "But this data often exists in.",
            "So when you're dealing with people in government and nonprofits and NGOs, data means rows and columns.",
            "If it's not a database table or spreadsheet, it's not data which is, we know in a lot of you are dealing with this right now.",
            "You know projects dealing with text, data, image data and video data and network data.",
            "So what they mean by this one is.",
            "A thing with rows and columns that I can then use to do this matching with.",
            "I know how to do that, I can't get those things into rows and columns, so we're here that is.",
            "Can we take resumes of people and extract the skills that they might have?",
            "Look at job descriptions and extract those things and then start giving people suggestions for how to fill those gaps and it's sort of much more than that, but that's kind of and so that's a common thing as well as trying to create information from them for organizations who can't really.",
            "Deal with messy unstructured text or videos or images and try to give them information that they can use to do this.",
            "The nice thing about these problems is they pretty much capture most of the problems you end up dealing with, and for each of these there are different things you have to care about.",
            "For example for the 1st."
        ],
        [
            "The detection early you want to know how early do you want to detect?",
            "Because the time depends on the intervention, right?",
            "If you need if the early means that the way to fix that problem is to.",
            "If that thing takes three years, it's a after school program and a kid needs to work on this for two years before that can be fixed.",
            "Well, then, two years is the minimum time you need, right?",
            "So detecting something three months early when you need two years is not very helpful.",
            "So how early do you want to detect it for what granularity?",
            "So you want to take it at the person level at a group level at the neighborhood level, and then how do you change that behavior is just about predicting.",
            "It's also about changing behavior so you can do that about for each of these problems.",
            "Figure out what are the parameters.",
            "What kinds of machine learning tools do you need?",
            "How do you evaluate them and how do you put them?",
            "You know, deploy them right.",
            "So.",
            "The other thing that happens across."
        ],
        [
            "All of these is you could have to start caring about some other issues than just building these models and evaluate these models.",
            "You care about a lot of other things, so the first thing that keeps coming up.",
            "Every problem I talked about pretty much every problem other than water pipes the data that you have about the data is about people and it's very sensitive data about a lot of people.",
            "It's about their health behaviors, it's about.",
            "Education behaviors.",
            "All of that is private, so you have to figure out how do you.",
            "You can't make any of this public.",
            "This will never be open, but it's extremely useful, extremely sensitive, so you have to make sure that you are able to deal with privacy concerns that people have, and often when you work on these types of projects, you have to be able to convince the people you're working with that you're you're complying with all your laws and all these different things, but you're also not doing something that would be violating their privacy.",
            "Same for security.",
            "You have to keep the lot of those.",
            "I'm going to skip the first couple of privacy security because.",
            "It's it's covered well in a lot of places.",
            "The third piece is sort of much more interesting here is because you know if you a lot of the examples that Ricardo was given yesterday.",
            "So when you're talking about if you Google and you show somebody.",
            "Don't.",
            "Most people don't really click on that?",
            "Why did I see this ad to see this?",
            "What things I do, you don't really.",
            "You know it's fine not to be able to explain to somebody which add you're seeing why?",
            "Because you see millions of acts in your lifetime, so you don't care bout interpretation as much because also if you get it wrong, who cares?",
            "You thought wrong ad you'll move on with life you'll buy something else but a lot of these things, the decisions we're making about people so.",
            "If you are taking a police officer off the street if you're.",
            "Going to a home and fixing their problem, you're choosing between this home at home and if you get the wrong home, you're hurting people.",
            "Same for the kids who might not be able to finish school.",
            "If you're picking this kid were over that kid.",
            "You're making it really important decision for the kid you're missing because you think this kid is going to be fine.",
            "This kid doesn't need help, so I'll give this kids problem.",
            "So in a lot of these cases, you're making important decisions about people's lives that could have a huge impact.",
            "And if.",
            "You can't describe to somebody why you're making that prediction.",
            "That person is unlikely to do something about it, and that could mean hurting the people you actually trying to help.",
            "So one sort of key constraint in these types of projects is that the model has to be able to.",
            "You don't have to explain the overall model, but you also want to explain every individual prediction you're making.",
            "Explain is is subjective, right?",
            "And there's no, there's no objective way to say.",
            "How do you explain?",
            "You can have different ways of explaining these things.",
            "And often this comes down to a user study of how does the person who's taking an action if I'm a school administrator.",
            "If I'm running the health Department and you say go fix, this game is at risk.",
            "Does my explanation help this person take this action in a much more confident way?",
            "If so, then it's a good explanation.",
            "If not, it's a bad explanation, so it's really about how do I convince a human to take action based on a machine recommendation that's sort of the goal of the explanation, right?",
            "The second goal explanation is is debugging.",
            "Because when you interpret this thing, you might realize that you're getting something completely wrong and you have to be able to buy.",
            "By explaining it, you as the builder of the system should be able to see and say, oh, that's something wrong here.",
            "That's why are these kids coming up as high risk?",
            "They don't look like they're high risk, so one of the key things that in all these systems important is interpretability.",
            "But the problem is that it also you know all of these systems because you're making important decisions.",
            "You want to be able to tell people, make it very transparent.",
            "But when you make a transparent, there is a risk.",
            "So in the police system I was talking about one of the things people that we've heard from police departments was that everybody knows what the rules are, right?",
            "It says if you have three complaints against you in a 90 day.",
            "You're at risk.",
            "If you have 3 uses of force and 180 days.",
            "You are at risk.",
            "So what they told us what people do is, you know, when they've had two complaints and it's been 81 days.",
            "They gave this is they either don't do this for those nine days.",
            "They don't do anything, so nobody will complain, or if they do things that try not to report those things.",
            "And so there because the system is completely transparent.",
            "It's very gameable and it gets gained a lot.",
            "So for these machine learning systems you want them to be transparent because they're making important decisions.",
            "But you also don't want them to be gameable, so an open sort of question is how do you make these systems, both transparent, interpretable but not gameable with anything you make the model complex, it becomes opaque, and it's hard to interpret, but it's hard to gain if you make it completely open and easy, and everybody understands it, then they can game it.",
            "So how do you do both of those things?",
            "Is an open question and the challenge that we need to figure out how to deal with.",
            "And the last issue, sort of like John bringing up is.",
            "Again, unlike you know, recommending friends on Facebook if you recommend it wrong, friend who cares arrangement maybe that was your X.",
            "That's OK, I'll just click on the X and ignore it.",
            "If I get the wrong add, you know it could have impact when people have shown a lot of things around.",
            "You know job ads for.",
            "For women minorities being lower salary than prevent and white people and there are there are some small impacts to people, but a lot of these things you want to make sure that anything that a computer is recommending.",
            "It's fair an ethical right?",
            "So fairness is hard because in a lot of these things these models are being trained from historical data.",
            "An historical data is traditionally human speaking bias decisions.",
            "So if you look at, you know banks giving out loans to people who historically they've given loans in a biased way.",
            "If they've only given notice to people who think they're going to be able to pay back, and it turns out that the people who were paying back well where only rich people or white people, then the model is going to learn those features and then start giving you suggestions to only give loans to people who are like that.",
            "And that's not what you want, but it's going to be the best performing system on historical data.",
            "So if you build these models just on historical data, you end up getting biases that keep propagating forward and never change.",
            "Almost as importantly, you also find that.",
            "So when you build a model you say hey, it's 89% accurate, but you have to look at it.",
            "It will be 11%.",
            "It's wrong on is that uniformly distributed?",
            "Is that across all kinds of people?",
            "Or is it mostly wrong about certain types of people?",
            "So for example, if certain types of people don't fill out some forms, that means you have missing values in your data about those people.",
            "You will have a higher proportion of errors under, so just like we'd run tests for, you know, like when you write good software you run.",
            "You run tests on software.",
            "When you build good models, you run test on models on accuracy and precision and recall.",
            "You also want to be able to run those tests for fairness and bias.",
            "Who are you making errors on?",
            "Who are you making predictions on in your predicted group?",
            "How many people are there from male and female?",
            "How many are in your data overall?",
            "How many people who are different colors but different backgrounds anytime you want to be not be unfair to any type of people, you want to be able to run those checks as soon as your model builds, right?",
            "You have this big thing set up where every time you build a model.",
            "Yes, it generates graphs for performance and accuracy, but it should also generate these statistics for for fairness.",
            "Ann and then make sure that people can actually audit those and then correct for those.",
            "So you can imagine in your classifier when you're building an SVM for your classifier, you're trying to deal with the margin.",
            "What about also dealing with bias in the same thing where this model gives me better accuracy but is slightly more biased because it's very easy to pick up on one Dimension 1 feature and say that's the one that matters, but you care about other things as well.",
            "And because of all these different things, what you sort of?"
        ],
        [
            "Realizes you know, we're sort of used to thinking, well, we really need mostly these two skills to solve these problems.",
            "If you can correct code and do some stats, you're done, and it turns out that to do all of those problems well, you know the server school is great.",
            "If it's giving you a little bit of you know of these, but you have to do all of these other things in order to actually solve any of these problems, you have to know how to start formulating a problem, and you guys have struggled with that little bit of debate when you're defining your projects, that's.",
            "Really important skills, probably the most the most important skill you need to have.",
            "You know more than because you you can have all of these skills, but then you need somebody to tell you what problems to solve, right?",
            "So you need to know how to define a problem.",
            "And in my experience, like that's the scale that.",
            "Most people don't come out of, you know, from from school, right from grad school.",
            "So if you know how to find a problem, you have to know how to communicate both when you start solving the problem, because you convince somebody this problem is where it's solving.",
            "Once you've solved it in to convince them to use it.",
            "Because all the work you did, somebody has to be able to use this thing, otherwise it's pointless, right?",
            "You have to convince them about that.",
            "You have to understand the ethical and legal issues because you have to convince it all again at least problems to allow you to.",
            "Solve this problem again and that means understanding what the legal issues are and being able to talk about ethics and about public policy with these people who are making these decisions.",
            "And then once you build these models over here, you have to know how to run an experiment.",
            "100 design an experiment on your computer with humans, typically to test and validate whether this thing works or not, and a lot of us sort of ignore these things over here because we said we live in this world.",
            "We know it's like we keep predicting, predicting, predicting and then we watched those predictions come true.",
            "Whereas people over here try really focused on often changing behavior, causal inference and changing things, but often agnostic too.",
            "I know what's going to happen.",
            "Maybe I should use that information to change behavior so there's a lot of sort of work at the intersection of these things.",
            "That's that's really interesting.",
            "That needs to come together.",
            "So we had a lot of this work that we talked."
        ],
        [
            "Initially started off in a summer program that I do call data science for social good basically is.",
            "Kind of like this summer school, but three months where we get mostly PhD students from.",
            "From these three areas in computer science and statistics and math and econ and sociology and public policy and engineering and physics, and they come together for three months.",
            "Working teams, 3, four on these types of projects all summer.",
            "So that's when I had happy to take questions in.",
            "The.",
            "In the negative, 2 minutes that I have so thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the C. Eventually it will work.",
                    "label": 0
                },
                {
                    "sent": "So here's what I'm gonna try to do it in the morning.",
                    "label": 0
                },
                {
                    "sent": "It's early, so wake up slowly.",
                    "label": 0
                },
                {
                    "sent": "We're going to go talk about a lot of different things that will go a lot of breadth 1st and not death.",
                    "label": 0
                },
                {
                    "sent": "So if any of the things you are interested in going deeper just to stop me and ask me more details and we'll go deeper into those things.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to talk about a lot of different examples around using all the things you've been hearing about the last few days on using data science machine learning.",
                    "label": 1
                },
                {
                    "sent": "All the difference.",
                    "label": 0
                },
                {
                    "sent": "This takes AI buzzwords.",
                    "label": 0
                },
                {
                    "sent": "How do you use them to think about real problems that people have and how to start thinking about solving them?",
                    "label": 0
                },
                {
                    "sent": "A couple of things to keep in mind.",
                    "label": 0
                },
                {
                    "sent": "None of the work I'm going to talk about is mind if other people are doing it and I'm just talking about it.",
                    "label": 0
                },
                {
                    "sent": "So lots of students and postdoctoral researchers on my team has been doing a lot of this work.",
                    "label": 0
                },
                {
                    "sent": "And if you're interested in getting involved in any of this, let me know and happy to get you involved in any capacity you're interested in so the other couple things are.",
                    "label": 0
                },
                {
                    "sent": "The the thing to keep in mind is everything.",
                    "label": 0
                },
                {
                    "sent": "I'm going to talk about.",
                    "label": 0
                },
                {
                    "sent": "I'll talk about the data piece in the data science and machine learning piece.",
                    "label": 1
                },
                {
                    "sent": "But one thing to keep in mind is and we all know that is.",
                    "label": 0
                },
                {
                    "sent": "That doesn't make any impact by itself, right?",
                    "label": 0
                },
                {
                    "sent": "So we can do all the analysis we want on our computer is sitting on her nightclub.",
                    "label": 0
                },
                {
                    "sent": "Nothing will change.",
                    "label": 0
                },
                {
                    "sent": "And so it always requires some people afterwards to do something about it, and so it's as much our job to do the analysis as it is, then convince people to take that analysis and change policy, change some actions, and that's true for regardless of whether, in academia, in industry or doing these type of things.",
                    "label": 0
                },
                {
                    "sent": "But you know, data is a small piece, it's a necessary piece, but it's not sufficient.",
                    "label": 0
                },
                {
                    "sent": "OK, so I'll start with a few examples.",
                    "label": 0
                },
                {
                    "sent": "Some of them will be US centric, some will be non USO.",
                    "label": 0
                },
                {
                    "sent": "Start with a couple of questions first.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is an example that a lot of you should be very fine.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But given all the media attention, which is police, an USO police people police officers typically.",
                    "label": 0
                },
                {
                    "sent": "Over the last few years, you've seen and heard about lots of shootings from police officers.",
                    "label": 0
                },
                {
                    "sent": "Lots of use of force, lots of injuries, and that's bad.",
                    "label": 0
                },
                {
                    "sent": "Now what's worse is you would think that these police departments have not done anything about it at all.",
                    "label": 0
                },
                {
                    "sent": "It turns out that police departments have.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A system which called in early intervention system and with that system does is it raises alerts and raises a flag when a police officer.",
                    "label": 0
                },
                {
                    "sent": "They think things with office is at risk of doing something bad.",
                    "label": 0
                },
                {
                    "sent": "And we can define bad in a bunch of different ways, But for now it's not defined.",
                    "label": 0
                },
                {
                    "sent": "That is what you would think if they are using too much force when the arresting somebody there arresting somebody illegally.",
                    "label": 0
                },
                {
                    "sent": "If they're getting lots of complaints about them.",
                    "label": 0
                },
                {
                    "sent": "If there is any sort of weapon use that shouldn't have been used.",
                    "label": 0
                },
                {
                    "sent": "So if you assume that they have these systems in place.",
                    "label": 0
                },
                {
                    "sent": "The problem is that systems don't work.",
                    "label": 0
                },
                {
                    "sent": "They've been in place for many years and he's out there.",
                    "label": 0
                },
                {
                    "sent": "Systems are built, so this is actually a screenshot from that system.",
                    "label": 0
                },
                {
                    "sent": "One you can see it's Internet, so it's not a problem by itself, but it was probably built in the 80s after blood, and Marco felt there not meant stuff.",
                    "label": 0
                },
                {
                    "sent": "But the way the system is really a few people saw 10 under table and thought what could be potential things that could predict police officers doing these things and say, well.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's a number of times they get complaints, so OK, let's do that.",
                    "label": 0
                },
                {
                    "sent": "So they put in.",
                    "label": 0
                },
                {
                    "sent": "If an officer gets 3 complaints in 180 day.",
                    "label": 0
                },
                {
                    "sent": "Raise the flag and or it's if they've had three uses of force in a 90 day.",
                    "label": 0
                },
                {
                    "sent": "Raise the flag, or if they.",
                    "label": 0
                },
                {
                    "sent": "Taking too much time off, raise a flag.",
                    "label": 0
                },
                {
                    "sent": "That's OK. That sounds about right.",
                    "label": 0
                },
                {
                    "sent": "We built the system we move on.",
                    "label": 0
                },
                {
                    "sent": "And that was it, right?",
                    "label": 0
                },
                {
                    "sent": "So 10 years later, turns out the system doesn't work.",
                    "label": 0
                },
                {
                    "sent": "And when you evaluate the system, but it turns out what it's doing is, it's raising a flag for pretty much when we looked at this about 60% of the police officers, which makes it automatically pretty useless.",
                    "label": 0
                },
                {
                    "sent": "More importantly, even after pretty much saying yes to almost half or half the people, it's still only finding maybe 6070% so slightly better than random off the officers were going to go on.",
                    "label": 0
                },
                {
                    "sent": "To do one of these things right so slightly, doing random and that's what most police departments in the US use.",
                    "label": 0
                },
                {
                    "sent": "So when we started working with them, the first thing we want to do is we will look at let Steven first evaluate the system with the number I'm telling you they never knew these numbers.",
                    "label": 0
                },
                {
                    "sent": "They just thought we built this so it must work.",
                    "label": 0
                },
                {
                    "sent": "Let's keep going.",
                    "label": 0
                },
                {
                    "sent": "So we've got their data.",
                    "label": 0
                },
                {
                    "sent": "So we worked with a couple of police department's one in state Carolina, another one in different states you this morning and they realized they had a problem.",
                    "label": 0
                },
                {
                    "sent": "They realized this wasn't working.",
                    "label": 0
                },
                {
                    "sent": "They didn't know why.",
                    "label": 0
                },
                {
                    "sent": "They didn't know what they should do, so we started working with them and got access to.",
                    "label": 0
                },
                {
                    "sent": "All of their data internally about every police officer they have anything about their demographics, their age, address, sender ethnicity, every every behavior, every stop they made everybody this stop every arrest, every time a call came in and they were dispatched every complaint against them.",
                    "label": 0
                },
                {
                    "sent": "Whether it was sustained and nonsustained everything they knew better.",
                    "label": 0
                },
                {
                    "sent": "Police officer.",
                    "label": 0
                },
                {
                    "sent": "Spend some time in the generating a bunch of features that we always do, and then build the machine learning system that would predict which officer is likely to be at risk of doing one of these things, and even the very first iteration of that, just because it was much more based on data will significantly better, so we're able to do.",
                    "label": 0
                },
                {
                    "sent": "But cut the these false positives into about half so it would only raise flags at half the people and find about 20% more officers who are at risk.",
                    "label": 0
                },
                {
                    "sent": "So even the first you know in the first few months we were able to get huge improvements just by using basic machine learning and building the system and starting from there.",
                    "label": 0
                },
                {
                    "sent": "So that's one example.",
                    "label": 0
                },
                {
                    "sent": "We can come back to come back to that.",
                    "label": 0
                },
                {
                    "sent": "So second example I'm going to be.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is also strange phenomenon.",
                    "label": 0
                },
                {
                    "sent": "the US which is lead poisoning.",
                    "label": 0
                },
                {
                    "sent": "I don't know if you guys heard about a few months ago there was this water and lead and kids drank with water from these pipes and they were getting lead poisoning and that poisoning is really bad because.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You get a lot of these horrible outcomes you have hearing loss, IQ loss, memory problems, learning those people.",
                    "label": 1
                },
                {
                    "sent": "Basically, you know kids who get.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of studies that have shown kids who get exposed to lead.",
                    "label": 0
                },
                {
                    "sent": "Early age they never recover after that.",
                    "label": 0
                },
                {
                    "sent": "And it turns out in the US, every home built before 1978 has lead paint in their heads.",
                    "label": 0
                },
                {
                    "sent": "Paint that has led and it's fine if lead paint stays in the wall.",
                    "label": 0
                },
                {
                    "sent": "What happens is as well as get old lead paint starts coming down.",
                    "label": 0
                },
                {
                    "sent": "So kids when they're young they crawl to pick up lead, dust it in that mouth.",
                    "label": 0
                },
                {
                    "sent": "It goes into your bloodstream.",
                    "label": 0
                },
                {
                    "sent": "Some point basically starts, you know.",
                    "label": 0
                },
                {
                    "sent": "Being used instead of calcium and the biggest problem with these things is that none of these effects have reversible.",
                    "label": 0
                },
                {
                    "sent": "Once lettuce in your bloodstream, you can't do anything to fix it.",
                    "label": 0
                },
                {
                    "sent": "So how do these?",
                    "label": 0
                },
                {
                    "sent": "How do governments deal with it?",
                    "label": 0
                },
                {
                    "sent": "Well, they wait until somebody gets that poisoning because it's too expensive to go fix all the homes 'cause the way to fix it is you go into a home.",
                    "label": 0
                },
                {
                    "sent": "You get all the feet out of all you scrape it off, you take windows and doors that are painted.",
                    "label": 0
                },
                {
                    "sent": "You take them out, you put new ones in and that's too expensive because too many homes have that problem.",
                    "label": 0
                },
                {
                    "sent": "So to be efficient, they wait until somebody gets less poisoning.",
                    "label": 0
                },
                {
                    "sent": "And the way to do that is they typically have mandated blood tests that people just so if any or some age 1234 they do a blood test.",
                    "label": 0
                },
                {
                    "sent": "They see if you have a high blood lead level, and if there's a high enough level.",
                    "label": 0
                },
                {
                    "sent": "They will send somebody to your home to check for that, and there's that indebted drill into there and they find, of course defined lab.",
                    "label": 0
                },
                {
                    "sent": "And if I'm glad, they try to figure out how to fix it.",
                    "label": 0
                },
                {
                    "sent": "Now you can see the problem with that right?",
                    "label": 0
                },
                {
                    "sent": "It's the problem is already happening.",
                    "label": 0
                },
                {
                    "sent": "You're not preventing it.",
                    "label": 0
                },
                {
                    "sent": "You providing it for future children who live in that home.",
                    "label": 0
                },
                {
                    "sent": "So they basically use kids as sensors because they're really accurate sensors for left as they put it in their mouth, the blood level goes up and you can detect lead very efficiently, but it's pretty much useless for to save the kid again to do a lot of their credit after many, many years of doing this to figure out, maybe we can do it.",
                    "label": 0
                },
                {
                    "sent": "Thanks for the obvious, but how do we do that so that I've talked a lot of cities that would do this and a lot of them don't do anything because they realized well if we do this it's going to be too late so let's not do anything.",
                    "label": 0
                },
                {
                    "sent": "Some cities fix it afterwards, some things don't fix it.",
                    "label": 0
                },
                {
                    "sent": "It's a very pretty bad right now.",
                    "label": 0
                },
                {
                    "sent": "So so talk to them about how can you do it earlier.",
                    "label": 0
                },
                {
                    "sent": "Same thing.",
                    "label": 0
                },
                {
                    "sent": "Can we predict early which kids are going to get that poisoning before they get it?",
                    "label": 0
                },
                {
                    "sent": "And so how do we do that?",
                    "label": 0
                },
                {
                    "sent": "Well, we it turns out for a lot of these things the data already exists, and they had access to data for all the blood tests that have happened in the past 15 years or every every kid they had access to.",
                    "label": 0
                },
                {
                    "sent": "All the inspections of homes that have happened in the past 15 years.",
                    "label": 0
                },
                {
                    "sent": "So we could take that data and say, OK, let's take the kid who is just born at that point.",
                    "label": 0
                },
                {
                    "sent": "They haven't had in time to get close to lead and figure out everything we know about Kitty.",
                    "label": 0
                },
                {
                    "sent": "So who the kid is there a difference in gender, ethnicity, parents where they live?",
                    "label": 0
                },
                {
                    "sent": "Have there been other lab tests in nearby in that home in the in that area have been positive in them?",
                    "label": 0
                },
                {
                    "sent": "Another blood test, almost different things and predict what's the probability of this kid getting lead poisoning in the next few months.",
                    "label": 0
                },
                {
                    "sent": "And if that probability is higher than a certain number, than the health Department goes and fixes the problem.",
                    "label": 0
                },
                {
                    "sent": "It sounds simple, but getting to the first part of that was just trying to see can we do it accurately enough so they don't have to go and inspect every home?",
                    "label": 0
                },
                {
                    "sent": "'cause that's the problem is they don't have resources to go fix every home.",
                    "label": 0
                },
                {
                    "sent": "Because initially you could say, well, I can just find every building that's built before 1978 and just fix all of them.",
                    "label": 0
                },
                {
                    "sent": "Well, it's too many buildings, then you can, and many of those buildings might not have kids in there, so that is fine as long as it's not around kids.",
                    "label": 0
                },
                {
                    "sent": "So you have to 1st figure out where kids are.",
                    "label": 0
                },
                {
                    "sent": "But even if you if you have a computer kid living in one of these homes, you may not be at risk because your behaviors may be fine.",
                    "label": 0
                },
                {
                    "sent": "So basically we took the system we built.",
                    "label": 0
                },
                {
                    "sent": "This thing predicted which kids are likely to and then started sending home inspectors to check for that page.",
                    "label": 0
                },
                {
                    "sent": "So the what's happening right now is that's being implemented into the health Department.",
                    "label": 0
                },
                {
                    "sent": "But more Interestingly, also implementing this into hospital systems.",
                    "label": 0
                },
                {
                    "sent": "So the idea is when a pregnant woman goes into a hospital for a check up, the same system can predict when the kid if you're pregnant, the kids going to be born in six months, three months, two months, one month from now.",
                    "label": 0
                },
                {
                    "sent": "That kid is at high risk of lead poisoning, so now the health Department has many more months available.",
                    "label": 0
                },
                {
                    "sent": "Rated before as soon as you see that this is a high risk you have to go fix it and you can't really plan very well.",
                    "label": 0
                },
                {
                    "sent": "So now that you have few months you can use this information to plan.",
                    "label": 0
                },
                {
                    "sent": "Which homes do I inspect first, which means right later?",
                    "label": 0
                },
                {
                    "sent": "Which ones will fix first?",
                    "label": 0
                },
                {
                    "sent": "How many homes do I have to do?",
                    "label": 0
                },
                {
                    "sent": "So now it gives you much more time because you're doing it much, much much, much, much earlier.",
                    "label": 0
                },
                {
                    "sent": "And right now we're sort of again the one of the things.",
                    "label": 0
                },
                {
                    "sent": "Think about it, this these type of things.",
                    "label": 0
                },
                {
                    "sent": "You know what you're looking at is you're never going to be able to fix every home, at least never.",
                    "label": 0
                },
                {
                    "sent": "As you know, in the next 1020 years.",
                    "label": 0
                },
                {
                    "sent": "So you're trying to figure out is if you can only fix 2003 thousand 4000 whatever number of homes, how do you best pick the ones that are most rich?",
                    "label": 0
                },
                {
                    "sent": "And for that, it's one of the things you know when you're looking at your.",
                    "label": 0
                },
                {
                    "sent": "When you're building machine learning models and one of the things you're using to evaluate them is what's your accuracy?",
                    "label": 0
                },
                {
                    "sent": "And in this case you don't care about accuracy, right?",
                    "label": 0
                },
                {
                    "sent": "Because 80% of the homes you don't care about because you can't get to them.",
                    "label": 0
                },
                {
                    "sent": "And also they don't matter because they're not going to have lead paint in there, so you only care about the small number at the top.",
                    "label": 0
                },
                {
                    "sent": "And how do you really measure those things will come back to that a little bit, so that's that's another prob.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "A different problem which and this is not just a problem in the states, but it's also a problem in a lot of countries where students need a lot of summer schools to finish something in time, and so in the US, for example, 3035% of people who go to secondary school high school don't finish at the same time.",
                    "label": 0
                },
                {
                    "sent": "Alot of programs exist to help them finish.",
                    "label": 0
                },
                {
                    "sent": "This is a lot of programs were here that are.",
                    "label": 0
                },
                {
                    "sent": "Designed to help people finish school, there are lot of students not finishing.",
                    "label": 0
                },
                {
                    "sent": "The problem is that it's really hard to lot of universities and this is high schools in the US to match those people who are the people at risk.",
                    "label": 0
                },
                {
                    "sent": "So what they typically do today is very similar to the.",
                    "label": 0
                },
                {
                    "sent": "System that I talked about by the Police Department that sit down and say OK what?",
                    "label": 0
                },
                {
                    "sent": "What could be an indicator?",
                    "label": 0
                },
                {
                    "sent": "So OK if they have if they don't have good grades, that's probably an indicator.",
                    "label": 0
                },
                {
                    "sent": "If they miss school a lot, that's probably an indicator.",
                    "label": 0
                },
                {
                    "sent": "They are getting a lot of disciplinary actions against them.",
                    "label": 0
                },
                {
                    "sent": "That's probably indicator, so they come around and sit down and come up with new three things and then build a system based on that.",
                    "label": 0
                },
                {
                    "sent": "And you know, obviously you can imagine you know if you actually use real data.",
                    "label": 0
                },
                {
                    "sent": "You could potentially do a lot better, and so here is some.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Results when you start using real data, right so?",
                    "label": 0
                },
                {
                    "sent": "If Y axis so X axis is.",
                    "label": 0
                },
                {
                    "sent": "If you took all the students and build a model that predicted a probability of not graduating from high school and rank them, X axis is the most confident student living in your listing.",
                    "label": 0
                },
                {
                    "sent": "This is student is very very high risk, less less less.",
                    "label": 0
                },
                {
                    "sent": "Less rich about this rank list until you're going down this list and on the Y axis is recall just percentage of kids who are going to drop out.",
                    "label": 0
                },
                {
                    "sent": "What percentage of those?",
                    "label": 0
                },
                {
                    "sent": "Have you captured in your top whatever percentage range right?",
                    "label": 0
                },
                {
                    "sent": "So for example, this line here.",
                    "label": 0
                },
                {
                    "sent": "Over here it says if you target the top 5% of the kids in your prediction, you will be somewhere between 15 and 35%.",
                    "label": 0
                },
                {
                    "sent": "You will get 15 to 35% of the kids who are going to drop out and these different lines are at what grade.",
                    "label": 0
                },
                {
                    "sent": "So obviously the day before you're supposed to graduate, you can predict very accurately if you're going to make it or not six years before, it's much, much much harder so, so this is in an 8 year, 60 or 7 eight.",
                    "label": 0
                },
                {
                    "sent": "Into the US you finish in year 12, right?",
                    "label": 0
                },
                {
                    "sent": "So this is 2 year before and we can sort of see is if you build a system that is kind of this basic one.",
                    "label": 0
                },
                {
                    "sent": "It's not a horrible system, we know.",
                    "label": 0
                },
                {
                    "sent": "We know that kids who don't get high grades or missed school a lot who get disciplined enough they don't do well, and so if you build that system, you say you can find you know 45% of the students at risk.",
                    "label": 1
                },
                {
                    "sent": "If you use this approach machine learning approach when you see is you know you can get if you sort of take so the schools were working with.",
                    "label": 0
                },
                {
                    "sent": "They said that they have access to resources that they can put 15% of the kids into programs to help them.",
                    "label": 0
                },
                {
                    "sent": "So if you target the top 15% of these kids, you know if you had a random system it would do 15% recall, right?",
                    "label": 0
                },
                {
                    "sent": "But we don't want to compare to random system because these students these schools are not doing random things there somewhat smart.",
                    "label": 0
                },
                {
                    "sent": "So they're coming up with this number.",
                    "label": 0
                },
                {
                    "sent": "But you notice here what you can do is even at 6th grade to six years before graduation, you can capture about 50% off of these students, and then if you go up to the 10th grade, you can get up to 60%.",
                    "label": 0
                },
                {
                    "sent": "But what's interesting is if you sort of look at these these things right.",
                    "label": 0
                },
                {
                    "sent": "So what you can do is.",
                    "label": 1
                },
                {
                    "sent": "If you were over here in 10th, you could get 125 off the 209 students you wanted.",
                    "label": 0
                },
                {
                    "sent": "You want to capture.",
                    "label": 0
                },
                {
                    "sent": "But using this type of approach you can get the same students several years earlier, so you're not necessarily more accurate.",
                    "label": 0
                },
                {
                    "sent": "You're just three years earlier, and that's as important as being more accurate, because now you've got three years to work on these students.",
                    "label": 0
                },
                {
                    "sent": "So another way to think about these things is.",
                    "label": 0
                },
                {
                    "sent": "You are, you can sometimes measure how accurate you are, and that's useful, but for a lot of these real interventions where you're trying to change behavior, accuracy is not the only metric you care, but you also want to care about other things.",
                    "label": 0
                },
                {
                    "sent": "How much time does this teacher have to work with that three years at the same level of accuracy is a long time, and it's much more important to give them the time to fix these problems because you could detect everybody right here and there's no use.",
                    "label": 0
                },
                {
                    "sent": "It's completely useless, so you want to be able to do this do this early.",
                    "label": 0
                },
                {
                    "sent": "So another problem this question so.",
                    "label": 0
                },
                {
                    "sent": "If you would just identified the student, so you have probably had some user able to explain the reasons right?",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah I'll come back to that a little bit, but.",
                    "label": 0
                },
                {
                    "sent": "All these systems, one of the recurring theme is you're making fairly important decisions about people's lives, so you don't just want to tell them this person is going to drop out, so do something about it or this police officer is going to shoot somebody, do something about it.",
                    "label": 0
                },
                {
                    "sent": "You want to give them a little bit more information about why that's happening now.",
                    "label": 0
                },
                {
                    "sent": "You may not be able to tell them why when you have different ways of explaining your predictions and so will come back to come back to that.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thanks so this is.",
                    "label": 0
                },
                {
                    "sent": "Narobi, Kenya.",
                    "label": 0
                },
                {
                    "sent": "And so there's some work we've been doing with the company there that puts these toilets in place, so this is a lot of these places.",
                    "label": 0
                },
                {
                    "sent": "This is kind of the.",
                    "label": 0
                },
                {
                    "sent": "Urban settlements in in Kenya and there is no sanitation, right?",
                    "label": 0
                },
                {
                    "sent": "There's no, there are no toilets, and people usually, either on the street or go in a corner somewhere.",
                    "label": 0
                },
                {
                    "sent": "Put in a bag for the bag over somewhere else.",
                    "label": 0
                },
                {
                    "sent": "And so with this company is trying to do is there are making these portable toilets and there are getting individuals, small stores, schools, different organizations to to take these toilets, install them.",
                    "label": 0
                },
                {
                    "sent": "And then they charge people very small amounts of money to actually use those toilets.",
                    "label": 0
                },
                {
                    "sent": "And the idea is that what this company does is they manufacture these toilets.",
                    "label": 0
                },
                {
                    "sent": "They sort of franchise them to the small business owners to individuals.",
                    "label": 0
                },
                {
                    "sent": "People use these toilets of the local businesses get this money from them, but in this company goes in and they support taking the waste out of these toilets.",
                    "label": 0
                },
                {
                    "sent": "Take him to a central facility.",
                    "label": 0
                },
                {
                    "sent": "And turned into fertilizer and sell the fertilizer to finance building these toilets with this whole thing of gift toilets.",
                    "label": 0
                },
                {
                    "sent": "And the people who actually buy them, they have to support it through the payment and then the fertilizer supports the rest.",
                    "label": 0
                },
                {
                    "sent": "It's right now they have about 700 toilets and they've been operating and the obviously doesn't need for many many many many more.",
                    "label": 0
                },
                {
                    "sent": "The thing that's stopping them from growing is kind of silly.",
                    "label": 0
                },
                {
                    "sent": "It's right now.",
                    "label": 0
                },
                {
                    "sent": "In order to do the biggest cost for them is to MTV's toilets because they have to send a person to the if the toilet is full, nobody can use it, right?",
                    "label": 0
                },
                {
                    "sent": "It's containing so these containers inside these toilets and fill them.",
                    "label": 0
                },
                {
                    "sent": "Nobody can use it.",
                    "label": 0
                },
                {
                    "sent": "If it's until what they do today is they basically send a person to every toilet every day.",
                    "label": 0
                },
                {
                    "sent": "That's sort of normal.",
                    "label": 0
                },
                {
                    "sent": "Different baseline is well, we need to go pick up every toilet and you can imagine here sometimes.",
                    "label": 0
                },
                {
                    "sent": "So yeah, come back so their biggest bottleneck is that if they want to build more toilets, they have to hire more people.",
                    "label": 1
                },
                {
                    "sent": "And they don't make enough money to hire more people, so they just have 700 toilets.",
                    "label": 0
                },
                {
                    "sent": "But they'd like to go is expand much, much, much more to provide more toilets and they need more people, because again, they're doing it.",
                    "label": 0
                },
                {
                    "sent": "You know, once a day, every day, which means if they doubled the number of toilets have doubled.",
                    "label": 0
                },
                {
                    "sent": "The number of people, so it's in a very linear relationship.",
                    "label": 0
                },
                {
                    "sent": "And you can imagine you're thinking about it.",
                    "label": 0
                },
                {
                    "sent": "I'm just trying the problem.",
                    "label": 0
                },
                {
                    "sent": "Well, some toilets if you go and empty a toilet when it's when it's not full, you're wasting resources.",
                    "label": 0
                },
                {
                    "sent": "You shouldn't pick it up, you can skip it.",
                    "label": 0
                },
                {
                    "sent": "You can go two days later, three days later.",
                    "label": 0
                },
                {
                    "sent": "You have to go every four days because once this stuff has been sitting in there for four days, it becomes unusable that also the Max is 4 days, but anywhere in one in four days.",
                    "label": 0
                },
                {
                    "sent": "You could figure that out.",
                    "label": 0
                },
                {
                    "sent": "So what we did with them was.",
                    "label": 0
                },
                {
                    "sent": "So we built a system where it does a few things, step one.",
                    "label": 0
                },
                {
                    "sent": "It basically predicts how full each toilet will be on a given day, every day, right?",
                    "label": 0
                },
                {
                    "sent": "So they want to make to weekly schedules for pick up off of these toilets.",
                    "label": 0
                },
                {
                    "sent": "The second thing it does is then based on those predictions weekly.",
                    "label": 0
                },
                {
                    "sent": "Usage it then comes up with a pickup schedule for each of the toilets, and it turns out that again using very simple things you can get to a point where you can actually.",
                    "label": 0
                },
                {
                    "sent": "Reduce the number of pickups by about 2 1/2 times for a given week, and So what that does is.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Other than two pretty easily operate 2 1/2 times more toilets, but more importantly it allows them to serve about 45 thousand at the same cost.",
                    "label": 1
                },
                {
                    "sent": "40,000 more people at the same cost they were doing before, so there's an obvious technological solution as well.",
                    "label": 1
                },
                {
                    "sent": "It will think of, namely sensors to give some sort of microphone.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so it's an obvious solution that we also thought about.",
                    "label": 0
                },
                {
                    "sent": "Like you know, why don't you put sensors like?",
                    "label": 0
                },
                {
                    "sent": "Of course, you guys are so smart sitting in the US telling us these obvious things like, well, we put sensors in there.",
                    "label": 0
                },
                {
                    "sent": "And if you put sensors in that environment, they degrade very quickly, so they haven't been able to put a bunch of different sensors in that container.",
                    "label": 0
                },
                {
                    "sent": "It's not reliable, and it just failed.",
                    "label": 0
                },
                {
                    "sent": "So they are in a parallel path of putting trying to figure out better sensors, but all the sensors have tried.",
                    "label": 0
                },
                {
                    "sent": "They haven't been able to know that was the same idea, I think.",
                    "label": 0
                },
                {
                    "sent": "Oh yeah, we didn't think about that.",
                    "label": 0
                },
                {
                    "sent": "Thanks for that.",
                    "label": 0
                },
                {
                    "sent": "Well, you know, just in case you didn't think about it like up here are sensors.",
                    "label": 0
                },
                {
                    "sent": "Yeah, we've talked about a lot of these, but I mean, even when even when you put sensors, you still have to do.",
                    "label": 0
                },
                {
                    "sent": "Some.",
                    "label": 0
                },
                {
                    "sent": "In this you can now be little bit more efficient because you can still plan slightly longer term based on sensors, so yeah, but would be would be interesting would be what the direct comparison between the predictive analytics and the extra 1 graph.",
                    "label": 0
                },
                {
                    "sent": "Yeah yeah.",
                    "label": 0
                },
                {
                    "sent": "And right now there are a lot of other something I'm kind of glossing over.",
                    "label": 0
                },
                {
                    "sent": "The details are a lot of times when you look at the data.",
                    "label": 0
                },
                {
                    "sent": "It turns out you know a lot of times there are.",
                    "label": 0
                },
                {
                    "sent": "They pick up so that is supposed to pick up these.",
                    "label": 0
                },
                {
                    "sent": "Containers and some containers.",
                    "label": 0
                },
                {
                    "sent": "You know you're going in his rural areas for their putting things in the container, putting it on a wheelbarrow and then taking it back all the way.",
                    "label": 0
                },
                {
                    "sent": "Sometimes we found in the data like 0.",
                    "label": 0
                },
                {
                    "sent": "No wait, no wait, no wait.",
                    "label": 0
                },
                {
                    "sent": "No, it is was just it not be used like it was being used.",
                    "label": 0
                },
                {
                    "sent": "So what happened with 00?",
                    "label": 0
                },
                {
                    "sent": "They had too many different containers so they consolidate it all into one and then left the empty ones back there so Windows wait, it was zero but it wasn't 0 so.",
                    "label": 0
                },
                {
                    "sent": "You get all these errors in the data even with even these predictions are.",
                    "label": 0
                },
                {
                    "sent": "Or not, as good as they could be, because your data you're getting or somebody just skipped to pick up.",
                    "label": 0
                },
                {
                    "sent": "They were supposed to go pick this up, but I don't want to go there today.",
                    "label": 0
                },
                {
                    "sent": "So you have or they didn't.",
                    "label": 0
                },
                {
                    "sent": "They weren't able to bribe the guy who was supposed to let them go through this place, so there's a lot of these things that happen that create these issues.",
                    "label": 0
                },
                {
                    "sent": "So yeah, there's certainly once you are doing some pilots with different sensors.",
                    "label": 0
                },
                {
                    "sent": "Once you start doing that, you can see how well you can do.",
                    "label": 0
                },
                {
                    "sent": "So coming back to a more first.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Problem.",
                    "label": 0
                },
                {
                    "sent": "Where you have sanitation and water pipes.",
                    "label": 0
                },
                {
                    "sent": "So this is this is just again US there about quarter million pipes that break every year.",
                    "label": 0
                },
                {
                    "sent": "So and that happens in pretty much every every talent.",
                    "label": 0
                },
                {
                    "sent": "Every city where there is sanitation and there is water.",
                    "label": 0
                },
                {
                    "sent": "Water pipes break and water pipes break.",
                    "label": 0
                },
                {
                    "sent": "You don't have water and whoever is running the city or the town has to go in and dig up the street and fix the water pipe.",
                    "label": 0
                },
                {
                    "sent": "And then keep going right.",
                    "label": 0
                },
                {
                    "sent": "So it turns out that right now pretty much most cities, the way they deal with this problem is very much like every other problem we've talked about.",
                    "label": 0
                },
                {
                    "sent": "Is there wait until the pipe works and then they go dig up the road and fix the pipe?",
                    "label": 0
                },
                {
                    "sent": "So we're working with a small town in New York State which doesn't have a lot of breaks, but it has 180 breaks a year, which is, you know, every other day there is some some water break an again.",
                    "label": 0
                },
                {
                    "sent": "The problem.",
                    "label": 0
                },
                {
                    "sent": "The way they deal with it is again they go and just wait until somebody complaints.",
                    "label": 0
                },
                {
                    "sent": "They go and look at the problem to fix the problem and then they move on and that obviously costs a lot more money to fix these things after their broken, but not just money.",
                    "label": 0
                },
                {
                    "sent": "It's also if you're living in a in an area where there is a water break, you don't get water and you don't really have tanks in your home to store those words.",
                    "label": 0
                },
                {
                    "sent": "You kind of.",
                    "label": 0
                },
                {
                    "sent": "It's not the best thing now, at least you're lucky you have sanitation and water, so can't complain too much, but when we started doing this work that one of the challenges was, the idea was again, can we predict which?",
                    "label": 0
                },
                {
                    "sent": "Water pipes are likely to break in a city, and if you can predict that one can you go fix them in advance for two, what often happens is that you're already planning on doing work on the ropes.",
                    "label": 0
                },
                {
                    "sent": "There might be a re paving of the road coming up.",
                    "label": 0
                },
                {
                    "sent": "There might be other things that are already happening, so if you had information on this road is more likely to break in the next three years and your order this pipe in this street is likely to break you already doing some work.",
                    "label": 0
                },
                {
                    "sent": "How about you dig up a little bit more and check?",
                    "label": 0
                },
                {
                    "sent": "And fix it instead of waiting till three years later.",
                    "label": 0
                },
                {
                    "sent": "So now this type of thing allows you to coordinate with the roads with other things and start planning.",
                    "label": 0
                },
                {
                    "sent": "How do we?",
                    "label": 0
                },
                {
                    "sent": "How do we do these things better?",
                    "label": 0
                },
                {
                    "sent": "So in this case, what we ended up doing?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Was when we build this model, haters will be found right if we took our top this this city had about 5000 city blocks in the US.",
                    "label": 0
                },
                {
                    "sent": "You know, it's typically a grid system.",
                    "label": 0
                },
                {
                    "sent": "When you have these blocks, so $5000.",
                    "label": 0
                },
                {
                    "sent": "If we took our top 150 predictions, the top most confident predictions which they found 30.",
                    "label": 0
                },
                {
                    "sent": "Two of those had ended up getting getting brakes, right?",
                    "label": 0
                },
                {
                    "sent": "That was funny.",
                    "label": 0
                },
                {
                    "sent": "They just got got.",
                    "label": 0
                },
                {
                    "sent": "Email last night.",
                    "label": 0
                },
                {
                    "sent": "I was just I just copied and pasted it here.",
                    "label": 0
                },
                {
                    "sent": "So we for this year we made a list.",
                    "label": 0
                },
                {
                    "sent": "We sorted everything.",
                    "label": 0
                },
                {
                    "sent": "We gave them a list and they just came back and said guess what off the top five predictions, two of them just broke last week, which is bad because we told them but good because they actually believe us they said oh and seven of the top 50 have already broken in the last couple of months and five were off by another block.",
                    "label": 0
                },
                {
                    "sent": "And so it looks like you guys were right, so hopefully you know these.",
                    "label": 0
                },
                {
                    "sent": "Again, the reason is sort of showing this is that sort of how you want to validate these type of systems right?",
                    "label": 0
                },
                {
                    "sent": "Because of the things I've been showing, I've been only showing you the first piece, which is I have historical data of 10 years of data I can hide.",
                    "label": 0
                },
                {
                    "sent": "The last year and predict on that here.",
                    "label": 0
                },
                {
                    "sent": "Or I can hide the last two years and predict on those years.",
                    "label": 0
                },
                {
                    "sent": "But that's not necessarily the best because you still have changes that happen in the future that a lot of things are not stationary, so we want to be able to do is predict for the actual next year and see how accurate you are.",
                    "label": 0
                },
                {
                    "sent": "And often would you want to do is is randomized control trials right?",
                    "label": 0
                },
                {
                    "sent": "So you are looking at this.",
                    "label": 0
                },
                {
                    "sent": "One is an easy problem because to evaluate as you predict which pipes are going to break and you can.",
                    "label": 0
                },
                {
                    "sent": "You can watch them break for a year, but for other things you actually want to be much smarter about.",
                    "label": 0
                },
                {
                    "sent": "You want to compare with their existing approach so they sound like system approaches.",
                    "label": 0
                },
                {
                    "sent": "I wait until they break, but if my existing approach was I'm going to see which pipes have a lot of traffic going near them.",
                    "label": 0
                },
                {
                    "sent": "Then you want to compare with that.",
                    "label": 0
                },
                {
                    "sent": "So my so as you were.",
                    "label": 0
                },
                {
                    "sent": "Talking to said, I was thinking about the ethical issue with no with policemen.",
                    "label": 0
                },
                {
                    "sent": "So so do you have it?",
                    "label": 0
                },
                {
                    "sent": "Also generally thinking to cope with situations like yeah, let me let me come back in after 2 minutes on that.",
                    "label": 0
                },
                {
                    "sent": "For example, that I'll come back to, come back to the interpretation, and at the color, those are the two things I want to talk a bit more about.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So slightly different.",
                    "label": 0
                },
                {
                    "sent": "Another example is this is from work with government in Mexico and one of those sort of things that message is about half the population in Mexico is below their level of poverty.",
                    "label": 0
                },
                {
                    "sent": "And one of the challenges they face which they have a large number of programs.",
                    "label": 1
                },
                {
                    "sent": "So they have this Ministry of Social Services called set this whole that is designed to sort of give people to social services they need.",
                    "label": 0
                },
                {
                    "sent": "Except they have sort of two problems there.",
                    "label": 0
                },
                {
                    "sent": "One is they don't know who's eligible for what services, and sometimes people themselves don't really know who they are, what they are legible for because there all of these different programs, so they think there are millions of people who are eligible for a service.",
                    "label": 0
                },
                {
                    "sent": "Whether it's health care, whether it's some sort of subsidy in the House, who are not getting it on the other hand, they also know that there are people who are under reporting their income.",
                    "label": 0
                },
                {
                    "sent": "A.",
                    "label": 0
                },
                {
                    "sent": "You know, in order to qualify for this you have you.",
                    "label": 0
                },
                {
                    "sent": "Can you have to make up to 20,000 faces, but they're saying, well I only make 5000 so there are people who are not getting the services they need because they don't know.",
                    "label": 0
                },
                {
                    "sent": "But then there are people who are getting services that they shouldn't be getting and so the problem they came to us with was can be identified.",
                    "label": 0
                },
                {
                    "sent": "Both of these people.",
                    "label": 0
                },
                {
                    "sent": "Can you give me a list of people who might be at risk of not getting these services that they should be eligible for?",
                    "label": 0
                },
                {
                    "sent": "And can you also help me find people who are getting these services so I can go and validate that and find more information about them?",
                    "label": 0
                },
                {
                    "sent": "And see if I can swap right?",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Phone was in both of those cases.",
                    "label": 0
                },
                {
                    "sent": "For example we found.",
                    "label": 0
                },
                {
                    "sent": "That about so this is again, this is this has been validated yet, so this is an initial we found about 7 million people who were part of these different programs as a meal and health and education and home subsidies and other infrastructure subsidies that are potentially eligible for services that they're not getting.",
                    "label": 0
                },
                {
                    "sent": "So what the ministry is doing right now is doing a sample of this and going and talking to them to figure out how much of this is actually true.",
                    "label": 0
                },
                {
                    "sent": "And same for the other way around, where we're finding these people may be under reporting that income, they're going to go and add a few more questions in a questionnaire they go for and get.",
                    "label": 0
                },
                {
                    "sent": "You don't want to deny them right away, right?",
                    "label": 0
                },
                {
                    "sent": "As computer says something questions come up is the computer says this person is at risk.",
                    "label": 0
                },
                {
                    "sent": "This person may be under reporting their income.",
                    "label": 0
                },
                {
                    "sent": "Cut off all their services.",
                    "label": 0
                },
                {
                    "sent": "You don't want to do that.",
                    "label": 0
                },
                {
                    "sent": "So you want to give a little bit more information to the person making that decision so they can go deeper and ask them more questions to verify some of their information.",
                    "label": 0
                },
                {
                    "sent": "Let me skip this one and come to the last example when.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Give is so.",
                    "label": 0
                },
                {
                    "sent": "Again, This Is Us.",
                    "label": 0
                },
                {
                    "sent": "There are a lot of people who are sort of stuck in jails and prisons in the US, and then you escorted off all the developed countries just puts too many people into jail and one of the things that happens once you're in jail, then you're much more likely to go into jail again.",
                    "label": 0
                },
                {
                    "sent": "So there's people who keep getting stuck over and over and over and over again.",
                    "label": 0
                },
                {
                    "sent": "And it turns out when you look at the data more, you find that the people who are spending a lot of time in jail.",
                    "label": 0
                },
                {
                    "sent": "They are also interacting with government systems earlier, so there's.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Two systems I think about.",
                    "label": 0
                },
                {
                    "sent": "One is an homeless shelter, says homes.",
                    "label": 0
                },
                {
                    "sent": "Lots of homeless people.",
                    "label": 0
                },
                {
                    "sent": "And they go into homeless shelters and that's one place where a lot of people who end up in jail there in homeless shelters.",
                    "label": 0
                },
                {
                    "sent": "Or there are these mental health facilities.",
                    "label": 0
                },
                {
                    "sent": "If you have mental health problems, you again interact with the government somehow through those systems.",
                    "label": 0
                },
                {
                    "sent": "So the hypothesis on this project that we're doing with several different cities in the US is if we can identify who those people are and give that information to the people dealing with them in the homeless shelters in the mental health facilities in hospitals.",
                    "label": 0
                },
                {
                    "sent": "They can do something about it at that time before they end up in jail.",
                    "label": 0
                },
                {
                    "sent": "So right now when somebody goes to a mental health facility, they get somebody to talk to them and they try to fix their immediate problem.",
                    "label": 0
                },
                {
                    "sent": "If they knew that they were 40% likely to go into jail in the next year, maybe they can talk to them and try to prevent that, right?",
                    "label": 0
                },
                {
                    "sent": "We don't know if it's prevention is possible or not, but we know that if we can identify, we can start thinking about whether we can prevent those or not, and that's something to keep in mind for a lot of problems.",
                    "label": 0
                },
                {
                    "sent": "Talked about, right prediction is only one part.",
                    "label": 0
                },
                {
                    "sent": "After gold prediction is only I can identify, you are at risk and if I can change that then it's pointless.",
                    "label": 0
                },
                {
                    "sent": "So I want to be able to make sure that I predict identify it, but then work on interventions that can actually change something in the future.",
                    "label": 0
                },
                {
                    "sent": "So here we're doing some early stuff on identifying these people and then working with the hospitals with the homeless shelters at the mental health facilities to see.",
                    "label": 0
                },
                {
                    "sent": "Can we prevent these people from getting in there?",
                    "label": 0
                },
                {
                    "sent": "And this is some very early work we do.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With one city we found that you know if we flagged.",
                    "label": 0
                },
                {
                    "sent": "If we just took the top 200 people in this case.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Intervened and then told somebody about them, we would end up getting.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "About 50% of them were going to go on to jail in the next year.",
                    "label": 0
                },
                {
                    "sent": "And they were going to stay in jail for about 7000 days combined, right?",
                    "label": 0
                },
                {
                    "sent": "So even that simple small number if we just took 200 people in this entire city.",
                    "label": 0
                },
                {
                    "sent": "100 of them are going to go on to jail and then it's gonna be 7000 days.",
                    "label": 0
                },
                {
                    "sent": "So if you can do anything about this it affects a lot of people and can potentially make outcomes much, much, much better for a lot of these people.",
                    "label": 0
                },
                {
                    "sent": "Predicate in the US citizen prisons understand I've actually privatized, so you have more industry and their interest is not is not prevention.",
                    "label": 0
                },
                {
                    "sent": "Their interest is getting people into jail and getting the money right?",
                    "label": 0
                },
                {
                    "sent": "So this is not.",
                    "label": 0
                },
                {
                    "sent": "This is the interest of the city in the state is to prevent people because they don't want to pay them either.",
                    "label": 0
                },
                {
                    "sent": "So whether you care about humans or about money and that's one of the one of the things you have to do in these situations, you talking to governments.",
                    "label": 0
                },
                {
                    "sent": "Depending on the government, sometimes they care about people.",
                    "label": 0
                },
                {
                    "sent": "Sometimes they care about money.",
                    "label": 0
                },
                {
                    "sent": "For these, for this I think it's both.",
                    "label": 0
                },
                {
                    "sent": "So anytime you prevent 7000 jail days, you help people obviously.",
                    "label": 1
                },
                {
                    "sent": "But you also save a lot of money and so that's the thing you have to convince them for.",
                    "label": 0
                },
                {
                    "sent": "But and the other thing is the private prisons have just been banned last month.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so there are no more private.",
                    "label": 0
                },
                {
                    "sent": "Announcing then stock prices.",
                    "label": 0
                },
                {
                    "sent": "So there are no good, no more privatized prisons.",
                    "label": 0
                },
                {
                    "sent": "But you're right, that's that's a huge problem there right now.",
                    "label": 0
                },
                {
                    "sent": "Trying to us.",
                    "label": 0
                },
                {
                    "sent": "Sorry you know the US.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that was just lost.",
                    "label": 0
                },
                {
                    "sent": "Correct?",
                    "label": 0
                },
                {
                    "sent": "Open calendar.",
                    "label": 0
                },
                {
                    "sent": "But isn't 7000 base with a lot right?",
                    "label": 0
                },
                {
                    "sent": "This is my people.",
                    "label": 0
                },
                {
                    "sent": "It's 100 people altogether.",
                    "label": 0
                },
                {
                    "sent": "It's in the 100 people in the next year combined, or two out of 36,500 days.",
                    "label": 0
                },
                {
                    "sent": "Would have been there or about us things about time, but the reason we should have this number is important is that's what allows them to figure out the cost savings is they're paying ridiculously, and so you convince them in both ways, right?",
                    "label": 0
                },
                {
                    "sent": "Hundred people.",
                    "label": 0
                },
                {
                    "sent": "Then if this 120.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "So a couple of you know, as we're talking about all these different.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Things of one of the things that we think about is these problems, all sort of fit into these templates of what I sort of like.",
                    "label": 0
                },
                {
                    "sent": "Data science problem templates that are common across these types of problems and social impact, but also industry problems and other problems.",
                    "label": 0
                },
                {
                    "sent": "So the first one we talked about was, you know, the lead poisoning it.",
                    "label": 0
                },
                {
                    "sent": "Can I detect who's going to get that poisoning early?",
                    "label": 1
                },
                {
                    "sent": "And that's a problem we deal with all the time, not just in these situations, but pretty much everywhere, right?",
                    "label": 0
                },
                {
                    "sent": "So can I detect something early.",
                    "label": 0
                },
                {
                    "sent": "And those are early warning systems that we built for different types of things.",
                    "label": 0
                },
                {
                    "sent": "We do it in the corporate world can detect, you know if some machinery is going to break.",
                    "label": 0
                },
                {
                    "sent": "Or can I detect if somebody is going to not be a customer in the next 2 years.",
                    "label": 0
                },
                {
                    "sent": "Going to detect that early so I can do something about it right?",
                    "label": 0
                },
                {
                    "sent": "The second one is sort of this, which I have.",
                    "label": 0
                },
                {
                    "sent": "Water pipes I've got 500,000 water pipes in the city.",
                    "label": 0
                },
                {
                    "sent": "I can only do something about 50 of them, 5000 of them, 10,000 of them.",
                    "label": 0
                },
                {
                    "sent": "I have 300,000 homes in a city or in the country.",
                    "label": 0
                },
                {
                    "sent": "I need to inspect them for lead hazards, but I can only have budgets doing inspect 3000.",
                    "label": 0
                },
                {
                    "sent": "Which one should they be?",
                    "label": 0
                },
                {
                    "sent": "So given my goal, how do I prioritize these type of things?",
                    "label": 0
                },
                {
                    "sent": "That's another common problem that keeps coming up.",
                    "label": 0
                },
                {
                    "sent": "The third one is slightly different than we didn't really talk about it just for some work with again the government of Mexico on maternal mortality where they have a very high maternal mortality rate compared to other countries.",
                    "label": 0
                },
                {
                    "sent": "They couldn't figure out is we have a lot of policies we can change.",
                    "label": 0
                },
                {
                    "sent": "It could be that people are not there is maternal mortality because the hospitals are too far or clinics are too far or because they don't have the right equipment in there or because they're not taking the right.",
                    "label": 0
                },
                {
                    "sent": "They're not going to the hospitals or they're going, but they're not getting the right care, so they couldn't figure out which policies should be changes.",
                    "label": 0
                },
                {
                    "sent": "The government should be building more of them.",
                    "label": 0
                },
                {
                    "sent": "Should we build them in certain places?",
                    "label": 0
                },
                {
                    "sent": "Should be changed?",
                    "label": 0
                },
                {
                    "sent": "Or transit infrastructure?",
                    "label": 0
                },
                {
                    "sent": "Should we change insurance?",
                    "label": 0
                },
                {
                    "sent": "Policy is how do we do this thing so by use data will be able to do is narrow it down to three or four as opposed to 50 possibilities and come up with here.",
                    "label": 0
                },
                {
                    "sent": "The four policies you might want to experiment.",
                    "label": 0
                },
                {
                    "sent": "And then they designed experiments over the next two years would run those experiments and see which policy is actually have an impact.",
                    "label": 0
                },
                {
                    "sent": "And that's another sort of template of I have access to a lot of policies, model ways to do something I don't have definite data on.",
                    "label": 0
                },
                {
                    "sent": "It's not a prediction, it I need to figure out how do I narrow it down to a smaller number?",
                    "label": 0
                },
                {
                    "sent": "That I can then experiment with and validate and see which one is actually causing this problem.",
                    "label": 0
                },
                {
                    "sent": "The 4th one is pretty common in most places where people often do things.",
                    "label": 0
                },
                {
                    "sent": "Cities, companies.",
                    "label": 0
                },
                {
                    "sent": "It's not like they all have a plan and they do something more into plastic.",
                    "label": 0
                },
                {
                    "sent": "They try a lot of different things, and once those things have happened, they come back into what impact did that have?",
                    "label": 0
                },
                {
                    "sent": "So they might increase bus lines in the city and it's not like they had a big plan of, you know, here's what's exactly going to happen, but they changed bus lines and now they want to know how did that affect.",
                    "label": 0
                },
                {
                    "sent": "The people how did that affect jobs 100 affect retail 100 affect Commerce and so this is a common problem.",
                    "label": 0
                },
                {
                    "sent": "Again it comes back where I change something.",
                    "label": 0
                },
                {
                    "sent": "Can you help me evaluate the impact will so I can then figure out what to do in the future.",
                    "label": 0
                },
                {
                    "sent": "The last one is little.",
                    "label": 0
                },
                {
                    "sent": "Particularly when they're talking.",
                    "label": 0
                },
                {
                    "sent": "So for example, this one is a problem we've been working with.",
                    "label": 0
                },
                {
                    "sent": "A lot of government agencies on matching employers with employees, people who might have certain skills, and people who need those skills in a job.",
                    "label": 0
                },
                {
                    "sent": "How do you match those?",
                    "label": 0
                },
                {
                    "sent": "And it turns out you know for a lot of people this is they don't have access to data that can help them do that, right?",
                    "label": 0
                },
                {
                    "sent": "But this data often exists in.",
                    "label": 0
                },
                {
                    "sent": "So when you're dealing with people in government and nonprofits and NGOs, data means rows and columns.",
                    "label": 0
                },
                {
                    "sent": "If it's not a database table or spreadsheet, it's not data which is, we know in a lot of you are dealing with this right now.",
                    "label": 0
                },
                {
                    "sent": "You know projects dealing with text, data, image data and video data and network data.",
                    "label": 0
                },
                {
                    "sent": "So what they mean by this one is.",
                    "label": 0
                },
                {
                    "sent": "A thing with rows and columns that I can then use to do this matching with.",
                    "label": 0
                },
                {
                    "sent": "I know how to do that, I can't get those things into rows and columns, so we're here that is.",
                    "label": 0
                },
                {
                    "sent": "Can we take resumes of people and extract the skills that they might have?",
                    "label": 0
                },
                {
                    "sent": "Look at job descriptions and extract those things and then start giving people suggestions for how to fill those gaps and it's sort of much more than that, but that's kind of and so that's a common thing as well as trying to create information from them for organizations who can't really.",
                    "label": 0
                },
                {
                    "sent": "Deal with messy unstructured text or videos or images and try to give them information that they can use to do this.",
                    "label": 0
                },
                {
                    "sent": "The nice thing about these problems is they pretty much capture most of the problems you end up dealing with, and for each of these there are different things you have to care about.",
                    "label": 0
                },
                {
                    "sent": "For example for the 1st.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The detection early you want to know how early do you want to detect?",
                    "label": 0
                },
                {
                    "sent": "Because the time depends on the intervention, right?",
                    "label": 0
                },
                {
                    "sent": "If you need if the early means that the way to fix that problem is to.",
                    "label": 0
                },
                {
                    "sent": "If that thing takes three years, it's a after school program and a kid needs to work on this for two years before that can be fixed.",
                    "label": 0
                },
                {
                    "sent": "Well, then, two years is the minimum time you need, right?",
                    "label": 0
                },
                {
                    "sent": "So detecting something three months early when you need two years is not very helpful.",
                    "label": 0
                },
                {
                    "sent": "So how early do you want to detect it for what granularity?",
                    "label": 0
                },
                {
                    "sent": "So you want to take it at the person level at a group level at the neighborhood level, and then how do you change that behavior is just about predicting.",
                    "label": 0
                },
                {
                    "sent": "It's also about changing behavior so you can do that about for each of these problems.",
                    "label": 0
                },
                {
                    "sent": "Figure out what are the parameters.",
                    "label": 0
                },
                {
                    "sent": "What kinds of machine learning tools do you need?",
                    "label": 0
                },
                {
                    "sent": "How do you evaluate them and how do you put them?",
                    "label": 0
                },
                {
                    "sent": "You know, deploy them right.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The other thing that happens across.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "All of these is you could have to start caring about some other issues than just building these models and evaluate these models.",
                    "label": 0
                },
                {
                    "sent": "You care about a lot of other things, so the first thing that keeps coming up.",
                    "label": 0
                },
                {
                    "sent": "Every problem I talked about pretty much every problem other than water pipes the data that you have about the data is about people and it's very sensitive data about a lot of people.",
                    "label": 0
                },
                {
                    "sent": "It's about their health behaviors, it's about.",
                    "label": 0
                },
                {
                    "sent": "Education behaviors.",
                    "label": 0
                },
                {
                    "sent": "All of that is private, so you have to figure out how do you.",
                    "label": 0
                },
                {
                    "sent": "You can't make any of this public.",
                    "label": 0
                },
                {
                    "sent": "This will never be open, but it's extremely useful, extremely sensitive, so you have to make sure that you are able to deal with privacy concerns that people have, and often when you work on these types of projects, you have to be able to convince the people you're working with that you're you're complying with all your laws and all these different things, but you're also not doing something that would be violating their privacy.",
                    "label": 0
                },
                {
                    "sent": "Same for security.",
                    "label": 0
                },
                {
                    "sent": "You have to keep the lot of those.",
                    "label": 0
                },
                {
                    "sent": "I'm going to skip the first couple of privacy security because.",
                    "label": 1
                },
                {
                    "sent": "It's it's covered well in a lot of places.",
                    "label": 0
                },
                {
                    "sent": "The third piece is sort of much more interesting here is because you know if you a lot of the examples that Ricardo was given yesterday.",
                    "label": 0
                },
                {
                    "sent": "So when you're talking about if you Google and you show somebody.",
                    "label": 0
                },
                {
                    "sent": "Don't.",
                    "label": 0
                },
                {
                    "sent": "Most people don't really click on that?",
                    "label": 0
                },
                {
                    "sent": "Why did I see this ad to see this?",
                    "label": 0
                },
                {
                    "sent": "What things I do, you don't really.",
                    "label": 0
                },
                {
                    "sent": "You know it's fine not to be able to explain to somebody which add you're seeing why?",
                    "label": 0
                },
                {
                    "sent": "Because you see millions of acts in your lifetime, so you don't care bout interpretation as much because also if you get it wrong, who cares?",
                    "label": 0
                },
                {
                    "sent": "You thought wrong ad you'll move on with life you'll buy something else but a lot of these things, the decisions we're making about people so.",
                    "label": 0
                },
                {
                    "sent": "If you are taking a police officer off the street if you're.",
                    "label": 0
                },
                {
                    "sent": "Going to a home and fixing their problem, you're choosing between this home at home and if you get the wrong home, you're hurting people.",
                    "label": 0
                },
                {
                    "sent": "Same for the kids who might not be able to finish school.",
                    "label": 0
                },
                {
                    "sent": "If you're picking this kid were over that kid.",
                    "label": 0
                },
                {
                    "sent": "You're making it really important decision for the kid you're missing because you think this kid is going to be fine.",
                    "label": 0
                },
                {
                    "sent": "This kid doesn't need help, so I'll give this kids problem.",
                    "label": 0
                },
                {
                    "sent": "So in a lot of these cases, you're making important decisions about people's lives that could have a huge impact.",
                    "label": 0
                },
                {
                    "sent": "And if.",
                    "label": 0
                },
                {
                    "sent": "You can't describe to somebody why you're making that prediction.",
                    "label": 0
                },
                {
                    "sent": "That person is unlikely to do something about it, and that could mean hurting the people you actually trying to help.",
                    "label": 0
                },
                {
                    "sent": "So one sort of key constraint in these types of projects is that the model has to be able to.",
                    "label": 0
                },
                {
                    "sent": "You don't have to explain the overall model, but you also want to explain every individual prediction you're making.",
                    "label": 0
                },
                {
                    "sent": "Explain is is subjective, right?",
                    "label": 0
                },
                {
                    "sent": "And there's no, there's no objective way to say.",
                    "label": 0
                },
                {
                    "sent": "How do you explain?",
                    "label": 0
                },
                {
                    "sent": "You can have different ways of explaining these things.",
                    "label": 0
                },
                {
                    "sent": "And often this comes down to a user study of how does the person who's taking an action if I'm a school administrator.",
                    "label": 0
                },
                {
                    "sent": "If I'm running the health Department and you say go fix, this game is at risk.",
                    "label": 0
                },
                {
                    "sent": "Does my explanation help this person take this action in a much more confident way?",
                    "label": 0
                },
                {
                    "sent": "If so, then it's a good explanation.",
                    "label": 0
                },
                {
                    "sent": "If not, it's a bad explanation, so it's really about how do I convince a human to take action based on a machine recommendation that's sort of the goal of the explanation, right?",
                    "label": 0
                },
                {
                    "sent": "The second goal explanation is is debugging.",
                    "label": 0
                },
                {
                    "sent": "Because when you interpret this thing, you might realize that you're getting something completely wrong and you have to be able to buy.",
                    "label": 0
                },
                {
                    "sent": "By explaining it, you as the builder of the system should be able to see and say, oh, that's something wrong here.",
                    "label": 0
                },
                {
                    "sent": "That's why are these kids coming up as high risk?",
                    "label": 0
                },
                {
                    "sent": "They don't look like they're high risk, so one of the key things that in all these systems important is interpretability.",
                    "label": 0
                },
                {
                    "sent": "But the problem is that it also you know all of these systems because you're making important decisions.",
                    "label": 0
                },
                {
                    "sent": "You want to be able to tell people, make it very transparent.",
                    "label": 0
                },
                {
                    "sent": "But when you make a transparent, there is a risk.",
                    "label": 0
                },
                {
                    "sent": "So in the police system I was talking about one of the things people that we've heard from police departments was that everybody knows what the rules are, right?",
                    "label": 0
                },
                {
                    "sent": "It says if you have three complaints against you in a 90 day.",
                    "label": 0
                },
                {
                    "sent": "You're at risk.",
                    "label": 0
                },
                {
                    "sent": "If you have 3 uses of force and 180 days.",
                    "label": 0
                },
                {
                    "sent": "You are at risk.",
                    "label": 0
                },
                {
                    "sent": "So what they told us what people do is, you know, when they've had two complaints and it's been 81 days.",
                    "label": 0
                },
                {
                    "sent": "They gave this is they either don't do this for those nine days.",
                    "label": 0
                },
                {
                    "sent": "They don't do anything, so nobody will complain, or if they do things that try not to report those things.",
                    "label": 0
                },
                {
                    "sent": "And so there because the system is completely transparent.",
                    "label": 0
                },
                {
                    "sent": "It's very gameable and it gets gained a lot.",
                    "label": 0
                },
                {
                    "sent": "So for these machine learning systems you want them to be transparent because they're making important decisions.",
                    "label": 0
                },
                {
                    "sent": "But you also don't want them to be gameable, so an open sort of question is how do you make these systems, both transparent, interpretable but not gameable with anything you make the model complex, it becomes opaque, and it's hard to interpret, but it's hard to gain if you make it completely open and easy, and everybody understands it, then they can game it.",
                    "label": 0
                },
                {
                    "sent": "So how do you do both of those things?",
                    "label": 0
                },
                {
                    "sent": "Is an open question and the challenge that we need to figure out how to deal with.",
                    "label": 0
                },
                {
                    "sent": "And the last issue, sort of like John bringing up is.",
                    "label": 0
                },
                {
                    "sent": "Again, unlike you know, recommending friends on Facebook if you recommend it wrong, friend who cares arrangement maybe that was your X.",
                    "label": 0
                },
                {
                    "sent": "That's OK, I'll just click on the X and ignore it.",
                    "label": 0
                },
                {
                    "sent": "If I get the wrong add, you know it could have impact when people have shown a lot of things around.",
                    "label": 0
                },
                {
                    "sent": "You know job ads for.",
                    "label": 0
                },
                {
                    "sent": "For women minorities being lower salary than prevent and white people and there are there are some small impacts to people, but a lot of these things you want to make sure that anything that a computer is recommending.",
                    "label": 0
                },
                {
                    "sent": "It's fair an ethical right?",
                    "label": 0
                },
                {
                    "sent": "So fairness is hard because in a lot of these things these models are being trained from historical data.",
                    "label": 0
                },
                {
                    "sent": "An historical data is traditionally human speaking bias decisions.",
                    "label": 0
                },
                {
                    "sent": "So if you look at, you know banks giving out loans to people who historically they've given loans in a biased way.",
                    "label": 0
                },
                {
                    "sent": "If they've only given notice to people who think they're going to be able to pay back, and it turns out that the people who were paying back well where only rich people or white people, then the model is going to learn those features and then start giving you suggestions to only give loans to people who are like that.",
                    "label": 0
                },
                {
                    "sent": "And that's not what you want, but it's going to be the best performing system on historical data.",
                    "label": 0
                },
                {
                    "sent": "So if you build these models just on historical data, you end up getting biases that keep propagating forward and never change.",
                    "label": 0
                },
                {
                    "sent": "Almost as importantly, you also find that.",
                    "label": 0
                },
                {
                    "sent": "So when you build a model you say hey, it's 89% accurate, but you have to look at it.",
                    "label": 0
                },
                {
                    "sent": "It will be 11%.",
                    "label": 0
                },
                {
                    "sent": "It's wrong on is that uniformly distributed?",
                    "label": 0
                },
                {
                    "sent": "Is that across all kinds of people?",
                    "label": 0
                },
                {
                    "sent": "Or is it mostly wrong about certain types of people?",
                    "label": 0
                },
                {
                    "sent": "So for example, if certain types of people don't fill out some forms, that means you have missing values in your data about those people.",
                    "label": 0
                },
                {
                    "sent": "You will have a higher proportion of errors under, so just like we'd run tests for, you know, like when you write good software you run.",
                    "label": 0
                },
                {
                    "sent": "You run tests on software.",
                    "label": 0
                },
                {
                    "sent": "When you build good models, you run test on models on accuracy and precision and recall.",
                    "label": 1
                },
                {
                    "sent": "You also want to be able to run those tests for fairness and bias.",
                    "label": 0
                },
                {
                    "sent": "Who are you making errors on?",
                    "label": 0
                },
                {
                    "sent": "Who are you making predictions on in your predicted group?",
                    "label": 0
                },
                {
                    "sent": "How many people are there from male and female?",
                    "label": 0
                },
                {
                    "sent": "How many are in your data overall?",
                    "label": 0
                },
                {
                    "sent": "How many people who are different colors but different backgrounds anytime you want to be not be unfair to any type of people, you want to be able to run those checks as soon as your model builds, right?",
                    "label": 0
                },
                {
                    "sent": "You have this big thing set up where every time you build a model.",
                    "label": 0
                },
                {
                    "sent": "Yes, it generates graphs for performance and accuracy, but it should also generate these statistics for for fairness.",
                    "label": 0
                },
                {
                    "sent": "Ann and then make sure that people can actually audit those and then correct for those.",
                    "label": 0
                },
                {
                    "sent": "So you can imagine in your classifier when you're building an SVM for your classifier, you're trying to deal with the margin.",
                    "label": 0
                },
                {
                    "sent": "What about also dealing with bias in the same thing where this model gives me better accuracy but is slightly more biased because it's very easy to pick up on one Dimension 1 feature and say that's the one that matters, but you care about other things as well.",
                    "label": 0
                },
                {
                    "sent": "And because of all these different things, what you sort of?",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Realizes you know, we're sort of used to thinking, well, we really need mostly these two skills to solve these problems.",
                    "label": 0
                },
                {
                    "sent": "If you can correct code and do some stats, you're done, and it turns out that to do all of those problems well, you know the server school is great.",
                    "label": 0
                },
                {
                    "sent": "If it's giving you a little bit of you know of these, but you have to do all of these other things in order to actually solve any of these problems, you have to know how to start formulating a problem, and you guys have struggled with that little bit of debate when you're defining your projects, that's.",
                    "label": 0
                },
                {
                    "sent": "Really important skills, probably the most the most important skill you need to have.",
                    "label": 0
                },
                {
                    "sent": "You know more than because you you can have all of these skills, but then you need somebody to tell you what problems to solve, right?",
                    "label": 0
                },
                {
                    "sent": "So you need to know how to define a problem.",
                    "label": 0
                },
                {
                    "sent": "And in my experience, like that's the scale that.",
                    "label": 0
                },
                {
                    "sent": "Most people don't come out of, you know, from from school, right from grad school.",
                    "label": 0
                },
                {
                    "sent": "So if you know how to find a problem, you have to know how to communicate both when you start solving the problem, because you convince somebody this problem is where it's solving.",
                    "label": 0
                },
                {
                    "sent": "Once you've solved it in to convince them to use it.",
                    "label": 0
                },
                {
                    "sent": "Because all the work you did, somebody has to be able to use this thing, otherwise it's pointless, right?",
                    "label": 0
                },
                {
                    "sent": "You have to convince them about that.",
                    "label": 0
                },
                {
                    "sent": "You have to understand the ethical and legal issues because you have to convince it all again at least problems to allow you to.",
                    "label": 0
                },
                {
                    "sent": "Solve this problem again and that means understanding what the legal issues are and being able to talk about ethics and about public policy with these people who are making these decisions.",
                    "label": 0
                },
                {
                    "sent": "And then once you build these models over here, you have to know how to run an experiment.",
                    "label": 0
                },
                {
                    "sent": "100 design an experiment on your computer with humans, typically to test and validate whether this thing works or not, and a lot of us sort of ignore these things over here because we said we live in this world.",
                    "label": 0
                },
                {
                    "sent": "We know it's like we keep predicting, predicting, predicting and then we watched those predictions come true.",
                    "label": 0
                },
                {
                    "sent": "Whereas people over here try really focused on often changing behavior, causal inference and changing things, but often agnostic too.",
                    "label": 0
                },
                {
                    "sent": "I know what's going to happen.",
                    "label": 0
                },
                {
                    "sent": "Maybe I should use that information to change behavior so there's a lot of sort of work at the intersection of these things.",
                    "label": 0
                },
                {
                    "sent": "That's that's really interesting.",
                    "label": 0
                },
                {
                    "sent": "That needs to come together.",
                    "label": 0
                },
                {
                    "sent": "So we had a lot of this work that we talked.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Initially started off in a summer program that I do call data science for social good basically is.",
                    "label": 1
                },
                {
                    "sent": "Kind of like this summer school, but three months where we get mostly PhD students from.",
                    "label": 0
                },
                {
                    "sent": "From these three areas in computer science and statistics and math and econ and sociology and public policy and engineering and physics, and they come together for three months.",
                    "label": 0
                },
                {
                    "sent": "Working teams, 3, four on these types of projects all summer.",
                    "label": 0
                },
                {
                    "sent": "So that's when I had happy to take questions in.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "In the negative, 2 minutes that I have so thank you.",
                    "label": 0
                }
            ]
        }
    }
}