{
    "id": "2bafvf4ywrr4olyr3wswvsxu6kx27q3t",
    "title": "OpenCourseWare in Europe: How to Make Use of Its Full Potential for Virtual Mobility",
    "info": {
        "author": [
            "Gijs Houwen, Delft University of Technology (TU Delft)",
            "Ignasi Labastida, University of Barcelona",
            "Willem van Valkenburg, Delft University of Technology (TU Delft)"
        ],
        "published": "June 23, 2014",
        "recorded": "April 2014",
        "category": [
            "Top->Social Sciences->Education",
            "Top->Social Sciences->Society->Public Policy"
        ]
    },
    "url": "http://videolectures.net/ocwc2014_valkenburg_labastida_houwen_open_course/",
    "segmentation": [
        [
            "I will start."
        ],
        [
            "About open courseware Europe an will have.",
            "On the List 4 presenter spots, we decided that four in 30 minutes is too much, so will we stick with free Ann?",
            "Mary Lou will is in the room and she can answer questions, but she won't present here.",
            "My name is William Falkenberg.",
            "I work for Delta University of Technology and I was the project manager of Open Courseware Europe and we have Ignacia Labs data from University of Barcelona.",
            "There is an he was responsible for.",
            "Work packets to about Copyright and legal guide guidelines.",
            "And then we have merilou for everyone knows Mary Lou.",
            "I think Sister Exective, director of the Open Courseware consortium.",
            "No further introduction necessary and we have high sawin and colleague of mine from Delft an he has been working on open policies."
        ],
        [
            "So I'm going to talk about the project as a whole and then Ignacia will tell more detail about legal guidelines.",
            "An heist will talk more about open policies, so there's two parts that will fit in this 30 minutes, and there are other presentations is think tomorrow where a fresh challenge will present.",
            "Also one of the projects within this project.",
            "Yes."
        ],
        [
            "Here we go."
        ],
        [
            "Open courseware Europe as a project funded by the European Commission.",
            "I think we've written it in 2010 at the end of 2010, so there were no mooks.",
            "It was a completely different world.",
            "When we started.",
            "We started in 2011 an we had partners from University Polytechnic, Madrid.",
            "Grow from Lyon Delft University of Barcelona and Carol often and we had two what they call third parties as Creative Commons, an open courseware consortium.",
            "Very important for the project to get a lot of expertise from that from those groups.",
            "And here are some of the people that are participating."
        ],
        [
            "So the project was really focused on open courseware an actually during the project we more more talked about open education.",
            "I think that's a very common.",
            "Happening because of time.",
            "I'm not showing complete video.",
            "I have a screenshot but we made a couple of videos about showing why.",
            "Open education Open Courseware is interest for students and teachers.",
            "An you she should really take a look at them and I think they will show them tomorrow in the presentation of fresh Ryan Fred one issuer presentation.",
            "Tomorrow at 2:30 is the presentation, then you will see the video."
        ],
        [
            "The objectives of the project was to facilitate virtual mobility, an an that meant looking at all the preconditions for using open courseware.",
            "But also working getting more cooperation between European universities, institutions in working together on open courseware, an eventually mutual use of materials and even joint degrees.",
            "What we're thinking of an at the end.",
            "It should enhance the quality and increased the usage of online courses.",
            "That's the end goal for this project.",
            "We didn't reach that we had a couple of deliverables."
        ],
        [
            "Anne, of most of them are already online or others will come online in the next month because then the project is ending.",
            "So we have tutoring.",
            "So what we did is we have some guidelines for how to implement open courseware, how just get started with that.",
            "We analyzed a lot of good practices around the Europe and outside we made some interesting videos.",
            "We did an overview of EU Copyright legislation.",
            "An all the difference is there and the problems that we have there.",
            "We set up some guidelines for quality accreditation.",
            "We have set up in Student Handbook.",
            "On virtual mobility we have set up a case study library, an open policy's so a lot of things that I think are very useful for universities that want to start with open education open courseware, an they can use it an it will help them to get started."
        ],
        [
            "And then the floor to Ignasi.",
            "Thank you William.",
            "So one of the first things we did in the."
        ],
        [
            "In the guidelines of two in the project was to do a report of the current practices in the open courseware sites regarding specially Copyright and the use of Creative Commons license and open Content license general, we knew that there was some doubt some misunderstanding about the use of their license.",
            "So in fact, when we did all this report, we found this.",
            "Those misunderstandings, those missing some incoherence, somente entity.",
            "About it, so we thought that it would be a good idea to offer some basic guidelines, specially on the use of dealing with Copyright, because we think that when we are talking about open educational resources and before William ask about which is the license in this open discovery space portal, so we think that it's an important issue and it is many of the teachers or creators of educational resources are really concerned about the topics of Copyright and.",
            "I can't then license."
        ],
        [
            "So what we found in the in the first report was that in some places there was no Copyright notice in some place where there was a kind of mix.",
            "Sometimes were saying that the Copyright Holder was the institution, sometimes the Copyright Holder was the Alpha or so.",
            "Maybe the professor or lecturer who create the.",
            "The contents in other places, what we've seen is that maybe the portal was mentioning a license and the contents got different license, or maybe depending on the if you enter into the repository or you enter through the open courseware site, there were differences in the license of these things may cause some fear about in the user because maybe in one place they will allow you to make derivative words.",
            "In other places you are not allowed to do so.",
            "So it makes this Russian ability.",
            "Unsafe for the user to know what they can do.",
            "And of course another thing that we were we saw is that in many of the open courseware site, the content itself has not any license.",
            "So what it means it means that when once you download this content and you use it in other places, you lost the information about the license so you don't know where you can do with this content so."
        ],
        [
            "The guidelines we separate the guidelines in three topics.",
            "The first topic is to decide we think that it's visible to the to an open courseware or an open application project to 1st decide who owns Copyright in an institution.",
            "It's important to know if those contents belong to the University, belong to the author, or it could belong to both.",
            "Or maybe it can be licensed to the University to be reused.",
            "So that's an important thing to inform people because afterwards if you're using.",
            "And open content license with some restrictions.",
            "For instant, noncommercial or maybe non derivative or conditions on the relative, you have to know to whom you should address to ask for more permissions because maybe you lose some opportunities.",
            "There is a case in Spain where the Ministry of Education didn't know who own some resources and publisher commercial publisher wanted to reuse but didn't know who owned the Copyright so they didn't know to whom ask for this commercial purpose."
        ],
        [
            "Another important thing is that you can be flexible about Copyright.",
            "It's and advise that we have given in many workshops that you can say things like otherwise.",
            "Note all content in this site are licensed under one default license, but then if you have other content with other conditions, maybe it can be even with all right reserved.",
            "You can say there this content is different than the default site because it will allow you to reuse other peoples.",
            "I'm telling your own site."
        ],
        [
            "Regarding content, the license, the use of the license, of course.",
            "Creative Commons gives 6 License, 6 opportunities to share in different ways.",
            "It also gave these CC0 license that is more like a waiver and also they allow you to put this public domain mark.",
            "But we think that for educational resources we should limit the license to this.",
            "For why?",
            "Because we think that the educational resources we need.",
            "To allow the transformation to allow to the creation of derivative works, I think it doesn't make sense to restrict the derivative works because.",
            "It's usually it's impossible to reuse the exactly the same resource.",
            "You will always need maybe to adapt not just in your language.",
            "Maybe also to your culture.",
            "It makes some difference if you use a material from another culture, maybe in your country or in your situation will not be understood, so we would like to stuck to this for license.",
            "And of course the most open.",
            "I will advise to use the first one.",
            "So the more broadly open and I think if we go back to the basics of the open definition, I think this one is the one who's tricks is an open license."
        ],
        [
            "Another challenging thing is to Mark Hunt, and I think it's important to say to the people that this content This site is under a license, but marking content is not just putting up.",
            "Sorry, it's not just put a sentence like this one over an image like this one.",
            "An icon like this one.",
            "It's important to give the code to give the information with this small thing REL equals license.",
            "Search engines can find you there.",
            "All search engines Google Yahoo.",
            "All these search engines could find content under Creative Commons license.",
            "So with just including this tag, your portal will be fundable.",
            "It's important Lee.",
            "This morning I was discussing with some people from Spanish universities and they were surprised if we didn't put exactly the same image and all that, but we are fundable and why they were refundable because they just put this link here.",
            "And they can they know that in a portal when they check for open content, they they were the open courseware site of this institution."
        ],
        [
            "Another important thing is to mark the content itself.",
            "Here is a an image of a book, a book that is in PDF, but it's also in paper that's important to know that it's important to know that that you can put a license to into any format, but it's important to say."
        ],
        [
            "But not here, not just to put the license, you have to at least give this link to inform people where is the official text of the license to let people know where you can find the license.",
            "It's the same for instance in.",
            "In images and images you can put a footnote with your license or even you can put inside the image if you put it inside the image when the image changes from platform to platform to content to content, the license goes with the image, so it's another advisor we would like to give to the people who create this kind of."
        ],
        [
            "Contents and of course, the more challenging is to embed the code of the licenses with it, with the HTML into the content itself in the format or PDF.",
            "There is the this format X MP that in Creative Commons.",
            "When you choose the license in Creative Commons site, they will give you the code, but there are other options.",
            "In MP Threes they got the ID 3 tag system, Ogg.",
            "Have these comments on Barbies, but I have to say that it's not.",
            "Easy is not friendly, but you can if you like to play a little bit with technology.",
            "You in this page you will find different advice how to Mark content and embed the the license itself is not.",
            "It's not just the humans can read the license, it's important that machines could understand that behind that content there is an image."
        ],
        [
            "Guys.",
            "OK, as you all heard from Ignacio, we're all about guidelines.",
            "So for open policies of course also guidelines, but first very."
        ],
        [
            "Shortly, why did we decide to include open policy in our project?",
            "Well, we feel that open policy's policies in general are a very important tool to drive the use and production of.",
            "Of open courseware an other open education resources.",
            "It's also very important to get open education integrated into an educational practice that there are policies in place that support that.",
            "So we set out to develop some resources concerning open policies.",
            "As mentioned before, we created a case study library with people who are experienced in creating open policies.",
            "From that we derived this.",
            "The open policy guidelines."
        ],
        [
            "What we found when we started working on the open policies is there's a lot of different policy's at different levels, so there are international policies that go beyond the national boundaries.",
            "There can be national or regional policies that can be policies within consortia, like the Open Courseware Consortium.",
            "For example, an there can be institutional policies at universities.",
            "And all of these policies can have a different character.",
            "They can be binding policies that have been formalized, so that's pretty strict.",
            "There can also be international declarations that are formalized but not binding.",
            "You can also be very pragmatic and have a non formal policy in place at your institution just to get your project going."
        ],
        [
            "So the case study library.",
            "There's some best practice examples.",
            "We've included all the different levels of policy, so there's consorcia policy's their institutional policies, and we've asked all the people we have interviewed about their experience an about the lessons learned, and also what advised they want to share from their own experience.",
            "For those who are just getting started with open policies.",
            "I'm from those lessons and their advice.",
            "We have the open policy guidelines.",
            "It basically runs you through the process of what is needed to get a policy in place.",
            "They are guidelines, so treat him as such, it's not.",
            "It's not very rigid.",
            "You can step in at different different points in time at different steps depending on what kind of policy you want, what the role is at your institution, etc.",
            "As good open practice dictates, we've also referenced a couple of open toolkits.",
            "There's a Africa Toolkit Open Consortium toolkit, an ovr Asia that also related to different policy steps."
        ],
        [
            "So basically the starting point, what do you want to do?",
            "So why an open policy?",
            "An open policy is a means to what ends we think that's really important to get going.",
            "Getting started with Open education workshop.",
            "We did here yesterday.",
            "We already found that question number two.",
            "What do you want is already a lot harder to answer.",
            "So in the 30 minutes we had a lot of people didn't even get past that question.",
            "But it's an important one.",
            "Before you get going.",
            "Of course, I would even say that it's Paramount that Jeff, your institutional goals set out so the rest of the policy will follow from that.",
            "Well, why open policy?",
            "We also ask the people, do you really need one?",
            "Will it help you at this point in time of your project, or can you just get going and get a supportive policy later on?",
            "So just discuss a couple of policy types so you can be pragmatic and have a non binding policy in place just to get people motivated just to facilitate the open education activities at your institution.",
            "Or when you're further along the road, you might think about getting a formal policy or adhering to one of the international declarations.",
            "As a realization phase, that's once you have all the other policy goals set out, of course, so.",
            "That's where you start.",
            "Working with the decisions that you have made on the character of your policy.",
            "Then the implementation phase is looking at how do we get this policy in place?",
            "How do we get it approved?",
            "Who needs to be involved an?",
            "Also, how does it fit in with our strategy or core business at at my institution then for the implementation phase, what we learn from the case studies is that it's often advised to make sure that you can start small that you have some room for experimentation an just get going and learn from that and.",
            "Built on that.",
            "And what's also very important is that you include some indicators for evaluation.",
            "I'm not necessarily saying we want to reach 100,000 people, but have some goals in place that one sure six months down the road or one year you can evaluate and you can see are we heading in the right direction?",
            "Are we making the right progress?",
            "So those are the guidelines which are also online.",
            "If you would like to see some more."
        ],
        [
            "So really quickly, the lessons learned from the case study.",
            "Ask yourself, do I really need an open policy at this point in time?",
            "Make sure that the policy relates to the practice.",
            "Do you want your policy to support the practice?",
            "Do you want to drive practice with your policy?",
            "Policy by definition has more than one person in there, sometimes even more institutions, so one size fits all, probably not, but you have to make some concessions here and there.",
            "Important is to make it fit with existing policy's, just to make life easy for yourself.",
            "Be aware of the process that is needed to get a policy in place.",
            "Be pragmatic.",
            "Start building a team with people who really believe in open education.",
            "That's very basic, but I think that's very helpful and make sure that you have some indicators set out so that you can evaluate."
        ],
        [
            "William.",
            "Alright, to wrap this up, the project is ending, but we don't see that as the end of the project.",
            "We see it as a start of open courseware Europe or Open Education Consortium Europe.",
            "We're still looking at the name, but it's really that we want to continue to use this network of people that are involved in open education and especially we have a lot of experts here.",
            "We have a lot of knowledge and I see if we can.",
            "Get them together and work together and share their experience around Europe.",
            "I think we are.",
            "We've seen this morning with the European Commissioner that Europe is really focused on open opening up an I think we have a lot of expertise but a lot of things are done with projects an when a project stops.",
            "People go back and they don't keep sharing their knowledge, so we're still in progress in setting up how we're going to organize it, but that's the idea.",
            "So if you're interested, please leave your business cards and will keep you informed.",
            "Anne Anne now room.",
            "For questions."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will start.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "About open courseware Europe an will have.",
                    "label": 0
                },
                {
                    "sent": "On the List 4 presenter spots, we decided that four in 30 minutes is too much, so will we stick with free Ann?",
                    "label": 0
                },
                {
                    "sent": "Mary Lou will is in the room and she can answer questions, but she won't present here.",
                    "label": 0
                },
                {
                    "sent": "My name is William Falkenberg.",
                    "label": 0
                },
                {
                    "sent": "I work for Delta University of Technology and I was the project manager of Open Courseware Europe and we have Ignacia Labs data from University of Barcelona.",
                    "label": 1
                },
                {
                    "sent": "There is an he was responsible for.",
                    "label": 0
                },
                {
                    "sent": "Work packets to about Copyright and legal guide guidelines.",
                    "label": 0
                },
                {
                    "sent": "And then we have merilou for everyone knows Mary Lou.",
                    "label": 0
                },
                {
                    "sent": "I think Sister Exective, director of the Open Courseware consortium.",
                    "label": 0
                },
                {
                    "sent": "No further introduction necessary and we have high sawin and colleague of mine from Delft an he has been working on open policies.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'm going to talk about the project as a whole and then Ignacia will tell more detail about legal guidelines.",
                    "label": 1
                },
                {
                    "sent": "An heist will talk more about open policies, so there's two parts that will fit in this 30 minutes, and there are other presentations is think tomorrow where a fresh challenge will present.",
                    "label": 0
                },
                {
                    "sent": "Also one of the projects within this project.",
                    "label": 1
                },
                {
                    "sent": "Yes.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here we go.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Open courseware Europe as a project funded by the European Commission.",
                    "label": 1
                },
                {
                    "sent": "I think we've written it in 2010 at the end of 2010, so there were no mooks.",
                    "label": 0
                },
                {
                    "sent": "It was a completely different world.",
                    "label": 0
                },
                {
                    "sent": "When we started.",
                    "label": 0
                },
                {
                    "sent": "We started in 2011 an we had partners from University Polytechnic, Madrid.",
                    "label": 0
                },
                {
                    "sent": "Grow from Lyon Delft University of Barcelona and Carol often and we had two what they call third parties as Creative Commons, an open courseware consortium.",
                    "label": 0
                },
                {
                    "sent": "Very important for the project to get a lot of expertise from that from those groups.",
                    "label": 0
                },
                {
                    "sent": "And here are some of the people that are participating.",
                    "label": 1
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the project was really focused on open courseware an actually during the project we more more talked about open education.",
                    "label": 0
                },
                {
                    "sent": "I think that's a very common.",
                    "label": 0
                },
                {
                    "sent": "Happening because of time.",
                    "label": 0
                },
                {
                    "sent": "I'm not showing complete video.",
                    "label": 0
                },
                {
                    "sent": "I have a screenshot but we made a couple of videos about showing why.",
                    "label": 0
                },
                {
                    "sent": "Open education Open Courseware is interest for students and teachers.",
                    "label": 0
                },
                {
                    "sent": "An you she should really take a look at them and I think they will show them tomorrow in the presentation of fresh Ryan Fred one issuer presentation.",
                    "label": 0
                },
                {
                    "sent": "Tomorrow at 2:30 is the presentation, then you will see the video.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The objectives of the project was to facilitate virtual mobility, an an that meant looking at all the preconditions for using open courseware.",
                    "label": 1
                },
                {
                    "sent": "But also working getting more cooperation between European universities, institutions in working together on open courseware, an eventually mutual use of materials and even joint degrees.",
                    "label": 1
                },
                {
                    "sent": "What we're thinking of an at the end.",
                    "label": 1
                },
                {
                    "sent": "It should enhance the quality and increased the usage of online courses.",
                    "label": 0
                },
                {
                    "sent": "That's the end goal for this project.",
                    "label": 0
                },
                {
                    "sent": "We didn't reach that we had a couple of deliverables.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Anne, of most of them are already online or others will come online in the next month because then the project is ending.",
                    "label": 0
                },
                {
                    "sent": "So we have tutoring.",
                    "label": 0
                },
                {
                    "sent": "So what we did is we have some guidelines for how to implement open courseware, how just get started with that.",
                    "label": 0
                },
                {
                    "sent": "We analyzed a lot of good practices around the Europe and outside we made some interesting videos.",
                    "label": 0
                },
                {
                    "sent": "We did an overview of EU Copyright legislation.",
                    "label": 1
                },
                {
                    "sent": "An all the difference is there and the problems that we have there.",
                    "label": 0
                },
                {
                    "sent": "We set up some guidelines for quality accreditation.",
                    "label": 0
                },
                {
                    "sent": "We have set up in Student Handbook.",
                    "label": 0
                },
                {
                    "sent": "On virtual mobility we have set up a case study library, an open policy's so a lot of things that I think are very useful for universities that want to start with open education open courseware, an they can use it an it will help them to get started.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then the floor to Ignasi.",
                    "label": 0
                },
                {
                    "sent": "Thank you William.",
                    "label": 0
                },
                {
                    "sent": "So one of the first things we did in the.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In the guidelines of two in the project was to do a report of the current practices in the open courseware sites regarding specially Copyright and the use of Creative Commons license and open Content license general, we knew that there was some doubt some misunderstanding about the use of their license.",
                    "label": 1
                },
                {
                    "sent": "So in fact, when we did all this report, we found this.",
                    "label": 0
                },
                {
                    "sent": "Those misunderstandings, those missing some incoherence, somente entity.",
                    "label": 0
                },
                {
                    "sent": "About it, so we thought that it would be a good idea to offer some basic guidelines, specially on the use of dealing with Copyright, because we think that when we are talking about open educational resources and before William ask about which is the license in this open discovery space portal, so we think that it's an important issue and it is many of the teachers or creators of educational resources are really concerned about the topics of Copyright and.",
                    "label": 0
                },
                {
                    "sent": "I can't then license.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what we found in the in the first report was that in some places there was no Copyright notice in some place where there was a kind of mix.",
                    "label": 1
                },
                {
                    "sent": "Sometimes were saying that the Copyright Holder was the institution, sometimes the Copyright Holder was the Alpha or so.",
                    "label": 0
                },
                {
                    "sent": "Maybe the professor or lecturer who create the.",
                    "label": 0
                },
                {
                    "sent": "The contents in other places, what we've seen is that maybe the portal was mentioning a license and the contents got different license, or maybe depending on the if you enter into the repository or you enter through the open courseware site, there were differences in the license of these things may cause some fear about in the user because maybe in one place they will allow you to make derivative words.",
                    "label": 0
                },
                {
                    "sent": "In other places you are not allowed to do so.",
                    "label": 0
                },
                {
                    "sent": "So it makes this Russian ability.",
                    "label": 0
                },
                {
                    "sent": "Unsafe for the user to know what they can do.",
                    "label": 0
                },
                {
                    "sent": "And of course another thing that we were we saw is that in many of the open courseware site, the content itself has not any license.",
                    "label": 0
                },
                {
                    "sent": "So what it means it means that when once you download this content and you use it in other places, you lost the information about the license so you don't know where you can do with this content so.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The guidelines we separate the guidelines in three topics.",
                    "label": 0
                },
                {
                    "sent": "The first topic is to decide we think that it's visible to the to an open courseware or an open application project to 1st decide who owns Copyright in an institution.",
                    "label": 0
                },
                {
                    "sent": "It's important to know if those contents belong to the University, belong to the author, or it could belong to both.",
                    "label": 0
                },
                {
                    "sent": "Or maybe it can be licensed to the University to be reused.",
                    "label": 0
                },
                {
                    "sent": "So that's an important thing to inform people because afterwards if you're using.",
                    "label": 0
                },
                {
                    "sent": "And open content license with some restrictions.",
                    "label": 0
                },
                {
                    "sent": "For instant, noncommercial or maybe non derivative or conditions on the relative, you have to know to whom you should address to ask for more permissions because maybe you lose some opportunities.",
                    "label": 0
                },
                {
                    "sent": "There is a case in Spain where the Ministry of Education didn't know who own some resources and publisher commercial publisher wanted to reuse but didn't know who owned the Copyright so they didn't know to whom ask for this commercial purpose.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another important thing is that you can be flexible about Copyright.",
                    "label": 1
                },
                {
                    "sent": "It's and advise that we have given in many workshops that you can say things like otherwise.",
                    "label": 0
                },
                {
                    "sent": "Note all content in this site are licensed under one default license, but then if you have other content with other conditions, maybe it can be even with all right reserved.",
                    "label": 1
                },
                {
                    "sent": "You can say there this content is different than the default site because it will allow you to reuse other peoples.",
                    "label": 0
                },
                {
                    "sent": "I'm telling your own site.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Regarding content, the license, the use of the license, of course.",
                    "label": 1
                },
                {
                    "sent": "Creative Commons gives 6 License, 6 opportunities to share in different ways.",
                    "label": 0
                },
                {
                    "sent": "It also gave these CC0 license that is more like a waiver and also they allow you to put this public domain mark.",
                    "label": 0
                },
                {
                    "sent": "But we think that for educational resources we should limit the license to this.",
                    "label": 0
                },
                {
                    "sent": "For why?",
                    "label": 0
                },
                {
                    "sent": "Because we think that the educational resources we need.",
                    "label": 0
                },
                {
                    "sent": "To allow the transformation to allow to the creation of derivative works, I think it doesn't make sense to restrict the derivative works because.",
                    "label": 0
                },
                {
                    "sent": "It's usually it's impossible to reuse the exactly the same resource.",
                    "label": 0
                },
                {
                    "sent": "You will always need maybe to adapt not just in your language.",
                    "label": 0
                },
                {
                    "sent": "Maybe also to your culture.",
                    "label": 0
                },
                {
                    "sent": "It makes some difference if you use a material from another culture, maybe in your country or in your situation will not be understood, so we would like to stuck to this for license.",
                    "label": 0
                },
                {
                    "sent": "And of course the most open.",
                    "label": 0
                },
                {
                    "sent": "I will advise to use the first one.",
                    "label": 0
                },
                {
                    "sent": "So the more broadly open and I think if we go back to the basics of the open definition, I think this one is the one who's tricks is an open license.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another challenging thing is to Mark Hunt, and I think it's important to say to the people that this content This site is under a license, but marking content is not just putting up.",
                    "label": 0
                },
                {
                    "sent": "Sorry, it's not just put a sentence like this one over an image like this one.",
                    "label": 0
                },
                {
                    "sent": "An icon like this one.",
                    "label": 0
                },
                {
                    "sent": "It's important to give the code to give the information with this small thing REL equals license.",
                    "label": 0
                },
                {
                    "sent": "Search engines can find you there.",
                    "label": 0
                },
                {
                    "sent": "All search engines Google Yahoo.",
                    "label": 0
                },
                {
                    "sent": "All these search engines could find content under Creative Commons license.",
                    "label": 1
                },
                {
                    "sent": "So with just including this tag, your portal will be fundable.",
                    "label": 0
                },
                {
                    "sent": "It's important Lee.",
                    "label": 0
                },
                {
                    "sent": "This morning I was discussing with some people from Spanish universities and they were surprised if we didn't put exactly the same image and all that, but we are fundable and why they were refundable because they just put this link here.",
                    "label": 0
                },
                {
                    "sent": "And they can they know that in a portal when they check for open content, they they were the open courseware site of this institution.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another important thing is to mark the content itself.",
                    "label": 0
                },
                {
                    "sent": "Here is a an image of a book, a book that is in PDF, but it's also in paper that's important to know that it's important to know that that you can put a license to into any format, but it's important to say.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But not here, not just to put the license, you have to at least give this link to inform people where is the official text of the license to let people know where you can find the license.",
                    "label": 0
                },
                {
                    "sent": "It's the same for instance in.",
                    "label": 0
                },
                {
                    "sent": "In images and images you can put a footnote with your license or even you can put inside the image if you put it inside the image when the image changes from platform to platform to content to content, the license goes with the image, so it's another advisor we would like to give to the people who create this kind of.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Contents and of course, the more challenging is to embed the code of the licenses with it, with the HTML into the content itself in the format or PDF.",
                    "label": 1
                },
                {
                    "sent": "There is the this format X MP that in Creative Commons.",
                    "label": 0
                },
                {
                    "sent": "When you choose the license in Creative Commons site, they will give you the code, but there are other options.",
                    "label": 0
                },
                {
                    "sent": "In MP Threes they got the ID 3 tag system, Ogg.",
                    "label": 0
                },
                {
                    "sent": "Have these comments on Barbies, but I have to say that it's not.",
                    "label": 1
                },
                {
                    "sent": "Easy is not friendly, but you can if you like to play a little bit with technology.",
                    "label": 0
                },
                {
                    "sent": "You in this page you will find different advice how to Mark content and embed the the license itself is not.",
                    "label": 0
                },
                {
                    "sent": "It's not just the humans can read the license, it's important that machines could understand that behind that content there is an image.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Guys.",
                    "label": 0
                },
                {
                    "sent": "OK, as you all heard from Ignacio, we're all about guidelines.",
                    "label": 0
                },
                {
                    "sent": "So for open policies of course also guidelines, but first very.",
                    "label": 1
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Shortly, why did we decide to include open policy in our project?",
                    "label": 1
                },
                {
                    "sent": "Well, we feel that open policy's policies in general are a very important tool to drive the use and production of.",
                    "label": 0
                },
                {
                    "sent": "Of open courseware an other open education resources.",
                    "label": 0
                },
                {
                    "sent": "It's also very important to get open education integrated into an educational practice that there are policies in place that support that.",
                    "label": 0
                },
                {
                    "sent": "So we set out to develop some resources concerning open policies.",
                    "label": 0
                },
                {
                    "sent": "As mentioned before, we created a case study library with people who are experienced in creating open policies.",
                    "label": 1
                },
                {
                    "sent": "From that we derived this.",
                    "label": 0
                },
                {
                    "sent": "The open policy guidelines.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What we found when we started working on the open policies is there's a lot of different policy's at different levels, so there are international policies that go beyond the national boundaries.",
                    "label": 1
                },
                {
                    "sent": "There can be national or regional policies that can be policies within consortia, like the Open Courseware Consortium.",
                    "label": 0
                },
                {
                    "sent": "For example, an there can be institutional policies at universities.",
                    "label": 1
                },
                {
                    "sent": "And all of these policies can have a different character.",
                    "label": 0
                },
                {
                    "sent": "They can be binding policies that have been formalized, so that's pretty strict.",
                    "label": 0
                },
                {
                    "sent": "There can also be international declarations that are formalized but not binding.",
                    "label": 0
                },
                {
                    "sent": "You can also be very pragmatic and have a non formal policy in place at your institution just to get your project going.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the case study library.",
                    "label": 1
                },
                {
                    "sent": "There's some best practice examples.",
                    "label": 0
                },
                {
                    "sent": "We've included all the different levels of policy, so there's consorcia policy's their institutional policies, and we've asked all the people we have interviewed about their experience an about the lessons learned, and also what advised they want to share from their own experience.",
                    "label": 1
                },
                {
                    "sent": "For those who are just getting started with open policies.",
                    "label": 1
                },
                {
                    "sent": "I'm from those lessons and their advice.",
                    "label": 0
                },
                {
                    "sent": "We have the open policy guidelines.",
                    "label": 0
                },
                {
                    "sent": "It basically runs you through the process of what is needed to get a policy in place.",
                    "label": 0
                },
                {
                    "sent": "They are guidelines, so treat him as such, it's not.",
                    "label": 0
                },
                {
                    "sent": "It's not very rigid.",
                    "label": 0
                },
                {
                    "sent": "You can step in at different different points in time at different steps depending on what kind of policy you want, what the role is at your institution, etc.",
                    "label": 0
                },
                {
                    "sent": "As good open practice dictates, we've also referenced a couple of open toolkits.",
                    "label": 0
                },
                {
                    "sent": "There's a Africa Toolkit Open Consortium toolkit, an ovr Asia that also related to different policy steps.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So basically the starting point, what do you want to do?",
                    "label": 1
                },
                {
                    "sent": "So why an open policy?",
                    "label": 0
                },
                {
                    "sent": "An open policy is a means to what ends we think that's really important to get going.",
                    "label": 0
                },
                {
                    "sent": "Getting started with Open education workshop.",
                    "label": 0
                },
                {
                    "sent": "We did here yesterday.",
                    "label": 0
                },
                {
                    "sent": "We already found that question number two.",
                    "label": 0
                },
                {
                    "sent": "What do you want is already a lot harder to answer.",
                    "label": 0
                },
                {
                    "sent": "So in the 30 minutes we had a lot of people didn't even get past that question.",
                    "label": 0
                },
                {
                    "sent": "But it's an important one.",
                    "label": 0
                },
                {
                    "sent": "Before you get going.",
                    "label": 0
                },
                {
                    "sent": "Of course, I would even say that it's Paramount that Jeff, your institutional goals set out so the rest of the policy will follow from that.",
                    "label": 0
                },
                {
                    "sent": "Well, why open policy?",
                    "label": 0
                },
                {
                    "sent": "We also ask the people, do you really need one?",
                    "label": 0
                },
                {
                    "sent": "Will it help you at this point in time of your project, or can you just get going and get a supportive policy later on?",
                    "label": 0
                },
                {
                    "sent": "So just discuss a couple of policy types so you can be pragmatic and have a non binding policy in place just to get people motivated just to facilitate the open education activities at your institution.",
                    "label": 0
                },
                {
                    "sent": "Or when you're further along the road, you might think about getting a formal policy or adhering to one of the international declarations.",
                    "label": 0
                },
                {
                    "sent": "As a realization phase, that's once you have all the other policy goals set out, of course, so.",
                    "label": 0
                },
                {
                    "sent": "That's where you start.",
                    "label": 0
                },
                {
                    "sent": "Working with the decisions that you have made on the character of your policy.",
                    "label": 1
                },
                {
                    "sent": "Then the implementation phase is looking at how do we get this policy in place?",
                    "label": 0
                },
                {
                    "sent": "How do we get it approved?",
                    "label": 0
                },
                {
                    "sent": "Who needs to be involved an?",
                    "label": 0
                },
                {
                    "sent": "Also, how does it fit in with our strategy or core business at at my institution then for the implementation phase, what we learn from the case studies is that it's often advised to make sure that you can start small that you have some room for experimentation an just get going and learn from that and.",
                    "label": 0
                },
                {
                    "sent": "Built on that.",
                    "label": 0
                },
                {
                    "sent": "And what's also very important is that you include some indicators for evaluation.",
                    "label": 0
                },
                {
                    "sent": "I'm not necessarily saying we want to reach 100,000 people, but have some goals in place that one sure six months down the road or one year you can evaluate and you can see are we heading in the right direction?",
                    "label": 0
                },
                {
                    "sent": "Are we making the right progress?",
                    "label": 0
                },
                {
                    "sent": "So those are the guidelines which are also online.",
                    "label": 0
                },
                {
                    "sent": "If you would like to see some more.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So really quickly, the lessons learned from the case study.",
                    "label": 0
                },
                {
                    "sent": "Ask yourself, do I really need an open policy at this point in time?",
                    "label": 1
                },
                {
                    "sent": "Make sure that the policy relates to the practice.",
                    "label": 1
                },
                {
                    "sent": "Do you want your policy to support the practice?",
                    "label": 0
                },
                {
                    "sent": "Do you want to drive practice with your policy?",
                    "label": 0
                },
                {
                    "sent": "Policy by definition has more than one person in there, sometimes even more institutions, so one size fits all, probably not, but you have to make some concessions here and there.",
                    "label": 1
                },
                {
                    "sent": "Important is to make it fit with existing policy's, just to make life easy for yourself.",
                    "label": 0
                },
                {
                    "sent": "Be aware of the process that is needed to get a policy in place.",
                    "label": 0
                },
                {
                    "sent": "Be pragmatic.",
                    "label": 0
                },
                {
                    "sent": "Start building a team with people who really believe in open education.",
                    "label": 0
                },
                {
                    "sent": "That's very basic, but I think that's very helpful and make sure that you have some indicators set out so that you can evaluate.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "William.",
                    "label": 0
                },
                {
                    "sent": "Alright, to wrap this up, the project is ending, but we don't see that as the end of the project.",
                    "label": 0
                },
                {
                    "sent": "We see it as a start of open courseware Europe or Open Education Consortium Europe.",
                    "label": 0
                },
                {
                    "sent": "We're still looking at the name, but it's really that we want to continue to use this network of people that are involved in open education and especially we have a lot of experts here.",
                    "label": 0
                },
                {
                    "sent": "We have a lot of knowledge and I see if we can.",
                    "label": 0
                },
                {
                    "sent": "Get them together and work together and share their experience around Europe.",
                    "label": 0
                },
                {
                    "sent": "I think we are.",
                    "label": 0
                },
                {
                    "sent": "We've seen this morning with the European Commissioner that Europe is really focused on open opening up an I think we have a lot of expertise but a lot of things are done with projects an when a project stops.",
                    "label": 0
                },
                {
                    "sent": "People go back and they don't keep sharing their knowledge, so we're still in progress in setting up how we're going to organize it, but that's the idea.",
                    "label": 0
                },
                {
                    "sent": "So if you're interested, please leave your business cards and will keep you informed.",
                    "label": 0
                },
                {
                    "sent": "Anne Anne now room.",
                    "label": 0
                },
                {
                    "sent": "For questions.",
                    "label": 0
                }
            ]
        }
    }
}