{
    "id": "2e4k77zivclalpce4o7roxoupqyrxk45",
    "title": "Addressing risks and opportunities engendered by big data: The BYTE project",
    "info": {
        "author": [
            "Kush Wadhwa, Trilateral Research & Consulting"
        ],
        "published": "March 31, 2014",
        "recorded": "March 2014",
        "category": [
            "Top->Computer Science->Big Data",
            "Top->Computer Science->Data Visualisation",
            "Top->Social Sciences->Law->Regulations",
            "Top->Social Sciences->Society->Public Policy",
            "Top->Business->Management->Knowledge Management"
        ]
    },
    "url": "http://videolectures.net/dataforum2014_wadhwa_big_data/",
    "segmentation": [
        [
            "Good afternoon ladies and gentlemen.",
            "And as I was introduced my name is Kush Wadhwa.",
            "From trilateral research and consulting we are a research SMEs based in London where we are active in the data.",
            "Science is for many years and we are also the coordinator of the Byte Project and it is with great pleasure that I'm going to introduce this project to you which of course has the name says is a big data road map and a cross disciplinary community for addressing societal externalities."
        ],
        [
            "So this is a networking session and if I had my way then perhaps I would walk around and make everybody stand up and introduce themselves to me.",
            "And there is so much that we have all learned over the last two days a day and a half and and there is a tremendous amount of engagement that has already taken place between us.",
            "But I find that sometimes with the large volume and velocity of big data that it seems that that sort of speed, and then the fact that it's controlled by some very large.",
            "Organisations and large companies that we don't have much input into.",
            "How big data is shaping up and that perhaps it seems that the path and trajectory of big data is inevitable.",
            "But I contend that if each one of us was to engage in this community and were to take part in different types of projects that we've been talking about here, that there is a possibility that we can indeed shape it as well.",
            "And so I, this is my call of action to you, just like Adrian is that please engage with the bite project.",
            "Please talk to us and and take part in our in our work."
        ],
        [
            "So there is a tremendous amount of of innovation that is taking place.",
            "And So what are the areas within which we are?",
            "We are looking at, and so I wanted to sort of present something that what I've been calling the trifecta of innovation opportunity.",
            "There is a tremendous amount that's happening in open data.",
            "Alot of it is related to government data and is being driven by government sources.",
            "There's a tremendous amount that's happening within Big Data.",
            "Generally it has been focused on consumer data and is being driven by large industry.",
            "And then there is a third element that is taking place within Europe which is around Open Access to research data.",
            "Certainly it is already become mandatory for all publications in Horizon 2020 to be in Open Access, but there is currently a pilot that was launched by the European Commission in December which is funding a massive amount of pilots.",
            "And in helping this research data that is resident.",
            "Within research organisations in academia, to make that Open Access and so there are intersections between each one of those, and I feel that this trifecta of innovation is, if anything going to move further closer to one another and and and that is sort of the area of big data that we are also facing."
        ],
        [
            "But beyond all this talk of innovation I mean, what are the kinds of impacts and implications of this innovation that we all need to study and that it really is the limit of the by project we were funded by DG Connect and launched as well three weeks ago.",
            "So our work is quite new.",
            "We're a road map project and we have 11 members, 11 partners from 10 countries.",
            "Part of the thing that that is also important in the last slide is that there is a lot of intersection between.",
            "Stakeholders, many of the stakeholders are the same industry, academia, government, research community and so on.",
            "And our consortium comprises all of those players.",
            "We have government research organisations.",
            "We have large industry.",
            "We have an S me, we have universities and academia and we believe that this debate that we have embarked upon looking at externalities and impacts that are emerging from big data that we have a healthy sort of debate internally.",
            "But once again we want to engage in that debate.",
            "With you."
        ],
        [
            "So we've been talking about externalities and and perhaps you know it's important to discuss what to define.",
            "What are those externalities?",
            "I mean, I think that externalities could be simply defined as impact.",
            "Sometimes those impacts are expected impact and other times those are unexpected impact, so the effects of a decision by stakeholders, those stakeholders could be government industry scientists that have an impact on a third party such as the public is what we're calling an externality expected?",
            "Or unexpected the key point though, is that externalities can be positive and negative, and many of the externalities can be both.",
            "So we are going to study economic externalities and legal externality's, social and ethical, as well as political externalities.",
            "And we've listed some of these sort of things here, so such as you know there is an impetus within Europe to get to gain momentum in the area of big data and to capture a sort of a share a proportionate.",
            "Global share off the innovation in that space and that is a positive externality that we want to amplify.",
            "There may be other externalities such as legal externalities, and we're certainly going to look at case law as well, but other things around privacy and data protection that may be negative externalities and so are sort of limit, is also to how do you look at?",
            "How do you amplify positive externalities, and how do you diminish negative externalities?",
            "And once we've done that on an academic level?"
        ],
        [
            "We're going to take a very sectoral approach approach, and so we will look at all of those externalities.",
            "Legal, ethical, economic, etc.",
            "In each one of these seven sectors, and we will look at that.",
            "The lens and those sectors are, for example, we have the environmental data GPS data which is being contributed by the European Space Agency.",
            "We have energy and oil exploration, oil and natural gas exploration data which is being contributed by Statoil.",
            "We have commercial data that is this case study that we will look at massive amounts of data that is being captured by Google by their Street View.",
            "And Maps applications via Siemens.",
            "We are looking at smart cities and and the big data that is being collected.",
            "Their cultural data transportation is another very interesting example.",
            "We have SCF which is the second largest transportation company in the world and they are going to make available to us their big data initiatives so that we can see what kinds of externalities are emerging and certainly via University College London.",
            "We have a project that they're doing where they're looking at mapping genes, looking at the future of pharmaceutical research."
        ],
        [
            "So after we've looked at these outcomes, what is ultimately our key?",
            "A marquee aim is to provide.",
            "Our policy makers, researchers, industry academic institutions in Europe, a blueprint of how they can deal with externalities, how they can amplify positive externalities, how they can diminish negative externalities, and to do that we ourselves going to form sort of a call to action in the sense that we are going to create a vision for big data incorporating those externalities.",
            "And we're going to create not just a vision for big data in Europe, but we're going to create one.",
            "For each one of the seven sectors that we have outlined for you today beyond the vision, we're going to create a road map of how do you get there?",
            "And that road map will also sort of emphasize the research elements as well as the policy elements that need to be in place so that we are able to responsibly address those externalities in those seven domains.",
            "And eventually.",
            "We feel that a road map is not sufficient.",
            "What you need is it is a community effort to implement that road map, a call to action a a gathering together of stakeholders like this in this room where we work together to incorporate that, and so we are looking to form a big data community that is going to implement that road map.",
            "We're going to put together a charter for that big data community that will have its remit an ultimately we will have a sustainability plan.",
            "So that it continues that work beyond the time of our project."
        ],
        [
            "So I hope that that gave you a pretty good idea of what we hope to accomplish over the next three years.",
            "As we are embarking upon our work, I urge you to join our community.",
            "You know somebody in the in one of the sessions this morning.",
            "We had a very good idea.",
            "They had a little fish bowl and then put asked everybody put their business cards and I wish I had a fish bowl 'cause I'd love to go around and get everybody's business cards and ask them to join this community.",
            "But I ask you to join us by going to our website simply.",
            "My email is quite difficult.",
            "Number, but if you simply go to our website and you can just, you know send us an email via our website.",
            "Website is couldn't get simpler by project.",
            "You sort of follows the standard things.",
            "Follow us on Twitter.",
            "But beyond that I mean I find that you know I have been engaging with many different projects that have been active here as well as different networks, and I think that we are very interested to create liaisons with those projects and networks.",
            "But also many of you are looking at extracting value from big data in your sectors that are.",
            "That are that are different from ours, and so as you view those problems that come across those problems, I urge you to make contact with us so that we can also help you with give you some of the work that we have been learning in our project.",
            "So thank you."
        ],
        [
            "Very much for your attention and I look forward to some questions."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good afternoon ladies and gentlemen.",
                    "label": 0
                },
                {
                    "sent": "And as I was introduced my name is Kush Wadhwa.",
                    "label": 0
                },
                {
                    "sent": "From trilateral research and consulting we are a research SMEs based in London where we are active in the data.",
                    "label": 0
                },
                {
                    "sent": "Science is for many years and we are also the coordinator of the Byte Project and it is with great pleasure that I'm going to introduce this project to you which of course has the name says is a big data road map and a cross disciplinary community for addressing societal externalities.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is a networking session and if I had my way then perhaps I would walk around and make everybody stand up and introduce themselves to me.",
                    "label": 0
                },
                {
                    "sent": "And there is so much that we have all learned over the last two days a day and a half and and there is a tremendous amount of engagement that has already taken place between us.",
                    "label": 0
                },
                {
                    "sent": "But I find that sometimes with the large volume and velocity of big data that it seems that that sort of speed, and then the fact that it's controlled by some very large.",
                    "label": 0
                },
                {
                    "sent": "Organisations and large companies that we don't have much input into.",
                    "label": 0
                },
                {
                    "sent": "How big data is shaping up and that perhaps it seems that the path and trajectory of big data is inevitable.",
                    "label": 1
                },
                {
                    "sent": "But I contend that if each one of us was to engage in this community and were to take part in different types of projects that we've been talking about here, that there is a possibility that we can indeed shape it as well.",
                    "label": 1
                },
                {
                    "sent": "And so I, this is my call of action to you, just like Adrian is that please engage with the bite project.",
                    "label": 0
                },
                {
                    "sent": "Please talk to us and and take part in our in our work.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So there is a tremendous amount of of innovation that is taking place.",
                    "label": 0
                },
                {
                    "sent": "And So what are the areas within which we are?",
                    "label": 0
                },
                {
                    "sent": "We are looking at, and so I wanted to sort of present something that what I've been calling the trifecta of innovation opportunity.",
                    "label": 0
                },
                {
                    "sent": "There is a tremendous amount that's happening in open data.",
                    "label": 0
                },
                {
                    "sent": "Alot of it is related to government data and is being driven by government sources.",
                    "label": 0
                },
                {
                    "sent": "There's a tremendous amount that's happening within Big Data.",
                    "label": 0
                },
                {
                    "sent": "Generally it has been focused on consumer data and is being driven by large industry.",
                    "label": 0
                },
                {
                    "sent": "And then there is a third element that is taking place within Europe which is around Open Access to research data.",
                    "label": 0
                },
                {
                    "sent": "Certainly it is already become mandatory for all publications in Horizon 2020 to be in Open Access, but there is currently a pilot that was launched by the European Commission in December which is funding a massive amount of pilots.",
                    "label": 0
                },
                {
                    "sent": "And in helping this research data that is resident.",
                    "label": 0
                },
                {
                    "sent": "Within research organisations in academia, to make that Open Access and so there are intersections between each one of those, and I feel that this trifecta of innovation is, if anything going to move further closer to one another and and and that is sort of the area of big data that we are also facing.",
                    "label": 1
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But beyond all this talk of innovation I mean, what are the kinds of impacts and implications of this innovation that we all need to study and that it really is the limit of the by project we were funded by DG Connect and launched as well three weeks ago.",
                    "label": 0
                },
                {
                    "sent": "So our work is quite new.",
                    "label": 0
                },
                {
                    "sent": "We're a road map project and we have 11 members, 11 partners from 10 countries.",
                    "label": 1
                },
                {
                    "sent": "Part of the thing that that is also important in the last slide is that there is a lot of intersection between.",
                    "label": 0
                },
                {
                    "sent": "Stakeholders, many of the stakeholders are the same industry, academia, government, research community and so on.",
                    "label": 0
                },
                {
                    "sent": "And our consortium comprises all of those players.",
                    "label": 0
                },
                {
                    "sent": "We have government research organisations.",
                    "label": 0
                },
                {
                    "sent": "We have large industry.",
                    "label": 0
                },
                {
                    "sent": "We have an S me, we have universities and academia and we believe that this debate that we have embarked upon looking at externalities and impacts that are emerging from big data that we have a healthy sort of debate internally.",
                    "label": 0
                },
                {
                    "sent": "But once again we want to engage in that debate.",
                    "label": 0
                },
                {
                    "sent": "With you.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we've been talking about externalities and and perhaps you know it's important to discuss what to define.",
                    "label": 0
                },
                {
                    "sent": "What are those externalities?",
                    "label": 0
                },
                {
                    "sent": "I mean, I think that externalities could be simply defined as impact.",
                    "label": 0
                },
                {
                    "sent": "Sometimes those impacts are expected impact and other times those are unexpected impact, so the effects of a decision by stakeholders, those stakeholders could be government industry scientists that have an impact on a third party such as the public is what we're calling an externality expected?",
                    "label": 1
                },
                {
                    "sent": "Or unexpected the key point though, is that externalities can be positive and negative, and many of the externalities can be both.",
                    "label": 0
                },
                {
                    "sent": "So we are going to study economic externalities and legal externality's, social and ethical, as well as political externalities.",
                    "label": 0
                },
                {
                    "sent": "And we've listed some of these sort of things here, so such as you know there is an impetus within Europe to get to gain momentum in the area of big data and to capture a sort of a share a proportionate.",
                    "label": 0
                },
                {
                    "sent": "Global share off the innovation in that space and that is a positive externality that we want to amplify.",
                    "label": 0
                },
                {
                    "sent": "There may be other externalities such as legal externalities, and we're certainly going to look at case law as well, but other things around privacy and data protection that may be negative externalities and so are sort of limit, is also to how do you look at?",
                    "label": 0
                },
                {
                    "sent": "How do you amplify positive externalities, and how do you diminish negative externalities?",
                    "label": 0
                },
                {
                    "sent": "And once we've done that on an academic level?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We're going to take a very sectoral approach approach, and so we will look at all of those externalities.",
                    "label": 0
                },
                {
                    "sent": "Legal, ethical, economic, etc.",
                    "label": 0
                },
                {
                    "sent": "In each one of these seven sectors, and we will look at that.",
                    "label": 0
                },
                {
                    "sent": "The lens and those sectors are, for example, we have the environmental data GPS data which is being contributed by the European Space Agency.",
                    "label": 1
                },
                {
                    "sent": "We have energy and oil exploration, oil and natural gas exploration data which is being contributed by Statoil.",
                    "label": 0
                },
                {
                    "sent": "We have commercial data that is this case study that we will look at massive amounts of data that is being captured by Google by their Street View.",
                    "label": 0
                },
                {
                    "sent": "And Maps applications via Siemens.",
                    "label": 0
                },
                {
                    "sent": "We are looking at smart cities and and the big data that is being collected.",
                    "label": 0
                },
                {
                    "sent": "Their cultural data transportation is another very interesting example.",
                    "label": 0
                },
                {
                    "sent": "We have SCF which is the second largest transportation company in the world and they are going to make available to us their big data initiatives so that we can see what kinds of externalities are emerging and certainly via University College London.",
                    "label": 0
                },
                {
                    "sent": "We have a project that they're doing where they're looking at mapping genes, looking at the future of pharmaceutical research.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So after we've looked at these outcomes, what is ultimately our key?",
                    "label": 0
                },
                {
                    "sent": "A marquee aim is to provide.",
                    "label": 0
                },
                {
                    "sent": "Our policy makers, researchers, industry academic institutions in Europe, a blueprint of how they can deal with externalities, how they can amplify positive externalities, how they can diminish negative externalities, and to do that we ourselves going to form sort of a call to action in the sense that we are going to create a vision for big data incorporating those externalities.",
                    "label": 1
                },
                {
                    "sent": "And we're going to create not just a vision for big data in Europe, but we're going to create one.",
                    "label": 0
                },
                {
                    "sent": "For each one of the seven sectors that we have outlined for you today beyond the vision, we're going to create a road map of how do you get there?",
                    "label": 0
                },
                {
                    "sent": "And that road map will also sort of emphasize the research elements as well as the policy elements that need to be in place so that we are able to responsibly address those externalities in those seven domains.",
                    "label": 0
                },
                {
                    "sent": "And eventually.",
                    "label": 0
                },
                {
                    "sent": "We feel that a road map is not sufficient.",
                    "label": 0
                },
                {
                    "sent": "What you need is it is a community effort to implement that road map, a call to action a a gathering together of stakeholders like this in this room where we work together to incorporate that, and so we are looking to form a big data community that is going to implement that road map.",
                    "label": 1
                },
                {
                    "sent": "We're going to put together a charter for that big data community that will have its remit an ultimately we will have a sustainability plan.",
                    "label": 0
                },
                {
                    "sent": "So that it continues that work beyond the time of our project.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I hope that that gave you a pretty good idea of what we hope to accomplish over the next three years.",
                    "label": 0
                },
                {
                    "sent": "As we are embarking upon our work, I urge you to join our community.",
                    "label": 0
                },
                {
                    "sent": "You know somebody in the in one of the sessions this morning.",
                    "label": 0
                },
                {
                    "sent": "We had a very good idea.",
                    "label": 0
                },
                {
                    "sent": "They had a little fish bowl and then put asked everybody put their business cards and I wish I had a fish bowl 'cause I'd love to go around and get everybody's business cards and ask them to join this community.",
                    "label": 0
                },
                {
                    "sent": "But I ask you to join us by going to our website simply.",
                    "label": 1
                },
                {
                    "sent": "My email is quite difficult.",
                    "label": 0
                },
                {
                    "sent": "Number, but if you simply go to our website and you can just, you know send us an email via our website.",
                    "label": 0
                },
                {
                    "sent": "Website is couldn't get simpler by project.",
                    "label": 0
                },
                {
                    "sent": "You sort of follows the standard things.",
                    "label": 0
                },
                {
                    "sent": "Follow us on Twitter.",
                    "label": 0
                },
                {
                    "sent": "But beyond that I mean I find that you know I have been engaging with many different projects that have been active here as well as different networks, and I think that we are very interested to create liaisons with those projects and networks.",
                    "label": 1
                },
                {
                    "sent": "But also many of you are looking at extracting value from big data in your sectors that are.",
                    "label": 0
                },
                {
                    "sent": "That are that are different from ours, and so as you view those problems that come across those problems, I urge you to make contact with us so that we can also help you with give you some of the work that we have been learning in our project.",
                    "label": 0
                },
                {
                    "sent": "So thank you.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Very much for your attention and I look forward to some questions.",
                    "label": 0
                }
            ]
        }
    }
}