{
    "id": "2ecm4dmjsnhtrywrc4p5sn3n674af27h",
    "title": "European Network of Livin Labs",
    "info": {
        "author": [
            "Mikael Börjeson, Lulea University of Technology"
        ],
        "published": "Feb. 5, 2008",
        "recorded": "December 2007",
        "category": [
            "Top->Business->Networked Organizations"
        ]
    },
    "url": "http://videolectures.net/esocenet07_borjeson_enl/",
    "segmentation": [
        [
            "So, ladies and gentlemen.",
            "My name is Michael Barisone and the height of the challenge to be in between you and the coffee.",
            "Chairman just asked me if I will keep within my 15 minutes.",
            "I'll try to do it in 10.",
            "I know there will be more presentations in the afternoon.",
            "Why?",
            "What is the living lab and why do we need them in lab as individuals?",
            "Centers but I."
        ],
        [
            "Focus on the network aspects.",
            "And briefly, touch upon.",
            "Why should we have a network?",
            "What should the network do and how should it do it?",
            "So I'll skip the definition of living Labs.",
            "Whether if you don't feel you grasp what Living lab is, you have to wait until after lunch."
        ],
        [
            "So defer that slightly.",
            "The network of Living Labs in Europe.",
            "European Network of Living labs.",
            "Actually it's not just the network of living Lab sites which you can see in the very tiny small map on the left.",
            "It also comprises an open community of people, whether you actually are engaged in the living lab or not.",
            "This isn't totally open environment where you can register your inset interest and get information and connect to people.",
            "This is among people, people to people network.",
            "We also have an emerging partnership network, essentially Industrial Partnership Network, which we want to expand and have us a customer reference because our main customers are industry or Assamese and companies or investors at this point are not very much industry investors are public funding agencies, it's European Commission etc.",
            "And the current governance of the European Network Living Labs is carried out by the so called Living Lab portfolio.",
            "Leadership Group comprising currently 20 people representatives of Living Lab nodes, living labs across Europe but also living lab projects and some other guys, industry etc.",
            "And we are now in progress of electing 10 more members from the 2nd way."
        ],
        [
            "Living Lab nodes Huai Huai and network well.",
            "There is some obvious answers.",
            "The exchange of experience is very important to to catalyze it in between the living labs.",
            "At.",
            "There is a strong belief that there is not possible too.",
            "Be mature enough just by practicing and experimenting in your own regional living lab, the exchange of experience is crucial.",
            "At least not not the least for for the creativity to approach the different challenges we have in a single living lab.",
            "Coordination to avoid the redundant work.",
            "Obvious resource sharing?",
            "Maybe it's not so obvious, but in we need the living lab needs tools and methods and processes, and in order to be capable and have the resources to development we need to make a joint development because there is many many things which are in common needs which are in common.",
            "Even we could share hopefully stakeholders so there could be stakeholders in individual living labs which in a way is connected to the network and then becomes a virtual stakeholder of part or several other living labs.",
            "And maybe the most interesting things will happen.",
            "Thing will happen when users in the individual living labs come together in for a we have not even tried that yet.",
            "To bring people the users together to change their views, how it is to be part of the innovation process from the user side.",
            "This might include even use the schools how to innovate or other types of facilitating mechanisms in the network.",
            "There is often forgotten the effect actually on the user, because we tend to focus on the service being developed, but the OSHA also what is developed is the user and the users, the individual users capability of taking part in contribute to innovation.",
            "Of course, there is a possibility to strengthen offer from each individual living lab.",
            "Having the network in behind as a back line support for whatever they do.",
            "Joint lobbying is obvious to influence.",
            "The investments coming into this movement.",
            "And then we're looking into the network offers not offers from individual living Labs, but offers from the network as is.",
            "And offers for actually to become parties of the network, not just parties of individual living."
        ],
        [
            "So just a glimpse at the recently last week we launched the Swedish network.",
            "It comprises 7 living labs at this point and I just touched upon the blend of things being carried out here.",
            "On the far North we have bought.",
            "Yeah, that's where I live and and work in my colleague Anika Sellstrom.",
            "If you want to know more about both Living Lab you can raise your hand.",
            "You can discuss with her.",
            "We are in the mobile really user centric services for mobile people.",
            "Innovation cultures in you looking at what people do to innovate in downtown etc in there especially among young people with mobile phones etc orlandis focusing those services on airports.",
            "Stockholm is looking into Big city services.",
            "Numidian malnourished, looking into two new like new media in Central City and especially in bars and people where people meet physically.",
            "And safe at home in Homestead is is looking at healthcare, provisioning and health services and elderly etc."
        ],
        [
            "We have run the botnet for for seven years now, and from our point it's obvious that we need the network.",
            "We have SMS.",
            "We have large enterprises like Eric Song.",
            "10% of Erikson researches in Lulu Leo and they say that they would be even more interested if we could connect and may in carryout innovation evolution in a networked space with across Europe.",
            "Looking at the similarities and differences between different regions and cultures and languages and legislations.",
            "I will not give given the time.",
            "I will not go into detail about the."
        ],
        [
            "Examples here.",
            "Some of the conclusions.",
            "We expect a lot.",
            "But most of the things we expect needs to be done improve and we haven't really started yet in European network specially run operations in the network.",
            "The Semantic Living Lab Subclusters is in progress to be formed like certain living labs dealing with healthcare, other with logistics etc etc.",
            "This is very important.",
            "I think these days will this type of things will be discussed a lot, but also we could form some clusters depending on the needs of the living labs.",
            "So leaving loves having similar needs come together and do jointly things to solve their needs.",
            "We need to harmonize the operations in order to be.",
            "Compatible enough to operate as a network.",
            "And we need to evalu evolve and make offers on network level and also to address things like IPR etc in the partnership models there is a partnership model opportunity for the network not just for partnership model on the Living Lab as an individual thing.",
            "And finally, but not least important, there is a lot of regional.",
            "Particular strengths and context special special context aspects which can be found to reoccur in different places across through Europe, and these are these context similarities is very interesting to see if we can fit together and make certain regions come together involuting their their strengths and their challenging address.",
            "Their challenges jointly.",
            "So this is the meeting between the European network and the really local and regional.",
            "Elements which is very important.",
            "Thank you very much.",
            "Thank you Michael.",
            "Wekiva really nice, but now if someone has a question or a comment, want to interact briefly before we got upgrade, is there any question that you were keeping it?",
            "Now we want to make?",
            "Yes, there was one.",
            "Comment.",
            "Mission very clearly about.",
            "Said clearly depth is out with users in looking at.",
            "And I come with an example of that yet.",
            "College Station yet again.",
            "Take anything listed to waste it waste management process, which is another issue and where they usually citizens don't want them in their backyard.",
            "And two years ago we got involved with the political decision of deciding the location and then creation of a lot of SM ES around the processing and reprocessing the materials, objects etc.",
            "And it's now there and it's a living lab that is part of the second wave and really couldn't be there if the citizens were not involved with from the very beginning, even from the location point of view, they understand socially what they were discussing.",
            "Not only.",
            "Not only did the 1st.",
            "Involving them in the app now includes with of course in many other decisions and product service etc around this cluster on which is the typical product not in my backyard.",
            "OK, very well.",
            "Just a small question, how did you choose this amazing teaching?",
            "Because you have three types, is 90% more sleepy.",
            "When they would say active and only one person is very active, how can you sure?",
            "Good deeds between disregards of assistance.",
            "But Are you sure that you need very active only, no.",
            "City.",
            "Because it's a large number.",
            "But it's always necessary.",
            "Otherwise it doesn't work and what?",
            "How many is a large numbers?",
            "Sorry, I'll match it up in a minute.",
            "Thanks.",
            "How are people anyway?",
            "Enough to say how many now you discovered also?",
            "Or which quality?",
            "OK, very well, let's see if the coffee is as good as the quality of the citizens that we need."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So, ladies and gentlemen.",
                    "label": 0
                },
                {
                    "sent": "My name is Michael Barisone and the height of the challenge to be in between you and the coffee.",
                    "label": 0
                },
                {
                    "sent": "Chairman just asked me if I will keep within my 15 minutes.",
                    "label": 0
                },
                {
                    "sent": "I'll try to do it in 10.",
                    "label": 0
                },
                {
                    "sent": "I know there will be more presentations in the afternoon.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "What is the living lab and why do we need them in lab as individuals?",
                    "label": 0
                },
                {
                    "sent": "Centers but I.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Focus on the network aspects.",
                    "label": 0
                },
                {
                    "sent": "And briefly, touch upon.",
                    "label": 0
                },
                {
                    "sent": "Why should we have a network?",
                    "label": 0
                },
                {
                    "sent": "What should the network do and how should it do it?",
                    "label": 0
                },
                {
                    "sent": "So I'll skip the definition of living Labs.",
                    "label": 0
                },
                {
                    "sent": "Whether if you don't feel you grasp what Living lab is, you have to wait until after lunch.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So defer that slightly.",
                    "label": 0
                },
                {
                    "sent": "The network of Living Labs in Europe.",
                    "label": 0
                },
                {
                    "sent": "European Network of Living labs.",
                    "label": 0
                },
                {
                    "sent": "Actually it's not just the network of living Lab sites which you can see in the very tiny small map on the left.",
                    "label": 0
                },
                {
                    "sent": "It also comprises an open community of people, whether you actually are engaged in the living lab or not.",
                    "label": 0
                },
                {
                    "sent": "This isn't totally open environment where you can register your inset interest and get information and connect to people.",
                    "label": 0
                },
                {
                    "sent": "This is among people, people to people network.",
                    "label": 0
                },
                {
                    "sent": "We also have an emerging partnership network, essentially Industrial Partnership Network, which we want to expand and have us a customer reference because our main customers are industry or Assamese and companies or investors at this point are not very much industry investors are public funding agencies, it's European Commission etc.",
                    "label": 0
                },
                {
                    "sent": "And the current governance of the European Network Living Labs is carried out by the so called Living Lab portfolio.",
                    "label": 0
                },
                {
                    "sent": "Leadership Group comprising currently 20 people representatives of Living Lab nodes, living labs across Europe but also living lab projects and some other guys, industry etc.",
                    "label": 0
                },
                {
                    "sent": "And we are now in progress of electing 10 more members from the 2nd way.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Living Lab nodes Huai Huai and network well.",
                    "label": 0
                },
                {
                    "sent": "There is some obvious answers.",
                    "label": 0
                },
                {
                    "sent": "The exchange of experience is very important to to catalyze it in between the living labs.",
                    "label": 0
                },
                {
                    "sent": "At.",
                    "label": 0
                },
                {
                    "sent": "There is a strong belief that there is not possible too.",
                    "label": 0
                },
                {
                    "sent": "Be mature enough just by practicing and experimenting in your own regional living lab, the exchange of experience is crucial.",
                    "label": 0
                },
                {
                    "sent": "At least not not the least for for the creativity to approach the different challenges we have in a single living lab.",
                    "label": 0
                },
                {
                    "sent": "Coordination to avoid the redundant work.",
                    "label": 0
                },
                {
                    "sent": "Obvious resource sharing?",
                    "label": 0
                },
                {
                    "sent": "Maybe it's not so obvious, but in we need the living lab needs tools and methods and processes, and in order to be capable and have the resources to development we need to make a joint development because there is many many things which are in common needs which are in common.",
                    "label": 0
                },
                {
                    "sent": "Even we could share hopefully stakeholders so there could be stakeholders in individual living labs which in a way is connected to the network and then becomes a virtual stakeholder of part or several other living labs.",
                    "label": 0
                },
                {
                    "sent": "And maybe the most interesting things will happen.",
                    "label": 0
                },
                {
                    "sent": "Thing will happen when users in the individual living labs come together in for a we have not even tried that yet.",
                    "label": 0
                },
                {
                    "sent": "To bring people the users together to change their views, how it is to be part of the innovation process from the user side.",
                    "label": 0
                },
                {
                    "sent": "This might include even use the schools how to innovate or other types of facilitating mechanisms in the network.",
                    "label": 0
                },
                {
                    "sent": "There is often forgotten the effect actually on the user, because we tend to focus on the service being developed, but the OSHA also what is developed is the user and the users, the individual users capability of taking part in contribute to innovation.",
                    "label": 0
                },
                {
                    "sent": "Of course, there is a possibility to strengthen offer from each individual living lab.",
                    "label": 0
                },
                {
                    "sent": "Having the network in behind as a back line support for whatever they do.",
                    "label": 0
                },
                {
                    "sent": "Joint lobbying is obvious to influence.",
                    "label": 0
                },
                {
                    "sent": "The investments coming into this movement.",
                    "label": 0
                },
                {
                    "sent": "And then we're looking into the network offers not offers from individual living Labs, but offers from the network as is.",
                    "label": 0
                },
                {
                    "sent": "And offers for actually to become parties of the network, not just parties of individual living.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So just a glimpse at the recently last week we launched the Swedish network.",
                    "label": 0
                },
                {
                    "sent": "It comprises 7 living labs at this point and I just touched upon the blend of things being carried out here.",
                    "label": 0
                },
                {
                    "sent": "On the far North we have bought.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's where I live and and work in my colleague Anika Sellstrom.",
                    "label": 0
                },
                {
                    "sent": "If you want to know more about both Living Lab you can raise your hand.",
                    "label": 0
                },
                {
                    "sent": "You can discuss with her.",
                    "label": 0
                },
                {
                    "sent": "We are in the mobile really user centric services for mobile people.",
                    "label": 0
                },
                {
                    "sent": "Innovation cultures in you looking at what people do to innovate in downtown etc in there especially among young people with mobile phones etc orlandis focusing those services on airports.",
                    "label": 0
                },
                {
                    "sent": "Stockholm is looking into Big city services.",
                    "label": 0
                },
                {
                    "sent": "Numidian malnourished, looking into two new like new media in Central City and especially in bars and people where people meet physically.",
                    "label": 0
                },
                {
                    "sent": "And safe at home in Homestead is is looking at healthcare, provisioning and health services and elderly etc.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have run the botnet for for seven years now, and from our point it's obvious that we need the network.",
                    "label": 0
                },
                {
                    "sent": "We have SMS.",
                    "label": 0
                },
                {
                    "sent": "We have large enterprises like Eric Song.",
                    "label": 0
                },
                {
                    "sent": "10% of Erikson researches in Lulu Leo and they say that they would be even more interested if we could connect and may in carryout innovation evolution in a networked space with across Europe.",
                    "label": 0
                },
                {
                    "sent": "Looking at the similarities and differences between different regions and cultures and languages and legislations.",
                    "label": 0
                },
                {
                    "sent": "I will not give given the time.",
                    "label": 0
                },
                {
                    "sent": "I will not go into detail about the.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Examples here.",
                    "label": 0
                },
                {
                    "sent": "Some of the conclusions.",
                    "label": 0
                },
                {
                    "sent": "We expect a lot.",
                    "label": 0
                },
                {
                    "sent": "But most of the things we expect needs to be done improve and we haven't really started yet in European network specially run operations in the network.",
                    "label": 1
                },
                {
                    "sent": "The Semantic Living Lab Subclusters is in progress to be formed like certain living labs dealing with healthcare, other with logistics etc etc.",
                    "label": 0
                },
                {
                    "sent": "This is very important.",
                    "label": 0
                },
                {
                    "sent": "I think these days will this type of things will be discussed a lot, but also we could form some clusters depending on the needs of the living labs.",
                    "label": 0
                },
                {
                    "sent": "So leaving loves having similar needs come together and do jointly things to solve their needs.",
                    "label": 1
                },
                {
                    "sent": "We need to harmonize the operations in order to be.",
                    "label": 0
                },
                {
                    "sent": "Compatible enough to operate as a network.",
                    "label": 0
                },
                {
                    "sent": "And we need to evalu evolve and make offers on network level and also to address things like IPR etc in the partnership models there is a partnership model opportunity for the network not just for partnership model on the Living Lab as an individual thing.",
                    "label": 0
                },
                {
                    "sent": "And finally, but not least important, there is a lot of regional.",
                    "label": 0
                },
                {
                    "sent": "Particular strengths and context special special context aspects which can be found to reoccur in different places across through Europe, and these are these context similarities is very interesting to see if we can fit together and make certain regions come together involuting their their strengths and their challenging address.",
                    "label": 0
                },
                {
                    "sent": "Their challenges jointly.",
                    "label": 0
                },
                {
                    "sent": "So this is the meeting between the European network and the really local and regional.",
                    "label": 0
                },
                {
                    "sent": "Elements which is very important.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Thank you Michael.",
                    "label": 0
                },
                {
                    "sent": "Wekiva really nice, but now if someone has a question or a comment, want to interact briefly before we got upgrade, is there any question that you were keeping it?",
                    "label": 0
                },
                {
                    "sent": "Now we want to make?",
                    "label": 0
                },
                {
                    "sent": "Yes, there was one.",
                    "label": 0
                },
                {
                    "sent": "Comment.",
                    "label": 0
                },
                {
                    "sent": "Mission very clearly about.",
                    "label": 0
                },
                {
                    "sent": "Said clearly depth is out with users in looking at.",
                    "label": 0
                },
                {
                    "sent": "And I come with an example of that yet.",
                    "label": 0
                },
                {
                    "sent": "College Station yet again.",
                    "label": 0
                },
                {
                    "sent": "Take anything listed to waste it waste management process, which is another issue and where they usually citizens don't want them in their backyard.",
                    "label": 0
                },
                {
                    "sent": "And two years ago we got involved with the political decision of deciding the location and then creation of a lot of SM ES around the processing and reprocessing the materials, objects etc.",
                    "label": 0
                },
                {
                    "sent": "And it's now there and it's a living lab that is part of the second wave and really couldn't be there if the citizens were not involved with from the very beginning, even from the location point of view, they understand socially what they were discussing.",
                    "label": 0
                },
                {
                    "sent": "Not only.",
                    "label": 0
                },
                {
                    "sent": "Not only did the 1st.",
                    "label": 0
                },
                {
                    "sent": "Involving them in the app now includes with of course in many other decisions and product service etc around this cluster on which is the typical product not in my backyard.",
                    "label": 0
                },
                {
                    "sent": "OK, very well.",
                    "label": 0
                },
                {
                    "sent": "Just a small question, how did you choose this amazing teaching?",
                    "label": 0
                },
                {
                    "sent": "Because you have three types, is 90% more sleepy.",
                    "label": 0
                },
                {
                    "sent": "When they would say active and only one person is very active, how can you sure?",
                    "label": 0
                },
                {
                    "sent": "Good deeds between disregards of assistance.",
                    "label": 0
                },
                {
                    "sent": "But Are you sure that you need very active only, no.",
                    "label": 0
                },
                {
                    "sent": "City.",
                    "label": 0
                },
                {
                    "sent": "Because it's a large number.",
                    "label": 0
                },
                {
                    "sent": "But it's always necessary.",
                    "label": 0
                },
                {
                    "sent": "Otherwise it doesn't work and what?",
                    "label": 0
                },
                {
                    "sent": "How many is a large numbers?",
                    "label": 0
                },
                {
                    "sent": "Sorry, I'll match it up in a minute.",
                    "label": 0
                },
                {
                    "sent": "Thanks.",
                    "label": 0
                },
                {
                    "sent": "How are people anyway?",
                    "label": 0
                },
                {
                    "sent": "Enough to say how many now you discovered also?",
                    "label": 0
                },
                {
                    "sent": "Or which quality?",
                    "label": 0
                },
                {
                    "sent": "OK, very well, let's see if the coffee is as good as the quality of the citizens that we need.",
                    "label": 0
                }
            ]
        }
    }
}