{
    "id": "2fflwdmf6uqfblnaf7oca6ok75xeoper",
    "title": "Science meets industry - why are many innovative coating technologies never entering the market?",
    "info": {
        "author": [
            "Simone Schulte, Evonik Industries AG"
        ],
        "published": "March 28, 2018",
        "recorded": "March 2018",
        "category": [
            "Top->Medicine",
            "Top->Science",
            "Top->Technology"
        ]
    },
    "url": "http://videolectures.net/AMiCIworkshop2018_schulte_entering_market/",
    "segmentation": [
        [
            "So welcome also from my side.",
            "My name is Simona Shooter and I'm working at Evonik.",
            "I'm very happy to be here a little bit.",
            "The connection between the industry and the science.",
            "I worked for research institutes for I think 14 or 15 years and since now eight years I'm in the industry so I think I know quite well aware.",
            "So I know both words and so I hope I can be there.",
            "A link to put them more together.",
            "In the future, and I think I'm which is a good starting point for that."
        ],
        [
            "So, um, just a few words where I'm coming from, so Evonik is not a company you can brand, you know, but Evonik is nearly everywhere in all products you can imagine.",
            "For example in wall paint we have deformers deaerators this persons and so on that the paint is as as you want to apply it here.",
            "Metris is we have foam stabilizers.",
            "We have some acrylics here for the computers.",
            "We have some.",
            "Components or emulsify us for cosmetics we have here in the face 8 paint some hydrophobic.",
            "Additive so that you have facet paints with hydrophobic.",
            "Attitudes or hear the PMA for the screens and so on.",
            "Also in the automotive we have additives for the tires of the cars and so on.",
            "You see that Evonik is nearly everywhere, but you don't know it probably."
        ],
        [
            "So it is divided into 3 big companies.",
            "Be 3 GmbH is.",
            "I'm working for the resource efficiency and there we are a lot of link to coatings so the product are crosslinker, silanes and coding and adhesive resins and."
        ],
        [
            "You see also here we have a lot of fields of applications like automotive interior that we have, for example metal additives that yeah that gives the cockpit structure here.",
            "Yet we have the Canning packaging in plastic coatings for mechanical.",
            "Properties of that that you can have a very, for example, the new one is for she shoes that you can use them at very cold and very hot.",
            "Purchase and that they keep their flexibility and so on.",
            "Antifouling in the heavy duty industry, in check and so on.",
            "So you see we have we are in all kinds of coatings with our additives."
        ],
        [
            "I'm working in the new founded Competence Center.",
            "It's called smart surface solutions, and so it's S3 and their Evonik.",
            "I found out five emerging topics where their focus, their research and development on and these topics are the antifouling.",
            "So that is the marine antifouling for ships ship paints then anti icing corrosion protection.",
            "Easy to clean and antimicrobial and I'm heading the group of the antimicrobial research team."
        ],
        [
            "Um, so here the opportunities are also given you.",
            "I just wanted to say that we have 5 interdisciplinary experience teams and that's the first point.",
            "I want to stress when you work with the industry and the science or the scientific institutes, it's very important to have interdisciplinary teams because I'm the only one and only microbiologist.",
            "This company, I think, and my colleagues are all chemists or coating engineers.",
            "Or yeah, so mainly chemists and coating engineers and they said, OK, we cannot cope with this topic with the anti microbiol topic without having a microbiologist there and I think it was a little bit true because so they had some other experience.",
            "Yeah they had some other ideas.",
            "About how to cope with this problem, then we have we have several cooperation with external partners like startup companies and universities.",
            "This is especially in this point of the antimicrobial coatings.",
            "Very important because we do not have antimicrobial additives until now.",
            "So there we are dependent on what other persons invented and we are in contact with them and testing them and so on.",
            "So we did not find the one and only solution until now.",
            "The main location is Ineson where I'm coming from, but we also have a lap in Singapore and we are about 20 persons who are working on this five topics so not too big, but perhaps we are growing."
        ],
        [
            "So what are what do the customers saw, especially our customers want they want to have an easy to use long-term universe, non toxic, non hazardous and very price efficient technical solution with no drawbacks to the coating properties.",
            "So OK so go and let's go do it.",
            "Do some research and come back with a solution so.",
            "But the challenges we have to face.",
            "Is so there are several technology available, so I'm also coming to the article later, but they are often treating only one aspect of antimicrobial action.",
            "And not all technologies are applicable in every application.",
            "Let's also clear so you have some restrictions there then.",
            "As I said, interdisciplinary project teams are really rare in the industry, so if you have a chemical company, then you find chemists in this industry and not a microbiologist normally.",
            "Or if you are a Research Institute, then you have all researchers on the one topic, but there's no one from the from the from other disciplinaries.",
            "Um, yeah, and which is a really big thing, is that the investments are very high for a future uncertain market, so because its knew there are not so many things in the market right now, it's not.",
            "It's uncertain.",
            "You do not know if the customer except this.",
            "And it's time and cost intensive research plus the regulatory demands.",
            "So the company must really decide to go into this field before.",
            "And it doesn't matter how many technical solutions are available there, because it has to be a decision in front if they want to do it, yes or not, because it's really a lot of time and money.",
            "So."
        ],
        [
            "You already mentioned this.",
            "Publication it's really a very big good overview about the different technologies and there also mentioned some drawbacks, but."
        ],
        [
            "I will go there so I have also a slide of the different technologies and I will go there a little bit into detail that you understand what we can use in what we cannot use at the moment.",
            "So the most classical is the anti microbiol loading so you have a Biosite incorporated in the coating.",
            "This will be leached over the time and that's good because it kills the bacteria, but that's bad as well because then the buyer side will be gone.",
            "After a certain while, and.",
            "And so you have the problem of the leaching that the active agent is not there after certain time.",
            "And I mean there are the bacteria there, and if they are there for a long time, resistance can be developed against the Biosite.",
            "Adoption can develop and OK. Then you have fear.",
            "The dead biomass on the surface and then they are coming new bacteria.",
            "What do they find?",
            "Like it's like Schnitzel so they like it.",
            "They eat there and so that it will be quoted by microbes.",
            "Anyway if you don't clean the surface.",
            "So that means you have a overgrowth and you have.",
            "I will come to that later.",
            "You have some troubles with the Biosite product regulation.",
            "Then as you said, so titanium dioxide, for example, is a typical photoactivated surface.",
            "Then you have these cascades.",
            "That's very good, because this is still, I say, still a physical effect.",
            "So that means that it has not go another.",
            "VPR, but the titanium dioxide.",
            "For example, it has because it forms radicals and then so UV is still the physical effect, but the predicates, for example they are active, that is, free radicals generated by air and water, or something like that.",
            "So that means it's an easy to bio side which has to be registered.",
            "Often you need UV.",
            "An one point here is, and this is often forget, and that if you have a coating then you have some additives.",
            "You have some pigments, let that it's green or black or white or whatever, and then you have a binder and solvent and the solvent can be waterborne or solvent borne.",
            "And the binders are often polymeric substances organics.",
            "So that means if you have here.",
            "Radical radical, so you have this oxidizing action or the time that means that the binder will be degraded during the time, so that means that this could be an.",
            "Disadvantage and you have two prep develop not a GNU bio side button.",
            "You binding system which is rather an an organic binding system.",
            "OK, then we're going to the surface, so these are the contact surface is which you mentioned.",
            "These are often polymeric binders.",
            "I think your technology is also so the crowd that technology is also something like that you have off.",
            "So the big advantage is that you don't have a leaching, but you also have the problem with the overgrowth.",
            "If you don't clean the surface is the resistance.",
            "The BPR is also a problem, and this is again something which you have in mind, so the bind us which I normally used for paints and coatings.",
            "You are normally looking at.",
            "They all have an ionic binders.",
            "So you have often acrylates or something like it, so you have other jonak binders, but this is often if you have quite an area, ammonium compounds positively charged here, and if you combine the anionic binders with the positively charged.",
            "Polymar then you don't have any efficiency left.",
            "So this you also have to have a mind, then we're going to the nanostructure.",
            "There the it's rather a settlement prevention, so an anti ATS effect.",
            "This is a physical effect that is really good 'cause you do not have to register anything but here, this stability is the crucial point becausw, especially if you're going into the hospital environment and you have the cleaning and you have disinfectants and you have.",
            "I don't know what then you will have this effect only for a limited time, so I think it's really easy.",
            "So if it's gone.",
            "So these nanostructures are also given sometimes with the hydrophobic hydrophilic.",
            "So amphiphilic binders and this could be 11 idea for the future.",
            "Then you have these anti adhesive structures, that is that is what I said.",
            "There there are also some postulations that if you have a hydrophilic.",
            "The surrounding of this, then the bacteria do not see that there is a surface that they just swim around and say OK, nothing to settle down.",
            "So, but this is in the tests at the moment, so I cannot say if it's working or not, but this is in tests at the moment and these three technologies I would say that these are fancy ideas and it's fine, but they are the critical point is often the.",
            "Realization so how do you want to incorporate, for example, enzymes or?",
            "Overall, let's say proteins or quorum sensing molecules in the coating.",
            "How do you want to get them in there and also the upscaling is there very big problem because you have to produce tons of the additive in the future.",
            "And if you're looking for.",
            "Yeah, for example, for some certain amino acids, then you pay thousand euros for gram or milligram.",
            "So and this is not really feasible at the moment I do not want to say it's never feasible, but at the moment I would say it is too far away from the reality, but this is certainly a point where you could look at and I mean if you think on.",
            "Enzymes, for example.",
            "It is also not long ago that we couldn't handle enzymes in this huge amounts at how we can treat it, how we can buy it now but but at the moment it is really the scale.",
            "Up is very yeah I do not know if this works or not and often you have here a biological action.",
            "But this also means that you have to use it in mild.",
            "Environment, so the pH must be OK.",
            "It must be humid.",
            "It must be the temperature must be OK.",
            "So and sometimes if you have some curing processes of coatings, then the curing is at higher temperature.",
            "So if you are looking for powder coating for example, then it's at 6080 degrees and then the enzymes say goodbye or whatever, so these molecules.",
            "So that's that's also from the technology, and I think powder coating.",
            "And two KPUR coatings and some UV coatings.",
            "These are the main coatings which you apply on handle door handles on tables on on whatever.",
            "So you have to have the how.",
            "What kind of coating is?",
            "Applicated on the thing you have to keep this in mind and then you will see.",
            "What is technically feasible and what not?",
            "And there the communication between the industry and the scientific persons have to be at an earlier stage I think.",
            "OK."
        ],
        [
            "So then this is my really the pain topic we have.",
            "So Europe is not the only one.",
            "Also US, Japan, China have nearly every other country has really some regulations, but we have the AECOM and we have the bio side product Regulation and if you apply the coating on the medical devices themselves then we have the medical device regulation and the costs of what they say is between 3:00 and 6:00 million euro and the duration so remember."
        ],
        [
            "At his presentation, the journey from idea to antimicrobial from Croda in poor gifts from Hosayn last year, remember so it will take some time so it lasts 10 year.",
            "But I think that was the invention until the market, but the registration process there was also quite a long journey."
        ],
        [
            "And if you are looking so, you start with a new molecule.",
            "So all the research and the efficiency test and so on are in front.",
            "So now you have the molecule you want to put onto the market.",
            "Then you start for example in this year with Adasi.",
            "So you have to collect all data you have to do a lot of toxicity tests.",
            "You have to do a lot of efficiency tests.",
            "You have to provide an example how you want to apply it.",
            "You have to provide.",
            "Everything and you have a first check from the ECR, then from EU authorities then they say OK looks good but you have to do some more tests.",
            "You have the additional tests then you got then this is a real starting point.",
            "Then you have the evaluation of the authorities and the authorities are just country wise and they give it then to the echo or to the European Commission.",
            "And they have one year to say yes, it's OK or not so and the finally you get then the EU Commission decision and you can start with a registered active agent.",
            "So and an entry in the Union list.",
            "And here on my time scale here it would last six years and cost about 3 million euros.",
            "Can be little different, but I think the.",
            "The magnitude is OK. And then you want to sell it, but.",
            "Then it goes further be 'cause you have the registered active agent.",
            "But in every product where you put your agent in, this is about silent product which has also be ridges that and this.",
            "Lasts again three years and two men in Europe.",
            "And I mean that can differ very much on in how many countries and how many product types you want to register and so on.",
            "But just take it as a metric is really takes awhile and it's also again very expensive and now."
        ],
        [
            "For the industry, if you look for the supply chain for the coating industries, it is like that we are the additive supplier like Evonik like crude alike.",
            "RAF so they are doing silver for example.",
            "So we are the additive supplier.",
            "We have the active agent.",
            "We can say that.",
            "But our customers, the coating manage manufacturer like PPG, Sherwin-Williams excellent balance on these are the really which are selling the paint to the customers.",
            "They have to register their biocide products and maybe they have a blue paint and they have a pink paint and they have us or they have three bio side products and sometimes you can put it in a family and so on.",
            "I just want to send sensible eyes yourself that this is not easy to find.",
            "The customers who are doing that.",
            "And then you have the end users like hospitals, public transportation.",
            "So it's not only hospital, should be also tried public transportation for example toys.",
            "Now that the babies can put them into the mouth and so on.",
            "So Auto Mobile is very interested in anti microbials because you will have a lot of more car sharing and so on and you never know who was sitting in front before me in the crowd and so on.",
            "So they're really very interested in anti microbia.",
            "Coatings and they then they have a treated our ticket so they have to label it that there is a biocide inside, but then imagine so do our customers want to spend three years and 2 million euro for one biocide product, family or whatever?",
            "And do sensitive customers want to label their products?",
            "So if you have, for example, a toy and there's written OK, it's anti microbia.",
            "You could put it in the mouth.",
            "But then it's labeled that there is a bio side inside, so maybe there can be some problems there.",
            "So this is the."
        ],
        [
            "Biocide, So what does that mean for me?",
            "That one thing is that only big companies can afford the registration process.",
            "I think that's what Hossain told us last time as well.",
            "He was lucky that Cruda, he found Crowder that they did that work for you.",
            "It's nearly impossible for startup companies or University spinoffs, even if they have a good idea.",
            "If they have a good active agent, I think it's not possible that they can handle this registration process.",
            "And.",
            "And I think that is the reason why the way is away from antimicrobial actives towards physical effects.",
            "Then you can still have the UV.",
            "I do not have an idea how to put the UV into a coating, but perhaps you can have some ideas there.",
            "Then we have these anti adhesive structures and we have easy to clean surfaces and I I really think that.",
            "It is very difficult to have a new antimicrobial molecule and I think that we will focus on these effects."
        ],
        [
            "Then let me say something about the efficiency about the test.",
            "I know that this is not the topic of this working group, but I think this is also very important.",
            "So because if you have here a surface and you have a surface with the contact biocide, then only the dead bacteria will be killed and the living bacteria will stake.",
            "Stay in the mattress and you always have to keep in mind that this is.",
            "Always dirty.",
            "It is never just water or a steroid.",
            "Solution or whatever where you put threaten amount of a pure culture in.",
            "It's always dirty and you have fat in Greece and blood and in the hospital environment and you never know if this works also with the dirt but all the efficiency tests are done with very clean and standardized.",
            "Things, and if you have a surface with a soluble as bio side, then this will entering here and kill all bacteria.",
            "And this is also that here I stole this slide also from Hossein."
        ],
        [
            "This is also you have a lot of standard test methods, but to select the really efficient bio sites or.",
            "Molecules it.",
            "I think they are not really suited.",
            "This standard methods becausw you."
        ],
        [
            "Oh have for example difficulties if you have hydrophobic surface is then then you put a droplet of bacterial solution on it and then it it goes as you have one droplet and you can't code over the surface.",
            "Then you just have cultivation method that is also something about your project.",
            "You again only swap.",
            "You never look for the viable but non culturable bacteria don't look for for example can be that the bacteria or rather.",
            "Injured that the membranes are not intact, but that they if they come again on a cultural cultural plate that they can re growth even if they are injured.",
            "And so you always sticking to this.",
            "Cultivation methods, then.",
            "The other tests are just 24 hours, so it does not say anything about the long life long lasting effects.",
            "Oh OK, you have you sent it to test surface to an Institute.",
            "They're doing this test over 24 hours and say, OK, it's fine.",
            "You have a significant antimicrobial effect.",
            "But what does that mean for the reality?",
            "Does it really stays there for more than 20 hours for rather 4?",
            "If you're looking for hospital 24 years.",
            "Yeah, then you always work with pure cultures, clinical strains and no contamination, and it is known that if you take strains which are clinical strange from a database, then they are always much more sensitive than if you really work with environmental strains because they are.",
            "I mean, it's like like if you have a pet and cat Wildcat.",
            "So this is a little bit like that.",
            "So if you always take this 80 seats by two five, I don't know what.",
            "Then you have really very harmless microbes in contrast to what is really present in the clinical field.",
            "You always, as I mentioned, work and are very clean conditions.",
            "You have no.",
            "Idea if it's really works also with grease with dirt with black with I do not don't know what.",
            "Yeah, so some of the tests are not suited because they always see the antimicrobial effect.",
            "But if you have just an effect on really on the surface or you have an anti adhesive effect then all these methods won't work 'cause you always get culturable cells but it does not tell you anything about if they you're not here and so on.",
            "So they are not suitable.",
            "So and then my question is where is there the practical relevance?",
            "Um, I just."
        ],
        [
            "I like this this very well and this this is a method which is developed by.",
            "Well, yeah by Hornstein, which is a testing Institute in in Germany and this is a stamp model and you see that here you have a stamp and you can with a certain pressure for a certain time.",
            "You can put my crops from one to the other steps.",
            "Oh so you have a kind of infection way you can simulate with this method and you can use their the anti microbia.",
            "Surface is you can use glass.",
            "You can use artificial skin and then mimic if a hand comes.",
            "If a hand comes on a surface or or so on.",
            "So that means that is that is really a good approach.",
            "I think to see if antimicrobial coatings have an effect in preventing in in the ability of yeah.",
            "Prevent diseases really.",
            "Because you see, if there is an infection route given or not, and if this infection is topped by using an antimicrobial coating, and you can also do some cleaning procedures here.",
            "So first you have a dirty and then you clean it with a disinfectant, or you clean it with no disinfecting on for so.",
            "And so I think this is a very nice model to go into the more realistic environment."
        ],
        [
            "OK, and then last point we I maybe that's a little bit yeah, but you have a very conservative industry and just imagine if it's scientifically proven that the reduction of pathogens on surface is more efficient with an AMC and then cleaning with water.",
            "As a conventional coating and treating it with disinfectants just have this idea that would be great 'cause you have less resistance problem, less use of toxic disinfectants.",
            "It's more environmentally friendly and I think that would be a good approach for the future to go in this direction.",
            "But then you have the.",
            "Do do do do do do that, but that's just Germany so.",
            "So that means you have a lot of yeah regulations or or so where where it's written, how to disinfect, how many times with which agent, and so on.",
            "So you have to convince all these people that coating would be great so and that will be fun I think.",
            "But that's just an idea so that really the industry is very.",
            "Conservative, and if you really have innovative ideas, it's difficult to put them and to bring them in the existing lobby."
        ],
        [
            "So what I just want to say is that.",
            "It's really important that we have a good exchange of science and industry, and I'm really thankful for being here to give you some ideas and problems of what we are facing with customers and regulation and so on or technical points.",
            "Then I would like if it's possible to have the Corporation in earlier in research project.",
            "It's earlier stage so that you can say in earlier rather look in this direction.",
            "This could be difficult with this so you have to go over this.",
            "Problem or whatever and that you have to with the inventions that you have to take all aspects into account, not on only the technical ones, so that not only a perfect technical solution that this has also to fit in an existing market.",
            "And that's it."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So welcome also from my side.",
                    "label": 0
                },
                {
                    "sent": "My name is Simona Shooter and I'm working at Evonik.",
                    "label": 0
                },
                {
                    "sent": "I'm very happy to be here a little bit.",
                    "label": 0
                },
                {
                    "sent": "The connection between the industry and the science.",
                    "label": 0
                },
                {
                    "sent": "I worked for research institutes for I think 14 or 15 years and since now eight years I'm in the industry so I think I know quite well aware.",
                    "label": 0
                },
                {
                    "sent": "So I know both words and so I hope I can be there.",
                    "label": 0
                },
                {
                    "sent": "A link to put them more together.",
                    "label": 0
                },
                {
                    "sent": "In the future, and I think I'm which is a good starting point for that.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So, um, just a few words where I'm coming from, so Evonik is not a company you can brand, you know, but Evonik is nearly everywhere in all products you can imagine.",
                    "label": 0
                },
                {
                    "sent": "For example in wall paint we have deformers deaerators this persons and so on that the paint is as as you want to apply it here.",
                    "label": 0
                },
                {
                    "sent": "Metris is we have foam stabilizers.",
                    "label": 0
                },
                {
                    "sent": "We have some acrylics here for the computers.",
                    "label": 0
                },
                {
                    "sent": "We have some.",
                    "label": 0
                },
                {
                    "sent": "Components or emulsify us for cosmetics we have here in the face 8 paint some hydrophobic.",
                    "label": 0
                },
                {
                    "sent": "Additive so that you have facet paints with hydrophobic.",
                    "label": 0
                },
                {
                    "sent": "Attitudes or hear the PMA for the screens and so on.",
                    "label": 0
                },
                {
                    "sent": "Also in the automotive we have additives for the tires of the cars and so on.",
                    "label": 0
                },
                {
                    "sent": "You see that Evonik is nearly everywhere, but you don't know it probably.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So it is divided into 3 big companies.",
                    "label": 0
                },
                {
                    "sent": "Be 3 GmbH is.",
                    "label": 0
                },
                {
                    "sent": "I'm working for the resource efficiency and there we are a lot of link to coatings so the product are crosslinker, silanes and coding and adhesive resins and.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You see also here we have a lot of fields of applications like automotive interior that we have, for example metal additives that yeah that gives the cockpit structure here.",
                    "label": 1
                },
                {
                    "sent": "Yet we have the Canning packaging in plastic coatings for mechanical.",
                    "label": 1
                },
                {
                    "sent": "Properties of that that you can have a very, for example, the new one is for she shoes that you can use them at very cold and very hot.",
                    "label": 0
                },
                {
                    "sent": "Purchase and that they keep their flexibility and so on.",
                    "label": 0
                },
                {
                    "sent": "Antifouling in the heavy duty industry, in check and so on.",
                    "label": 0
                },
                {
                    "sent": "So you see we have we are in all kinds of coatings with our additives.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm working in the new founded Competence Center.",
                    "label": 1
                },
                {
                    "sent": "It's called smart surface solutions, and so it's S3 and their Evonik.",
                    "label": 1
                },
                {
                    "sent": "I found out five emerging topics where their focus, their research and development on and these topics are the antifouling.",
                    "label": 0
                },
                {
                    "sent": "So that is the marine antifouling for ships ship paints then anti icing corrosion protection.",
                    "label": 0
                },
                {
                    "sent": "Easy to clean and antimicrobial and I'm heading the group of the antimicrobial research team.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um, so here the opportunities are also given you.",
                    "label": 0
                },
                {
                    "sent": "I just wanted to say that we have 5 interdisciplinary experience teams and that's the first point.",
                    "label": 0
                },
                {
                    "sent": "I want to stress when you work with the industry and the science or the scientific institutes, it's very important to have interdisciplinary teams because I'm the only one and only microbiologist.",
                    "label": 0
                },
                {
                    "sent": "This company, I think, and my colleagues are all chemists or coating engineers.",
                    "label": 0
                },
                {
                    "sent": "Or yeah, so mainly chemists and coating engineers and they said, OK, we cannot cope with this topic with the anti microbiol topic without having a microbiologist there and I think it was a little bit true because so they had some other experience.",
                    "label": 0
                },
                {
                    "sent": "Yeah they had some other ideas.",
                    "label": 0
                },
                {
                    "sent": "About how to cope with this problem, then we have we have several cooperation with external partners like startup companies and universities.",
                    "label": 0
                },
                {
                    "sent": "This is especially in this point of the antimicrobial coatings.",
                    "label": 0
                },
                {
                    "sent": "Very important because we do not have antimicrobial additives until now.",
                    "label": 0
                },
                {
                    "sent": "So there we are dependent on what other persons invented and we are in contact with them and testing them and so on.",
                    "label": 0
                },
                {
                    "sent": "So we did not find the one and only solution until now.",
                    "label": 0
                },
                {
                    "sent": "The main location is Ineson where I'm coming from, but we also have a lap in Singapore and we are about 20 persons who are working on this five topics so not too big, but perhaps we are growing.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what are what do the customers saw, especially our customers want they want to have an easy to use long-term universe, non toxic, non hazardous and very price efficient technical solution with no drawbacks to the coating properties.",
                    "label": 1
                },
                {
                    "sent": "So OK so go and let's go do it.",
                    "label": 0
                },
                {
                    "sent": "Do some research and come back with a solution so.",
                    "label": 0
                },
                {
                    "sent": "But the challenges we have to face.",
                    "label": 1
                },
                {
                    "sent": "Is so there are several technology available, so I'm also coming to the article later, but they are often treating only one aspect of antimicrobial action.",
                    "label": 1
                },
                {
                    "sent": "And not all technologies are applicable in every application.",
                    "label": 0
                },
                {
                    "sent": "Let's also clear so you have some restrictions there then.",
                    "label": 0
                },
                {
                    "sent": "As I said, interdisciplinary project teams are really rare in the industry, so if you have a chemical company, then you find chemists in this industry and not a microbiologist normally.",
                    "label": 0
                },
                {
                    "sent": "Or if you are a Research Institute, then you have all researchers on the one topic, but there's no one from the from the from other disciplinaries.",
                    "label": 0
                },
                {
                    "sent": "Um, yeah, and which is a really big thing, is that the investments are very high for a future uncertain market, so because its knew there are not so many things in the market right now, it's not.",
                    "label": 0
                },
                {
                    "sent": "It's uncertain.",
                    "label": 1
                },
                {
                    "sent": "You do not know if the customer except this.",
                    "label": 0
                },
                {
                    "sent": "And it's time and cost intensive research plus the regulatory demands.",
                    "label": 0
                },
                {
                    "sent": "So the company must really decide to go into this field before.",
                    "label": 0
                },
                {
                    "sent": "And it doesn't matter how many technical solutions are available there, because it has to be a decision in front if they want to do it, yes or not, because it's really a lot of time and money.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You already mentioned this.",
                    "label": 0
                },
                {
                    "sent": "Publication it's really a very big good overview about the different technologies and there also mentioned some drawbacks, but.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I will go there so I have also a slide of the different technologies and I will go there a little bit into detail that you understand what we can use in what we cannot use at the moment.",
                    "label": 0
                },
                {
                    "sent": "So the most classical is the anti microbiol loading so you have a Biosite incorporated in the coating.",
                    "label": 0
                },
                {
                    "sent": "This will be leached over the time and that's good because it kills the bacteria, but that's bad as well because then the buyer side will be gone.",
                    "label": 0
                },
                {
                    "sent": "After a certain while, and.",
                    "label": 0
                },
                {
                    "sent": "And so you have the problem of the leaching that the active agent is not there after certain time.",
                    "label": 1
                },
                {
                    "sent": "And I mean there are the bacteria there, and if they are there for a long time, resistance can be developed against the Biosite.",
                    "label": 0
                },
                {
                    "sent": "Adoption can develop and OK. Then you have fear.",
                    "label": 0
                },
                {
                    "sent": "The dead biomass on the surface and then they are coming new bacteria.",
                    "label": 0
                },
                {
                    "sent": "What do they find?",
                    "label": 0
                },
                {
                    "sent": "Like it's like Schnitzel so they like it.",
                    "label": 0
                },
                {
                    "sent": "They eat there and so that it will be quoted by microbes.",
                    "label": 0
                },
                {
                    "sent": "Anyway if you don't clean the surface.",
                    "label": 0
                },
                {
                    "sent": "So that means you have a overgrowth and you have.",
                    "label": 0
                },
                {
                    "sent": "I will come to that later.",
                    "label": 0
                },
                {
                    "sent": "You have some troubles with the Biosite product regulation.",
                    "label": 0
                },
                {
                    "sent": "Then as you said, so titanium dioxide, for example, is a typical photoactivated surface.",
                    "label": 0
                },
                {
                    "sent": "Then you have these cascades.",
                    "label": 0
                },
                {
                    "sent": "That's very good, because this is still, I say, still a physical effect.",
                    "label": 1
                },
                {
                    "sent": "So that means that it has not go another.",
                    "label": 0
                },
                {
                    "sent": "VPR, but the titanium dioxide.",
                    "label": 0
                },
                {
                    "sent": "For example, it has because it forms radicals and then so UV is still the physical effect, but the predicates, for example they are active, that is, free radicals generated by air and water, or something like that.",
                    "label": 0
                },
                {
                    "sent": "So that means it's an easy to bio side which has to be registered.",
                    "label": 0
                },
                {
                    "sent": "Often you need UV.",
                    "label": 0
                },
                {
                    "sent": "An one point here is, and this is often forget, and that if you have a coating then you have some additives.",
                    "label": 0
                },
                {
                    "sent": "You have some pigments, let that it's green or black or white or whatever, and then you have a binder and solvent and the solvent can be waterborne or solvent borne.",
                    "label": 0
                },
                {
                    "sent": "And the binders are often polymeric substances organics.",
                    "label": 0
                },
                {
                    "sent": "So that means if you have here.",
                    "label": 0
                },
                {
                    "sent": "Radical radical, so you have this oxidizing action or the time that means that the binder will be degraded during the time, so that means that this could be an.",
                    "label": 0
                },
                {
                    "sent": "Disadvantage and you have two prep develop not a GNU bio side button.",
                    "label": 0
                },
                {
                    "sent": "You binding system which is rather an an organic binding system.",
                    "label": 0
                },
                {
                    "sent": "OK, then we're going to the surface, so these are the contact surface is which you mentioned.",
                    "label": 0
                },
                {
                    "sent": "These are often polymeric binders.",
                    "label": 1
                },
                {
                    "sent": "I think your technology is also so the crowd that technology is also something like that you have off.",
                    "label": 0
                },
                {
                    "sent": "So the big advantage is that you don't have a leaching, but you also have the problem with the overgrowth.",
                    "label": 0
                },
                {
                    "sent": "If you don't clean the surface is the resistance.",
                    "label": 0
                },
                {
                    "sent": "The BPR is also a problem, and this is again something which you have in mind, so the bind us which I normally used for paints and coatings.",
                    "label": 0
                },
                {
                    "sent": "You are normally looking at.",
                    "label": 0
                },
                {
                    "sent": "They all have an ionic binders.",
                    "label": 0
                },
                {
                    "sent": "So you have often acrylates or something like it, so you have other jonak binders, but this is often if you have quite an area, ammonium compounds positively charged here, and if you combine the anionic binders with the positively charged.",
                    "label": 0
                },
                {
                    "sent": "Polymar then you don't have any efficiency left.",
                    "label": 0
                },
                {
                    "sent": "So this you also have to have a mind, then we're going to the nanostructure.",
                    "label": 1
                },
                {
                    "sent": "There the it's rather a settlement prevention, so an anti ATS effect.",
                    "label": 0
                },
                {
                    "sent": "This is a physical effect that is really good 'cause you do not have to register anything but here, this stability is the crucial point becausw, especially if you're going into the hospital environment and you have the cleaning and you have disinfectants and you have.",
                    "label": 0
                },
                {
                    "sent": "I don't know what then you will have this effect only for a limited time, so I think it's really easy.",
                    "label": 0
                },
                {
                    "sent": "So if it's gone.",
                    "label": 0
                },
                {
                    "sent": "So these nanostructures are also given sometimes with the hydrophobic hydrophilic.",
                    "label": 0
                },
                {
                    "sent": "So amphiphilic binders and this could be 11 idea for the future.",
                    "label": 0
                },
                {
                    "sent": "Then you have these anti adhesive structures, that is that is what I said.",
                    "label": 0
                },
                {
                    "sent": "There there are also some postulations that if you have a hydrophilic.",
                    "label": 0
                },
                {
                    "sent": "The surrounding of this, then the bacteria do not see that there is a surface that they just swim around and say OK, nothing to settle down.",
                    "label": 0
                },
                {
                    "sent": "So, but this is in the tests at the moment, so I cannot say if it's working or not, but this is in tests at the moment and these three technologies I would say that these are fancy ideas and it's fine, but they are the critical point is often the.",
                    "label": 0
                },
                {
                    "sent": "Realization so how do you want to incorporate, for example, enzymes or?",
                    "label": 0
                },
                {
                    "sent": "Overall, let's say proteins or quorum sensing molecules in the coating.",
                    "label": 0
                },
                {
                    "sent": "How do you want to get them in there and also the upscaling is there very big problem because you have to produce tons of the additive in the future.",
                    "label": 0
                },
                {
                    "sent": "And if you're looking for.",
                    "label": 0
                },
                {
                    "sent": "Yeah, for example, for some certain amino acids, then you pay thousand euros for gram or milligram.",
                    "label": 0
                },
                {
                    "sent": "So and this is not really feasible at the moment I do not want to say it's never feasible, but at the moment I would say it is too far away from the reality, but this is certainly a point where you could look at and I mean if you think on.",
                    "label": 0
                },
                {
                    "sent": "Enzymes, for example.",
                    "label": 0
                },
                {
                    "sent": "It is also not long ago that we couldn't handle enzymes in this huge amounts at how we can treat it, how we can buy it now but but at the moment it is really the scale.",
                    "label": 0
                },
                {
                    "sent": "Up is very yeah I do not know if this works or not and often you have here a biological action.",
                    "label": 0
                },
                {
                    "sent": "But this also means that you have to use it in mild.",
                    "label": 0
                },
                {
                    "sent": "Environment, so the pH must be OK.",
                    "label": 0
                },
                {
                    "sent": "It must be humid.",
                    "label": 0
                },
                {
                    "sent": "It must be the temperature must be OK.",
                    "label": 0
                },
                {
                    "sent": "So and sometimes if you have some curing processes of coatings, then the curing is at higher temperature.",
                    "label": 0
                },
                {
                    "sent": "So if you are looking for powder coating for example, then it's at 6080 degrees and then the enzymes say goodbye or whatever, so these molecules.",
                    "label": 0
                },
                {
                    "sent": "So that's that's also from the technology, and I think powder coating.",
                    "label": 1
                },
                {
                    "sent": "And two KPUR coatings and some UV coatings.",
                    "label": 0
                },
                {
                    "sent": "These are the main coatings which you apply on handle door handles on tables on on whatever.",
                    "label": 0
                },
                {
                    "sent": "So you have to have the how.",
                    "label": 1
                },
                {
                    "sent": "What kind of coating is?",
                    "label": 0
                },
                {
                    "sent": "Applicated on the thing you have to keep this in mind and then you will see.",
                    "label": 0
                },
                {
                    "sent": "What is technically feasible and what not?",
                    "label": 0
                },
                {
                    "sent": "And there the communication between the industry and the scientific persons have to be at an earlier stage I think.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So then this is my really the pain topic we have.",
                    "label": 0
                },
                {
                    "sent": "So Europe is not the only one.",
                    "label": 0
                },
                {
                    "sent": "Also US, Japan, China have nearly every other country has really some regulations, but we have the AECOM and we have the bio side product Regulation and if you apply the coating on the medical devices themselves then we have the medical device regulation and the costs of what they say is between 3:00 and 6:00 million euro and the duration so remember.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At his presentation, the journey from idea to antimicrobial from Croda in poor gifts from Hosayn last year, remember so it will take some time so it lasts 10 year.",
                    "label": 0
                },
                {
                    "sent": "But I think that was the invention until the market, but the registration process there was also quite a long journey.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And if you are looking so, you start with a new molecule.",
                    "label": 0
                },
                {
                    "sent": "So all the research and the efficiency test and so on are in front.",
                    "label": 0
                },
                {
                    "sent": "So now you have the molecule you want to put onto the market.",
                    "label": 0
                },
                {
                    "sent": "Then you start for example in this year with Adasi.",
                    "label": 0
                },
                {
                    "sent": "So you have to collect all data you have to do a lot of toxicity tests.",
                    "label": 0
                },
                {
                    "sent": "You have to do a lot of efficiency tests.",
                    "label": 0
                },
                {
                    "sent": "You have to provide an example how you want to apply it.",
                    "label": 0
                },
                {
                    "sent": "You have to provide.",
                    "label": 0
                },
                {
                    "sent": "Everything and you have a first check from the ECR, then from EU authorities then they say OK looks good but you have to do some more tests.",
                    "label": 0
                },
                {
                    "sent": "You have the additional tests then you got then this is a real starting point.",
                    "label": 0
                },
                {
                    "sent": "Then you have the evaluation of the authorities and the authorities are just country wise and they give it then to the echo or to the European Commission.",
                    "label": 1
                },
                {
                    "sent": "And they have one year to say yes, it's OK or not so and the finally you get then the EU Commission decision and you can start with a registered active agent.",
                    "label": 0
                },
                {
                    "sent": "So and an entry in the Union list.",
                    "label": 0
                },
                {
                    "sent": "And here on my time scale here it would last six years and cost about 3 million euros.",
                    "label": 0
                },
                {
                    "sent": "Can be little different, but I think the.",
                    "label": 1
                },
                {
                    "sent": "The magnitude is OK. And then you want to sell it, but.",
                    "label": 0
                },
                {
                    "sent": "Then it goes further be 'cause you have the registered active agent.",
                    "label": 0
                },
                {
                    "sent": "But in every product where you put your agent in, this is about silent product which has also be ridges that and this.",
                    "label": 0
                },
                {
                    "sent": "Lasts again three years and two men in Europe.",
                    "label": 0
                },
                {
                    "sent": "And I mean that can differ very much on in how many countries and how many product types you want to register and so on.",
                    "label": 0
                },
                {
                    "sent": "But just take it as a metric is really takes awhile and it's also again very expensive and now.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For the industry, if you look for the supply chain for the coating industries, it is like that we are the additive supplier like Evonik like crude alike.",
                    "label": 0
                },
                {
                    "sent": "RAF so they are doing silver for example.",
                    "label": 0
                },
                {
                    "sent": "So we are the additive supplier.",
                    "label": 1
                },
                {
                    "sent": "We have the active agent.",
                    "label": 1
                },
                {
                    "sent": "We can say that.",
                    "label": 0
                },
                {
                    "sent": "But our customers, the coating manage manufacturer like PPG, Sherwin-Williams excellent balance on these are the really which are selling the paint to the customers.",
                    "label": 0
                },
                {
                    "sent": "They have to register their biocide products and maybe they have a blue paint and they have a pink paint and they have us or they have three bio side products and sometimes you can put it in a family and so on.",
                    "label": 0
                },
                {
                    "sent": "I just want to send sensible eyes yourself that this is not easy to find.",
                    "label": 0
                },
                {
                    "sent": "The customers who are doing that.",
                    "label": 0
                },
                {
                    "sent": "And then you have the end users like hospitals, public transportation.",
                    "label": 1
                },
                {
                    "sent": "So it's not only hospital, should be also tried public transportation for example toys.",
                    "label": 0
                },
                {
                    "sent": "Now that the babies can put them into the mouth and so on.",
                    "label": 0
                },
                {
                    "sent": "So Auto Mobile is very interested in anti microbials because you will have a lot of more car sharing and so on and you never know who was sitting in front before me in the crowd and so on.",
                    "label": 0
                },
                {
                    "sent": "So they're really very interested in anti microbia.",
                    "label": 0
                },
                {
                    "sent": "Coatings and they then they have a treated our ticket so they have to label it that there is a biocide inside, but then imagine so do our customers want to spend three years and 2 million euro for one biocide product, family or whatever?",
                    "label": 1
                },
                {
                    "sent": "And do sensitive customers want to label their products?",
                    "label": 1
                },
                {
                    "sent": "So if you have, for example, a toy and there's written OK, it's anti microbia.",
                    "label": 0
                },
                {
                    "sent": "You could put it in the mouth.",
                    "label": 0
                },
                {
                    "sent": "But then it's labeled that there is a bio side inside, so maybe there can be some problems there.",
                    "label": 0
                },
                {
                    "sent": "So this is the.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Biocide, So what does that mean for me?",
                    "label": 1
                },
                {
                    "sent": "That one thing is that only big companies can afford the registration process.",
                    "label": 1
                },
                {
                    "sent": "I think that's what Hossain told us last time as well.",
                    "label": 1
                },
                {
                    "sent": "He was lucky that Cruda, he found Crowder that they did that work for you.",
                    "label": 0
                },
                {
                    "sent": "It's nearly impossible for startup companies or University spinoffs, even if they have a good idea.",
                    "label": 0
                },
                {
                    "sent": "If they have a good active agent, I think it's not possible that they can handle this registration process.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 1
                },
                {
                    "sent": "And I think that is the reason why the way is away from antimicrobial actives towards physical effects.",
                    "label": 0
                },
                {
                    "sent": "Then you can still have the UV.",
                    "label": 0
                },
                {
                    "sent": "I do not have an idea how to put the UV into a coating, but perhaps you can have some ideas there.",
                    "label": 0
                },
                {
                    "sent": "Then we have these anti adhesive structures and we have easy to clean surfaces and I I really think that.",
                    "label": 0
                },
                {
                    "sent": "It is very difficult to have a new antimicrobial molecule and I think that we will focus on these effects.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then let me say something about the efficiency about the test.",
                    "label": 0
                },
                {
                    "sent": "I know that this is not the topic of this working group, but I think this is also very important.",
                    "label": 0
                },
                {
                    "sent": "So because if you have here a surface and you have a surface with the contact biocide, then only the dead bacteria will be killed and the living bacteria will stake.",
                    "label": 1
                },
                {
                    "sent": "Stay in the mattress and you always have to keep in mind that this is.",
                    "label": 0
                },
                {
                    "sent": "Always dirty.",
                    "label": 0
                },
                {
                    "sent": "It is never just water or a steroid.",
                    "label": 0
                },
                {
                    "sent": "Solution or whatever where you put threaten amount of a pure culture in.",
                    "label": 0
                },
                {
                    "sent": "It's always dirty and you have fat in Greece and blood and in the hospital environment and you never know if this works also with the dirt but all the efficiency tests are done with very clean and standardized.",
                    "label": 0
                },
                {
                    "sent": "Things, and if you have a surface with a soluble as bio side, then this will entering here and kill all bacteria.",
                    "label": 0
                },
                {
                    "sent": "And this is also that here I stole this slide also from Hossein.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is also you have a lot of standard test methods, but to select the really efficient bio sites or.",
                    "label": 1
                },
                {
                    "sent": "Molecules it.",
                    "label": 0
                },
                {
                    "sent": "I think they are not really suited.",
                    "label": 0
                },
                {
                    "sent": "This standard methods becausw you.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Oh have for example difficulties if you have hydrophobic surface is then then you put a droplet of bacterial solution on it and then it it goes as you have one droplet and you can't code over the surface.",
                    "label": 0
                },
                {
                    "sent": "Then you just have cultivation method that is also something about your project.",
                    "label": 0
                },
                {
                    "sent": "You again only swap.",
                    "label": 0
                },
                {
                    "sent": "You never look for the viable but non culturable bacteria don't look for for example can be that the bacteria or rather.",
                    "label": 0
                },
                {
                    "sent": "Injured that the membranes are not intact, but that they if they come again on a cultural cultural plate that they can re growth even if they are injured.",
                    "label": 0
                },
                {
                    "sent": "And so you always sticking to this.",
                    "label": 0
                },
                {
                    "sent": "Cultivation methods, then.",
                    "label": 0
                },
                {
                    "sent": "The other tests are just 24 hours, so it does not say anything about the long life long lasting effects.",
                    "label": 0
                },
                {
                    "sent": "Oh OK, you have you sent it to test surface to an Institute.",
                    "label": 0
                },
                {
                    "sent": "They're doing this test over 24 hours and say, OK, it's fine.",
                    "label": 0
                },
                {
                    "sent": "You have a significant antimicrobial effect.",
                    "label": 0
                },
                {
                    "sent": "But what does that mean for the reality?",
                    "label": 0
                },
                {
                    "sent": "Does it really stays there for more than 20 hours for rather 4?",
                    "label": 0
                },
                {
                    "sent": "If you're looking for hospital 24 years.",
                    "label": 0
                },
                {
                    "sent": "Yeah, then you always work with pure cultures, clinical strains and no contamination, and it is known that if you take strains which are clinical strange from a database, then they are always much more sensitive than if you really work with environmental strains because they are.",
                    "label": 1
                },
                {
                    "sent": "I mean, it's like like if you have a pet and cat Wildcat.",
                    "label": 0
                },
                {
                    "sent": "So this is a little bit like that.",
                    "label": 0
                },
                {
                    "sent": "So if you always take this 80 seats by two five, I don't know what.",
                    "label": 0
                },
                {
                    "sent": "Then you have really very harmless microbes in contrast to what is really present in the clinical field.",
                    "label": 0
                },
                {
                    "sent": "You always, as I mentioned, work and are very clean conditions.",
                    "label": 0
                },
                {
                    "sent": "You have no.",
                    "label": 0
                },
                {
                    "sent": "Idea if it's really works also with grease with dirt with black with I do not don't know what.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so some of the tests are not suited because they always see the antimicrobial effect.",
                    "label": 0
                },
                {
                    "sent": "But if you have just an effect on really on the surface or you have an anti adhesive effect then all these methods won't work 'cause you always get culturable cells but it does not tell you anything about if they you're not here and so on.",
                    "label": 0
                },
                {
                    "sent": "So they are not suitable.",
                    "label": 1
                },
                {
                    "sent": "So and then my question is where is there the practical relevance?",
                    "label": 0
                },
                {
                    "sent": "Um, I just.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I like this this very well and this this is a method which is developed by.",
                    "label": 0
                },
                {
                    "sent": "Well, yeah by Hornstein, which is a testing Institute in in Germany and this is a stamp model and you see that here you have a stamp and you can with a certain pressure for a certain time.",
                    "label": 0
                },
                {
                    "sent": "You can put my crops from one to the other steps.",
                    "label": 0
                },
                {
                    "sent": "Oh so you have a kind of infection way you can simulate with this method and you can use their the anti microbia.",
                    "label": 0
                },
                {
                    "sent": "Surface is you can use glass.",
                    "label": 0
                },
                {
                    "sent": "You can use artificial skin and then mimic if a hand comes.",
                    "label": 1
                },
                {
                    "sent": "If a hand comes on a surface or or so on.",
                    "label": 0
                },
                {
                    "sent": "So that means that is that is really a good approach.",
                    "label": 0
                },
                {
                    "sent": "I think to see if antimicrobial coatings have an effect in preventing in in the ability of yeah.",
                    "label": 0
                },
                {
                    "sent": "Prevent diseases really.",
                    "label": 0
                },
                {
                    "sent": "Because you see, if there is an infection route given or not, and if this infection is topped by using an antimicrobial coating, and you can also do some cleaning procedures here.",
                    "label": 0
                },
                {
                    "sent": "So first you have a dirty and then you clean it with a disinfectant, or you clean it with no disinfecting on for so.",
                    "label": 0
                },
                {
                    "sent": "And so I think this is a very nice model to go into the more realistic environment.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, and then last point we I maybe that's a little bit yeah, but you have a very conservative industry and just imagine if it's scientifically proven that the reduction of pathogens on surface is more efficient with an AMC and then cleaning with water.",
                    "label": 1
                },
                {
                    "sent": "As a conventional coating and treating it with disinfectants just have this idea that would be great 'cause you have less resistance problem, less use of toxic disinfectants.",
                    "label": 0
                },
                {
                    "sent": "It's more environmentally friendly and I think that would be a good approach for the future to go in this direction.",
                    "label": 0
                },
                {
                    "sent": "But then you have the.",
                    "label": 0
                },
                {
                    "sent": "Do do do do do do that, but that's just Germany so.",
                    "label": 0
                },
                {
                    "sent": "So that means you have a lot of yeah regulations or or so where where it's written, how to disinfect, how many times with which agent, and so on.",
                    "label": 0
                },
                {
                    "sent": "So you have to convince all these people that coating would be great so and that will be fun I think.",
                    "label": 0
                },
                {
                    "sent": "But that's just an idea so that really the industry is very.",
                    "label": 0
                },
                {
                    "sent": "Conservative, and if you really have innovative ideas, it's difficult to put them and to bring them in the existing lobby.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what I just want to say is that.",
                    "label": 0
                },
                {
                    "sent": "It's really important that we have a good exchange of science and industry, and I'm really thankful for being here to give you some ideas and problems of what we are facing with customers and regulation and so on or technical points.",
                    "label": 0
                },
                {
                    "sent": "Then I would like if it's possible to have the Corporation in earlier in research project.",
                    "label": 0
                },
                {
                    "sent": "It's earlier stage so that you can say in earlier rather look in this direction.",
                    "label": 0
                },
                {
                    "sent": "This could be difficult with this so you have to go over this.",
                    "label": 0
                },
                {
                    "sent": "Problem or whatever and that you have to with the inventions that you have to take all aspects into account, not on only the technical ones, so that not only a perfect technical solution that this has also to fit in an existing market.",
                    "label": 1
                },
                {
                    "sent": "And that's it.",
                    "label": 0
                }
            ]
        }
    }
}