{
    "id": "2fkc2bgctpwgydnqo5z2awtaajpugcrv",
    "title": "Virtual organisations breeding environment",
    "info": {
        "author": [
            "Hamideh Afsarmanesh, University of Amsterdam"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "May 2006",
        "category": [
            "Top->Business->Networked Organizations",
            "Top->Business->Virtual Enterprises"
        ]
    },
    "url": "http://videolectures.net/brussels06_afsarmanesh_v/",
    "segmentation": [
        [
            "So.",
            "I will talk about virtual organization breeding environments that we call for short VBS, actually.",
            "Calling it virtual reading environment perhaps is not as let's say proper as virtual organization reading environment because it's video breeding environment.",
            "Virtual reading environment gives this impression to the audience that actually this is not a real reading environment, but a virtual one.",
            "So VBS stands for which organization building environment or or VIO breeding environment?",
            "What I'm going to talk about today is first bring it to your attention that actually.",
            "Although the networks here all have established already Evie and are interested in VB operation stage in our work, we work back issue at the project we are focusing on all aspects of the VB lifecycle, so we start with the vbe creation.",
            "We focus on that.",
            "We do work of course on VB operation, that's understandable.",
            "Then we also address EV evolution.",
            "VB dissolution and VB metamorphoses.",
            "So all of these stages or address not only the VB operation.",
            "What I will do is first address the challenges for the bees and the barriers.",
            "Why is it that the bees are not in fact diploid, as much as they should in the market and society?",
            "After that I will talk about the activities that are planned inside the project for the V and what is our ambition.",
            "I talk a little bit about that.",
            "There if there is time, I hope I take you through the terminology that we have defined within the VB through the ontology and then I took some extracts out of one of our deliverables that describes a part of the ontology that we have developed for VB so that we talk the same language so that the terminology is not confused.",
            "Then I quickly go over the functionality which is planned to be developed within the Vbe management system that we call VMS, and I give you an architecture for how these components relate to each other and at the end I'll come back to the subject of the OH creation, functionality and how the architecture of your creation and VB management system integrate with each other.",
            "So.",
            "Which one of these pages?"
        ],
        [
            "It works OK.",
            "So what is the main motivation for VB in, you know, research?",
            "For example, the main motivation is dynamic creation of videos, dynamic creation of videos from an open universe of organization involves many challenges.",
            "So when an opportunity is strikes, there are many challenges to actually go from this open universe of organizations into a."
        ],
        [
            "You establish the oh.",
            "These are some of the important challenges there.",
            "How to know about the existence and abilities of the potential partners that exist out there in the open universe?",
            "Even if you know that how to dynamically configure and you go from organizations that are autonomous and heterogeneous and independent, how do you do that?",
            "There are many steps involved in especially the second issue, dealing with incompatibility and heterogeneity of information sources, finding basic profile and competency information.",
            "Dealing with semantic estrogen.",
            "80s selecting the organizations that are proper.",
            "Establishing common interoperability and integration platform building trusts.",
            "Developing the common principles, defining roles, rights and sharing, etc.",
            "So this is not an easy task to do, So what we."
        ],
        [
            "Address in the Vbe is the idea that instead of going directly from open universe to the video creation we divided.",
            "We do it in two steps.",
            "We first talk about an Association or a long term alliance among some of the organizations from the Open universe that is called a controlled border universe.",
            "Then from this control border universe, when we increase the preparedness and readiness of these organizations.",
            "This Step 2 creating a video when an opportunity strikes is doable is something that we can do, and the goal of the vbe at inequality is to do fluid creation of views.",
            "So we want to make sure that that is less costly, less time consuming an.",
            "It's also something that you know is the efficient and effective for all the people involved.",
            "Notice that this is the main motivation."
        ],
        [
            "I will come back to it and tell you how much more we can do for the organizations, but the definition of the PDF, given a colleague then is an Association or alliance of organizations and their related supporting institutions.",
            "That's very important that adhere to one agreement.",
            "One cooperation agreement not collaboration.",
            "Remember that we separated those two from each other.",
            "Cooperation is much shallower than collaboration.",
            "Collaboration is towards a goal.",
            "You have to produce some products and there is a contract etc.",
            "Cooperation is just working together in an environment, which is, you know, the sharing principles are defined and you can actually trust each other.",
            "So the cooperation agreement is there adopting the common operating principles and infrastructures with the goal to increase the chance of preparedness and getting involved in virtual organizations.",
            "So in if you if you actually look outside, you see that many.",
            "Let's say manifestation of this phenomenon already exists.",
            "We have industry districts, industry clusters, SMB networks, foundations, fundaciones.",
            "Are there clubs even summer called Networks, etc."
        ],
        [
            "So.",
            "In order to have the full fledged EU wide VBS.",
            "In practice, what we're doing towards it is developing a young, promising lion for it.",
            "So the aim of equally is to Excel and reach innovation that is necessary for fluid creation of videos.",
            "Defining related concepts, reference models and methodologies.",
            "Develop mechanisms, prototypes and proof of concepts and of course.",
            "What needs to be achieved later to make this young lion a real full fledge lion is national and international laws heavy public sponsorship.",
            "Productization of equality RND results global trust and acceptance by the Society and market etc."
        ],
        [
            "OK, now I'm going to tell you a little bit about what we have done and what we plan to do OK?",
            "This is the plan up there that you see for the four years of VB.",
            "There are three main sub projects.",
            "The first subproject, which is we being models and mechanisms, which was a general understanding and developing the basic concepts for VBS is already finished.",
            "We have achieved that and if you check over here you see that there are deliverables 220 N. Sorry that delivers are not even here there are deliverables that we have there like 21.1 that the base concepts and.",
            "Basic principles for sharing and working together or define there.",
            "The second subproject video creation framework has asserted in Month 6 and it's still ongoing and these are the recent deliverables 23.1 you're planning and launching at Mount 15 had the first draft and then we have another 1A specification of your creation support tools at 124.",
            "These two deliverables you can check if you want to know this state of video creation framework within the VB.",
            "The third subproject is started among 12 and it's going to continue until the amount 48.",
            "This sub project is focused on VB in management system.",
            "We believe that if we be in order to be effective, requires a management system, a system and an administration that cares for what's happening in the VB and promoted and corrected an assisted.",
            "So we have actually generated so far many deliverables that you can check back a specification of profile and competency management is one that I recommend for those of you who are interested in knowing what we can do about competency management.",
            "We had one experimental prototype which was very minor in comparison to the what we developed or what we specified in the other deliverable, but you can check into that.",
            "It used the agent technology actually for prototyping.",
            "We have this.",
            "This is wrong.",
            "We be common ontology which I have given you an extract.",
            "I'm going to come back to it that describes all of the terminology that is needed in this area to share the understanding.",
            "Of VB and VB elements and concepts for all the people involved inside the VB outside the vbe between the VBS.",
            "So we tried to do a real ontology with all the detailed descriptions so that we develop we provide some better clarified views of what we're talking about.",
            "We have the characterization of the value system and matrix.",
            "This is, of course there's many much more to do about it, but if you want to know what we're doing about value system, this is the deliverable creating and supporting trust culture in VBS.",
            "This is one of our ambitions, and I can tell you a little bit about it if you want in during the break.",
            "But this is actually one deliverable that I recommend for those of you who are interested in knowing what we're doing and trust which is objective.",
            "And not subjective, trust and trust among organizations not not trust among people.",
            "If you want to know what we're doing and what we're suggesting our approach, please refer to this deliverable.",
            "We be management system this we have started.",
            "This is going to continue all the way to the end and many of you at least three networks will be very heavily involved.",
            "So this is the plan."
        ],
        [
            "Of activities.",
            "How did we decide on doing what we're doing?",
            "This is just to show you that we have done our homework.",
            "We looked into what exists in the literature and in practice we have a number of networks that are studied.",
            "We have generated many questionnaires that were taken by networks, not only in Europe but outside Europe as well.",
            "We have considered all of those, but and confirm summary report is that everybody agrees that alliances and networks are doing alright.",
            "But they can do much better.",
            "Everybody believes that and they need, you know, some assistance in different areas so."
        ],
        [
            "That's how we identified which areas to focus on.",
            "One other, let's say issue that I want to bring it to your attention is that in our carefully study we identified three main barriers to the vbe being fully diploid and in use the first main barrier is the current VB operational level challenges.",
            "What are the challenges market problems?",
            "They are not fully at economically successful governance principle lacking or very limited.",
            "Updating competency is another vbe, an member.",
            "Information how to cope.",
            "Member Organization Trust and Performance Measurement.",
            "How to do clear division of responsibilities, roles and their interactions.",
            "Missing guidelines, procedures, return rules etc.",
            "Create the image and name.",
            "Not very successful.",
            "Absence of personal contact.",
            "Etc.",
            "What you see on there.",
            "Every one of these issues or actually our approach to it.",
            "Our approach to assist it, we're not claiming that we have solved these problems, never, but they're claiming that with all these approaches with all these things that we can do, we can assist the problem an in the neck."
        ],
        [
            "This slide that unfortunately doesn't show in the print out.",
            "You can maybe make a mark next to it.",
            "The red ones are the ones that we are doing.",
            "We are adressing in in the work package too.",
            "So all of the red ones are being addressed.",
            "Whatever is Gray down here is our approach.",
            "We talk about it.",
            "We detailed it out in our specification deliverables, but we're not going to be able to do anything specific about it.",
            "Maybe because it's outside the vbe, maybe because it's too difficult to do, maybe because it requires international efforts, legal for example, etc."
        ],
        [
            "The second biggest barrier for why their deployment of VB is the attracting of new members and keeping them happy.",
            "This is a barrier we are told in our studies.",
            "What are the good examples of that?",
            "We turn on time and cost investment, fear of not having enough return on investment, losing decision making power, a collaboration side effect.",
            "They lose one once you collaborate with somebody you're not fully in control.",
            "Fear of partner selection by virtual system.",
            "This was a big fear actually.",
            "Required high commitment level.",
            "Some organizations want to be involved, but not too much.",
            "Trust in IPR problems.",
            "Another issue.",
            "So what what you see in Gray again are what we have have suggested, and we have, you know, identified as some."
        ],
        [
            "Allusions to assist these situations.",
            "And here you see that we are doing most of them, except IPR.",
            "Appear is difficult, so we have decided we're not going to touch it.",
            "We just identified as a main problem and something that can help you know.",
            "Resolving this problem that everybody identifies in the network.",
            "But we're not going to do anything about it.",
            "We can't, we don't have the manpower for it.",
            "The third and last."
        ],
        [
            "Main barriers to wider deployment of the B is currently the creationist age problems, so notice we have currently be operation level problems.",
            "We have how to attract members and keep them happy and current DB creation stage problems.",
            "So what are the problems there may be creation methodology and tools are lacking.",
            "Benefits that founders expect when initiating evb is unclear.",
            "Huge efforts and costs needed to be invested.",
            "Heavy and unclear.",
            "And legal issues."
        ],
        [
            "So what do we do about them?",
            "We only take care of that.",
            "We know what's needed to be done, but we cannot do it for the others, so these red parts show what we are planning to do is our ambition."
        ],
        [
            "But we have even a bigger ambition, not only want to do what is good for everybody, so that the hose can be more or less formed in a fluid way.",
            "We want to actually do something that makes the whole greater than the sum of its parts.",
            "Which is these are the organizations.",
            "We want to identify these things.",
            "These things are what is needed to make this a bigger, more powerful, more effective element in the SoC and market than what a network does, which is only putting these things together.",
            "And what are those features?",
            "First of all, the classified them into three areas in power boost and replicate, and Secondly we have to identify what to do in under each one of these and then which one are the hot issues.",
            "That is a term we use inequality actually introduced by TX T2."
        ],
        [
            "Identify which one we're going to implement, so in power boost and replicate empower address already identified needs needs that are already there.",
            "ICT based infrastructure, competence management, trust management, performance management, history inheritance.",
            "I city based infrastructure.",
            "We do not develop what they call.",
            "It develops everything else.",
            "We're going to do here in work package too.",
            "For boosting, what have you identified?",
            "These are extended support for GNU GNU discovered potentials, which are not.",
            "We have not found it running in existing networks.",
            "What are they proactive discovery of opportunities?",
            "Creation of new opportunities.",
            "Discovery of emerging knew competences that Vbe can hold, while individual partners do not have bag of assets.",
            "I'll tell you a little bit about IT support institution facilitation accreditation from different external organizations.",
            "System of incentives.",
            "About these everything up to the accreditation which requires external organization is something that we're going to touch.",
            "System of incentives.",
            "We're also going to do some studies about and suggest what are what seem to be good.",
            "You know incentives for being members to get involved and be active so that they can boost the existing babies.",
            "Replication we value replication in lot in this in this work package.",
            "We think that if we develop a specific tools, specific approaches for a specific VBS that is not going to make vbe, you know diploid EU wide.",
            "The only way you can do that is that their tools and their approaches that you develop is replicable.",
            "So since we value that, we identify a set of things that we can do.",
            "Methodology is for opportunity discovery and creation.",
            "Defining acreditacion strategy competence, ontology extraction and evolution value systems, regulations and guidelines generation dynamic trust management based and identified criteria based on identified criteria and business model development only.",
            "Some of these were going to address, especially the one on discovery the OR was it methodology for opportunity discovery and creation.",
            "It is something that video creation subprojects is adressing.",
            "Competence ontology extraction and evolution.",
            "We're going to do value system regulation.",
            "Some what we're not 100% able to do do a complete job in on that and dynamic trust management is also something that we want to do.",
            "OK, so this is for replication."
        ],
        [
            "Now I'm going to tell you a little bit about the terminology.",
            "May I borrow this from you?",
            "OK, I gave a copy of these through all of you.",
            "It's an extract out of one of our deliverables.",
            "The deliverable is actually on Vbe common ontology.",
            "So I gave you the number.",
            "It's D. 23.1 AM I right now?",
            "21.3 it says it there right 21.3 exactly, so this deliverable actually describes the common Ontology common to any vbe right?",
            "And in order to do that, we have actually divided the ontology for VBS into 4 levels.",
            "We have the top level.",
            "We have the core level and then we have domain and application level and this is the core level.",
            "Top level is very.",
            "Small because top level is something which is common to all.",
            "See knows.",
            "Then when it comes to vbe the core level is about VB.",
            "What I did from that deliverable for you is to actually extract it.",
            "Base reference.",
            "Let's say point which is a list of concepts is like a Glossary that tells you what is it that is described in this deliverable.",
            "Then if you go further.",
            "You see that actually there are a list of definitions, right?",
            "This is from an annex in that deliverable and further injured in that deliverable, which is not.",
            "Here is the ontology definition in protege, so you can see everything about any concept which we think is common to all these.",
            "Let me point to one example.",
            "For example, we talk about bag of assets, which is 1.7.",
            "Somebody outside or inside of you wants to know what is a bag of asset.",
            "Bag of us.",
            "It has all of these elements in it.",
            "For example documents, sample contract, documented of interests, lessons learned, software tool links to freeware commercial software, links to other sources will be common, ontology ETC for every one of those, the ones that are trivial.",
            "We have not defined it, but the ones that are not trivial.",
            "For example, if you go to bag of assets, which is a 1 seven on page 5, four bag of acid lessons learned is described.",
            "The others are not.",
            "And what is a bag of assets?",
            "He says bag of assets provides a number of elements that are interesting and useful for VBA members such as the general shareable information provided in some documents, software tools, lessons learned, etc.",
            "OK, so this is a description that can be read and understood by the stakeholders of the VB.",
            "Then there is an ontology defined for it.",
            "Also to show you how we decided on all of this ontology.",
            "How did we do our homework?",
            "The way we did it was first identified the main entities.",
            "In this environment, the main entities in VB environment, as you see here or the Vbe vbe participant anveo.",
            "These are the main entities.",
            "Their profile and history are two very important concepts that define all of these three entities.",
            "Evidence is extremely important because it shows if the material in the profile.",
            "If the data provided by an organization is valid or not.",
            "So evidence shows if it is valid, it's a proof of validation.",
            "Is a proof of correctness.",
            "Then we have also some other concepts that are general only for vbe, including bag of assets management system, VB governance, Value System, trust system, etc."
        ],
        [
            "OK, this is a part of the ontology is the UML that shows it, and this is the protege definition that shows the ontology.",
            "In case you want to know any."
        ],
        [
            "Term that you're using MBB?",
            "Please refer to this deliverable and if it's not there, please inform me so that we can add it there.",
            "That's the that's the point about.",
            "The VMS will be management system considers the functionality which are related to any stage of the vbe lifecycle.",
            "So what you see up there is actually different stages of the baby life cycle.",
            "We have the creation phase with initiation an foundation.",
            "We have the operation phase in pink.",
            "Then green down there is operation, is it?",
            "Yeah no.",
            "It's the operation and this solution which sends feedback.",
            "So get feedback from the Vbe operation stage and gives feedback back.",
            "Gives gives feedback back to the VBS stage for the performance of the VO and inheritance of the video to be restored.",
            "Then we have metamorphoses and this solution, now here these three diagrams show you exactly the functionality that we have identified 4.",
            "Every one of these main stages creation, operation and metamorphoses and this solution for creation we have identified these functions as you see for initiation and foundation for operation.",
            "We have identified these main functions for Meta Morphosis and this solution we have identified these functions.",
            "What did we do with them after we identify all of these, we sat around the table and decided which ones are from our study of the requirements from the VBS and.",
            "Literature also."
        ],
        [
            "Which ones are needed?",
            "And try to infect form a set of functions that can be even developed and prototyped as tools or subsystems.",
            "We have identified for as you see 4 main tools or systems that can be developed, a structure and membership management.",
            "SMS is one that focuses on member registration, member rewarding and registration of created videos.",
            "The second one is IMS, supporting information management system.",
            "So this one is a set of information management systems that you know covers different aspects or different information.",
            "They manipulated within the VB including bag of assets, support institution Information Value System guidelines, an incentive information, members rolled rights and responsibilities, profiles, competency and validation information, trust criteria and members trust information, video inheritance information.",
            "Historical performance information.",
            "These are the information management systems that we are planning to do.",
            "We have another box profiling and trust management system.",
            "PMS PMS has two components in a 2 main components.",
            "One is PCMS which is for members profile competency management and the other one is for trust appraisal and management system TRMS.",
            "Then we have ontology adaptation and evolution and this is necessary because when we apply first of all I only talked about the core level right, which is common to all these.",
            "When you go to domain level like to in the domain of manufacturing.",
            "Or in the domain of tourism you have a specific ontology that describes the vbe elements for those domains.",
            "Then you go to one specific application like manufacturing of machinery.",
            "For construction or manufacturing of electronic, you know components, so every one of those that application has its own ontology.",
            "So if we want to have a vbe which is replicable, we cannot actually pick one of these ontologies for one specific domain or application and then be happy with it.",
            "We have to stay with the core level, but we have to develop functionality that can adjust itself.",
            "On time, in real time to the application and domain that it's applied and for that we are developing some functionality.",
            "So ontology adaptation and evolution is a very important component which you know there is adding value to the competency management system that we have there.",
            "If four functionality is actually management decision support, this is management of vbe, right?",
            "We be management decision support and there are three elements.",
            "There will be competency gap identification.",
            "Members low trustworthiness warning and lack of performance identification.",
            "This is what we're planning to develop what you see next to every box.",
            "Is this stakeholder who uses it?",
            "80s for administrator?",
            "All is everybody everybody down here we be member we be support institution.",
            "VIO initiator VB administrator knew member membership applicant or new member applicants and customer.",
            "So all of them need all of these information management system.",
            "Some of them need some of them, so to be exact deliverable on VB management system gives you exactly for every one of these functionality.",
            "Who's there stakeholder and which stage of the VB lifecycle this belongs to.",
            "OK then we have management decision Support system which only administrator uses an profiling and trust management that is used by administrator and the VO initiator video initiator needs to.",
            "Use the members profiling and competency management to find out which organizations in the VB match properly.",
            "The characteristics of the Collaborator Opportunity Collaborative opportunity that is raised, and then when you have several options, the trust management system helps the initiator to actually value, evaluate and appraise among these three partners that are more or less OK.",
            "Which one he can trust better based on their past performance.",
            "So this is the place very major role."
        ],
        [
            "This is a, let's say high level architecture, very high level relating all these components to each other.",
            "The brain components are the four components that I showed you.",
            "The purple ovals show the main stakeholders and these are some information that is passed between them for these functions to work well.",
            "Please notice that your creation is here as a part of the you know this architecture using and providing also information to the other components."
        ],
        [
            "Now I'd focus on video creation.",
            "Similarly, we have identified 4 main functionality compound functionality that we can develop for video creation, Co, collaborative opportunity identification or collaboration.",
            "Opportunity identification is one that focuses on search and filter calls for tenders.",
            "Normalized representation an notify vivio broker.",
            "Second functionality is see all characterization anveo rough planning, including required competencies required, collaboration modalities, and a bunch of sub items there.",
            "And model plan of activities.",
            "The third functionality is partner search and suggestion.",
            "We do not say selection because we do not believe in equal eat that an automatic automated system can select the partners.",
            "It will never happen in reality.",
            "We only suggest partners.",
            "So we can make several suggestions.",
            "Actually, like 3 suggestions, these three suggestions seem fit, and then somebody who's a decision maker, a human you know, will decide which one to choose.",
            "So partner Sessions suggestion, including lists of potential videos, human based final decision is required.",
            "Negotiation Resort is a very challenging and ambitious component that we are really struggling with and finding out that in fact there isn't much done in this area.",
            "In the in the literature and research, which is good and bad both and what are going to be adressed, there is contract templates, virtual negotiation room negotiation objects, an SSW approach, their stakeholder in every one of these functions are also addressed next to it."
        ],
        [
            "OK, the general architecture for video creation.",
            "Notice that your creation depends on DB management system but but by itself these for functionality you know have interactions with each other and the users or their stake holders are also represented in the ovals.",
            "The on member via planner and Opportunity bro."
        ],
        [
            "OK, how much have you achieved so far?",
            "All the bubbles that you see here from beginning to end is the planned and promise of work package to in this project.",
            "We have promised to do all of this.",
            "The green shows 100% achieved.",
            "The red shows zero percent achieved and the yellow is in between and therefore the three lines that you see here actually show the four years of the project.",
            "So we have completed everything that we were supposed to in year one and year two in year two.",
            "There are only a little bit left and contract negotiation process because it was difficult.",
            "And as I explained to you, VB management functionality specification becausw European Commission actually forced us to.",
            "Push it ahead ahead of their schedule so it's not actually our fault, but actually it's pushed by them.",
            "We be referenced, model happening, but it is difficult.",
            "Louise showed you the seeno reference model and the work that we're doing in work Package 5 and the model that we want to develop doing all of that for Vbe takes a little more time to mature and understand all the elements so that you can really describe inside and outside in relation to the life life cycle stages.",
            "We're in year three.",
            "We want 26 here, so some of these activities have started already.",
            "The ones that are red have not been touched yet.",
            "Notice that I have a line validation by external experts.",
            "An SMB networks.",
            "We have it up to here middle of the year.",
            "3 middle of the year three we will have our first set of prototypes for functions I mentioned to you.",
            "Two of them will have a prototype.",
            "At least at this stage.",
            "So we will start validation by trials and then the second to have.",
            "I think that the deadline here to be developed.",
            "So we have this these months for validation of these four on the MSN, 4 on video being tried and then the last nine months of the project will be validation by pilot Demonstrator."
        ],
        [
            "This slide shows you exactly this plan that we have so far.",
            "So for VMS, not for your creation, this is only for VMS, just to give you an idea, the prototype development starts in March 24, which means we're two months into it and continues exactly until month 39.",
            "What we do is that we have two sets of prototypes.",
            "It's called first C service prototype that score, so we have two of those four functions being core service and tubing advanced services.",
            "So first release will be at 1:30, so the trial of C service prototype.",
            "Which is this one will start at 1:30, then the second version, the second release of the core service will come out three months later, ET cetera.",
            "And here the trial of the core services are finished.",
            "The first advanced service prototypes will appear at 1:36.",
            "Then we have only three months to actually do the trial for the advanced services.",
            "But my assumption when I was thinking about this plan was that.",
            "When we have this me networks starting 124 that they actually know as much as we do, so try all of these second set of prototypes, take shorter time, right?",
            "Because you know, imagine at the one year from now you are completely aware of what is being developed, functionality and usage and so this should take less time.",
            "Anyway, we have less time, that's it.",
            "Trials at development environment with the help and validation of the SMB networks, continues until 139.",
            "Here is exactly when we start to take up of subsystems at this me network sites.",
            "So in my opinion and my past experience.",
            "The biggest challenge here is relating the functionality that is developed in work package to both for VMS and video creation to the legacy systems that exist in your environment.",
            "So instead of doing all of that here we can even started a bit earlier if you think about how to relate the functionality that we are developing here to your system so that the actual knew feature can be tested in your environment earlier than this trial in nine months.",
            "I hope that.",
            "Is doable.",
            "OK, I think that's it.",
            "This is these.",
            "Are they ready for what we can do?",
            "And I would like to stop at this stage.",
            "Thank you.",
            "Any questions?",
            "No questions."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I will talk about virtual organization breeding environments that we call for short VBS, actually.",
                    "label": 0
                },
                {
                    "sent": "Calling it virtual reading environment perhaps is not as let's say proper as virtual organization reading environment because it's video breeding environment.",
                    "label": 0
                },
                {
                    "sent": "Virtual reading environment gives this impression to the audience that actually this is not a real reading environment, but a virtual one.",
                    "label": 0
                },
                {
                    "sent": "So VBS stands for which organization building environment or or VIO breeding environment?",
                    "label": 1
                },
                {
                    "sent": "What I'm going to talk about today is first bring it to your attention that actually.",
                    "label": 0
                },
                {
                    "sent": "Although the networks here all have established already Evie and are interested in VB operation stage in our work, we work back issue at the project we are focusing on all aspects of the VB lifecycle, so we start with the vbe creation.",
                    "label": 0
                },
                {
                    "sent": "We focus on that.",
                    "label": 0
                },
                {
                    "sent": "We do work of course on VB operation, that's understandable.",
                    "label": 0
                },
                {
                    "sent": "Then we also address EV evolution.",
                    "label": 0
                },
                {
                    "sent": "VB dissolution and VB metamorphoses.",
                    "label": 0
                },
                {
                    "sent": "So all of these stages or address not only the VB operation.",
                    "label": 0
                },
                {
                    "sent": "What I will do is first address the challenges for the bees and the barriers.",
                    "label": 0
                },
                {
                    "sent": "Why is it that the bees are not in fact diploid, as much as they should in the market and society?",
                    "label": 0
                },
                {
                    "sent": "After that I will talk about the activities that are planned inside the project for the V and what is our ambition.",
                    "label": 0
                },
                {
                    "sent": "I talk a little bit about that.",
                    "label": 0
                },
                {
                    "sent": "There if there is time, I hope I take you through the terminology that we have defined within the VB through the ontology and then I took some extracts out of one of our deliverables that describes a part of the ontology that we have developed for VB so that we talk the same language so that the terminology is not confused.",
                    "label": 0
                },
                {
                    "sent": "Then I quickly go over the functionality which is planned to be developed within the Vbe management system that we call VMS, and I give you an architecture for how these components relate to each other and at the end I'll come back to the subject of the OH creation, functionality and how the architecture of your creation and VB management system integrate with each other.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Which one of these pages?",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It works OK.",
                    "label": 0
                },
                {
                    "sent": "So what is the main motivation for VB in, you know, research?",
                    "label": 0
                },
                {
                    "sent": "For example, the main motivation is dynamic creation of videos, dynamic creation of videos from an open universe of organization involves many challenges.",
                    "label": 1
                },
                {
                    "sent": "So when an opportunity is strikes, there are many challenges to actually go from this open universe of organizations into a.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You establish the oh.",
                    "label": 0
                },
                {
                    "sent": "These are some of the important challenges there.",
                    "label": 0
                },
                {
                    "sent": "How to know about the existence and abilities of the potential partners that exist out there in the open universe?",
                    "label": 1
                },
                {
                    "sent": "Even if you know that how to dynamically configure and you go from organizations that are autonomous and heterogeneous and independent, how do you do that?",
                    "label": 0
                },
                {
                    "sent": "There are many steps involved in especially the second issue, dealing with incompatibility and heterogeneity of information sources, finding basic profile and competency information.",
                    "label": 1
                },
                {
                    "sent": "Dealing with semantic estrogen.",
                    "label": 0
                },
                {
                    "sent": "80s selecting the organizations that are proper.",
                    "label": 1
                },
                {
                    "sent": "Establishing common interoperability and integration platform building trusts.",
                    "label": 0
                },
                {
                    "sent": "Developing the common principles, defining roles, rights and sharing, etc.",
                    "label": 0
                },
                {
                    "sent": "So this is not an easy task to do, So what we.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Address in the Vbe is the idea that instead of going directly from open universe to the video creation we divided.",
                    "label": 0
                },
                {
                    "sent": "We do it in two steps.",
                    "label": 0
                },
                {
                    "sent": "We first talk about an Association or a long term alliance among some of the organizations from the Open universe that is called a controlled border universe.",
                    "label": 1
                },
                {
                    "sent": "Then from this control border universe, when we increase the preparedness and readiness of these organizations.",
                    "label": 0
                },
                {
                    "sent": "This Step 2 creating a video when an opportunity strikes is doable is something that we can do, and the goal of the vbe at inequality is to do fluid creation of views.",
                    "label": 0
                },
                {
                    "sent": "So we want to make sure that that is less costly, less time consuming an.",
                    "label": 0
                },
                {
                    "sent": "It's also something that you know is the efficient and effective for all the people involved.",
                    "label": 0
                },
                {
                    "sent": "Notice that this is the main motivation.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I will come back to it and tell you how much more we can do for the organizations, but the definition of the PDF, given a colleague then is an Association or alliance of organizations and their related supporting institutions.",
                    "label": 1
                },
                {
                    "sent": "That's very important that adhere to one agreement.",
                    "label": 0
                },
                {
                    "sent": "One cooperation agreement not collaboration.",
                    "label": 0
                },
                {
                    "sent": "Remember that we separated those two from each other.",
                    "label": 0
                },
                {
                    "sent": "Cooperation is much shallower than collaboration.",
                    "label": 0
                },
                {
                    "sent": "Collaboration is towards a goal.",
                    "label": 0
                },
                {
                    "sent": "You have to produce some products and there is a contract etc.",
                    "label": 0
                },
                {
                    "sent": "Cooperation is just working together in an environment, which is, you know, the sharing principles are defined and you can actually trust each other.",
                    "label": 1
                },
                {
                    "sent": "So the cooperation agreement is there adopting the common operating principles and infrastructures with the goal to increase the chance of preparedness and getting involved in virtual organizations.",
                    "label": 0
                },
                {
                    "sent": "So in if you if you actually look outside, you see that many.",
                    "label": 1
                },
                {
                    "sent": "Let's say manifestation of this phenomenon already exists.",
                    "label": 0
                },
                {
                    "sent": "We have industry districts, industry clusters, SMB networks, foundations, fundaciones.",
                    "label": 0
                },
                {
                    "sent": "Are there clubs even summer called Networks, etc.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "In order to have the full fledged EU wide VBS.",
                    "label": 0
                },
                {
                    "sent": "In practice, what we're doing towards it is developing a young, promising lion for it.",
                    "label": 0
                },
                {
                    "sent": "So the aim of equally is to Excel and reach innovation that is necessary for fluid creation of videos.",
                    "label": 1
                },
                {
                    "sent": "Defining related concepts, reference models and methodologies.",
                    "label": 1
                },
                {
                    "sent": "Develop mechanisms, prototypes and proof of concepts and of course.",
                    "label": 0
                },
                {
                    "sent": "What needs to be achieved later to make this young lion a real full fledge lion is national and international laws heavy public sponsorship.",
                    "label": 0
                },
                {
                    "sent": "Productization of equality RND results global trust and acceptance by the Society and market etc.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, now I'm going to tell you a little bit about what we have done and what we plan to do OK?",
                    "label": 0
                },
                {
                    "sent": "This is the plan up there that you see for the four years of VB.",
                    "label": 0
                },
                {
                    "sent": "There are three main sub projects.",
                    "label": 0
                },
                {
                    "sent": "The first subproject, which is we being models and mechanisms, which was a general understanding and developing the basic concepts for VBS is already finished.",
                    "label": 0
                },
                {
                    "sent": "We have achieved that and if you check over here you see that there are deliverables 220 N. Sorry that delivers are not even here there are deliverables that we have there like 21.1 that the base concepts and.",
                    "label": 0
                },
                {
                    "sent": "Basic principles for sharing and working together or define there.",
                    "label": 0
                },
                {
                    "sent": "The second subproject video creation framework has asserted in Month 6 and it's still ongoing and these are the recent deliverables 23.1 you're planning and launching at Mount 15 had the first draft and then we have another 1A specification of your creation support tools at 124.",
                    "label": 1
                },
                {
                    "sent": "These two deliverables you can check if you want to know this state of video creation framework within the VB.",
                    "label": 0
                },
                {
                    "sent": "The third subproject is started among 12 and it's going to continue until the amount 48.",
                    "label": 1
                },
                {
                    "sent": "This sub project is focused on VB in management system.",
                    "label": 0
                },
                {
                    "sent": "We believe that if we be in order to be effective, requires a management system, a system and an administration that cares for what's happening in the VB and promoted and corrected an assisted.",
                    "label": 0
                },
                {
                    "sent": "So we have actually generated so far many deliverables that you can check back a specification of profile and competency management is one that I recommend for those of you who are interested in knowing what we can do about competency management.",
                    "label": 1
                },
                {
                    "sent": "We had one experimental prototype which was very minor in comparison to the what we developed or what we specified in the other deliverable, but you can check into that.",
                    "label": 0
                },
                {
                    "sent": "It used the agent technology actually for prototyping.",
                    "label": 0
                },
                {
                    "sent": "We have this.",
                    "label": 0
                },
                {
                    "sent": "This is wrong.",
                    "label": 0
                },
                {
                    "sent": "We be common ontology which I have given you an extract.",
                    "label": 0
                },
                {
                    "sent": "I'm going to come back to it that describes all of the terminology that is needed in this area to share the understanding.",
                    "label": 0
                },
                {
                    "sent": "Of VB and VB elements and concepts for all the people involved inside the VB outside the vbe between the VBS.",
                    "label": 1
                },
                {
                    "sent": "So we tried to do a real ontology with all the detailed descriptions so that we develop we provide some better clarified views of what we're talking about.",
                    "label": 0
                },
                {
                    "sent": "We have the characterization of the value system and matrix.",
                    "label": 1
                },
                {
                    "sent": "This is, of course there's many much more to do about it, but if you want to know what we're doing about value system, this is the deliverable creating and supporting trust culture in VBS.",
                    "label": 0
                },
                {
                    "sent": "This is one of our ambitions, and I can tell you a little bit about it if you want in during the break.",
                    "label": 1
                },
                {
                    "sent": "But this is actually one deliverable that I recommend for those of you who are interested in knowing what we're doing and trust which is objective.",
                    "label": 0
                },
                {
                    "sent": "And not subjective, trust and trust among organizations not not trust among people.",
                    "label": 0
                },
                {
                    "sent": "If you want to know what we're doing and what we're suggesting our approach, please refer to this deliverable.",
                    "label": 0
                },
                {
                    "sent": "We be management system this we have started.",
                    "label": 0
                },
                {
                    "sent": "This is going to continue all the way to the end and many of you at least three networks will be very heavily involved.",
                    "label": 0
                },
                {
                    "sent": "So this is the plan.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of activities.",
                    "label": 0
                },
                {
                    "sent": "How did we decide on doing what we're doing?",
                    "label": 0
                },
                {
                    "sent": "This is just to show you that we have done our homework.",
                    "label": 0
                },
                {
                    "sent": "We looked into what exists in the literature and in practice we have a number of networks that are studied.",
                    "label": 0
                },
                {
                    "sent": "We have generated many questionnaires that were taken by networks, not only in Europe but outside Europe as well.",
                    "label": 0
                },
                {
                    "sent": "We have considered all of those, but and confirm summary report is that everybody agrees that alliances and networks are doing alright.",
                    "label": 0
                },
                {
                    "sent": "But they can do much better.",
                    "label": 0
                },
                {
                    "sent": "Everybody believes that and they need, you know, some assistance in different areas so.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That's how we identified which areas to focus on.",
                    "label": 0
                },
                {
                    "sent": "One other, let's say issue that I want to bring it to your attention is that in our carefully study we identified three main barriers to the vbe being fully diploid and in use the first main barrier is the current VB operational level challenges.",
                    "label": 0
                },
                {
                    "sent": "What are the challenges market problems?",
                    "label": 1
                },
                {
                    "sent": "They are not fully at economically successful governance principle lacking or very limited.",
                    "label": 1
                },
                {
                    "sent": "Updating competency is another vbe, an member.",
                    "label": 0
                },
                {
                    "sent": "Information how to cope.",
                    "label": 1
                },
                {
                    "sent": "Member Organization Trust and Performance Measurement.",
                    "label": 0
                },
                {
                    "sent": "How to do clear division of responsibilities, roles and their interactions.",
                    "label": 1
                },
                {
                    "sent": "Missing guidelines, procedures, return rules etc.",
                    "label": 0
                },
                {
                    "sent": "Create the image and name.",
                    "label": 0
                },
                {
                    "sent": "Not very successful.",
                    "label": 0
                },
                {
                    "sent": "Absence of personal contact.",
                    "label": 0
                },
                {
                    "sent": "Etc.",
                    "label": 0
                },
                {
                    "sent": "What you see on there.",
                    "label": 0
                },
                {
                    "sent": "Every one of these issues or actually our approach to it.",
                    "label": 0
                },
                {
                    "sent": "Our approach to assist it, we're not claiming that we have solved these problems, never, but they're claiming that with all these approaches with all these things that we can do, we can assist the problem an in the neck.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This slide that unfortunately doesn't show in the print out.",
                    "label": 0
                },
                {
                    "sent": "You can maybe make a mark next to it.",
                    "label": 0
                },
                {
                    "sent": "The red ones are the ones that we are doing.",
                    "label": 0
                },
                {
                    "sent": "We are adressing in in the work package too.",
                    "label": 0
                },
                {
                    "sent": "So all of the red ones are being addressed.",
                    "label": 0
                },
                {
                    "sent": "Whatever is Gray down here is our approach.",
                    "label": 0
                },
                {
                    "sent": "We talk about it.",
                    "label": 0
                },
                {
                    "sent": "We detailed it out in our specification deliverables, but we're not going to be able to do anything specific about it.",
                    "label": 0
                },
                {
                    "sent": "Maybe because it's outside the vbe, maybe because it's too difficult to do, maybe because it requires international efforts, legal for example, etc.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The second biggest barrier for why their deployment of VB is the attracting of new members and keeping them happy.",
                    "label": 1
                },
                {
                    "sent": "This is a barrier we are told in our studies.",
                    "label": 0
                },
                {
                    "sent": "What are the good examples of that?",
                    "label": 0
                },
                {
                    "sent": "We turn on time and cost investment, fear of not having enough return on investment, losing decision making power, a collaboration side effect.",
                    "label": 1
                },
                {
                    "sent": "They lose one once you collaborate with somebody you're not fully in control.",
                    "label": 1
                },
                {
                    "sent": "Fear of partner selection by virtual system.",
                    "label": 1
                },
                {
                    "sent": "This was a big fear actually.",
                    "label": 0
                },
                {
                    "sent": "Required high commitment level.",
                    "label": 0
                },
                {
                    "sent": "Some organizations want to be involved, but not too much.",
                    "label": 0
                },
                {
                    "sent": "Trust in IPR problems.",
                    "label": 0
                },
                {
                    "sent": "Another issue.",
                    "label": 0
                },
                {
                    "sent": "So what what you see in Gray again are what we have have suggested, and we have, you know, identified as some.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Allusions to assist these situations.",
                    "label": 0
                },
                {
                    "sent": "And here you see that we are doing most of them, except IPR.",
                    "label": 0
                },
                {
                    "sent": "Appear is difficult, so we have decided we're not going to touch it.",
                    "label": 0
                },
                {
                    "sent": "We just identified as a main problem and something that can help you know.",
                    "label": 0
                },
                {
                    "sent": "Resolving this problem that everybody identifies in the network.",
                    "label": 0
                },
                {
                    "sent": "But we're not going to do anything about it.",
                    "label": 0
                },
                {
                    "sent": "We can't, we don't have the manpower for it.",
                    "label": 0
                },
                {
                    "sent": "The third and last.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Main barriers to wider deployment of the B is currently the creationist age problems, so notice we have currently be operation level problems.",
                    "label": 1
                },
                {
                    "sent": "We have how to attract members and keep them happy and current DB creation stage problems.",
                    "label": 1
                },
                {
                    "sent": "So what are the problems there may be creation methodology and tools are lacking.",
                    "label": 1
                },
                {
                    "sent": "Benefits that founders expect when initiating evb is unclear.",
                    "label": 0
                },
                {
                    "sent": "Huge efforts and costs needed to be invested.",
                    "label": 0
                },
                {
                    "sent": "Heavy and unclear.",
                    "label": 0
                },
                {
                    "sent": "And legal issues.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what do we do about them?",
                    "label": 0
                },
                {
                    "sent": "We only take care of that.",
                    "label": 0
                },
                {
                    "sent": "We know what's needed to be done, but we cannot do it for the others, so these red parts show what we are planning to do is our ambition.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But we have even a bigger ambition, not only want to do what is good for everybody, so that the hose can be more or less formed in a fluid way.",
                    "label": 0
                },
                {
                    "sent": "We want to actually do something that makes the whole greater than the sum of its parts.",
                    "label": 1
                },
                {
                    "sent": "Which is these are the organizations.",
                    "label": 0
                },
                {
                    "sent": "We want to identify these things.",
                    "label": 0
                },
                {
                    "sent": "These things are what is needed to make this a bigger, more powerful, more effective element in the SoC and market than what a network does, which is only putting these things together.",
                    "label": 0
                },
                {
                    "sent": "And what are those features?",
                    "label": 1
                },
                {
                    "sent": "First of all, the classified them into three areas in power boost and replicate, and Secondly we have to identify what to do in under each one of these and then which one are the hot issues.",
                    "label": 0
                },
                {
                    "sent": "That is a term we use inequality actually introduced by TX T2.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Identify which one we're going to implement, so in power boost and replicate empower address already identified needs needs that are already there.",
                    "label": 0
                },
                {
                    "sent": "ICT based infrastructure, competence management, trust management, performance management, history inheritance.",
                    "label": 1
                },
                {
                    "sent": "I city based infrastructure.",
                    "label": 0
                },
                {
                    "sent": "We do not develop what they call.",
                    "label": 0
                },
                {
                    "sent": "It develops everything else.",
                    "label": 0
                },
                {
                    "sent": "We're going to do here in work package too.",
                    "label": 0
                },
                {
                    "sent": "For boosting, what have you identified?",
                    "label": 0
                },
                {
                    "sent": "These are extended support for GNU GNU discovered potentials, which are not.",
                    "label": 0
                },
                {
                    "sent": "We have not found it running in existing networks.",
                    "label": 1
                },
                {
                    "sent": "What are they proactive discovery of opportunities?",
                    "label": 1
                },
                {
                    "sent": "Creation of new opportunities.",
                    "label": 0
                },
                {
                    "sent": "Discovery of emerging knew competences that Vbe can hold, while individual partners do not have bag of assets.",
                    "label": 0
                },
                {
                    "sent": "I'll tell you a little bit about IT support institution facilitation accreditation from different external organizations.",
                    "label": 0
                },
                {
                    "sent": "System of incentives.",
                    "label": 0
                },
                {
                    "sent": "About these everything up to the accreditation which requires external organization is something that we're going to touch.",
                    "label": 0
                },
                {
                    "sent": "System of incentives.",
                    "label": 0
                },
                {
                    "sent": "We're also going to do some studies about and suggest what are what seem to be good.",
                    "label": 0
                },
                {
                    "sent": "You know incentives for being members to get involved and be active so that they can boost the existing babies.",
                    "label": 0
                },
                {
                    "sent": "Replication we value replication in lot in this in this work package.",
                    "label": 0
                },
                {
                    "sent": "We think that if we develop a specific tools, specific approaches for a specific VBS that is not going to make vbe, you know diploid EU wide.",
                    "label": 0
                },
                {
                    "sent": "The only way you can do that is that their tools and their approaches that you develop is replicable.",
                    "label": 0
                },
                {
                    "sent": "So since we value that, we identify a set of things that we can do.",
                    "label": 1
                },
                {
                    "sent": "Methodology is for opportunity discovery and creation.",
                    "label": 0
                },
                {
                    "sent": "Defining acreditacion strategy competence, ontology extraction and evolution value systems, regulations and guidelines generation dynamic trust management based and identified criteria based on identified criteria and business model development only.",
                    "label": 1
                },
                {
                    "sent": "Some of these were going to address, especially the one on discovery the OR was it methodology for opportunity discovery and creation.",
                    "label": 0
                },
                {
                    "sent": "It is something that video creation subprojects is adressing.",
                    "label": 0
                },
                {
                    "sent": "Competence ontology extraction and evolution.",
                    "label": 0
                },
                {
                    "sent": "We're going to do value system regulation.",
                    "label": 0
                },
                {
                    "sent": "Some what we're not 100% able to do do a complete job in on that and dynamic trust management is also something that we want to do.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is for replication.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now I'm going to tell you a little bit about the terminology.",
                    "label": 0
                },
                {
                    "sent": "May I borrow this from you?",
                    "label": 0
                },
                {
                    "sent": "OK, I gave a copy of these through all of you.",
                    "label": 0
                },
                {
                    "sent": "It's an extract out of one of our deliverables.",
                    "label": 0
                },
                {
                    "sent": "The deliverable is actually on Vbe common ontology.",
                    "label": 0
                },
                {
                    "sent": "So I gave you the number.",
                    "label": 0
                },
                {
                    "sent": "It's D. 23.1 AM I right now?",
                    "label": 0
                },
                {
                    "sent": "21.3 it says it there right 21.3 exactly, so this deliverable actually describes the common Ontology common to any vbe right?",
                    "label": 0
                },
                {
                    "sent": "And in order to do that, we have actually divided the ontology for VBS into 4 levels.",
                    "label": 0
                },
                {
                    "sent": "We have the top level.",
                    "label": 0
                },
                {
                    "sent": "We have the core level and then we have domain and application level and this is the core level.",
                    "label": 0
                },
                {
                    "sent": "Top level is very.",
                    "label": 0
                },
                {
                    "sent": "Small because top level is something which is common to all.",
                    "label": 0
                },
                {
                    "sent": "See knows.",
                    "label": 0
                },
                {
                    "sent": "Then when it comes to vbe the core level is about VB.",
                    "label": 0
                },
                {
                    "sent": "What I did from that deliverable for you is to actually extract it.",
                    "label": 0
                },
                {
                    "sent": "Base reference.",
                    "label": 0
                },
                {
                    "sent": "Let's say point which is a list of concepts is like a Glossary that tells you what is it that is described in this deliverable.",
                    "label": 0
                },
                {
                    "sent": "Then if you go further.",
                    "label": 0
                },
                {
                    "sent": "You see that actually there are a list of definitions, right?",
                    "label": 0
                },
                {
                    "sent": "This is from an annex in that deliverable and further injured in that deliverable, which is not.",
                    "label": 0
                },
                {
                    "sent": "Here is the ontology definition in protege, so you can see everything about any concept which we think is common to all these.",
                    "label": 0
                },
                {
                    "sent": "Let me point to one example.",
                    "label": 0
                },
                {
                    "sent": "For example, we talk about bag of assets, which is 1.7.",
                    "label": 0
                },
                {
                    "sent": "Somebody outside or inside of you wants to know what is a bag of asset.",
                    "label": 0
                },
                {
                    "sent": "Bag of us.",
                    "label": 0
                },
                {
                    "sent": "It has all of these elements in it.",
                    "label": 0
                },
                {
                    "sent": "For example documents, sample contract, documented of interests, lessons learned, software tool links to freeware commercial software, links to other sources will be common, ontology ETC for every one of those, the ones that are trivial.",
                    "label": 0
                },
                {
                    "sent": "We have not defined it, but the ones that are not trivial.",
                    "label": 0
                },
                {
                    "sent": "For example, if you go to bag of assets, which is a 1 seven on page 5, four bag of acid lessons learned is described.",
                    "label": 0
                },
                {
                    "sent": "The others are not.",
                    "label": 0
                },
                {
                    "sent": "And what is a bag of assets?",
                    "label": 1
                },
                {
                    "sent": "He says bag of assets provides a number of elements that are interesting and useful for VBA members such as the general shareable information provided in some documents, software tools, lessons learned, etc.",
                    "label": 1
                },
                {
                    "sent": "OK, so this is a description that can be read and understood by the stakeholders of the VB.",
                    "label": 0
                },
                {
                    "sent": "Then there is an ontology defined for it.",
                    "label": 0
                },
                {
                    "sent": "Also to show you how we decided on all of this ontology.",
                    "label": 0
                },
                {
                    "sent": "How did we do our homework?",
                    "label": 0
                },
                {
                    "sent": "The way we did it was first identified the main entities.",
                    "label": 0
                },
                {
                    "sent": "In this environment, the main entities in VB environment, as you see here or the Vbe vbe participant anveo.",
                    "label": 1
                },
                {
                    "sent": "These are the main entities.",
                    "label": 0
                },
                {
                    "sent": "Their profile and history are two very important concepts that define all of these three entities.",
                    "label": 0
                },
                {
                    "sent": "Evidence is extremely important because it shows if the material in the profile.",
                    "label": 0
                },
                {
                    "sent": "If the data provided by an organization is valid or not.",
                    "label": 0
                },
                {
                    "sent": "So evidence shows if it is valid, it's a proof of validation.",
                    "label": 0
                },
                {
                    "sent": "Is a proof of correctness.",
                    "label": 0
                },
                {
                    "sent": "Then we have also some other concepts that are general only for vbe, including bag of assets management system, VB governance, Value System, trust system, etc.",
                    "label": 1
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, this is a part of the ontology is the UML that shows it, and this is the protege definition that shows the ontology.",
                    "label": 0
                },
                {
                    "sent": "In case you want to know any.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Term that you're using MBB?",
                    "label": 0
                },
                {
                    "sent": "Please refer to this deliverable and if it's not there, please inform me so that we can add it there.",
                    "label": 0
                },
                {
                    "sent": "That's the that's the point about.",
                    "label": 0
                },
                {
                    "sent": "The VMS will be management system considers the functionality which are related to any stage of the vbe lifecycle.",
                    "label": 0
                },
                {
                    "sent": "So what you see up there is actually different stages of the baby life cycle.",
                    "label": 0
                },
                {
                    "sent": "We have the creation phase with initiation an foundation.",
                    "label": 0
                },
                {
                    "sent": "We have the operation phase in pink.",
                    "label": 0
                },
                {
                    "sent": "Then green down there is operation, is it?",
                    "label": 0
                },
                {
                    "sent": "Yeah no.",
                    "label": 0
                },
                {
                    "sent": "It's the operation and this solution which sends feedback.",
                    "label": 0
                },
                {
                    "sent": "So get feedback from the Vbe operation stage and gives feedback back.",
                    "label": 0
                },
                {
                    "sent": "Gives gives feedback back to the VBS stage for the performance of the VO and inheritance of the video to be restored.",
                    "label": 0
                },
                {
                    "sent": "Then we have metamorphoses and this solution, now here these three diagrams show you exactly the functionality that we have identified 4.",
                    "label": 0
                },
                {
                    "sent": "Every one of these main stages creation, operation and metamorphoses and this solution for creation we have identified these functions as you see for initiation and foundation for operation.",
                    "label": 0
                },
                {
                    "sent": "We have identified these main functions for Meta Morphosis and this solution we have identified these functions.",
                    "label": 0
                },
                {
                    "sent": "What did we do with them after we identify all of these, we sat around the table and decided which ones are from our study of the requirements from the VBS and.",
                    "label": 0
                },
                {
                    "sent": "Literature also.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Which ones are needed?",
                    "label": 0
                },
                {
                    "sent": "And try to infect form a set of functions that can be even developed and prototyped as tools or subsystems.",
                    "label": 0
                },
                {
                    "sent": "We have identified for as you see 4 main tools or systems that can be developed, a structure and membership management.",
                    "label": 0
                },
                {
                    "sent": "SMS is one that focuses on member registration, member rewarding and registration of created videos.",
                    "label": 1
                },
                {
                    "sent": "The second one is IMS, supporting information management system.",
                    "label": 0
                },
                {
                    "sent": "So this one is a set of information management systems that you know covers different aspects or different information.",
                    "label": 0
                },
                {
                    "sent": "They manipulated within the VB including bag of assets, support institution Information Value System guidelines, an incentive information, members rolled rights and responsibilities, profiles, competency and validation information, trust criteria and members trust information, video inheritance information.",
                    "label": 1
                },
                {
                    "sent": "Historical performance information.",
                    "label": 0
                },
                {
                    "sent": "These are the information management systems that we are planning to do.",
                    "label": 0
                },
                {
                    "sent": "We have another box profiling and trust management system.",
                    "label": 0
                },
                {
                    "sent": "PMS PMS has two components in a 2 main components.",
                    "label": 0
                },
                {
                    "sent": "One is PCMS which is for members profile competency management and the other one is for trust appraisal and management system TRMS.",
                    "label": 0
                },
                {
                    "sent": "Then we have ontology adaptation and evolution and this is necessary because when we apply first of all I only talked about the core level right, which is common to all these.",
                    "label": 0
                },
                {
                    "sent": "When you go to domain level like to in the domain of manufacturing.",
                    "label": 0
                },
                {
                    "sent": "Or in the domain of tourism you have a specific ontology that describes the vbe elements for those domains.",
                    "label": 0
                },
                {
                    "sent": "Then you go to one specific application like manufacturing of machinery.",
                    "label": 0
                },
                {
                    "sent": "For construction or manufacturing of electronic, you know components, so every one of those that application has its own ontology.",
                    "label": 0
                },
                {
                    "sent": "So if we want to have a vbe which is replicable, we cannot actually pick one of these ontologies for one specific domain or application and then be happy with it.",
                    "label": 0
                },
                {
                    "sent": "We have to stay with the core level, but we have to develop functionality that can adjust itself.",
                    "label": 0
                },
                {
                    "sent": "On time, in real time to the application and domain that it's applied and for that we are developing some functionality.",
                    "label": 0
                },
                {
                    "sent": "So ontology adaptation and evolution is a very important component which you know there is adding value to the competency management system that we have there.",
                    "label": 0
                },
                {
                    "sent": "If four functionality is actually management decision support, this is management of vbe, right?",
                    "label": 1
                },
                {
                    "sent": "We be management decision support and there are three elements.",
                    "label": 0
                },
                {
                    "sent": "There will be competency gap identification.",
                    "label": 1
                },
                {
                    "sent": "Members low trustworthiness warning and lack of performance identification.",
                    "label": 0
                },
                {
                    "sent": "This is what we're planning to develop what you see next to every box.",
                    "label": 0
                },
                {
                    "sent": "Is this stakeholder who uses it?",
                    "label": 0
                },
                {
                    "sent": "80s for administrator?",
                    "label": 0
                },
                {
                    "sent": "All is everybody everybody down here we be member we be support institution.",
                    "label": 0
                },
                {
                    "sent": "VIO initiator VB administrator knew member membership applicant or new member applicants and customer.",
                    "label": 0
                },
                {
                    "sent": "So all of them need all of these information management system.",
                    "label": 0
                },
                {
                    "sent": "Some of them need some of them, so to be exact deliverable on VB management system gives you exactly for every one of these functionality.",
                    "label": 0
                },
                {
                    "sent": "Who's there stakeholder and which stage of the VB lifecycle this belongs to.",
                    "label": 0
                },
                {
                    "sent": "OK then we have management decision Support system which only administrator uses an profiling and trust management that is used by administrator and the VO initiator video initiator needs to.",
                    "label": 0
                },
                {
                    "sent": "Use the members profiling and competency management to find out which organizations in the VB match properly.",
                    "label": 0
                },
                {
                    "sent": "The characteristics of the Collaborator Opportunity Collaborative opportunity that is raised, and then when you have several options, the trust management system helps the initiator to actually value, evaluate and appraise among these three partners that are more or less OK.",
                    "label": 0
                },
                {
                    "sent": "Which one he can trust better based on their past performance.",
                    "label": 0
                },
                {
                    "sent": "So this is the place very major role.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is a, let's say high level architecture, very high level relating all these components to each other.",
                    "label": 0
                },
                {
                    "sent": "The brain components are the four components that I showed you.",
                    "label": 0
                },
                {
                    "sent": "The purple ovals show the main stakeholders and these are some information that is passed between them for these functions to work well.",
                    "label": 0
                },
                {
                    "sent": "Please notice that your creation is here as a part of the you know this architecture using and providing also information to the other components.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now I'd focus on video creation.",
                    "label": 0
                },
                {
                    "sent": "Similarly, we have identified 4 main functionality compound functionality that we can develop for video creation, Co, collaborative opportunity identification or collaboration.",
                    "label": 0
                },
                {
                    "sent": "Opportunity identification is one that focuses on search and filter calls for tenders.",
                    "label": 1
                },
                {
                    "sent": "Normalized representation an notify vivio broker.",
                    "label": 1
                },
                {
                    "sent": "Second functionality is see all characterization anveo rough planning, including required competencies required, collaboration modalities, and a bunch of sub items there.",
                    "label": 0
                },
                {
                    "sent": "And model plan of activities.",
                    "label": 0
                },
                {
                    "sent": "The third functionality is partner search and suggestion.",
                    "label": 0
                },
                {
                    "sent": "We do not say selection because we do not believe in equal eat that an automatic automated system can select the partners.",
                    "label": 0
                },
                {
                    "sent": "It will never happen in reality.",
                    "label": 0
                },
                {
                    "sent": "We only suggest partners.",
                    "label": 1
                },
                {
                    "sent": "So we can make several suggestions.",
                    "label": 0
                },
                {
                    "sent": "Actually, like 3 suggestions, these three suggestions seem fit, and then somebody who's a decision maker, a human you know, will decide which one to choose.",
                    "label": 1
                },
                {
                    "sent": "So partner Sessions suggestion, including lists of potential videos, human based final decision is required.",
                    "label": 0
                },
                {
                    "sent": "Negotiation Resort is a very challenging and ambitious component that we are really struggling with and finding out that in fact there isn't much done in this area.",
                    "label": 0
                },
                {
                    "sent": "In the in the literature and research, which is good and bad both and what are going to be adressed, there is contract templates, virtual negotiation room negotiation objects, an SSW approach, their stakeholder in every one of these functions are also addressed next to it.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, the general architecture for video creation.",
                    "label": 0
                },
                {
                    "sent": "Notice that your creation depends on DB management system but but by itself these for functionality you know have interactions with each other and the users or their stake holders are also represented in the ovals.",
                    "label": 0
                },
                {
                    "sent": "The on member via planner and Opportunity bro.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, how much have you achieved so far?",
                    "label": 0
                },
                {
                    "sent": "All the bubbles that you see here from beginning to end is the planned and promise of work package to in this project.",
                    "label": 0
                },
                {
                    "sent": "We have promised to do all of this.",
                    "label": 0
                },
                {
                    "sent": "The green shows 100% achieved.",
                    "label": 0
                },
                {
                    "sent": "The red shows zero percent achieved and the yellow is in between and therefore the three lines that you see here actually show the four years of the project.",
                    "label": 0
                },
                {
                    "sent": "So we have completed everything that we were supposed to in year one and year two in year two.",
                    "label": 0
                },
                {
                    "sent": "There are only a little bit left and contract negotiation process because it was difficult.",
                    "label": 1
                },
                {
                    "sent": "And as I explained to you, VB management functionality specification becausw European Commission actually forced us to.",
                    "label": 0
                },
                {
                    "sent": "Push it ahead ahead of their schedule so it's not actually our fault, but actually it's pushed by them.",
                    "label": 0
                },
                {
                    "sent": "We be referenced, model happening, but it is difficult.",
                    "label": 1
                },
                {
                    "sent": "Louise showed you the seeno reference model and the work that we're doing in work Package 5 and the model that we want to develop doing all of that for Vbe takes a little more time to mature and understand all the elements so that you can really describe inside and outside in relation to the life life cycle stages.",
                    "label": 0
                },
                {
                    "sent": "We're in year three.",
                    "label": 0
                },
                {
                    "sent": "We want 26 here, so some of these activities have started already.",
                    "label": 0
                },
                {
                    "sent": "The ones that are red have not been touched yet.",
                    "label": 0
                },
                {
                    "sent": "Notice that I have a line validation by external experts.",
                    "label": 1
                },
                {
                    "sent": "An SMB networks.",
                    "label": 0
                },
                {
                    "sent": "We have it up to here middle of the year.",
                    "label": 0
                },
                {
                    "sent": "3 middle of the year three we will have our first set of prototypes for functions I mentioned to you.",
                    "label": 0
                },
                {
                    "sent": "Two of them will have a prototype.",
                    "label": 0
                },
                {
                    "sent": "At least at this stage.",
                    "label": 1
                },
                {
                    "sent": "So we will start validation by trials and then the second to have.",
                    "label": 0
                },
                {
                    "sent": "I think that the deadline here to be developed.",
                    "label": 0
                },
                {
                    "sent": "So we have this these months for validation of these four on the MSN, 4 on video being tried and then the last nine months of the project will be validation by pilot Demonstrator.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This slide shows you exactly this plan that we have so far.",
                    "label": 0
                },
                {
                    "sent": "So for VMS, not for your creation, this is only for VMS, just to give you an idea, the prototype development starts in March 24, which means we're two months into it and continues exactly until month 39.",
                    "label": 0
                },
                {
                    "sent": "What we do is that we have two sets of prototypes.",
                    "label": 0
                },
                {
                    "sent": "It's called first C service prototype that score, so we have two of those four functions being core service and tubing advanced services.",
                    "label": 0
                },
                {
                    "sent": "So first release will be at 1:30, so the trial of C service prototype.",
                    "label": 0
                },
                {
                    "sent": "Which is this one will start at 1:30, then the second version, the second release of the core service will come out three months later, ET cetera.",
                    "label": 0
                },
                {
                    "sent": "And here the trial of the core services are finished.",
                    "label": 0
                },
                {
                    "sent": "The first advanced service prototypes will appear at 1:36.",
                    "label": 0
                },
                {
                    "sent": "Then we have only three months to actually do the trial for the advanced services.",
                    "label": 0
                },
                {
                    "sent": "But my assumption when I was thinking about this plan was that.",
                    "label": 0
                },
                {
                    "sent": "When we have this me networks starting 124 that they actually know as much as we do, so try all of these second set of prototypes, take shorter time, right?",
                    "label": 0
                },
                {
                    "sent": "Because you know, imagine at the one year from now you are completely aware of what is being developed, functionality and usage and so this should take less time.",
                    "label": 0
                },
                {
                    "sent": "Anyway, we have less time, that's it.",
                    "label": 0
                },
                {
                    "sent": "Trials at development environment with the help and validation of the SMB networks, continues until 139.",
                    "label": 1
                },
                {
                    "sent": "Here is exactly when we start to take up of subsystems at this me network sites.",
                    "label": 0
                },
                {
                    "sent": "So in my opinion and my past experience.",
                    "label": 0
                },
                {
                    "sent": "The biggest challenge here is relating the functionality that is developed in work package to both for VMS and video creation to the legacy systems that exist in your environment.",
                    "label": 0
                },
                {
                    "sent": "So instead of doing all of that here we can even started a bit earlier if you think about how to relate the functionality that we are developing here to your system so that the actual knew feature can be tested in your environment earlier than this trial in nine months.",
                    "label": 0
                },
                {
                    "sent": "I hope that.",
                    "label": 0
                },
                {
                    "sent": "Is doable.",
                    "label": 0
                },
                {
                    "sent": "OK, I think that's it.",
                    "label": 0
                },
                {
                    "sent": "This is these.",
                    "label": 0
                },
                {
                    "sent": "Are they ready for what we can do?",
                    "label": 0
                },
                {
                    "sent": "And I would like to stop at this stage.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Any questions?",
                    "label": 0
                },
                {
                    "sent": "No questions.",
                    "label": 0
                }
            ]
        }
    }
}