{
    "id": "2hgf4dpg5ndvuq67xmpdhvp2fpjmnn5j",
    "title": "Introduction to HPC and PRACE",
    "info": {
        "author": [
            "Jožef Duhovnik, Faculty of Mechanical Engineering, University of Ljubljana"
        ],
        "published": "Jan. 6, 2014",
        "recorded": "September 2013",
        "category": [
            "Top->Computer Science",
            "Top->Computers->Software"
        ]
    },
    "url": "http://videolectures.net/prace2013_duhovnik_hpc_prace_introduction/",
    "segmentation": [
        [
            "Thank you very much for welcome.",
            "Words, and now I like present some few details which are very important that we finally recognize.",
            "What is the reason that this autumn school will done be here?",
            "And what is the support for real advantages inside the Europe movement that we make the progress not with the hand making system, but with the intelligence system that is the small difference in this case.",
            "I like show you that price means partnerships for advanced computing.",
            "In Europe means that Europe slowly thinking about the global work also in the important science fields which make the men in the world much more much more visible and much more.",
            "Healthy much more better.",
            "And in this case I like show you."
        ],
        [
            "Few details which are very important that you recognize what is praise of all these moving from 9697.",
            "First of all they start with 18 countries.",
            "Later on become all others member and the last two members Israel in Slovenia was put in the place community about three years ago.",
            "The reason that when you see there all those Members here, the list of the Members there is and is that the price do not like how officialy country members, but they like have the Members where are, where are in good condition and make some progress on this supercomputer systems that is very simple one.",
            "For that reason I like your present on the end.",
            "What is happened here on the faculty for Mechanical Engineering?",
            "So."
        ],
        [
            "So what is?",
            "Why is supercomputing today and before also recognized Professor Voltage are told some nice history display, small one on the Calculator, but definitely today.",
            "Maybe people do not recognize that.",
            "Definitely something changed for very small reason.",
            "The weather was changed and maybe you are on that level that you can recognize that the letter was changed at overflowing.",
            "Already expected on the many places around the world, and one of these cases also in the Europe and overflowing the Europe should be predicted what is happened at once.",
            "And finally, we should find a way and important things is that all capital inside Europe should be connected with the high speed train.",
            "High speed train means that when is something happened, sometimes around the world.",
            "That they all.",
            "President of the government should be transported not with the airplane for the reason that weather is so bad, but with simple train and train should be connected between the between the South and North Park with 160 kilometers per hours and the speed on the upper side and the lower side of the Europe should be about 300 kilometers per hour.",
            "That is the philosophy of the United Europe, and if we know that way.",
            "After then we should make some investigation what is happened in advance for the reason that we cannot make decision.",
            "Something will be happened after then.",
            "OK, it is happened.",
            "Now we should follow the strategy about us and the main important fixes for the whole humans around the world.",
            "It's let me say just weather, climatology and earth science.",
            "I have about 14 days one visitors from Iran.",
            "Iran was very bridge country.",
            "Also from the water and you know what is happened there.",
            "So simple they have no any water resources for small for hydro turbines power before they have enough water.",
            "Today they have no water so means that something is changed generally and that should be predicted astrophysics, elementary particle physics and especially plasma physics which is.",
            "Practically.",
            "1000 power bigger power potential.",
            "As you have old classic nuclear power, so means that we should try the best way that men in their nature can find solution.",
            "Also for the future material science, chemistry and nanoscience.",
            "It's also important for any kind of deeply knowledge about our nature.",
            "Life science is the same and we can predict it was it happened with some new pharmaceutical new biological.",
            "From medical mental that we know what will be done at once and normally on the end becomes poor engineering site which make today big progress for all those activities which we have in our solar."
        ],
        [
            "So it means that the supercomputing drive science with simulation, give and make open door for our new error and now his question, who understood supercomputing systems?",
            "Who knows about that that can use supercomputers, classical pieces?",
            "It's some differential structure and you cannot use it on the same manner like you have by the supercomputer.",
            "Supercomputers normally work on that particular.",
            "Particular computing parts so means that you should have different knowledge about that programs, which usually the supercomputer and now it's happened who really knows that and who have knowledge about it.",
            "This is something like let me say on the post post Masters level and that is the reason that all Europe try that such kind of the training of the supercomputers programming should be done on the.",
            "All all people which are interesting for this case so means completely different different programming system as you have on the PC computer.",
            "That is the important things and the main main question is now praise.",
            "Prepare all these autumn schools for the all population which believes an hope something more and which can understood their programming for supercomputer.",
            "And when from 40 people become, let me say 10 people which really can use supercomputers after them we are the winner.",
            "We hope engine you have job and the next generation have better life simple as well.",
            "So this is just some presentation about possibilities.",
            "Every somebody of us of your work on some diff."
        ],
        [
            "Brent Fields, and now he's question, what kind of the works on the supercomputer systems was really done.",
            "You can see here the main important things somebody from special from our country are may be surprised that normal industry in the normal country with normal economy used practically 5060%.",
            "Of the all supercomputers possibilities, that is the normal quality of the academic research site by us.",
            "We have questioned how many thousand euros the company spent money for research work, which is stupid things.",
            "How many 100 or 1 million euros can use you can spend for the research work.",
            "After then we are the winner before you can just follow up.",
            "Academic site 1 quart and also the research part 1/4 means institutes and academic and on University especially also means here for research works is practically half 40% and all others government vendors and also classified takes about 12%.",
            "That is the average around the world.",
            "Important things is also that you recognize that in the last in the last let me say.",
            "93 till 2011 in the last 15 years is dramatically change and that is important that I am very glad that many people become from industry, not just from Slovenia.",
            "Also brought.",
            "The reason is that let me say 94 you have about 10% or let me say 100 system and you have here about 300 systems which work in industry.",
            "That the research work is practically the same is not true that supercomputers used for the research much more like before is practically the same.",
            "Then the academic site is also the same.",
            "the University not grow up for the reason that you have not genetical potential everywhere around the world on this case, and also that all parts means that others vendors and classified go slowly down to the 5th.",
            "Seven 8% that is the minimum which you should use, but it's not important.",
            "Important things is the industry make big improvements and also by small companies you can use the philosophy of the supercomputer system, not just big supercomputers.",
            "The philosophy of our of yours architecture by the computers you can use much more, better and much more faster.",
            "Just for example if you go to the supercomputers.",
            "And if yours calculation was done in 2 hours instead of one week or two weeks, believe me that yours life was saved about 13 days.",
            "In the morning when you come, you have after three hours results.",
            "You cannot wait for one for two weeks, and that is important.",
            "So mean is not question that the company is too fast that your life is safe for the reason that you cannot stay an looking.",
            "What is happened in the computer and that is important for supercomputer systems.",
            "Nothing more.",
            "Just save your life for the reason you have enough and good knowledge for the."
        ],
        [
            "Super computer systems around the world.",
            "It's in many cases looking just boxes.",
            "Important things is what is the capacity?"
        ],
        [
            "And in nearly, he's the first prize systems.",
            "In 2010, when you have important data, 145 Tera bytes memory, around 300 CPU scores, and important things that this slowly go up and today it's this small one is starting point need just 2.2 megawatts energy for working.",
            "This is surely 35% for praise means for the free users.",
            "Another part steaks for the plasma and nuclear physics.",
            "Instead of that that Germany decided nuclear power station don't build more, so means that this take this will be taken maybe 40% or less or more than a."
        ],
        [
            "It's sorry the next is GNC, which is practically not just one block but also many many location in there France and was General Main.",
            "The main house was in Paris and important things that you see.",
            "The 2011 was built up with 1.6 petaflops.",
            "And the second, the first phase in December 2010 is start with 105 teraflops.",
            "With all these important data you can see this week.",
            "What is important for his texture of the supercomputers?",
            "The second phase Phase 1.5 just upgrade to nodes and finally the phase two becomes to the 1.5.",
            "Better flops this here is the mistake, sorry petaflops.",
            "Sorry."
        ],
        [
            "And you should get, as you know, in Germany is 3 big computers till the big supercomputer center one is in the in Julie, one instance target and another is in meaning and stood guard has starting.",
            "Also with 2010 is Phase zero.",
            "And you have seen very small capacity, then teraflops today.",
            "You have about the prediction for this year.",
            "It's four to five petaflops means about.",
            "Have to let me say 304 hundred 1400 times bigger supercomputers.",
            "The main architecture starting with the Cray."
        ],
        [
            "The next is learn it's record center in Munich in Germany, which start with IBM, which start also with small small 384 teraflops.",
            "And today they aspect as I know about 5.",
            "Bit of flops.",
            "Important things is that all systems was done and support with 13 megawatts and the main important things is that they reduce the all that they make higher speed for the calculation.",
            "They use their water cooling systems which is very simple one as you know that when you make this computer very small after then the problem is the hitting.",
            "And the best transport of the temperature is water, still what?",
            "And that is just something like.",
            "Free generator on the backside when you have all these pipeline directly through the Super to the micro chips to the course and they take the the the temperature back.",
            "This is some picture of the systems which is located in Garching."
        ],
        [
            "After then you go syneca in Bologna, which also used about 20 megawatts that you have some idea where is the energy?"
        ],
        [
            "And the finally I like show you few details about our supercomputer systems before we have about 2530 young researcher which work on this like a guest on other supercomputer system around the world."
        ],
        [
            "We finally find the way that we have because we we have some money from the government and we establish and we try the best architecture for the Super computer systems and preserve costs is definitely the father of this supercomputer for the reason that he make the architecture of this supercomputer systems which we finally recognize after half a year when we already start with this.",
            "Architecture side that practically the same architecture site in that time was the winner around the world and they make the Chinese people the same architecture like we have.",
            "Normally we have no so much."
        ],
        [
            "The course and capacity long-term walls.",
            "For us it's that we make free open door for our computing capabilities that we make connection with answers and open form cooperation instead of your project, and also that we start simple with one new generation which start supercomputer used in the second step.",
            "So means for the master degree that finally we have.",
            "People which really can thinking on for the programming of."
        ],
        [
            "Super computers software on the on our HPC it's defined here, you know, classical everything was done there, so with practically open you can use it also when you are finished with this seminars with these schools."
        ],
        [
            "Hardware BIOS it's.",
            "64 computer nodes 3 Terra byte Rams.",
            "Important things is the memory is about 24 terabytes capacity.",
            "So means and also we have good connection with harness, so means that you can make direct connection with those and this is some picture of this supercomputers room when you also will visit."
        ],
        [
            "I wish you.",
            "Definitely fulfillment of your expectation about this week and nice memories from University of Ljubljana.",
            "And in the future, which is very important, new ways for researchers and collaboration between all participants of this course?",
            "Lectures and trainers too, so means you should be come together and make the best work also for you, for your personal, professional life that you have after then after 10 years good experience on the real supercomputer walls Huawei for the reason that when you start here some small training.",
            "The open door will be slowly open for all this supercomputer centers around Europe for the reason the brace can make such kind of the supports.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you very much for welcome.",
                    "label": 0
                },
                {
                    "sent": "Words, and now I like present some few details which are very important that we finally recognize.",
                    "label": 0
                },
                {
                    "sent": "What is the reason that this autumn school will done be here?",
                    "label": 1
                },
                {
                    "sent": "And what is the support for real advantages inside the Europe movement that we make the progress not with the hand making system, but with the intelligence system that is the small difference in this case.",
                    "label": 0
                },
                {
                    "sent": "I like show you that price means partnerships for advanced computing.",
                    "label": 0
                },
                {
                    "sent": "In Europe means that Europe slowly thinking about the global work also in the important science fields which make the men in the world much more much more visible and much more.",
                    "label": 0
                },
                {
                    "sent": "Healthy much more better.",
                    "label": 0
                },
                {
                    "sent": "And in this case I like show you.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Few details which are very important that you recognize what is praise of all these moving from 9697.",
                    "label": 0
                },
                {
                    "sent": "First of all they start with 18 countries.",
                    "label": 0
                },
                {
                    "sent": "Later on become all others member and the last two members Israel in Slovenia was put in the place community about three years ago.",
                    "label": 0
                },
                {
                    "sent": "The reason that when you see there all those Members here, the list of the Members there is and is that the price do not like how officialy country members, but they like have the Members where are, where are in good condition and make some progress on this supercomputer systems that is very simple one.",
                    "label": 0
                },
                {
                    "sent": "For that reason I like your present on the end.",
                    "label": 0
                },
                {
                    "sent": "What is happened here on the faculty for Mechanical Engineering?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is?",
                    "label": 0
                },
                {
                    "sent": "Why is supercomputing today and before also recognized Professor Voltage are told some nice history display, small one on the Calculator, but definitely today.",
                    "label": 0
                },
                {
                    "sent": "Maybe people do not recognize that.",
                    "label": 0
                },
                {
                    "sent": "Definitely something changed for very small reason.",
                    "label": 0
                },
                {
                    "sent": "The weather was changed and maybe you are on that level that you can recognize that the letter was changed at overflowing.",
                    "label": 0
                },
                {
                    "sent": "Already expected on the many places around the world, and one of these cases also in the Europe and overflowing the Europe should be predicted what is happened at once.",
                    "label": 0
                },
                {
                    "sent": "And finally, we should find a way and important things is that all capital inside Europe should be connected with the high speed train.",
                    "label": 0
                },
                {
                    "sent": "High speed train means that when is something happened, sometimes around the world.",
                    "label": 0
                },
                {
                    "sent": "That they all.",
                    "label": 0
                },
                {
                    "sent": "President of the government should be transported not with the airplane for the reason that weather is so bad, but with simple train and train should be connected between the between the South and North Park with 160 kilometers per hours and the speed on the upper side and the lower side of the Europe should be about 300 kilometers per hour.",
                    "label": 0
                },
                {
                    "sent": "That is the philosophy of the United Europe, and if we know that way.",
                    "label": 0
                },
                {
                    "sent": "After then we should make some investigation what is happened in advance for the reason that we cannot make decision.",
                    "label": 0
                },
                {
                    "sent": "Something will be happened after then.",
                    "label": 0
                },
                {
                    "sent": "OK, it is happened.",
                    "label": 0
                },
                {
                    "sent": "Now we should follow the strategy about us and the main important fixes for the whole humans around the world.",
                    "label": 0
                },
                {
                    "sent": "It's let me say just weather, climatology and earth science.",
                    "label": 1
                },
                {
                    "sent": "I have about 14 days one visitors from Iran.",
                    "label": 0
                },
                {
                    "sent": "Iran was very bridge country.",
                    "label": 0
                },
                {
                    "sent": "Also from the water and you know what is happened there.",
                    "label": 0
                },
                {
                    "sent": "So simple they have no any water resources for small for hydro turbines power before they have enough water.",
                    "label": 0
                },
                {
                    "sent": "Today they have no water so means that something is changed generally and that should be predicted astrophysics, elementary particle physics and especially plasma physics which is.",
                    "label": 1
                },
                {
                    "sent": "Practically.",
                    "label": 0
                },
                {
                    "sent": "1000 power bigger power potential.",
                    "label": 0
                },
                {
                    "sent": "As you have old classic nuclear power, so means that we should try the best way that men in their nature can find solution.",
                    "label": 1
                },
                {
                    "sent": "Also for the future material science, chemistry and nanoscience.",
                    "label": 0
                },
                {
                    "sent": "It's also important for any kind of deeply knowledge about our nature.",
                    "label": 0
                },
                {
                    "sent": "Life science is the same and we can predict it was it happened with some new pharmaceutical new biological.",
                    "label": 0
                },
                {
                    "sent": "From medical mental that we know what will be done at once and normally on the end becomes poor engineering site which make today big progress for all those activities which we have in our solar.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So it means that the supercomputing drive science with simulation, give and make open door for our new error and now his question, who understood supercomputing systems?",
                    "label": 0
                },
                {
                    "sent": "Who knows about that that can use supercomputers, classical pieces?",
                    "label": 0
                },
                {
                    "sent": "It's some differential structure and you cannot use it on the same manner like you have by the supercomputer.",
                    "label": 0
                },
                {
                    "sent": "Supercomputers normally work on that particular.",
                    "label": 0
                },
                {
                    "sent": "Particular computing parts so means that you should have different knowledge about that programs, which usually the supercomputer and now it's happened who really knows that and who have knowledge about it.",
                    "label": 0
                },
                {
                    "sent": "This is something like let me say on the post post Masters level and that is the reason that all Europe try that such kind of the training of the supercomputers programming should be done on the.",
                    "label": 0
                },
                {
                    "sent": "All all people which are interesting for this case so means completely different different programming system as you have on the PC computer.",
                    "label": 0
                },
                {
                    "sent": "That is the important things and the main main question is now praise.",
                    "label": 0
                },
                {
                    "sent": "Prepare all these autumn schools for the all population which believes an hope something more and which can understood their programming for supercomputer.",
                    "label": 0
                },
                {
                    "sent": "And when from 40 people become, let me say 10 people which really can use supercomputers after them we are the winner.",
                    "label": 0
                },
                {
                    "sent": "We hope engine you have job and the next generation have better life simple as well.",
                    "label": 0
                },
                {
                    "sent": "So this is just some presentation about possibilities.",
                    "label": 0
                },
                {
                    "sent": "Every somebody of us of your work on some diff.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Brent Fields, and now he's question, what kind of the works on the supercomputer systems was really done.",
                    "label": 0
                },
                {
                    "sent": "You can see here the main important things somebody from special from our country are may be surprised that normal industry in the normal country with normal economy used practically 5060%.",
                    "label": 0
                },
                {
                    "sent": "Of the all supercomputers possibilities, that is the normal quality of the academic research site by us.",
                    "label": 0
                },
                {
                    "sent": "We have questioned how many thousand euros the company spent money for research work, which is stupid things.",
                    "label": 0
                },
                {
                    "sent": "How many 100 or 1 million euros can use you can spend for the research work.",
                    "label": 0
                },
                {
                    "sent": "After then we are the winner before you can just follow up.",
                    "label": 0
                },
                {
                    "sent": "Academic site 1 quart and also the research part 1/4 means institutes and academic and on University especially also means here for research works is practically half 40% and all others government vendors and also classified takes about 12%.",
                    "label": 0
                },
                {
                    "sent": "That is the average around the world.",
                    "label": 0
                },
                {
                    "sent": "Important things is also that you recognize that in the last in the last let me say.",
                    "label": 0
                },
                {
                    "sent": "93 till 2011 in the last 15 years is dramatically change and that is important that I am very glad that many people become from industry, not just from Slovenia.",
                    "label": 0
                },
                {
                    "sent": "Also brought.",
                    "label": 0
                },
                {
                    "sent": "The reason is that let me say 94 you have about 10% or let me say 100 system and you have here about 300 systems which work in industry.",
                    "label": 0
                },
                {
                    "sent": "That the research work is practically the same is not true that supercomputers used for the research much more like before is practically the same.",
                    "label": 0
                },
                {
                    "sent": "Then the academic site is also the same.",
                    "label": 0
                },
                {
                    "sent": "the University not grow up for the reason that you have not genetical potential everywhere around the world on this case, and also that all parts means that others vendors and classified go slowly down to the 5th.",
                    "label": 0
                },
                {
                    "sent": "Seven 8% that is the minimum which you should use, but it's not important.",
                    "label": 0
                },
                {
                    "sent": "Important things is the industry make big improvements and also by small companies you can use the philosophy of the supercomputer system, not just big supercomputers.",
                    "label": 0
                },
                {
                    "sent": "The philosophy of our of yours architecture by the computers you can use much more, better and much more faster.",
                    "label": 0
                },
                {
                    "sent": "Just for example if you go to the supercomputers.",
                    "label": 0
                },
                {
                    "sent": "And if yours calculation was done in 2 hours instead of one week or two weeks, believe me that yours life was saved about 13 days.",
                    "label": 0
                },
                {
                    "sent": "In the morning when you come, you have after three hours results.",
                    "label": 0
                },
                {
                    "sent": "You cannot wait for one for two weeks, and that is important.",
                    "label": 0
                },
                {
                    "sent": "So mean is not question that the company is too fast that your life is safe for the reason that you cannot stay an looking.",
                    "label": 0
                },
                {
                    "sent": "What is happened in the computer and that is important for supercomputer systems.",
                    "label": 0
                },
                {
                    "sent": "Nothing more.",
                    "label": 0
                },
                {
                    "sent": "Just save your life for the reason you have enough and good knowledge for the.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Super computer systems around the world.",
                    "label": 1
                },
                {
                    "sent": "It's in many cases looking just boxes.",
                    "label": 0
                },
                {
                    "sent": "Important things is what is the capacity?",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in nearly, he's the first prize systems.",
                    "label": 0
                },
                {
                    "sent": "In 2010, when you have important data, 145 Tera bytes memory, around 300 CPU scores, and important things that this slowly go up and today it's this small one is starting point need just 2.2 megawatts energy for working.",
                    "label": 0
                },
                {
                    "sent": "This is surely 35% for praise means for the free users.",
                    "label": 0
                },
                {
                    "sent": "Another part steaks for the plasma and nuclear physics.",
                    "label": 0
                },
                {
                    "sent": "Instead of that that Germany decided nuclear power station don't build more, so means that this take this will be taken maybe 40% or less or more than a.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's sorry the next is GNC, which is practically not just one block but also many many location in there France and was General Main.",
                    "label": 0
                },
                {
                    "sent": "The main house was in Paris and important things that you see.",
                    "label": 0
                },
                {
                    "sent": "The 2011 was built up with 1.6 petaflops.",
                    "label": 0
                },
                {
                    "sent": "And the second, the first phase in December 2010 is start with 105 teraflops.",
                    "label": 0
                },
                {
                    "sent": "With all these important data you can see this week.",
                    "label": 0
                },
                {
                    "sent": "What is important for his texture of the supercomputers?",
                    "label": 0
                },
                {
                    "sent": "The second phase Phase 1.5 just upgrade to nodes and finally the phase two becomes to the 1.5.",
                    "label": 0
                },
                {
                    "sent": "Better flops this here is the mistake, sorry petaflops.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you should get, as you know, in Germany is 3 big computers till the big supercomputer center one is in the in Julie, one instance target and another is in meaning and stood guard has starting.",
                    "label": 0
                },
                {
                    "sent": "Also with 2010 is Phase zero.",
                    "label": 0
                },
                {
                    "sent": "And you have seen very small capacity, then teraflops today.",
                    "label": 0
                },
                {
                    "sent": "You have about the prediction for this year.",
                    "label": 0
                },
                {
                    "sent": "It's four to five petaflops means about.",
                    "label": 0
                },
                {
                    "sent": "Have to let me say 304 hundred 1400 times bigger supercomputers.",
                    "label": 0
                },
                {
                    "sent": "The main architecture starting with the Cray.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The next is learn it's record center in Munich in Germany, which start with IBM, which start also with small small 384 teraflops.",
                    "label": 0
                },
                {
                    "sent": "And today they aspect as I know about 5.",
                    "label": 0
                },
                {
                    "sent": "Bit of flops.",
                    "label": 0
                },
                {
                    "sent": "Important things is that all systems was done and support with 13 megawatts and the main important things is that they reduce the all that they make higher speed for the calculation.",
                    "label": 0
                },
                {
                    "sent": "They use their water cooling systems which is very simple one as you know that when you make this computer very small after then the problem is the hitting.",
                    "label": 0
                },
                {
                    "sent": "And the best transport of the temperature is water, still what?",
                    "label": 0
                },
                {
                    "sent": "And that is just something like.",
                    "label": 0
                },
                {
                    "sent": "Free generator on the backside when you have all these pipeline directly through the Super to the micro chips to the course and they take the the the temperature back.",
                    "label": 0
                },
                {
                    "sent": "This is some picture of the systems which is located in Garching.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "After then you go syneca in Bologna, which also used about 20 megawatts that you have some idea where is the energy?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the finally I like show you few details about our supercomputer systems before we have about 2530 young researcher which work on this like a guest on other supercomputer system around the world.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We finally find the way that we have because we we have some money from the government and we establish and we try the best architecture for the Super computer systems and preserve costs is definitely the father of this supercomputer for the reason that he make the architecture of this supercomputer systems which we finally recognize after half a year when we already start with this.",
                    "label": 0
                },
                {
                    "sent": "Architecture side that practically the same architecture site in that time was the winner around the world and they make the Chinese people the same architecture like we have.",
                    "label": 0
                },
                {
                    "sent": "Normally we have no so much.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The course and capacity long-term walls.",
                    "label": 0
                },
                {
                    "sent": "For us it's that we make free open door for our computing capabilities that we make connection with answers and open form cooperation instead of your project, and also that we start simple with one new generation which start supercomputer used in the second step.",
                    "label": 0
                },
                {
                    "sent": "So means for the master degree that finally we have.",
                    "label": 0
                },
                {
                    "sent": "People which really can thinking on for the programming of.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Super computers software on the on our HPC it's defined here, you know, classical everything was done there, so with practically open you can use it also when you are finished with this seminars with these schools.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hardware BIOS it's.",
                    "label": 0
                },
                {
                    "sent": "64 computer nodes 3 Terra byte Rams.",
                    "label": 0
                },
                {
                    "sent": "Important things is the memory is about 24 terabytes capacity.",
                    "label": 0
                },
                {
                    "sent": "So means and also we have good connection with harness, so means that you can make direct connection with those and this is some picture of this supercomputers room when you also will visit.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I wish you.",
                    "label": 0
                },
                {
                    "sent": "Definitely fulfillment of your expectation about this week and nice memories from University of Ljubljana.",
                    "label": 1
                },
                {
                    "sent": "And in the future, which is very important, new ways for researchers and collaboration between all participants of this course?",
                    "label": 0
                },
                {
                    "sent": "Lectures and trainers too, so means you should be come together and make the best work also for you, for your personal, professional life that you have after then after 10 years good experience on the real supercomputer walls Huawei for the reason that when you start here some small training.",
                    "label": 0
                },
                {
                    "sent": "The open door will be slowly open for all this supercomputer centers around Europe for the reason the brace can make such kind of the supports.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}