{
    "id": "2hl6wa7donp2nlaizth4gti3otm4heqh",
    "title": "Technology and Combinatorial Evolution",
    "info": {
        "author": [
            "W. Brian Arthur, Santa Fe Institute"
        ],
        "published": "April 3, 2017",
        "recorded": "March 2017",
        "category": [
            "Top->Science->Complexity Science",
            "Top->Computer Science",
            "Top->Data Science",
            "Top->Mathematics",
            "Top->Physics"
        ]
    },
    "url": "http://videolectures.net/NTUcomplexity2017_arthur_technology_and_evolution/",
    "segmentation": [
        [
            "Well, thank you very much and I'm delighted to be here.",
            "Every so often I get objections on the Internet.",
            "You know why?",
            "Is an economist interested in technology?",
            "Or why is anyone interested in technology and?",
            "I was trained as an engineer and props like many of you in a British University where it's four years of solid engineering from start finish and nothing else.",
            "And I got interested in.",
            "I did very well indeed in that course, but.",
            "I. I never really felt I understood technology, and I suppose later in life then I came back trying to solve that question.",
            "Also, I should say.",
            "For those of you who are not sure why you're here, technology is interesting.",
            "Just give you the following thought experiment and you might try this if you took away all the technologies that have been invented since.",
            "Say 1400 since the Middle Ages.",
            "You can take away all the scientific ideas since 1600 or 1400 and.",
            "Life would be impoverished, but it would go on if you took away all the technologies we have no cars.",
            "We have no modern lighting.",
            "We have no modern buildings.",
            "We would have no flush toilets.",
            "We'd be cooking, maybe on primitive stoves.",
            "We might be wearing cloaks.",
            "If you're European of your Chinese, something else, life would be entirely different.",
            "No technology, no modern science, no modern economy.",
            "And essentially, no modern life.",
            "So technology here is fundamental, but I want to talk about is how it works."
        ],
        [
            "About as seven or eight years ago, I published a book called the Nature of Technology.",
            "I have been thinking about it and working on it actually for about 12 years and it was really fun because I decided I would.",
            "Become experts at least read a huge amount on between a dozen and 20 technologies really, really well and how they'd come into being.",
            "And I'm not talking about things like this or handheld devices.",
            "I'm talking about things like penicillin.",
            "Or the computer?",
            "The laser.",
            "Steam engine etc etc radar.",
            "And it was an incredible amount of fun.",
            "So I think technology is heavily under research that's under credited.",
            "You know we got to the moon and somehow scientists are credited.",
            "There's very, very little science on that and huge amounts of technology.",
            "So my question today is what I set out to think about in this book.",
            "Is there a theory of evolution for technology?"
        ],
        [
            "And that's question.",
            "Actually that dates back to just four years after Darwin.",
            "Samuel Butler was in New Zealand.",
            "He gone there to get away from an overbearing father, who I think must have also had an overbearing father.",
            "Doctor Butler's grand father was the headmaster that taught young Darwin so.",
            "The grandson, when he's grown up, gets away, goes to New Zealand.",
            "Darwin's book arrives three or four years after.",
            "Door and publishes it takes that long to make its way to New Zealand.",
            "The young Butler gets hold of Mrs Oh my God.",
            "I wonder if machines.",
            "Evolve, is there a theory of evolution for machines?",
            "And that question has been hanging out there for quite a long time.",
            "I want to talk."
        ],
        [
            "Quite a bit about it.",
            "There's really two meanings for evolution.",
            "One is.",
            "Lineages altering their form.",
            "You can call that descent by modification.",
            "So it's like saying has the.",
            "Has the Italian opera evolved or the English madrigal or coach making or something like that?",
            "Is that in evolved overtime?",
            "The second meaning is the one I'm interested in, and that is if I can find the right button.",
            "Wow.",
            "Microdot all organisms are related or.",
            "If we look at all the technologies that are possible all out there.",
            "Or they're related by ties of common ancestry to previous technologies.",
            "In some sense, all the way back.",
            "I'm going to argue they are indeed.",
            "But the mechanism isn't Darwinian.",
            "And by the way, if you think there might be only a few technologies you know, I started off thinking there might be a few 100 technologies that are quite distinct.",
            "the American Medical Association lists.",
            "64 thousand categories of medical procedures surgical technologies.",
            "64,000 Soviets start to look in separate types of technology.",
            "It depends how fine you do the cutting.",
            "You'll find there's hundreds of thousands, millions of them.",
            "This is a very, very large sector we're dealing with, not just a few things, and certainly not handheld devices when I was.",
            "Sending this in for proposals, when possible, publishers said, oh I understand all about technology.",
            "I've an iPad and I thought it's not quite well and talking about.",
            "OK, well there's been previous serious attempts at an evolution of techno."
        ],
        [
            "Leji explanation I was looking at this yesterday.",
            "The book is by Bus Allen 1988, but I was drawn to this figure here.",
            "And I'm pretty sure it was done by.",
            "It's a reproduction that was of.",
            "Artifacts drawn for a certain English.",
            "General called.",
            "In fact, Steve may know him.",
            "Augustus Henry.",
            "Linfox Pitt Rivers or I should say Augustus Henry.",
            "Linfox Pitt, Rivalz and.",
            "He if you look from left to right here it very strong feeling.",
            "There is an evolution.",
            "This is sort of the evolution of the axe.",
            "And it was drawn this way and then the evolution of a hammer.",
            "And that's actually a hammer press.",
            "If you look at it closer, there's still a museum in Oxford called the Pitt Rivers Museum.",
            "Collections of artifacts.",
            "But Pitt Rivers saw a kind of Darwinian smooth evolution of these gradual changes leading up to whatever is the more modern version.",
            "And he diagram after diagram drawing after drawing showing this progression, there's only one problem and that was later pointed out that if you look at these individual technologies.",
            "Say.",
            "The evolution of boomerangs in Australia there.",
            "Drawn from different parts of Australia, which is embarrassing and then different times.",
            "So the next one in the row might be 10,000 years older than the previous one and said so.",
            "That was a bit largely discredited.",
            "I'll come to best seller in the moment, but by Sal is written this book.",
            "It's worth reading, is very good book.",
            "But is arguing that technology evolves in Darwinian way.",
            "Variation and selection."
        ],
        [
            "Who will look at Darwin for a moment but I want to point out that Darwin of course wasn't writing about evolution.",
            "In fact, the word evolution is not mentioned in Darwin's origin more than once or twice, or three times.",
            "You can check on that evolution Wasant was quite.",
            "In the air at the time, and had been since the time of Darwin's Gran father.",
            "So it wasn't a very new idea what really interests Darwin is how could.",
            "Search evolution take place.",
            "How did species originate?",
            "And his answer was and I want to highlight this the steady accumulation through natural selection of such differences gives rise to all important modifications, steady accumulation of differences.",
            "Complex organs formed by numerous successive, slight modifications.",
            "So Darwinian, the West species break off is.",
            "That there might be a couple of different environments and species and one starts to adapt and accumulate differences.",
            "The other adapts in a slightly different direction.",
            "Pretty soon they can't interbreed move new species.",
            "All of this is lovely, but there's big butt for technology.",
            "Doesn't work.",
            "And this has been the embarrassment of attempts to do the evolution technology would say, Oh yeah, it's Darwin will waive the Darwinian warned.",
            "Then you have to ask and people have asked.",
            "This is fine, but did we get jet engines?",
            "Say around 1928, nineteen, 36.",
            "Have they come from the city's small differences in air?",
            "Piston engine's.",
            "The answer is of course not.",
            "Did we get rid or from slight differences?",
            "Deliberate or random, in radial circuits in in the 1930s?",
            "Absolutely not, and you can go through did we got measures?",
            "Did we could lasers?",
            "Did we get the transistor through the accumulation?",
            "Steady accumulation of small differences.",
            "No way these are called radical inventions.",
            "And yes, there's plenty of Darwinian evolution in technology.",
            "Helicopters designs.",
            "In fact, you don't get helicopters from small variations in airplanes.",
            "Wouldn't want to get a helicopter that work that way.",
            "It's not that some wings came loose and started to rotate by mistake or anything like that, so these radical inventions have come from some different process and that's the key thing, because they're the ones that set the stage really.",
            "Fine.",
            "The, but there is plenty of Darwinian evolution.",
            "Once once the helicopters out there and people like Sikorsky have.",
            "Cook that up.",
            "There's variation in the designs and better ideas are indeed borrowed, so there is some Darwinian or plenty of Darwinian.",
            "Evolution going on, but that's after a technology has been around and."
        ],
        [
            "Invented so really what we're looking for is the equivalent of Darwin's question.",
            "How do new radical technologies originate?",
            "It's the origination of species.",
            "But the species here are radically new technologies, and, colloquially, that's called invention."
        ],
        [
            "What struck me early on.",
            "And I remember actually early early on, because Stu Kauffman's here in the studio and I talked and chatted about this one summer long at the very news Santa Fe Institute in 1987 before all of you were born except Steve.",
            "I'm kidding and you.",
            "You're speaking from the heavens.",
            "Anyway, technologies and this is the absolute key or combinations in CZ enough to.",
            "The."
        ],
        [
            "Convince yourself here's the technology by I am dating this to about 1835.",
            "I'm not entirely sure it could be 1833, but notice it's a combination of things that were around already.",
            "These are coaches with rail, railway wheels, railroad wheels put on them.",
            "The steam engine had been around, and locomotive steam locomotives had been run since.",
            "1829 not as sophisticated as this, so that's why I'm guessing around 1835 or so.",
            "And then you can look at other things with barrels to have the coal etc cranks, larger wheels, boiler, etc.",
            "All these pieces have been around.",
            "But it doesn't really matter."
        ],
        [
            "Technologies are constructed from existing technologies and in many of the reviews of my book.",
            "It says, well, that's an empirical observation.",
            "It is not.",
            "There's a good reason for it, and that is that any technology uses some physical affect or mental affect.",
            "If you think of arithmetic or something.",
            "Any technology is a means to a purpose.",
            "To do that, it's using some physical phenomenon in the world.",
            "OK, like the railways, using certain using the phenomenon that something rolling on a relatively flat surface is not undergoing much friction as it would if it was sliding.",
            "So rolling on a hard surface reduces friction greatly, and.",
            "Think of the technology is capturing that affecter that phenomenon.",
            "But to make that effect fully work, you need other."
        ],
        [
            "Effects are phenomena that are captured.",
            "How are we going to power this thing?",
            "Oh well.",
            "We in the early days railways they used horses.",
            "There's Stockton Darlington Express in 1825 was carriages, maybe just one carriage and it had a horse pulling it.",
            "This is about 10 years later, I imagine so.",
            "We need another effect in that is we need something to apply force to move this thing horizontally.",
            "Well, why don't we use the Steam engine but a steam engine can't be moved so it needs to be on wheels, so we need something like boiler for the steam engine and said so.",
            "Notice that a technology is absolutely a combination of many physical effects orchestrated or put together or word I would use as programmed.",
            "To work together, so technology in that sense is not a trivial combination of other technologies.",
            "It's a programming or putting together of many physical effects that work together to support each other.",
            "Usually you can't use the best physical effect you need to manage it, you need control it that calls calls for other technologies, other physical effects.",
            "I'm emphasizing all of this because it's completely key."
        ],
        [
            "Here's a hint that I very much like.",
            "The hint came late in the game I was writing the final version before I saw this of my book, but I really love this.",
            "William Fielding Ogburn, a sociologist 1922 and he was interested in why, say, Trobriand Islanders were not as advanced as at least in our terms as what it called modern technology.",
            "He called these primitive technologies or.",
            "Friends use was material culture, but notices.",
            "He says if you can't read it at the back, it would seem that the larger the equipment of material culture greater than number of inventions.",
            "Meaning if you've got a large base.",
            "Of basic technologies, steam engines and so on, you can invent an awful lot.",
            "The reason the Trobriand Islanders, and again this appears trivial but fundamental.",
            "Have no trans or railway trains is that they don't have steam engines and they don't have the ability to produce steel or whatever is required to make rails.",
            "So when the existing material culture is small.",
            "The number of inventions is more limited than when the culture consists of knowledge of a variety of metals.",
            "Chemicals use of steam, electricity and so basically is saying.",
            "You can't really put things together if they don't exist in your culture.",
            "And this is absolutely the key to the evolution of technology.",
            "I think that.",
            "Good old William Fielding Ogbourne was about this far away from having a theory of evolution for technology.",
            "He didn't make the final links.",
            "These are just remarks in his book, but there are other beautiful.",
            "So.",
            "What I want to go into and dwell on for a bit is how invention really works."
        ],
        [
            "It's a process.",
            "It's not that you throw technologies up in the air, or you combine them randomly.",
            "It's process.",
            "It's process.",
            "Of linking some needs.",
            "There might be a need Oh my God.",
            "Bombers could come in the mid 1930s from the East.",
            "If you're in England.",
            "Potentially Germany, and they could toss bombs onto London.",
            "So we need some way to detect these.",
            "So to fulfill the need, you're basically looking for the idea of some effect, some physical effect that works for you.",
            "And that physical effect doesn't work just like that.",
            "Because you run into subproblems.",
            "And so it usually poses quite severe problems.",
            "And those problems you can solve, but they lead you to other subproblems, so they need the the idea of some physical effect.",
            "So the process.",
            "Of invention is recursive.",
            "We're going up and down the ladder of solutions.",
            "Yep, I could get if I could make this work.",
            "I could make the purpose work, however, to get that to work I would need this and this other effect to work.",
            "How would I do that?",
            "Oh, I see how I could do that, but hang on to get this one to work I would need that and that and that to work.",
            "So it's recursive.",
            "It's a bit like solving Sudoku problem.",
            "I think I could do this if this and this were true.",
            "If that worked etc and you're going up and down or a curse of ladder all the time.",
            "The result of that, of course, is a combination of things in the end."
        ],
        [
            "And I want to take an example.",
            "I like this one very much.",
            "Gary Starkweather, who is still with us 1972.",
            "At Xerox Parc, which is where I've been working in the last 20 years, Silicon Valley, they invented the Ethernet, the laser printer, which is starkweather's.",
            "What you see is what you get.",
            "A word processing the modern interface that many of you are using as we speak.",
            "For computers.",
            "But Starkweather was.",
            "Curious, but how do you print images on a computer from a computer?",
            "And at that time there very large line printers are essentially like huge typewriters, and I can certainly remember this.",
            "Stewart is not much younger.",
            "Many of you will remember line printers get the data and you had to go through the computer room and your output would be waiting for you etc.",
            "So Starkweather wanted to say, well, if I do photograph by diagrams by wanted different fonts, how would I print that?",
            "He looked for number of effects, could have used a cathode Ray tube and maybe use that to burn an image.",
            "You know, use a computer to direct.",
            "Cathode Rays, like television screen, then burn some image onto photosensitive paper.",
            "After a few tries like that, you come up with this."
        ],
        [
            "Smarter idea and that was he could use the laser so the computer could direct a laser.",
            "Which you could focus to a very, very fine degree.",
            "And he could use the laser to what they called paint on a copier drum for laser scans across the copier drum paints the image, save photograph onto the lizard run.",
            "The rest is just there ography.",
            "Don't forget his working for Xerox Parc.",
            "His background PhD was in lasers.",
            "His Masters degree was in optics.",
            "But that brought up subproblems, loads and loads of subproblems.",
            "One of them was wouldn't the laser just burn its way through the copier drum, another one was when you workout how many times you have to switch the Liz or on and off.",
            "If it's scanning one line and then another and another and the whole page has converted so many dots per inch, he reckoned that he'd have to switch the laser on and off in principle.",
            "From the ones and zeros of Blacks and whites.",
            "50 times sorry.",
            "50 million times second 50 megahertz.",
            "Nobody had done that with lasers before.",
            "It have to move the laser very rapidly, but lasers in those days were huge things and sort of go yeah and then scan the next line in the next line at so many dots per inch.",
            "Let's say 300 dots per inch, so you'd have to be able to scan across three several 1000 times per second.",
            "Lasers or heavy.",
            "How you gonna solve that?",
            "He sold the the modulation thing the switching thing by.",
            "Having a polarized filter that he could use a pizza electric circuit to switch on and off.",
            "If that goes past you, that's in the Don't worry category.",
            "I want to say how he's got the this particular problem, which.",
            "This gorgeous solution for that one.",
            "He said essentially it's smoke and mirrors, he said.",
            "Why don't rather than move the laser?",
            "I'm just going to have a mirror that scans the laser beam right across the page, much as a lighthouse mirror would scan the light beam right across the horizon and we'll switch it on and off with our modulating circuit.",
            "There are further sub problems and using mirrors and lining up the faces and so on.",
            "What I want you to notice is that this is sort of.",
            "If I could do this, I if I could do such and such and the lower level I would achieve that.",
            "But to do such and such at the lower level I would need this and to do that very often the kind of problem that we're dealing with in our minds now.",
            "Oh my car is broken down.",
            "OK, how do I get to work?",
            "Well, I could go to the train but hang on I have no car to get to the train, so we're down one right?",
            "I need someone to get me to the car, but who my gonna get?",
            "So you're going up and down this.",
            "Ladder all the time.",
            "Here's what."
        ],
        [
            "Come up with, this is an examples too nice to talk about early on if you remember.",
            "Here's the mirror rotating with many sides.",
            "Here's the laser.",
            "Your computers controlling the laser, the switching device up here, the mirrors scanning across the page and all the rest is xerography, and there are probably thousands of parts.",
            "It gets it up and running.",
            "The folks at headquarters in their infinite wisdom said this is lovely.",
            "It's beautiful, but we can't make any money out of this.",
            "'cause lasers cost $50,000 forty years ago pargos and nobody is going to pay for that.",
            "So Hewlett-Packard took it up."
        ],
        [
            "I want to point out that there's not a lot more to invention than this, but I'm kind of giving you the guts of it if you're interested.",
            "This is a paper of mine in research policy.",
            "I think around 2007.",
            "Structure of invention."
        ],
        [
            "Um?",
            "But to summarize this bit.",
            "Inventions rarely a process of finding what works for a purpose.",
            "What's needed for a purpose.",
            "In what already exists.",
            "So think of it this way, I want to invent something by the huge box of Lego parts.",
            "And I want to invent something that exists.",
            "All I have is Lego parts or in the candle set or forgotten the American equivalent.",
            "I'm going to look in my Lego set to see if I can put together parts that will solve the problem."
        ],
        [
            "So.",
            "Going into what I think is really interesting, what we can really says that novel technologies these radically new technologies are constructed from existing technologies.",
            "There are no exceptions to this, not even things like penicillin.",
            "If you ask me afterwards.",
            "And then these novel technologies be there.",
            "The steam engine or railways or the laser or the transistor offer themselves as components.",
            "Further building blocks for the construction of further technologies.",
            "So you might start with.",
            "Hundreds of fairly primitive Lego pieces in your collection, and then you find again and again.",
            "You have some need and some combination of Lego pieces solves that, and then you find that need is coming up again and again so you don't want to have to put it together always.",
            "So you take that combination, you stick in the often you fused together and that's a new type of peace and you throw that back in your Lego set.",
            "I should also."
        ],
        [
            "So just add this new phenomena or captured time to time.",
            "How are they captured by existing technologies, X Rays or?",
            "Use and captured via Crookes tubes, which are an earlier form of cathode Ray tube anyway.",
            "And those offer themselves as compose."
        ],
        [
            "So.",
            "And this is where things I think.",
            "Got mind blowing.",
            "I'm saying this because this is a complexity crowd, so imagine just imagine that the collective of technology is a vast network.",
            "The network connections are what parentid, what the steam engine.",
            "The crank wheels rails they helped apparent railroads, or if you prefer.",
            "The trialed vacuum tube which is made up of its own components plus other components where the parents.",
            "Of the amplifier in 1912.",
            "But the amplifier plus other components are the parents of the oscillator, but the oscillator and other components gave us radio transmitters and radio receivers etc.",
            "Similarly for computation.",
            "So think of this vast network of technologies millions or hundreds of thousands of technologies connected by links to their immediate parents.",
            "And think of some of them is lit up with their still getting used today.",
            "And some have gone dark.",
            "They're no longer used.",
            "Things like say.",
            "Anvils we don't have too many blacksmiths around so that sort of technology exists, but it's not much used.",
            "And.",
            "New nodes are new technologies are created from time to time by French fresh combinations, fresh linkages and suddenly they light up foof.",
            "Oh, we can do fill in the blank.",
            "We can do some sort of virtual reality algorithm.",
            "We can do this or that.",
            "Don't forget all computer programs or computer applications are made this way.",
            "In fact my breakthrough was to realize that is C program.",
            "With men and different functions that were called is basically building itself up from sub functions, and it's a huge combination of functions or functionality's.",
            "So if new nodes or new technologies are getting added to this huge network of connected technologies, it's ancestral.",
            "Going back to the very earliest phenomena that were captured, things like, OK, I can use friction with a bow drill to create heat.",
            "Then you have an Organism.",
            "The collective of technology that's building out and building from itself, borrowing a term from.",
            "Varela Maturana it's autopoietic.",
            "Some people said sort of poetic, but it's autopoiesis is self producing self, not self organizing but self producing or creating itself.",
            "And by the way we.",
            "This I've got this far in just a few minutes, but already we have discovered an Organism this vast network that passes all the tests for being alive.",
            "It's self organizing and it's auto poietic itself.",
            "Creating new elements are building from the whole array of existing ones.",
            "Complications building from simplicity 1950 you had the transistor.",
            "Which is a solid state.",
            "Piece of equipment.",
            "Imagine what combinations of those with different types of circuits have done in any device you're now holding in your hand.",
            "So complication builds out of simplicity.",
            "New elements build from existing ones."
        ],
        [
            "Technologies, if you like, form a huge chemistry of existing molecules that.",
            "Synthesize every so often to give you new useful molecules.",
            "In combination and those new useful molecules can be synthesized yet again with older ones to create something.",
            "Yet newer.",
            "I call this evolution combinatorial evolution.",
            "I thought of different names for it, the much better name in English is combinatory.",
            "Yeah, combinatory evolution.",
            "I tried that on a number of people and people.",
            "Said, Oh yes, combinatorially evolution.",
            "So in the end I give in.",
            "And but the word for something that's always combining in English is commendatori.",
            "However, I'll go with the inevitable and colored combinatorial evolution.",
            "Notice that this is not Darwinian, and I want to spend the rest of my time talking about."
        ],
        [
            "This is going much faster now, so this is suggesting an evolutionary algorithm.",
            "You start with your basic Lego set of primitive objects.",
            "And then you form combinations, maybe at random, or maybe not at random.",
            "And it's a combination of these elements.",
            "Turns out to be useful for your purpose.",
            "You fuse it, gather you encapsulated, preserve it, and you toss that back in the Lego set, and so you add the new combination to the supers building block element.",
            "You could ask me and say.",
            "I don't disagree.",
            "In fact, I buy the picture.",
            "But where is it heading?",
            "The answer is nowhere.",
            "There's a nice no harness to this that you just things adding to things that do things.",
            "I'm using Kaufman Esque language things that do things to things.",
            "So could you get this to work?"
        ],
        [
            "On the computer, one of the first things I learned in Santa Fe Institute, we all desktop workstations, by the way or computers.",
            "They weren't laptops then.",
            "That much.",
            "Could you get this to work on a computer?",
            "It's pretty trivial to get Darwinian evolution small changes working away on your computer screen, and certainly we were very keen on doing this sort of thing and learning a lot about evolution visually.",
            "The kind of thing that James Bailey was talking about earlier in the week here.",
            "Visually seeing how Darwinian evolution works.",
            "This other revolution by combination, could you get that to work on a computer as an experiment?",
            "My immediate answer is no.",
            "I mean, I thought about this.",
            "I was working.",
            "This was about.",
            "12 years ago through.",
            "Xerox Parc was here down the Hill a little bit was Fuji Xerox.",
            "Palo Alto Lab, which was Fuji Xerox's version of Xerox Parc, which is a think tank.",
            "And I was working for them and they said.",
            "Would you do a project for us on complexity?",
            "And I thought, oh wow, I thought of this combinatorial evolution algorithm.",
            "Could I get that to work in a computer?",
            "I said OK, no, this is just beyond anything I can do, but cause.",
            "You know I can't get, say a jet engine on my computer, at least in principle and.",
            "A hen house which is also technology for.",
            "Housing hands and put the two together.",
            "How would my computer know if that's going to work every time?",
            "By the way, I thought of something that was ridiculous, like a jet engine, and the hen has the wags at Santa Fe.",
            "Said, oh, but you could do that.",
            "It would be useful and I'm so WHI.",
            "Because.",
            "Chickens need to be plucked and roasted, so you can anyway you set up the jet engine."
        ],
        [
            "To do that, how would we do this eventually?",
            "I had an idea and I work closely with Wolfgang Polak from ethics pal, Fuji Xerox, Palo Alto lab computer scientist and a really superb one.",
            "And every time I come up with an idea, I couldn't see how to make it work computationally, but Pollock.",
            "So here's here's the idea.",
            "We create an artificial world in which technologies evolve indefinitely from previous ones.",
            "So we allow the system create technologies in our artificial world by combining previous technologies according to the algorithm, that's not the best part of the idea, or technologies were going to be logic circuits that don't switch off at this stage.",
            "Assume you don't know anything about logic circuits and trend.",
            "As electrical engineer, I should know I've this was back in primitive days and I've long forgotten the good thing about two logic circuits.",
            "Is if you wire them together, you get another logic circuit.",
            "And the other good thing is that if you have any logic circuit design in front of you, you or the computer can tell exactly what it does.",
            "So that solves all the problems we needed.",
            "In our artificial world, within the machine now I'm waxing.",
            "Complex at the moment.",
            "We always think of agents so we're gonna have little green agents that green eyes shades.",
            "There's nothing in this artificial world they want to do better than compute things so they're going to need logic circuits.",
            "Why I don't know?",
            "And So what we decide to do is have this world in which logic is needed.",
            "But no logic circuits yet exist.",
            "And they have a whole wish list of needs for logic circuits.",
            "For some reason in this world, so we'd love to be able to compare binary digits that are 4 digits long.",
            "See of there the same.",
            "Oh, we'd love to have adders.",
            "We'd love to get exclusive or circuits.",
            "And and this is the cheating part, or at least the shortcut."
        ],
        [
            "But we took we, we abolished, or agents early on, we said, that's a world that could evolve by itself.",
            "We're going to shortcut that and just have a big list of 80 or 100 logic needs of for doing logic.",
            "And we will just list them.",
            "Now.",
            "I don't know if other people have done the filled out the the.",
            "Working Agent World to do this but.",
            "I admit that that's shortcutting.",
            "The business of finding the particular circuits of would work for these little agents, though, was harder.",
            "So."
        ],
        [
            "We would love to get say 4 bit equals 2 bit adders and so now explain a bit of that and we used our algorithm start from one primitive element happened to be an and gate or not and gate.",
            "That's our basic Lego block.",
            "That's the little yellow blocks A and we've got a big long wish list of needs.",
            "We don't know if we'll find circuits that fulfill any of them and the start.",
            "We've new circuits and then we're going to wire these.",
            "What we do have the primitive elements together at random check of their fulfill any needs and if they do will.",
            "Through, we will encapsulate that circuit, throw it back in the Lego block box for further combination.",
            "OK, so we starting with some primitive elements we're starting the long list of.",
            "Needs 4 circuits.",
            "The circumstance yet exist, so we start to wire things together randomly.",
            "Odvar Lego Box of primitive circuits if any needs are fulfilled on our list.",
            "We record.",
            "The particular combination that did it and then we'll give it a new name, will toss back in the Lego box, and so our building blocks might in."
        ],
        [
            "Crease, so here's our primitive element and again, don't get too.",
            "Worried if if this is kind of like?",
            "Looking at some form of chemistry.",
            "But for those of you who care, you know there's an input two inputs here, so I'd be X&Y, could be zero or one here 01 there and then that's telling you what you get out with each combinations of zeros and ones here that's zed or the Z that comes out."
        ],
        [
            "By chance early on or so, Wolfgang Polak takes the whole thing, programs it, which took several months of really hard work in his part.",
            "Fix it all home.",
            "Presses the return button.",
            "And all kinds of creatures have gonna emerge, but we don't know in advance.",
            "In fact, we don't know we'll get any creatures at all.",
            "Here's one that came up fairly fast, so you can see we also allowed that we one of the inputs could be nailed down to a one that was always a one or a zero, and within a few hundreds of random circuits we get an AC circuit.",
            "It's doing not logic.",
            "If it's zero, gotta one here.",
            "That's the one you get a 0 here, etc."
        ],
        [
            "There's another one.",
            "Sorry, I'm going the wrong direction.",
            "Here's one that does implies.",
            "Here's one I don't know."
        ],
        [
            "This dolls, but it was something on our list.",
            "We called this one Tech 20.",
            "Now we weren't supervising anything.",
            "The machine just kept coming up with this."
        ],
        [
            "One bit adder, a 2 bit adder but."
        ],
        [
            "Notice the two bit adder, so you're adding X&Y and each one of these kind of two bits zeros or ones, and then on the Z part you have.",
            "The output plus a carry.",
            "Just like you know, if you're adding four and.",
            "Seven will get a 1 + A carry digit, making it 11.",
            "Notice the two bit adder randomly combines something that was.",
            "Colorful ladder that takes care of the carry and then this bit is 1 bit adder so all of these have arisen from what exists and is being tossed back in the box as you go."
        ],
        [
            "I'll go faster."
        ],
        [
            "Here."
        ],
        [
            "4 bit adder etc.",
            "Created from a full adder and a three to three bit adders, but notice that this has been combined randomly, not connected with anything.",
            "It's just sitting there doing nothing.",
            "I think part of the algorithm took those things out if they weren't useful."
        ],
        [
            "What do we get?",
            "Imagine that we're lowering a big big net down into.",
            "All these technologies and principle might exist if we knew how.",
            "And we're getting at the end of quarter of a million steps, which took 20 hours at the time.",
            "Again is about 10 years ago.",
            "We managed to fish up in one particular instance or many instances, and eight way exclusive or four way and forbid equals many other circuits came up, simpler ones and an 8 bit adder and 8 bit adders.",
            "Interesting.",
            "It's just one of the many creatures that got created by the algorithm.",
            "On this run, run it again.",
            "You get different creatures.",
            "8 bit others interesting.",
            "For several reasons, an 8 bit adder.",
            "Was what Hewlett-Packard used in 1974 to make a hand Calculator?",
            "It was completely new.",
            "You could hold it in your hand.",
            "This replaced slide rules.",
            "I don't see anybody with any nods of recognition, but I remember the wonders of Hewlett-Packard calculators, so saying digit X is 8 bits, ones and zeros.",
            "Digit, why has 8 bits, ones and zeros the output in your little Hewlett-Packard screen as 8 bits, that Susie.",
            "And then the carry if that's possible.",
            "All done in binary notation.",
            "So think back again, we start with one primitive Lego block.",
            "We keep combining.",
            "If things are useful, we throw, toss them back in the soup for further combination.",
            "And lo and behold.",
            "Given our wish list, we wind up with all kinds of exotic things, maybe 1520 or 30.",
            "Useful circuits for these logic programs and some sophisticated ones.",
            "Remember sitting on a plane on the way to Iceland.",
            "I thought Pollock called me that morning saying, hey, one of the runs we got an 8 bit adder so wow.",
            "And then I sat down on the plane and I thought, you know, how many trials would you have to do sort of randomly wiring circuits not with our algorithm?",
            "Does it?",
            "Random how many random circuits would?",
            "Have 8 inputs of X8 inputs of Y.",
            "Giving you different readings for the Z.",
            "And I thought, yeah, Belot could be 10,000,000.",
            "Maybe it could be 20,000,000.",
            "In the stretch of imagination, that might be really large, could be a billion.",
            "So I sat down and calculated it.",
            "It's not a hard calculation, but here's what came up.",
            "It's one of 10 to the power of 170 seven 1554.",
            "Possible.",
            "Binary circuits.",
            "And if that's hard to envisage.",
            "I I calculated if you wrote it down in a book with no spaces so you.",
            "Calculated say using mathematical calculators, it's Pi formulas.",
            "Would it take up half a page of a book?",
            "No takes up 150 pages to write that number down.",
            "It's a large number and Pollux machine found it in 1/4 of a million steps and wasn't even looking for it.",
            "That was among several other things.",
            "Or I can put this another way.",
            "I'm an electrical engineer.",
            "If someone had said to me and I did study digital circuitry.",
            "Someone said you're an engineer design me an 8 bit adder.",
            "I don't think I could do it.",
            "I'd have to have gone to the library.",
            "Have done tutorials, maybe thought for a month or two and finally I figure out how to design an 8 bit adder.",
            "But this is the miraculous part.",
            "I didn't do that.",
            "I designed an algorithm that could design an 8 bit adder.",
            "And for me, I find that significant.",
            "I wouldn't call this artificial intelligence, but when I stated this way, this is doing something very, very very complicated in a stepwise manner.",
            "Building up from simpler things.",
            "This is the part that."
        ],
        [
            "Gets very biological.",
            "These complicated technologies require intermediate steps.",
            "So we took out all the intermediate needs of simple circuits and more complicated circuits to see if we could get very fancy circuits coming up.",
            "Absolutely not.",
            "The stepping stones weren't there.",
            "There's gorgeous paper by rich Lenski of Michigan State and some colleagues called the Evolutionary Oregon origin of complex Plex features.",
            "Trying to do this is like asking something as complicated as the human eye.",
            "To evolve without any intermediate steps, you know telling the difference between light and dark, we do need the intermediate steps after, but we got Cambrian."
        ],
        [
            "Explosions.",
            "But in different runs, different Cambrian explosion explosions.",
            "Not much.",
            "Not much, not much.",
            "And then after 30,000 steps, maybe the appearance of a 2 bit adder or something.",
            "But that's useful for more complicated things and then suddenly take off and all kinds of forms appearing fairly quickly within a few 100,000 steps.",
            "After that.",
            "Or 10s of thousands of steps.",
            "So that's quite biological too.",
            "They have."
        ],
        [
            "Solutions history dependent if you run it in a different order, you get quite different things coming out and the components are quite different.",
            "If we had discovered iron.",
            "Know how to work with iron before bronze it would have been a different history if we had discovered the transistor before the triode.",
            "Vacuum tube history would be different, so it's very history dependent.",
            "There's trumpeter GAIL."
        ],
        [
            "Of destruction I don't have time to mention that, but notice we get sandpile."
        ],
        [
            "Avalanches this is for the collapses and other technologies that are not used.",
            "Perfect power Power law Steven I can show you afterwards, but and."
        ],
        [
            "But I want to finish up here with some comments on evolution, biological evolution, Darwinian variation, and selection cumulation.",
            "Steady accumulation as Darwin called of incremental changes.",
            "But in the.",
            "History of biological things.",
            "The major transitions in evolution.",
            "Those tend to be combinatorial.",
            "The eukaryotic cells put together combinations of simpler things that were presumably bacteria.",
            "The.",
            "Multicellular organisms and so on that's combinatorial evolution.",
            "Technological evolution the big breakthroughs are the radically new technologies are put together and not randomly, of course, but they're put together from existing things.",
            "That gives you a abrupt differences.",
            "Suddenly the jet engine replaces the air piston engine very, very quickly itself, augmenting ourselves, creating.",
            "The new things are added to the box, and Darwinian evolution exists.",
            "Once you get an aircraft coming out, you get variations on that.",
            "As we saw in the First World War.",
            "I'm an aircraft buff and I love watch looking at these."
        ],
        [
            "One who finished with some remarks on.",
            "Focus not so much on technology, but on this algorithm for combinatorial evolution."
        ],
        [
            "As long as I keep pointing our Darwin starts with the population, this is his algorithm produces variations, some mechanism he didn't understand at the time.",
            "Darwin, by the way, got a lot of his ideas from talking to pigeon fanciers and cattle breeders, and notice the variations and then that the pigeon fanciers in the cattle breeders were exercising selection.",
            "And reading Malthus he figured out oh wow, maybe there's pressure for nature to those new population produces further variations dot dot it diverges by the steady accumulation of differences."
        ],
        [
            ", Tutorial Evolution is a different game.",
            "Start with some primitive building blocks.",
            "Make combinations.",
            "Some of the combination is going to be useful.",
            "Those become new building blocks and that's the building block.",
            "The result is a library of functionality's.",
            "This is exactly what happens when.",
            "Programming designers.",
            "Or cooking up a new language is a beautiful book by Bjarne Stroustrup.",
            "I may be getting that wrong.",
            "He's either Norwegian or Danish.",
            "Who invented C++?",
            "And he goes to a lot of trouble saying how do we select and put together the primitive?",
            "Many micro programs or algorithms that are going to create the library algorithms.",
            "So you type in, you want cosine of something pump.",
            "It's using other sub algorithms.",
            "And then you keep putting together.",
            "And so the result is a chem."
        ],
        [
            "History if you like of new things coming up.",
            "Where does this occur well?",
            "It occurs in spades in mathematics.",
            "No, not.",
            "There's plenty pasting together of.",
            "The elements of course, that I haven't emphasized much in mathematics.",
            "What counts is really two things.",
            "Structures that we give names to and theorem slash lemmas which are accepted statements about those structures and a new theorem or lemma is constructed.",
            "By referencing previous theorems all way back to axles so the constructs are the same in mathematics, progress is think of the Fairmonts last theorem, proof by building upon previous theorems.",
            "And goes forward in this way and it's creating basically a library if you like of structures and functions.",
            "There is chemistries obviously whoops synthetic chemistries.",
            "As I said a moment ago, programming libraries for programming languages, gene regulatory networks, it's easy to take one network and have it trigger part of another network, and then you suddenly have a much bigger regulatory network that can be used for other things in a natural way.",
            "Collective physical cosmos.",
            "And certainly people have mentioned this.",
            "Here's my favorite quote on this."
        ],
        [
            "It's from Francois Jakab, the great molecular biologist.",
            "In our universe, matter is arranged in the hierarchy of structures by successive integrations.",
            "So the hierarchy of structures by so.",
            "Particles come together to make atoms come together to make molecules with make gases which condense into solar systems and planets etc.",
            "One thing built out of another, and the great diversity of vertebrates results from differences in the arrangement.",
            "The number of distribution of these few building blocks.",
            "He would probably now have said.",
            "Proteins or even arrangements of genes or DNA.",
            "We know that the basic library of genes is not large, and it's relatively shared by animals or creatures all way from flies to people, and it's different combinations and arrangements that are giving different organ organisms.",
            "Will finishing."
        ],
        [
            "This note.",
            "An awful lot of this, Stuart.",
            "Abuts or connects with your work, but when I was doing this.",
            "In that paper I also mentioned this that the adjacent possible for this algorithm is much much larger.",
            "Darwin's algorithm adjacent possible, which is Stuart's idea is basically saying where can I go next if I can make one little walk to the neighboring thing.",
            "That's basically what Darwin say, small changes.",
            "That's the adjacent possible, so the adjustment possible of all that we have.",
            "In Darwin's theory, is a kind of thin layer surrounding what we already have.",
            "We can only walk to what's immediately next to us.",
            "With combinatorial evolution, the adjacent possible is much larger.",
            "It's like the multiplicative thing that Steven was talking about you, you take.",
            "You take the elements that go that are sitting around.",
            "You have air piston engine for aircraft in 1928.",
            "The new jet aircraft, which consists of compressors, turbines, combustion chambers etc.",
            "Is part of the adjacent possible of what already exists, but is eons away from an air piston engine?",
            "And last thought, I want to give you is that new things can be made if they are ordered.",
            "Meaning that they are reachable in the suggestion possible from other ordered things.",
            "We cooked up quite random truth tables for our experiments.",
            "We couldn't reproduce them because they're not ordered.",
            "The Lego sets you starting with something you put together something that's needed that's pretty ordered, and only if you can get other things on your list to be made out of those ordered things.",
            "Can you reach them?",
            "And that gives you an awful lot of order, and I speculate I don't know.",
            "But this is just weird speculation.",
            "Possibly that's why our world is so highly ordered that it's made up or constructed in successive layers by successive integrations.",
            "From previously ordered things, if you want something at random.",
            "You're not going to get it using this algorithm.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, thank you very much and I'm delighted to be here.",
                    "label": 0
                },
                {
                    "sent": "Every so often I get objections on the Internet.",
                    "label": 0
                },
                {
                    "sent": "You know why?",
                    "label": 0
                },
                {
                    "sent": "Is an economist interested in technology?",
                    "label": 0
                },
                {
                    "sent": "Or why is anyone interested in technology and?",
                    "label": 0
                },
                {
                    "sent": "I was trained as an engineer and props like many of you in a British University where it's four years of solid engineering from start finish and nothing else.",
                    "label": 0
                },
                {
                    "sent": "And I got interested in.",
                    "label": 0
                },
                {
                    "sent": "I did very well indeed in that course, but.",
                    "label": 0
                },
                {
                    "sent": "I. I never really felt I understood technology, and I suppose later in life then I came back trying to solve that question.",
                    "label": 0
                },
                {
                    "sent": "Also, I should say.",
                    "label": 0
                },
                {
                    "sent": "For those of you who are not sure why you're here, technology is interesting.",
                    "label": 0
                },
                {
                    "sent": "Just give you the following thought experiment and you might try this if you took away all the technologies that have been invented since.",
                    "label": 0
                },
                {
                    "sent": "Say 1400 since the Middle Ages.",
                    "label": 0
                },
                {
                    "sent": "You can take away all the scientific ideas since 1600 or 1400 and.",
                    "label": 0
                },
                {
                    "sent": "Life would be impoverished, but it would go on if you took away all the technologies we have no cars.",
                    "label": 0
                },
                {
                    "sent": "We have no modern lighting.",
                    "label": 0
                },
                {
                    "sent": "We have no modern buildings.",
                    "label": 0
                },
                {
                    "sent": "We would have no flush toilets.",
                    "label": 0
                },
                {
                    "sent": "We'd be cooking, maybe on primitive stoves.",
                    "label": 0
                },
                {
                    "sent": "We might be wearing cloaks.",
                    "label": 0
                },
                {
                    "sent": "If you're European of your Chinese, something else, life would be entirely different.",
                    "label": 0
                },
                {
                    "sent": "No technology, no modern science, no modern economy.",
                    "label": 0
                },
                {
                    "sent": "And essentially, no modern life.",
                    "label": 0
                },
                {
                    "sent": "So technology here is fundamental, but I want to talk about is how it works.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About as seven or eight years ago, I published a book called the Nature of Technology.",
                    "label": 0
                },
                {
                    "sent": "I have been thinking about it and working on it actually for about 12 years and it was really fun because I decided I would.",
                    "label": 0
                },
                {
                    "sent": "Become experts at least read a huge amount on between a dozen and 20 technologies really, really well and how they'd come into being.",
                    "label": 0
                },
                {
                    "sent": "And I'm not talking about things like this or handheld devices.",
                    "label": 0
                },
                {
                    "sent": "I'm talking about things like penicillin.",
                    "label": 0
                },
                {
                    "sent": "Or the computer?",
                    "label": 0
                },
                {
                    "sent": "The laser.",
                    "label": 0
                },
                {
                    "sent": "Steam engine etc etc radar.",
                    "label": 0
                },
                {
                    "sent": "And it was an incredible amount of fun.",
                    "label": 0
                },
                {
                    "sent": "So I think technology is heavily under research that's under credited.",
                    "label": 0
                },
                {
                    "sent": "You know we got to the moon and somehow scientists are credited.",
                    "label": 0
                },
                {
                    "sent": "There's very, very little science on that and huge amounts of technology.",
                    "label": 0
                },
                {
                    "sent": "So my question today is what I set out to think about in this book.",
                    "label": 0
                },
                {
                    "sent": "Is there a theory of evolution for technology?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that's question.",
                    "label": 0
                },
                {
                    "sent": "Actually that dates back to just four years after Darwin.",
                    "label": 0
                },
                {
                    "sent": "Samuel Butler was in New Zealand.",
                    "label": 0
                },
                {
                    "sent": "He gone there to get away from an overbearing father, who I think must have also had an overbearing father.",
                    "label": 0
                },
                {
                    "sent": "Doctor Butler's grand father was the headmaster that taught young Darwin so.",
                    "label": 0
                },
                {
                    "sent": "The grandson, when he's grown up, gets away, goes to New Zealand.",
                    "label": 0
                },
                {
                    "sent": "Darwin's book arrives three or four years after.",
                    "label": 0
                },
                {
                    "sent": "Door and publishes it takes that long to make its way to New Zealand.",
                    "label": 0
                },
                {
                    "sent": "The young Butler gets hold of Mrs Oh my God.",
                    "label": 0
                },
                {
                    "sent": "I wonder if machines.",
                    "label": 0
                },
                {
                    "sent": "Evolve, is there a theory of evolution for machines?",
                    "label": 0
                },
                {
                    "sent": "And that question has been hanging out there for quite a long time.",
                    "label": 0
                },
                {
                    "sent": "I want to talk.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Quite a bit about it.",
                    "label": 0
                },
                {
                    "sent": "There's really two meanings for evolution.",
                    "label": 0
                },
                {
                    "sent": "One is.",
                    "label": 0
                },
                {
                    "sent": "Lineages altering their form.",
                    "label": 0
                },
                {
                    "sent": "You can call that descent by modification.",
                    "label": 0
                },
                {
                    "sent": "So it's like saying has the.",
                    "label": 0
                },
                {
                    "sent": "Has the Italian opera evolved or the English madrigal or coach making or something like that?",
                    "label": 0
                },
                {
                    "sent": "Is that in evolved overtime?",
                    "label": 0
                },
                {
                    "sent": "The second meaning is the one I'm interested in, and that is if I can find the right button.",
                    "label": 0
                },
                {
                    "sent": "Wow.",
                    "label": 0
                },
                {
                    "sent": "Microdot all organisms are related or.",
                    "label": 0
                },
                {
                    "sent": "If we look at all the technologies that are possible all out there.",
                    "label": 0
                },
                {
                    "sent": "Or they're related by ties of common ancestry to previous technologies.",
                    "label": 0
                },
                {
                    "sent": "In some sense, all the way back.",
                    "label": 0
                },
                {
                    "sent": "I'm going to argue they are indeed.",
                    "label": 0
                },
                {
                    "sent": "But the mechanism isn't Darwinian.",
                    "label": 0
                },
                {
                    "sent": "And by the way, if you think there might be only a few technologies you know, I started off thinking there might be a few 100 technologies that are quite distinct.",
                    "label": 0
                },
                {
                    "sent": "the American Medical Association lists.",
                    "label": 0
                },
                {
                    "sent": "64 thousand categories of medical procedures surgical technologies.",
                    "label": 0
                },
                {
                    "sent": "64,000 Soviets start to look in separate types of technology.",
                    "label": 0
                },
                {
                    "sent": "It depends how fine you do the cutting.",
                    "label": 0
                },
                {
                    "sent": "You'll find there's hundreds of thousands, millions of them.",
                    "label": 0
                },
                {
                    "sent": "This is a very, very large sector we're dealing with, not just a few things, and certainly not handheld devices when I was.",
                    "label": 0
                },
                {
                    "sent": "Sending this in for proposals, when possible, publishers said, oh I understand all about technology.",
                    "label": 0
                },
                {
                    "sent": "I've an iPad and I thought it's not quite well and talking about.",
                    "label": 0
                },
                {
                    "sent": "OK, well there's been previous serious attempts at an evolution of techno.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Leji explanation I was looking at this yesterday.",
                    "label": 0
                },
                {
                    "sent": "The book is by Bus Allen 1988, but I was drawn to this figure here.",
                    "label": 0
                },
                {
                    "sent": "And I'm pretty sure it was done by.",
                    "label": 0
                },
                {
                    "sent": "It's a reproduction that was of.",
                    "label": 0
                },
                {
                    "sent": "Artifacts drawn for a certain English.",
                    "label": 0
                },
                {
                    "sent": "General called.",
                    "label": 0
                },
                {
                    "sent": "In fact, Steve may know him.",
                    "label": 0
                },
                {
                    "sent": "Augustus Henry.",
                    "label": 0
                },
                {
                    "sent": "Linfox Pitt Rivers or I should say Augustus Henry.",
                    "label": 0
                },
                {
                    "sent": "Linfox Pitt, Rivalz and.",
                    "label": 0
                },
                {
                    "sent": "He if you look from left to right here it very strong feeling.",
                    "label": 0
                },
                {
                    "sent": "There is an evolution.",
                    "label": 0
                },
                {
                    "sent": "This is sort of the evolution of the axe.",
                    "label": 0
                },
                {
                    "sent": "And it was drawn this way and then the evolution of a hammer.",
                    "label": 0
                },
                {
                    "sent": "And that's actually a hammer press.",
                    "label": 0
                },
                {
                    "sent": "If you look at it closer, there's still a museum in Oxford called the Pitt Rivers Museum.",
                    "label": 0
                },
                {
                    "sent": "Collections of artifacts.",
                    "label": 0
                },
                {
                    "sent": "But Pitt Rivers saw a kind of Darwinian smooth evolution of these gradual changes leading up to whatever is the more modern version.",
                    "label": 0
                },
                {
                    "sent": "And he diagram after diagram drawing after drawing showing this progression, there's only one problem and that was later pointed out that if you look at these individual technologies.",
                    "label": 0
                },
                {
                    "sent": "Say.",
                    "label": 0
                },
                {
                    "sent": "The evolution of boomerangs in Australia there.",
                    "label": 0
                },
                {
                    "sent": "Drawn from different parts of Australia, which is embarrassing and then different times.",
                    "label": 0
                },
                {
                    "sent": "So the next one in the row might be 10,000 years older than the previous one and said so.",
                    "label": 0
                },
                {
                    "sent": "That was a bit largely discredited.",
                    "label": 0
                },
                {
                    "sent": "I'll come to best seller in the moment, but by Sal is written this book.",
                    "label": 0
                },
                {
                    "sent": "It's worth reading, is very good book.",
                    "label": 0
                },
                {
                    "sent": "But is arguing that technology evolves in Darwinian way.",
                    "label": 0
                },
                {
                    "sent": "Variation and selection.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Who will look at Darwin for a moment but I want to point out that Darwin of course wasn't writing about evolution.",
                    "label": 0
                },
                {
                    "sent": "In fact, the word evolution is not mentioned in Darwin's origin more than once or twice, or three times.",
                    "label": 0
                },
                {
                    "sent": "You can check on that evolution Wasant was quite.",
                    "label": 0
                },
                {
                    "sent": "In the air at the time, and had been since the time of Darwin's Gran father.",
                    "label": 0
                },
                {
                    "sent": "So it wasn't a very new idea what really interests Darwin is how could.",
                    "label": 0
                },
                {
                    "sent": "Search evolution take place.",
                    "label": 0
                },
                {
                    "sent": "How did species originate?",
                    "label": 0
                },
                {
                    "sent": "And his answer was and I want to highlight this the steady accumulation through natural selection of such differences gives rise to all important modifications, steady accumulation of differences.",
                    "label": 0
                },
                {
                    "sent": "Complex organs formed by numerous successive, slight modifications.",
                    "label": 0
                },
                {
                    "sent": "So Darwinian, the West species break off is.",
                    "label": 0
                },
                {
                    "sent": "That there might be a couple of different environments and species and one starts to adapt and accumulate differences.",
                    "label": 0
                },
                {
                    "sent": "The other adapts in a slightly different direction.",
                    "label": 0
                },
                {
                    "sent": "Pretty soon they can't interbreed move new species.",
                    "label": 0
                },
                {
                    "sent": "All of this is lovely, but there's big butt for technology.",
                    "label": 0
                },
                {
                    "sent": "Doesn't work.",
                    "label": 0
                },
                {
                    "sent": "And this has been the embarrassment of attempts to do the evolution technology would say, Oh yeah, it's Darwin will waive the Darwinian warned.",
                    "label": 0
                },
                {
                    "sent": "Then you have to ask and people have asked.",
                    "label": 0
                },
                {
                    "sent": "This is fine, but did we get jet engines?",
                    "label": 0
                },
                {
                    "sent": "Say around 1928, nineteen, 36.",
                    "label": 0
                },
                {
                    "sent": "Have they come from the city's small differences in air?",
                    "label": 0
                },
                {
                    "sent": "Piston engine's.",
                    "label": 0
                },
                {
                    "sent": "The answer is of course not.",
                    "label": 0
                },
                {
                    "sent": "Did we get rid or from slight differences?",
                    "label": 0
                },
                {
                    "sent": "Deliberate or random, in radial circuits in in the 1930s?",
                    "label": 0
                },
                {
                    "sent": "Absolutely not, and you can go through did we got measures?",
                    "label": 0
                },
                {
                    "sent": "Did we could lasers?",
                    "label": 0
                },
                {
                    "sent": "Did we get the transistor through the accumulation?",
                    "label": 0
                },
                {
                    "sent": "Steady accumulation of small differences.",
                    "label": 0
                },
                {
                    "sent": "No way these are called radical inventions.",
                    "label": 0
                },
                {
                    "sent": "And yes, there's plenty of Darwinian evolution in technology.",
                    "label": 0
                },
                {
                    "sent": "Helicopters designs.",
                    "label": 0
                },
                {
                    "sent": "In fact, you don't get helicopters from small variations in airplanes.",
                    "label": 0
                },
                {
                    "sent": "Wouldn't want to get a helicopter that work that way.",
                    "label": 0
                },
                {
                    "sent": "It's not that some wings came loose and started to rotate by mistake or anything like that, so these radical inventions have come from some different process and that's the key thing, because they're the ones that set the stage really.",
                    "label": 0
                },
                {
                    "sent": "Fine.",
                    "label": 0
                },
                {
                    "sent": "The, but there is plenty of Darwinian evolution.",
                    "label": 0
                },
                {
                    "sent": "Once once the helicopters out there and people like Sikorsky have.",
                    "label": 0
                },
                {
                    "sent": "Cook that up.",
                    "label": 0
                },
                {
                    "sent": "There's variation in the designs and better ideas are indeed borrowed, so there is some Darwinian or plenty of Darwinian.",
                    "label": 0
                },
                {
                    "sent": "Evolution going on, but that's after a technology has been around and.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Invented so really what we're looking for is the equivalent of Darwin's question.",
                    "label": 0
                },
                {
                    "sent": "How do new radical technologies originate?",
                    "label": 0
                },
                {
                    "sent": "It's the origination of species.",
                    "label": 0
                },
                {
                    "sent": "But the species here are radically new technologies, and, colloquially, that's called invention.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What struck me early on.",
                    "label": 0
                },
                {
                    "sent": "And I remember actually early early on, because Stu Kauffman's here in the studio and I talked and chatted about this one summer long at the very news Santa Fe Institute in 1987 before all of you were born except Steve.",
                    "label": 0
                },
                {
                    "sent": "I'm kidding and you.",
                    "label": 0
                },
                {
                    "sent": "You're speaking from the heavens.",
                    "label": 0
                },
                {
                    "sent": "Anyway, technologies and this is the absolute key or combinations in CZ enough to.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Convince yourself here's the technology by I am dating this to about 1835.",
                    "label": 0
                },
                {
                    "sent": "I'm not entirely sure it could be 1833, but notice it's a combination of things that were around already.",
                    "label": 0
                },
                {
                    "sent": "These are coaches with rail, railway wheels, railroad wheels put on them.",
                    "label": 0
                },
                {
                    "sent": "The steam engine had been around, and locomotive steam locomotives had been run since.",
                    "label": 0
                },
                {
                    "sent": "1829 not as sophisticated as this, so that's why I'm guessing around 1835 or so.",
                    "label": 0
                },
                {
                    "sent": "And then you can look at other things with barrels to have the coal etc cranks, larger wheels, boiler, etc.",
                    "label": 0
                },
                {
                    "sent": "All these pieces have been around.",
                    "label": 0
                },
                {
                    "sent": "But it doesn't really matter.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Technologies are constructed from existing technologies and in many of the reviews of my book.",
                    "label": 0
                },
                {
                    "sent": "It says, well, that's an empirical observation.",
                    "label": 0
                },
                {
                    "sent": "It is not.",
                    "label": 0
                },
                {
                    "sent": "There's a good reason for it, and that is that any technology uses some physical affect or mental affect.",
                    "label": 0
                },
                {
                    "sent": "If you think of arithmetic or something.",
                    "label": 0
                },
                {
                    "sent": "Any technology is a means to a purpose.",
                    "label": 0
                },
                {
                    "sent": "To do that, it's using some physical phenomenon in the world.",
                    "label": 0
                },
                {
                    "sent": "OK, like the railways, using certain using the phenomenon that something rolling on a relatively flat surface is not undergoing much friction as it would if it was sliding.",
                    "label": 0
                },
                {
                    "sent": "So rolling on a hard surface reduces friction greatly, and.",
                    "label": 0
                },
                {
                    "sent": "Think of the technology is capturing that affecter that phenomenon.",
                    "label": 0
                },
                {
                    "sent": "But to make that effect fully work, you need other.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Effects are phenomena that are captured.",
                    "label": 0
                },
                {
                    "sent": "How are we going to power this thing?",
                    "label": 0
                },
                {
                    "sent": "Oh well.",
                    "label": 0
                },
                {
                    "sent": "We in the early days railways they used horses.",
                    "label": 0
                },
                {
                    "sent": "There's Stockton Darlington Express in 1825 was carriages, maybe just one carriage and it had a horse pulling it.",
                    "label": 0
                },
                {
                    "sent": "This is about 10 years later, I imagine so.",
                    "label": 0
                },
                {
                    "sent": "We need another effect in that is we need something to apply force to move this thing horizontally.",
                    "label": 0
                },
                {
                    "sent": "Well, why don't we use the Steam engine but a steam engine can't be moved so it needs to be on wheels, so we need something like boiler for the steam engine and said so.",
                    "label": 0
                },
                {
                    "sent": "Notice that a technology is absolutely a combination of many physical effects orchestrated or put together or word I would use as programmed.",
                    "label": 0
                },
                {
                    "sent": "To work together, so technology in that sense is not a trivial combination of other technologies.",
                    "label": 0
                },
                {
                    "sent": "It's a programming or putting together of many physical effects that work together to support each other.",
                    "label": 0
                },
                {
                    "sent": "Usually you can't use the best physical effect you need to manage it, you need control it that calls calls for other technologies, other physical effects.",
                    "label": 0
                },
                {
                    "sent": "I'm emphasizing all of this because it's completely key.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here's a hint that I very much like.",
                    "label": 0
                },
                {
                    "sent": "The hint came late in the game I was writing the final version before I saw this of my book, but I really love this.",
                    "label": 0
                },
                {
                    "sent": "William Fielding Ogburn, a sociologist 1922 and he was interested in why, say, Trobriand Islanders were not as advanced as at least in our terms as what it called modern technology.",
                    "label": 0
                },
                {
                    "sent": "He called these primitive technologies or.",
                    "label": 0
                },
                {
                    "sent": "Friends use was material culture, but notices.",
                    "label": 0
                },
                {
                    "sent": "He says if you can't read it at the back, it would seem that the larger the equipment of material culture greater than number of inventions.",
                    "label": 1
                },
                {
                    "sent": "Meaning if you've got a large base.",
                    "label": 0
                },
                {
                    "sent": "Of basic technologies, steam engines and so on, you can invent an awful lot.",
                    "label": 0
                },
                {
                    "sent": "The reason the Trobriand Islanders, and again this appears trivial but fundamental.",
                    "label": 0
                },
                {
                    "sent": "Have no trans or railway trains is that they don't have steam engines and they don't have the ability to produce steel or whatever is required to make rails.",
                    "label": 1
                },
                {
                    "sent": "So when the existing material culture is small.",
                    "label": 0
                },
                {
                    "sent": "The number of inventions is more limited than when the culture consists of knowledge of a variety of metals.",
                    "label": 1
                },
                {
                    "sent": "Chemicals use of steam, electricity and so basically is saying.",
                    "label": 0
                },
                {
                    "sent": "You can't really put things together if they don't exist in your culture.",
                    "label": 0
                },
                {
                    "sent": "And this is absolutely the key to the evolution of technology.",
                    "label": 0
                },
                {
                    "sent": "I think that.",
                    "label": 0
                },
                {
                    "sent": "Good old William Fielding Ogbourne was about this far away from having a theory of evolution for technology.",
                    "label": 0
                },
                {
                    "sent": "He didn't make the final links.",
                    "label": 0
                },
                {
                    "sent": "These are just remarks in his book, but there are other beautiful.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What I want to go into and dwell on for a bit is how invention really works.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's a process.",
                    "label": 0
                },
                {
                    "sent": "It's not that you throw technologies up in the air, or you combine them randomly.",
                    "label": 0
                },
                {
                    "sent": "It's process.",
                    "label": 0
                },
                {
                    "sent": "It's process.",
                    "label": 0
                },
                {
                    "sent": "Of linking some needs.",
                    "label": 0
                },
                {
                    "sent": "There might be a need Oh my God.",
                    "label": 0
                },
                {
                    "sent": "Bombers could come in the mid 1930s from the East.",
                    "label": 0
                },
                {
                    "sent": "If you're in England.",
                    "label": 0
                },
                {
                    "sent": "Potentially Germany, and they could toss bombs onto London.",
                    "label": 0
                },
                {
                    "sent": "So we need some way to detect these.",
                    "label": 0
                },
                {
                    "sent": "So to fulfill the need, you're basically looking for the idea of some effect, some physical effect that works for you.",
                    "label": 0
                },
                {
                    "sent": "And that physical effect doesn't work just like that.",
                    "label": 0
                },
                {
                    "sent": "Because you run into subproblems.",
                    "label": 0
                },
                {
                    "sent": "And so it usually poses quite severe problems.",
                    "label": 0
                },
                {
                    "sent": "And those problems you can solve, but they lead you to other subproblems, so they need the the idea of some physical effect.",
                    "label": 0
                },
                {
                    "sent": "So the process.",
                    "label": 0
                },
                {
                    "sent": "Of invention is recursive.",
                    "label": 0
                },
                {
                    "sent": "We're going up and down the ladder of solutions.",
                    "label": 0
                },
                {
                    "sent": "Yep, I could get if I could make this work.",
                    "label": 0
                },
                {
                    "sent": "I could make the purpose work, however, to get that to work I would need this and this other effect to work.",
                    "label": 0
                },
                {
                    "sent": "How would I do that?",
                    "label": 0
                },
                {
                    "sent": "Oh, I see how I could do that, but hang on to get this one to work I would need that and that and that to work.",
                    "label": 0
                },
                {
                    "sent": "So it's recursive.",
                    "label": 0
                },
                {
                    "sent": "It's a bit like solving Sudoku problem.",
                    "label": 0
                },
                {
                    "sent": "I think I could do this if this and this were true.",
                    "label": 0
                },
                {
                    "sent": "If that worked etc and you're going up and down or a curse of ladder all the time.",
                    "label": 0
                },
                {
                    "sent": "The result of that, of course, is a combination of things in the end.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I want to take an example.",
                    "label": 0
                },
                {
                    "sent": "I like this one very much.",
                    "label": 0
                },
                {
                    "sent": "Gary Starkweather, who is still with us 1972.",
                    "label": 0
                },
                {
                    "sent": "At Xerox Parc, which is where I've been working in the last 20 years, Silicon Valley, they invented the Ethernet, the laser printer, which is starkweather's.",
                    "label": 0
                },
                {
                    "sent": "What you see is what you get.",
                    "label": 0
                },
                {
                    "sent": "A word processing the modern interface that many of you are using as we speak.",
                    "label": 0
                },
                {
                    "sent": "For computers.",
                    "label": 0
                },
                {
                    "sent": "But Starkweather was.",
                    "label": 0
                },
                {
                    "sent": "Curious, but how do you print images on a computer from a computer?",
                    "label": 0
                },
                {
                    "sent": "And at that time there very large line printers are essentially like huge typewriters, and I can certainly remember this.",
                    "label": 0
                },
                {
                    "sent": "Stewart is not much younger.",
                    "label": 0
                },
                {
                    "sent": "Many of you will remember line printers get the data and you had to go through the computer room and your output would be waiting for you etc.",
                    "label": 0
                },
                {
                    "sent": "So Starkweather wanted to say, well, if I do photograph by diagrams by wanted different fonts, how would I print that?",
                    "label": 0
                },
                {
                    "sent": "He looked for number of effects, could have used a cathode Ray tube and maybe use that to burn an image.",
                    "label": 0
                },
                {
                    "sent": "You know, use a computer to direct.",
                    "label": 0
                },
                {
                    "sent": "Cathode Rays, like television screen, then burn some image onto photosensitive paper.",
                    "label": 0
                },
                {
                    "sent": "After a few tries like that, you come up with this.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Smarter idea and that was he could use the laser so the computer could direct a laser.",
                    "label": 0
                },
                {
                    "sent": "Which you could focus to a very, very fine degree.",
                    "label": 0
                },
                {
                    "sent": "And he could use the laser to what they called paint on a copier drum for laser scans across the copier drum paints the image, save photograph onto the lizard run.",
                    "label": 0
                },
                {
                    "sent": "The rest is just there ography.",
                    "label": 0
                },
                {
                    "sent": "Don't forget his working for Xerox Parc.",
                    "label": 0
                },
                {
                    "sent": "His background PhD was in lasers.",
                    "label": 0
                },
                {
                    "sent": "His Masters degree was in optics.",
                    "label": 0
                },
                {
                    "sent": "But that brought up subproblems, loads and loads of subproblems.",
                    "label": 0
                },
                {
                    "sent": "One of them was wouldn't the laser just burn its way through the copier drum, another one was when you workout how many times you have to switch the Liz or on and off.",
                    "label": 0
                },
                {
                    "sent": "If it's scanning one line and then another and another and the whole page has converted so many dots per inch, he reckoned that he'd have to switch the laser on and off in principle.",
                    "label": 0
                },
                {
                    "sent": "From the ones and zeros of Blacks and whites.",
                    "label": 0
                },
                {
                    "sent": "50 times sorry.",
                    "label": 0
                },
                {
                    "sent": "50 million times second 50 megahertz.",
                    "label": 0
                },
                {
                    "sent": "Nobody had done that with lasers before.",
                    "label": 0
                },
                {
                    "sent": "It have to move the laser very rapidly, but lasers in those days were huge things and sort of go yeah and then scan the next line in the next line at so many dots per inch.",
                    "label": 0
                },
                {
                    "sent": "Let's say 300 dots per inch, so you'd have to be able to scan across three several 1000 times per second.",
                    "label": 0
                },
                {
                    "sent": "Lasers or heavy.",
                    "label": 0
                },
                {
                    "sent": "How you gonna solve that?",
                    "label": 0
                },
                {
                    "sent": "He sold the the modulation thing the switching thing by.",
                    "label": 0
                },
                {
                    "sent": "Having a polarized filter that he could use a pizza electric circuit to switch on and off.",
                    "label": 0
                },
                {
                    "sent": "If that goes past you, that's in the Don't worry category.",
                    "label": 0
                },
                {
                    "sent": "I want to say how he's got the this particular problem, which.",
                    "label": 0
                },
                {
                    "sent": "This gorgeous solution for that one.",
                    "label": 0
                },
                {
                    "sent": "He said essentially it's smoke and mirrors, he said.",
                    "label": 0
                },
                {
                    "sent": "Why don't rather than move the laser?",
                    "label": 0
                },
                {
                    "sent": "I'm just going to have a mirror that scans the laser beam right across the page, much as a lighthouse mirror would scan the light beam right across the horizon and we'll switch it on and off with our modulating circuit.",
                    "label": 0
                },
                {
                    "sent": "There are further sub problems and using mirrors and lining up the faces and so on.",
                    "label": 0
                },
                {
                    "sent": "What I want you to notice is that this is sort of.",
                    "label": 0
                },
                {
                    "sent": "If I could do this, I if I could do such and such and the lower level I would achieve that.",
                    "label": 0
                },
                {
                    "sent": "But to do such and such at the lower level I would need this and to do that very often the kind of problem that we're dealing with in our minds now.",
                    "label": 0
                },
                {
                    "sent": "Oh my car is broken down.",
                    "label": 0
                },
                {
                    "sent": "OK, how do I get to work?",
                    "label": 0
                },
                {
                    "sent": "Well, I could go to the train but hang on I have no car to get to the train, so we're down one right?",
                    "label": 0
                },
                {
                    "sent": "I need someone to get me to the car, but who my gonna get?",
                    "label": 0
                },
                {
                    "sent": "So you're going up and down this.",
                    "label": 0
                },
                {
                    "sent": "Ladder all the time.",
                    "label": 0
                },
                {
                    "sent": "Here's what.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Come up with, this is an examples too nice to talk about early on if you remember.",
                    "label": 0
                },
                {
                    "sent": "Here's the mirror rotating with many sides.",
                    "label": 0
                },
                {
                    "sent": "Here's the laser.",
                    "label": 0
                },
                {
                    "sent": "Your computers controlling the laser, the switching device up here, the mirrors scanning across the page and all the rest is xerography, and there are probably thousands of parts.",
                    "label": 0
                },
                {
                    "sent": "It gets it up and running.",
                    "label": 0
                },
                {
                    "sent": "The folks at headquarters in their infinite wisdom said this is lovely.",
                    "label": 0
                },
                {
                    "sent": "It's beautiful, but we can't make any money out of this.",
                    "label": 0
                },
                {
                    "sent": "'cause lasers cost $50,000 forty years ago pargos and nobody is going to pay for that.",
                    "label": 0
                },
                {
                    "sent": "So Hewlett-Packard took it up.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I want to point out that there's not a lot more to invention than this, but I'm kind of giving you the guts of it if you're interested.",
                    "label": 0
                },
                {
                    "sent": "This is a paper of mine in research policy.",
                    "label": 0
                },
                {
                    "sent": "I think around 2007.",
                    "label": 0
                },
                {
                    "sent": "Structure of invention.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "But to summarize this bit.",
                    "label": 0
                },
                {
                    "sent": "Inventions rarely a process of finding what works for a purpose.",
                    "label": 0
                },
                {
                    "sent": "What's needed for a purpose.",
                    "label": 0
                },
                {
                    "sent": "In what already exists.",
                    "label": 0
                },
                {
                    "sent": "So think of it this way, I want to invent something by the huge box of Lego parts.",
                    "label": 0
                },
                {
                    "sent": "And I want to invent something that exists.",
                    "label": 0
                },
                {
                    "sent": "All I have is Lego parts or in the candle set or forgotten the American equivalent.",
                    "label": 0
                },
                {
                    "sent": "I'm going to look in my Lego set to see if I can put together parts that will solve the problem.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Going into what I think is really interesting, what we can really says that novel technologies these radically new technologies are constructed from existing technologies.",
                    "label": 0
                },
                {
                    "sent": "There are no exceptions to this, not even things like penicillin.",
                    "label": 0
                },
                {
                    "sent": "If you ask me afterwards.",
                    "label": 0
                },
                {
                    "sent": "And then these novel technologies be there.",
                    "label": 0
                },
                {
                    "sent": "The steam engine or railways or the laser or the transistor offer themselves as components.",
                    "label": 0
                },
                {
                    "sent": "Further building blocks for the construction of further technologies.",
                    "label": 0
                },
                {
                    "sent": "So you might start with.",
                    "label": 0
                },
                {
                    "sent": "Hundreds of fairly primitive Lego pieces in your collection, and then you find again and again.",
                    "label": 0
                },
                {
                    "sent": "You have some need and some combination of Lego pieces solves that, and then you find that need is coming up again and again so you don't want to have to put it together always.",
                    "label": 0
                },
                {
                    "sent": "So you take that combination, you stick in the often you fused together and that's a new type of peace and you throw that back in your Lego set.",
                    "label": 0
                },
                {
                    "sent": "I should also.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So just add this new phenomena or captured time to time.",
                    "label": 0
                },
                {
                    "sent": "How are they captured by existing technologies, X Rays or?",
                    "label": 0
                },
                {
                    "sent": "Use and captured via Crookes tubes, which are an earlier form of cathode Ray tube anyway.",
                    "label": 0
                },
                {
                    "sent": "And those offer themselves as compose.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "And this is where things I think.",
                    "label": 0
                },
                {
                    "sent": "Got mind blowing.",
                    "label": 0
                },
                {
                    "sent": "I'm saying this because this is a complexity crowd, so imagine just imagine that the collective of technology is a vast network.",
                    "label": 0
                },
                {
                    "sent": "The network connections are what parentid, what the steam engine.",
                    "label": 0
                },
                {
                    "sent": "The crank wheels rails they helped apparent railroads, or if you prefer.",
                    "label": 0
                },
                {
                    "sent": "The trialed vacuum tube which is made up of its own components plus other components where the parents.",
                    "label": 0
                },
                {
                    "sent": "Of the amplifier in 1912.",
                    "label": 0
                },
                {
                    "sent": "But the amplifier plus other components are the parents of the oscillator, but the oscillator and other components gave us radio transmitters and radio receivers etc.",
                    "label": 0
                },
                {
                    "sent": "Similarly for computation.",
                    "label": 0
                },
                {
                    "sent": "So think of this vast network of technologies millions or hundreds of thousands of technologies connected by links to their immediate parents.",
                    "label": 0
                },
                {
                    "sent": "And think of some of them is lit up with their still getting used today.",
                    "label": 0
                },
                {
                    "sent": "And some have gone dark.",
                    "label": 0
                },
                {
                    "sent": "They're no longer used.",
                    "label": 0
                },
                {
                    "sent": "Things like say.",
                    "label": 0
                },
                {
                    "sent": "Anvils we don't have too many blacksmiths around so that sort of technology exists, but it's not much used.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "New nodes are new technologies are created from time to time by French fresh combinations, fresh linkages and suddenly they light up foof.",
                    "label": 0
                },
                {
                    "sent": "Oh, we can do fill in the blank.",
                    "label": 0
                },
                {
                    "sent": "We can do some sort of virtual reality algorithm.",
                    "label": 0
                },
                {
                    "sent": "We can do this or that.",
                    "label": 0
                },
                {
                    "sent": "Don't forget all computer programs or computer applications are made this way.",
                    "label": 0
                },
                {
                    "sent": "In fact my breakthrough was to realize that is C program.",
                    "label": 0
                },
                {
                    "sent": "With men and different functions that were called is basically building itself up from sub functions, and it's a huge combination of functions or functionality's.",
                    "label": 0
                },
                {
                    "sent": "So if new nodes or new technologies are getting added to this huge network of connected technologies, it's ancestral.",
                    "label": 0
                },
                {
                    "sent": "Going back to the very earliest phenomena that were captured, things like, OK, I can use friction with a bow drill to create heat.",
                    "label": 0
                },
                {
                    "sent": "Then you have an Organism.",
                    "label": 0
                },
                {
                    "sent": "The collective of technology that's building out and building from itself, borrowing a term from.",
                    "label": 0
                },
                {
                    "sent": "Varela Maturana it's autopoietic.",
                    "label": 0
                },
                {
                    "sent": "Some people said sort of poetic, but it's autopoiesis is self producing self, not self organizing but self producing or creating itself.",
                    "label": 0
                },
                {
                    "sent": "And by the way we.",
                    "label": 0
                },
                {
                    "sent": "This I've got this far in just a few minutes, but already we have discovered an Organism this vast network that passes all the tests for being alive.",
                    "label": 0
                },
                {
                    "sent": "It's self organizing and it's auto poietic itself.",
                    "label": 0
                },
                {
                    "sent": "Creating new elements are building from the whole array of existing ones.",
                    "label": 0
                },
                {
                    "sent": "Complications building from simplicity 1950 you had the transistor.",
                    "label": 0
                },
                {
                    "sent": "Which is a solid state.",
                    "label": 0
                },
                {
                    "sent": "Piece of equipment.",
                    "label": 0
                },
                {
                    "sent": "Imagine what combinations of those with different types of circuits have done in any device you're now holding in your hand.",
                    "label": 0
                },
                {
                    "sent": "So complication builds out of simplicity.",
                    "label": 0
                },
                {
                    "sent": "New elements build from existing ones.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Technologies, if you like, form a huge chemistry of existing molecules that.",
                    "label": 0
                },
                {
                    "sent": "Synthesize every so often to give you new useful molecules.",
                    "label": 0
                },
                {
                    "sent": "In combination and those new useful molecules can be synthesized yet again with older ones to create something.",
                    "label": 0
                },
                {
                    "sent": "Yet newer.",
                    "label": 0
                },
                {
                    "sent": "I call this evolution combinatorial evolution.",
                    "label": 0
                },
                {
                    "sent": "I thought of different names for it, the much better name in English is combinatory.",
                    "label": 0
                },
                {
                    "sent": "Yeah, combinatory evolution.",
                    "label": 0
                },
                {
                    "sent": "I tried that on a number of people and people.",
                    "label": 0
                },
                {
                    "sent": "Said, Oh yes, combinatorially evolution.",
                    "label": 0
                },
                {
                    "sent": "So in the end I give in.",
                    "label": 0
                },
                {
                    "sent": "And but the word for something that's always combining in English is commendatori.",
                    "label": 0
                },
                {
                    "sent": "However, I'll go with the inevitable and colored combinatorial evolution.",
                    "label": 0
                },
                {
                    "sent": "Notice that this is not Darwinian, and I want to spend the rest of my time talking about.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is going much faster now, so this is suggesting an evolutionary algorithm.",
                    "label": 0
                },
                {
                    "sent": "You start with your basic Lego set of primitive objects.",
                    "label": 0
                },
                {
                    "sent": "And then you form combinations, maybe at random, or maybe not at random.",
                    "label": 0
                },
                {
                    "sent": "And it's a combination of these elements.",
                    "label": 0
                },
                {
                    "sent": "Turns out to be useful for your purpose.",
                    "label": 0
                },
                {
                    "sent": "You fuse it, gather you encapsulated, preserve it, and you toss that back in the Lego set, and so you add the new combination to the supers building block element.",
                    "label": 0
                },
                {
                    "sent": "You could ask me and say.",
                    "label": 0
                },
                {
                    "sent": "I don't disagree.",
                    "label": 0
                },
                {
                    "sent": "In fact, I buy the picture.",
                    "label": 0
                },
                {
                    "sent": "But where is it heading?",
                    "label": 0
                },
                {
                    "sent": "The answer is nowhere.",
                    "label": 0
                },
                {
                    "sent": "There's a nice no harness to this that you just things adding to things that do things.",
                    "label": 0
                },
                {
                    "sent": "I'm using Kaufman Esque language things that do things to things.",
                    "label": 0
                },
                {
                    "sent": "So could you get this to work?",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the computer, one of the first things I learned in Santa Fe Institute, we all desktop workstations, by the way or computers.",
                    "label": 0
                },
                {
                    "sent": "They weren't laptops then.",
                    "label": 0
                },
                {
                    "sent": "That much.",
                    "label": 0
                },
                {
                    "sent": "Could you get this to work on a computer?",
                    "label": 0
                },
                {
                    "sent": "It's pretty trivial to get Darwinian evolution small changes working away on your computer screen, and certainly we were very keen on doing this sort of thing and learning a lot about evolution visually.",
                    "label": 0
                },
                {
                    "sent": "The kind of thing that James Bailey was talking about earlier in the week here.",
                    "label": 0
                },
                {
                    "sent": "Visually seeing how Darwinian evolution works.",
                    "label": 0
                },
                {
                    "sent": "This other revolution by combination, could you get that to work on a computer as an experiment?",
                    "label": 0
                },
                {
                    "sent": "My immediate answer is no.",
                    "label": 0
                },
                {
                    "sent": "I mean, I thought about this.",
                    "label": 0
                },
                {
                    "sent": "I was working.",
                    "label": 0
                },
                {
                    "sent": "This was about.",
                    "label": 0
                },
                {
                    "sent": "12 years ago through.",
                    "label": 0
                },
                {
                    "sent": "Xerox Parc was here down the Hill a little bit was Fuji Xerox.",
                    "label": 0
                },
                {
                    "sent": "Palo Alto Lab, which was Fuji Xerox's version of Xerox Parc, which is a think tank.",
                    "label": 0
                },
                {
                    "sent": "And I was working for them and they said.",
                    "label": 0
                },
                {
                    "sent": "Would you do a project for us on complexity?",
                    "label": 0
                },
                {
                    "sent": "And I thought, oh wow, I thought of this combinatorial evolution algorithm.",
                    "label": 0
                },
                {
                    "sent": "Could I get that to work in a computer?",
                    "label": 0
                },
                {
                    "sent": "I said OK, no, this is just beyond anything I can do, but cause.",
                    "label": 0
                },
                {
                    "sent": "You know I can't get, say a jet engine on my computer, at least in principle and.",
                    "label": 0
                },
                {
                    "sent": "A hen house which is also technology for.",
                    "label": 0
                },
                {
                    "sent": "Housing hands and put the two together.",
                    "label": 0
                },
                {
                    "sent": "How would my computer know if that's going to work every time?",
                    "label": 0
                },
                {
                    "sent": "By the way, I thought of something that was ridiculous, like a jet engine, and the hen has the wags at Santa Fe.",
                    "label": 0
                },
                {
                    "sent": "Said, oh, but you could do that.",
                    "label": 0
                },
                {
                    "sent": "It would be useful and I'm so WHI.",
                    "label": 0
                },
                {
                    "sent": "Because.",
                    "label": 0
                },
                {
                    "sent": "Chickens need to be plucked and roasted, so you can anyway you set up the jet engine.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To do that, how would we do this eventually?",
                    "label": 0
                },
                {
                    "sent": "I had an idea and I work closely with Wolfgang Polak from ethics pal, Fuji Xerox, Palo Alto lab computer scientist and a really superb one.",
                    "label": 0
                },
                {
                    "sent": "And every time I come up with an idea, I couldn't see how to make it work computationally, but Pollock.",
                    "label": 0
                },
                {
                    "sent": "So here's here's the idea.",
                    "label": 0
                },
                {
                    "sent": "We create an artificial world in which technologies evolve indefinitely from previous ones.",
                    "label": 0
                },
                {
                    "sent": "So we allow the system create technologies in our artificial world by combining previous technologies according to the algorithm, that's not the best part of the idea, or technologies were going to be logic circuits that don't switch off at this stage.",
                    "label": 0
                },
                {
                    "sent": "Assume you don't know anything about logic circuits and trend.",
                    "label": 0
                },
                {
                    "sent": "As electrical engineer, I should know I've this was back in primitive days and I've long forgotten the good thing about two logic circuits.",
                    "label": 0
                },
                {
                    "sent": "Is if you wire them together, you get another logic circuit.",
                    "label": 0
                },
                {
                    "sent": "And the other good thing is that if you have any logic circuit design in front of you, you or the computer can tell exactly what it does.",
                    "label": 0
                },
                {
                    "sent": "So that solves all the problems we needed.",
                    "label": 0
                },
                {
                    "sent": "In our artificial world, within the machine now I'm waxing.",
                    "label": 0
                },
                {
                    "sent": "Complex at the moment.",
                    "label": 0
                },
                {
                    "sent": "We always think of agents so we're gonna have little green agents that green eyes shades.",
                    "label": 0
                },
                {
                    "sent": "There's nothing in this artificial world they want to do better than compute things so they're going to need logic circuits.",
                    "label": 0
                },
                {
                    "sent": "Why I don't know?",
                    "label": 0
                },
                {
                    "sent": "And So what we decide to do is have this world in which logic is needed.",
                    "label": 0
                },
                {
                    "sent": "But no logic circuits yet exist.",
                    "label": 0
                },
                {
                    "sent": "And they have a whole wish list of needs for logic circuits.",
                    "label": 0
                },
                {
                    "sent": "For some reason in this world, so we'd love to be able to compare binary digits that are 4 digits long.",
                    "label": 0
                },
                {
                    "sent": "See of there the same.",
                    "label": 0
                },
                {
                    "sent": "Oh, we'd love to have adders.",
                    "label": 0
                },
                {
                    "sent": "We'd love to get exclusive or circuits.",
                    "label": 0
                },
                {
                    "sent": "And and this is the cheating part, or at least the shortcut.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But we took we, we abolished, or agents early on, we said, that's a world that could evolve by itself.",
                    "label": 0
                },
                {
                    "sent": "We're going to shortcut that and just have a big list of 80 or 100 logic needs of for doing logic.",
                    "label": 0
                },
                {
                    "sent": "And we will just list them.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "I don't know if other people have done the filled out the the.",
                    "label": 0
                },
                {
                    "sent": "Working Agent World to do this but.",
                    "label": 0
                },
                {
                    "sent": "I admit that that's shortcutting.",
                    "label": 0
                },
                {
                    "sent": "The business of finding the particular circuits of would work for these little agents, though, was harder.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We would love to get say 4 bit equals 2 bit adders and so now explain a bit of that and we used our algorithm start from one primitive element happened to be an and gate or not and gate.",
                    "label": 0
                },
                {
                    "sent": "That's our basic Lego block.",
                    "label": 0
                },
                {
                    "sent": "That's the little yellow blocks A and we've got a big long wish list of needs.",
                    "label": 0
                },
                {
                    "sent": "We don't know if we'll find circuits that fulfill any of them and the start.",
                    "label": 0
                },
                {
                    "sent": "We've new circuits and then we're going to wire these.",
                    "label": 0
                },
                {
                    "sent": "What we do have the primitive elements together at random check of their fulfill any needs and if they do will.",
                    "label": 0
                },
                {
                    "sent": "Through, we will encapsulate that circuit, throw it back in the Lego block box for further combination.",
                    "label": 0
                },
                {
                    "sent": "OK, so we starting with some primitive elements we're starting the long list of.",
                    "label": 0
                },
                {
                    "sent": "Needs 4 circuits.",
                    "label": 0
                },
                {
                    "sent": "The circumstance yet exist, so we start to wire things together randomly.",
                    "label": 0
                },
                {
                    "sent": "Odvar Lego Box of primitive circuits if any needs are fulfilled on our list.",
                    "label": 0
                },
                {
                    "sent": "We record.",
                    "label": 0
                },
                {
                    "sent": "The particular combination that did it and then we'll give it a new name, will toss back in the Lego box, and so our building blocks might in.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Crease, so here's our primitive element and again, don't get too.",
                    "label": 0
                },
                {
                    "sent": "Worried if if this is kind of like?",
                    "label": 0
                },
                {
                    "sent": "Looking at some form of chemistry.",
                    "label": 0
                },
                {
                    "sent": "But for those of you who care, you know there's an input two inputs here, so I'd be X&Y, could be zero or one here 01 there and then that's telling you what you get out with each combinations of zeros and ones here that's zed or the Z that comes out.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "By chance early on or so, Wolfgang Polak takes the whole thing, programs it, which took several months of really hard work in his part.",
                    "label": 0
                },
                {
                    "sent": "Fix it all home.",
                    "label": 0
                },
                {
                    "sent": "Presses the return button.",
                    "label": 0
                },
                {
                    "sent": "And all kinds of creatures have gonna emerge, but we don't know in advance.",
                    "label": 0
                },
                {
                    "sent": "In fact, we don't know we'll get any creatures at all.",
                    "label": 0
                },
                {
                    "sent": "Here's one that came up fairly fast, so you can see we also allowed that we one of the inputs could be nailed down to a one that was always a one or a zero, and within a few hundreds of random circuits we get an AC circuit.",
                    "label": 0
                },
                {
                    "sent": "It's doing not logic.",
                    "label": 0
                },
                {
                    "sent": "If it's zero, gotta one here.",
                    "label": 0
                },
                {
                    "sent": "That's the one you get a 0 here, etc.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's another one.",
                    "label": 0
                },
                {
                    "sent": "Sorry, I'm going the wrong direction.",
                    "label": 0
                },
                {
                    "sent": "Here's one that does implies.",
                    "label": 0
                },
                {
                    "sent": "Here's one I don't know.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This dolls, but it was something on our list.",
                    "label": 0
                },
                {
                    "sent": "We called this one Tech 20.",
                    "label": 1
                },
                {
                    "sent": "Now we weren't supervising anything.",
                    "label": 0
                },
                {
                    "sent": "The machine just kept coming up with this.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One bit adder, a 2 bit adder but.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Notice the two bit adder, so you're adding X&Y and each one of these kind of two bits zeros or ones, and then on the Z part you have.",
                    "label": 0
                },
                {
                    "sent": "The output plus a carry.",
                    "label": 0
                },
                {
                    "sent": "Just like you know, if you're adding four and.",
                    "label": 0
                },
                {
                    "sent": "Seven will get a 1 + A carry digit, making it 11.",
                    "label": 0
                },
                {
                    "sent": "Notice the two bit adder randomly combines something that was.",
                    "label": 0
                },
                {
                    "sent": "Colorful ladder that takes care of the carry and then this bit is 1 bit adder so all of these have arisen from what exists and is being tossed back in the box as you go.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'll go faster.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "4 bit adder etc.",
                    "label": 0
                },
                {
                    "sent": "Created from a full adder and a three to three bit adders, but notice that this has been combined randomly, not connected with anything.",
                    "label": 0
                },
                {
                    "sent": "It's just sitting there doing nothing.",
                    "label": 0
                },
                {
                    "sent": "I think part of the algorithm took those things out if they weren't useful.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What do we get?",
                    "label": 0
                },
                {
                    "sent": "Imagine that we're lowering a big big net down into.",
                    "label": 0
                },
                {
                    "sent": "All these technologies and principle might exist if we knew how.",
                    "label": 0
                },
                {
                    "sent": "And we're getting at the end of quarter of a million steps, which took 20 hours at the time.",
                    "label": 0
                },
                {
                    "sent": "Again is about 10 years ago.",
                    "label": 0
                },
                {
                    "sent": "We managed to fish up in one particular instance or many instances, and eight way exclusive or four way and forbid equals many other circuits came up, simpler ones and an 8 bit adder and 8 bit adders.",
                    "label": 0
                },
                {
                    "sent": "Interesting.",
                    "label": 0
                },
                {
                    "sent": "It's just one of the many creatures that got created by the algorithm.",
                    "label": 0
                },
                {
                    "sent": "On this run, run it again.",
                    "label": 0
                },
                {
                    "sent": "You get different creatures.",
                    "label": 0
                },
                {
                    "sent": "8 bit others interesting.",
                    "label": 0
                },
                {
                    "sent": "For several reasons, an 8 bit adder.",
                    "label": 0
                },
                {
                    "sent": "Was what Hewlett-Packard used in 1974 to make a hand Calculator?",
                    "label": 0
                },
                {
                    "sent": "It was completely new.",
                    "label": 0
                },
                {
                    "sent": "You could hold it in your hand.",
                    "label": 0
                },
                {
                    "sent": "This replaced slide rules.",
                    "label": 0
                },
                {
                    "sent": "I don't see anybody with any nods of recognition, but I remember the wonders of Hewlett-Packard calculators, so saying digit X is 8 bits, ones and zeros.",
                    "label": 0
                },
                {
                    "sent": "Digit, why has 8 bits, ones and zeros the output in your little Hewlett-Packard screen as 8 bits, that Susie.",
                    "label": 0
                },
                {
                    "sent": "And then the carry if that's possible.",
                    "label": 0
                },
                {
                    "sent": "All done in binary notation.",
                    "label": 0
                },
                {
                    "sent": "So think back again, we start with one primitive Lego block.",
                    "label": 0
                },
                {
                    "sent": "We keep combining.",
                    "label": 0
                },
                {
                    "sent": "If things are useful, we throw, toss them back in the soup for further combination.",
                    "label": 0
                },
                {
                    "sent": "And lo and behold.",
                    "label": 0
                },
                {
                    "sent": "Given our wish list, we wind up with all kinds of exotic things, maybe 1520 or 30.",
                    "label": 0
                },
                {
                    "sent": "Useful circuits for these logic programs and some sophisticated ones.",
                    "label": 0
                },
                {
                    "sent": "Remember sitting on a plane on the way to Iceland.",
                    "label": 0
                },
                {
                    "sent": "I thought Pollock called me that morning saying, hey, one of the runs we got an 8 bit adder so wow.",
                    "label": 0
                },
                {
                    "sent": "And then I sat down on the plane and I thought, you know, how many trials would you have to do sort of randomly wiring circuits not with our algorithm?",
                    "label": 0
                },
                {
                    "sent": "Does it?",
                    "label": 0
                },
                {
                    "sent": "Random how many random circuits would?",
                    "label": 0
                },
                {
                    "sent": "Have 8 inputs of X8 inputs of Y.",
                    "label": 0
                },
                {
                    "sent": "Giving you different readings for the Z.",
                    "label": 0
                },
                {
                    "sent": "And I thought, yeah, Belot could be 10,000,000.",
                    "label": 0
                },
                {
                    "sent": "Maybe it could be 20,000,000.",
                    "label": 0
                },
                {
                    "sent": "In the stretch of imagination, that might be really large, could be a billion.",
                    "label": 0
                },
                {
                    "sent": "So I sat down and calculated it.",
                    "label": 0
                },
                {
                    "sent": "It's not a hard calculation, but here's what came up.",
                    "label": 0
                },
                {
                    "sent": "It's one of 10 to the power of 170 seven 1554.",
                    "label": 0
                },
                {
                    "sent": "Possible.",
                    "label": 0
                },
                {
                    "sent": "Binary circuits.",
                    "label": 0
                },
                {
                    "sent": "And if that's hard to envisage.",
                    "label": 0
                },
                {
                    "sent": "I I calculated if you wrote it down in a book with no spaces so you.",
                    "label": 0
                },
                {
                    "sent": "Calculated say using mathematical calculators, it's Pi formulas.",
                    "label": 0
                },
                {
                    "sent": "Would it take up half a page of a book?",
                    "label": 0
                },
                {
                    "sent": "No takes up 150 pages to write that number down.",
                    "label": 0
                },
                {
                    "sent": "It's a large number and Pollux machine found it in 1/4 of a million steps and wasn't even looking for it.",
                    "label": 0
                },
                {
                    "sent": "That was among several other things.",
                    "label": 0
                },
                {
                    "sent": "Or I can put this another way.",
                    "label": 0
                },
                {
                    "sent": "I'm an electrical engineer.",
                    "label": 0
                },
                {
                    "sent": "If someone had said to me and I did study digital circuitry.",
                    "label": 0
                },
                {
                    "sent": "Someone said you're an engineer design me an 8 bit adder.",
                    "label": 0
                },
                {
                    "sent": "I don't think I could do it.",
                    "label": 0
                },
                {
                    "sent": "I'd have to have gone to the library.",
                    "label": 0
                },
                {
                    "sent": "Have done tutorials, maybe thought for a month or two and finally I figure out how to design an 8 bit adder.",
                    "label": 0
                },
                {
                    "sent": "But this is the miraculous part.",
                    "label": 0
                },
                {
                    "sent": "I didn't do that.",
                    "label": 0
                },
                {
                    "sent": "I designed an algorithm that could design an 8 bit adder.",
                    "label": 0
                },
                {
                    "sent": "And for me, I find that significant.",
                    "label": 0
                },
                {
                    "sent": "I wouldn't call this artificial intelligence, but when I stated this way, this is doing something very, very very complicated in a stepwise manner.",
                    "label": 0
                },
                {
                    "sent": "Building up from simpler things.",
                    "label": 0
                },
                {
                    "sent": "This is the part that.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Gets very biological.",
                    "label": 0
                },
                {
                    "sent": "These complicated technologies require intermediate steps.",
                    "label": 0
                },
                {
                    "sent": "So we took out all the intermediate needs of simple circuits and more complicated circuits to see if we could get very fancy circuits coming up.",
                    "label": 0
                },
                {
                    "sent": "Absolutely not.",
                    "label": 0
                },
                {
                    "sent": "The stepping stones weren't there.",
                    "label": 0
                },
                {
                    "sent": "There's gorgeous paper by rich Lenski of Michigan State and some colleagues called the Evolutionary Oregon origin of complex Plex features.",
                    "label": 0
                },
                {
                    "sent": "Trying to do this is like asking something as complicated as the human eye.",
                    "label": 0
                },
                {
                    "sent": "To evolve without any intermediate steps, you know telling the difference between light and dark, we do need the intermediate steps after, but we got Cambrian.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Explosions.",
                    "label": 0
                },
                {
                    "sent": "But in different runs, different Cambrian explosion explosions.",
                    "label": 0
                },
                {
                    "sent": "Not much.",
                    "label": 0
                },
                {
                    "sent": "Not much, not much.",
                    "label": 0
                },
                {
                    "sent": "And then after 30,000 steps, maybe the appearance of a 2 bit adder or something.",
                    "label": 0
                },
                {
                    "sent": "But that's useful for more complicated things and then suddenly take off and all kinds of forms appearing fairly quickly within a few 100,000 steps.",
                    "label": 0
                },
                {
                    "sent": "After that.",
                    "label": 0
                },
                {
                    "sent": "Or 10s of thousands of steps.",
                    "label": 0
                },
                {
                    "sent": "So that's quite biological too.",
                    "label": 0
                },
                {
                    "sent": "They have.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Solutions history dependent if you run it in a different order, you get quite different things coming out and the components are quite different.",
                    "label": 0
                },
                {
                    "sent": "If we had discovered iron.",
                    "label": 0
                },
                {
                    "sent": "Know how to work with iron before bronze it would have been a different history if we had discovered the transistor before the triode.",
                    "label": 0
                },
                {
                    "sent": "Vacuum tube history would be different, so it's very history dependent.",
                    "label": 0
                },
                {
                    "sent": "There's trumpeter GAIL.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of destruction I don't have time to mention that, but notice we get sandpile.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Avalanches this is for the collapses and other technologies that are not used.",
                    "label": 0
                },
                {
                    "sent": "Perfect power Power law Steven I can show you afterwards, but and.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But I want to finish up here with some comments on evolution, biological evolution, Darwinian variation, and selection cumulation.",
                    "label": 0
                },
                {
                    "sent": "Steady accumulation as Darwin called of incremental changes.",
                    "label": 0
                },
                {
                    "sent": "But in the.",
                    "label": 0
                },
                {
                    "sent": "History of biological things.",
                    "label": 0
                },
                {
                    "sent": "The major transitions in evolution.",
                    "label": 0
                },
                {
                    "sent": "Those tend to be combinatorial.",
                    "label": 0
                },
                {
                    "sent": "The eukaryotic cells put together combinations of simpler things that were presumably bacteria.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Multicellular organisms and so on that's combinatorial evolution.",
                    "label": 0
                },
                {
                    "sent": "Technological evolution the big breakthroughs are the radically new technologies are put together and not randomly, of course, but they're put together from existing things.",
                    "label": 0
                },
                {
                    "sent": "That gives you a abrupt differences.",
                    "label": 0
                },
                {
                    "sent": "Suddenly the jet engine replaces the air piston engine very, very quickly itself, augmenting ourselves, creating.",
                    "label": 0
                },
                {
                    "sent": "The new things are added to the box, and Darwinian evolution exists.",
                    "label": 0
                },
                {
                    "sent": "Once you get an aircraft coming out, you get variations on that.",
                    "label": 0
                },
                {
                    "sent": "As we saw in the First World War.",
                    "label": 0
                },
                {
                    "sent": "I'm an aircraft buff and I love watch looking at these.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One who finished with some remarks on.",
                    "label": 0
                },
                {
                    "sent": "Focus not so much on technology, but on this algorithm for combinatorial evolution.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As long as I keep pointing our Darwin starts with the population, this is his algorithm produces variations, some mechanism he didn't understand at the time.",
                    "label": 0
                },
                {
                    "sent": "Darwin, by the way, got a lot of his ideas from talking to pigeon fanciers and cattle breeders, and notice the variations and then that the pigeon fanciers in the cattle breeders were exercising selection.",
                    "label": 0
                },
                {
                    "sent": "And reading Malthus he figured out oh wow, maybe there's pressure for nature to those new population produces further variations dot dot it diverges by the steady accumulation of differences.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": ", Tutorial Evolution is a different game.",
                    "label": 0
                },
                {
                    "sent": "Start with some primitive building blocks.",
                    "label": 0
                },
                {
                    "sent": "Make combinations.",
                    "label": 0
                },
                {
                    "sent": "Some of the combination is going to be useful.",
                    "label": 0
                },
                {
                    "sent": "Those become new building blocks and that's the building block.",
                    "label": 0
                },
                {
                    "sent": "The result is a library of functionality's.",
                    "label": 0
                },
                {
                    "sent": "This is exactly what happens when.",
                    "label": 0
                },
                {
                    "sent": "Programming designers.",
                    "label": 0
                },
                {
                    "sent": "Or cooking up a new language is a beautiful book by Bjarne Stroustrup.",
                    "label": 0
                },
                {
                    "sent": "I may be getting that wrong.",
                    "label": 0
                },
                {
                    "sent": "He's either Norwegian or Danish.",
                    "label": 0
                },
                {
                    "sent": "Who invented C++?",
                    "label": 0
                },
                {
                    "sent": "And he goes to a lot of trouble saying how do we select and put together the primitive?",
                    "label": 0
                },
                {
                    "sent": "Many micro programs or algorithms that are going to create the library algorithms.",
                    "label": 0
                },
                {
                    "sent": "So you type in, you want cosine of something pump.",
                    "label": 0
                },
                {
                    "sent": "It's using other sub algorithms.",
                    "label": 0
                },
                {
                    "sent": "And then you keep putting together.",
                    "label": 0
                },
                {
                    "sent": "And so the result is a chem.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "History if you like of new things coming up.",
                    "label": 0
                },
                {
                    "sent": "Where does this occur well?",
                    "label": 0
                },
                {
                    "sent": "It occurs in spades in mathematics.",
                    "label": 0
                },
                {
                    "sent": "No, not.",
                    "label": 0
                },
                {
                    "sent": "There's plenty pasting together of.",
                    "label": 0
                },
                {
                    "sent": "The elements of course, that I haven't emphasized much in mathematics.",
                    "label": 0
                },
                {
                    "sent": "What counts is really two things.",
                    "label": 0
                },
                {
                    "sent": "Structures that we give names to and theorem slash lemmas which are accepted statements about those structures and a new theorem or lemma is constructed.",
                    "label": 0
                },
                {
                    "sent": "By referencing previous theorems all way back to axles so the constructs are the same in mathematics, progress is think of the Fairmonts last theorem, proof by building upon previous theorems.",
                    "label": 0
                },
                {
                    "sent": "And goes forward in this way and it's creating basically a library if you like of structures and functions.",
                    "label": 0
                },
                {
                    "sent": "There is chemistries obviously whoops synthetic chemistries.",
                    "label": 0
                },
                {
                    "sent": "As I said a moment ago, programming libraries for programming languages, gene regulatory networks, it's easy to take one network and have it trigger part of another network, and then you suddenly have a much bigger regulatory network that can be used for other things in a natural way.",
                    "label": 0
                },
                {
                    "sent": "Collective physical cosmos.",
                    "label": 0
                },
                {
                    "sent": "And certainly people have mentioned this.",
                    "label": 0
                },
                {
                    "sent": "Here's my favorite quote on this.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's from Francois Jakab, the great molecular biologist.",
                    "label": 0
                },
                {
                    "sent": "In our universe, matter is arranged in the hierarchy of structures by successive integrations.",
                    "label": 0
                },
                {
                    "sent": "So the hierarchy of structures by so.",
                    "label": 0
                },
                {
                    "sent": "Particles come together to make atoms come together to make molecules with make gases which condense into solar systems and planets etc.",
                    "label": 0
                },
                {
                    "sent": "One thing built out of another, and the great diversity of vertebrates results from differences in the arrangement.",
                    "label": 0
                },
                {
                    "sent": "The number of distribution of these few building blocks.",
                    "label": 0
                },
                {
                    "sent": "He would probably now have said.",
                    "label": 0
                },
                {
                    "sent": "Proteins or even arrangements of genes or DNA.",
                    "label": 0
                },
                {
                    "sent": "We know that the basic library of genes is not large, and it's relatively shared by animals or creatures all way from flies to people, and it's different combinations and arrangements that are giving different organ organisms.",
                    "label": 0
                },
                {
                    "sent": "Will finishing.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This note.",
                    "label": 0
                },
                {
                    "sent": "An awful lot of this, Stuart.",
                    "label": 0
                },
                {
                    "sent": "Abuts or connects with your work, but when I was doing this.",
                    "label": 0
                },
                {
                    "sent": "In that paper I also mentioned this that the adjacent possible for this algorithm is much much larger.",
                    "label": 0
                },
                {
                    "sent": "Darwin's algorithm adjacent possible, which is Stuart's idea is basically saying where can I go next if I can make one little walk to the neighboring thing.",
                    "label": 0
                },
                {
                    "sent": "That's basically what Darwin say, small changes.",
                    "label": 0
                },
                {
                    "sent": "That's the adjacent possible, so the adjustment possible of all that we have.",
                    "label": 0
                },
                {
                    "sent": "In Darwin's theory, is a kind of thin layer surrounding what we already have.",
                    "label": 0
                },
                {
                    "sent": "We can only walk to what's immediately next to us.",
                    "label": 0
                },
                {
                    "sent": "With combinatorial evolution, the adjacent possible is much larger.",
                    "label": 0
                },
                {
                    "sent": "It's like the multiplicative thing that Steven was talking about you, you take.",
                    "label": 0
                },
                {
                    "sent": "You take the elements that go that are sitting around.",
                    "label": 0
                },
                {
                    "sent": "You have air piston engine for aircraft in 1928.",
                    "label": 0
                },
                {
                    "sent": "The new jet aircraft, which consists of compressors, turbines, combustion chambers etc.",
                    "label": 0
                },
                {
                    "sent": "Is part of the adjacent possible of what already exists, but is eons away from an air piston engine?",
                    "label": 0
                },
                {
                    "sent": "And last thought, I want to give you is that new things can be made if they are ordered.",
                    "label": 0
                },
                {
                    "sent": "Meaning that they are reachable in the suggestion possible from other ordered things.",
                    "label": 0
                },
                {
                    "sent": "We cooked up quite random truth tables for our experiments.",
                    "label": 0
                },
                {
                    "sent": "We couldn't reproduce them because they're not ordered.",
                    "label": 0
                },
                {
                    "sent": "The Lego sets you starting with something you put together something that's needed that's pretty ordered, and only if you can get other things on your list to be made out of those ordered things.",
                    "label": 0
                },
                {
                    "sent": "Can you reach them?",
                    "label": 0
                },
                {
                    "sent": "And that gives you an awful lot of order, and I speculate I don't know.",
                    "label": 0
                },
                {
                    "sent": "But this is just weird speculation.",
                    "label": 0
                },
                {
                    "sent": "Possibly that's why our world is so highly ordered that it's made up or constructed in successive layers by successive integrations.",
                    "label": 0
                },
                {
                    "sent": "From previously ordered things, if you want something at random.",
                    "label": 0
                },
                {
                    "sent": "You're not going to get it using this algorithm.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}