{
    "id": "2k5d3ibwjkzcm6iny6l55jnto7mdzga2",
    "title": "Opening",
    "info": {
        "author": [
            "Lora Aroyo, Department of Computer Science, Faculty of Sciences, Vrije Universiteit Amsterdam (VU)"
        ],
        "published": "June 30, 2010",
        "recorded": "June 2010",
        "category": [
            "Top->Events"
        ]
    },
    "url": "http://videolectures.net/eswc2010_aroyo_opening/",
    "segmentation": [
        [
            "Good morning everybody.",
            "Can you hear me?",
            "We would like to welcome you to the first day of the extended Semantic Web conference.",
            "Here are Gregorius Antonio and Eric Ivan and who are the PC chairs this year and I'm going to go through together.",
            "We're going to present a couple of slides about with statistics about this year's conference.",
            "The different events that we're going to have at the conference, and then we're going to continue today with the first invited speaker.",
            "An following will have the first research papers.",
            "So.",
            "So welcome once again this to start with."
        ],
        [
            "Some statistics about this year's participants.",
            "As you know, this year is the first time that we have the conference with different research tracks and also the name of the conference was changed to extend it conference and the idea behind was in order to really extend the conference and reach out to other fields as well.",
            "So it's important to see whether there was some.",
            "Growth of the conference.",
            "We don't know whether it will.",
            "It is because of the splitting in the tracks, but compared to last year, the current number of participants.",
            "We expect that today there will be some more people registering on site on site.",
            "We have about 315 participants, 45 countries, an 23 sponsors which on the average is bigger than what we have last year.",
            "Last year we had about 300 participants, 35 countries, and 15 sponsors, so we're quite happy this year that there is a much bigger interest from industry and other organizations to sponsor the event.",
            "The the spread of the countries and the people among the countries is almost the same as previous year.",
            "Germany wins the competition about the years with almost doubled.",
            "The number of people for the next country which is UK, so we have about 67 participants from Germany and about 37 participants from UK and then we have about a little bit above 20 from Austria from Italy, Spain, the Netherlands and so on.",
            "And that's about the same spread that you see.",
            "From pre."
        ],
        [
            "This year as well, so the spread of the countries didn't change.",
            "We have about 10% more people this year, which is always good to know that the conference is growing more countries involved from 35 to 45 and significantly amount of sponsors more than that."
        ],
        [
            "Previous year at this is the distribution across continents you can see as it used to be European semantic web.",
            "Still Europe is leading.",
            "Leading continent, although less than last year.",
            "With this year we have more America people from South and North America about the same number from Australia and a little bit more from Asia.",
            "So we hope that the extended version of the conference will keep on growing outside of the European continent as well."
        ],
        [
            "So this these are the 50 chairs you just sell them and Gregorius is going to show you some statistics about the papers that have been accepted in the research track.",
            "OK, thanks Laura and also welcome from me.",
            "Even more so be 'cause I'm a so to speak local person.",
            "Um?"
        ],
        [
            "OK, so these are the we had eight research trucks for the conference this year so social Web mobility website, sensor networks, web of data ontologies and reasoning service and software and semantic weapon use.",
            "We didn't get.",
            "We didn't have an equal."
        ],
        [
            "Distribution in submissions.",
            "So you see that some tracks attracted many more, attracted many more.",
            "Submissions than others, and you see if you look at the acceptance rate, which is at the right, you'll see that big difference is also there.",
            "So in organizing this conference, we didn't want to have an equal distribution of acceptance rate or anything like that.",
            "The idea was to try and engage with more research communities.",
            "Our stronger with research communities outside the core.",
            "Of semantic web, but on the other hand.",
            "So if we have many good papers in a track, percentage was higher and in some cases there was one case or where we had zero, so overall we got.",
            "We received 245 submissions and 2052 papers were accepted, which is an acceptance rate of a little bit over 20%."
        ],
        [
            "The other thing that I wanted to show you just so these are the countries from which we received submissions.",
            "So at least one author from country XY or Z.",
            "So you see that.",
            "You have the European countries which were slightly more than the rest of the world is.",
            "As far as authors coming from OK now slightly more, of course not.",
            "The in in numerical terms, because you may have got many more submissions for Germany or Italy for example, but still we have good representation from around the world for submissions and at least, well, I see India, Japan, US and.",
            "Venezuela and China have also authors of accepted papers at this conference, so that's from the research program at the moment and I'll pass on to Laura so that she can continue.",
            "OK.",
            "So I'll I wanna go."
        ],
        [
            "We'll walk you through some of the events that are going to happen at the conference, and some of the events that already happened.",
            "We are going to have four invited speaker this year.",
            "Today Noshir contractor is going to be the first one tomorrow.",
            "Vulcan Valstar is going to give the invited talk as people bringing perspectives to the semantic web from different communities.",
            "An during the conference dinner."
        ],
        [
            "Old age and Jamie is going to give the insiders view of the community Anne Schoenbeck offer at the last day of the conference is going to talk about the past, present and the future of costs."
        ],
        [
            "Um, we had the same quite a number of workshops this year.",
            "They were selected by Colleen, a bunch of and Nicola Hensie.",
            "We had 10 workshops with a significant amount of."
        ],
        [
            "Participants under 38 participants and this is more or less the distribution of participants.",
            "Among all the workshops you can see that most of them are, excuse me quite well visited so."
        ],
        [
            "So we have the same we saw with the tutorials as well which were selected by Unaff."
        ],
        [
            "Pencil in Algin Jamie we had nine tutorials, bought tutorials and workshops were larger amount than last year and as well the participants for them.",
            "So we had 81 participants participating in the 9 tutorials.",
            "And this is the distribution of participants among each of the tutorials.",
            "Interesting to see that both for workshops and tutorials there is a quite nice balance between new workshops and tutorials which have been successful previous years and again presented this year the conference."
        ],
        [
            "We had the fish this symposium again this year, organized by an atlantian hiner stukel Schmidt."
        ],
        [
            "There were, with a pretty tough acceptance rate of 30% for the PhD student papers.",
            "So out of the three 33 submitted, ten were accepted and you can have some statistics here.",
            "See some statistics about the different countries that were submitted and the countries that were accepted.",
            "Unfortunately, most of the countries that were accepted, one for Europe, so.",
            "A big amount, so no big amount, but the submissions from outside of Europe.",
            "Don't seem to have been accepted so much."
        ],
        [
            "Then we had posters and demos.",
            "Again tonight will be the posters poster, demo presentations session after the after the main conference tracks.",
            "Liliana a cobra.",
            "An Tatiana Suraci have organized this.",
            "We have posters which also include the PhD posters from the PhD Consortium and we have.",
            "So we have 32 posters, an 17 accepted demonstrations.",
            "These are always very exciting part of the conference.",
            "Looking at the current work in progress and also the work that has been successfully developed.",
            "In demonstrations."
        ],
        [
            "And then the panel, of course, is a key part of the conference which will be today after the research sessions.",
            "There will be one hour panel selected by Carlos Pedri Nachi on the topic of linked data.",
            "And where do we go?",
            "And what are where we now an?",
            "What where we going in the direction of linked data?",
            "So we have selected several panelists.",
            "Some of the invited speakers also on the panel.",
            "So please take a note of this today to come to the panel at 4:30."
        ],
        [
            "And.",
            "Next to the next to the research.",
            "Presentations, workshops and tutorials, we also find it important to give an overview.",
            "What is the status of the current European research projects this year they have been selected by Lyndon Nixon and Alexander Valor as last year.",
            "European projects matchmaking event was quite successful and useful.",
            "Consider it useful by the participants this year.",
            "Similar event is organized with presentations by 11 European projects."
        ],
        [
            "And we are very thankful to Yannis.",
            "I'm not sure I will be able to pronounce his.",
            "It's very easy at Yannis K, as he's known in my."
        ],
        [
            "In my email box he did a great job with the proceedings.",
            "This is one of the hardest tasks at the end of the conference preparation process.",
            "Thank you, honest for this.",
            "Valentina helped us with the publicity on various sites, mailing list, Facebook and Twitter.",
            "Alex Alex took care of all the financial part of the conference.",
            "Make sure that there is enough support for students that there is the conference registration.",
            "Stay accessible for the users and also that everything that's arranged here during the conference together with his team with Layla and Charlotte.",
            "They've done a great job.",
            "Making it possible that we are here for these days during the conference and on all these key as well."
        ],
        [
            "As did really outperformed himself this year in order to get the impressive amount of sponsors.",
            "So we have sponsors from Greece and from all over the world which sponsor various parts of the conference awards student grants.",
            "Video recording and so on.",
            "So thank you man, all is for making sure we can have enough income for the conference as well."
        ],
        [
            "And these are the.",
            "These are the things which will let you stay connected during the conference.",
            "You can of course Twitter as much as during the conference by using the Twitter, the SWC 2010 Twitter tag if you didn't join yet, use WC 2010, ten Facebook group or event.",
            "You can do it and you can post messages there too.",
            "And you can participate in the social experiments, the aerified, the experiments during the conference.",
            "Last year we've experienced experimented for first time with the life social semantics organized by the tag or a project.",
            "This year we're going to experience an improved version of this, and shortly here it is going to tell you a couple of words about it.",
            "We have a second new experiment which last year we saw.",
            "Short demonstration about it.",
            "This year we get the improved version as well.",
            "This is the FID kiosk which is to be found.",
            "Both of them are to be found here in the lobby.",
            "The Air Friday kiosk is connected to one of the verified the tax that you got when you registered.",
            "This is the flat one next to your badge.",
            "You can use it in order to exchange business cards outside in the installation, which is just outside this door and after the end of the conference bought badges are wanted back.",
            "So if you can please return them back.",
            "Before you leave the conference.",
            "This light was supposed to be my last light, so imagine you didn't see.",
            "We semantic web technologies coordinators."
        ],
        [
            "A part of so part of the organ organization of the social experiment is part of the Semantic Web technology.",
            "A coordination as well as.",
            "Having all the papers from the conference included in the dog Food RDF store, this is done by her little aniane.",
            "Martin SI cannot pronounce name, which is more.",
            "More so too many essences, it's after each other.",
            "And here it now is going to give you a short presentation on the life, social semantics and the Meanwhile I would like to wish you a pleasant time during the conference, I hope."
        ],
        [
            "It's inspiring.",
            "I hope you'll find papers which will give you new ideas for your own research, and I hope you'll have a good time during all the events.",
            "Thank you."
        ],
        [
            "Right?",
            "Let me just take this down so.",
            "So let me first say that I'm actually representing the.",
            "The magnificent team of life social semantics have been skipping lunches and dinners for the last few days trying to get this to work on time, which is their fault for leaving things at the last minute.",
            "But I'm not complaining.",
            "So what it is like.",
            "Social semantics.",
            "Is about combining RFID technology.",
            "Which social patterns have been using to track kind of social dynamics?",
            "And we're adding two more layers of information.",
            "One from semantics of what you publish, where you publish who you're working with and the other one is from your social networks.",
            "So we've last year was the first time we use it here right here at this conference.",
            "And then we had it at hypertext.",
            "And so this is the third time we do it.",
            "And while we're doing it again, well, we wanted to.",
            "Sorry for that time so we wanted to this is this is hazard.",
            "We wanted to have another short of the data so we had one from last year and we want to have another one.",
            "So now we could do some sort of.",
            "Study of the dynamics of the community.",
            "Evaluation of of the social relationships from one year on one year is not really a big gap, but it's better than nothing, so.",
            "For those who have registered last year, you have even more bigger responsibility to register again.",
            "And I think we already have over 100 people registering which is which is really nice.",
            "And how do you participate?",
            "You just need to go to the registration desk and pick your RFID tag.",
            "Then you go to the page.",
            "I'll show you in a minute.",
            "Then you go to this URL and all you have to do is just, well, it's.",
            "It's actually very easy.",
            "So what we focused this year for those of you have used this last year's website was really enough together very quickly.",
            "So this one is, you know, it's much neater.",
            "Voucher, one of the guys working on this.",
            "He just redesigned it all from scratch.",
            "All you have to do is go to this site there at the top.",
            "When you get your RFID, you'll get a piece of paper which shows you.",
            "Which shows you where it is.",
            "So just type in your information.",
            "Your RFID RFID badge number.",
            "So then otherwise you will just remain as a number, which is fine if you are too worried about privacy and people watching where you go then you could just remain as a number.",
            "And once you do that, the idea is that then you could.",
            "You will always remember that person that you've talked to at the conference, and once you went home, you forgot who that person was.",
            "So this will tell you all about those people.",
            "I was talking to Oscar last night and now I can, you know, it will give me some information.",
            "This is not going very well.",
            "It was switched off.",
            "Right, and so that's really all I wanted to say.",
            "Just make sure before you leave to take those and drop them back at the registration desk because we you know we have a very limited number of those out of ideas and we're getting less and less so.",
            "Just please make sure you drop them and you probably see those screens outside and.",
            "Please just feel free to use it.",
            "Come to our desk if you have any questions with the Tom.",
            "Please stop twittering and watch the talk.",
            "So thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good morning everybody.",
                    "label": 0
                },
                {
                    "sent": "Can you hear me?",
                    "label": 0
                },
                {
                    "sent": "We would like to welcome you to the first day of the extended Semantic Web conference.",
                    "label": 0
                },
                {
                    "sent": "Here are Gregorius Antonio and Eric Ivan and who are the PC chairs this year and I'm going to go through together.",
                    "label": 0
                },
                {
                    "sent": "We're going to present a couple of slides about with statistics about this year's conference.",
                    "label": 0
                },
                {
                    "sent": "The different events that we're going to have at the conference, and then we're going to continue today with the first invited speaker.",
                    "label": 0
                },
                {
                    "sent": "An following will have the first research papers.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So welcome once again this to start with.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some statistics about this year's participants.",
                    "label": 0
                },
                {
                    "sent": "As you know, this year is the first time that we have the conference with different research tracks and also the name of the conference was changed to extend it conference and the idea behind was in order to really extend the conference and reach out to other fields as well.",
                    "label": 0
                },
                {
                    "sent": "So it's important to see whether there was some.",
                    "label": 0
                },
                {
                    "sent": "Growth of the conference.",
                    "label": 0
                },
                {
                    "sent": "We don't know whether it will.",
                    "label": 0
                },
                {
                    "sent": "It is because of the splitting in the tracks, but compared to last year, the current number of participants.",
                    "label": 0
                },
                {
                    "sent": "We expect that today there will be some more people registering on site on site.",
                    "label": 0
                },
                {
                    "sent": "We have about 315 participants, 45 countries, an 23 sponsors which on the average is bigger than what we have last year.",
                    "label": 1
                },
                {
                    "sent": "Last year we had about 300 participants, 35 countries, and 15 sponsors, so we're quite happy this year that there is a much bigger interest from industry and other organizations to sponsor the event.",
                    "label": 0
                },
                {
                    "sent": "The the spread of the countries and the people among the countries is almost the same as previous year.",
                    "label": 0
                },
                {
                    "sent": "Germany wins the competition about the years with almost doubled.",
                    "label": 0
                },
                {
                    "sent": "The number of people for the next country which is UK, so we have about 67 participants from Germany and about 37 participants from UK and then we have about a little bit above 20 from Austria from Italy, Spain, the Netherlands and so on.",
                    "label": 0
                },
                {
                    "sent": "And that's about the same spread that you see.",
                    "label": 0
                },
                {
                    "sent": "From pre.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This year as well, so the spread of the countries didn't change.",
                    "label": 0
                },
                {
                    "sent": "We have about 10% more people this year, which is always good to know that the conference is growing more countries involved from 35 to 45 and significantly amount of sponsors more than that.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Previous year at this is the distribution across continents you can see as it used to be European semantic web.",
                    "label": 1
                },
                {
                    "sent": "Still Europe is leading.",
                    "label": 0
                },
                {
                    "sent": "Leading continent, although less than last year.",
                    "label": 1
                },
                {
                    "sent": "With this year we have more America people from South and North America about the same number from Australia and a little bit more from Asia.",
                    "label": 0
                },
                {
                    "sent": "So we hope that the extended version of the conference will keep on growing outside of the European continent as well.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this these are the 50 chairs you just sell them and Gregorius is going to show you some statistics about the papers that have been accepted in the research track.",
                    "label": 0
                },
                {
                    "sent": "OK, thanks Laura and also welcome from me.",
                    "label": 0
                },
                {
                    "sent": "Even more so be 'cause I'm a so to speak local person.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so these are the we had eight research trucks for the conference this year so social Web mobility website, sensor networks, web of data ontologies and reasoning service and software and semantic weapon use.",
                    "label": 1
                },
                {
                    "sent": "We didn't get.",
                    "label": 0
                },
                {
                    "sent": "We didn't have an equal.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Distribution in submissions.",
                    "label": 0
                },
                {
                    "sent": "So you see that some tracks attracted many more, attracted many more.",
                    "label": 0
                },
                {
                    "sent": "Submissions than others, and you see if you look at the acceptance rate, which is at the right, you'll see that big difference is also there.",
                    "label": 0
                },
                {
                    "sent": "So in organizing this conference, we didn't want to have an equal distribution of acceptance rate or anything like that.",
                    "label": 0
                },
                {
                    "sent": "The idea was to try and engage with more research communities.",
                    "label": 0
                },
                {
                    "sent": "Our stronger with research communities outside the core.",
                    "label": 0
                },
                {
                    "sent": "Of semantic web, but on the other hand.",
                    "label": 0
                },
                {
                    "sent": "So if we have many good papers in a track, percentage was higher and in some cases there was one case or where we had zero, so overall we got.",
                    "label": 0
                },
                {
                    "sent": "We received 245 submissions and 2052 papers were accepted, which is an acceptance rate of a little bit over 20%.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The other thing that I wanted to show you just so these are the countries from which we received submissions.",
                    "label": 0
                },
                {
                    "sent": "So at least one author from country XY or Z.",
                    "label": 0
                },
                {
                    "sent": "So you see that.",
                    "label": 0
                },
                {
                    "sent": "You have the European countries which were slightly more than the rest of the world is.",
                    "label": 0
                },
                {
                    "sent": "As far as authors coming from OK now slightly more, of course not.",
                    "label": 0
                },
                {
                    "sent": "The in in numerical terms, because you may have got many more submissions for Germany or Italy for example, but still we have good representation from around the world for submissions and at least, well, I see India, Japan, US and.",
                    "label": 0
                },
                {
                    "sent": "Venezuela and China have also authors of accepted papers at this conference, so that's from the research program at the moment and I'll pass on to Laura so that she can continue.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So I'll I wanna go.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We'll walk you through some of the events that are going to happen at the conference, and some of the events that already happened.",
                    "label": 0
                },
                {
                    "sent": "We are going to have four invited speaker this year.",
                    "label": 0
                },
                {
                    "sent": "Today Noshir contractor is going to be the first one tomorrow.",
                    "label": 0
                },
                {
                    "sent": "Vulcan Valstar is going to give the invited talk as people bringing perspectives to the semantic web from different communities.",
                    "label": 0
                },
                {
                    "sent": "An during the conference dinner.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Old age and Jamie is going to give the insiders view of the community Anne Schoenbeck offer at the last day of the conference is going to talk about the past, present and the future of costs.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um, we had the same quite a number of workshops this year.",
                    "label": 0
                },
                {
                    "sent": "They were selected by Colleen, a bunch of and Nicola Hensie.",
                    "label": 0
                },
                {
                    "sent": "We had 10 workshops with a significant amount of.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Participants under 38 participants and this is more or less the distribution of participants.",
                    "label": 0
                },
                {
                    "sent": "Among all the workshops you can see that most of them are, excuse me quite well visited so.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we have the same we saw with the tutorials as well which were selected by Unaff.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Pencil in Algin Jamie we had nine tutorials, bought tutorials and workshops were larger amount than last year and as well the participants for them.",
                    "label": 0
                },
                {
                    "sent": "So we had 81 participants participating in the 9 tutorials.",
                    "label": 1
                },
                {
                    "sent": "And this is the distribution of participants among each of the tutorials.",
                    "label": 0
                },
                {
                    "sent": "Interesting to see that both for workshops and tutorials there is a quite nice balance between new workshops and tutorials which have been successful previous years and again presented this year the conference.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We had the fish this symposium again this year, organized by an atlantian hiner stukel Schmidt.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There were, with a pretty tough acceptance rate of 30% for the PhD student papers.",
                    "label": 0
                },
                {
                    "sent": "So out of the three 33 submitted, ten were accepted and you can have some statistics here.",
                    "label": 0
                },
                {
                    "sent": "See some statistics about the different countries that were submitted and the countries that were accepted.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, most of the countries that were accepted, one for Europe, so.",
                    "label": 0
                },
                {
                    "sent": "A big amount, so no big amount, but the submissions from outside of Europe.",
                    "label": 0
                },
                {
                    "sent": "Don't seem to have been accepted so much.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then we had posters and demos.",
                    "label": 0
                },
                {
                    "sent": "Again tonight will be the posters poster, demo presentations session after the after the main conference tracks.",
                    "label": 0
                },
                {
                    "sent": "Liliana a cobra.",
                    "label": 0
                },
                {
                    "sent": "An Tatiana Suraci have organized this.",
                    "label": 0
                },
                {
                    "sent": "We have posters which also include the PhD posters from the PhD Consortium and we have.",
                    "label": 0
                },
                {
                    "sent": "So we have 32 posters, an 17 accepted demonstrations.",
                    "label": 0
                },
                {
                    "sent": "These are always very exciting part of the conference.",
                    "label": 0
                },
                {
                    "sent": "Looking at the current work in progress and also the work that has been successfully developed.",
                    "label": 0
                },
                {
                    "sent": "In demonstrations.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then the panel, of course, is a key part of the conference which will be today after the research sessions.",
                    "label": 0
                },
                {
                    "sent": "There will be one hour panel selected by Carlos Pedri Nachi on the topic of linked data.",
                    "label": 0
                },
                {
                    "sent": "And where do we go?",
                    "label": 0
                },
                {
                    "sent": "And what are where we now an?",
                    "label": 0
                },
                {
                    "sent": "What where we going in the direction of linked data?",
                    "label": 0
                },
                {
                    "sent": "So we have selected several panelists.",
                    "label": 0
                },
                {
                    "sent": "Some of the invited speakers also on the panel.",
                    "label": 0
                },
                {
                    "sent": "So please take a note of this today to come to the panel at 4:30.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Next to the next to the research.",
                    "label": 0
                },
                {
                    "sent": "Presentations, workshops and tutorials, we also find it important to give an overview.",
                    "label": 0
                },
                {
                    "sent": "What is the status of the current European research projects this year they have been selected by Lyndon Nixon and Alexander Valor as last year.",
                    "label": 1
                },
                {
                    "sent": "European projects matchmaking event was quite successful and useful.",
                    "label": 0
                },
                {
                    "sent": "Consider it useful by the participants this year.",
                    "label": 0
                },
                {
                    "sent": "Similar event is organized with presentations by 11 European projects.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we are very thankful to Yannis.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure I will be able to pronounce his.",
                    "label": 0
                },
                {
                    "sent": "It's very easy at Yannis K, as he's known in my.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In my email box he did a great job with the proceedings.",
                    "label": 0
                },
                {
                    "sent": "This is one of the hardest tasks at the end of the conference preparation process.",
                    "label": 0
                },
                {
                    "sent": "Thank you, honest for this.",
                    "label": 0
                },
                {
                    "sent": "Valentina helped us with the publicity on various sites, mailing list, Facebook and Twitter.",
                    "label": 0
                },
                {
                    "sent": "Alex Alex took care of all the financial part of the conference.",
                    "label": 1
                },
                {
                    "sent": "Make sure that there is enough support for students that there is the conference registration.",
                    "label": 0
                },
                {
                    "sent": "Stay accessible for the users and also that everything that's arranged here during the conference together with his team with Layla and Charlotte.",
                    "label": 0
                },
                {
                    "sent": "They've done a great job.",
                    "label": 0
                },
                {
                    "sent": "Making it possible that we are here for these days during the conference and on all these key as well.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As did really outperformed himself this year in order to get the impressive amount of sponsors.",
                    "label": 0
                },
                {
                    "sent": "So we have sponsors from Greece and from all over the world which sponsor various parts of the conference awards student grants.",
                    "label": 0
                },
                {
                    "sent": "Video recording and so on.",
                    "label": 0
                },
                {
                    "sent": "So thank you man, all is for making sure we can have enough income for the conference as well.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And these are the.",
                    "label": 0
                },
                {
                    "sent": "These are the things which will let you stay connected during the conference.",
                    "label": 0
                },
                {
                    "sent": "You can of course Twitter as much as during the conference by using the Twitter, the SWC 2010 Twitter tag if you didn't join yet, use WC 2010, ten Facebook group or event.",
                    "label": 0
                },
                {
                    "sent": "You can do it and you can post messages there too.",
                    "label": 0
                },
                {
                    "sent": "And you can participate in the social experiments, the aerified, the experiments during the conference.",
                    "label": 1
                },
                {
                    "sent": "Last year we've experienced experimented for first time with the life social semantics organized by the tag or a project.",
                    "label": 0
                },
                {
                    "sent": "This year we're going to experience an improved version of this, and shortly here it is going to tell you a couple of words about it.",
                    "label": 0
                },
                {
                    "sent": "We have a second new experiment which last year we saw.",
                    "label": 0
                },
                {
                    "sent": "Short demonstration about it.",
                    "label": 0
                },
                {
                    "sent": "This year we get the improved version as well.",
                    "label": 0
                },
                {
                    "sent": "This is the FID kiosk which is to be found.",
                    "label": 0
                },
                {
                    "sent": "Both of them are to be found here in the lobby.",
                    "label": 0
                },
                {
                    "sent": "The Air Friday kiosk is connected to one of the verified the tax that you got when you registered.",
                    "label": 0
                },
                {
                    "sent": "This is the flat one next to your badge.",
                    "label": 0
                },
                {
                    "sent": "You can use it in order to exchange business cards outside in the installation, which is just outside this door and after the end of the conference bought badges are wanted back.",
                    "label": 0
                },
                {
                    "sent": "So if you can please return them back.",
                    "label": 0
                },
                {
                    "sent": "Before you leave the conference.",
                    "label": 0
                },
                {
                    "sent": "This light was supposed to be my last light, so imagine you didn't see.",
                    "label": 0
                },
                {
                    "sent": "We semantic web technologies coordinators.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A part of so part of the organ organization of the social experiment is part of the Semantic Web technology.",
                    "label": 1
                },
                {
                    "sent": "A coordination as well as.",
                    "label": 0
                },
                {
                    "sent": "Having all the papers from the conference included in the dog Food RDF store, this is done by her little aniane.",
                    "label": 0
                },
                {
                    "sent": "Martin SI cannot pronounce name, which is more.",
                    "label": 0
                },
                {
                    "sent": "More so too many essences, it's after each other.",
                    "label": 0
                },
                {
                    "sent": "And here it now is going to give you a short presentation on the life, social semantics and the Meanwhile I would like to wish you a pleasant time during the conference, I hope.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's inspiring.",
                    "label": 0
                },
                {
                    "sent": "I hope you'll find papers which will give you new ideas for your own research, and I hope you'll have a good time during all the events.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "Let me just take this down so.",
                    "label": 0
                },
                {
                    "sent": "So let me first say that I'm actually representing the.",
                    "label": 0
                },
                {
                    "sent": "The magnificent team of life social semantics have been skipping lunches and dinners for the last few days trying to get this to work on time, which is their fault for leaving things at the last minute.",
                    "label": 0
                },
                {
                    "sent": "But I'm not complaining.",
                    "label": 0
                },
                {
                    "sent": "So what it is like.",
                    "label": 0
                },
                {
                    "sent": "Social semantics.",
                    "label": 0
                },
                {
                    "sent": "Is about combining RFID technology.",
                    "label": 0
                },
                {
                    "sent": "Which social patterns have been using to track kind of social dynamics?",
                    "label": 0
                },
                {
                    "sent": "And we're adding two more layers of information.",
                    "label": 0
                },
                {
                    "sent": "One from semantics of what you publish, where you publish who you're working with and the other one is from your social networks.",
                    "label": 0
                },
                {
                    "sent": "So we've last year was the first time we use it here right here at this conference.",
                    "label": 0
                },
                {
                    "sent": "And then we had it at hypertext.",
                    "label": 0
                },
                {
                    "sent": "And so this is the third time we do it.",
                    "label": 0
                },
                {
                    "sent": "And while we're doing it again, well, we wanted to.",
                    "label": 0
                },
                {
                    "sent": "Sorry for that time so we wanted to this is this is hazard.",
                    "label": 0
                },
                {
                    "sent": "We wanted to have another short of the data so we had one from last year and we want to have another one.",
                    "label": 0
                },
                {
                    "sent": "So now we could do some sort of.",
                    "label": 0
                },
                {
                    "sent": "Study of the dynamics of the community.",
                    "label": 0
                },
                {
                    "sent": "Evaluation of of the social relationships from one year on one year is not really a big gap, but it's better than nothing, so.",
                    "label": 0
                },
                {
                    "sent": "For those who have registered last year, you have even more bigger responsibility to register again.",
                    "label": 0
                },
                {
                    "sent": "And I think we already have over 100 people registering which is which is really nice.",
                    "label": 0
                },
                {
                    "sent": "And how do you participate?",
                    "label": 0
                },
                {
                    "sent": "You just need to go to the registration desk and pick your RFID tag.",
                    "label": 0
                },
                {
                    "sent": "Then you go to the page.",
                    "label": 0
                },
                {
                    "sent": "I'll show you in a minute.",
                    "label": 0
                },
                {
                    "sent": "Then you go to this URL and all you have to do is just, well, it's.",
                    "label": 0
                },
                {
                    "sent": "It's actually very easy.",
                    "label": 0
                },
                {
                    "sent": "So what we focused this year for those of you have used this last year's website was really enough together very quickly.",
                    "label": 0
                },
                {
                    "sent": "So this one is, you know, it's much neater.",
                    "label": 0
                },
                {
                    "sent": "Voucher, one of the guys working on this.",
                    "label": 0
                },
                {
                    "sent": "He just redesigned it all from scratch.",
                    "label": 0
                },
                {
                    "sent": "All you have to do is go to this site there at the top.",
                    "label": 0
                },
                {
                    "sent": "When you get your RFID, you'll get a piece of paper which shows you.",
                    "label": 0
                },
                {
                    "sent": "Which shows you where it is.",
                    "label": 0
                },
                {
                    "sent": "So just type in your information.",
                    "label": 0
                },
                {
                    "sent": "Your RFID RFID badge number.",
                    "label": 1
                },
                {
                    "sent": "So then otherwise you will just remain as a number, which is fine if you are too worried about privacy and people watching where you go then you could just remain as a number.",
                    "label": 0
                },
                {
                    "sent": "And once you do that, the idea is that then you could.",
                    "label": 0
                },
                {
                    "sent": "You will always remember that person that you've talked to at the conference, and once you went home, you forgot who that person was.",
                    "label": 0
                },
                {
                    "sent": "So this will tell you all about those people.",
                    "label": 0
                },
                {
                    "sent": "I was talking to Oscar last night and now I can, you know, it will give me some information.",
                    "label": 0
                },
                {
                    "sent": "This is not going very well.",
                    "label": 0
                },
                {
                    "sent": "It was switched off.",
                    "label": 0
                },
                {
                    "sent": "Right, and so that's really all I wanted to say.",
                    "label": 0
                },
                {
                    "sent": "Just make sure before you leave to take those and drop them back at the registration desk because we you know we have a very limited number of those out of ideas and we're getting less and less so.",
                    "label": 0
                },
                {
                    "sent": "Just please make sure you drop them and you probably see those screens outside and.",
                    "label": 0
                },
                {
                    "sent": "Please just feel free to use it.",
                    "label": 0
                },
                {
                    "sent": "Come to our desk if you have any questions with the Tom.",
                    "label": 0
                },
                {
                    "sent": "Please stop twittering and watch the talk.",
                    "label": 0
                },
                {
                    "sent": "So thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}