{
    "id": "2kpp5nxplopuxraxeo6ncx7uxhpb5l7d",
    "title": "Cost-Driven Ontology-Based Data Access",
    "info": {
        "author": [
            "Davide Lanti, Faculty of Computer Science, Free University of Bozen-Bolzano"
        ],
        "published": "Nov. 28, 2017",
        "recorded": "October 2017",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2017_lanti_data_access/",
    "segmentation": [
        [
            "So this talks about ontology based that access.",
            "So actually we have the usual setting where we have."
        ],
        [
            "Are you sure that rather than directly accessing the data source, it actually access a virtual graph and this strippers in this virtual graph are realized by mapping assertions that relate strippers to query results over the database.",
            "So this is the traditional obedience setting."
        ],
        [
            "And how query answering is carried out in this setting?",
            "Is that the users Parker query gets first written into a query that takes into account for reasoning.",
            "And then this gets further translated in process which is named unfolding.",
            "Into an SQL query which we also called unfolding that is then evaluated over the database relation instance and then this set of results is finally translated back into an answer for the original query issued by the user."
        ],
        [
            "Now here one important research problem is how to produce unfoldings that can be efficiently evaluated by relational database engines.",
            "And how did this currently tackled by current OBD systems is they apply us fixed set a static set of heuristics which do not take into account for data and what we explore within the store.",
            "Can you explode in our paper is how to take into account for data to select for the best.",
            "I'm forwarding alternative so in order to introduce our work, we first need to set up a bit of preliminaries about current solutions.",
            "So this is how."
        ],
        [
            "How a mapping looks like so we have high level mappings and lower level mappings.",
            "Low level mappings simply specify if you symbol out of queries over the database.",
            "So you can imagine this as a table.",
            "And high level mapping takes this view symbols and then they create tryparse out of these patterns here.",
            "This year ISA function that given instantiation of these attributes.",
            "For this view it will create your eyes according to some pattern one and the important bit for start optimization is that the UI one and you're right, two will never create the same UI so different patterns never create the same UI.",
            "So how?"
        ],
        [
            "So that's the unfolding work.",
            "So first we define how we really actually build this your eyes.",
            "So imagine that we use the concat query.",
            "So interest this notation, where one is your eye one and 1 four means where I want your eye for.",
            "And then we can imagine where we just simply pick the definition for Class A and the definition for property are we put them together into a union and they apply also this functions for construction of your eyes and then we make a join.",
            "Now you can imagine that this join is not very efficient actually, and because this is a join over subqueries.",
            "And thus."
        ],
        [
            "Top ten sessions.",
            "What they do is that first day transform this query into a new secure.",
            "And the second step is that look this joint is over incompatible your eyes and therefore this joint will always be empty.",
            "That's where we can remove such joints.",
            "But see this joints are quite of expensive because these are joints, not over database values, but rather Dover.",
            "This your eyes built out of this select concat function.",
            "So what we do is that OK, we push this concatenation the very last step.",
            "So as we are able to perform actual joints over database values and database values must be indexed under for this might be result in a more efficient joins.",
            "We call this using unfolding and this is currently the state of the art."
        ],
        [
            "Now you might have a hint already that this.",
            "Comes to a cost because the size of the unfolding is kind of exploding.",
            "Here imagine you have a scenario where you have a class into properties, each defined by 6 mappings.",
            "Now what will happen here for such a simple queries that, well, you have to simply apply what we said before and you will obtain 2 on my union of 216 conjunctive queries is quite huge.",
            "Now the question is how many of these conjunctive queries really bring in your results to the end user?",
            "Now one might have.",
            "OK, let's do this other way.",
            "This other thing.",
            "So we take the input query with techniques equivalent query, but we just partition this Bishop into two GPS and we calculate the unfolding and apply a join.",
            "So this is more complex unfolding.",
            "This now we have only 64 secures in total but still.",
            "Now you see that, well, these are efficient joins here because our database values.",
            "But this is not because this is over some credential and subqueries.",
            "So is there a tradeoff between redundancy and the algorithm that you can use to perform your joint?"
        ],
        [
            "And this is what this search for the trade off for exploiting the search space for alternatives.",
            "This is what is currently down in databases, right?",
            "Because we have their planning and cost model and they select just the best query execution plan and bursting in 2015 from France.",
            "He said why don't we apply this to be QA and then we what we do here is we take the log from boosting and all the literature.",
            "This time we try to apply this to OBD while becuase the context where you do not have mapping sessions just query answering over an ontology for those who do not know.",
            "Now when you do such an update."
        ],
        [
            "Mission you have to consider a number of aspects, like for instance how to conciliate these alternatives for unfolding with structure optimization.",
            "Also, how to exploit the input which is available to the audio system which is not just the data instance, but it's also mappings and alagie queries.",
            "And the this input since it has more components, it will result in a more complex search space modor.",
            "So this inputs kind of a complex object already compiled.",
            "Each component input interacts with the other, like what is the interaction between mappings and ontology?",
            "And how does this affect my search space?",
            "So these are all aspects we addressed in the paper and here in this talk I will focus on this one and the second one."
        ],
        [
            "Now what we collect.",
            "So what can we?",
            "Mostly six can we use to select the best unfolding.",
            "So imagine we have a mapping where the final Pro TP and we use the same of you symbol vote to define this property.",
            "Now what we actually collect as first artistic is the number of distinct apples that we have over this view.",
            "Then we collect the number of distinct apples that we have on the projector projection for the attributes that are used to build the domain.",
            "Of the property and we do the same for the range of the property.",
            "And then in case we have another mappings, another mapping that uses the same UI template, well, what does it mean?",
            "It means that these two mappings might build the same UI, so we would like to know what is the percentage of shared your eyes between these two mapping.",
            "So how many years do they really share?",
            "And this is captured by this projection here.",
            "So we take the intersection of the projections over the two views defining the two different mappings.",
            "Now."
        ],
        [
            "How do we use this statistics?",
            "So many of you might have recognized this formula.",
            "This is the classical formula for cardiologist dimension of the result set of uh, join.",
            "When you have assumptions of uniformity and independence, and actually other assumptions usually.",
            "And here is where we use our statistics.",
            "Say the word statistics and stress it, because actually what we will find.",
            "Another basis is here you would find usually estimations for these values, whereas in our setting what we really want to provide this to provide the exact numbers WHI, because actually with the mappings you can really do this search for these statistics offline before the query answering phase.",
            "And these are the assumptions that we maintain for this estimation.",
            "And OK then we expand this form."
        ],
        [
            "Now to the general case of joints, which is not really important and.",
            "What is important is that then we use this cardinality estimation formula.",
            "As an input to the cost model and it is really just a standard cost model for you, secure Senju skews.",
            "The only interesting thing.",
            "Or maybe you can say is different, is that we really say that this join.",
            "Over these fragments that we have there in their funding, so the joints over this you sick you unfoldings they must be expensive joints and this is maybe the so the the interesting bit of out of this cost model."
        ],
        [
            "Now.",
            "We performed an evaluation.",
            "What did we evaluate first?",
            "So first was to see OK. Is this tradeoff really there?",
            "I mean, we intuitively we can think that.",
            "You have a tradeoff between redundancies and indexes, but we don't really know whether it's really the case in practice and and also whether this OK it can theoretically happen.",
            "But also if whether it happens in some application.",
            "And so in the first experiment, we compared two queries which just the join over three properties over this variable X and this tree properties.",
            "These are templates of actual sparkle queries, and this template is associated with different parameters.",
            "So with respect to the number of mappings that define the property from one to six."
        ],
        [
            "The number of riduna mappings were by Rihanna mappings.",
            "I mean mappings that do not bring in new assertions for the property.",
            "And the joint selectivity.",
            "So this is activity of the joint over this variable X.",
            "Now we respect to this.",
            "Is there a tradeoff?",
            "And yes, there is so."
        ],
        [
            "Yeah, we have in blue the use traditional music unfolding and blue means that the user queue is better.",
            "So here when we have any number of mappings usually perform some exception.",
            "And there is no redundancy then you think you really performs better, but as long as the redundancy starts to kick in then the form where you have less unions, it's actually more.",
            "More efficient, it actually gets more and more efficient.",
            "Now, so this answer, the first thing is there a tradeoff and the second question is are we able to capture this trade off?",
            "So the answer is this so."
        ],
        [
            "And on top you can see our cost estimation when compared to the actual evaluation time for the query.",
            "The blue would be using Q and the red will be Geo secure.",
            "Now you see that our cost model can really kind of estimate the actual evaluation times.",
            "Pretty good for both cases, but if we just use the Postgres cost model it does not really work well so."
        ],
        [
            "Specially for juicy Q we see very very very weird numbers.",
            "And actually, what is the reason for this?",
            "So the reason is that Postgres cannot really estimate the redundancy because it doesn't have available live formation that we have with the mappings there.",
            "And the software you secure cardiologist mention this is still quite good.",
            "I mean, it's still other estimates up to I don't know 30.",
            "Four times the actual size of result for the query in cases as you see cube, so I still another estimation, but it's not that tremendous.",
            "But in case of a juicy kill, the things get totally messy.",
            "Like we can have situations where Postgres overestimates the actual cardinality of like 200,000 times.",
            "So you see that we cannot really use the Postgres courageous summation and cost model of Postgres to really differentiate which is the best alternative because the car destination in first place is not reliable.",
            "In the second experiment, instead is OK.",
            "Here we have seen what is the trend and how this can respect to the parameters of redundancy and selectivity for joints."
        ],
        [
            "The other way the other OK this activity."
        ],
        [
            "In this experiment we say, OK, that's this tradeoff.",
            "Show show in some real world setting.",
            "So this benchmark, which have been we have been using for a long time now.",
            "We try to reproduce real world scenario.",
            "Real World application of OH BDA and what your services that we can obtain orders of magnitude improvement in terms of query execution times for if we for some queries if we use Jessica, this is actually the.",
            "Among the most difficult queries from the benchmark, and yeah so.",
            "What did we do in this work?"
        ],
        [
            "So first the main thing is that we study how to find the most efficient affording over user query.",
            "To do so we introduce a space of unfolding alternatives that I really did not dig into this presentations.",
            "But if your interest they are all in the paper and then we define struct optimizations for this new alternatives and then we device a cost model to search for the best one.",
            "Our empirical evaluation showed that the alternatives can be better and.",
            "That the device cost model is able to discriminate when these alternatives can be better or where they aren't better.",
            "As a future work well, there is much work to do.",
            "This is just the first work of cost.",
            "Trying to integrate cost models an obvious, so the first thing is to how to integrate this with semantic optimization.",
            "And also, are there more unfolding alternatives that we can use?",
            "And also, how can we use more?",
            "Say like distributions of data rather than relying over the uniformity assumption as we have done in this work.",
            "This is all things that we keep for future work.",
            "So thanks for the attention."
        ],
        [
            "Besides post Chris, did you test anything else?",
            "No, actually not be cause yeah, we don't have the licenses for commercial stores and for my SQL the only join you have is double Nest look join.",
            "That actually is not really interesting, right?",
            "It's quadratic is quite expensive.",
            "Join anyway?",
            "Yeah, so so.",
            "Couple things, if I understand it correctly, the you have these redundancy mappings because they're not going to return anything, right?",
            "So you can eliminate them.",
            "They are the these map that you said that the redundant is because they're not going to return anything, so you don't have to run those queries that have those mappings.",
            "Now we don't actually remove the mappings.",
            "The map central animal.",
            "We don't remove them, it's just that the way that you unfold things make it so that the impact of this redundant answers in the mappings do not really hit the correct solution times so much as it do, as this does in the UC case.",
            "This is the because it seems to me I know.",
            "Oracle SQL Server has something called detection of unsatisfiable conditions.",
            "That's one thing that I think that would already kind of do.",
            "This type of work.",
            "An Oracle has predicate joint pushdown which are able to do the joins with views and we have a union of 'em, so that's why my curiosity is, how does these results effect when you talk to a commercial store that has all these types of.",
            "This is a very interesting thing that actually we should really consider as future work, and I thank you for the pointer animal.",
            "As you can imagine, we've already tested all these and alter app and we know that SQL Server and Oracle and DB2 does this very well.",
            "That is very well OK. Good thanks, thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this talks about ontology based that access.",
                    "label": 0
                },
                {
                    "sent": "So actually we have the usual setting where we have.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Are you sure that rather than directly accessing the data source, it actually access a virtual graph and this strippers in this virtual graph are realized by mapping assertions that relate strippers to query results over the database.",
                    "label": 0
                },
                {
                    "sent": "So this is the traditional obedience setting.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And how query answering is carried out in this setting?",
                    "label": 0
                },
                {
                    "sent": "Is that the users Parker query gets first written into a query that takes into account for reasoning.",
                    "label": 0
                },
                {
                    "sent": "And then this gets further translated in process which is named unfolding.",
                    "label": 0
                },
                {
                    "sent": "Into an SQL query which we also called unfolding that is then evaluated over the database relation instance and then this set of results is finally translated back into an answer for the original query issued by the user.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now here one important research problem is how to produce unfoldings that can be efficiently evaluated by relational database engines.",
                    "label": 0
                },
                {
                    "sent": "And how did this currently tackled by current OBD systems is they apply us fixed set a static set of heuristics which do not take into account for data and what we explore within the store.",
                    "label": 0
                },
                {
                    "sent": "Can you explode in our paper is how to take into account for data to select for the best.",
                    "label": 0
                },
                {
                    "sent": "I'm forwarding alternative so in order to introduce our work, we first need to set up a bit of preliminaries about current solutions.",
                    "label": 0
                },
                {
                    "sent": "So this is how.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How a mapping looks like so we have high level mappings and lower level mappings.",
                    "label": 0
                },
                {
                    "sent": "Low level mappings simply specify if you symbol out of queries over the database.",
                    "label": 0
                },
                {
                    "sent": "So you can imagine this as a table.",
                    "label": 0
                },
                {
                    "sent": "And high level mapping takes this view symbols and then they create tryparse out of these patterns here.",
                    "label": 0
                },
                {
                    "sent": "This year ISA function that given instantiation of these attributes.",
                    "label": 0
                },
                {
                    "sent": "For this view it will create your eyes according to some pattern one and the important bit for start optimization is that the UI one and you're right, two will never create the same UI so different patterns never create the same UI.",
                    "label": 0
                },
                {
                    "sent": "So how?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's the unfolding work.",
                    "label": 0
                },
                {
                    "sent": "So first we define how we really actually build this your eyes.",
                    "label": 0
                },
                {
                    "sent": "So imagine that we use the concat query.",
                    "label": 0
                },
                {
                    "sent": "So interest this notation, where one is your eye one and 1 four means where I want your eye for.",
                    "label": 0
                },
                {
                    "sent": "And then we can imagine where we just simply pick the definition for Class A and the definition for property are we put them together into a union and they apply also this functions for construction of your eyes and then we make a join.",
                    "label": 0
                },
                {
                    "sent": "Now you can imagine that this join is not very efficient actually, and because this is a join over subqueries.",
                    "label": 0
                },
                {
                    "sent": "And thus.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Top ten sessions.",
                    "label": 0
                },
                {
                    "sent": "What they do is that first day transform this query into a new secure.",
                    "label": 0
                },
                {
                    "sent": "And the second step is that look this joint is over incompatible your eyes and therefore this joint will always be empty.",
                    "label": 0
                },
                {
                    "sent": "That's where we can remove such joints.",
                    "label": 0
                },
                {
                    "sent": "But see this joints are quite of expensive because these are joints, not over database values, but rather Dover.",
                    "label": 0
                },
                {
                    "sent": "This your eyes built out of this select concat function.",
                    "label": 0
                },
                {
                    "sent": "So what we do is that OK, we push this concatenation the very last step.",
                    "label": 0
                },
                {
                    "sent": "So as we are able to perform actual joints over database values and database values must be indexed under for this might be result in a more efficient joins.",
                    "label": 0
                },
                {
                    "sent": "We call this using unfolding and this is currently the state of the art.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now you might have a hint already that this.",
                    "label": 0
                },
                {
                    "sent": "Comes to a cost because the size of the unfolding is kind of exploding.",
                    "label": 0
                },
                {
                    "sent": "Here imagine you have a scenario where you have a class into properties, each defined by 6 mappings.",
                    "label": 0
                },
                {
                    "sent": "Now what will happen here for such a simple queries that, well, you have to simply apply what we said before and you will obtain 2 on my union of 216 conjunctive queries is quite huge.",
                    "label": 0
                },
                {
                    "sent": "Now the question is how many of these conjunctive queries really bring in your results to the end user?",
                    "label": 0
                },
                {
                    "sent": "Now one might have.",
                    "label": 0
                },
                {
                    "sent": "OK, let's do this other way.",
                    "label": 0
                },
                {
                    "sent": "This other thing.",
                    "label": 0
                },
                {
                    "sent": "So we take the input query with techniques equivalent query, but we just partition this Bishop into two GPS and we calculate the unfolding and apply a join.",
                    "label": 0
                },
                {
                    "sent": "So this is more complex unfolding.",
                    "label": 0
                },
                {
                    "sent": "This now we have only 64 secures in total but still.",
                    "label": 0
                },
                {
                    "sent": "Now you see that, well, these are efficient joins here because our database values.",
                    "label": 0
                },
                {
                    "sent": "But this is not because this is over some credential and subqueries.",
                    "label": 0
                },
                {
                    "sent": "So is there a tradeoff between redundancy and the algorithm that you can use to perform your joint?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is what this search for the trade off for exploiting the search space for alternatives.",
                    "label": 1
                },
                {
                    "sent": "This is what is currently down in databases, right?",
                    "label": 1
                },
                {
                    "sent": "Because we have their planning and cost model and they select just the best query execution plan and bursting in 2015 from France.",
                    "label": 0
                },
                {
                    "sent": "He said why don't we apply this to be QA and then we what we do here is we take the log from boosting and all the literature.",
                    "label": 0
                },
                {
                    "sent": "This time we try to apply this to OBD while becuase the context where you do not have mapping sessions just query answering over an ontology for those who do not know.",
                    "label": 0
                },
                {
                    "sent": "Now when you do such an update.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Mission you have to consider a number of aspects, like for instance how to conciliate these alternatives for unfolding with structure optimization.",
                    "label": 0
                },
                {
                    "sent": "Also, how to exploit the input which is available to the audio system which is not just the data instance, but it's also mappings and alagie queries.",
                    "label": 0
                },
                {
                    "sent": "And the this input since it has more components, it will result in a more complex search space modor.",
                    "label": 1
                },
                {
                    "sent": "So this inputs kind of a complex object already compiled.",
                    "label": 0
                },
                {
                    "sent": "Each component input interacts with the other, like what is the interaction between mappings and ontology?",
                    "label": 1
                },
                {
                    "sent": "And how does this affect my search space?",
                    "label": 0
                },
                {
                    "sent": "So these are all aspects we addressed in the paper and here in this talk I will focus on this one and the second one.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now what we collect.",
                    "label": 0
                },
                {
                    "sent": "So what can we?",
                    "label": 0
                },
                {
                    "sent": "Mostly six can we use to select the best unfolding.",
                    "label": 0
                },
                {
                    "sent": "So imagine we have a mapping where the final Pro TP and we use the same of you symbol vote to define this property.",
                    "label": 0
                },
                {
                    "sent": "Now what we actually collect as first artistic is the number of distinct apples that we have over this view.",
                    "label": 0
                },
                {
                    "sent": "Then we collect the number of distinct apples that we have on the projector projection for the attributes that are used to build the domain.",
                    "label": 0
                },
                {
                    "sent": "Of the property and we do the same for the range of the property.",
                    "label": 0
                },
                {
                    "sent": "And then in case we have another mappings, another mapping that uses the same UI template, well, what does it mean?",
                    "label": 0
                },
                {
                    "sent": "It means that these two mappings might build the same UI, so we would like to know what is the percentage of shared your eyes between these two mapping.",
                    "label": 0
                },
                {
                    "sent": "So how many years do they really share?",
                    "label": 0
                },
                {
                    "sent": "And this is captured by this projection here.",
                    "label": 0
                },
                {
                    "sent": "So we take the intersection of the projections over the two views defining the two different mappings.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How do we use this statistics?",
                    "label": 0
                },
                {
                    "sent": "So many of you might have recognized this formula.",
                    "label": 0
                },
                {
                    "sent": "This is the classical formula for cardiologist dimension of the result set of uh, join.",
                    "label": 0
                },
                {
                    "sent": "When you have assumptions of uniformity and independence, and actually other assumptions usually.",
                    "label": 0
                },
                {
                    "sent": "And here is where we use our statistics.",
                    "label": 0
                },
                {
                    "sent": "Say the word statistics and stress it, because actually what we will find.",
                    "label": 0
                },
                {
                    "sent": "Another basis is here you would find usually estimations for these values, whereas in our setting what we really want to provide this to provide the exact numbers WHI, because actually with the mappings you can really do this search for these statistics offline before the query answering phase.",
                    "label": 0
                },
                {
                    "sent": "And these are the assumptions that we maintain for this estimation.",
                    "label": 0
                },
                {
                    "sent": "And OK then we expand this form.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now to the general case of joints, which is not really important and.",
                    "label": 0
                },
                {
                    "sent": "What is important is that then we use this cardinality estimation formula.",
                    "label": 0
                },
                {
                    "sent": "As an input to the cost model and it is really just a standard cost model for you, secure Senju skews.",
                    "label": 0
                },
                {
                    "sent": "The only interesting thing.",
                    "label": 0
                },
                {
                    "sent": "Or maybe you can say is different, is that we really say that this join.",
                    "label": 0
                },
                {
                    "sent": "Over these fragments that we have there in their funding, so the joints over this you sick you unfoldings they must be expensive joints and this is maybe the so the the interesting bit of out of this cost model.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "We performed an evaluation.",
                    "label": 0
                },
                {
                    "sent": "What did we evaluate first?",
                    "label": 0
                },
                {
                    "sent": "So first was to see OK. Is this tradeoff really there?",
                    "label": 0
                },
                {
                    "sent": "I mean, we intuitively we can think that.",
                    "label": 0
                },
                {
                    "sent": "You have a tradeoff between redundancies and indexes, but we don't really know whether it's really the case in practice and and also whether this OK it can theoretically happen.",
                    "label": 0
                },
                {
                    "sent": "But also if whether it happens in some application.",
                    "label": 0
                },
                {
                    "sent": "And so in the first experiment, we compared two queries which just the join over three properties over this variable X and this tree properties.",
                    "label": 0
                },
                {
                    "sent": "These are templates of actual sparkle queries, and this template is associated with different parameters.",
                    "label": 0
                },
                {
                    "sent": "So with respect to the number of mappings that define the property from one to six.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The number of riduna mappings were by Rihanna mappings.",
                    "label": 1
                },
                {
                    "sent": "I mean mappings that do not bring in new assertions for the property.",
                    "label": 1
                },
                {
                    "sent": "And the joint selectivity.",
                    "label": 0
                },
                {
                    "sent": "So this is activity of the joint over this variable X.",
                    "label": 0
                },
                {
                    "sent": "Now we respect to this.",
                    "label": 0
                },
                {
                    "sent": "Is there a tradeoff?",
                    "label": 0
                },
                {
                    "sent": "And yes, there is so.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, we have in blue the use traditional music unfolding and blue means that the user queue is better.",
                    "label": 0
                },
                {
                    "sent": "So here when we have any number of mappings usually perform some exception.",
                    "label": 0
                },
                {
                    "sent": "And there is no redundancy then you think you really performs better, but as long as the redundancy starts to kick in then the form where you have less unions, it's actually more.",
                    "label": 0
                },
                {
                    "sent": "More efficient, it actually gets more and more efficient.",
                    "label": 0
                },
                {
                    "sent": "Now, so this answer, the first thing is there a tradeoff and the second question is are we able to capture this trade off?",
                    "label": 0
                },
                {
                    "sent": "So the answer is this so.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And on top you can see our cost estimation when compared to the actual evaluation time for the query.",
                    "label": 0
                },
                {
                    "sent": "The blue would be using Q and the red will be Geo secure.",
                    "label": 0
                },
                {
                    "sent": "Now you see that our cost model can really kind of estimate the actual evaluation times.",
                    "label": 0
                },
                {
                    "sent": "Pretty good for both cases, but if we just use the Postgres cost model it does not really work well so.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Specially for juicy Q we see very very very weird numbers.",
                    "label": 0
                },
                {
                    "sent": "And actually, what is the reason for this?",
                    "label": 0
                },
                {
                    "sent": "So the reason is that Postgres cannot really estimate the redundancy because it doesn't have available live formation that we have with the mappings there.",
                    "label": 0
                },
                {
                    "sent": "And the software you secure cardiologist mention this is still quite good.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's still other estimates up to I don't know 30.",
                    "label": 0
                },
                {
                    "sent": "Four times the actual size of result for the query in cases as you see cube, so I still another estimation, but it's not that tremendous.",
                    "label": 0
                },
                {
                    "sent": "But in case of a juicy kill, the things get totally messy.",
                    "label": 0
                },
                {
                    "sent": "Like we can have situations where Postgres overestimates the actual cardinality of like 200,000 times.",
                    "label": 0
                },
                {
                    "sent": "So you see that we cannot really use the Postgres courageous summation and cost model of Postgres to really differentiate which is the best alternative because the car destination in first place is not reliable.",
                    "label": 0
                },
                {
                    "sent": "In the second experiment, instead is OK.",
                    "label": 0
                },
                {
                    "sent": "Here we have seen what is the trend and how this can respect to the parameters of redundancy and selectivity for joints.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The other way the other OK this activity.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this experiment we say, OK, that's this tradeoff.",
                    "label": 0
                },
                {
                    "sent": "Show show in some real world setting.",
                    "label": 0
                },
                {
                    "sent": "So this benchmark, which have been we have been using for a long time now.",
                    "label": 0
                },
                {
                    "sent": "We try to reproduce real world scenario.",
                    "label": 0
                },
                {
                    "sent": "Real World application of OH BDA and what your services that we can obtain orders of magnitude improvement in terms of query execution times for if we for some queries if we use Jessica, this is actually the.",
                    "label": 0
                },
                {
                    "sent": "Among the most difficult queries from the benchmark, and yeah so.",
                    "label": 0
                },
                {
                    "sent": "What did we do in this work?",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So first the main thing is that we study how to find the most efficient affording over user query.",
                    "label": 1
                },
                {
                    "sent": "To do so we introduce a space of unfolding alternatives that I really did not dig into this presentations.",
                    "label": 1
                },
                {
                    "sent": "But if your interest they are all in the paper and then we define struct optimizations for this new alternatives and then we device a cost model to search for the best one.",
                    "label": 1
                },
                {
                    "sent": "Our empirical evaluation showed that the alternatives can be better and.",
                    "label": 0
                },
                {
                    "sent": "That the device cost model is able to discriminate when these alternatives can be better or where they aren't better.",
                    "label": 1
                },
                {
                    "sent": "As a future work well, there is much work to do.",
                    "label": 0
                },
                {
                    "sent": "This is just the first work of cost.",
                    "label": 0
                },
                {
                    "sent": "Trying to integrate cost models an obvious, so the first thing is to how to integrate this with semantic optimization.",
                    "label": 1
                },
                {
                    "sent": "And also, are there more unfolding alternatives that we can use?",
                    "label": 0
                },
                {
                    "sent": "And also, how can we use more?",
                    "label": 0
                },
                {
                    "sent": "Say like distributions of data rather than relying over the uniformity assumption as we have done in this work.",
                    "label": 0
                },
                {
                    "sent": "This is all things that we keep for future work.",
                    "label": 0
                },
                {
                    "sent": "So thanks for the attention.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Besides post Chris, did you test anything else?",
                    "label": 0
                },
                {
                    "sent": "No, actually not be cause yeah, we don't have the licenses for commercial stores and for my SQL the only join you have is double Nest look join.",
                    "label": 0
                },
                {
                    "sent": "That actually is not really interesting, right?",
                    "label": 0
                },
                {
                    "sent": "It's quadratic is quite expensive.",
                    "label": 0
                },
                {
                    "sent": "Join anyway?",
                    "label": 0
                },
                {
                    "sent": "Yeah, so so.",
                    "label": 0
                },
                {
                    "sent": "Couple things, if I understand it correctly, the you have these redundancy mappings because they're not going to return anything, right?",
                    "label": 0
                },
                {
                    "sent": "So you can eliminate them.",
                    "label": 0
                },
                {
                    "sent": "They are the these map that you said that the redundant is because they're not going to return anything, so you don't have to run those queries that have those mappings.",
                    "label": 0
                },
                {
                    "sent": "Now we don't actually remove the mappings.",
                    "label": 0
                },
                {
                    "sent": "The map central animal.",
                    "label": 0
                },
                {
                    "sent": "We don't remove them, it's just that the way that you unfold things make it so that the impact of this redundant answers in the mappings do not really hit the correct solution times so much as it do, as this does in the UC case.",
                    "label": 0
                },
                {
                    "sent": "This is the because it seems to me I know.",
                    "label": 0
                },
                {
                    "sent": "Oracle SQL Server has something called detection of unsatisfiable conditions.",
                    "label": 0
                },
                {
                    "sent": "That's one thing that I think that would already kind of do.",
                    "label": 0
                },
                {
                    "sent": "This type of work.",
                    "label": 0
                },
                {
                    "sent": "An Oracle has predicate joint pushdown which are able to do the joins with views and we have a union of 'em, so that's why my curiosity is, how does these results effect when you talk to a commercial store that has all these types of.",
                    "label": 0
                },
                {
                    "sent": "This is a very interesting thing that actually we should really consider as future work, and I thank you for the pointer animal.",
                    "label": 0
                },
                {
                    "sent": "As you can imagine, we've already tested all these and alter app and we know that SQL Server and Oracle and DB2 does this very well.",
                    "label": 0
                },
                {
                    "sent": "That is very well OK. Good thanks, thank you.",
                    "label": 0
                }
            ]
        }
    }
}