{
    "id": "2nerjcddh5vkkajhswymyjcerx27gu2o",
    "title": "Teaching Machine Learning from Examples",
    "info": {
        "author": [
            "Isabelle Guyon, Clopinet"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "October 2006",
        "category": [
            "Top->Computer Science->Machine Learning"
        ]
    },
    "url": "http://videolectures.net/learning06_guyon_tmle/",
    "segmentation": [
        [
            "So I. I guess my talk has a lot to do with with the two previous speakers talked about.",
            "I didn't realize that and I'm glad I'm speaking list.",
            "Then there is a little bit.",
            "There are two things that I would like to talk about, although they are related there somewhere different.",
            "The title Learning Machines and Teaching Machines refers to a project that I have where.",
            "Active way all the people working in learning would put together an exhibition for the broad public to make their work known and available."
        ],
        [
            "So.",
            "What you know the idea I had is that we need to disseminate more or research to the to the outer world, and of course, so Hosea talked about making new curricula.",
            "That's part of it.",
            "And here I'm even going one step further.",
            "How do we reach the general public?",
            "How do we explain to our parents to our children to our neighbors what we're doing so they can benefit from it?",
            "And so we can nourish.",
            "Also the next generation of researchers, because I came to realize that there are fields of research which are very popular that everyone knows about, and unfortunately.",
            "It's not the case for all field of research.",
            "Whenever I mention machine learning to other people, I always get, you know, Glazy eyes.",
            "People have never even heard of, you know the term machine learning so they don't know at all what it is.",
            "So they have heard of artificial intelligence.",
            "They've heard about statistics and so somehow have to, you know, connect machine learning to artificial neural networks.",
            "They might have heard of too artificial intelligence to statistics in the end.",
            "I get blank and people stop asking questions, so I feel very frustrated and formerly when I was younger and I was working on my PhD, I was working on artificial neural networks and back then I was far more successful to excite people to the point you know that by just talking about what I was doing to my little sister who is 8 years younger than me, she got excited and she became a brain scientist.",
            "Um, but now somehow I don't succeed in exciting people in the same way, although I'm, you know, very excited myself about the kind of research I'm doing, and I'm sure you know, all of you are very excited about it too.",
            "So how can we as a community?",
            "Make the message clear.",
            "Are making orefield shine more and this will have you know all sorts of beneficial feedback for us, so I'm going to make some suggestions of how we can do that and.",
            "What we can contents we can put into or.",
            "Or means of dissemination and propose that we start and go and do it so the team is going to be.",
            "Hopefully you and the others who will join.",
            "And then I'll propose you know, straight from here a schedule what we're going to do just now in the next few months to make this happen."
        ],
        [
            "So I covered that basically already."
        ],
        [
            "Um, so here are some of the ideas I have.",
            "I should have put the idea but suggested ideas.",
            "So first suggestion is that we would turn our material research material into a set of pedagogical exhibits so.",
            "Some people are very talented to show just the one example that will catch your attention and that you will memorize for your life.",
            "And I was thinking, for example of video.",
            "I Sue of Lawrence, the inventor of the cyclotron, where he shows would model of the cyclotron, where there are some marbles that goes in a circle and you fold, you know the plateau and then the marbles.",
            "A circle faster and faster by you know the pumping of the energy of these motions.",
            "So this very simple mechanical model of something that could be otherwise very obscure.",
            "Because you know it's this big building where you know there is a particle acceleration happening and people are not necessarily familiar with electromagnetism, and it's hard to explain for them how it works, but people are familiar with.",
            "Marbles and wood, and you know, and the principles of mechanics.",
            "We touch it everyday, so everything that's hydraulic or mechanic we understand very easily.",
            "Things that are hidden in computers, even electrical circuits are harder to understand for the broad public.",
            "So I had this vision that we can turn the concepts that we have in learning in two exhibits that people will remember and that will.",
            "Illustrate some of the very basic concepts of learning by example.",
            "So I haven't had time to make you know the physical example, but just to give you an idea, I was thinking of associative memories.",
            "How we can create a model of an associative memory that people could build the in their kitchen.",
            "And well, I don't have a blackboard even here, but I was thinking just, you know, piece of aluminum that you could make?",
            "Carvin some rose like that, so that would be the rows of your of your matrix and the columns of your matrix would be an identical plate, but which would be orthogonal?",
            "90 degrees aligned with the first one.",
            "So you have these rows.",
            "You know here and Rose here and.",
            "This would be the inputs and this would be the output and you could have.",
            "Exemplify what is this learning like?",
            "You know in this in the Habs rule, simplified happens Rule style where you have an Association between an input row and an output column.",
            "If there is a hole drilled that creates a communication between the first plateau and the second plateau, so this could be a hydraulic model of associative memory.",
            "Now if you have an input, you can just put a little bit of water in one of the rows and it goes and fills.",
            "You know the rules and it drips into the columns and you can collect into the corner.",
            "So some of it right?",
            "And and you would get your output you answer.",
            "OK, so so I'm hoping other people will have other ideas of that kind and I was inspired by some of the kids that people made that I saw at the Lawrence Hall of Science, which is very close to where I live and you can now buy, you know, for between 10 and $20 kit for kids where you can make experiments on your kitchen counter.",
            "In electromagnetism, in chemistry and mechanics and all the elements that you need to do the experiments, you can find you know in your kitchen essentially.",
            "So I was thinking, well, why not do that for learning as well?",
            "We can have these simple experiments that illustrate with very concrete objects what it is to learn.",
            "Um?",
            "And in the process of doing that, actually I think it will make us also reflect on what are, you know, the very basic principles that matter for our science."
        ],
        [
            "So I would like to stage this effort and slowly build it up.",
            "I think there is an opportunity for us to write more Wikipedia articles, 'cause Wikipedia is a great vehicle for the for the broad public.",
            "The opportunities to increase the amount of the volume of documentation that there is in the Pascal website, and also I think make the Pascal website more visible, so people should know about it should know that there is material here.",
            "For example, I didn't know myself that there were all these videos that were available, so people should be downloading it from the outside.",
            "And it would be great if people you know would start making games and interactive software there is.",
            "That is pedagogical and vision that we can have a website that would link to all these different resources.",
            "And then I talked about, you know, the kitchen counter demos for children and adults and more sophisticated demonstrations that could be then presented in science museums or in or in schools, and could be then part of teaching curricula as well.",
            "So here's my attempt as proposing a number of themes around which we can regroup or different types of research."
        ],
        [
            "And thinking of two poles.",
            "So the top Poulan has to do about learning as a means of helping survival.",
            "So why do we need to learn as a as a physical entities or as humans as animals?",
            "Where do we need to run?",
            "We need to learn to survive to to improve, you know, our quality of life and leave so and the second goal of learning, I think is a creation.",
            "So survival is, I guess.",
            "The basic thing that you need to do first and then afterwards if you have some spare time and you have you know, succeeded in surviving your extra brain energy, you can spend it on creation and to create things you also need to learn from your peers.",
            "So if you are an artist you you will learn from past artists you know and if you are a researcher you learn from past researchers to make new creations.",
            "So those two poles from me would be fueled by.",
            "A certain number of.",
            "Fundamental building blocks.",
            "So the essentially survival and creation are the applications and the red blocks.",
            "Here are the material that you need in order to.",
            "To do these applications.",
            "So you need to have good implementations of memory 'cause there is no learning without memory.",
            "So there could be an entire subset of what we would we would collect the research we would collect that would be around the same memory.",
            "Another theme could be control, so I'm staging them.",
            "You know, in order of what is the most basic function that living systems have.",
            "So if a living system needs to have learning functionality, it needs first to have some way of storing information.",
            "If you don't have memory, you can't have any other form of learning.",
            "So to me at least, the next stage, if you can do some learning, is to be able to.",
            "To do simple control tasks so the least elaborate living systems that are capable of learning they can do these.",
            "Like the forms they can, you know crawl and dag themselves so they can solve some simple control tasks, then more elaborate living systems.",
            "They get into a planning and so they have to do forecasting and decision making.",
            "So this is more elaborate type of learning.",
            "And finally, a language to me would be even.",
            "Yet you know a higher level in terms of cognition of types of body of tools that you need to solve learning problems.",
            "Of course, I realize you know there are many ways of creating a classification of types of research in learning, and this is just, you know, suggestion.",
            "But what I'm trying to do here is I'm trying to find one way of having.",
            "Relatively small number of poles around which all these exhibits, or this research could be regrouped so that the general public could understand.",
            "Well learning has to do, you know, with memory with control and robotics with you know, statistics, forecasting and decision making and also with language learning.",
            "This kind of applications.",
            "And so within each category we can of course regroup a lot of different things and this could be of course we can replace you know if you have other ideas, we can replace each box by something else, But then if you start thinking about organizing, laying out an exhibition in an exhibit Hall, you could have the you know the different.",
            "Theme that correspond to different locations and the public could walk through through that and at the center the application themes, survival and creation would be fueled by these building the right building blocks.",
            "So I came up with that and I can elaborate a little bit about it in the discussion if you want.",
            "I was thinking of both learning machines and teaching machines.",
            "Because I think learning and teaching have to work hand to hand and.",
            "We can present artificial learning so computers that can learn and also computers that can teach, and this creates a lot of opportunities for you know, attracting interesting demonstrations or making people think what is learning.",
            "How do we learn and when we learn about learning.",
            "So when we understand how learning works, how we can benefit from it.",
            "In a teaching applications."
        ],
        [
            "Um one?",
            "One such attempt is these challenges, so you know that Pascal has been organizing a lot of challenges in machine learning and challenging machine learning are also tool for teaching, so we have, you know, some kind of the loop feedback loop here going on.",
            "And This is why I wanted to spend a little bit of time explaining how we can use challenges as a teaching tool, and so this reaches a little bit.",
            "Also, the theme of the 2nd.",
            "Speaker because in a class I thought last year on feature selection I used the feature selection challenge as a motivation for the students to do some project and our task was to match or outperform the results of the best challengers in the NIPS 2003 challenge."
        ],
        [
            "Um, so again, you know this is the the advertisement for the book.",
            "Well, there is the date the datasets are and also a lot of teaching materials, so this is I guess you know, my attempt to create curriculum.",
            "This is the curriculum is a is the consists of a CD with the data set of the Challenge chapters contributed by by people.",
            "There are 10 chapters that are tutorials and which I followed essentially in my class and then there are chapters that are research papers written about the results of the challenge on the data and so in the class people had.",
            "These different aspects that were illustrated so they they had to produce results on all five datasets of the challenge and the datasets were introduced one by one in the curriculum in the class associated with a particular difficulty in feature selection.",
            "And there were classes that were.",
            "Link to the tutorial chapters so they were then simple courses that I would give and there were classes which were linked to readings, so these were more like seminars.",
            "Then the students had to read the chapter.",
            "Then it was a research chapter in that case and each student to complete the class had to choose one of the research chapters and present it.",
            "So this was one of the requirement for the class.",
            "The second was to produce results on all five datasets and so requirement was that they would make a poster and then we had a poster session and they would present that poster about the results that they had on the five datasets.",
            "And in addition to that, because I had the new assistant in this class that was a class I taught in Switzerland, I TH and I was just a guest professor.",
            "They give me new assistant.",
            "So for the exercise class I sometimes discussed how to produce results on the datasets.",
            "But sometimes I used exercise class to familiarize the students with how you become.",
            "I'm a consultant in machine learning.",
            "Because this is my job and I thought this would be a little bit different view for the students who always taught by academic people.",
            "I came there and I came from the practical world and I'm delivering to them a class on machine learning and I told him right away.",
            "Well, by the end of this class, I hope that you know you can do a consultant like me and go and solve problems in the outside world.",
            "So I taught them also about.",
            "How to write a proposal to get to get a contract?",
            "How to file for patents to protect your intellectual property?",
            "And the various other, you know, practical aspects of the of the work that item.",
            "So this is completely against the curricula."
        ],
        [
            "And I wanted to give you a little glimpse of the datasets that we use them.",
            "Thank you.",
            "So in in the feature selection challenge, so it's need 2003 and it made a mistake in the features section there were five datasets.",
            "One is a mass spectrometry data.",
            "It's a task of separating cancer versus normal.",
            "Dexter is a text processing data set extracted from the Reuters corpus.",
            "Though T is a drug discovery data set corresponding to predicting the molecular activity.",
            "Of some compounds.",
            "Jesus is a handwritten digit recognition and modeling with an artificial data set and what you're looking at here is the distribution of the results of the participants in the competition.",
            "So what we measured results in terms of balanced error rate, which is the average of the error rate of the positive class and the negative class.",
            "It's a measure of performance that is good when you have unbalanced classes.",
            "It averages those and avoids that you vote always for the most abundant class which the error it would be would give you then a good good result, even though you would make.",
            "Trivial guess, so in that case you can see that on some data set there is a broad distribution, so people had anywhere from arsin people are anywhere from 1015% error to almost 50% error for Dexter.",
            "Was more picture around the 5% balanced error rate and for daughter it's very flat so people can get you know very good results in very bad results.",
            "For Jet it's much more peaked than format alone.",
            "It's very interesting that you have bimodal distribution, so people either got it right or got it wrong.",
            "And knowing how you know the data set was designed cousin artificial data, it's no surprise he was a very nonlinear problem.",
            "Kind of metrics or problem where I had put in.",
            "5 dimensional space clusters of the two classes or arranged on the hypercube.",
            "So if you try the linear model, you would miserably fail.",
            "So those probably in the 40% error the linear model people.",
            "And this was Atascosa of feature selection.",
            "So we as people both to get good balanced error rate and small feature sets.",
            "Um, so the class you know focused on feature extraction and feature selection, but at the same time people had to learn about, you know, all the tools of machine learning, some of them had taken classes in machine learning before, but I discovered I had, you know, to review again.",
            "A lot of the basic concepts so they don't know about all the basic tools again."
        ],
        [
            "And what's amazing about this class is that the students considerably.",
            "Exceeded my expectations.",
            "I have to say that my colleagues and I who organized the challenge we tried very hard to match the performance of the participants.",
            "And it was not trivial and we did not succeed.",
            "Actually, in matching these performance, even though we had, you know, the results of the participants and so it's not so easy.",
            "So what I did is that we created the toolkit based on the spider.",
            "It's implemented in Matlab.",
            "Spider is a machine learning package that was implemented at the Max Planck Institute.",
            "Chipping in and it consists of Matlab learning objects, so we built on top of that and added methods that were successful in the challenge.",
            "And then I provided to the student baseline methods.",
            "So I made sure you know that the methods I had were not the best I could.",
            "I could get because I wanted you know that they would have the opportunity to improve a little bit on what I did, but I also tried to give them baseline methods that were in about the 10th percentile of the best methods.",
            "So essentially.",
            "Basically, the best I could do myself like I was in the 10%.",
            "I thought OK they will maybe improve a little bit and so, but they ended up all to really outperform the baseline methods and to even outperform the best performance in the challenge.",
            "And they were motivated to do that because I gave them more points if they would outperform the best results in the challenge.",
            "Number of points to get the maximum grade they could get the total amount of points to get the maximum grade without outperforming the best results in the challenge.",
            "So even even if you know they exceeded the baseline performance with by a significant margin, they would get the maximum point, but they get extra points if they exceeded the best results of the challenge and so they all worked extremely hard to beat that and that's what they did.",
            "So what you see on this graph, the.",
            "The bounced error rate.",
            "In percent of the baseline method.",
            "And then the the challenge.",
            "Best results with the bar and then the results of the students.",
            "So except for the data set, they always exceeded the result.",
            "Sanford daughter Data said they were within the statistical error bar of the best challenge results.",
            "So I thought this was very encouraging and I believe you know this is a big driving force to interest students.",
            "Get them motivated and hooked up, you know.",
            "Probably other teachers hated me because they spent so much time on this.",
            "I really wanted to get it and now we have, you know, other challenges in Pasco.",
            "I think this is wonderful teaching material and should be incorporated in in curriculum.",
            "Then I have to say that this class work very well for me.",
            "Also I got very good teaching rights, probably made a few enemies because I was just a visitor coming like that.",
            "Well, I'm going to tell you how you should teach.",
            "But I think it's."
        ],
        [
            "Great experience that that should be renewed and now we have just started this week and you knew challenge that we entitled agnostic learning versus prior knowledge and in this challenge we gave two datasets.",
            "I mean two data representation for each data set when which is the raw data and one which is preprocessed data and people have to come up with the best possible features using the raw data.",
            "To eventually did better performance than the performance they would get using the preprocess data, which is kind of a trivial process representation, and the distribution of errors that you see here are the ones that was that we're obtaining in a challenge we organized last year called Performance Prediction Challenge, where we use the same datasets but a different data shuffling, so we know already where you know people should stand in the ballpark, and so these double challenging away.",
            "That now you need to try to outperform previous results by designing better data representation, which is.",
            "Recall that prior knowledge meaning that people if they knew something about the domain because we released a lot of information now about the domain of the tasks, then maybe they can make better data representations.",
            "So in that case the data set data is a marketing data set, so people now have access to the knowledge of what the features are, so the age or the social category of.",
            "People so they can try to dream up features that combine those.",
            "Gina is a digit recognition data set, so we give the pixels as the raw data so people can do some feature extraction, find some edges or points or whatever they want to try to get better results or do some.",
            "You know, special purpose kernels do tangent distance.",
            "Whatever is that going to be improving over brute force pixel use?",
            "Then there's the heavy data set, which is a drug discovery data set where you have to predict the molecular activity of some compounds, and here the raw data consists of the position of the molecules in three dimension, and then you can you know from really the molecular structure, extract features and figure out whether you can discover something about the activity of the compound.",
            "It's not so hard, right?",
            "I mean, it looks like it's very different domains, so it requires a lot of experience in the field.",
            "But people have published a lot in the literature, so you can get inspired by.",
            "But what has been done previously?",
            "Nova is a text processing data set.",
            "And then in that case the inputs are just chunks of text that you have to classify in different categories.",
            "So you have to extract features.",
            "The default data representation is the back of world representation, but maybe you can come up with better data representation and Silva is an ecology data set where you have to predict the forest cover as a function of some features about the local climate and.",
            "And the local term which soil everything?",
            "What kind of tree is growing in this in this area?"
        ],
        [
            "OK, well, so now that we have, you know these great ideas how we going to put them together.",
            "So hopefully you know we're not.",
            "We're not alone and I love people will join, including you and.",
            "I welcome any suggestion here.",
            "I can, you know, volunteers.",
            "The coordinators is in some responsible for the idea.",
            "I have somebody who does the the websites of the challenges that could be Webmaster.",
            "I have a friend who has done several scientific exhibitions who volunteered to help as well.",
            "And then you know we need to add add you and other people and find sponsors."
        ],
        [
            "It's almost done now with respect to timeline.",
            "I think that by February I would like a website and do a call for exhibit proposal in July.",
            "Have a deadline of exhibit proposal and then decide which exhibits are best in the first round.",
            "Then eventually submit a proposal to needs to show these exhibits a first time because it has always the demonstrations or demonstration session.",
            "And that could be a good form to try out which ones are most effective.",
            "And then starting January 2008, work on the pedagogical kit that could becoming a commercial kit and scale up the exhibition so that it could be shown in science museums and schools and and other places.",
            "So here we are.",
            "So I wanted to say."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I. I guess my talk has a lot to do with with the two previous speakers talked about.",
                    "label": 0
                },
                {
                    "sent": "I didn't realize that and I'm glad I'm speaking list.",
                    "label": 0
                },
                {
                    "sent": "Then there is a little bit.",
                    "label": 0
                },
                {
                    "sent": "There are two things that I would like to talk about, although they are related there somewhere different.",
                    "label": 0
                },
                {
                    "sent": "The title Learning Machines and Teaching Machines refers to a project that I have where.",
                    "label": 1
                },
                {
                    "sent": "Active way all the people working in learning would put together an exhibition for the broad public to make their work known and available.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What you know the idea I had is that we need to disseminate more or research to the to the outer world, and of course, so Hosea talked about making new curricula.",
                    "label": 1
                },
                {
                    "sent": "That's part of it.",
                    "label": 0
                },
                {
                    "sent": "And here I'm even going one step further.",
                    "label": 0
                },
                {
                    "sent": "How do we reach the general public?",
                    "label": 0
                },
                {
                    "sent": "How do we explain to our parents to our children to our neighbors what we're doing so they can benefit from it?",
                    "label": 0
                },
                {
                    "sent": "And so we can nourish.",
                    "label": 0
                },
                {
                    "sent": "Also the next generation of researchers, because I came to realize that there are fields of research which are very popular that everyone knows about, and unfortunately.",
                    "label": 0
                },
                {
                    "sent": "It's not the case for all field of research.",
                    "label": 0
                },
                {
                    "sent": "Whenever I mention machine learning to other people, I always get, you know, Glazy eyes.",
                    "label": 0
                },
                {
                    "sent": "People have never even heard of, you know the term machine learning so they don't know at all what it is.",
                    "label": 0
                },
                {
                    "sent": "So they have heard of artificial intelligence.",
                    "label": 0
                },
                {
                    "sent": "They've heard about statistics and so somehow have to, you know, connect machine learning to artificial neural networks.",
                    "label": 0
                },
                {
                    "sent": "They might have heard of too artificial intelligence to statistics in the end.",
                    "label": 0
                },
                {
                    "sent": "I get blank and people stop asking questions, so I feel very frustrated and formerly when I was younger and I was working on my PhD, I was working on artificial neural networks and back then I was far more successful to excite people to the point you know that by just talking about what I was doing to my little sister who is 8 years younger than me, she got excited and she became a brain scientist.",
                    "label": 0
                },
                {
                    "sent": "Um, but now somehow I don't succeed in exciting people in the same way, although I'm, you know, very excited myself about the kind of research I'm doing, and I'm sure you know, all of you are very excited about it too.",
                    "label": 0
                },
                {
                    "sent": "So how can we as a community?",
                    "label": 0
                },
                {
                    "sent": "Make the message clear.",
                    "label": 0
                },
                {
                    "sent": "Are making orefield shine more and this will have you know all sorts of beneficial feedback for us, so I'm going to make some suggestions of how we can do that and.",
                    "label": 0
                },
                {
                    "sent": "What we can contents we can put into or.",
                    "label": 0
                },
                {
                    "sent": "Or means of dissemination and propose that we start and go and do it so the team is going to be.",
                    "label": 0
                },
                {
                    "sent": "Hopefully you and the others who will join.",
                    "label": 0
                },
                {
                    "sent": "And then I'll propose you know, straight from here a schedule what we're going to do just now in the next few months to make this happen.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I covered that basically already.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um, so here are some of the ideas I have.",
                    "label": 0
                },
                {
                    "sent": "I should have put the idea but suggested ideas.",
                    "label": 1
                },
                {
                    "sent": "So first suggestion is that we would turn our material research material into a set of pedagogical exhibits so.",
                    "label": 1
                },
                {
                    "sent": "Some people are very talented to show just the one example that will catch your attention and that you will memorize for your life.",
                    "label": 0
                },
                {
                    "sent": "And I was thinking, for example of video.",
                    "label": 0
                },
                {
                    "sent": "I Sue of Lawrence, the inventor of the cyclotron, where he shows would model of the cyclotron, where there are some marbles that goes in a circle and you fold, you know the plateau and then the marbles.",
                    "label": 0
                },
                {
                    "sent": "A circle faster and faster by you know the pumping of the energy of these motions.",
                    "label": 0
                },
                {
                    "sent": "So this very simple mechanical model of something that could be otherwise very obscure.",
                    "label": 0
                },
                {
                    "sent": "Because you know it's this big building where you know there is a particle acceleration happening and people are not necessarily familiar with electromagnetism, and it's hard to explain for them how it works, but people are familiar with.",
                    "label": 0
                },
                {
                    "sent": "Marbles and wood, and you know, and the principles of mechanics.",
                    "label": 0
                },
                {
                    "sent": "We touch it everyday, so everything that's hydraulic or mechanic we understand very easily.",
                    "label": 0
                },
                {
                    "sent": "Things that are hidden in computers, even electrical circuits are harder to understand for the broad public.",
                    "label": 0
                },
                {
                    "sent": "So I had this vision that we can turn the concepts that we have in learning in two exhibits that people will remember and that will.",
                    "label": 0
                },
                {
                    "sent": "Illustrate some of the very basic concepts of learning by example.",
                    "label": 0
                },
                {
                    "sent": "So I haven't had time to make you know the physical example, but just to give you an idea, I was thinking of associative memories.",
                    "label": 0
                },
                {
                    "sent": "How we can create a model of an associative memory that people could build the in their kitchen.",
                    "label": 0
                },
                {
                    "sent": "And well, I don't have a blackboard even here, but I was thinking just, you know, piece of aluminum that you could make?",
                    "label": 0
                },
                {
                    "sent": "Carvin some rose like that, so that would be the rows of your of your matrix and the columns of your matrix would be an identical plate, but which would be orthogonal?",
                    "label": 0
                },
                {
                    "sent": "90 degrees aligned with the first one.",
                    "label": 0
                },
                {
                    "sent": "So you have these rows.",
                    "label": 0
                },
                {
                    "sent": "You know here and Rose here and.",
                    "label": 0
                },
                {
                    "sent": "This would be the inputs and this would be the output and you could have.",
                    "label": 0
                },
                {
                    "sent": "Exemplify what is this learning like?",
                    "label": 0
                },
                {
                    "sent": "You know in this in the Habs rule, simplified happens Rule style where you have an Association between an input row and an output column.",
                    "label": 0
                },
                {
                    "sent": "If there is a hole drilled that creates a communication between the first plateau and the second plateau, so this could be a hydraulic model of associative memory.",
                    "label": 0
                },
                {
                    "sent": "Now if you have an input, you can just put a little bit of water in one of the rows and it goes and fills.",
                    "label": 0
                },
                {
                    "sent": "You know the rules and it drips into the columns and you can collect into the corner.",
                    "label": 0
                },
                {
                    "sent": "So some of it right?",
                    "label": 0
                },
                {
                    "sent": "And and you would get your output you answer.",
                    "label": 0
                },
                {
                    "sent": "OK, so so I'm hoping other people will have other ideas of that kind and I was inspired by some of the kids that people made that I saw at the Lawrence Hall of Science, which is very close to where I live and you can now buy, you know, for between 10 and $20 kit for kids where you can make experiments on your kitchen counter.",
                    "label": 0
                },
                {
                    "sent": "In electromagnetism, in chemistry and mechanics and all the elements that you need to do the experiments, you can find you know in your kitchen essentially.",
                    "label": 0
                },
                {
                    "sent": "So I was thinking, well, why not do that for learning as well?",
                    "label": 0
                },
                {
                    "sent": "We can have these simple experiments that illustrate with very concrete objects what it is to learn.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And in the process of doing that, actually I think it will make us also reflect on what are, you know, the very basic principles that matter for our science.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I would like to stage this effort and slowly build it up.",
                    "label": 0
                },
                {
                    "sent": "I think there is an opportunity for us to write more Wikipedia articles, 'cause Wikipedia is a great vehicle for the for the broad public.",
                    "label": 1
                },
                {
                    "sent": "The opportunities to increase the amount of the volume of documentation that there is in the Pascal website, and also I think make the Pascal website more visible, so people should know about it should know that there is material here.",
                    "label": 0
                },
                {
                    "sent": "For example, I didn't know myself that there were all these videos that were available, so people should be downloading it from the outside.",
                    "label": 0
                },
                {
                    "sent": "And it would be great if people you know would start making games and interactive software there is.",
                    "label": 0
                },
                {
                    "sent": "That is pedagogical and vision that we can have a website that would link to all these different resources.",
                    "label": 0
                },
                {
                    "sent": "And then I talked about, you know, the kitchen counter demos for children and adults and more sophisticated demonstrations that could be then presented in science museums or in or in schools, and could be then part of teaching curricula as well.",
                    "label": 1
                },
                {
                    "sent": "So here's my attempt as proposing a number of themes around which we can regroup or different types of research.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And thinking of two poles.",
                    "label": 0
                },
                {
                    "sent": "So the top Poulan has to do about learning as a means of helping survival.",
                    "label": 0
                },
                {
                    "sent": "So why do we need to learn as a as a physical entities or as humans as animals?",
                    "label": 0
                },
                {
                    "sent": "Where do we need to run?",
                    "label": 0
                },
                {
                    "sent": "We need to learn to survive to to improve, you know, our quality of life and leave so and the second goal of learning, I think is a creation.",
                    "label": 0
                },
                {
                    "sent": "So survival is, I guess.",
                    "label": 0
                },
                {
                    "sent": "The basic thing that you need to do first and then afterwards if you have some spare time and you have you know, succeeded in surviving your extra brain energy, you can spend it on creation and to create things you also need to learn from your peers.",
                    "label": 0
                },
                {
                    "sent": "So if you are an artist you you will learn from past artists you know and if you are a researcher you learn from past researchers to make new creations.",
                    "label": 0
                },
                {
                    "sent": "So those two poles from me would be fueled by.",
                    "label": 0
                },
                {
                    "sent": "A certain number of.",
                    "label": 0
                },
                {
                    "sent": "Fundamental building blocks.",
                    "label": 0
                },
                {
                    "sent": "So the essentially survival and creation are the applications and the red blocks.",
                    "label": 0
                },
                {
                    "sent": "Here are the material that you need in order to.",
                    "label": 0
                },
                {
                    "sent": "To do these applications.",
                    "label": 0
                },
                {
                    "sent": "So you need to have good implementations of memory 'cause there is no learning without memory.",
                    "label": 0
                },
                {
                    "sent": "So there could be an entire subset of what we would we would collect the research we would collect that would be around the same memory.",
                    "label": 0
                },
                {
                    "sent": "Another theme could be control, so I'm staging them.",
                    "label": 0
                },
                {
                    "sent": "You know, in order of what is the most basic function that living systems have.",
                    "label": 0
                },
                {
                    "sent": "So if a living system needs to have learning functionality, it needs first to have some way of storing information.",
                    "label": 0
                },
                {
                    "sent": "If you don't have memory, you can't have any other form of learning.",
                    "label": 0
                },
                {
                    "sent": "So to me at least, the next stage, if you can do some learning, is to be able to.",
                    "label": 0
                },
                {
                    "sent": "To do simple control tasks so the least elaborate living systems that are capable of learning they can do these.",
                    "label": 0
                },
                {
                    "sent": "Like the forms they can, you know crawl and dag themselves so they can solve some simple control tasks, then more elaborate living systems.",
                    "label": 0
                },
                {
                    "sent": "They get into a planning and so they have to do forecasting and decision making.",
                    "label": 1
                },
                {
                    "sent": "So this is more elaborate type of learning.",
                    "label": 0
                },
                {
                    "sent": "And finally, a language to me would be even.",
                    "label": 0
                },
                {
                    "sent": "Yet you know a higher level in terms of cognition of types of body of tools that you need to solve learning problems.",
                    "label": 0
                },
                {
                    "sent": "Of course, I realize you know there are many ways of creating a classification of types of research in learning, and this is just, you know, suggestion.",
                    "label": 0
                },
                {
                    "sent": "But what I'm trying to do here is I'm trying to find one way of having.",
                    "label": 0
                },
                {
                    "sent": "Relatively small number of poles around which all these exhibits, or this research could be regrouped so that the general public could understand.",
                    "label": 0
                },
                {
                    "sent": "Well learning has to do, you know, with memory with control and robotics with you know, statistics, forecasting and decision making and also with language learning.",
                    "label": 0
                },
                {
                    "sent": "This kind of applications.",
                    "label": 0
                },
                {
                    "sent": "And so within each category we can of course regroup a lot of different things and this could be of course we can replace you know if you have other ideas, we can replace each box by something else, But then if you start thinking about organizing, laying out an exhibition in an exhibit Hall, you could have the you know the different.",
                    "label": 0
                },
                {
                    "sent": "Theme that correspond to different locations and the public could walk through through that and at the center the application themes, survival and creation would be fueled by these building the right building blocks.",
                    "label": 0
                },
                {
                    "sent": "So I came up with that and I can elaborate a little bit about it in the discussion if you want.",
                    "label": 0
                },
                {
                    "sent": "I was thinking of both learning machines and teaching machines.",
                    "label": 0
                },
                {
                    "sent": "Because I think learning and teaching have to work hand to hand and.",
                    "label": 0
                },
                {
                    "sent": "We can present artificial learning so computers that can learn and also computers that can teach, and this creates a lot of opportunities for you know, attracting interesting demonstrations or making people think what is learning.",
                    "label": 0
                },
                {
                    "sent": "How do we learn and when we learn about learning.",
                    "label": 0
                },
                {
                    "sent": "So when we understand how learning works, how we can benefit from it.",
                    "label": 0
                },
                {
                    "sent": "In a teaching applications.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um one?",
                    "label": 0
                },
                {
                    "sent": "One such attempt is these challenges, so you know that Pascal has been organizing a lot of challenges in machine learning and challenging machine learning are also tool for teaching, so we have, you know, some kind of the loop feedback loop here going on.",
                    "label": 1
                },
                {
                    "sent": "And This is why I wanted to spend a little bit of time explaining how we can use challenges as a teaching tool, and so this reaches a little bit.",
                    "label": 0
                },
                {
                    "sent": "Also, the theme of the 2nd.",
                    "label": 0
                },
                {
                    "sent": "Speaker because in a class I thought last year on feature selection I used the feature selection challenge as a motivation for the students to do some project and our task was to match or outperform the results of the best challengers in the NIPS 2003 challenge.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um, so again, you know this is the the advertisement for the book.",
                    "label": 0
                },
                {
                    "sent": "Well, there is the date the datasets are and also a lot of teaching materials, so this is I guess you know, my attempt to create curriculum.",
                    "label": 0
                },
                {
                    "sent": "This is the curriculum is a is the consists of a CD with the data set of the Challenge chapters contributed by by people.",
                    "label": 0
                },
                {
                    "sent": "There are 10 chapters that are tutorials and which I followed essentially in my class and then there are chapters that are research papers written about the results of the challenge on the data and so in the class people had.",
                    "label": 0
                },
                {
                    "sent": "These different aspects that were illustrated so they they had to produce results on all five datasets of the challenge and the datasets were introduced one by one in the curriculum in the class associated with a particular difficulty in feature selection.",
                    "label": 1
                },
                {
                    "sent": "And there were classes that were.",
                    "label": 0
                },
                {
                    "sent": "Link to the tutorial chapters so they were then simple courses that I would give and there were classes which were linked to readings, so these were more like seminars.",
                    "label": 0
                },
                {
                    "sent": "Then the students had to read the chapter.",
                    "label": 0
                },
                {
                    "sent": "Then it was a research chapter in that case and each student to complete the class had to choose one of the research chapters and present it.",
                    "label": 0
                },
                {
                    "sent": "So this was one of the requirement for the class.",
                    "label": 0
                },
                {
                    "sent": "The second was to produce results on all five datasets and so requirement was that they would make a poster and then we had a poster session and they would present that poster about the results that they had on the five datasets.",
                    "label": 0
                },
                {
                    "sent": "And in addition to that, because I had the new assistant in this class that was a class I taught in Switzerland, I TH and I was just a guest professor.",
                    "label": 0
                },
                {
                    "sent": "They give me new assistant.",
                    "label": 0
                },
                {
                    "sent": "So for the exercise class I sometimes discussed how to produce results on the datasets.",
                    "label": 0
                },
                {
                    "sent": "But sometimes I used exercise class to familiarize the students with how you become.",
                    "label": 0
                },
                {
                    "sent": "I'm a consultant in machine learning.",
                    "label": 1
                },
                {
                    "sent": "Because this is my job and I thought this would be a little bit different view for the students who always taught by academic people.",
                    "label": 0
                },
                {
                    "sent": "I came there and I came from the practical world and I'm delivering to them a class on machine learning and I told him right away.",
                    "label": 0
                },
                {
                    "sent": "Well, by the end of this class, I hope that you know you can do a consultant like me and go and solve problems in the outside world.",
                    "label": 0
                },
                {
                    "sent": "So I taught them also about.",
                    "label": 0
                },
                {
                    "sent": "How to write a proposal to get to get a contract?",
                    "label": 0
                },
                {
                    "sent": "How to file for patents to protect your intellectual property?",
                    "label": 0
                },
                {
                    "sent": "And the various other, you know, practical aspects of the of the work that item.",
                    "label": 0
                },
                {
                    "sent": "So this is completely against the curricula.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I wanted to give you a little glimpse of the datasets that we use them.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "So in in the feature selection challenge, so it's need 2003 and it made a mistake in the features section there were five datasets.",
                    "label": 0
                },
                {
                    "sent": "One is a mass spectrometry data.",
                    "label": 0
                },
                {
                    "sent": "It's a task of separating cancer versus normal.",
                    "label": 0
                },
                {
                    "sent": "Dexter is a text processing data set extracted from the Reuters corpus.",
                    "label": 0
                },
                {
                    "sent": "Though T is a drug discovery data set corresponding to predicting the molecular activity.",
                    "label": 0
                },
                {
                    "sent": "Of some compounds.",
                    "label": 0
                },
                {
                    "sent": "Jesus is a handwritten digit recognition and modeling with an artificial data set and what you're looking at here is the distribution of the results of the participants in the competition.",
                    "label": 0
                },
                {
                    "sent": "So what we measured results in terms of balanced error rate, which is the average of the error rate of the positive class and the negative class.",
                    "label": 0
                },
                {
                    "sent": "It's a measure of performance that is good when you have unbalanced classes.",
                    "label": 0
                },
                {
                    "sent": "It averages those and avoids that you vote always for the most abundant class which the error it would be would give you then a good good result, even though you would make.",
                    "label": 0
                },
                {
                    "sent": "Trivial guess, so in that case you can see that on some data set there is a broad distribution, so people had anywhere from arsin people are anywhere from 1015% error to almost 50% error for Dexter.",
                    "label": 0
                },
                {
                    "sent": "Was more picture around the 5% balanced error rate and for daughter it's very flat so people can get you know very good results in very bad results.",
                    "label": 0
                },
                {
                    "sent": "For Jet it's much more peaked than format alone.",
                    "label": 0
                },
                {
                    "sent": "It's very interesting that you have bimodal distribution, so people either got it right or got it wrong.",
                    "label": 0
                },
                {
                    "sent": "And knowing how you know the data set was designed cousin artificial data, it's no surprise he was a very nonlinear problem.",
                    "label": 0
                },
                {
                    "sent": "Kind of metrics or problem where I had put in.",
                    "label": 0
                },
                {
                    "sent": "5 dimensional space clusters of the two classes or arranged on the hypercube.",
                    "label": 0
                },
                {
                    "sent": "So if you try the linear model, you would miserably fail.",
                    "label": 0
                },
                {
                    "sent": "So those probably in the 40% error the linear model people.",
                    "label": 0
                },
                {
                    "sent": "And this was Atascosa of feature selection.",
                    "label": 0
                },
                {
                    "sent": "So we as people both to get good balanced error rate and small feature sets.",
                    "label": 0
                },
                {
                    "sent": "Um, so the class you know focused on feature extraction and feature selection, but at the same time people had to learn about, you know, all the tools of machine learning, some of them had taken classes in machine learning before, but I discovered I had, you know, to review again.",
                    "label": 0
                },
                {
                    "sent": "A lot of the basic concepts so they don't know about all the basic tools again.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And what's amazing about this class is that the students considerably.",
                    "label": 0
                },
                {
                    "sent": "Exceeded my expectations.",
                    "label": 0
                },
                {
                    "sent": "I have to say that my colleagues and I who organized the challenge we tried very hard to match the performance of the participants.",
                    "label": 0
                },
                {
                    "sent": "And it was not trivial and we did not succeed.",
                    "label": 0
                },
                {
                    "sent": "Actually, in matching these performance, even though we had, you know, the results of the participants and so it's not so easy.",
                    "label": 0
                },
                {
                    "sent": "So what I did is that we created the toolkit based on the spider.",
                    "label": 0
                },
                {
                    "sent": "It's implemented in Matlab.",
                    "label": 0
                },
                {
                    "sent": "Spider is a machine learning package that was implemented at the Max Planck Institute.",
                    "label": 0
                },
                {
                    "sent": "Chipping in and it consists of Matlab learning objects, so we built on top of that and added methods that were successful in the challenge.",
                    "label": 0
                },
                {
                    "sent": "And then I provided to the student baseline methods.",
                    "label": 0
                },
                {
                    "sent": "So I made sure you know that the methods I had were not the best I could.",
                    "label": 0
                },
                {
                    "sent": "I could get because I wanted you know that they would have the opportunity to improve a little bit on what I did, but I also tried to give them baseline methods that were in about the 10th percentile of the best methods.",
                    "label": 0
                },
                {
                    "sent": "So essentially.",
                    "label": 0
                },
                {
                    "sent": "Basically, the best I could do myself like I was in the 10%.",
                    "label": 0
                },
                {
                    "sent": "I thought OK they will maybe improve a little bit and so, but they ended up all to really outperform the baseline methods and to even outperform the best performance in the challenge.",
                    "label": 0
                },
                {
                    "sent": "And they were motivated to do that because I gave them more points if they would outperform the best results in the challenge.",
                    "label": 0
                },
                {
                    "sent": "Number of points to get the maximum grade they could get the total amount of points to get the maximum grade without outperforming the best results in the challenge.",
                    "label": 0
                },
                {
                    "sent": "So even even if you know they exceeded the baseline performance with by a significant margin, they would get the maximum point, but they get extra points if they exceeded the best results of the challenge and so they all worked extremely hard to beat that and that's what they did.",
                    "label": 0
                },
                {
                    "sent": "So what you see on this graph, the.",
                    "label": 0
                },
                {
                    "sent": "The bounced error rate.",
                    "label": 0
                },
                {
                    "sent": "In percent of the baseline method.",
                    "label": 0
                },
                {
                    "sent": "And then the the challenge.",
                    "label": 0
                },
                {
                    "sent": "Best results with the bar and then the results of the students.",
                    "label": 0
                },
                {
                    "sent": "So except for the data set, they always exceeded the result.",
                    "label": 0
                },
                {
                    "sent": "Sanford daughter Data said they were within the statistical error bar of the best challenge results.",
                    "label": 0
                },
                {
                    "sent": "So I thought this was very encouraging and I believe you know this is a big driving force to interest students.",
                    "label": 0
                },
                {
                    "sent": "Get them motivated and hooked up, you know.",
                    "label": 0
                },
                {
                    "sent": "Probably other teachers hated me because they spent so much time on this.",
                    "label": 0
                },
                {
                    "sent": "I really wanted to get it and now we have, you know, other challenges in Pasco.",
                    "label": 0
                },
                {
                    "sent": "I think this is wonderful teaching material and should be incorporated in in curriculum.",
                    "label": 0
                },
                {
                    "sent": "Then I have to say that this class work very well for me.",
                    "label": 0
                },
                {
                    "sent": "Also I got very good teaching rights, probably made a few enemies because I was just a visitor coming like that.",
                    "label": 0
                },
                {
                    "sent": "Well, I'm going to tell you how you should teach.",
                    "label": 0
                },
                {
                    "sent": "But I think it's.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Great experience that that should be renewed and now we have just started this week and you knew challenge that we entitled agnostic learning versus prior knowledge and in this challenge we gave two datasets.",
                    "label": 0
                },
                {
                    "sent": "I mean two data representation for each data set when which is the raw data and one which is preprocessed data and people have to come up with the best possible features using the raw data.",
                    "label": 0
                },
                {
                    "sent": "To eventually did better performance than the performance they would get using the preprocess data, which is kind of a trivial process representation, and the distribution of errors that you see here are the ones that was that we're obtaining in a challenge we organized last year called Performance Prediction Challenge, where we use the same datasets but a different data shuffling, so we know already where you know people should stand in the ballpark, and so these double challenging away.",
                    "label": 0
                },
                {
                    "sent": "That now you need to try to outperform previous results by designing better data representation, which is.",
                    "label": 0
                },
                {
                    "sent": "Recall that prior knowledge meaning that people if they knew something about the domain because we released a lot of information now about the domain of the tasks, then maybe they can make better data representations.",
                    "label": 0
                },
                {
                    "sent": "So in that case the data set data is a marketing data set, so people now have access to the knowledge of what the features are, so the age or the social category of.",
                    "label": 0
                },
                {
                    "sent": "People so they can try to dream up features that combine those.",
                    "label": 0
                },
                {
                    "sent": "Gina is a digit recognition data set, so we give the pixels as the raw data so people can do some feature extraction, find some edges or points or whatever they want to try to get better results or do some.",
                    "label": 0
                },
                {
                    "sent": "You know, special purpose kernels do tangent distance.",
                    "label": 0
                },
                {
                    "sent": "Whatever is that going to be improving over brute force pixel use?",
                    "label": 0
                },
                {
                    "sent": "Then there's the heavy data set, which is a drug discovery data set where you have to predict the molecular activity of some compounds, and here the raw data consists of the position of the molecules in three dimension, and then you can you know from really the molecular structure, extract features and figure out whether you can discover something about the activity of the compound.",
                    "label": 0
                },
                {
                    "sent": "It's not so hard, right?",
                    "label": 0
                },
                {
                    "sent": "I mean, it looks like it's very different domains, so it requires a lot of experience in the field.",
                    "label": 0
                },
                {
                    "sent": "But people have published a lot in the literature, so you can get inspired by.",
                    "label": 0
                },
                {
                    "sent": "But what has been done previously?",
                    "label": 0
                },
                {
                    "sent": "Nova is a text processing data set.",
                    "label": 0
                },
                {
                    "sent": "And then in that case the inputs are just chunks of text that you have to classify in different categories.",
                    "label": 0
                },
                {
                    "sent": "So you have to extract features.",
                    "label": 0
                },
                {
                    "sent": "The default data representation is the back of world representation, but maybe you can come up with better data representation and Silva is an ecology data set where you have to predict the forest cover as a function of some features about the local climate and.",
                    "label": 0
                },
                {
                    "sent": "And the local term which soil everything?",
                    "label": 0
                },
                {
                    "sent": "What kind of tree is growing in this in this area?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, well, so now that we have, you know these great ideas how we going to put them together.",
                    "label": 0
                },
                {
                    "sent": "So hopefully you know we're not.",
                    "label": 0
                },
                {
                    "sent": "We're not alone and I love people will join, including you and.",
                    "label": 0
                },
                {
                    "sent": "I welcome any suggestion here.",
                    "label": 0
                },
                {
                    "sent": "I can, you know, volunteers.",
                    "label": 0
                },
                {
                    "sent": "The coordinators is in some responsible for the idea.",
                    "label": 0
                },
                {
                    "sent": "I have somebody who does the the websites of the challenges that could be Webmaster.",
                    "label": 0
                },
                {
                    "sent": "I have a friend who has done several scientific exhibitions who volunteered to help as well.",
                    "label": 0
                },
                {
                    "sent": "And then you know we need to add add you and other people and find sponsors.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's almost done now with respect to timeline.",
                    "label": 0
                },
                {
                    "sent": "I think that by February I would like a website and do a call for exhibit proposal in July.",
                    "label": 1
                },
                {
                    "sent": "Have a deadline of exhibit proposal and then decide which exhibits are best in the first round.",
                    "label": 1
                },
                {
                    "sent": "Then eventually submit a proposal to needs to show these exhibits a first time because it has always the demonstrations or demonstration session.",
                    "label": 0
                },
                {
                    "sent": "And that could be a good form to try out which ones are most effective.",
                    "label": 0
                },
                {
                    "sent": "And then starting January 2008, work on the pedagogical kit that could becoming a commercial kit and scale up the exhibition so that it could be shown in science museums and schools and and other places.",
                    "label": 1
                },
                {
                    "sent": "So here we are.",
                    "label": 0
                },
                {
                    "sent": "So I wanted to say.",
                    "label": 0
                }
            ]
        }
    }
}