{
    "id": "2qaua6qijaery25ohto3nylxln4d4pks",
    "title": "Informal Knowledge Processes: The Long Tail of Business Processes",
    "info": {
        "author": [
            "Marcel Tilly, Microsoft"
        ],
        "published": "Oct. 20, 2009",
        "recorded": "September 2009",
        "category": [
            "Top->Computer Science->Machine Learning"
        ]
    },
    "url": "http://videolectures.net/active09_tilly_ikp/",
    "segmentation": [
        [
            "So first of all, let me ask some questions.",
            "Because, you know, it's a school.",
            "Well, I the original plan to start with some exercise in the morning so everybody should stand up.",
            "It's a Saturday morning.",
            "Come to the front wheel.",
            "Let's build our mesh up and so on.",
            "Let's see how everybody is connected.",
            "Well, but this I decided maybe this might not work.",
            "So relax, you can sit there.",
            "You can relax this morning.",
            "It's my show and you can just sit there and enjoy or maybe not enjoy the talk or enjoy the Internet.",
            "Whatever you plan to do.",
            "Um, but I will ask you some questions and I would be very happy if you are able to interact with me, respond, answer something.",
            "It would be very useful, I think for the next.",
            "I'm 2 hours, so first of all, for the organization of this two hours, I think I have 8:30 to 10:30, so I will talk.",
            "I don't know exactly how long.",
            "Maximum one hour 30 and I will hand over to another guy which is Julie and I will introduce him later.",
            "And then we have to switch on our infrastructure and he will talk about one very interesting project we had over the summer time as a preparation for the summer school.",
            "And so we think it's very useful to presented herein Blad to you and to see to collect some reactions on this.",
            "One question is so who's from GSI?",
            "That's all I saw.",
            "There are much more, only four.",
            "I expected much more.",
            "Yes.",
            "Source additional materials.",
            "So if you just OK, I just did two things OK.",
            "These are the handouts I was late with this.",
            "This is the reason why they are now ready.",
            "Maybe you can just distribute them.",
            "Um?",
            "OK, who are who is student?",
            "Only you well.",
            "What are the others doing you work in?",
            "Real work life.",
            "10 hours a day and so on.",
            "Interesting, OK, cool.",
            "Me.",
            "OK, I might talk today is as you can see here, it's about informal knowledge.",
            "Process is the title is a long tail of business processes.",
            "Guys you are really late.",
            "And, um.",
            "Well, this is part of their active project, which is not a big surprise and mainly this is part of one of these work package.",
            "Um and which I'm leading.",
            "So first of all, well, I'm my name is Marty.",
            "And actually."
        ],
        [
            "I'm from the European Microsoft Innovation Center which is located."
        ],
        [
            "It in when you see it.",
            "This is not Google Maps.",
            "This is virtual Earth and we are also able to provide.",
            "Some interesting we are also able to provide Maps and you can put a flag where we're located well where we are located is Artemis in Germany.",
            "Maybe someone knows it leaves early and Julian knows because they are also from Akron.",
            "I'm and European.",
            "Microsoft Innovation Center is, as you can see, an entity of Microsoft.",
            "Answer Acronym of European Microsoft Innovation centers emick.",
            "As you can easily imagine.",
            "Bye."
        ],
        [
            "But what are we doing is?",
            "We're doing applied research.",
            "And then if you heard if you hear bout an research related to Microsoft everybody saying, well, it's MSR Microsoft Research.",
            "But well, actually a mic is not MSR."
        ],
        [
            "MSR is doing basic or fundamental research there.",
            "They have to write papers about their fundamental research results and they have to produce fancy.",
            "Products, no product prototypes more like maybe you have heard about this fancy surface device where you have a table where you can have play with gestures and move.",
            "Pictures around, well, it's a little bit like an iPhone which is a table instead of a small cool device we have now a big device which you not can carry around and which cost you $10,000 or euros but OK.",
            "This is for example one result we had in Microsoft Research.",
            "Emick is doing well.",
            "It's applied research, so we're supposed to do is we are kind of picking up results from MSR.",
            "Well maybe not so surface device, but something else.",
            "They're doing other stuff there.",
            "Right now I'm working a lot of people at MSR.",
            "We are picking.",
            "We should pick some up some results from Amazon, make a little bit more an demonstrator out of it, and then sell it to product groups in Redmond just to make a cool product over it and to discover new market opportunities and at least well, this is our message mission to rule the world right?",
            "So Microsoft tries really to rule everything and.",
            "No, I'm kidding.",
            "I'm well, you know, the title of this is the long tail of business processes and.",
            "I didn't really invent this term and every."
        ],
        [
            "Buddy of you have seen already this original picture and story behind it.",
            "I think it's from Chris Anderson, 2000.",
            "Four in the book, Descrip described like so.",
            "The vote is a well.",
            "Why is Amazon, Netflix, Rhapsody and all these online platforms successful and what is the business behind business model behind it?",
            "It's about well, they're not only focusing on the main.",
            "Brand, like some of the main books, or in the case of Rhapsody, about the main songs or movies.",
            "They are also able to sell.",
            "Books, songs, movies which are not in the main focus, so this is covered by the long tail and you see the revenue from Amazon, Netflix and and Rhapsody is also coming from the long tail, so books which are normally not like the best sellers and stuff like this.",
            "There are also selling books which are out of this code and.",
            "So we kind of I kind of.",
            "Took this long tail and investigate it or we investigated inactive around.",
            "While there are processes in the enterprise.",
            "But these are usually business processes.",
            "I will tell you what I think business processes are, but there are also a lot of other processes which are informal which are hidden which are tested, which everybody of us are executing during our daily work.",
            "So these are the informal process and these are usually not covered by any tools in your company.",
            "And well, this is a little bit where we want to want to go.",
            "So this is the agenda for today.",
            "Well, not for."
        ],
        [
            "Today for the next 2 hours I will discuss with you guys.",
            "What do you think is a knowledge worker.",
            "I will start from this.",
            "I hope nobody did it yesterday.",
            "I think yesterday was mainly about, well, your core topics around data mining, machine learning and so on and a little bit about the introduction of active in general and we have seen a talk from Denny about Semantic Mediawiki, so I would like to dive a little bit in the definition of knowledge workers business processes inform knowledge process.",
            "Um?",
            "And then what we did in active in terms of how can we measure this process is how can we collect this process is how do we intend to store this kind of processes and so on and so on.",
            "So first of all, one important term is.",
            "As we figured out while preparing some of the deliverable to have you know in this project you have to prepare deliverables and you have to define certain terms.",
            "We figured out what knowledge worker was not really well defined, so I somehow we started.",
            "What is knowledge worker?",
            "What I can tell you is I am a knowledge."
        ],
        [
            "OK, this is what I would say and I guess if I would ask you then you would say oh I'm also a knowledge worker and you and you and you and you everybody here would say well I'm a knowledge worker.",
            "This is pretty clear, right?",
            "OK, now comes the shocking part here.",
            "There's the first exercise for you guys.",
            "So I guess every."
        ],
        [
            "Body yesterday we had the social events and there was already some connections between you.",
            "It's not a problem for you to discuss in very short time.",
            "Let's say one minute 2 minutes for you with your neighbor.",
            "Do you think what makes a knowledge worker and where this term comes from?",
            "OK, one minute, 1 1/2 minute from now, let's say yeah.",
            "Come on guys, little bit more interaction.",
            "You know, I will ask you.",
            "Ha ha ha.",
            "401 do you want to?",
            "Knowledge in knowledge worker.",
            "Operation.",
            "Let's discuss it them.",
            "OK, 20 seconds left.",
            "OK, I think everybody is done right.",
            "Excellent, so I don't know who wants you.",
            "Had some remarks.",
            "Maybe you want to share your thoughts.",
            "Actor.",
            "To work it out.",
            "Anybody who can play the role of agent in order to gather information, we process it or re categorizing and stored or distributed to more sophisticated.",
            "Yeah, let me summarize its own knowledge.",
            "Worker is an actor who was able to discover knowledge to use this knowledge to process it and to share with others.",
            "This is what you.",
            "OK and OK. Other comments.",
            "Remarks on this.",
            "OK. OK, actually, if you search in the Internet definition knowledge worker.",
            "Well, you don't really find the definition.",
            "Well, but it's not.",
            "There's not that definition.",
            "There is something.",
            "Well.",
            "Peter Drucker 40."
        ],
        [
            "9 first coined this term knowledge worker and he said, well, it's one who works primarily with information or one who develops and uses knowledge in the workplace.",
            "It's somehow related to what you said.",
            "Well, you said.",
            "Also is I'm sharing this knowledge.",
            "This knowledge with others, right?",
            "OK, so this is when everything starts, so I think the Internet is telling us I'm Peter Drucker was one first came up with the term knowledge worker.",
            "There was another or."
        ],
        [
            "Redefinition somehow from from Thomas Davenport.",
            "And.",
            "He aligned it, may offer more for people who are thinking for living, discussing who they are, what they do, and how they numbers is growing.",
            "So there's some kind of.",
            "Well, if you if you take the numbers, some business relevance in here, so a knowledge worker is someone who wants to grow in terms on on how we act.",
            "What is doing and?",
            "In this relation, right?",
            "So for active we came up with.",
            "With something which which makes a large workforce in this way, like knowledge workers, a specialist or an expert dedicated to space."
        ],
        [
            "Basic knowledge, intensive work domain.",
            "Within an enterprise, so we try to put it in the enterprise scope.",
            "Um, he should be somehow an expert and.",
            "Well, it has to do with knowledge intensive work.",
            "It's more narrow now then the previous definitions here.",
            "Uh, you can.",
            "Well our feelings I was that you could every time you can have a very general definition of knowledge worker like Peter Drucker did 59, which is probably still the best one if general sense.",
            "And.",
            "And the realignment from Devonport was more business related.",
            "Research are also important.",
            "I think if you if you think about the knowledge worker from business enterprise, organization perspective and so we try to narrow it a little bit more down in terms for active just to have a better understanding what we think we're trying to focus here in terms of a knowledge worker.",
            "Not to have a general understanding of what everybody is, a knowledge worker is sometimes a little bit too broad and well.",
            "It doesn't help you really to come up with some results regarding your goals in the project objectives in the project an.",
            "Well, what we also think it seems that his experiences killed.",
            "Maybe he's working context well.",
            "Context is a very critical term.",
            "Usually it's important for him to understand.",
            "To summarize this work to come up with something new related to later on we will see related to knowledge processes.",
            "Um?",
            "Yes, an finally and this is where where it will lead us and it's also related to task workers handles and tries to learn from modifies these task every day so we are redefining and knowledge workers redefining his working tasks everyday.",
            "He's learning.",
            "He's using his skills and experiences to drive and to self improve his self and to make it more efficient everyday.",
            "OK well what?",
            "What are the typical situations of knowledge worker can be in there so?"
        ],
        [
            "What are the questions he's interested in so he's interested in?",
            "Usually what is going on?",
            "Well, even if you think about the organization of the company we're working in and then everybody is interesting, what is going on there?",
            "What is this team doing?",
            "What is my colleague doing and what is going on somewhere in the Internet, right?",
            "Is there anything you write?",
            "Twitter is very, very interesting.",
            "News source or?",
            "Knowledge source for us and together information what's going on, maybe in a broader term and in in the enterprise.",
            "It's sometimes difficult to figure out what's really going on there.",
            "I can tell you in it it's totally difficult at Microsoft to figure out what are probably teams doing so we're definitely doing something in parallel, so there are teams who are reinventing things because they don't know that another team already did it, so it's kind of philosophy at Microsoft.",
            "To also to decouple these kind of teams, so I heard or learned for example, that Google has a totally different strategy.",
            "So here they have more single source approach.",
            "Everybody is working on the same.",
            "A source in terms of code and and and kind of knowledge and has to handle has to use the same libraries and so this knowledge of Google in terms of implementation code grows at Microsoft it's a little bit different because each product group has its own responsibility for its own source and and they would not like to take too much dependencies to other teams, so they try to decouple itself, but at the end it's also a question that they might not know what's going on in.",
            "Other team, so for example emick what as I said, I'm one of our goals is to go there to Redmond and too well to tell them.",
            "OK, look here, we and Europe.",
            "We find out that this is very interesting scenarios.",
            "We have this demonstrator.",
            "Should this feature be and be integrated in your product?",
            "And then to do this we have to talk to several product groups there and during this discussion with this product groups you figure out if we can tell them, hey, do you know that you guys are doing the same as these guys?",
            "Or maybe you can use stuff from them and they need us as a matter mediator just to connect these guys because we have the outside view on what a product groups are doing and the product group itself.",
            "They don't talk to each other.",
            "Usually they try but they don't have the time to see what's going on.",
            "But this is probably also because there is no platform at Microsoft to share this information.",
            "Almost have a competent management.",
            "This piece of every employee and also the focus of things, but then say real.",
            "Everybody can see.",
            "Yes, it's true.",
            "I'm sure this is also available in in companies also at Microsoft, but.",
            "Well, yeah, sometimes either you will.",
            "There's too much information.",
            "And nobody will.",
            "Sometimes you're lost in this kind of information.",
            "And well, sometimes well kind of time is missing and so information is is not updated or something like this is also a problem to update information in this kind of repository's.",
            "Yes, sometimes you need some details to discover this.",
            "Well, it's probably related to where to look.",
            "Well, there there are big companies I can tell you only my experiences from well, not only from Microsoft, but mainly from Microsoft here because.",
            "I would also from others, but in Microsoft we we have a lot of tools where you can find information.",
            "And well, it's related to where to look.",
            "Damn, where should I look to find this information?",
            "There is MSR is maintaining their resources in different places.",
            "They are also having this place where they record the session and make them available.",
            "I think it's internally but have also other sources where they put information about the projects and this is already a collection of sources where you can find information and this is true for the rest of Microsoft as well.",
            "We have so many portals.",
            "Movements are short happen, so yes, yeah, yeah, yeah.",
            "Well, then, who knows what?",
            "This is a old question of knowledge management right?",
            "And when to act and how to share this is related to your definition of a knowledge worker.",
            "Well, sharing of knowledge is really important in a big enterprise.",
            "I'm OK, so this is about the knowledge worker.",
            "I think this is enough to understand what what could be seen as a knowledge workers or what we understand as a knowledge worker.",
            "I hope everybody could find his own definition in what in the terms I've mentioned so far.",
            "I'm.",
            "Sorry for this, but there is another exercise.",
            "This is much more important because it will lead us in the direction where we where I want."
        ],
        [
            "I want to talk about in the next minute.",
            "It's about informal knowledge process, so please again 2 minutes.",
            "Discuss with your neighbor.",
            "What do you think is an informal knowledge process?",
            "Could be.",
            "There's no right or wrong, right?",
            "Just want to get your feeling about what do you think it is.",
            "Well, Paul, you should not discuss, you know.",
            "Let me know.",
            "Coffee break Brother idea general meeting.",
            "Formal.",
            "Access code.",
            "In your body.",
            "OK. OKII will.",
            "Let me interrupt users.",
            "2 minutes are over.",
            "So who would like to?",
            "Well, share some thoughts about it.",
            "I have to.",
            "I will tell you what I think it is.",
            "Maybe someone else come on.",
            "What was?",
            "Which is a passive knowledge?",
            "Or it's OK, it's a good fair question.",
            "Yeah, well, just collect only what you have discussed and where where you struggled with.",
            "So your question is more like what does informal process really means in terms of is it?",
            "Well, what is it?",
            "I'm tested or?",
            "Yeah.",
            "Yeah, well.",
            "So let's let's say it's tested.",
            "Let's say it's tested.",
            "I.",
            "You can come up.",
            "You're on your own with this idea by reading a book or literature.",
            "Or you can hear from your colleagues.",
            "Then you have to.",
            "Well, you probably need to preserve it captured somehow and preservative you can reuse it later on.",
            "You can also.",
            "Lion knowledge forum.",
            "Solving real problems.",
            "Shall we?",
            "OK, let's let's see.",
            "Well, you know what do you want to say you didn't discuss.",
            "So you still own sort is not a discuss result, right?",
            "Oh, very cool.",
            "OK, come on.",
            "It's easy to find formal knowledge processes because they tend to be documents required.",
            "An example is the requirements to make changes to the codebase into version control.",
            "In Co operation group.",
            "So informal process could be described as one isn't so stipulated, fines or nothing.",
            "Which is hospitalization.",
            "It seems to me that one problem we face within 4 miles process is in terms of being able to complete the concept.",
            "So sometimes we tackle tasks and we don't know exactly how much resource dot class is going to take because the process of completing it hasn't been well defined or how we talk about this tomorrow and also exactly something might be running very good.",
            "So let me summarize it.",
            "I think it was not.",
            "Understandable so.",
            "Let me first summarize yours and then I will try to remember what you said and try to summarize it again.",
            "Instead.",
            "There are two aspects, so it's probably easier to capture formal process.",
            "Formal knowledge process is like code changes and processes like this.",
            "For informal processes.",
            "Well, you must help me.",
            "Coming along.",
            "Often knowing.",
            "How much resources required to complete?",
            "OK, OK. OK, for informal knowledge, processes are what was a major point here is that it's very often that it's hard to finalize a task well.",
            "You kind of stuck and you don't know how to really close.",
            "This task is then it's done, it's done.",
            "It's often well what we know probably from our daily work where you write your tasks down and well.",
            "There are some tasks which are still open since weeks and your little dumb shit you're not able to close this task and to remove it from your task.",
            "This I think this is.",
            "Somehow what you're refering to?",
            "Well, I have a lot of them of these tasks in my list.",
            "Absolutely well.",
            "Your comment was one thing is I remembered it before.",
            "Well, right?",
            "Right, first of all, the question was, well, what does informal knowledge process?",
            "What does informal means is tested?",
            "Or is it non tested?",
            "Or is it explicit?",
            "And then it was also related to.",
            "There was another very important aspect you mentioned at the last statement you gave.",
            "Yes, edit producing.",
            "Informal knowledge, well vast knowledge versus captures, producing knowledge using knowledge.",
            "Sharing, icing sharing.",
            "Yeah, well yeah disseminated.",
            "I would say of sharing and disseminating is the same as capturing it.",
            "Some disseminating of this knowledge and there was something how to discover this knowledge.",
            "This was like by reading a book or by talking to friends, right?",
            "This is 1 sharing aspect.",
            "If you try to discover a process like.",
            "I'm new in this company.",
            "How should I do my travel expenses?",
            "Can you tell me yes?",
            "Well there is this template and you have to put in the project.",
            "I own number and then print it twice because one you have to give to your manager to sign and one you should keep because sometimes it got lost in here and you have to send it again something like this is probably an informal process of your knowledge.",
            "Of it's an informal process in in your company.",
            "Well, it's probably a somehow defined one, but well, this for example is tricky part on keeping this copy 'cause it usually get lost.",
            "It's an additional information here, which redefines the probably defined formal process and makes it kind of informal in this sense.",
            "Yes.",
            "Communication protocol.",
            "Classified information is able to send invitations come here for drawing or process for further level race information.",
            "So how would you send this?",
            "To whom?",
            "It's a broadcast to everyone.",
            "Let's say you have a big company like Accenture.",
            "Then you send it to 150,000 people.",
            "Yeah yeah, yeah.",
            "Find links for to sort things Pacifica.",
            "Yes, yeah, very good idea.",
            "OK, I think it was an excellent exercise.",
            "Things for you or someone would like to add some something more from the discussion.",
            "OK, thanks for your participation so far.",
            "Right now you can really relax.",
            "I don't have any exercise anymore in this letter, I think.",
            "Well, if I remember correctly, let's see."
        ],
        [
            "OK, so.",
            "So coming back to the long tail, this is how we started.",
            "At least this is a topic of the OR the title of the presentation.",
            "So usually in companies you have there.",
            "But these are the top sellers.",
            "The top ten books are best sellers in your store.",
            "These other high ranked process is which you usually have.",
            "In your beak.",
            "Tools in your enterprise using I don't know sapt systems using Microsoft Dynamics or other tools where your process is are statically defined.",
            "Well, structures with decisions with all.",
            "Exception capturing and so on.",
            "So this is enterprise driven so your company has an interest on defining these processes because they have some business value for the overall company.",
            "At the end there is something which helps the company to measure this process.",
            "There a lot of people involved in different roles.",
            "They cover the whole enterprise.",
            "This is what your enterprise is about.",
            "Usually your company is producing.",
            "Cos then this process covers your car production.",
            "Informal processes which are some here here.",
            "In the non formalized process table they are more user focused, so it's more user related.",
            "There are not so many people involved.",
            "There is more user specific goal behind there.",
            "Maybe the repetition rate is might be low.",
            "So there is no business value explicitly seen in this to express it in.",
            "Maybe the overhead to express this in this heavyweight tools.",
            "It's too much, so there exists a lot of process is in your company like well, for us it's a travel expense process which is 1 example of this which is never defined anywhere in the tool at Microsoft, but everybody.",
            "Well, it's also different for the different entities in different locations.",
            "But it's somewhere defined just in the head of the workers and just related to one worker.",
            "But my goal is to make my travel expense so that I get the money back.",
            "Right?",
            "And well, my goal is to keep a copy of it as well, because if it's got lost then I don't get the money back.",
            "Knowledge.",
            "This is, I think there is no general answer to this, so the question was what kind of percentage are formal process is and how many informal processes I think are in companies.",
            "OK, I think there is no general answer.",
            "It's probably domain specific.",
            "There might be domains where much more process is available, like static business processes, but I would guess it's just a guess.",
            "I would say it's it's a Pareto.",
            "It's 20% formal and 80% informal.",
            "It's my guess, well, what?",
            "What is your guess?",
            "Last year trying to prepare data for all the animals around the world, he made said 85% of the analysis part of branding.",
            "So my guess is not too bad, right?",
            "OK.",
            "So.",
            "Yet now my OK. Um?",
            "So just well, this is very just very short."
        ],
        [
            "Well, what we have usually in well in the past there were the structure structure based work well when it started with universalization and so on.",
            "Then they started to define all the steps and well everybody has only his very focused thing.",
            "So you have to probably come up with a very structured overall process that everybody knows what to do.",
            "Now we have the knowledge knowledge worker, he's knowledge based.",
            "He's very skilled, he's very experienced.",
            "Well, he has to colorate.",
            "Here's to exchange his swords and there's kind of shift between now from well from the structured based work tomorrow and the knowledge based work we have to be more adaptive and we have to change.",
            "We have to be flexible and dynamic in our daily work.",
            "So if you go to the office I think you don't know what every day is different to the other.",
            "There's no you don't.",
            "You cannot go and say OK today it's the same like yesterday.",
            "I have a meeting at 10.",
            "Well maybe the meeting is the same but well.",
            "Definitely not the content and OK today and then you start already in the morning to plan your day like I have to send this Mail.",
            "I have to ask this.",
            "I have to prepare this documentation of this slide deck and then probably I can find some time in the afternoon to think about real problems I have to deal with my PhD.",
            "I have to code and so on and so on.",
            "And maybe it will at the end of the day you figure out.",
            "OK, this was the original planning but it was totally different because I didn't do anything for my PhD because my advisor requires me to do this or my manager requires me to do that or that.",
            "And well, there was no time for coding.",
            "There was no progress in this probe.",
            "Because I had to do a lot of other stuff, let's do another day and let spend more time on coding.",
            "Well, this is how this is actually my my daily business and.",
            "And as I said, I think I'm not working, so I apply it to everybody, at least in this room, and to all the knowledge worker things, this is the same structure.",
            "And then when I look at you, I think I'm with you.",
            "Your daily daily workers is totally.",
            "Similar to this.",
            "I'm OK coming back so well.",
            "We have this."
        ],
        [
            "Formula is part where we have the number of repetitions.",
            "Maybe this is only what did we say 15% of processes are in this area.",
            "So for to execute it requires probably not so much knowledge.",
            "It doesn't mean that well, people who execute this process is kind of dumb person or stupid morons.",
            "It is just that it doesn't require that much knowledge.",
            "It's more like, well, it's the knowledge is already in the process somehow.",
            "Right, you just have to follow some rules.",
            "Well, there's a checklist.",
            "OK, this yes, yes yes, yes I did it.",
            "Done ready everybody.",
            "Well, this happens also to our work, right?",
            "Even if we are knowledge workers, it doesn't mean that it's only focused on the subset of people, but maybe you can think about there, probably formal process.",
            "Maybe here are very skilled persons.",
            "The experts who can access execute only a small set of process because you need so much knowledge to execute it so.",
            "With her um?",
            "With her decree of the formula of the number of repetitions, maybe it could also be means that you risk requires much more knowledge to execute it.",
            "But coming back to business process, workflows inform knowledge processes.",
            "So what we know or what we can probably agree on South of."
        ],
        [
            "Flow is a finished set of sequential parallel activities triggered by events.",
            "Well, you have activities, probably have decisions and an event triggers execution of this.",
            "Chain of activities.",
            "It's not I I've taken it from from somewhere from a book about CSWC.",
            "Well, I think it's it's very simple.",
            "We don't should fight about this definition, but it's somehow not wrong, I would say.",
            "I'm but what is a business process?",
            "Well, a business process is kind of a workflow within economical."
        ],
        [
            "And interest or for economical relevant objects.",
            "So a business process has a business scope."
        ],
        [
            "OK, an informal knowledge process.",
            "As I see it, and it was a long.",
            "Fight in active as well and to discuss it to come up with a definition, right?",
            "And I have a more detailed definition later, but just to make it, it's a.",
            "It's a loosely defined and ramified.",
            "It's a process of.",
            "Is this collection of loosely ramified activities or actions?",
            "And which are necessary for processing of user relevant data into chief user relevant goals so it looks much more easy because one instant of knowledge, informal knowledge process.",
            "Well now it's formal knowledge process, right?",
            "It's just one straight line of actions.",
            "Well, becausw, let's let's tell the truth.",
            "We're not really multithreaded.",
            "If we extracted from our daily work and we would put it in one context, then it is exactly is a sequence of actions we are doing to reach a goal.",
            "But well, what happens if we try to do it once again?",
            "Then the process might look like this, right?",
            "So we discovered this step is not anymore available becauses as this person is not anymore in this office, it's too late.",
            "I have to use a different tool.",
            "I figured out it's much better to do it like this.",
            "And the next time maybe I do it like this.",
            "Could happen, right or?",
            "Um, I do it like this or.",
            "This I think.",
            "So this is what it means by it's a ramified activity, so there is.",
            "For one instant it looks very simple, but if we look on many execution paths then it becomes much more complex and who tells you what is the right path and what is wrong path.",
            "So we're sorry.",
            "Yes, how do you measure the result?",
            "Yep.",
            "Now it looks like this.",
            "OK, once again.",
            "Just to summarize this."
        ],
        [
            "So a business process has a business goal driven is more in the enterprise.",
            "Scope is a static.",
            "It's former.",
            "There is someone super user who is coordinating this.",
            "Who is defining this.",
            "It's properly monitored, analyzed, and optimized, so this is what business intelligence is doing.",
            "This is why we have all these business process management tools to be able to monitor the execution and to optimize it.",
            "We can expresses in key performance indicators and so on.",
            "There was a lot of business work related to this.",
            "Informal process I think.",
            "Maybe we can discuss it later over lunch.",
            "Maybe after the talk.",
            "I think it's more user goal driven, has a very individual scope.",
            "Well, it's maybe the result might impact the enterprise for sure, but we are not doing our work just for not on purpose but.",
            "In our hands, let's say in this way where we've seen it could be ramified, it's well, it's not that formal.",
            "Well, it's many informants at Hawk.",
            "Sometimes it spontaneous, sometimes sometimes it's planned.",
            "I don't want to say that we are not doing plant work, but we plan it somehow and then we change our structure probably while executing.",
            "So we are changing it at Hawk because we figure out that this task might not.",
            "It's not anymore relevant.",
            "And so on.",
            "And usually it's not monitored.",
            "And as we have seen, it's probably emerging because of first quality.",
            "Of the fruit is the quality of the 1st result is probably not sufficient.",
            "But it's OK, and the next time we know well it was not sufficient, so let's improve the process and to produce a more sufficient result.",
            "And this is probably the motivation to change the process overtime.",
            "So in this way, it's emerging.",
            "OK, skip this slide.",
            "I want to talk because of this emerge."
        ],
        [
            "So how could another process?"
        ],
        [
            "We become a business process.",
            "This is also possible I think, I believe because let's say there is a startup you don't start with a heavyweight enterprise tool for your business process isn't defined it in advance, absolutely no motivation to do this.",
            "We have other tasks to do.",
            "You don't think about business processes, but well, let's assume you startup is successful and becomes.",
            "More, uh, for a serious company and then at some point I'm a certain threshold of probably employees.",
            "You might want to think about.",
            "Let's put some of these.",
            "Well, we have already established informal process is and turns them into business process is and then you can start to see and to analyze how all this process is.",
            "Sit down then and look back the last five years.",
            "How you since your company was emerging.",
            "Then you would look on different processes.",
            "You would figure out well at the beginning we had no clue how to do this or that and then then we figure out how to do it.",
            "And finally this is exactly the result.",
            "This group is a business process for us and then it becomes static and.",
            "We transformed it from informal way to execute processes in a more formal one, and we can store it in heavy by process.",
            "Business process management tools.",
            "We can buy them.",
            "We can spend a lot of money to help to manage this.",
            "OK, now let's come to a more concrete definition on."
        ],
        [
            "And what could be knowledge process?",
            "I hope this is more concrete.",
            "What I already said, it's loosely defined and structural ramified collection of activities.",
            "It's not fully defined in terms of structure and the order of actions are at its point.",
            "Not defined when I start the process, I might change the order and I might decide after each step which is the next one.",
            "So I need the input of the current step to decide what could be the best next step.",
            "Um?",
            "At each action you require as you as an actor decide what to do of the follow up action about the full objection.",
            "Using your skills, your experiences, your contact information.",
            "Current situation, well, this is context, right?",
            "And, well, I think this is mainly what is a knowledge process about.",
            "One example how this carries out overtime."
        ],
        [
            "At the beginning we can have like a loosely coupled set of actions activities, so this is a start time, so there might be admissible activities which seems to be useful to start with.",
            "So Bob picks with just One South.",
            "He picks activity or action one and as soon as he's in action one and he is finished.",
            "This action, then the follow up actions.",
            "A set of admissible actions.",
            "My change.",
            "And then he can pick using this context information.",
            "The next action, and so he carries out this process.",
            "So first it's a one.",
            "Then he picks here A2 and then it changed.",
            "Now a three comes.",
            "Into the set of admissible actions, and he picks, but he decided to take a four, and then after a 40 PX A3, and finally might pick a 5 and so on.",
            "So this is the way he carries out.",
            "So this is usually how you write your To Do List and then you decide.",
            "Well, let's do this like this or in this order.",
            "But every time you re sync a little bit, is this really the best follow up action or my pisanu action coming into it into this picture, which I should now do as a sub action or something like this?"
        ],
        [
            "Um?",
            "Well, it could also be like this if we compare our knowledge process is between different people.",
            "There is Bob.",
            "There is Alice and there's another execution of Bob.",
            "It's about preparation of.",
            "Of a presentation?",
            "Well, you might go to URL.",
            "You identifies information.",
            "You copy, information, you open PowerPoint, you paste information, talk to another person together to collect new information, and to save this presentation.",
            "It's a very well.",
            "Very simple process, right?",
            "Alice is doing it like this.",
            "She also starts in the Internet.",
            "While this is most most likely the best way to start, this is how we proceed.",
            "Let's start a Bing search, right?",
            "This is what we're doing right now.",
            "Nobody is doing anymore.",
            "Google search.",
            "Everybody is doing.",
            "Bing search no.",
            "This was the right question.",
            "This was a wrong question.",
            "Thanks Marco.",
            "Sorry bro.",
            "Can you probably leave the room now?",
            "OK.",
            "But then the order can change, right?",
            "Bob in the 2nd way prefers to talk first to another person to see if this information is really relevant.",
            "We cannot trust the Internet.",
            "We know.",
            "Even if this is written down in Wikipedia, this might not be correct.",
            "So ask someone else.",
            "And Alice decided or OK, I have no information.",
            "Let's start with the presentation.",
            "Elias is very pragmatic and tries to come up with a solution very soon.",
            "So open the presentation.",
            "Paste information.",
            "I'm done OK. At the end she also talks about she talks to another person, maybe just to verify what she put in.",
            "The presentation is OK.",
            "So what what?",
            "What can we see here?",
            "So there might be some actions which might depend on previous action or it doesn't make sense to paste information before I copied it.",
            "It does work, right?",
            "And also saving a presentation before I opened it is also useless, but there might be actions which are not depending on other actions.",
            "So talk to another person.",
            "I can do it everywhere in this in this process chain will go to URL and identifying information is probably also dependent.",
            "So I can probably cluster this kind of actions and and then reshuffle it and do something else.",
            "And this is what what you can figure out, probably also from the mining.",
            "So if you mind all this active actions.",
            "And put it in the database and you figure out OK there.",
            "First of all, there might be some dependencies, but there might also be some.",
            "Finally some patterns of actions which usually people do to prepare a presentation and then you can cluster it and come up with recommendations of follow up task and so on.",
            "OK, this was as a baseline."
        ],
        [
            "Motivation now I can start to talk about stuff inactive so we have seen there are formal processes, but there might also be an informal process.",
            "Is writing a proposal is also very kind of informal process because, well, it's usually have probably well.",
            "It's not really defined what you should do, but you kind of know what you have to do to write proposed you have the structure.",
            "You will know that you have to find a consortium you know which kind of people you try to look for.",
            "You know if it's a framework program proposal, then you should know how this consulting should look like.",
            "Which companies should be kind of covered?",
            "So it's informed even if well, it looks very formal, but it's a very informal process to write a proposal.",
            "I would say scheduling a meeting is the most simplest process, which is I think it's informed because everybody could do it in a different way, and it's not written down how to schedule a meeting.",
            "Preparing a bit is a little bit like writing a proposal.",
            "An so on travel expenses.",
            "There are some examples of this right?",
            "And we know now from from the last conference for Business work.",
            "Well, there there are 85% which are more informal and only 15% which are formal.",
            "And usually I would say.",
            "To cover this informal process is, we don't need any SFP tools, not why because it's from SFP, we don't need dynamics.",
            "This is from Microsoft.",
            "I can blame this guys for covering this informal process.",
            "It's too heavyweight, so there must be something more lightweight.",
            "It should be run on your desktop.",
            "Maybe it should be run somewhere easily in your enterprise in your organization.",
            "Um?",
            "Sorry.",
            "Whatever.",
            "There are tools, definitely.",
            "There are tools and Julian will have some very nice names of tools who are doing it, so I'm not trying to reinvent the wheel right, but it should be definitely lightweight.",
            "Lightweight you can probably most probably associate, probably with back to web to related or something.",
            "Is knowledge worker driven?",
            "Social knowledge should be in the in the in the foreground, not business, not the enterprise.",
            "Context awareness is very important, well and at the end it's about informal process.",
            "I know I have to speed up a little bit, I think.",
            "OK, I'm"
        ],
        [
            "This process is inactive.",
            "I skip this slide even if it's important.",
            "You can read it.",
            "It's very important, but the main message here is.",
            "It should enhance the knowledge workers effectiveness and efficiency by coming up with prediction of follow up task with recommendations.",
            "What you can do, which information he can find, which people he should talk she he or she should talk to.",
            "It's a little bit well.",
            "It's again knowledge management.",
            "In in in, well, it's like knowledge management.",
            "OK, what we did let me talk about.",
            "I guess you all are very feet on the ground like techniques, coding and so on.",
            "Database schemers and OK I will try to come up with something.",
            "OK what we did very simple is we started like OK we will have something which is able to cover tasks.",
            "Task in terms of task is, well, it's a collection of as we have seen of activities or it's.",
            "It's like the set of activities you have.",
            "Probably it could be structured as parent and sub."
        ],
        [
            "Task it has a set of admissible actions which you can see so you can find everything with what I have mentioned so far in this diagram.",
            "Two tasks are sources associated.",
            "We are going to log and task executions.",
            "We know when it start, we know when it stops, which user executed.",
            "Everything goes in the database, so there are different states of us could be in there and to contact asks for sure.",
            "This is important and resources could be a word file, a PDF file.",
            "It could be a URL, it could be email, it could be whatever you can think about.",
            "It could even be a person, right?",
            "And well, there should be some, and I think ego is maybe going to present something around the active network space.",
            "I don't know.",
            "There's some UI, a taskbar which helps you to organize your tasks to see your task.",
            "I think Paul has shown a screenshot of this snow.",
            "Didn't you mention it that you?",
            "OK OK OK you will see.",
            "And value which helps you on the client side to organize your record.",
            "Your task to structure to associated with resources and so on.",
            "And then you can probably have in the task execution like a chain of different task.",
            "You can see like these are clustered by users.",
            "So in the task execution there are different users executing tasks and you can trust that by blue user by orange shoes are incorrect user and later on you can say if a person is executed action and action two you can say which with.",
            "Probability he, well, he will probably execute A3 or a four so very easy and straightforward, yes.",
            "Yes, I think it's not covered in the scheme.",
            "Well, good point.",
            "So let me let me.",
            "I think I have it on the in two slides you can see the collaboration.",
            "You can see the at least one idea for the collaboration.",
            "It's not covered in the schema, but it's covered in the process.",
            "How to use the tools developed by active.",
            "Well, for the task management I want to."
        ],
        [
            "Go too much into detail, just to mention about it.",
            "The task is exposed as a web service.",
            "You have different methods, not very fancy, no rocket science here, right?",
            "Everybody is able to write a web service even in.net.",
            "And exposes as this and now come."
        ],
        [
            "Link to how to share?",
            "Task I don't have a running demo on my machine, but actually what you can do is you can in the taskbar you can connect and you can export it to the Semantic Mediawiki.",
            "I don't know if Danny has mentioned the process visualization in the semantic Mediawiki they are currently working on.",
            "Maybe it's a big secret.",
            "Sorry, we cannot publish this video because I. I'm talking about confidential information here.",
            "No, I'm kidding.",
            "So semantic video, Vicki?",
            "They're going to have some extensions for process.",
            "Well, visualization and expressiveness to express process is not inform knowledge process inside some semantic Mediawiki.",
            "What we're doing here is we are kind of exposing this scheme are what we have like here and store it in the semantic.",
            "Import it into the Semantic Mediawiki insights of Vicki and use of wiki as a collaboration platform to share these process is, let's say as templates.",
            "And then a user can import it from there, execute this process, modify it and change it and save its own.",
            "His new version inside the wiki.",
            "So does this cover your?",
            "Collaboration aspect so it's it's using the wiki as a platform to share and to collaborate in terms of process.",
            "It's not collaborating that inside the process it's collaborating with them as well.",
            "Changing the information about the process.",
            "I cannot.",
            "Operated so I can give let's say 30 ritual collaboration credits and two others waiting.",
            "So next time we will really help me more.",
            "Failed system in order to motivate people.",
            "This is related to incentives.",
            "Somehow, so why should they collaborate?",
            "Why should they share?",
            "OK, yeah, spend some effort.",
            "Yeah yeah yeah.",
            "Well, it's it's.",
            "I'm having a motivation system inside it.",
            "I see, well, yeah, this is.",
            "Yeah, I I fully agree with this point.",
            "So what we're doing in active we're tried to understand what could be.",
            "Well, the motivation for people to use this tools to collaborate to exchange the knowledge.",
            "And there is explicitly a work package around, so it's about they're looking on on what are the costs more from an enterprise perspective, and but what other incentives?",
            "Also for for one on one side for the for the organization, but maybe also form on the other side for person to collaborate to use these tools?",
            "I'm not sure all is going to talk about this.",
            "I guess he's not going to talk about it, but well, it's definitely in this project and but we haven't a good.",
            "We don't have a good answer yet.",
            "To this, I would say we are it's 1 1/2 year old and well we have now the basic functionality.",
            "I would say now we can build on top of this and to discover this kind of topics, But this is very good to remark some."
        ],
        [
            "Um?",
            "What?",
            "Looking on on the different levels, so I guess someone wiser Marco or Paul has explained what the logo means.",
            "No.",
            "No, nobody did.",
            "Oh what a pleasure, what inactive.",
            "We try to have two approaches.",
            "So one is the classical.",
            "I would say the top down approach where you define the process is where the will and then where you store it when then execute it.",
            "So this is what I'm talking about right?",
            "I tried to talk about well, what could be a structure to define this process is there is still the question of what could be the motivation to define my processes into storage.",
            "Very good one.",
            "So this is top down.",
            "And yesterday there was there were at least two sessions about mining and bottom up so we have data in the database.",
            "Let's assume we have a lot of data collected by system interaction in the database like actions, events.",
            "We have this from one case study from Cadence.",
            "For example, Cadence is a chip design company.",
            "And what they have they have already a system and they know exactly what the chip designers which tools they use, and they store this execution in the database.",
            "So we have this data already and now.",
            "Let's say Marco's team is going to analyze this data to mind this data with some fancy algorithms.",
            "And come up with with with patterns in this data and to identify tasks.",
            "So this is a bottom up approach right where we have raw data and try to make some sense out of this raw data.",
            "And this is where it meets there some bottom up, so we have some bottom on the bottom.",
            "We have events we try to cluster them.",
            "We try to mine them.",
            "We try to identify patterns bottom up on the other side.",
            "We are coming from top down from the business process from the user level scheduling meeting top down.",
            "And this is exactly what the active logo.",
            "Where is the active logo.",
            "It's not on the slide where you know the active logo.",
            "So there is 1, the blue one.",
            "Is top down and the orange one is bottom up.",
            "So this is see active logo about so it's kind of combining both approaches top down and bottom up, and this is also covered by the active logo.",
            "I would have expected either Paul or Mark came up with this explanation.",
            "So and this is what we try to do right?",
            "So this is also what this picture is about on the bottom line we have raw data, we have events we're going to cluster them on the other side.",
            "We know maybe business process.",
            "We try to break them down into formal informal process or knowledge.",
            "Process is on the user level.",
            "And finally we have to match them.",
            "No, no question at this point.",
            "There are no questions allowed.",
            "Sorry.",
            "It's on the next slide, maybe right the previous slide.",
            "Yeah here."
        ],
        [
            "So.",
            "Yeah right, it looks like a person on one side right?",
            "And on the other side it's top down and bottom up.",
            "So we spent one year in developing this logo and.",
            "Find this.",
            "Meeting in Frankfurt.",
            "I guess part of their VR journalism.",
            "Before the project started, yeah."
        ],
        [
            "Sure, yeah, I wasn't my.",
            "I was kidding that it costs us one year.",
            "I guess everybody got this right this.",
            "You have a question or remark.",
            "Waterfall.",
            "So around 81 back office access so please process isn't very well, yeah.",
            "Well, it's well, it's iterative incremental, I would say.",
            "I would say waterfall.",
            "I associate more like you define it and then you, that's it.",
            "But I heard that it's probably wrong understanding of waterfall on my side that auto in water for you go back and redefine it.",
            "There is some iteration I think right?",
            "Yep.",
            "Yeah, yeah, well it's it's.",
            "This is a tricky party and we're not.",
            "We haven't right.",
            "We haven't solved yet now to connect really.",
            "Both.",
            "This is a really really tricky part here so.",
            "James I still working on when Michael talked about it right about that they are able to identify patterns, context and so on.",
            "On the other side we are able to define tasks, subtasks, actions.",
            "But now we have.",
            "We have to bring both systems together.",
            "This will happen in the next month.",
            "So next summer school.",
            "Well I think we can present you exactly how this works and how the solution could look like.",
            "We have some rough ideas, but we have fully two to continue working on exactly this.",
            "This interface between those post levels.",
            "OK.",
            "I forgotten to enter."
        ],
        [
            "Right here.",
            "OK. What you also want to do is.",
            "Oh, it's the wrong slide, sorry.",
            "What we also want to do is we want to like we would like to measure.",
            "This process is.",
            "Um?",
            "To come up with like, well on one side, we can say OK, the probability or the prediction is that this is your next task.",
            "But we can also.",
            "So these are the last two guys who left the room.",
            "Nobody else going to use this room.",
            "So what we also can do is and we can kind of measure are we quantify.",
            "This informal process is to say, OK, most probably this is the next task.",
            "But in your situation it might be better, or it might save some costs or some time to execute this task.",
            "And for this we associate we try to find we try to define different measures for knowledge processes which might be the size or.",
            "Well, the dependability like the dependability is in an out of information and maybe there is some activity in between.",
            "Or maybe there is no activity in between because if there are a lot of activities in between before you kind of reuse information you discovered here, you might lose some information which happened to me if I try to summarize, for example, what.",
            "You reply to the exercises.",
            "Well, first I ask someone and I ask another guy and then I try to summarize what happened.",
            "Well, what you told me and I'm well, I wasn't able to recover everything.",
            "What what you taught me?",
            "So this is 1 very good example that there was an activity in between and a lot of information.",
            "Well, because I did something else.",
            "So this is dependability.",
            "Then we define divisibility separability in structural complexity on on this structure, like how many other nodes are involved.",
            "How many different systems you use.",
            "Either you have to switch from phone to your computer while someone is telling you some information on the phone and then you have to switch to the computer and have to learn to transform it into electronical information.",
            "That might also a lot of information.",
            "It's better to have it like if you chat with someone then you can directly copy it from the history or something like this.",
            "Different information and different systems and so on.",
            "This is covered here.",
            "There might be some user dependable values as well, which are very important.",
            "Like this kills a user has and the feasibility a user can use certain activities, resources or people.",
            "It doesn't make sense that probably Bob we recommend to Bob to execute on this stage.",
            "This action C becausw well it's vice versa and it doesn't make sense to recommend to Alice that because set requires Dave, but at least might not know Dave and there's no connection between Alice and Dave, so this activity is not feasible for her.",
            "Well, the skill is definitely very important.",
            "It might.",
            "It doesn't make sense to use Emacs if you don't have a mic skills then you should better use.",
            "I don't know Notepad, it's simple but simple and useless.",
            "But in this case you might be successful by using Notepad instead of Emacs.",
            "And so on.",
            "The rest is subjective values.",
            "This is very it's related to what you said, quality of the result.",
            "It's very hard to measure the quality of result, so you just can ask the user somehow.",
            "Are you happy with your result and he can rank it?",
            "Yes, no sufficient excellent.",
            "And if it's if he's more or less, he should try to be objective on this.",
            "And I guess I user can definitely say, OK, I wrote this paper, but will this paper is Crip anyhow?",
            "This happens to us, right?",
            "And here you have to get some feedback from the user to evaluate what what the process is about to evaluate.",
            "If this was successful, this helps you to come up with numbers, but also the satisfaction of the process.",
            "You should not underestimate if you are unhappy with doing it in this way.",
            "Maybe you have to talk.",
            "To someone in this process and you don't like this guy?",
            "Well, then you're not really happy with this process and you should might change it.",
            "So these are the kind of measures and where we can try to calculate based on these different values and come up with some kind of indicators for the overall process.",
            "These are their numbers and we can aggregate them different ways and very flexible where we are using logic scoring of preferences here to come up with the with the number and we can bring even other metrics here.",
            "This is just the first number first collection of metrics and measures we want to use.",
            "Yep.",
            "Process.",
            "For example, if somebody wants to propose a solution that demands polling information too.",
            "Goes through him for a specific person or how we've got relation level of this information.",
            "Point no, not yet, but this is very good point.",
            "I will definitely think about this one.",
            "Yeah, it's.",
            "We haven't thought about this, but this sounds very reasonable.",
            "Very good thanks.",
            "OKI"
        ],
        [
            "I think.",
            "OK. Well, we we heard about already about it like I'm sharing of information involving other people connecting to others.",
            "I'm talking to them, collect information from them is very important interaction metals.",
            "So we know there is data.",
            "There's some content about it.",
            "Um, there has to happen some conversations.",
            "This happens every day.",
            "We well, I guess everybody of us when when you look back about your daily work then you probably talk 80% of the day, either by Mail messaging systems directly at the coffee bar to other people, and 20% is just sitting in your office and do some real work.",
            "Well, at least for me I am.",
            "I have the feeling I'm sending all the day only emails.",
            "My life is Mail sending excellent.",
            "Well, 20% is presentation preparation.",
            "Uh.",
            "Um, sounds frustrated, right?",
            "Well and there are people involved and well, I I know there is a guy who produced very nice theory.",
            "It's called the hot dog."
        ],
        [
            "Talk Siri.",
            "Well this guy is also sitting in the audience and I think it's a very nice nice idea when you talk about interaction and collaboration.",
            "It might be also like in the enterprise that sometimes you also try to.",
            "Talk to people outside your organization so it's external nodes.",
            "This as a red 1 right?",
            "But even inside your organization, you might have like the yellow nodes.",
            "These are the active nodes, not the active project nodes.",
            "These are more like nodes who are really active in doing their work, but inside.",
            "If you have to talk to others have to get information from, then ask them.",
            "Can you prepare slide on this or can you do?",
            "This might also be dumped nodes like.",
            "Well, there are apparently their sister.",
            "Curve about the skills in your company I guess.",
            "And some of them might produce.",
            "Well, not really good results and I'm useless.",
            "I'm there might not be specialists here, so what's the goal is to try to?",
            "Try not to use heavily or not.",
            "Try to rely too much on this dumb nodes and true in this way kind of try to optimize.",
            "Is the execution of your process.",
            "Yeah.",
            "But if you are talking about, I'm almost at the end, surprisingly so."
        ],
        [
            "I gave 30 minutes to my colleague.",
            "Um?",
            "When we talking about exchanging and sharing information in the enterprise, so usually you cannot just share information in the enterprise.",
            "So as soon as you share information, you have to sort about security and privacy issues here.",
            "So one thing is we have what we have in mind is to cover also security aware knowledge process is."
        ],
        [
            "To look on security awareness inside active.",
            "So what we're going to do here is something what we call.",
            "We define knowledge spheres, so this is.",
            "Can think about it.",
            "It's a group of people or it's a group of documents.",
            "Or if you have an ontology or have never thought.",
            "I would mention this term here.",
            "If you have an enterprise on tolerance.",
            "Yeah, yeah.",
            "And there is this guy who is doing the security stuff.",
            "Hi Carlos.",
            "Topic.",
            "So if we're going to define the secure this knowledge fears we have in mind to have to describe our enterprise in an ontology like we have the resources we have, the documents we have, some people we have, some different organizational structures, and on top of it we define policies to make to allow access and to allow users of these kind of resources what we have as well as the knowledge fears are kind of represented here by this box is there are people.",
            "Which might be in different knowledge fears, and even if it's over a trust boundary, so you can also imagine that there might be some knowledge, fear or policies which cover this scenarios.",
            "So what we're not we not have in mind."
        ],
        [
            "We're not.",
            "We don't want to start from scratch, So what we know it's like this knowledge fears we have in mind are you could think about it's a virtual organization, probably on what we know from grid technologies already.",
            "Or there's a lot of investigation around in the grid community.",
            "And we probably can reuse some technologies from here.",
            "What we also can do is to express this security policies by using.",
            "Frameworks which are already there are ontologies which are already there from other projects.",
            "So chaos is one thing and the other one is Seahawks.",
            "Thanks.",
            "And this is how this fits together in the whole picture, like on the one side, we try to cover the dependencies of task resources.",
            "People, we we know how this is coupled and on the other side we can express the ontology of the enterprise and then we can define policies how to access and use these kind of data.",
            "Um?",
            "Well, I'm almost at the end, so I have interest."
        ],
        [
            "You so far, but we understand this knowledge process is.",
            "Um, for the enterprise.",
            "So there are some tools we will see.",
            "Oh, why slightly introduced what we were thinking about on top down how to express the task, how to what we have in mind to do regarding security.",
            "And what is the relation to bottom up?",
            "I think a pure bottom up approach might not work because, well, magic does not work, so we need some help from the user here to say what.",
            "What are tasks, what are activities, how they are structured.",
            "So This is why we believe that that we should have both approaches top down and bottom up.",
            "I I have, I did a slightly introduction on how to evaluate this knowledge.",
            "Process is what we have in mind here is to use.",
            "This number is also terrific tour to help to help to decide on other processes except one which is most likely, which is probably the most less cost incentive or the less time consuming or the most feasible process.",
            "Next step for you.",
            "So this is what refactoring here means for optimization.",
            "And I mentioned that security and privacy is.",
            "Important for us and what we want to do here.",
            "So we will start right now with the security.",
            "We have a basic architecture for this and now we will start with implementation.",
            "So I was thinking about, well it the entire summer school.",
            "It's more about Web 20 it for the enterprise right?",
            "It's about social.",
            "It's about sharing and so on so.",
            "But what is Web 2.0 for the enterprise?",
            "Well, I think this is.",
            "Enterprise tomorrow, right?",
            "No so enterprise to though is the use of."
        ],
        [
            "Emergent social software.",
            "Platforms.",
            "Within companies or between companies and their partners or customers.",
            "I think this is enterprise, too little, right?",
            "Somehow at least somehow.",
            "So what does it mean?",
            "Emergent social software?",
            "And this is already I try to know too.",
            "Hand over to Julian so emergent social software.",
            "Who could imagine emergence social software?",
            "Software is emergent or social party.",
            "Similar social social software.",
            "So the social software.",
            "Pete that we were using.",
            "Now look for connections for them.",
            "The question is much more easier.",
            "I know you usually and has the same question, so OK doesn't matter, so you will know what the answer to this is when Union ask this question, because then it's much more clear because the context is much more clear, so let me explain what we did during the summer time.",
            "So in preparation for this summer school, we thought well, Ali and I, we are both located in Akron.",
            "We thought it's a very good idea to bring up some people from the WHS University in Akron and to discuss with us their understanding on knowledge, information on data.",
            "Um?",
            "What does it mean?",
            "Because, well, they usually.",
            "If you pick just randomly students, they don't thought about well, what is the knowledge and information?",
            "How does it transform and how does data transform to two information and so on.",
            "So we brought this group of people together, which was originally scheduled with three sessions over over summer to sit together with them.",
            "Each of this session was supposed to have two hours, and so we started first in the first session with the discussion.",
            "Of these basic terms or knowledge, knowledge worker information data, as it was very interesting.",
            "And then we figure out.",
            "OK, let's now have a look on on platforms on Web 2.0 platforms and try to understand the business relevant.",
            "Four of these platforms, so we picked randomly four platforms while one was.",
            "Facebook, the other one was Twitter.",
            "Do we look on Twitter?",
            "Yes?",
            "And then there was Zing.",
            "This is a linked in German version.",
            "Um and the last one was Wikipedia, I think right?",
            "And we looked at it like why is it successful?",
            "How circulation, collaboration, aspect in there?",
            "What is incentive for the user and so on.",
            "So we investigate it into this.",
            "And finally we came up so.",
            "OK, taking this into account, these are social platforms, So what is what could be important for the enterprise?",
            "And one task for the student was then OK. We have this idea.",
            "Figure out what you can do with the basic idea on how could emerge and social software be used in an enterprise scope and what would be very important features for the enterprise and what the guys did in many sessions they figured out.",
            "Well, they did kind of in competitor analysts of the idea they came up with new features and with brand and so on.",
            "And finally and I thought, well, it is really a cool result of really smart what you did.",
            "So please present it.",
            "I give you 30 minutes of my time to present your idea and then we can discuss this stuff.",
            "So now I would like to hand over to Julian.",
            "So Julian is one of these students.",
            "Who developed this?",
            "Finally, this idea with some other colleagues?",
            "And now he's going to present this after the session.",
            "I think we will have some time to discuss open issues and open questions, OK?"
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So first of all, let me ask some questions.",
                    "label": 0
                },
                {
                    "sent": "Because, you know, it's a school.",
                    "label": 0
                },
                {
                    "sent": "Well, I the original plan to start with some exercise in the morning so everybody should stand up.",
                    "label": 0
                },
                {
                    "sent": "It's a Saturday morning.",
                    "label": 0
                },
                {
                    "sent": "Come to the front wheel.",
                    "label": 0
                },
                {
                    "sent": "Let's build our mesh up and so on.",
                    "label": 0
                },
                {
                    "sent": "Let's see how everybody is connected.",
                    "label": 0
                },
                {
                    "sent": "Well, but this I decided maybe this might not work.",
                    "label": 0
                },
                {
                    "sent": "So relax, you can sit there.",
                    "label": 0
                },
                {
                    "sent": "You can relax this morning.",
                    "label": 0
                },
                {
                    "sent": "It's my show and you can just sit there and enjoy or maybe not enjoy the talk or enjoy the Internet.",
                    "label": 0
                },
                {
                    "sent": "Whatever you plan to do.",
                    "label": 0
                },
                {
                    "sent": "Um, but I will ask you some questions and I would be very happy if you are able to interact with me, respond, answer something.",
                    "label": 0
                },
                {
                    "sent": "It would be very useful, I think for the next.",
                    "label": 0
                },
                {
                    "sent": "I'm 2 hours, so first of all, for the organization of this two hours, I think I have 8:30 to 10:30, so I will talk.",
                    "label": 0
                },
                {
                    "sent": "I don't know exactly how long.",
                    "label": 0
                },
                {
                    "sent": "Maximum one hour 30 and I will hand over to another guy which is Julie and I will introduce him later.",
                    "label": 0
                },
                {
                    "sent": "And then we have to switch on our infrastructure and he will talk about one very interesting project we had over the summer time as a preparation for the summer school.",
                    "label": 1
                },
                {
                    "sent": "And so we think it's very useful to presented herein Blad to you and to see to collect some reactions on this.",
                    "label": 0
                },
                {
                    "sent": "One question is so who's from GSI?",
                    "label": 0
                },
                {
                    "sent": "That's all I saw.",
                    "label": 0
                },
                {
                    "sent": "There are much more, only four.",
                    "label": 0
                },
                {
                    "sent": "I expected much more.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Source additional materials.",
                    "label": 0
                },
                {
                    "sent": "So if you just OK, I just did two things OK.",
                    "label": 0
                },
                {
                    "sent": "These are the handouts I was late with this.",
                    "label": 0
                },
                {
                    "sent": "This is the reason why they are now ready.",
                    "label": 0
                },
                {
                    "sent": "Maybe you can just distribute them.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "OK, who are who is student?",
                    "label": 0
                },
                {
                    "sent": "Only you well.",
                    "label": 0
                },
                {
                    "sent": "What are the others doing you work in?",
                    "label": 0
                },
                {
                    "sent": "Real work life.",
                    "label": 0
                },
                {
                    "sent": "10 hours a day and so on.",
                    "label": 0
                },
                {
                    "sent": "Interesting, OK, cool.",
                    "label": 0
                },
                {
                    "sent": "Me.",
                    "label": 0
                },
                {
                    "sent": "OK, I might talk today is as you can see here, it's about informal knowledge.",
                    "label": 0
                },
                {
                    "sent": "Process is the title is a long tail of business processes.",
                    "label": 0
                },
                {
                    "sent": "Guys you are really late.",
                    "label": 0
                },
                {
                    "sent": "And, um.",
                    "label": 0
                },
                {
                    "sent": "Well, this is part of their active project, which is not a big surprise and mainly this is part of one of these work package.",
                    "label": 0
                },
                {
                    "sent": "Um and which I'm leading.",
                    "label": 0
                },
                {
                    "sent": "So first of all, well, I'm my name is Marty.",
                    "label": 0
                },
                {
                    "sent": "And actually.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm from the European Microsoft Innovation Center which is located.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It in when you see it.",
                    "label": 0
                },
                {
                    "sent": "This is not Google Maps.",
                    "label": 0
                },
                {
                    "sent": "This is virtual Earth and we are also able to provide.",
                    "label": 0
                },
                {
                    "sent": "Some interesting we are also able to provide Maps and you can put a flag where we're located well where we are located is Artemis in Germany.",
                    "label": 0
                },
                {
                    "sent": "Maybe someone knows it leaves early and Julian knows because they are also from Akron.",
                    "label": 0
                },
                {
                    "sent": "I'm and European.",
                    "label": 0
                },
                {
                    "sent": "Microsoft Innovation Center is, as you can see, an entity of Microsoft.",
                    "label": 0
                },
                {
                    "sent": "Answer Acronym of European Microsoft Innovation centers emick.",
                    "label": 0
                },
                {
                    "sent": "As you can easily imagine.",
                    "label": 0
                },
                {
                    "sent": "Bye.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But what are we doing is?",
                    "label": 0
                },
                {
                    "sent": "We're doing applied research.",
                    "label": 0
                },
                {
                    "sent": "And then if you heard if you hear bout an research related to Microsoft everybody saying, well, it's MSR Microsoft Research.",
                    "label": 0
                },
                {
                    "sent": "But well, actually a mic is not MSR.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "MSR is doing basic or fundamental research there.",
                    "label": 0
                },
                {
                    "sent": "They have to write papers about their fundamental research results and they have to produce fancy.",
                    "label": 0
                },
                {
                    "sent": "Products, no product prototypes more like maybe you have heard about this fancy surface device where you have a table where you can have play with gestures and move.",
                    "label": 0
                },
                {
                    "sent": "Pictures around, well, it's a little bit like an iPhone which is a table instead of a small cool device we have now a big device which you not can carry around and which cost you $10,000 or euros but OK.",
                    "label": 0
                },
                {
                    "sent": "This is for example one result we had in Microsoft Research.",
                    "label": 0
                },
                {
                    "sent": "Emick is doing well.",
                    "label": 0
                },
                {
                    "sent": "It's applied research, so we're supposed to do is we are kind of picking up results from MSR.",
                    "label": 0
                },
                {
                    "sent": "Well maybe not so surface device, but something else.",
                    "label": 0
                },
                {
                    "sent": "They're doing other stuff there.",
                    "label": 0
                },
                {
                    "sent": "Right now I'm working a lot of people at MSR.",
                    "label": 0
                },
                {
                    "sent": "We are picking.",
                    "label": 0
                },
                {
                    "sent": "We should pick some up some results from Amazon, make a little bit more an demonstrator out of it, and then sell it to product groups in Redmond just to make a cool product over it and to discover new market opportunities and at least well, this is our message mission to rule the world right?",
                    "label": 0
                },
                {
                    "sent": "So Microsoft tries really to rule everything and.",
                    "label": 0
                },
                {
                    "sent": "No, I'm kidding.",
                    "label": 0
                },
                {
                    "sent": "I'm well, you know, the title of this is the long tail of business processes and.",
                    "label": 0
                },
                {
                    "sent": "I didn't really invent this term and every.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Buddy of you have seen already this original picture and story behind it.",
                    "label": 0
                },
                {
                    "sent": "I think it's from Chris Anderson, 2000.",
                    "label": 0
                },
                {
                    "sent": "Four in the book, Descrip described like so.",
                    "label": 0
                },
                {
                    "sent": "The vote is a well.",
                    "label": 0
                },
                {
                    "sent": "Why is Amazon, Netflix, Rhapsody and all these online platforms successful and what is the business behind business model behind it?",
                    "label": 0
                },
                {
                    "sent": "It's about well, they're not only focusing on the main.",
                    "label": 0
                },
                {
                    "sent": "Brand, like some of the main books, or in the case of Rhapsody, about the main songs or movies.",
                    "label": 0
                },
                {
                    "sent": "They are also able to sell.",
                    "label": 0
                },
                {
                    "sent": "Books, songs, movies which are not in the main focus, so this is covered by the long tail and you see the revenue from Amazon, Netflix and and Rhapsody is also coming from the long tail, so books which are normally not like the best sellers and stuff like this.",
                    "label": 0
                },
                {
                    "sent": "There are also selling books which are out of this code and.",
                    "label": 0
                },
                {
                    "sent": "So we kind of I kind of.",
                    "label": 0
                },
                {
                    "sent": "Took this long tail and investigate it or we investigated inactive around.",
                    "label": 0
                },
                {
                    "sent": "While there are processes in the enterprise.",
                    "label": 0
                },
                {
                    "sent": "But these are usually business processes.",
                    "label": 0
                },
                {
                    "sent": "I will tell you what I think business processes are, but there are also a lot of other processes which are informal which are hidden which are tested, which everybody of us are executing during our daily work.",
                    "label": 0
                },
                {
                    "sent": "So these are the informal process and these are usually not covered by any tools in your company.",
                    "label": 0
                },
                {
                    "sent": "And well, this is a little bit where we want to want to go.",
                    "label": 0
                },
                {
                    "sent": "So this is the agenda for today.",
                    "label": 0
                },
                {
                    "sent": "Well, not for.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Today for the next 2 hours I will discuss with you guys.",
                    "label": 0
                },
                {
                    "sent": "What do you think is a knowledge worker.",
                    "label": 1
                },
                {
                    "sent": "I will start from this.",
                    "label": 0
                },
                {
                    "sent": "I hope nobody did it yesterday.",
                    "label": 0
                },
                {
                    "sent": "I think yesterday was mainly about, well, your core topics around data mining, machine learning and so on and a little bit about the introduction of active in general and we have seen a talk from Denny about Semantic Mediawiki, so I would like to dive a little bit in the definition of knowledge workers business processes inform knowledge process.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And then what we did in active in terms of how can we measure this process is how can we collect this process is how do we intend to store this kind of processes and so on and so on.",
                    "label": 0
                },
                {
                    "sent": "So first of all, one important term is.",
                    "label": 0
                },
                {
                    "sent": "As we figured out while preparing some of the deliverable to have you know in this project you have to prepare deliverables and you have to define certain terms.",
                    "label": 0
                },
                {
                    "sent": "We figured out what knowledge worker was not really well defined, so I somehow we started.",
                    "label": 0
                },
                {
                    "sent": "What is knowledge worker?",
                    "label": 0
                },
                {
                    "sent": "What I can tell you is I am a knowledge.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, this is what I would say and I guess if I would ask you then you would say oh I'm also a knowledge worker and you and you and you and you everybody here would say well I'm a knowledge worker.",
                    "label": 1
                },
                {
                    "sent": "This is pretty clear, right?",
                    "label": 0
                },
                {
                    "sent": "OK, now comes the shocking part here.",
                    "label": 0
                },
                {
                    "sent": "There's the first exercise for you guys.",
                    "label": 0
                },
                {
                    "sent": "So I guess every.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Body yesterday we had the social events and there was already some connections between you.",
                    "label": 0
                },
                {
                    "sent": "It's not a problem for you to discuss in very short time.",
                    "label": 0
                },
                {
                    "sent": "Let's say one minute 2 minutes for you with your neighbor.",
                    "label": 1
                },
                {
                    "sent": "Do you think what makes a knowledge worker and where this term comes from?",
                    "label": 0
                },
                {
                    "sent": "OK, one minute, 1 1/2 minute from now, let's say yeah.",
                    "label": 0
                },
                {
                    "sent": "Come on guys, little bit more interaction.",
                    "label": 0
                },
                {
                    "sent": "You know, I will ask you.",
                    "label": 0
                },
                {
                    "sent": "Ha ha ha.",
                    "label": 0
                },
                {
                    "sent": "401 do you want to?",
                    "label": 0
                },
                {
                    "sent": "Knowledge in knowledge worker.",
                    "label": 0
                },
                {
                    "sent": "Operation.",
                    "label": 0
                },
                {
                    "sent": "Let's discuss it them.",
                    "label": 0
                },
                {
                    "sent": "OK, 20 seconds left.",
                    "label": 0
                },
                {
                    "sent": "OK, I think everybody is done right.",
                    "label": 0
                },
                {
                    "sent": "Excellent, so I don't know who wants you.",
                    "label": 0
                },
                {
                    "sent": "Had some remarks.",
                    "label": 0
                },
                {
                    "sent": "Maybe you want to share your thoughts.",
                    "label": 0
                },
                {
                    "sent": "Actor.",
                    "label": 0
                },
                {
                    "sent": "To work it out.",
                    "label": 0
                },
                {
                    "sent": "Anybody who can play the role of agent in order to gather information, we process it or re categorizing and stored or distributed to more sophisticated.",
                    "label": 0
                },
                {
                    "sent": "Yeah, let me summarize its own knowledge.",
                    "label": 0
                },
                {
                    "sent": "Worker is an actor who was able to discover knowledge to use this knowledge to process it and to share with others.",
                    "label": 0
                },
                {
                    "sent": "This is what you.",
                    "label": 0
                },
                {
                    "sent": "OK and OK. Other comments.",
                    "label": 0
                },
                {
                    "sent": "Remarks on this.",
                    "label": 1
                },
                {
                    "sent": "OK. OK, actually, if you search in the Internet definition knowledge worker.",
                    "label": 0
                },
                {
                    "sent": "Well, you don't really find the definition.",
                    "label": 0
                },
                {
                    "sent": "Well, but it's not.",
                    "label": 0
                },
                {
                    "sent": "There's not that definition.",
                    "label": 0
                },
                {
                    "sent": "There is something.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "Peter Drucker 40.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "9 first coined this term knowledge worker and he said, well, it's one who works primarily with information or one who develops and uses knowledge in the workplace.",
                    "label": 0
                },
                {
                    "sent": "It's somehow related to what you said.",
                    "label": 0
                },
                {
                    "sent": "Well, you said.",
                    "label": 0
                },
                {
                    "sent": "Also is I'm sharing this knowledge.",
                    "label": 0
                },
                {
                    "sent": "This knowledge with others, right?",
                    "label": 0
                },
                {
                    "sent": "OK, so this is when everything starts, so I think the Internet is telling us I'm Peter Drucker was one first came up with the term knowledge worker.",
                    "label": 0
                },
                {
                    "sent": "There was another or.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Redefinition somehow from from Thomas Davenport.",
                    "label": 1
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "He aligned it, may offer more for people who are thinking for living, discussing who they are, what they do, and how they numbers is growing.",
                    "label": 1
                },
                {
                    "sent": "So there's some kind of.",
                    "label": 0
                },
                {
                    "sent": "Well, if you if you take the numbers, some business relevance in here, so a knowledge worker is someone who wants to grow in terms on on how we act.",
                    "label": 0
                },
                {
                    "sent": "What is doing and?",
                    "label": 0
                },
                {
                    "sent": "In this relation, right?",
                    "label": 0
                },
                {
                    "sent": "So for active we came up with.",
                    "label": 0
                },
                {
                    "sent": "With something which which makes a large workforce in this way, like knowledge workers, a specialist or an expert dedicated to space.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Basic knowledge, intensive work domain.",
                    "label": 1
                },
                {
                    "sent": "Within an enterprise, so we try to put it in the enterprise scope.",
                    "label": 0
                },
                {
                    "sent": "Um, he should be somehow an expert and.",
                    "label": 0
                },
                {
                    "sent": "Well, it has to do with knowledge intensive work.",
                    "label": 0
                },
                {
                    "sent": "It's more narrow now then the previous definitions here.",
                    "label": 0
                },
                {
                    "sent": "Uh, you can.",
                    "label": 0
                },
                {
                    "sent": "Well our feelings I was that you could every time you can have a very general definition of knowledge worker like Peter Drucker did 59, which is probably still the best one if general sense.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "And the realignment from Devonport was more business related.",
                    "label": 0
                },
                {
                    "sent": "Research are also important.",
                    "label": 0
                },
                {
                    "sent": "I think if you if you think about the knowledge worker from business enterprise, organization perspective and so we try to narrow it a little bit more down in terms for active just to have a better understanding what we think we're trying to focus here in terms of a knowledge worker.",
                    "label": 0
                },
                {
                    "sent": "Not to have a general understanding of what everybody is, a knowledge worker is sometimes a little bit too broad and well.",
                    "label": 1
                },
                {
                    "sent": "It doesn't help you really to come up with some results regarding your goals in the project objectives in the project an.",
                    "label": 0
                },
                {
                    "sent": "Well, what we also think it seems that his experiences killed.",
                    "label": 0
                },
                {
                    "sent": "Maybe he's working context well.",
                    "label": 0
                },
                {
                    "sent": "Context is a very critical term.",
                    "label": 0
                },
                {
                    "sent": "Usually it's important for him to understand.",
                    "label": 0
                },
                {
                    "sent": "To summarize this work to come up with something new related to later on we will see related to knowledge processes.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Yes, an finally and this is where where it will lead us and it's also related to task workers handles and tries to learn from modifies these task every day so we are redefining and knowledge workers redefining his working tasks everyday.",
                    "label": 0
                },
                {
                    "sent": "He's learning.",
                    "label": 0
                },
                {
                    "sent": "He's using his skills and experiences to drive and to self improve his self and to make it more efficient everyday.",
                    "label": 0
                },
                {
                    "sent": "OK well what?",
                    "label": 0
                },
                {
                    "sent": "What are the typical situations of knowledge worker can be in there so?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What are the questions he's interested in so he's interested in?",
                    "label": 0
                },
                {
                    "sent": "Usually what is going on?",
                    "label": 0
                },
                {
                    "sent": "Well, even if you think about the organization of the company we're working in and then everybody is interesting, what is going on there?",
                    "label": 0
                },
                {
                    "sent": "What is this team doing?",
                    "label": 0
                },
                {
                    "sent": "What is my colleague doing and what is going on somewhere in the Internet, right?",
                    "label": 0
                },
                {
                    "sent": "Is there anything you write?",
                    "label": 0
                },
                {
                    "sent": "Twitter is very, very interesting.",
                    "label": 0
                },
                {
                    "sent": "News source or?",
                    "label": 0
                },
                {
                    "sent": "Knowledge source for us and together information what's going on, maybe in a broader term and in in the enterprise.",
                    "label": 0
                },
                {
                    "sent": "It's sometimes difficult to figure out what's really going on there.",
                    "label": 0
                },
                {
                    "sent": "I can tell you in it it's totally difficult at Microsoft to figure out what are probably teams doing so we're definitely doing something in parallel, so there are teams who are reinventing things because they don't know that another team already did it, so it's kind of philosophy at Microsoft.",
                    "label": 0
                },
                {
                    "sent": "To also to decouple these kind of teams, so I heard or learned for example, that Google has a totally different strategy.",
                    "label": 0
                },
                {
                    "sent": "So here they have more single source approach.",
                    "label": 0
                },
                {
                    "sent": "Everybody is working on the same.",
                    "label": 0
                },
                {
                    "sent": "A source in terms of code and and and kind of knowledge and has to handle has to use the same libraries and so this knowledge of Google in terms of implementation code grows at Microsoft it's a little bit different because each product group has its own responsibility for its own source and and they would not like to take too much dependencies to other teams, so they try to decouple itself, but at the end it's also a question that they might not know what's going on in.",
                    "label": 0
                },
                {
                    "sent": "Other team, so for example emick what as I said, I'm one of our goals is to go there to Redmond and too well to tell them.",
                    "label": 0
                },
                {
                    "sent": "OK, look here, we and Europe.",
                    "label": 0
                },
                {
                    "sent": "We find out that this is very interesting scenarios.",
                    "label": 0
                },
                {
                    "sent": "We have this demonstrator.",
                    "label": 0
                },
                {
                    "sent": "Should this feature be and be integrated in your product?",
                    "label": 0
                },
                {
                    "sent": "And then to do this we have to talk to several product groups there and during this discussion with this product groups you figure out if we can tell them, hey, do you know that you guys are doing the same as these guys?",
                    "label": 0
                },
                {
                    "sent": "Or maybe you can use stuff from them and they need us as a matter mediator just to connect these guys because we have the outside view on what a product groups are doing and the product group itself.",
                    "label": 0
                },
                {
                    "sent": "They don't talk to each other.",
                    "label": 0
                },
                {
                    "sent": "Usually they try but they don't have the time to see what's going on.",
                    "label": 0
                },
                {
                    "sent": "But this is probably also because there is no platform at Microsoft to share this information.",
                    "label": 0
                },
                {
                    "sent": "Almost have a competent management.",
                    "label": 0
                },
                {
                    "sent": "This piece of every employee and also the focus of things, but then say real.",
                    "label": 0
                },
                {
                    "sent": "Everybody can see.",
                    "label": 0
                },
                {
                    "sent": "Yes, it's true.",
                    "label": 0
                },
                {
                    "sent": "I'm sure this is also available in in companies also at Microsoft, but.",
                    "label": 0
                },
                {
                    "sent": "Well, yeah, sometimes either you will.",
                    "label": 0
                },
                {
                    "sent": "There's too much information.",
                    "label": 0
                },
                {
                    "sent": "And nobody will.",
                    "label": 0
                },
                {
                    "sent": "Sometimes you're lost in this kind of information.",
                    "label": 0
                },
                {
                    "sent": "And well, sometimes well kind of time is missing and so information is is not updated or something like this is also a problem to update information in this kind of repository's.",
                    "label": 0
                },
                {
                    "sent": "Yes, sometimes you need some details to discover this.",
                    "label": 0
                },
                {
                    "sent": "Well, it's probably related to where to look.",
                    "label": 1
                },
                {
                    "sent": "Well, there there are big companies I can tell you only my experiences from well, not only from Microsoft, but mainly from Microsoft here because.",
                    "label": 0
                },
                {
                    "sent": "I would also from others, but in Microsoft we we have a lot of tools where you can find information.",
                    "label": 0
                },
                {
                    "sent": "And well, it's related to where to look.",
                    "label": 0
                },
                {
                    "sent": "Damn, where should I look to find this information?",
                    "label": 0
                },
                {
                    "sent": "There is MSR is maintaining their resources in different places.",
                    "label": 0
                },
                {
                    "sent": "They are also having this place where they record the session and make them available.",
                    "label": 0
                },
                {
                    "sent": "I think it's internally but have also other sources where they put information about the projects and this is already a collection of sources where you can find information and this is true for the rest of Microsoft as well.",
                    "label": 0
                },
                {
                    "sent": "We have so many portals.",
                    "label": 0
                },
                {
                    "sent": "Movements are short happen, so yes, yeah, yeah, yeah.",
                    "label": 0
                },
                {
                    "sent": "Well, then, who knows what?",
                    "label": 1
                },
                {
                    "sent": "This is a old question of knowledge management right?",
                    "label": 0
                },
                {
                    "sent": "And when to act and how to share this is related to your definition of a knowledge worker.",
                    "label": 1
                },
                {
                    "sent": "Well, sharing of knowledge is really important in a big enterprise.",
                    "label": 0
                },
                {
                    "sent": "I'm OK, so this is about the knowledge worker.",
                    "label": 0
                },
                {
                    "sent": "I think this is enough to understand what what could be seen as a knowledge workers or what we understand as a knowledge worker.",
                    "label": 0
                },
                {
                    "sent": "I hope everybody could find his own definition in what in the terms I've mentioned so far.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "Sorry for this, but there is another exercise.",
                    "label": 0
                },
                {
                    "sent": "This is much more important because it will lead us in the direction where we where I want.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I want to talk about in the next minute.",
                    "label": 0
                },
                {
                    "sent": "It's about informal knowledge process, so please again 2 minutes.",
                    "label": 0
                },
                {
                    "sent": "Discuss with your neighbor.",
                    "label": 0
                },
                {
                    "sent": "What do you think is an informal knowledge process?",
                    "label": 1
                },
                {
                    "sent": "Could be.",
                    "label": 0
                },
                {
                    "sent": "There's no right or wrong, right?",
                    "label": 0
                },
                {
                    "sent": "Just want to get your feeling about what do you think it is.",
                    "label": 0
                },
                {
                    "sent": "Well, Paul, you should not discuss, you know.",
                    "label": 0
                },
                {
                    "sent": "Let me know.",
                    "label": 0
                },
                {
                    "sent": "Coffee break Brother idea general meeting.",
                    "label": 0
                },
                {
                    "sent": "Formal.",
                    "label": 0
                },
                {
                    "sent": "Access code.",
                    "label": 0
                },
                {
                    "sent": "In your body.",
                    "label": 0
                },
                {
                    "sent": "OK. OKII will.",
                    "label": 0
                },
                {
                    "sent": "Let me interrupt users.",
                    "label": 0
                },
                {
                    "sent": "2 minutes are over.",
                    "label": 0
                },
                {
                    "sent": "So who would like to?",
                    "label": 0
                },
                {
                    "sent": "Well, share some thoughts about it.",
                    "label": 0
                },
                {
                    "sent": "I have to.",
                    "label": 0
                },
                {
                    "sent": "I will tell you what I think it is.",
                    "label": 0
                },
                {
                    "sent": "Maybe someone else come on.",
                    "label": 0
                },
                {
                    "sent": "What was?",
                    "label": 0
                },
                {
                    "sent": "Which is a passive knowledge?",
                    "label": 0
                },
                {
                    "sent": "Or it's OK, it's a good fair question.",
                    "label": 0
                },
                {
                    "sent": "Yeah, well, just collect only what you have discussed and where where you struggled with.",
                    "label": 0
                },
                {
                    "sent": "So your question is more like what does informal process really means in terms of is it?",
                    "label": 0
                },
                {
                    "sent": "Well, what is it?",
                    "label": 0
                },
                {
                    "sent": "I'm tested or?",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah, well.",
                    "label": 0
                },
                {
                    "sent": "So let's let's say it's tested.",
                    "label": 0
                },
                {
                    "sent": "Let's say it's tested.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "You can come up.",
                    "label": 0
                },
                {
                    "sent": "You're on your own with this idea by reading a book or literature.",
                    "label": 0
                },
                {
                    "sent": "Or you can hear from your colleagues.",
                    "label": 0
                },
                {
                    "sent": "Then you have to.",
                    "label": 0
                },
                {
                    "sent": "Well, you probably need to preserve it captured somehow and preservative you can reuse it later on.",
                    "label": 0
                },
                {
                    "sent": "You can also.",
                    "label": 0
                },
                {
                    "sent": "Lion knowledge forum.",
                    "label": 0
                },
                {
                    "sent": "Solving real problems.",
                    "label": 0
                },
                {
                    "sent": "Shall we?",
                    "label": 0
                },
                {
                    "sent": "OK, let's let's see.",
                    "label": 0
                },
                {
                    "sent": "Well, you know what do you want to say you didn't discuss.",
                    "label": 0
                },
                {
                    "sent": "So you still own sort is not a discuss result, right?",
                    "label": 0
                },
                {
                    "sent": "Oh, very cool.",
                    "label": 0
                },
                {
                    "sent": "OK, come on.",
                    "label": 0
                },
                {
                    "sent": "It's easy to find formal knowledge processes because they tend to be documents required.",
                    "label": 0
                },
                {
                    "sent": "An example is the requirements to make changes to the codebase into version control.",
                    "label": 0
                },
                {
                    "sent": "In Co operation group.",
                    "label": 0
                },
                {
                    "sent": "So informal process could be described as one isn't so stipulated, fines or nothing.",
                    "label": 0
                },
                {
                    "sent": "Which is hospitalization.",
                    "label": 0
                },
                {
                    "sent": "It seems to me that one problem we face within 4 miles process is in terms of being able to complete the concept.",
                    "label": 0
                },
                {
                    "sent": "So sometimes we tackle tasks and we don't know exactly how much resource dot class is going to take because the process of completing it hasn't been well defined or how we talk about this tomorrow and also exactly something might be running very good.",
                    "label": 0
                },
                {
                    "sent": "So let me summarize it.",
                    "label": 0
                },
                {
                    "sent": "I think it was not.",
                    "label": 0
                },
                {
                    "sent": "Understandable so.",
                    "label": 0
                },
                {
                    "sent": "Let me first summarize yours and then I will try to remember what you said and try to summarize it again.",
                    "label": 0
                },
                {
                    "sent": "Instead.",
                    "label": 0
                },
                {
                    "sent": "There are two aspects, so it's probably easier to capture formal process.",
                    "label": 0
                },
                {
                    "sent": "Formal knowledge process is like code changes and processes like this.",
                    "label": 0
                },
                {
                    "sent": "For informal processes.",
                    "label": 0
                },
                {
                    "sent": "Well, you must help me.",
                    "label": 0
                },
                {
                    "sent": "Coming along.",
                    "label": 0
                },
                {
                    "sent": "Often knowing.",
                    "label": 0
                },
                {
                    "sent": "How much resources required to complete?",
                    "label": 0
                },
                {
                    "sent": "OK, OK. OK, for informal knowledge, processes are what was a major point here is that it's very often that it's hard to finalize a task well.",
                    "label": 0
                },
                {
                    "sent": "You kind of stuck and you don't know how to really close.",
                    "label": 0
                },
                {
                    "sent": "This task is then it's done, it's done.",
                    "label": 0
                },
                {
                    "sent": "It's often well what we know probably from our daily work where you write your tasks down and well.",
                    "label": 0
                },
                {
                    "sent": "There are some tasks which are still open since weeks and your little dumb shit you're not able to close this task and to remove it from your task.",
                    "label": 0
                },
                {
                    "sent": "This I think this is.",
                    "label": 0
                },
                {
                    "sent": "Somehow what you're refering to?",
                    "label": 0
                },
                {
                    "sent": "Well, I have a lot of them of these tasks in my list.",
                    "label": 0
                },
                {
                    "sent": "Absolutely well.",
                    "label": 0
                },
                {
                    "sent": "Your comment was one thing is I remembered it before.",
                    "label": 0
                },
                {
                    "sent": "Well, right?",
                    "label": 0
                },
                {
                    "sent": "Right, first of all, the question was, well, what does informal knowledge process?",
                    "label": 0
                },
                {
                    "sent": "What does informal means is tested?",
                    "label": 0
                },
                {
                    "sent": "Or is it non tested?",
                    "label": 0
                },
                {
                    "sent": "Or is it explicit?",
                    "label": 0
                },
                {
                    "sent": "And then it was also related to.",
                    "label": 0
                },
                {
                    "sent": "There was another very important aspect you mentioned at the last statement you gave.",
                    "label": 0
                },
                {
                    "sent": "Yes, edit producing.",
                    "label": 0
                },
                {
                    "sent": "Informal knowledge, well vast knowledge versus captures, producing knowledge using knowledge.",
                    "label": 0
                },
                {
                    "sent": "Sharing, icing sharing.",
                    "label": 0
                },
                {
                    "sent": "Yeah, well yeah disseminated.",
                    "label": 0
                },
                {
                    "sent": "I would say of sharing and disseminating is the same as capturing it.",
                    "label": 0
                },
                {
                    "sent": "Some disseminating of this knowledge and there was something how to discover this knowledge.",
                    "label": 0
                },
                {
                    "sent": "This was like by reading a book or by talking to friends, right?",
                    "label": 0
                },
                {
                    "sent": "This is 1 sharing aspect.",
                    "label": 0
                },
                {
                    "sent": "If you try to discover a process like.",
                    "label": 0
                },
                {
                    "sent": "I'm new in this company.",
                    "label": 0
                },
                {
                    "sent": "How should I do my travel expenses?",
                    "label": 0
                },
                {
                    "sent": "Can you tell me yes?",
                    "label": 0
                },
                {
                    "sent": "Well there is this template and you have to put in the project.",
                    "label": 0
                },
                {
                    "sent": "I own number and then print it twice because one you have to give to your manager to sign and one you should keep because sometimes it got lost in here and you have to send it again something like this is probably an informal process of your knowledge.",
                    "label": 0
                },
                {
                    "sent": "Of it's an informal process in in your company.",
                    "label": 0
                },
                {
                    "sent": "Well, it's probably a somehow defined one, but well, this for example is tricky part on keeping this copy 'cause it usually get lost.",
                    "label": 0
                },
                {
                    "sent": "It's an additional information here, which redefines the probably defined formal process and makes it kind of informal in this sense.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Communication protocol.",
                    "label": 0
                },
                {
                    "sent": "Classified information is able to send invitations come here for drawing or process for further level race information.",
                    "label": 0
                },
                {
                    "sent": "So how would you send this?",
                    "label": 0
                },
                {
                    "sent": "To whom?",
                    "label": 0
                },
                {
                    "sent": "It's a broadcast to everyone.",
                    "label": 0
                },
                {
                    "sent": "Let's say you have a big company like Accenture.",
                    "label": 0
                },
                {
                    "sent": "Then you send it to 150,000 people.",
                    "label": 0
                },
                {
                    "sent": "Yeah yeah, yeah.",
                    "label": 0
                },
                {
                    "sent": "Find links for to sort things Pacifica.",
                    "label": 0
                },
                {
                    "sent": "Yes, yeah, very good idea.",
                    "label": 0
                },
                {
                    "sent": "OK, I think it was an excellent exercise.",
                    "label": 0
                },
                {
                    "sent": "Things for you or someone would like to add some something more from the discussion.",
                    "label": 0
                },
                {
                    "sent": "OK, thanks for your participation so far.",
                    "label": 0
                },
                {
                    "sent": "Right now you can really relax.",
                    "label": 0
                },
                {
                    "sent": "I don't have any exercise anymore in this letter, I think.",
                    "label": 0
                },
                {
                    "sent": "Well, if I remember correctly, let's see.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "So coming back to the long tail, this is how we started.",
                    "label": 0
                },
                {
                    "sent": "At least this is a topic of the OR the title of the presentation.",
                    "label": 0
                },
                {
                    "sent": "So usually in companies you have there.",
                    "label": 0
                },
                {
                    "sent": "But these are the top sellers.",
                    "label": 0
                },
                {
                    "sent": "The top ten books are best sellers in your store.",
                    "label": 0
                },
                {
                    "sent": "These other high ranked process is which you usually have.",
                    "label": 0
                },
                {
                    "sent": "In your beak.",
                    "label": 0
                },
                {
                    "sent": "Tools in your enterprise using I don't know sapt systems using Microsoft Dynamics or other tools where your process is are statically defined.",
                    "label": 0
                },
                {
                    "sent": "Well, structures with decisions with all.",
                    "label": 0
                },
                {
                    "sent": "Exception capturing and so on.",
                    "label": 1
                },
                {
                    "sent": "So this is enterprise driven so your company has an interest on defining these processes because they have some business value for the overall company.",
                    "label": 0
                },
                {
                    "sent": "At the end there is something which helps the company to measure this process.",
                    "label": 0
                },
                {
                    "sent": "There a lot of people involved in different roles.",
                    "label": 0
                },
                {
                    "sent": "They cover the whole enterprise.",
                    "label": 0
                },
                {
                    "sent": "This is what your enterprise is about.",
                    "label": 0
                },
                {
                    "sent": "Usually your company is producing.",
                    "label": 0
                },
                {
                    "sent": "Cos then this process covers your car production.",
                    "label": 1
                },
                {
                    "sent": "Informal processes which are some here here.",
                    "label": 0
                },
                {
                    "sent": "In the non formalized process table they are more user focused, so it's more user related.",
                    "label": 0
                },
                {
                    "sent": "There are not so many people involved.",
                    "label": 0
                },
                {
                    "sent": "There is more user specific goal behind there.",
                    "label": 0
                },
                {
                    "sent": "Maybe the repetition rate is might be low.",
                    "label": 1
                },
                {
                    "sent": "So there is no business value explicitly seen in this to express it in.",
                    "label": 0
                },
                {
                    "sent": "Maybe the overhead to express this in this heavyweight tools.",
                    "label": 0
                },
                {
                    "sent": "It's too much, so there exists a lot of process is in your company like well, for us it's a travel expense process which is 1 example of this which is never defined anywhere in the tool at Microsoft, but everybody.",
                    "label": 0
                },
                {
                    "sent": "Well, it's also different for the different entities in different locations.",
                    "label": 0
                },
                {
                    "sent": "But it's somewhere defined just in the head of the workers and just related to one worker.",
                    "label": 0
                },
                {
                    "sent": "But my goal is to make my travel expense so that I get the money back.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "And well, my goal is to keep a copy of it as well, because if it's got lost then I don't get the money back.",
                    "label": 0
                },
                {
                    "sent": "Knowledge.",
                    "label": 0
                },
                {
                    "sent": "This is, I think there is no general answer to this, so the question was what kind of percentage are formal process is and how many informal processes I think are in companies.",
                    "label": 0
                },
                {
                    "sent": "OK, I think there is no general answer.",
                    "label": 0
                },
                {
                    "sent": "It's probably domain specific.",
                    "label": 0
                },
                {
                    "sent": "There might be domains where much more process is available, like static business processes, but I would guess it's just a guess.",
                    "label": 0
                },
                {
                    "sent": "I would say it's it's a Pareto.",
                    "label": 0
                },
                {
                    "sent": "It's 20% formal and 80% informal.",
                    "label": 0
                },
                {
                    "sent": "It's my guess, well, what?",
                    "label": 0
                },
                {
                    "sent": "What is your guess?",
                    "label": 0
                },
                {
                    "sent": "Last year trying to prepare data for all the animals around the world, he made said 85% of the analysis part of branding.",
                    "label": 0
                },
                {
                    "sent": "So my guess is not too bad, right?",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Yet now my OK. Um?",
                    "label": 0
                },
                {
                    "sent": "So just well, this is very just very short.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, what we have usually in well in the past there were the structure structure based work well when it started with universalization and so on.",
                    "label": 0
                },
                {
                    "sent": "Then they started to define all the steps and well everybody has only his very focused thing.",
                    "label": 0
                },
                {
                    "sent": "So you have to probably come up with a very structured overall process that everybody knows what to do.",
                    "label": 0
                },
                {
                    "sent": "Now we have the knowledge knowledge worker, he's knowledge based.",
                    "label": 0
                },
                {
                    "sent": "He's very skilled, he's very experienced.",
                    "label": 0
                },
                {
                    "sent": "Well, he has to colorate.",
                    "label": 0
                },
                {
                    "sent": "Here's to exchange his swords and there's kind of shift between now from well from the structured based work tomorrow and the knowledge based work we have to be more adaptive and we have to change.",
                    "label": 0
                },
                {
                    "sent": "We have to be flexible and dynamic in our daily work.",
                    "label": 0
                },
                {
                    "sent": "So if you go to the office I think you don't know what every day is different to the other.",
                    "label": 0
                },
                {
                    "sent": "There's no you don't.",
                    "label": 0
                },
                {
                    "sent": "You cannot go and say OK today it's the same like yesterday.",
                    "label": 0
                },
                {
                    "sent": "I have a meeting at 10.",
                    "label": 0
                },
                {
                    "sent": "Well maybe the meeting is the same but well.",
                    "label": 1
                },
                {
                    "sent": "Definitely not the content and OK today and then you start already in the morning to plan your day like I have to send this Mail.",
                    "label": 0
                },
                {
                    "sent": "I have to ask this.",
                    "label": 0
                },
                {
                    "sent": "I have to prepare this documentation of this slide deck and then probably I can find some time in the afternoon to think about real problems I have to deal with my PhD.",
                    "label": 0
                },
                {
                    "sent": "I have to code and so on and so on.",
                    "label": 1
                },
                {
                    "sent": "And maybe it will at the end of the day you figure out.",
                    "label": 0
                },
                {
                    "sent": "OK, this was the original planning but it was totally different because I didn't do anything for my PhD because my advisor requires me to do this or my manager requires me to do that or that.",
                    "label": 0
                },
                {
                    "sent": "And well, there was no time for coding.",
                    "label": 0
                },
                {
                    "sent": "There was no progress in this probe.",
                    "label": 0
                },
                {
                    "sent": "Because I had to do a lot of other stuff, let's do another day and let spend more time on coding.",
                    "label": 0
                },
                {
                    "sent": "Well, this is how this is actually my my daily business and.",
                    "label": 0
                },
                {
                    "sent": "And as I said, I think I'm not working, so I apply it to everybody, at least in this room, and to all the knowledge worker things, this is the same structure.",
                    "label": 1
                },
                {
                    "sent": "And then when I look at you, I think I'm with you.",
                    "label": 0
                },
                {
                    "sent": "Your daily daily workers is totally.",
                    "label": 0
                },
                {
                    "sent": "Similar to this.",
                    "label": 0
                },
                {
                    "sent": "I'm OK coming back so well.",
                    "label": 0
                },
                {
                    "sent": "We have this.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Formula is part where we have the number of repetitions.",
                    "label": 1
                },
                {
                    "sent": "Maybe this is only what did we say 15% of processes are in this area.",
                    "label": 0
                },
                {
                    "sent": "So for to execute it requires probably not so much knowledge.",
                    "label": 0
                },
                {
                    "sent": "It doesn't mean that well, people who execute this process is kind of dumb person or stupid morons.",
                    "label": 0
                },
                {
                    "sent": "It is just that it doesn't require that much knowledge.",
                    "label": 0
                },
                {
                    "sent": "It's more like, well, it's the knowledge is already in the process somehow.",
                    "label": 0
                },
                {
                    "sent": "Right, you just have to follow some rules.",
                    "label": 0
                },
                {
                    "sent": "Well, there's a checklist.",
                    "label": 0
                },
                {
                    "sent": "OK, this yes, yes yes, yes I did it.",
                    "label": 0
                },
                {
                    "sent": "Done ready everybody.",
                    "label": 0
                },
                {
                    "sent": "Well, this happens also to our work, right?",
                    "label": 0
                },
                {
                    "sent": "Even if we are knowledge workers, it doesn't mean that it's only focused on the subset of people, but maybe you can think about there, probably formal process.",
                    "label": 0
                },
                {
                    "sent": "Maybe here are very skilled persons.",
                    "label": 0
                },
                {
                    "sent": "The experts who can access execute only a small set of process because you need so much knowledge to execute it so.",
                    "label": 0
                },
                {
                    "sent": "With her um?",
                    "label": 0
                },
                {
                    "sent": "With her decree of the formula of the number of repetitions, maybe it could also be means that you risk requires much more knowledge to execute it.",
                    "label": 0
                },
                {
                    "sent": "But coming back to business process, workflows inform knowledge processes.",
                    "label": 0
                },
                {
                    "sent": "So what we know or what we can probably agree on South of.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Flow is a finished set of sequential parallel activities triggered by events.",
                    "label": 1
                },
                {
                    "sent": "Well, you have activities, probably have decisions and an event triggers execution of this.",
                    "label": 0
                },
                {
                    "sent": "Chain of activities.",
                    "label": 0
                },
                {
                    "sent": "It's not I I've taken it from from somewhere from a book about CSWC.",
                    "label": 0
                },
                {
                    "sent": "Well, I think it's it's very simple.",
                    "label": 0
                },
                {
                    "sent": "We don't should fight about this definition, but it's somehow not wrong, I would say.",
                    "label": 0
                },
                {
                    "sent": "I'm but what is a business process?",
                    "label": 0
                },
                {
                    "sent": "Well, a business process is kind of a workflow within economical.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And interest or for economical relevant objects.",
                    "label": 0
                },
                {
                    "sent": "So a business process has a business scope.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, an informal knowledge process.",
                    "label": 0
                },
                {
                    "sent": "As I see it, and it was a long.",
                    "label": 0
                },
                {
                    "sent": "Fight in active as well and to discuss it to come up with a definition, right?",
                    "label": 0
                },
                {
                    "sent": "And I have a more detailed definition later, but just to make it, it's a.",
                    "label": 0
                },
                {
                    "sent": "It's a loosely defined and ramified.",
                    "label": 1
                },
                {
                    "sent": "It's a process of.",
                    "label": 0
                },
                {
                    "sent": "Is this collection of loosely ramified activities or actions?",
                    "label": 1
                },
                {
                    "sent": "And which are necessary for processing of user relevant data into chief user relevant goals so it looks much more easy because one instant of knowledge, informal knowledge process.",
                    "label": 1
                },
                {
                    "sent": "Well now it's formal knowledge process, right?",
                    "label": 0
                },
                {
                    "sent": "It's just one straight line of actions.",
                    "label": 0
                },
                {
                    "sent": "Well, becausw, let's let's tell the truth.",
                    "label": 0
                },
                {
                    "sent": "We're not really multithreaded.",
                    "label": 0
                },
                {
                    "sent": "If we extracted from our daily work and we would put it in one context, then it is exactly is a sequence of actions we are doing to reach a goal.",
                    "label": 0
                },
                {
                    "sent": "But well, what happens if we try to do it once again?",
                    "label": 0
                },
                {
                    "sent": "Then the process might look like this, right?",
                    "label": 0
                },
                {
                    "sent": "So we discovered this step is not anymore available becauses as this person is not anymore in this office, it's too late.",
                    "label": 0
                },
                {
                    "sent": "I have to use a different tool.",
                    "label": 0
                },
                {
                    "sent": "I figured out it's much better to do it like this.",
                    "label": 0
                },
                {
                    "sent": "And the next time maybe I do it like this.",
                    "label": 0
                },
                {
                    "sent": "Could happen, right or?",
                    "label": 0
                },
                {
                    "sent": "Um, I do it like this or.",
                    "label": 0
                },
                {
                    "sent": "This I think.",
                    "label": 0
                },
                {
                    "sent": "So this is what it means by it's a ramified activity, so there is.",
                    "label": 0
                },
                {
                    "sent": "For one instant it looks very simple, but if we look on many execution paths then it becomes much more complex and who tells you what is the right path and what is wrong path.",
                    "label": 0
                },
                {
                    "sent": "So we're sorry.",
                    "label": 0
                },
                {
                    "sent": "Yes, how do you measure the result?",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "Now it looks like this.",
                    "label": 0
                },
                {
                    "sent": "OK, once again.",
                    "label": 0
                },
                {
                    "sent": "Just to summarize this.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So a business process has a business goal driven is more in the enterprise.",
                    "label": 1
                },
                {
                    "sent": "Scope is a static.",
                    "label": 0
                },
                {
                    "sent": "It's former.",
                    "label": 0
                },
                {
                    "sent": "There is someone super user who is coordinating this.",
                    "label": 0
                },
                {
                    "sent": "Who is defining this.",
                    "label": 1
                },
                {
                    "sent": "It's properly monitored, analyzed, and optimized, so this is what business intelligence is doing.",
                    "label": 0
                },
                {
                    "sent": "This is why we have all these business process management tools to be able to monitor the execution and to optimize it.",
                    "label": 0
                },
                {
                    "sent": "We can expresses in key performance indicators and so on.",
                    "label": 0
                },
                {
                    "sent": "There was a lot of business work related to this.",
                    "label": 0
                },
                {
                    "sent": "Informal process I think.",
                    "label": 0
                },
                {
                    "sent": "Maybe we can discuss it later over lunch.",
                    "label": 0
                },
                {
                    "sent": "Maybe after the talk.",
                    "label": 0
                },
                {
                    "sent": "I think it's more user goal driven, has a very individual scope.",
                    "label": 0
                },
                {
                    "sent": "Well, it's maybe the result might impact the enterprise for sure, but we are not doing our work just for not on purpose but.",
                    "label": 0
                },
                {
                    "sent": "In our hands, let's say in this way where we've seen it could be ramified, it's well, it's not that formal.",
                    "label": 0
                },
                {
                    "sent": "Well, it's many informants at Hawk.",
                    "label": 0
                },
                {
                    "sent": "Sometimes it spontaneous, sometimes sometimes it's planned.",
                    "label": 0
                },
                {
                    "sent": "I don't want to say that we are not doing plant work, but we plan it somehow and then we change our structure probably while executing.",
                    "label": 0
                },
                {
                    "sent": "So we are changing it at Hawk because we figure out that this task might not.",
                    "label": 0
                },
                {
                    "sent": "It's not anymore relevant.",
                    "label": 0
                },
                {
                    "sent": "And so on.",
                    "label": 0
                },
                {
                    "sent": "And usually it's not monitored.",
                    "label": 1
                },
                {
                    "sent": "And as we have seen, it's probably emerging because of first quality.",
                    "label": 0
                },
                {
                    "sent": "Of the fruit is the quality of the 1st result is probably not sufficient.",
                    "label": 0
                },
                {
                    "sent": "But it's OK, and the next time we know well it was not sufficient, so let's improve the process and to produce a more sufficient result.",
                    "label": 0
                },
                {
                    "sent": "And this is probably the motivation to change the process overtime.",
                    "label": 0
                },
                {
                    "sent": "So in this way, it's emerging.",
                    "label": 0
                },
                {
                    "sent": "OK, skip this slide.",
                    "label": 0
                },
                {
                    "sent": "I want to talk because of this emerge.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So how could another process?",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We become a business process.",
                    "label": 1
                },
                {
                    "sent": "This is also possible I think, I believe because let's say there is a startup you don't start with a heavyweight enterprise tool for your business process isn't defined it in advance, absolutely no motivation to do this.",
                    "label": 0
                },
                {
                    "sent": "We have other tasks to do.",
                    "label": 1
                },
                {
                    "sent": "You don't think about business processes, but well, let's assume you startup is successful and becomes.",
                    "label": 0
                },
                {
                    "sent": "More, uh, for a serious company and then at some point I'm a certain threshold of probably employees.",
                    "label": 0
                },
                {
                    "sent": "You might want to think about.",
                    "label": 0
                },
                {
                    "sent": "Let's put some of these.",
                    "label": 0
                },
                {
                    "sent": "Well, we have already established informal process is and turns them into business process is and then you can start to see and to analyze how all this process is.",
                    "label": 0
                },
                {
                    "sent": "Sit down then and look back the last five years.",
                    "label": 0
                },
                {
                    "sent": "How you since your company was emerging.",
                    "label": 0
                },
                {
                    "sent": "Then you would look on different processes.",
                    "label": 0
                },
                {
                    "sent": "You would figure out well at the beginning we had no clue how to do this or that and then then we figure out how to do it.",
                    "label": 0
                },
                {
                    "sent": "And finally this is exactly the result.",
                    "label": 1
                },
                {
                    "sent": "This group is a business process for us and then it becomes static and.",
                    "label": 0
                },
                {
                    "sent": "We transformed it from informal way to execute processes in a more formal one, and we can store it in heavy by process.",
                    "label": 0
                },
                {
                    "sent": "Business process management tools.",
                    "label": 0
                },
                {
                    "sent": "We can buy them.",
                    "label": 0
                },
                {
                    "sent": "We can spend a lot of money to help to manage this.",
                    "label": 0
                },
                {
                    "sent": "OK, now let's come to a more concrete definition on.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And what could be knowledge process?",
                    "label": 0
                },
                {
                    "sent": "I hope this is more concrete.",
                    "label": 0
                },
                {
                    "sent": "What I already said, it's loosely defined and structural ramified collection of activities.",
                    "label": 1
                },
                {
                    "sent": "It's not fully defined in terms of structure and the order of actions are at its point.",
                    "label": 1
                },
                {
                    "sent": "Not defined when I start the process, I might change the order and I might decide after each step which is the next one.",
                    "label": 0
                },
                {
                    "sent": "So I need the input of the current step to decide what could be the best next step.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "At each action you require as you as an actor decide what to do of the follow up action about the full objection.",
                    "label": 0
                },
                {
                    "sent": "Using your skills, your experiences, your contact information.",
                    "label": 1
                },
                {
                    "sent": "Current situation, well, this is context, right?",
                    "label": 0
                },
                {
                    "sent": "And, well, I think this is mainly what is a knowledge process about.",
                    "label": 0
                },
                {
                    "sent": "One example how this carries out overtime.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "At the beginning we can have like a loosely coupled set of actions activities, so this is a start time, so there might be admissible activities which seems to be useful to start with.",
                    "label": 1
                },
                {
                    "sent": "So Bob picks with just One South.",
                    "label": 0
                },
                {
                    "sent": "He picks activity or action one and as soon as he's in action one and he is finished.",
                    "label": 0
                },
                {
                    "sent": "This action, then the follow up actions.",
                    "label": 0
                },
                {
                    "sent": "A set of admissible actions.",
                    "label": 0
                },
                {
                    "sent": "My change.",
                    "label": 0
                },
                {
                    "sent": "And then he can pick using this context information.",
                    "label": 0
                },
                {
                    "sent": "The next action, and so he carries out this process.",
                    "label": 0
                },
                {
                    "sent": "So first it's a one.",
                    "label": 0
                },
                {
                    "sent": "Then he picks here A2 and then it changed.",
                    "label": 0
                },
                {
                    "sent": "Now a three comes.",
                    "label": 0
                },
                {
                    "sent": "Into the set of admissible actions, and he picks, but he decided to take a four, and then after a 40 PX A3, and finally might pick a 5 and so on.",
                    "label": 0
                },
                {
                    "sent": "So this is the way he carries out.",
                    "label": 0
                },
                {
                    "sent": "So this is usually how you write your To Do List and then you decide.",
                    "label": 0
                },
                {
                    "sent": "Well, let's do this like this or in this order.",
                    "label": 0
                },
                {
                    "sent": "But every time you re sync a little bit, is this really the best follow up action or my pisanu action coming into it into this picture, which I should now do as a sub action or something like this?",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Well, it could also be like this if we compare our knowledge process is between different people.",
                    "label": 0
                },
                {
                    "sent": "There is Bob.",
                    "label": 0
                },
                {
                    "sent": "There is Alice and there's another execution of Bob.",
                    "label": 0
                },
                {
                    "sent": "It's about preparation of.",
                    "label": 0
                },
                {
                    "sent": "Of a presentation?",
                    "label": 0
                },
                {
                    "sent": "Well, you might go to URL.",
                    "label": 1
                },
                {
                    "sent": "You identifies information.",
                    "label": 0
                },
                {
                    "sent": "You copy, information, you open PowerPoint, you paste information, talk to another person together to collect new information, and to save this presentation.",
                    "label": 1
                },
                {
                    "sent": "It's a very well.",
                    "label": 0
                },
                {
                    "sent": "Very simple process, right?",
                    "label": 0
                },
                {
                    "sent": "Alice is doing it like this.",
                    "label": 0
                },
                {
                    "sent": "She also starts in the Internet.",
                    "label": 0
                },
                {
                    "sent": "While this is most most likely the best way to start, this is how we proceed.",
                    "label": 0
                },
                {
                    "sent": "Let's start a Bing search, right?",
                    "label": 0
                },
                {
                    "sent": "This is what we're doing right now.",
                    "label": 0
                },
                {
                    "sent": "Nobody is doing anymore.",
                    "label": 0
                },
                {
                    "sent": "Google search.",
                    "label": 0
                },
                {
                    "sent": "Everybody is doing.",
                    "label": 0
                },
                {
                    "sent": "Bing search no.",
                    "label": 0
                },
                {
                    "sent": "This was the right question.",
                    "label": 0
                },
                {
                    "sent": "This was a wrong question.",
                    "label": 0
                },
                {
                    "sent": "Thanks Marco.",
                    "label": 0
                },
                {
                    "sent": "Sorry bro.",
                    "label": 0
                },
                {
                    "sent": "Can you probably leave the room now?",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "But then the order can change, right?",
                    "label": 0
                },
                {
                    "sent": "Bob in the 2nd way prefers to talk first to another person to see if this information is really relevant.",
                    "label": 0
                },
                {
                    "sent": "We cannot trust the Internet.",
                    "label": 0
                },
                {
                    "sent": "We know.",
                    "label": 0
                },
                {
                    "sent": "Even if this is written down in Wikipedia, this might not be correct.",
                    "label": 0
                },
                {
                    "sent": "So ask someone else.",
                    "label": 0
                },
                {
                    "sent": "And Alice decided or OK, I have no information.",
                    "label": 0
                },
                {
                    "sent": "Let's start with the presentation.",
                    "label": 0
                },
                {
                    "sent": "Elias is very pragmatic and tries to come up with a solution very soon.",
                    "label": 0
                },
                {
                    "sent": "So open the presentation.",
                    "label": 0
                },
                {
                    "sent": "Paste information.",
                    "label": 0
                },
                {
                    "sent": "I'm done OK. At the end she also talks about she talks to another person, maybe just to verify what she put in.",
                    "label": 0
                },
                {
                    "sent": "The presentation is OK.",
                    "label": 0
                },
                {
                    "sent": "So what what?",
                    "label": 0
                },
                {
                    "sent": "What can we see here?",
                    "label": 0
                },
                {
                    "sent": "So there might be some actions which might depend on previous action or it doesn't make sense to paste information before I copied it.",
                    "label": 0
                },
                {
                    "sent": "It does work, right?",
                    "label": 0
                },
                {
                    "sent": "And also saving a presentation before I opened it is also useless, but there might be actions which are not depending on other actions.",
                    "label": 1
                },
                {
                    "sent": "So talk to another person.",
                    "label": 0
                },
                {
                    "sent": "I can do it everywhere in this in this process chain will go to URL and identifying information is probably also dependent.",
                    "label": 0
                },
                {
                    "sent": "So I can probably cluster this kind of actions and and then reshuffle it and do something else.",
                    "label": 0
                },
                {
                    "sent": "And this is what what you can figure out, probably also from the mining.",
                    "label": 0
                },
                {
                    "sent": "So if you mind all this active actions.",
                    "label": 0
                },
                {
                    "sent": "And put it in the database and you figure out OK there.",
                    "label": 0
                },
                {
                    "sent": "First of all, there might be some dependencies, but there might also be some.",
                    "label": 0
                },
                {
                    "sent": "Finally some patterns of actions which usually people do to prepare a presentation and then you can cluster it and come up with recommendations of follow up task and so on.",
                    "label": 0
                },
                {
                    "sent": "OK, this was as a baseline.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Motivation now I can start to talk about stuff inactive so we have seen there are formal processes, but there might also be an informal process.",
                    "label": 0
                },
                {
                    "sent": "Is writing a proposal is also very kind of informal process because, well, it's usually have probably well.",
                    "label": 1
                },
                {
                    "sent": "It's not really defined what you should do, but you kind of know what you have to do to write proposed you have the structure.",
                    "label": 0
                },
                {
                    "sent": "You will know that you have to find a consortium you know which kind of people you try to look for.",
                    "label": 0
                },
                {
                    "sent": "You know if it's a framework program proposal, then you should know how this consulting should look like.",
                    "label": 0
                },
                {
                    "sent": "Which companies should be kind of covered?",
                    "label": 0
                },
                {
                    "sent": "So it's informed even if well, it looks very formal, but it's a very informal process to write a proposal.",
                    "label": 0
                },
                {
                    "sent": "I would say scheduling a meeting is the most simplest process, which is I think it's informed because everybody could do it in a different way, and it's not written down how to schedule a meeting.",
                    "label": 0
                },
                {
                    "sent": "Preparing a bit is a little bit like writing a proposal.",
                    "label": 0
                },
                {
                    "sent": "An so on travel expenses.",
                    "label": 1
                },
                {
                    "sent": "There are some examples of this right?",
                    "label": 0
                },
                {
                    "sent": "And we know now from from the last conference for Business work.",
                    "label": 0
                },
                {
                    "sent": "Well, there there are 85% which are more informal and only 15% which are formal.",
                    "label": 0
                },
                {
                    "sent": "And usually I would say.",
                    "label": 0
                },
                {
                    "sent": "To cover this informal process is, we don't need any SFP tools, not why because it's from SFP, we don't need dynamics.",
                    "label": 0
                },
                {
                    "sent": "This is from Microsoft.",
                    "label": 0
                },
                {
                    "sent": "I can blame this guys for covering this informal process.",
                    "label": 0
                },
                {
                    "sent": "It's too heavyweight, so there must be something more lightweight.",
                    "label": 0
                },
                {
                    "sent": "It should be run on your desktop.",
                    "label": 0
                },
                {
                    "sent": "Maybe it should be run somewhere easily in your enterprise in your organization.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "Whatever.",
                    "label": 0
                },
                {
                    "sent": "There are tools, definitely.",
                    "label": 0
                },
                {
                    "sent": "There are tools and Julian will have some very nice names of tools who are doing it, so I'm not trying to reinvent the wheel right, but it should be definitely lightweight.",
                    "label": 0
                },
                {
                    "sent": "Lightweight you can probably most probably associate, probably with back to web to related or something.",
                    "label": 0
                },
                {
                    "sent": "Is knowledge worker driven?",
                    "label": 0
                },
                {
                    "sent": "Social knowledge should be in the in the in the foreground, not business, not the enterprise.",
                    "label": 0
                },
                {
                    "sent": "Context awareness is very important, well and at the end it's about informal process.",
                    "label": 0
                },
                {
                    "sent": "I know I have to speed up a little bit, I think.",
                    "label": 0
                },
                {
                    "sent": "OK, I'm",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This process is inactive.",
                    "label": 0
                },
                {
                    "sent": "I skip this slide even if it's important.",
                    "label": 0
                },
                {
                    "sent": "You can read it.",
                    "label": 0
                },
                {
                    "sent": "It's very important, but the main message here is.",
                    "label": 0
                },
                {
                    "sent": "It should enhance the knowledge workers effectiveness and efficiency by coming up with prediction of follow up task with recommendations.",
                    "label": 1
                },
                {
                    "sent": "What you can do, which information he can find, which people he should talk she he or she should talk to.",
                    "label": 0
                },
                {
                    "sent": "It's a little bit well.",
                    "label": 0
                },
                {
                    "sent": "It's again knowledge management.",
                    "label": 0
                },
                {
                    "sent": "In in in, well, it's like knowledge management.",
                    "label": 0
                },
                {
                    "sent": "OK, what we did let me talk about.",
                    "label": 0
                },
                {
                    "sent": "I guess you all are very feet on the ground like techniques, coding and so on.",
                    "label": 0
                },
                {
                    "sent": "Database schemers and OK I will try to come up with something.",
                    "label": 1
                },
                {
                    "sent": "OK what we did very simple is we started like OK we will have something which is able to cover tasks.",
                    "label": 0
                },
                {
                    "sent": "Task in terms of task is, well, it's a collection of as we have seen of activities or it's.",
                    "label": 0
                },
                {
                    "sent": "It's like the set of activities you have.",
                    "label": 0
                },
                {
                    "sent": "Probably it could be structured as parent and sub.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Task it has a set of admissible actions which you can see so you can find everything with what I have mentioned so far in this diagram.",
                    "label": 0
                },
                {
                    "sent": "Two tasks are sources associated.",
                    "label": 0
                },
                {
                    "sent": "We are going to log and task executions.",
                    "label": 1
                },
                {
                    "sent": "We know when it start, we know when it stops, which user executed.",
                    "label": 0
                },
                {
                    "sent": "Everything goes in the database, so there are different states of us could be in there and to contact asks for sure.",
                    "label": 0
                },
                {
                    "sent": "This is important and resources could be a word file, a PDF file.",
                    "label": 0
                },
                {
                    "sent": "It could be a URL, it could be email, it could be whatever you can think about.",
                    "label": 0
                },
                {
                    "sent": "It could even be a person, right?",
                    "label": 0
                },
                {
                    "sent": "And well, there should be some, and I think ego is maybe going to present something around the active network space.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "There's some UI, a taskbar which helps you to organize your tasks to see your task.",
                    "label": 0
                },
                {
                    "sent": "I think Paul has shown a screenshot of this snow.",
                    "label": 0
                },
                {
                    "sent": "Didn't you mention it that you?",
                    "label": 0
                },
                {
                    "sent": "OK OK OK you will see.",
                    "label": 0
                },
                {
                    "sent": "And value which helps you on the client side to organize your record.",
                    "label": 1
                },
                {
                    "sent": "Your task to structure to associated with resources and so on.",
                    "label": 0
                },
                {
                    "sent": "And then you can probably have in the task execution like a chain of different task.",
                    "label": 0
                },
                {
                    "sent": "You can see like these are clustered by users.",
                    "label": 0
                },
                {
                    "sent": "So in the task execution there are different users executing tasks and you can trust that by blue user by orange shoes are incorrect user and later on you can say if a person is executed action and action two you can say which with.",
                    "label": 0
                },
                {
                    "sent": "Probability he, well, he will probably execute A3 or a four so very easy and straightforward, yes.",
                    "label": 0
                },
                {
                    "sent": "Yes, I think it's not covered in the scheme.",
                    "label": 0
                },
                {
                    "sent": "Well, good point.",
                    "label": 0
                },
                {
                    "sent": "So let me let me.",
                    "label": 0
                },
                {
                    "sent": "I think I have it on the in two slides you can see the collaboration.",
                    "label": 0
                },
                {
                    "sent": "You can see the at least one idea for the collaboration.",
                    "label": 0
                },
                {
                    "sent": "It's not covered in the schema, but it's covered in the process.",
                    "label": 0
                },
                {
                    "sent": "How to use the tools developed by active.",
                    "label": 0
                },
                {
                    "sent": "Well, for the task management I want to.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Go too much into detail, just to mention about it.",
                    "label": 0
                },
                {
                    "sent": "The task is exposed as a web service.",
                    "label": 0
                },
                {
                    "sent": "You have different methods, not very fancy, no rocket science here, right?",
                    "label": 0
                },
                {
                    "sent": "Everybody is able to write a web service even in.net.",
                    "label": 0
                },
                {
                    "sent": "And exposes as this and now come.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Link to how to share?",
                    "label": 0
                },
                {
                    "sent": "Task I don't have a running demo on my machine, but actually what you can do is you can in the taskbar you can connect and you can export it to the Semantic Mediawiki.",
                    "label": 0
                },
                {
                    "sent": "I don't know if Danny has mentioned the process visualization in the semantic Mediawiki they are currently working on.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's a big secret.",
                    "label": 0
                },
                {
                    "sent": "Sorry, we cannot publish this video because I. I'm talking about confidential information here.",
                    "label": 0
                },
                {
                    "sent": "No, I'm kidding.",
                    "label": 0
                },
                {
                    "sent": "So semantic video, Vicki?",
                    "label": 0
                },
                {
                    "sent": "They're going to have some extensions for process.",
                    "label": 0
                },
                {
                    "sent": "Well, visualization and expressiveness to express process is not inform knowledge process inside some semantic Mediawiki.",
                    "label": 0
                },
                {
                    "sent": "What we're doing here is we are kind of exposing this scheme are what we have like here and store it in the semantic.",
                    "label": 0
                },
                {
                    "sent": "Import it into the Semantic Mediawiki insights of Vicki and use of wiki as a collaboration platform to share these process is, let's say as templates.",
                    "label": 0
                },
                {
                    "sent": "And then a user can import it from there, execute this process, modify it and change it and save its own.",
                    "label": 0
                },
                {
                    "sent": "His new version inside the wiki.",
                    "label": 0
                },
                {
                    "sent": "So does this cover your?",
                    "label": 0
                },
                {
                    "sent": "Collaboration aspect so it's it's using the wiki as a platform to share and to collaborate in terms of process.",
                    "label": 0
                },
                {
                    "sent": "It's not collaborating that inside the process it's collaborating with them as well.",
                    "label": 0
                },
                {
                    "sent": "Changing the information about the process.",
                    "label": 0
                },
                {
                    "sent": "I cannot.",
                    "label": 0
                },
                {
                    "sent": "Operated so I can give let's say 30 ritual collaboration credits and two others waiting.",
                    "label": 0
                },
                {
                    "sent": "So next time we will really help me more.",
                    "label": 0
                },
                {
                    "sent": "Failed system in order to motivate people.",
                    "label": 0
                },
                {
                    "sent": "This is related to incentives.",
                    "label": 0
                },
                {
                    "sent": "Somehow, so why should they collaborate?",
                    "label": 0
                },
                {
                    "sent": "Why should they share?",
                    "label": 0
                },
                {
                    "sent": "OK, yeah, spend some effort.",
                    "label": 0
                },
                {
                    "sent": "Yeah yeah yeah.",
                    "label": 0
                },
                {
                    "sent": "Well, it's it's.",
                    "label": 0
                },
                {
                    "sent": "I'm having a motivation system inside it.",
                    "label": 0
                },
                {
                    "sent": "I see, well, yeah, this is.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I I fully agree with this point.",
                    "label": 0
                },
                {
                    "sent": "So what we're doing in active we're tried to understand what could be.",
                    "label": 0
                },
                {
                    "sent": "Well, the motivation for people to use this tools to collaborate to exchange the knowledge.",
                    "label": 0
                },
                {
                    "sent": "And there is explicitly a work package around, so it's about they're looking on on what are the costs more from an enterprise perspective, and but what other incentives?",
                    "label": 0
                },
                {
                    "sent": "Also for for one on one side for the for the organization, but maybe also form on the other side for person to collaborate to use these tools?",
                    "label": 0
                },
                {
                    "sent": "I'm not sure all is going to talk about this.",
                    "label": 0
                },
                {
                    "sent": "I guess he's not going to talk about it, but well, it's definitely in this project and but we haven't a good.",
                    "label": 0
                },
                {
                    "sent": "We don't have a good answer yet.",
                    "label": 0
                },
                {
                    "sent": "To this, I would say we are it's 1 1/2 year old and well we have now the basic functionality.",
                    "label": 0
                },
                {
                    "sent": "I would say now we can build on top of this and to discover this kind of topics, But this is very good to remark some.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "What?",
                    "label": 0
                },
                {
                    "sent": "Looking on on the different levels, so I guess someone wiser Marco or Paul has explained what the logo means.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "No, nobody did.",
                    "label": 0
                },
                {
                    "sent": "Oh what a pleasure, what inactive.",
                    "label": 0
                },
                {
                    "sent": "We try to have two approaches.",
                    "label": 0
                },
                {
                    "sent": "So one is the classical.",
                    "label": 0
                },
                {
                    "sent": "I would say the top down approach where you define the process is where the will and then where you store it when then execute it.",
                    "label": 0
                },
                {
                    "sent": "So this is what I'm talking about right?",
                    "label": 0
                },
                {
                    "sent": "I tried to talk about well, what could be a structure to define this process is there is still the question of what could be the motivation to define my processes into storage.",
                    "label": 0
                },
                {
                    "sent": "Very good one.",
                    "label": 0
                },
                {
                    "sent": "So this is top down.",
                    "label": 0
                },
                {
                    "sent": "And yesterday there was there were at least two sessions about mining and bottom up so we have data in the database.",
                    "label": 0
                },
                {
                    "sent": "Let's assume we have a lot of data collected by system interaction in the database like actions, events.",
                    "label": 0
                },
                {
                    "sent": "We have this from one case study from Cadence.",
                    "label": 0
                },
                {
                    "sent": "For example, Cadence is a chip design company.",
                    "label": 0
                },
                {
                    "sent": "And what they have they have already a system and they know exactly what the chip designers which tools they use, and they store this execution in the database.",
                    "label": 0
                },
                {
                    "sent": "So we have this data already and now.",
                    "label": 0
                },
                {
                    "sent": "Let's say Marco's team is going to analyze this data to mind this data with some fancy algorithms.",
                    "label": 0
                },
                {
                    "sent": "And come up with with with patterns in this data and to identify tasks.",
                    "label": 0
                },
                {
                    "sent": "So this is a bottom up approach right where we have raw data and try to make some sense out of this raw data.",
                    "label": 0
                },
                {
                    "sent": "And this is where it meets there some bottom up, so we have some bottom on the bottom.",
                    "label": 0
                },
                {
                    "sent": "We have events we try to cluster them.",
                    "label": 0
                },
                {
                    "sent": "We try to mine them.",
                    "label": 0
                },
                {
                    "sent": "We try to identify patterns bottom up on the other side.",
                    "label": 0
                },
                {
                    "sent": "We are coming from top down from the business process from the user level scheduling meeting top down.",
                    "label": 0
                },
                {
                    "sent": "And this is exactly what the active logo.",
                    "label": 0
                },
                {
                    "sent": "Where is the active logo.",
                    "label": 0
                },
                {
                    "sent": "It's not on the slide where you know the active logo.",
                    "label": 0
                },
                {
                    "sent": "So there is 1, the blue one.",
                    "label": 0
                },
                {
                    "sent": "Is top down and the orange one is bottom up.",
                    "label": 0
                },
                {
                    "sent": "So this is see active logo about so it's kind of combining both approaches top down and bottom up, and this is also covered by the active logo.",
                    "label": 0
                },
                {
                    "sent": "I would have expected either Paul or Mark came up with this explanation.",
                    "label": 0
                },
                {
                    "sent": "So and this is what we try to do right?",
                    "label": 0
                },
                {
                    "sent": "So this is also what this picture is about on the bottom line we have raw data, we have events we're going to cluster them on the other side.",
                    "label": 0
                },
                {
                    "sent": "We know maybe business process.",
                    "label": 0
                },
                {
                    "sent": "We try to break them down into formal informal process or knowledge.",
                    "label": 0
                },
                {
                    "sent": "Process is on the user level.",
                    "label": 0
                },
                {
                    "sent": "And finally we have to match them.",
                    "label": 0
                },
                {
                    "sent": "No, no question at this point.",
                    "label": 0
                },
                {
                    "sent": "There are no questions allowed.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "It's on the next slide, maybe right the previous slide.",
                    "label": 0
                },
                {
                    "sent": "Yeah here.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Yeah right, it looks like a person on one side right?",
                    "label": 0
                },
                {
                    "sent": "And on the other side it's top down and bottom up.",
                    "label": 0
                },
                {
                    "sent": "So we spent one year in developing this logo and.",
                    "label": 0
                },
                {
                    "sent": "Find this.",
                    "label": 0
                },
                {
                    "sent": "Meeting in Frankfurt.",
                    "label": 0
                },
                {
                    "sent": "I guess part of their VR journalism.",
                    "label": 0
                },
                {
                    "sent": "Before the project started, yeah.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sure, yeah, I wasn't my.",
                    "label": 0
                },
                {
                    "sent": "I was kidding that it costs us one year.",
                    "label": 0
                },
                {
                    "sent": "I guess everybody got this right this.",
                    "label": 0
                },
                {
                    "sent": "You have a question or remark.",
                    "label": 0
                },
                {
                    "sent": "Waterfall.",
                    "label": 0
                },
                {
                    "sent": "So around 81 back office access so please process isn't very well, yeah.",
                    "label": 0
                },
                {
                    "sent": "Well, it's well, it's iterative incremental, I would say.",
                    "label": 0
                },
                {
                    "sent": "I would say waterfall.",
                    "label": 0
                },
                {
                    "sent": "I associate more like you define it and then you, that's it.",
                    "label": 0
                },
                {
                    "sent": "But I heard that it's probably wrong understanding of waterfall on my side that auto in water for you go back and redefine it.",
                    "label": 0
                },
                {
                    "sent": "There is some iteration I think right?",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, well it's it's.",
                    "label": 0
                },
                {
                    "sent": "This is a tricky party and we're not.",
                    "label": 0
                },
                {
                    "sent": "We haven't right.",
                    "label": 0
                },
                {
                    "sent": "We haven't solved yet now to connect really.",
                    "label": 0
                },
                {
                    "sent": "Both.",
                    "label": 0
                },
                {
                    "sent": "This is a really really tricky part here so.",
                    "label": 0
                },
                {
                    "sent": "James I still working on when Michael talked about it right about that they are able to identify patterns, context and so on.",
                    "label": 0
                },
                {
                    "sent": "On the other side we are able to define tasks, subtasks, actions.",
                    "label": 0
                },
                {
                    "sent": "But now we have.",
                    "label": 0
                },
                {
                    "sent": "We have to bring both systems together.",
                    "label": 0
                },
                {
                    "sent": "This will happen in the next month.",
                    "label": 0
                },
                {
                    "sent": "So next summer school.",
                    "label": 0
                },
                {
                    "sent": "Well I think we can present you exactly how this works and how the solution could look like.",
                    "label": 0
                },
                {
                    "sent": "We have some rough ideas, but we have fully two to continue working on exactly this.",
                    "label": 0
                },
                {
                    "sent": "This interface between those post levels.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "I forgotten to enter.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right here.",
                    "label": 0
                },
                {
                    "sent": "OK. What you also want to do is.",
                    "label": 0
                },
                {
                    "sent": "Oh, it's the wrong slide, sorry.",
                    "label": 0
                },
                {
                    "sent": "What we also want to do is we want to like we would like to measure.",
                    "label": 0
                },
                {
                    "sent": "This process is.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "To come up with like, well on one side, we can say OK, the probability or the prediction is that this is your next task.",
                    "label": 0
                },
                {
                    "sent": "But we can also.",
                    "label": 0
                },
                {
                    "sent": "So these are the last two guys who left the room.",
                    "label": 0
                },
                {
                    "sent": "Nobody else going to use this room.",
                    "label": 0
                },
                {
                    "sent": "So what we also can do is and we can kind of measure are we quantify.",
                    "label": 0
                },
                {
                    "sent": "This informal process is to say, OK, most probably this is the next task.",
                    "label": 0
                },
                {
                    "sent": "But in your situation it might be better, or it might save some costs or some time to execute this task.",
                    "label": 0
                },
                {
                    "sent": "And for this we associate we try to find we try to define different measures for knowledge processes which might be the size or.",
                    "label": 0
                },
                {
                    "sent": "Well, the dependability like the dependability is in an out of information and maybe there is some activity in between.",
                    "label": 0
                },
                {
                    "sent": "Or maybe there is no activity in between because if there are a lot of activities in between before you kind of reuse information you discovered here, you might lose some information which happened to me if I try to summarize, for example, what.",
                    "label": 0
                },
                {
                    "sent": "You reply to the exercises.",
                    "label": 0
                },
                {
                    "sent": "Well, first I ask someone and I ask another guy and then I try to summarize what happened.",
                    "label": 0
                },
                {
                    "sent": "Well, what you told me and I'm well, I wasn't able to recover everything.",
                    "label": 0
                },
                {
                    "sent": "What what you taught me?",
                    "label": 0
                },
                {
                    "sent": "So this is 1 very good example that there was an activity in between and a lot of information.",
                    "label": 0
                },
                {
                    "sent": "Well, because I did something else.",
                    "label": 0
                },
                {
                    "sent": "So this is dependability.",
                    "label": 0
                },
                {
                    "sent": "Then we define divisibility separability in structural complexity on on this structure, like how many other nodes are involved.",
                    "label": 0
                },
                {
                    "sent": "How many different systems you use.",
                    "label": 0
                },
                {
                    "sent": "Either you have to switch from phone to your computer while someone is telling you some information on the phone and then you have to switch to the computer and have to learn to transform it into electronical information.",
                    "label": 0
                },
                {
                    "sent": "That might also a lot of information.",
                    "label": 0
                },
                {
                    "sent": "It's better to have it like if you chat with someone then you can directly copy it from the history or something like this.",
                    "label": 0
                },
                {
                    "sent": "Different information and different systems and so on.",
                    "label": 0
                },
                {
                    "sent": "This is covered here.",
                    "label": 0
                },
                {
                    "sent": "There might be some user dependable values as well, which are very important.",
                    "label": 0
                },
                {
                    "sent": "Like this kills a user has and the feasibility a user can use certain activities, resources or people.",
                    "label": 0
                },
                {
                    "sent": "It doesn't make sense that probably Bob we recommend to Bob to execute on this stage.",
                    "label": 0
                },
                {
                    "sent": "This action C becausw well it's vice versa and it doesn't make sense to recommend to Alice that because set requires Dave, but at least might not know Dave and there's no connection between Alice and Dave, so this activity is not feasible for her.",
                    "label": 0
                },
                {
                    "sent": "Well, the skill is definitely very important.",
                    "label": 0
                },
                {
                    "sent": "It might.",
                    "label": 0
                },
                {
                    "sent": "It doesn't make sense to use Emacs if you don't have a mic skills then you should better use.",
                    "label": 0
                },
                {
                    "sent": "I don't know Notepad, it's simple but simple and useless.",
                    "label": 0
                },
                {
                    "sent": "But in this case you might be successful by using Notepad instead of Emacs.",
                    "label": 0
                },
                {
                    "sent": "And so on.",
                    "label": 0
                },
                {
                    "sent": "The rest is subjective values.",
                    "label": 1
                },
                {
                    "sent": "This is very it's related to what you said, quality of the result.",
                    "label": 1
                },
                {
                    "sent": "It's very hard to measure the quality of result, so you just can ask the user somehow.",
                    "label": 0
                },
                {
                    "sent": "Are you happy with your result and he can rank it?",
                    "label": 0
                },
                {
                    "sent": "Yes, no sufficient excellent.",
                    "label": 0
                },
                {
                    "sent": "And if it's if he's more or less, he should try to be objective on this.",
                    "label": 0
                },
                {
                    "sent": "And I guess I user can definitely say, OK, I wrote this paper, but will this paper is Crip anyhow?",
                    "label": 0
                },
                {
                    "sent": "This happens to us, right?",
                    "label": 0
                },
                {
                    "sent": "And here you have to get some feedback from the user to evaluate what what the process is about to evaluate.",
                    "label": 0
                },
                {
                    "sent": "If this was successful, this helps you to come up with numbers, but also the satisfaction of the process.",
                    "label": 0
                },
                {
                    "sent": "You should not underestimate if you are unhappy with doing it in this way.",
                    "label": 0
                },
                {
                    "sent": "Maybe you have to talk.",
                    "label": 0
                },
                {
                    "sent": "To someone in this process and you don't like this guy?",
                    "label": 0
                },
                {
                    "sent": "Well, then you're not really happy with this process and you should might change it.",
                    "label": 0
                },
                {
                    "sent": "So these are the kind of measures and where we can try to calculate based on these different values and come up with some kind of indicators for the overall process.",
                    "label": 0
                },
                {
                    "sent": "These are their numbers and we can aggregate them different ways and very flexible where we are using logic scoring of preferences here to come up with the with the number and we can bring even other metrics here.",
                    "label": 0
                },
                {
                    "sent": "This is just the first number first collection of metrics and measures we want to use.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "Process.",
                    "label": 0
                },
                {
                    "sent": "For example, if somebody wants to propose a solution that demands polling information too.",
                    "label": 0
                },
                {
                    "sent": "Goes through him for a specific person or how we've got relation level of this information.",
                    "label": 0
                },
                {
                    "sent": "Point no, not yet, but this is very good point.",
                    "label": 0
                },
                {
                    "sent": "I will definitely think about this one.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's.",
                    "label": 0
                },
                {
                    "sent": "We haven't thought about this, but this sounds very reasonable.",
                    "label": 0
                },
                {
                    "sent": "Very good thanks.",
                    "label": 0
                },
                {
                    "sent": "OKI",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I think.",
                    "label": 0
                },
                {
                    "sent": "OK. Well, we we heard about already about it like I'm sharing of information involving other people connecting to others.",
                    "label": 0
                },
                {
                    "sent": "I'm talking to them, collect information from them is very important interaction metals.",
                    "label": 0
                },
                {
                    "sent": "So we know there is data.",
                    "label": 0
                },
                {
                    "sent": "There's some content about it.",
                    "label": 0
                },
                {
                    "sent": "Um, there has to happen some conversations.",
                    "label": 0
                },
                {
                    "sent": "This happens every day.",
                    "label": 0
                },
                {
                    "sent": "We well, I guess everybody of us when when you look back about your daily work then you probably talk 80% of the day, either by Mail messaging systems directly at the coffee bar to other people, and 20% is just sitting in your office and do some real work.",
                    "label": 0
                },
                {
                    "sent": "Well, at least for me I am.",
                    "label": 0
                },
                {
                    "sent": "I have the feeling I'm sending all the day only emails.",
                    "label": 0
                },
                {
                    "sent": "My life is Mail sending excellent.",
                    "label": 0
                },
                {
                    "sent": "Well, 20% is presentation preparation.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "Um, sounds frustrated, right?",
                    "label": 0
                },
                {
                    "sent": "Well and there are people involved and well, I I know there is a guy who produced very nice theory.",
                    "label": 0
                },
                {
                    "sent": "It's called the hot dog.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Talk Siri.",
                    "label": 0
                },
                {
                    "sent": "Well this guy is also sitting in the audience and I think it's a very nice nice idea when you talk about interaction and collaboration.",
                    "label": 0
                },
                {
                    "sent": "It might be also like in the enterprise that sometimes you also try to.",
                    "label": 1
                },
                {
                    "sent": "Talk to people outside your organization so it's external nodes.",
                    "label": 1
                },
                {
                    "sent": "This as a red 1 right?",
                    "label": 0
                },
                {
                    "sent": "But even inside your organization, you might have like the yellow nodes.",
                    "label": 1
                },
                {
                    "sent": "These are the active nodes, not the active project nodes.",
                    "label": 0
                },
                {
                    "sent": "These are more like nodes who are really active in doing their work, but inside.",
                    "label": 0
                },
                {
                    "sent": "If you have to talk to others have to get information from, then ask them.",
                    "label": 0
                },
                {
                    "sent": "Can you prepare slide on this or can you do?",
                    "label": 0
                },
                {
                    "sent": "This might also be dumped nodes like.",
                    "label": 0
                },
                {
                    "sent": "Well, there are apparently their sister.",
                    "label": 0
                },
                {
                    "sent": "Curve about the skills in your company I guess.",
                    "label": 0
                },
                {
                    "sent": "And some of them might produce.",
                    "label": 0
                },
                {
                    "sent": "Well, not really good results and I'm useless.",
                    "label": 1
                },
                {
                    "sent": "I'm there might not be specialists here, so what's the goal is to try to?",
                    "label": 0
                },
                {
                    "sent": "Try not to use heavily or not.",
                    "label": 0
                },
                {
                    "sent": "Try to rely too much on this dumb nodes and true in this way kind of try to optimize.",
                    "label": 0
                },
                {
                    "sent": "Is the execution of your process.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "But if you are talking about, I'm almost at the end, surprisingly so.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I gave 30 minutes to my colleague.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "When we talking about exchanging and sharing information in the enterprise, so usually you cannot just share information in the enterprise.",
                    "label": 0
                },
                {
                    "sent": "So as soon as you share information, you have to sort about security and privacy issues here.",
                    "label": 0
                },
                {
                    "sent": "So one thing is we have what we have in mind is to cover also security aware knowledge process is.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To look on security awareness inside active.",
                    "label": 0
                },
                {
                    "sent": "So what we're going to do here is something what we call.",
                    "label": 0
                },
                {
                    "sent": "We define knowledge spheres, so this is.",
                    "label": 0
                },
                {
                    "sent": "Can think about it.",
                    "label": 0
                },
                {
                    "sent": "It's a group of people or it's a group of documents.",
                    "label": 0
                },
                {
                    "sent": "Or if you have an ontology or have never thought.",
                    "label": 0
                },
                {
                    "sent": "I would mention this term here.",
                    "label": 0
                },
                {
                    "sent": "If you have an enterprise on tolerance.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah.",
                    "label": 0
                },
                {
                    "sent": "And there is this guy who is doing the security stuff.",
                    "label": 0
                },
                {
                    "sent": "Hi Carlos.",
                    "label": 0
                },
                {
                    "sent": "Topic.",
                    "label": 0
                },
                {
                    "sent": "So if we're going to define the secure this knowledge fears we have in mind to have to describe our enterprise in an ontology like we have the resources we have, the documents we have, some people we have, some different organizational structures, and on top of it we define policies to make to allow access and to allow users of these kind of resources what we have as well as the knowledge fears are kind of represented here by this box is there are people.",
                    "label": 0
                },
                {
                    "sent": "Which might be in different knowledge fears, and even if it's over a trust boundary, so you can also imagine that there might be some knowledge, fear or policies which cover this scenarios.",
                    "label": 0
                },
                {
                    "sent": "So what we're not we not have in mind.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We're not.",
                    "label": 0
                },
                {
                    "sent": "We don't want to start from scratch, So what we know it's like this knowledge fears we have in mind are you could think about it's a virtual organization, probably on what we know from grid technologies already.",
                    "label": 0
                },
                {
                    "sent": "Or there's a lot of investigation around in the grid community.",
                    "label": 0
                },
                {
                    "sent": "And we probably can reuse some technologies from here.",
                    "label": 0
                },
                {
                    "sent": "What we also can do is to express this security policies by using.",
                    "label": 0
                },
                {
                    "sent": "Frameworks which are already there are ontologies which are already there from other projects.",
                    "label": 0
                },
                {
                    "sent": "So chaos is one thing and the other one is Seahawks.",
                    "label": 0
                },
                {
                    "sent": "Thanks.",
                    "label": 0
                },
                {
                    "sent": "And this is how this fits together in the whole picture, like on the one side, we try to cover the dependencies of task resources.",
                    "label": 0
                },
                {
                    "sent": "People, we we know how this is coupled and on the other side we can express the ontology of the enterprise and then we can define policies how to access and use these kind of data.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Well, I'm almost at the end, so I have interest.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You so far, but we understand this knowledge process is.",
                    "label": 0
                },
                {
                    "sent": "Um, for the enterprise.",
                    "label": 0
                },
                {
                    "sent": "So there are some tools we will see.",
                    "label": 0
                },
                {
                    "sent": "Oh, why slightly introduced what we were thinking about on top down how to express the task, how to what we have in mind to do regarding security.",
                    "label": 0
                },
                {
                    "sent": "And what is the relation to bottom up?",
                    "label": 0
                },
                {
                    "sent": "I think a pure bottom up approach might not work because, well, magic does not work, so we need some help from the user here to say what.",
                    "label": 1
                },
                {
                    "sent": "What are tasks, what are activities, how they are structured.",
                    "label": 0
                },
                {
                    "sent": "So This is why we believe that that we should have both approaches top down and bottom up.",
                    "label": 0
                },
                {
                    "sent": "I I have, I did a slightly introduction on how to evaluate this knowledge.",
                    "label": 0
                },
                {
                    "sent": "Process is what we have in mind here is to use.",
                    "label": 0
                },
                {
                    "sent": "This number is also terrific tour to help to help to decide on other processes except one which is most likely, which is probably the most less cost incentive or the less time consuming or the most feasible process.",
                    "label": 0
                },
                {
                    "sent": "Next step for you.",
                    "label": 0
                },
                {
                    "sent": "So this is what refactoring here means for optimization.",
                    "label": 0
                },
                {
                    "sent": "And I mentioned that security and privacy is.",
                    "label": 1
                },
                {
                    "sent": "Important for us and what we want to do here.",
                    "label": 0
                },
                {
                    "sent": "So we will start right now with the security.",
                    "label": 0
                },
                {
                    "sent": "We have a basic architecture for this and now we will start with implementation.",
                    "label": 0
                },
                {
                    "sent": "So I was thinking about, well it the entire summer school.",
                    "label": 0
                },
                {
                    "sent": "It's more about Web 20 it for the enterprise right?",
                    "label": 0
                },
                {
                    "sent": "It's about social.",
                    "label": 0
                },
                {
                    "sent": "It's about sharing and so on so.",
                    "label": 0
                },
                {
                    "sent": "But what is Web 2.0 for the enterprise?",
                    "label": 0
                },
                {
                    "sent": "Well, I think this is.",
                    "label": 0
                },
                {
                    "sent": "Enterprise tomorrow, right?",
                    "label": 0
                },
                {
                    "sent": "No so enterprise to though is the use of.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Emergent social software.",
                    "label": 0
                },
                {
                    "sent": "Platforms.",
                    "label": 0
                },
                {
                    "sent": "Within companies or between companies and their partners or customers.",
                    "label": 0
                },
                {
                    "sent": "I think this is enterprise, too little, right?",
                    "label": 0
                },
                {
                    "sent": "Somehow at least somehow.",
                    "label": 0
                },
                {
                    "sent": "So what does it mean?",
                    "label": 0
                },
                {
                    "sent": "Emergent social software?",
                    "label": 0
                },
                {
                    "sent": "And this is already I try to know too.",
                    "label": 0
                },
                {
                    "sent": "Hand over to Julian so emergent social software.",
                    "label": 0
                },
                {
                    "sent": "Who could imagine emergence social software?",
                    "label": 0
                },
                {
                    "sent": "Software is emergent or social party.",
                    "label": 0
                },
                {
                    "sent": "Similar social social software.",
                    "label": 0
                },
                {
                    "sent": "So the social software.",
                    "label": 0
                },
                {
                    "sent": "Pete that we were using.",
                    "label": 0
                },
                {
                    "sent": "Now look for connections for them.",
                    "label": 0
                },
                {
                    "sent": "The question is much more easier.",
                    "label": 0
                },
                {
                    "sent": "I know you usually and has the same question, so OK doesn't matter, so you will know what the answer to this is when Union ask this question, because then it's much more clear because the context is much more clear, so let me explain what we did during the summer time.",
                    "label": 0
                },
                {
                    "sent": "So in preparation for this summer school, we thought well, Ali and I, we are both located in Akron.",
                    "label": 0
                },
                {
                    "sent": "We thought it's a very good idea to bring up some people from the WHS University in Akron and to discuss with us their understanding on knowledge, information on data.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "What does it mean?",
                    "label": 0
                },
                {
                    "sent": "Because, well, they usually.",
                    "label": 0
                },
                {
                    "sent": "If you pick just randomly students, they don't thought about well, what is the knowledge and information?",
                    "label": 0
                },
                {
                    "sent": "How does it transform and how does data transform to two information and so on.",
                    "label": 0
                },
                {
                    "sent": "So we brought this group of people together, which was originally scheduled with three sessions over over summer to sit together with them.",
                    "label": 0
                },
                {
                    "sent": "Each of this session was supposed to have two hours, and so we started first in the first session with the discussion.",
                    "label": 0
                },
                {
                    "sent": "Of these basic terms or knowledge, knowledge worker information data, as it was very interesting.",
                    "label": 0
                },
                {
                    "sent": "And then we figure out.",
                    "label": 0
                },
                {
                    "sent": "OK, let's now have a look on on platforms on Web 2.0 platforms and try to understand the business relevant.",
                    "label": 0
                },
                {
                    "sent": "Four of these platforms, so we picked randomly four platforms while one was.",
                    "label": 0
                },
                {
                    "sent": "Facebook, the other one was Twitter.",
                    "label": 0
                },
                {
                    "sent": "Do we look on Twitter?",
                    "label": 0
                },
                {
                    "sent": "Yes?",
                    "label": 0
                },
                {
                    "sent": "And then there was Zing.",
                    "label": 0
                },
                {
                    "sent": "This is a linked in German version.",
                    "label": 0
                },
                {
                    "sent": "Um and the last one was Wikipedia, I think right?",
                    "label": 0
                },
                {
                    "sent": "And we looked at it like why is it successful?",
                    "label": 0
                },
                {
                    "sent": "How circulation, collaboration, aspect in there?",
                    "label": 0
                },
                {
                    "sent": "What is incentive for the user and so on.",
                    "label": 0
                },
                {
                    "sent": "So we investigate it into this.",
                    "label": 0
                },
                {
                    "sent": "And finally we came up so.",
                    "label": 0
                },
                {
                    "sent": "OK, taking this into account, these are social platforms, So what is what could be important for the enterprise?",
                    "label": 0
                },
                {
                    "sent": "And one task for the student was then OK. We have this idea.",
                    "label": 0
                },
                {
                    "sent": "Figure out what you can do with the basic idea on how could emerge and social software be used in an enterprise scope and what would be very important features for the enterprise and what the guys did in many sessions they figured out.",
                    "label": 0
                },
                {
                    "sent": "Well, they did kind of in competitor analysts of the idea they came up with new features and with brand and so on.",
                    "label": 0
                },
                {
                    "sent": "And finally and I thought, well, it is really a cool result of really smart what you did.",
                    "label": 0
                },
                {
                    "sent": "So please present it.",
                    "label": 0
                },
                {
                    "sent": "I give you 30 minutes of my time to present your idea and then we can discuss this stuff.",
                    "label": 0
                },
                {
                    "sent": "So now I would like to hand over to Julian.",
                    "label": 0
                },
                {
                    "sent": "So Julian is one of these students.",
                    "label": 0
                },
                {
                    "sent": "Who developed this?",
                    "label": 0
                },
                {
                    "sent": "Finally, this idea with some other colleagues?",
                    "label": 0
                },
                {
                    "sent": "And now he's going to present this after the session.",
                    "label": 0
                },
                {
                    "sent": "I think we will have some time to discuss open issues and open questions, OK?",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": []
        }
    }
}