{
    "id": "2qdy323ep4mbi7o3hbm7w7mso7wpnjoz",
    "title": "Scenographies of Power",
    "info": {
        "author": [
            "Maite Borjabad, Art Institute of Chicago"
        ],
        "published": "April 10, 2018",
        "recorded": "February 2018",
        "category": [
            "Top->Architecture",
            "Top->Arts"
        ]
    },
    "url": "http://videolectures.net/creativexchange2018_borjabad_scenographies/",
    "segmentation": [
        [
            "Well, thank you so much for the invitation and for being here, so run it up about amazing brains like the whole room.",
            "It's full of.",
            "The projects I'm going to present I think that revolves around their practice as an architect, creator and professor, and I think it gets a bit of everything and I hope you enjoy it.",
            "Office of Power seeks to disclose Registar unrevealed implications of the physical space and to the construction of these scenarios.",
            "That is, stage contemporary political apparatus look into the sea for how this space itself is not just the host of such legal statements, but how it had also become witness an accomplice of such power structures."
        ],
        [
            "Still no.",
            "So in our office of Power is an ongoing research that has already the steel through diverse project and format, and one of them is this exhibition.",
            "I'm going to present and also.",
            "This book that 1/2 time but happy to circulate afterwards.",
            "If you want to take a look about it just has a Commission essays reflecting on on the exhibition.",
            "The."
        ],
        [
            "Exhibition wants to reclaim how the state of exception as a legal instrument can only be articulated through and within the space drafting.",
            "Then the conceptual gesture of moving from their simulated agamben's term of a state of exception to the spaces of exception.",
            "The exhibition crosses through different typology's E."
        ],
        [
            "Of which ultimately contains a different kind of legal Limbo that constructs a certain type of exception."
        ],
        [
            "When talking about the use and abuse of the state of exception, the most immediate recognizable tape is associated with conflict zones and contested borders, which is precisely what capture practice takes over Arcadis ideas requested.",
            "Access to the video archives of Bethsalem days Relay Information Center for Human Rights and the Occupied Territories to then Re perform an RIA stage in a decontextualized wider space.",
            "All the choreographed movements, circulations, and actions that appear in the original footage that traces military actions.",
            "And civilian responses."
        ],
        [
            "But the state of exception also takes shapes in spaces that are part of our daily life, like airports as illustrated for instance in the world contraband.",
            "Where for one working week tiring Simon remain on site at JFK Airport at the US Customs and Border Protection Federal Inspection Site and continuously photograph items detain or or so?"
        ],
        [
            "Guys from passengers entering the United States from abroad."
        ],
        [
            "I need."
        ],
        [
            "Is that same Limbo that operates within the walls of the of the intransit walls of the airport?",
            "They want that controls and choreographs not only objects, but also bodies as the work that will not move that big show in something about contemporary nomadism."
        ],
        [
            "However, the total suspension of the law do not only happen in the physical space, but also in the little one, the cloud, and that is where Trevor Paglen's autonomy cube is pointing to.",
            "This culture is meant to be both seen and used.",
            "The cube is literally a router that provides a hotspot that gives access to the Tor network.",
            "A global network of thousands of volunteer and relays designed to help anonymize data informally called the Deep Web.",
            "The legal Limbo in the cloud.",
            "This is the space where all transactions can be made without producing any trace, thus not.",
            "Even devaluation of legal or illegal can be made in here."
        ],
        [
            "The deep web, even though is used by many, is not accessible for most of us.",
            "Thus this sculpture transformed the whole space of the Gallery itself as an entry door to this legal Limbo for the whole period.",
            "That exhibition is running."
        ],
        [
            "The work by Susan Shipley functions as an attempt to test the thesis that exhibition itself is claiming challenging how.",
            "If we do acknowledge the active role of the space within these contested processes, then how we can use the physical traces as evidence and then not only just such but also as complexes?"
        ],
        [
            "Evidence on trail words with evidentiary documents.",
            "Source from the archives of the International Criminal Tribunal for the from the former Yugoslavia, including videos, photographs, aerial footage, xrays, diagrams, floor plans, models, Maps and even ramen.",
            "In time we run stone and examined the issues that emerge when material evidence is repressed by the is reprocess by the legal machine that is the international court."
        ],
        [
            "Finally, the work deliver for Mr Assange approached us to probably the most consolidated an product Matic example of the use of the state of exception, the diplomatic space."
        ],
        [
            "In 2013, being the group sent a package to Mr Assange at the Ecuadorian embassy are rather special package fitted with a GPS mode telephone Anna Camera programmed to take a photo every 10 seconds and uploaded there and then into a Twitter account.",
            "The work that is on display and exhibit."
        ],
        [
            "And is the footage of all that 36 hours real time performance revealing the moments of Accessibility and in Accessibility, visibility and blindness of the path and questions.",
            "The protocols that Coburn accents to the so called diplomatic Limbo."
        ],
        [
            "The space that holds the situation of Assange, the state of exception that allows a sense to be where he is, is one of the most consolidated ones, but also the most mediated ones.",
            "However, beyond the mediatic circulation of that situation, how much?"
        ],
        [
            "Do we really know about the physical legal boundaries?"
        ],
        [
            "How does architecture participate in a staging?",
            "Those controversial spaces.",
            "How does architectural paragraph hand by hand with the political apparatus?",
            "The main bodies that perform within those exceptional spaces?",
            "How do those images circulate an actively construct a public imaginary of such as spaces of exception by Jeff stores of transparency.",
            "At the same time, the jesters of concealment and how dialogue that supports all this is materialized and executed.",
            "These are the questions that this other iteration of this project.",
            "Presence."
        ],
        [
            "Which are the materialization of the state of exception that were being actively designed legally an architectural to host the situations of Julian Assange, Edward Snowden."
        ],
        [
            "And the diplomat."
        ],
        [
            "But I won't have time to run over all this, but I will give you a small bite of this second project.",
            "So."
        ],
        [
            "How far is that a space and they want that enables condition that they want that enables a such condition is being represented by its media circulation, considering the media circulation of Ascension, the Ecuador embassy in London, this is what can be instructed on the exterior.",
            "The clarity of three elements, the balcony."
        ],
        [
            "The door."
        ],
        [
            "And the main window."
        ],
        [
            "However.",
            "An interior.",
            "As speculation approaches, since the interior just exist, as long as it is fixed to the exterior."
        ],
        [
            "He"
        ],
        [
            "Is happening in here in here."
        ],
        [
            "Wayne here."
        ],
        [
            "That it really mad."
        ],
        [
            "May differ in the articulation of the Ecuador embassy's space and consequently defining the material boundaries of the diplomatic condition, and 2nd analyzes is taken into consideration and this is what emerges."
        ],
        [
            "The Ecuador embassy occupies the ground floor of a building."
        ],
        [
            "Inhabitated also buy Colombian embassy and 15 individual apartments more."
        ],
        [
            "Thrusting with the mediated circulation of the images, the articulation of the interior exterior correspondence and ask many questions.",
            "And so trying to see for how a Sanchez space is being portrayed from the interior.",
            "Very few information shows up in such a way that Vanity Fair Article, the man who came to dinner through its narrated descriptions of the authors encounter with Ascent without any images at all becomes one of the main sources.",
            "The reconstruction of such descriptions shows the following findings."
        ],
        [
            "About the door on the bedroom."
        ],
        [
            "The entrance to the Equador Territory territory is not the same that the entrance to the building."
        ],
        [
            "Quoting the vanity article, the Doctor, the embassy is thick black metal and opens immediately into a full body metal detector.",
            "Considering the act of entering here the partition wall and the door performed the border to the interior as the brick wall and the balcony performs the border condition to the exterior.",
            "However, this trivial partition wall beyond dividing an apartment from the lobby is constructing the border between the UK and the Ecuador."
        ],
        [
            "About the bedroom, however unclear is the specific position of the bedroom."
        ],
        [
            "And considering the relationship of a sand with a window overlooking a small dead end St. As the article explains, enables to consider a more narrow speculative position of Ascension living space."
        ],
        [
            "The key elements that constitute the living space that Assange inhabits, according to the article and according to."
        ],
        [
            "Several images that circulate in the media where some of them can be seen or the treadmill.",
            "The sun lamp."
        ],
        [
            "The Internet cable among all those material ettis that articulate the physicality reality of of us, and the material iti of the Internet connection as it is, the cable emerges with various special relevance.",
            "Thus a big note of cables populated the room and then the cable expands all along the corridor to the Ecuador Embassy until entering again into UK territory."
        ],
        [
            "The physical Assange might be restricted to a few 100 square feet of real estate, but his avatar remains actively engaged with the world."
        ],
        [
            "Through different methodologies and format, but share interests both projects.",
            "The exhibition and this is small, but I gave you of what was performative lecture at Columbia University.",
            "Both projects revolve around the same claim.",
            "The state of exception is not a given, but in fact a construction, a constant process of production.",
            "The understanding of all those spaces of exception."
        ],
        [
            "'s process implies to argue that this development of his space making through legal and power in arguments enables new capability."
        ],
        [
            "Is there a matter of asking?"
        ],
        [
            "How are those capabilities being diploid?",
            "Through materiality, speciality Aniston, ethnographic dispositions?",
            "What is the degree of consolidation with those processes?",
            "How a consolidation of a specific legal agreement reflects on a more or less bounded special articulation?",
            "How through our agreement.",
            "How throughout dematerialize tendency of images circulating is then the very physicality put at stake.",
            "And finally, how is there a legal apparatus translated into a special device?",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, thank you so much for the invitation and for being here, so run it up about amazing brains like the whole room.",
                    "label": 0
                },
                {
                    "sent": "It's full of.",
                    "label": 0
                },
                {
                    "sent": "The projects I'm going to present I think that revolves around their practice as an architect, creator and professor, and I think it gets a bit of everything and I hope you enjoy it.",
                    "label": 0
                },
                {
                    "sent": "Office of Power seeks to disclose Registar unrevealed implications of the physical space and to the construction of these scenarios.",
                    "label": 1
                },
                {
                    "sent": "That is, stage contemporary political apparatus look into the sea for how this space itself is not just the host of such legal statements, but how it had also become witness an accomplice of such power structures.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Still no.",
                    "label": 0
                },
                {
                    "sent": "So in our office of Power is an ongoing research that has already the steel through diverse project and format, and one of them is this exhibition.",
                    "label": 0
                },
                {
                    "sent": "I'm going to present and also.",
                    "label": 0
                },
                {
                    "sent": "This book that 1/2 time but happy to circulate afterwards.",
                    "label": 0
                },
                {
                    "sent": "If you want to take a look about it just has a Commission essays reflecting on on the exhibition.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Exhibition wants to reclaim how the state of exception as a legal instrument can only be articulated through and within the space drafting.",
                    "label": 0
                },
                {
                    "sent": "Then the conceptual gesture of moving from their simulated agamben's term of a state of exception to the spaces of exception.",
                    "label": 1
                },
                {
                    "sent": "The exhibition crosses through different typology's E.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of which ultimately contains a different kind of legal Limbo that constructs a certain type of exception.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When talking about the use and abuse of the state of exception, the most immediate recognizable tape is associated with conflict zones and contested borders, which is precisely what capture practice takes over Arcadis ideas requested.",
                    "label": 0
                },
                {
                    "sent": "Access to the video archives of Bethsalem days Relay Information Center for Human Rights and the Occupied Territories to then Re perform an RIA stage in a decontextualized wider space.",
                    "label": 0
                },
                {
                    "sent": "All the choreographed movements, circulations, and actions that appear in the original footage that traces military actions.",
                    "label": 0
                },
                {
                    "sent": "And civilian responses.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But the state of exception also takes shapes in spaces that are part of our daily life, like airports as illustrated for instance in the world contraband.",
                    "label": 0
                },
                {
                    "sent": "Where for one working week tiring Simon remain on site at JFK Airport at the US Customs and Border Protection Federal Inspection Site and continuously photograph items detain or or so?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Guys from passengers entering the United States from abroad.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I need.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is that same Limbo that operates within the walls of the of the intransit walls of the airport?",
                    "label": 0
                },
                {
                    "sent": "They want that controls and choreographs not only objects, but also bodies as the work that will not move that big show in something about contemporary nomadism.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "However, the total suspension of the law do not only happen in the physical space, but also in the little one, the cloud, and that is where Trevor Paglen's autonomy cube is pointing to.",
                    "label": 0
                },
                {
                    "sent": "This culture is meant to be both seen and used.",
                    "label": 0
                },
                {
                    "sent": "The cube is literally a router that provides a hotspot that gives access to the Tor network.",
                    "label": 0
                },
                {
                    "sent": "A global network of thousands of volunteer and relays designed to help anonymize data informally called the Deep Web.",
                    "label": 0
                },
                {
                    "sent": "The legal Limbo in the cloud.",
                    "label": 0
                },
                {
                    "sent": "This is the space where all transactions can be made without producing any trace, thus not.",
                    "label": 0
                },
                {
                    "sent": "Even devaluation of legal or illegal can be made in here.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The deep web, even though is used by many, is not accessible for most of us.",
                    "label": 0
                },
                {
                    "sent": "Thus this sculpture transformed the whole space of the Gallery itself as an entry door to this legal Limbo for the whole period.",
                    "label": 0
                },
                {
                    "sent": "That exhibition is running.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The work by Susan Shipley functions as an attempt to test the thesis that exhibition itself is claiming challenging how.",
                    "label": 0
                },
                {
                    "sent": "If we do acknowledge the active role of the space within these contested processes, then how we can use the physical traces as evidence and then not only just such but also as complexes?",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Evidence on trail words with evidentiary documents.",
                    "label": 0
                },
                {
                    "sent": "Source from the archives of the International Criminal Tribunal for the from the former Yugoslavia, including videos, photographs, aerial footage, xrays, diagrams, floor plans, models, Maps and even ramen.",
                    "label": 0
                },
                {
                    "sent": "In time we run stone and examined the issues that emerge when material evidence is repressed by the is reprocess by the legal machine that is the international court.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Finally, the work deliver for Mr Assange approached us to probably the most consolidated an product Matic example of the use of the state of exception, the diplomatic space.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In 2013, being the group sent a package to Mr Assange at the Ecuadorian embassy are rather special package fitted with a GPS mode telephone Anna Camera programmed to take a photo every 10 seconds and uploaded there and then into a Twitter account.",
                    "label": 0
                },
                {
                    "sent": "The work that is on display and exhibit.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And is the footage of all that 36 hours real time performance revealing the moments of Accessibility and in Accessibility, visibility and blindness of the path and questions.",
                    "label": 0
                },
                {
                    "sent": "The protocols that Coburn accents to the so called diplomatic Limbo.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The space that holds the situation of Assange, the state of exception that allows a sense to be where he is, is one of the most consolidated ones, but also the most mediated ones.",
                    "label": 0
                },
                {
                    "sent": "However, beyond the mediatic circulation of that situation, how much?",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Do we really know about the physical legal boundaries?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How does architecture participate in a staging?",
                    "label": 0
                },
                {
                    "sent": "Those controversial spaces.",
                    "label": 0
                },
                {
                    "sent": "How does architectural paragraph hand by hand with the political apparatus?",
                    "label": 0
                },
                {
                    "sent": "The main bodies that perform within those exceptional spaces?",
                    "label": 0
                },
                {
                    "sent": "How do those images circulate an actively construct a public imaginary of such as spaces of exception by Jeff stores of transparency.",
                    "label": 0
                },
                {
                    "sent": "At the same time, the jesters of concealment and how dialogue that supports all this is materialized and executed.",
                    "label": 0
                },
                {
                    "sent": "These are the questions that this other iteration of this project.",
                    "label": 0
                },
                {
                    "sent": "Presence.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which are the materialization of the state of exception that were being actively designed legally an architectural to host the situations of Julian Assange, Edward Snowden.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the diplomat.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But I won't have time to run over all this, but I will give you a small bite of this second project.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How far is that a space and they want that enables condition that they want that enables a such condition is being represented by its media circulation, considering the media circulation of Ascension, the Ecuador embassy in London, this is what can be instructed on the exterior.",
                    "label": 0
                },
                {
                    "sent": "The clarity of three elements, the balcony.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The door.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the main window.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "However.",
                    "label": 0
                },
                {
                    "sent": "An interior.",
                    "label": 0
                },
                {
                    "sent": "As speculation approaches, since the interior just exist, as long as it is fixed to the exterior.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "He",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is happening in here in here.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Wayne here.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That it really mad.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "May differ in the articulation of the Ecuador embassy's space and consequently defining the material boundaries of the diplomatic condition, and 2nd analyzes is taken into consideration and this is what emerges.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The Ecuador embassy occupies the ground floor of a building.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Inhabitated also buy Colombian embassy and 15 individual apartments more.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thrusting with the mediated circulation of the images, the articulation of the interior exterior correspondence and ask many questions.",
                    "label": 0
                },
                {
                    "sent": "And so trying to see for how a Sanchez space is being portrayed from the interior.",
                    "label": 0
                },
                {
                    "sent": "Very few information shows up in such a way that Vanity Fair Article, the man who came to dinner through its narrated descriptions of the authors encounter with Ascent without any images at all becomes one of the main sources.",
                    "label": 0
                },
                {
                    "sent": "The reconstruction of such descriptions shows the following findings.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About the door on the bedroom.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The entrance to the Equador Territory territory is not the same that the entrance to the building.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Quoting the vanity article, the Doctor, the embassy is thick black metal and opens immediately into a full body metal detector.",
                    "label": 0
                },
                {
                    "sent": "Considering the act of entering here the partition wall and the door performed the border to the interior as the brick wall and the balcony performs the border condition to the exterior.",
                    "label": 0
                },
                {
                    "sent": "However, this trivial partition wall beyond dividing an apartment from the lobby is constructing the border between the UK and the Ecuador.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About the bedroom, however unclear is the specific position of the bedroom.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And considering the relationship of a sand with a window overlooking a small dead end St. As the article explains, enables to consider a more narrow speculative position of Ascension living space.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The key elements that constitute the living space that Assange inhabits, according to the article and according to.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Several images that circulate in the media where some of them can be seen or the treadmill.",
                    "label": 0
                },
                {
                    "sent": "The sun lamp.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The Internet cable among all those material ettis that articulate the physicality reality of of us, and the material iti of the Internet connection as it is, the cable emerges with various special relevance.",
                    "label": 0
                },
                {
                    "sent": "Thus a big note of cables populated the room and then the cable expands all along the corridor to the Ecuador Embassy until entering again into UK territory.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The physical Assange might be restricted to a few 100 square feet of real estate, but his avatar remains actively engaged with the world.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Through different methodologies and format, but share interests both projects.",
                    "label": 0
                },
                {
                    "sent": "The exhibition and this is small, but I gave you of what was performative lecture at Columbia University.",
                    "label": 0
                },
                {
                    "sent": "Both projects revolve around the same claim.",
                    "label": 0
                },
                {
                    "sent": "The state of exception is not a given, but in fact a construction, a constant process of production.",
                    "label": 0
                },
                {
                    "sent": "The understanding of all those spaces of exception.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "'s process implies to argue that this development of his space making through legal and power in arguments enables new capability.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is there a matter of asking?",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How are those capabilities being diploid?",
                    "label": 0
                },
                {
                    "sent": "Through materiality, speciality Aniston, ethnographic dispositions?",
                    "label": 0
                },
                {
                    "sent": "What is the degree of consolidation with those processes?",
                    "label": 0
                },
                {
                    "sent": "How a consolidation of a specific legal agreement reflects on a more or less bounded special articulation?",
                    "label": 0
                },
                {
                    "sent": "How through our agreement.",
                    "label": 0
                },
                {
                    "sent": "How throughout dematerialize tendency of images circulating is then the very physicality put at stake.",
                    "label": 0
                },
                {
                    "sent": "And finally, how is there a legal apparatus translated into a special device?",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}