{
    "id": "2qigic2yw5wiqcyqddxzxbevo5o2vc6w",
    "title": "Learning in Hierarchical Architectures: from Neuroscience to Derived Kernels",
    "info": {
        "author": [
            "Tomaso A. Poggio, McGovern Institute for Brain Research, Massachusetts Institute of Technology, MIT"
        ],
        "published": "July 30, 2009",
        "recorded": "June 2009",
        "category": [
            "Top->Computer Science->Machine Learning->Computational Learning Theory"
        ]
    },
    "url": "http://videolectures.net/mlss09us_poggio_lhandk/",
    "segmentation": [
        [
            "Our plenary talk today will be commercial project from MIT and the.",
            "Title of the Doctors learning in hierarchical architecture.",
            "Well, thanks to everybody for coming next to the organizer for the invitation.",
            "Today the message I'd like to give you the top level one anyway, is that neuroscience is providing new ideas to computer science, and also that neuroscience need mathematics.",
            "In particular, the data are not enough, and even quantitative models may not be enough to understand how parts of the brain work.",
            "So let me start with learning."
        ],
        [
            "And so over the past 15 or 20 years we have been working on learning believe."
        ],
        [
            "That learning is one of the keys to understanding.",
            "Intelligence, both biological and artificial, and I want to make a point justice brief point about learning supervised unsupervised learning."
        ],
        [
            "And address briefly this issue of architectures deep and shallow and sample complexity.",
            "Need how many labeled examples you need."
        ],
        [
            "For a certain task.",
            "So you're probably familiar with the kind of setup that has been used in the past several years for supervised learning you have.",
            "A probability distribution on a space of XY and you don't know the probability distribution, but what you have is a set of examples which are input output pairs.",
            "Drawn from this unknown probability distribution and the goal is to learn from this training set of data points to learn a map that will learning algorithm app that will look at the training set and then based on it select a model, A function, a set of rules that can be used to predict.",
            "Huawei from New X and I'm using the word predict in lose way.",
            "I can define it more precisely.",
            "I would not do it today, but that's the kind of setup.",
            "For soup."
        ],
        [
            "Advised learning now.",
            "There are several family of algorithms that I've proven to work reasonably well empirically, and some of them have reasonable theoretical guarantees.",
            "One of these family is based on reproducing kernel machines.",
            "It's based on minimizing a cost function where you have a first term that looks for the F. In an appropriate function space Age space of hypothesis that minimizes some measure of an empirical error, the error on the set of an examples and you have also a term regularizer that imposes some constraints on, say, the complexity of the hypothesis F on the minimizer and the solution of this problem, and the relatively general conditions.",
            "With that norm there on F being the norm in the reproducing camera space defined by a positive definite symmetric function of two variables K. As this general form in the moralize, independent of the form of V, the coefficient Alpha, it depends on V and so you get various techniques like support vector machines, regularization, network, radio basis functions, linear, regular regularised regression and classification and so on.",
            "They all have that form a linear combination of kernel K centered on each.",
            "On one of the examples of the Anexample side now."
        ],
        [
            "As always, you can look at this formula and draw a graph or a network corresponding to it, and in this case you would have a network with one layer between the input and the output.",
            "This layer of kernels where the units there would correspond to the value of K. XI.",
            "This I goes from one to N. For a particular input X.",
            "And.",
            "And then you can say that this corresponds to, let's say, shallow network.",
            "If you want to use this term because there is only one layer between the input and the output is not an architecture with many many layers, like the architectures that young lacuna.",
            "For instance, and several others described.",
            "So this kind of classical learning theory corresponds to shallow architectures, and there is no obvious way how to extend.",
            "This kind of approach to multiple layers now."
        ],
        [
            "Back several years ago, just looking at.",
            "I comparison between nervous system and brains and learning algorithms such as kernel machines.",
            "What there are we came up with some.",
            "Obvious.",
            "Statement about differences and two puzzles.",
            "In a sense, one having to do with the poverty of stimulus problem, the apparent ability of people and other biological Organism to learn a task like recognize say panda bears or.",
            "Something like that from just a very small number of the examples, often one.",
            "I say a parent ability because it's always difficult to control, especially for people how much previous experience has played a role, but.",
            "The outer superficial belief at least, is that you can learn many tasks from very few examples.",
            "Much fewer than you need for techniques like kernel machines.",
            "And.",
            "Another puzzle is related to what I mentioned about shallow architectures.",
            "If you look at the brain, you see what seems to be a much more hierarchical in terms of stages.",
            "Many more stages of processing than just one layer between the input and the output, and one can even ask whether these two puzzle are related to each other."
        ],
        [
            "So let me look briefly at Cortex, so this is going to be a bit different from the talks you have heard so far.",
            "To be more neuroscience than mathematics.",
            "But just to give you the background, from the neuroscience perspective on this puzzle about essentially approaches to learning and learning architectures."
        ],
        [
            "So let's look in particular to vision.",
            "What is you see?",
            "Here are several areas in the visual cortex.",
            "Which is.",
            "Vision is the sensory modality which occupies the largest part of cortex relative to other sensory modalities.",
            "And what you see here are visual areas starting with V1 and then V2V, four IT infra temporal cortex.",
            "That represent together what is called the ventral stream, which should be involved quite a lot in recognizing objects.",
            "There is different streams of evidence pointing to that starting from lesions in patients that lose recognition ability for when they have lesions in parts of this ventral pathways to.",
            "FMRI evidence in the meantime, Physiology from monkeys which have an architecture very similar architectures to humans.",
            "In fact, this is the macaque monkey brain, and this is the back of the head, and this is the front information from the eyes goes to V1 primary visual cortex and then V2V four it and then to none purely visual areas like prefrontal cortex to a decision.",
            "And planning is made and so.",
            "Let's assume that in fact this plays a big role in object recognition, but this is by the way, the ventral stream here, the one here sharing some of the areas with the ventral stream is the dorsal stream, which traditionally is been regarded as describing more task where you have motion is involved and where things are come back to that later.",
            "Briefly."
        ],
        [
            "So.",
            "This is the kind of problems.",
            "Which the ventral stream is supposed to be critical for, like answering questions like is your car in that image or not is an animal in that image or not?",
            "And present images like this which you have never seen before.",
            "Probably just exactly these images.",
            "You still can answer this kind of questions very easy."
        ],
        [
            "Now just in terms of number, our brain consists of about 10 to the 11 neurons or so, 10 to the 14th synapses contracts between neurons.",
            "Our brain is about 1,000,000 fly brain.",
            "And the ventral stream is about 1 billion neurons, so it's large, but not very large.",
            "We can start just recently to be able to simulate millions of neurons, or some models of them, and so we're getting close to be able to simulate structures like the ventral stream."
        ],
        [
            "Typically, if you look at the Physiology of the last several years and by the way, all I've been saying also with respect to the what and where pathway and what I'm going to say now are simplification.",
            "Things are always more complicated, so take what I say with some some care.",
            "For instance, don't take this picture which comes from Keiji Tanaka more than 10 years ago, literally.",
            "But this.",
            "The message here is that if you look for stimuli that stimulate best neurons, single neurons are recording from with microelectrodes you find that in V1 neurons tend to be activated quite well by things like oriented counters.",
            "So that's the preferred stimulus in view one.",
            "Typically there are section and use as you go up this ventral pathway, you find that stimulate they excite most the neurons there become more and more complicated, up to a point where in the anterior part of infra temporal cortex you may find neurons that respond to faces and in some cases to specific individual faces.",
            "OK, so at the same time as you go up the ventral pathway, you have a gradual increase in the size of the receptive field.",
            "Receptive field is the part of the image that will be seen by a cell.",
            "In other words that when something happens in the receptive fields, the cell will answer and whereas.",
            "Neurons in V1 have a receptive field which in the fovea maybe less than one degree of visual angle.",
            "In IT you find neurons that have typically receptive field which is at least five degrees in diameter or so.",
            "So there is a gradual increase in the size of the receptive field.",
            "The part of the image each neuron is looking at and also in the complexity of the stimuli and also.",
            "It appears in tolerance, so not quite invariants, but tolerance to changes in position and size of the optimal stimuli.",
            "In other words, in it you could, if you find the neurons responding to a face, it's a good bet that if you displace the face by 1 degree or two, the neuron will not change very much its response.",
            "Whereas you know 2 degrees, say 1 degree of visual angles are 120 photoreceptors shift, so it's huge.",
            "Photoreceptors in the fovea human fovea have diameter and the spacing of 30 seconds of Arc.",
            "OK, so."
        ],
        [
            "This is again map of the visual area from David Finesse and John Maunsell, and this in calories.",
            "The ventral pathway, as you can see, there are a lot of connections.",
            "Essentially, the first rule is that everything is connected to everything else, and then you're looking for some exceptions, but in particular this connections are often almost always BI directional, so V1 goes to V2, but we two goes to V1.",
            "And often the projection from higher areas to lower areas are stronger or more numerous than not stronger, but more numerous anatomically than the ones going from the bottom to the top.",
            "Now, to simplify the modeling, we started taking, as others have done, taking the view that will.",
            "Could see that first only the feedforward connections from.",
            "We want to be 2 to be free and so on, and one of the argument is that we may be able to deal not with the reality of things."
        ],
        [
            "Not vision at all, but with situation like this in which.",
            "Images are presented very briefly and you don't have the time to move your eyes to expect an image, and you can use other arguments to argue that there is probably not enough time doing the experiment correctly for information to rely on feedback from higher areas to lower areas.",
            "And we can discuss that later, so making this this simplification of considering feedwater connection.",
            "May still allow us to consider recognition situation of that type in which I want to point out you can do pretty well.",
            "You know I can present an image very briefly and you can still tell me weather for instance there there is or there is not an animal there or a car.",
            "What a person now."
        ],
        [
            "So this is going to give you some idea.",
            "The estimates of the time that it takes to a neural signal to go from the eye.",
            "To the IGN, which is a kind of for our purposes, consider data relay station and processing starting really in view on about 40 to 60 milliseconds after you flash the image in the retina, and then it takes up 200 or so milliseconds before signals arrive at the level of anterior infra temporal cortex.",
            "So."
        ],
        [
            "Um?",
            "Over the last my goodness.",
            "Now it's almost 10 years.",
            "Not quite but.",
            "Actually 10 years we have been developing and comparing with experimental working so may mostly Physiology in monkeys working on collaboration with several experimental labs have been developing models of this type in which we have model units for each one of these main visual areas.",
            "And.",
            "We have an in a sequence of layers that we called simple one complex one simple to complex 2 and so on.",
            "And you can think of.",
            "So the the red one here is corresponding to the view and and and as two correspond to V2 and V4.",
            "And then up to infra temporal cortex at say S4.",
            "And then at the last at the top you can think of the very last connect connection from S4 to S5 as sake.",
            "For simplicity, think of this as a set of circuits implementing a linear classifier.",
            "And that's the only part I'll come to that later.",
            "But it's the only part which is task dependent and would be.",
            "You can think of it as being trained on a specific task, for instance.",
            "Is there an animal in the image or not?",
            "Everything else is you can think of as a preprocessing stage that is used for all different recognition tasks.",
            "Now the.",
            "This units healed correspond to cells in view one, and this character is the characterization of the cells in view.",
            "One starts with Uber and Visa in 1968 or 1970 and the simple cells will be cells tuned to oriented contours, similar to Gabor filters.",
            "You have seen quite a bit of that already, and.",
            "Complex cells would be cells which have the same selectivity, say two oriented line with this orientation, but are more invariant to position and scale and so to some extent like Cuban visa in some way, like human is already described.",
            "One conceptual model, what complex cells are doing is to pull pull together the inputs from simple cells at specific positions.",
            "To get some invariants to position of the bar.",
            "You want to be left open.",
            "The nature of this pooling operation in this architecture described later, we have a maximum.",
            "Here, so these cells here will have the value or the firing rate of the maximum of the firing rate of simple cells with the same selectivity at somewhat different positions.",
            "OK, any questions so far."
        ],
        [
            "This kind of model is is just an example of a whole family of model which was in words described by Huber and Visa in a very qualitative way and was first implemented by Fukushima.",
            "And then by others.",
            "Most of the models, they are really qualitative models.",
            "And but they have recently very similar models by for instance, all men and younger kunan, yeah mate and so on.",
            "Roughly in this general family of feedforward.",
            "Here are chical models.",
            "Now what we've done in a sense, to be to try to be more faithful to the data, Physiology and anatomy.",
            "To build a simulation that is quite a bit larger than previous one in terms of number of units, there are millions of model neurons in in our model, and.",
            "The the other thing.",
            "To mention is that this as I said, there is a sequence of simple and complex cells, so you have a sequence of tuning and then invariants and then tuning to more complex feature combining simpler ones.",
            "I'm using the word feature in a loser sense because they're not really feature and certainly not binary features.",
            "They're like non linear combination of at least at this stage.",
            "These are linear filters, but then there is a nonlinear Max operation and only.",
            "A combination of these different filters, nonlinear filters and so on.",
            "Combination as I would say in a second, are learned in an unsupervised way.",
            "The invariances so the stage from the South to the sea layer are at the moment in the model built by hand through the connectivity they can be learned and we have demonstrated that they can be learned from natural images.",
            "For instance the first level.",
            "Now."
        ],
        [
            "Can look as I'll say in a second.",
            "OK, so the two operation corresponding to the tuning and the invariants are one.",
            "The tuning is like a Gaussian like tuning.",
            "So in this case.",
            "The center of the Gaussian.",
            "The optimal stimula will be a horizontal oriented bar and the activity of that unit will be described by the Gaussian function or well approximated by a normalized dot product.",
            "And in our software you can choose between the two, the second one as a much more natural interpretation in terms of biophysics of what neurons and synapses can do.",
            "And I'll come back to that later.",
            "The other operation, going from S2C, is a Max like operation, so the first one is and like if you want a binary analogy, and this is all I can so you have.",
            "A year or key of disjunctions of conjunctions similar to Stew, Jim and was speaking about yesterday only.",
            "You're speaking in the generative sense and this is in the other direction.",
            "So."
        ],
        [
            "Just a quick note to say that for from the neuroscience point of view you can implement approximation of these two operations in terms of plausible synaptic properties and neural properties.",
            "Essentially, lateral inhibition of the shunting type can do with different value of the parameters, either Gaussian like tuning actually something.",
            "Similar to this.",
            "And also a Max like operation.",
            "So there are possible Inter neural implementation of these two operations.",
            "There is also some evidence for the two operations at various levels in the visual pathway."
        ],
        [
            "And."
        ],
        [
            "And so that's for the architecture in terms of how the tuning is done.",
            "We have a very simple way, so this should be regarded as only an initial way to do this is to learn the tuning of cells at the S levels.",
            "For instance, yes, two cells.",
            "The tuning of this size will depend on the W, the.",
            "Sign optic weights going from this C1 cells to the S2 particulars two cells and those weights are learned by from a set of natural images.",
            "Once for all you can think of this as a development development like stage Four, which this modelers.",
            "This basic tuning and then this basic tuning remains fixed afterwards and used for all other recognition tasks.",
            "And.",
            "In our case it can speak more about it, but.",
            "The tuning of a cell here will essentially represent the activity of units at this level elicited by, say, a Patch of natural image, and so this units are essentially memorizing activity.",
            "Correct sponding to the presence of.",
            "Common patches of natural images.",
            "So the learning here is essentially random sampling of.",
            "Activity induced by patches of natural images.",
            "And you do this learning layer by layer one sequentially after the other.",
            "And then at the top, as I said, you can think of a lost supervised stage classifier that would be trained with a set of labeled."
        ],
        [
            "Examples and.",
            "And the motivation that seems justified by empirical results so far is that this pre processing in which this set of layer learns a vocabulary of tunings that is learned from natural images.",
            "So hopefully a natural vocabulary or Dictionary of tunings.",
            "With their set of invariants is that this learning stage?",
            "Will pre process and you input a new image in such a way that the classifier at the top as an easier job can do a good job by using a small set of training examples smaller than what you would have?",
            "Labeled example smaller than you would have if you'd have to learn directly from the image.",
            "And in part this is due to this.",
            "The variance is that each see stage builds and so that by incrementally having more and more for instant translation or scaling variance, you get larger translation scaling variance at the top level.",
            "So when I speak about simple complexity of the preprocessing stage, I really refer some measure of the number of labeled examples required by the classifier at the top."
        ],
        [
            "So let me mention briefly just mention some of the evidence for that we have.",
            "There are many to take a long time to go through all the comparisons we have made, especially with Physiology and."
        ],
        [
            "What's up, psychophysics?",
            "I'll just."
        ],
        [
            "Mentioned briefly.",
            "That there is some evidence and you should not take this to be a proof in any sense that this family of model is correct.",
            "This is just saying that they do a reasonable good job in terms of explaining and predicting some experimental results, for instance.",
            "We we looked with the life of David, first, whether complex cells in V1 do a maximum like operation, and so it seems they do it.",
            "So this was a kind of prediction of the model.",
            "On the other hand, we used some of the data from Nikos Logothetis in infra temporal cortex to actually fit some parameters of the model.",
            "There are other things that this class of model is cost consistent with like properties of cells in V4 for various stimuli.",
            "And some of them were predictions like results from before about, invariant from IT, about invariants, and selectivity of cells there.",
            "So there is a number of evidence pieces of evidence that say this kind of description of the first 100 milliseconds of information processing in terms of the Physiology and anatomy is a reasonable.",
            "Does not say at all that this class of objects of models is the correct one, especially because, as I mentioned, it does not take into account this connectivity.",
            "The Backprojection, the connectivity from.",
            "Layer higher up towards layer, lower down."
        ],
        [
            "Another set of evidence comes from the psychophysics.",
            "For instance, you can do this kind of rapid categorization experiments and the way.",
            "One way to do it is to present an image briefly and then to have a mask and the function of the mask is to block processing, essentially to try to perturb what's happening in the back projections so that you would this kind of experiment should force the observer to have his or her visual system operate in a feedforward mode, and if you do that."
        ],
        [
            "That you find the the performance in a task like tell me whether there was an animal or not in the object.",
            "The performance of the model and humans ice pretty similar.",
            "It's about 80% correct.",
            "This kind of natural images with a similar behavior in terms of being better for images where the object is is large where.",
            "The clutter and background is small and getting worse for situations in which for images in which there is a lot of clutter and background.",
            "And."
        ],
        [
            "For this kind of task you find also a high correlation between the.",
            "So images for which the model is wrong are often images in which people are also wrong and vice versa.",
            "Um?"
        ],
        [
            "Now that I'm like three years ago, so I was also kind of surprised that this kind of models that was essentially trying to mimic what the Physiology in monkey was telling us.",
            "I was also doing pretty well compared to computer vision systems in terms, for instance, of finding 10 different classes of objects in database, database of scenes, images of streets.",
            "In Boston and Cambridge and.",
            "Objects, like cars and pedestrian and bicycle and buildings and trees.",
            "And straighten Sky and so on now."
        ],
        [
            "So, so we have this kind of sub."
        ],
        [
            "Active evidence that models of this type which I have are different from the ones coming from traditional, so to speak, learning theory, or at least for kernel machine type architecture.",
            "There is some evidence coming from the Physiology, the psychophysics, the agreement between the models, and the experiments, and also the good performance of this architecture compared to computer vision system.",
            "All of this.",
            "So it seemed to say, well, this this type of architecture work well and and The thing is that we have built this models, but we don't really know WHI they work as well as they seem to work and so there is independent of whether these models are correct or not.",
            "For Cortex there is this question of theoretical question of why they work and I think similar questions can be asked for architectures like.",
            "What young lacuna is described, for instance, and so we are in this kind of ironic situation in which we have a model of the brain that works, but we don't quite understand why and whether this would be a general lessons at the very bottom of the brain.",
            "Successful model will have this property or not, I don't know, but we certainly should try to develop some deeper understanding, at least of this kind of models.",
            "And so this is what?"
        ],
        [
            "What?",
            "Steve has pushed us and to do and has been doing.",
            "I want to give you just a brief brief mention.",
            "A brief flavor of.",
            "Work that is really at its beginning in trying to understand.",
            "Mathematical properties of this type of your archical feedforward architecture.",
            "Hopefully some point not only feedforward."
        ],
        [
            "So let me speak about this.",
            "Your archical architectures brief."
        ],
        [
            "And I'll.",
            "I'll describe what is the main.",
            "I'm not sure whether to call it a result, but the result of the work, which is to formulate in a mathematical sandoway this type of networks and.",
            "Of course there are things, and at least some of them at the end that we would like to prove about this kind of architectures find conditions under which.",
            "They work in the sense of reducing the sample complexity of the problem and why, why, and when under which condition this happens."
        ],
        [
            "Um?",
            "So in terms of the mathematical formulation, we have a kind of your archical structure, somewhat reminding of what happens with wavelets and architecture of nested patches of increasing size as you go from the bottom to the top.",
            "We have this in variances, which are a set of transformations from one layer to the next transformation that I'll speak mainly about translations, but they include other ones like scale and so on.",
            "And you have different function spaces for each layer and functions will be images.",
            "At least in the first layer, and then a set of templates which are this tunings that I spoke in the model?",
            "At each layer which are really.",
            "The connection with the.",
            "The real world in the sense of representing an empirical measure of the probability distribution of images and patches."
        ],
        [
            "So this is a case of a free layer situation in which you can think of this Patch as Q as the square square corresponding to the full image.",
            "And you have a first layer where the receptive field size is V1 and you have this nested system of view one contained in V2 contained in the in SQL."
        ],
        [
            "And then for each for the on the square we consider space of functional space of images.",
            "That are functions that map.",
            "This is the domain of the.",
            "Of of the image Askew into reals between zero and one, and you have similar function spaces but different ones.",
            "Different function defined on V1 and V2.",
            "And now I'm speaking about vision because I spoke so far about vision, but this kind of architecture could be used also on strings with a finite verb Dictionary of letters, for instance.",
            "So for inside genomic sequence and other data structure is not limited to images.",
            "But let's speak about images in this exam."
        ],
        [
            "And then there are, as I said, transformations that you can think of as Max from a Patch to the next larger Patch.",
            "For instance, transformation, age, finite number of them contained in H subscript V1.",
            "That might give you a name V2 and similarly from V22SQ and.",
            "You can think of this transformation as restricting an image F. To that kind of receptive field at a position essentially described by age.",
            "So."
        ],
        [
            "Um?",
            "Templates are patches of images are images, so are functions in.",
            "In V1 and V2 you can think of them as gain as finite number of templates at each level and a large number you can say and can think of them as we did in the model to be sampled from a large set of natural images.",
            "No."
        ],
        [
            "There is so the setup leads to this definition in which."
        ],
        [
            "We have suppose that you define a measure of similarity or a set of normalized with positive elements feature map and one.",
            "This would be for instance what you can get by.",
            "By defining.",
            "A. Kernel on the image themselves to start with and then once you have this you can define.",
            "K1 this kernel as I have this would be N one of F and N1 of G and then.",
            "The activity of this would correspond to complex cells at layer M. For a certain template T, and this is the activity of at layer M corresponding to an image F. This would be.",
            "What a simple this would be the response of a simple salad, the layer below.",
            "Which is put a particular simple cell will correspond to a specific age.",
            "In the set of transformation associated with that layer, and this would be 18 specific template T. So this is the dot product between an of M -- 1.",
            "Of F composed with age and an minus one of T so the neural activity associated with the template team.",
            "Which is an image.",
            "And then taking the Max over this simple or the simple cells.",
            "In age 'cause this would correspond to simple size, this would give the neural activity of the complex size at level M. For for corresponding to the template T. And and so this is a recursive definition that.",
            "And the only thing I neglected to say is that this is the start with kernel K1 and this had here describe a Colonel M -- 1 which is normalized so it's divided the normalized version of K1F, G would be K1F, G / sqrt K, one F, F time K1G, G. So the value of the maximum value of the normalized kernel is 1.",
            "And and this gives away at a cursive way to compute.",
            "The neural activity and this set of derived kernels at each layer.",
            "This is a.",
            "Pretty accurate description of what's going on in the model, and it's also an interesting way to extend in a hierarchical way.",
            "Approaches like kernel machines, so the first, the first layer.",
            "You can think of what's happening here, say, and two.",
            "Would be the you describe an image F in terms of the similarity that this kernel would provide between the image and a set of templates.",
            "You look for the maximum correlation if you want between the image and the template maximum under a set of transformations.",
            "So that is standard kind of template matching.",
            "Idea is the first layer.",
            "You described any image in terms of a vector that describe the similarity to a given set of templates under transfer, a set of transformation similarities, maximum similarity for each template and for different age and then.",
            "But then you iterate this organization so once you have this set of similarity, this is you can think of it as an image and then you are going to describe gain using a similar.",
            "Approach and it's becoming very counter intuitive what's going on and from the 2nd to the third level.",
            "But it becomes more intuitive, at least for me if I think about the fact that this is exactly what the border described earlier does.",
            "And and this is a mathematical way to describe it that should provide.",
            "A basis for which.",
            "So that we one can prove things and."
        ],
        [
            "So especially Steve Lorenzo and Jacob."
        ],
        [
            "Started to do this and there are some initial results in terms of characterizing some invariants and selectivity properties of these architectures.",
            "For instance, results that say that if the initial kernel with you start with is some invariants property where there is some specific transformation, then all other layers will essentially narrate this invariants property.",
            "And."
        ],
        [
            "And some other ones that is valid for strings under some assumptions about the specific form of the architecture.",
            "That says that if this some high level layer and the F&G have value one, so they're very similar according to this derived kernel, then F&G are essentially the same string apart from.",
            "Some.",
            "A logical situation in which one is the exactly the reversal of the other.",
            "Or you have strings of a special kind like this."
        ],
        [
            "Empirically.",
            "There is some evidence that if you have more layers.",
            "You can have a small number of labeled example the classifier looking at the top and still do a good job and so you have the case of.",
            "One layer or just the image and two layers and free layers.",
            "So for safe, yeah.",
            "Sorry.",
            "It's bad."
        ],
        [
            "What's up?",
            "Weather all could be like a rotation of the image, for instance, or a reflection or."
        ],
        [
            "These are just example because I kind of special case, but are these are, I'll say in a second but.",
            "The real kind of things."
        ],
        [
            "Like to prove up for its approved something like this, under which conditions you can improve performance by increasing the number of layers and what is the optimal number of layers and for certain classes of problems or images."
        ],
        [
            "And so, in fact, the open problems that are really the most more interesting one is this connection, really between the sample complexity number of layers, under which condition this theoretical architectures work.",
            "I think properties two wants to add something because I learned from him they probably correspond to some basic properties of the data you fit in that in some sense.",
            "They are.",
            "They have some compositional properties.",
            "They are made of parts intuitively and parts are made of parts, so this would be the intuition that these things don't work for any day kind of data.",
            "But for certain type of data and they tried to be very interesting to find a characterization mathematical characterization of which conditions are necessary for this kind of your article architecture to do well.",
            "And there are certain other things that are more obvious, like efficient learning of the templates.",
            "You can think of doing certain types of dimensionality reductions like using Laplacian Eigen Maps or so going from one layer to another in terms rather than just random subsampling of natural images.",
            "You can think of steps like this like corresponding to what deep belief networks are doing.",
            "The kind of of architectures that young raccoon has been speaking about are very similar to this one.",
            "They're fit for that runtime.",
            "The only difference is the learning stage, where they use out encoding or restricted Boltzmann machine or these things I don't understand, but but it's essentially how how, the.",
            "Features are learned in an unsupervised way, and so that's clearly a.",
            "A near where one can do interesting things, empirical and theoretical.",
            "But but as I said, there are a lot of open problems and hopefully this kind of mathematical framework will open the way to answer in terms of theorems.",
            "Some of these questions."
        ],
        [
            "Now let me finish just now."
        ],
        [
            "Mentioning a couple of things that are going back to the model that we are doing in extending it.",
            "One is essentially an extension extension that include now the ventral dorsal stream, so motion so it's really extending the architecture to deal with video rather than isolated images, and so there is a system that to mass air and we run June have been developing that.",
            "He's a model of the dorsal stream, but a version of it is used now for doing quantitative automatic phenotyping of mice behavior, in which you classify or the mouse in a cage is doing in terms of 10 or so basic actions like walking and freezing and hanging and eat.",
            "And then you can build statistics and Markov chains and Markov models of this behavior, and in this way.",
            "Associate a quantitative phenotype to specific.",
            "Genotype biologists are dealing with hundreds and thousands of different mutants of mice.",
            "Often these are models of diseases like mental diseases, schizophrenia, depression, and there are the genotype and quantitative characterization of the genome is now standard.",
            "What is missing is a quantitative way to Pheno type the behavior and so far.",
            "People have been doing this by hand, and of course this restricts how much of the behavior and the statistics they can do.",
            "So these are interesting ways for the future in computer vision.",
            "To do some useful applications, it's kind of again interesting that we start from a model of cortex and we do something that may be interesting for biology as an engineering application."
        ],
        [
            "And then, in terms of extensions of the model itself, we've been working on modeling attention and."
        ],
        [
            "Starting from Physiology data, Bob the Simone and their Miller again work in monkeys and there are structures in cortex outside the ventral stream like frontal eye field, which is part of prefrontal quarters cortex.",
            "An LIP which are likely to be involved in attention in and driving I movements.",
            "And so."
        ],
        [
            "We have some model of of this interaction which is kind of in a sense now connecting the top to lower level.",
            "And that is essentially capable of locating regions in the image which are likely to contain an object of interest.",
            "And then restricting processing to that part, eliminating as much as possible of the clutter with decreases or the background, which decreases the performance of this feedforward model.",
            "And by adding this attentional part to the other side described you improve performance in recognition.",
            "And also you can."
        ],
        [
            "And predict fairly well how people move their eyes when they have to look at an image.",
            "Depending on the task.",
            "For instance, people move their eyes in a different way.",
            "If you tell them counted and cars in this image or for the same image you tell them count number of Podesta, count pedestrians and the model.",
            "Depending on this task can predict value while the green area what people are going to do."
        ],
        [
            "So I finished just mentioning obvious limitation of this family of models.",
            "I spoke about the feedforward one.",
            "The main problem I see is that vision is much more than than classifying an image saying in an object, say a car or an animal is in the image or not because.",
            "I can ask you any kind of question about images, specially in a set of infinite questions, and you can certainly answer.",
            "You can tell me what are the objects here, even if you've never seen them before and you can make stories or interpretations of any image.",
            "So this is where vision is really merging with general intelligence, and I don't see any straightforward way for the class of models I described to deal with situations of this kind.",
            "So there are at least three options, and they're kind of vaguely defined for other types of models like.",
            "Top down control.",
            "Maybe in the sense of attention, but of different programs that you can imagine running in prefrontal cortex that are going to look at representations at a lower level in view.",
            "One for instance, and Canaan Square question of whether, for instance, I'm to the left or to the right of the screen.",
            "And.",
            "Or some probabilistic inference in the ventral stream?",
            "I guess that's what David Mumford has suggested, and I'm not sure why there's two believes it or not, but.",
            "And maybe things that are not your article in the same physical way as the ventral stream is, but.",
            "Like here are called probabilistic inference.",
            "And whether any of this is a good way to proceed or not, I don't know, but these are at least free broad possibilities to go beyond feedforward models."
        ],
        [
            "And I'll finish here, and this is the number of people in the group, specially Lorenzo and Jake Bouverie have been working with Steve Smale on what I described about the drives kernels and these are a number mostly of physiologists that with which with whom we have been collaborating over the past few years.",
            "Thank you.",
            "Yep.",
            "Assumption that these lower levels of processing should be unsupervised learning is that based in is logical science.",
            "Yes, I think.",
            "There is a number of studies going back to at least let's Uber Visa and Colin Blakemore and so on that suggest that experience has an effect during critical phase of development in view.",
            "One for instance.",
            "And there is.",
            "Direct indirect evidence that again experienced during development is important for the tuning properties of cells in the visual pathway.",
            "There is also evidence that relatively fast learning can happen at higher levels.",
            "Say IT probably faster than at lower levels.",
            "But you know this is more of an educated guess, so the idea would be that it would take a longer time to set up bottom to talk.",
            "But you know it's not proven right.",
            "Physiologist are starting more or less now to record from the behaving monkeys and see learning effects in sales.",
            "Jim Decarlo, for instance, have been doing this just a few months ago and so there is some evidence of plasticity in IT cells that we can measure during a recording session.",
            "There are many limitations in terms of experimental techniques that so far I've been making this question a difficult one.",
            "Steven basic.",
            "Layer two, there are these templates, yeah?",
            "Is that also based on Physiology called?",
            "That's for example, one could imagine the kind of KB algorithm out of 454 and learning from the data on the way I know well, so the evidence is that various levels in the visual pathway.",
            "We have cells that are tuned.",
            "To specific stimuli and their tuned.",
            "If I record now and they are tuned to the same type of Steam affair according in one hour or or two.",
            "And people assume even in a few days, and so for instance, if I find myself in before that respond to some kind of contour or some pattern respond optimally, will continue to respond to it later on.",
            "This this, you know, the assumption is this is a fixed tuning.",
            "Now one has to be very careful, so maybe there is more plasticity than one.",
            "This is also related to your question, but so far physiologists have been assuming that this tuning is.",
            "You know this fixed.",
            "Yep.",
            "How do you identify that?",
            "Well, you know this is a touchy area.",
            "I mean you have some.",
            "You measure some behavior that are.",
            "Well.",
            "This is complicated so people can engineer can engineer different type of mutants.",
            "So you can look at so you know that some.",
            "There are some genes suspected to be involved in for instance.",
            "Depression and so, and they typically maybe synaptic genes.",
            "So then you can create mutants where your knockout the gene or you have a mutation that you know is in may be involved and then you look at the behavior of the mouse and see some some trades that you say OK they are similar to what I see in humans and that's what is very you know.",
            "That's a guess work and then this becomes a potential model for that disease in the mouth, and hopefully some cases people have been able to make a strong case of this is not proof right?",
            "But then you can.",
            "You can look at, for instance, whether this has been done, whether drugs used for depression in humans do affect this behaviour in mouse that you think is similar to depression, and so you can get various kind of evidence supporting.",
            "This model and you know some people are quite critical of this approach, but it is a reasonable 1.",
            "One has to be careful because especially mental disease is very likely that the genes involved are many in the order of 50 or 100, so you cannot so far engineer all these mutations you are going to look at only a subset.",
            "What may be involved in the Pheno type.",
            "Monferno type.",
            "Works like a single multiclass classifier, or works like some sort of combination socket classifier.",
            "If you tell me.",
            "Be happy I don't know what you mean in terms of award Physiology.",
            "Behavior.",
            "Then it's working there as well, like Singuefield multi class classifier, yeah?",
            "China hierarchal systems different way where you combine different classifiers that if we wanted there is specializes something and then the second thing Oh yeah.",
            "Now we know we have done that.",
            "For instance, we have tested this class of models on the Caltech.",
            "101 Database these are 101 different categories of objects, so we have done classification, multiclass classification.",
            "Right, you use the same basic preprocessing stage and you have a set of different classifier for instance.",
            "You know to do multiclass classification at the last stage.",
            "Now that that works pretty well and all the first you know and layers are the same, you don't need to change them.",
            "If he does, I like it what?",
            "Socket classifiers, like ones that discriminate if this is.",
            "Living thing.",
            "An animal or bird and any suppliers and second little oh I see.",
            "So you are saying going from, say for instance living non living vertebrate and then Tigers or so OK?",
            "Multiclass classifier.",
            "Yeah.",
            "Yeah, this is.",
            "Let's see.",
            "Yeah, there is some.",
            "It's unclear in terms of the physiological evidence.",
            "Let's see if there is some.",
            "Some claim that you have.",
            "Let's see that you have a cluster of activity 90 corresponding to different categories like living things and nonliving and tools.",
            "And whether that's true or not is still completely open, and this may be a substrate for what you're saying.",
            "OK, thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our plenary talk today will be commercial project from MIT and the.",
                    "label": 0
                },
                {
                    "sent": "Title of the Doctors learning in hierarchical architecture.",
                    "label": 1
                },
                {
                    "sent": "Well, thanks to everybody for coming next to the organizer for the invitation.",
                    "label": 0
                },
                {
                    "sent": "Today the message I'd like to give you the top level one anyway, is that neuroscience is providing new ideas to computer science, and also that neuroscience need mathematics.",
                    "label": 1
                },
                {
                    "sent": "In particular, the data are not enough, and even quantitative models may not be enough to understand how parts of the brain work.",
                    "label": 0
                },
                {
                    "sent": "So let me start with learning.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so over the past 15 or 20 years we have been working on learning believe.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That learning is one of the keys to understanding.",
                    "label": 0
                },
                {
                    "sent": "Intelligence, both biological and artificial, and I want to make a point justice brief point about learning supervised unsupervised learning.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And address briefly this issue of architectures deep and shallow and sample complexity.",
                    "label": 0
                },
                {
                    "sent": "Need how many labeled examples you need.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For a certain task.",
                    "label": 0
                },
                {
                    "sent": "So you're probably familiar with the kind of setup that has been used in the past several years for supervised learning you have.",
                    "label": 0
                },
                {
                    "sent": "A probability distribution on a space of XY and you don't know the probability distribution, but what you have is a set of examples which are input output pairs.",
                    "label": 0
                },
                {
                    "sent": "Drawn from this unknown probability distribution and the goal is to learn from this training set of data points to learn a map that will learning algorithm app that will look at the training set and then based on it select a model, A function, a set of rules that can be used to predict.",
                    "label": 0
                },
                {
                    "sent": "Huawei from New X and I'm using the word predict in lose way.",
                    "label": 0
                },
                {
                    "sent": "I can define it more precisely.",
                    "label": 0
                },
                {
                    "sent": "I would not do it today, but that's the kind of setup.",
                    "label": 0
                },
                {
                    "sent": "For soup.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Advised learning now.",
                    "label": 0
                },
                {
                    "sent": "There are several family of algorithms that I've proven to work reasonably well empirically, and some of them have reasonable theoretical guarantees.",
                    "label": 0
                },
                {
                    "sent": "One of these family is based on reproducing kernel machines.",
                    "label": 0
                },
                {
                    "sent": "It's based on minimizing a cost function where you have a first term that looks for the F. In an appropriate function space Age space of hypothesis that minimizes some measure of an empirical error, the error on the set of an examples and you have also a term regularizer that imposes some constraints on, say, the complexity of the hypothesis F on the minimizer and the solution of this problem, and the relatively general conditions.",
                    "label": 0
                },
                {
                    "sent": "With that norm there on F being the norm in the reproducing camera space defined by a positive definite symmetric function of two variables K. As this general form in the moralize, independent of the form of V, the coefficient Alpha, it depends on V and so you get various techniques like support vector machines, regularization, network, radio basis functions, linear, regular regularised regression and classification and so on.",
                    "label": 1
                },
                {
                    "sent": "They all have that form a linear combination of kernel K centered on each.",
                    "label": 0
                },
                {
                    "sent": "On one of the examples of the Anexample side now.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As always, you can look at this formula and draw a graph or a network corresponding to it, and in this case you would have a network with one layer between the input and the output.",
                    "label": 0
                },
                {
                    "sent": "This layer of kernels where the units there would correspond to the value of K. XI.",
                    "label": 0
                },
                {
                    "sent": "This I goes from one to N. For a particular input X.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "And then you can say that this corresponds to, let's say, shallow network.",
                    "label": 0
                },
                {
                    "sent": "If you want to use this term because there is only one layer between the input and the output is not an architecture with many many layers, like the architectures that young lacuna.",
                    "label": 0
                },
                {
                    "sent": "For instance, and several others described.",
                    "label": 0
                },
                {
                    "sent": "So this kind of classical learning theory corresponds to shallow architectures, and there is no obvious way how to extend.",
                    "label": 1
                },
                {
                    "sent": "This kind of approach to multiple layers now.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Back several years ago, just looking at.",
                    "label": 0
                },
                {
                    "sent": "I comparison between nervous system and brains and learning algorithms such as kernel machines.",
                    "label": 1
                },
                {
                    "sent": "What there are we came up with some.",
                    "label": 0
                },
                {
                    "sent": "Obvious.",
                    "label": 0
                },
                {
                    "sent": "Statement about differences and two puzzles.",
                    "label": 0
                },
                {
                    "sent": "In a sense, one having to do with the poverty of stimulus problem, the apparent ability of people and other biological Organism to learn a task like recognize say panda bears or.",
                    "label": 1
                },
                {
                    "sent": "Something like that from just a very small number of the examples, often one.",
                    "label": 1
                },
                {
                    "sent": "I say a parent ability because it's always difficult to control, especially for people how much previous experience has played a role, but.",
                    "label": 0
                },
                {
                    "sent": "The outer superficial belief at least, is that you can learn many tasks from very few examples.",
                    "label": 0
                },
                {
                    "sent": "Much fewer than you need for techniques like kernel machines.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Another puzzle is related to what I mentioned about shallow architectures.",
                    "label": 0
                },
                {
                    "sent": "If you look at the brain, you see what seems to be a much more hierarchical in terms of stages.",
                    "label": 0
                },
                {
                    "sent": "Many more stages of processing than just one layer between the input and the output, and one can even ask whether these two puzzle are related to each other.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me look briefly at Cortex, so this is going to be a bit different from the talks you have heard so far.",
                    "label": 0
                },
                {
                    "sent": "To be more neuroscience than mathematics.",
                    "label": 0
                },
                {
                    "sent": "But just to give you the background, from the neuroscience perspective on this puzzle about essentially approaches to learning and learning architectures.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let's look in particular to vision.",
                    "label": 1
                },
                {
                    "sent": "What is you see?",
                    "label": 1
                },
                {
                    "sent": "Here are several areas in the visual cortex.",
                    "label": 0
                },
                {
                    "sent": "Which is.",
                    "label": 0
                },
                {
                    "sent": "Vision is the sensory modality which occupies the largest part of cortex relative to other sensory modalities.",
                    "label": 0
                },
                {
                    "sent": "And what you see here are visual areas starting with V1 and then V2V, four IT infra temporal cortex.",
                    "label": 0
                },
                {
                    "sent": "That represent together what is called the ventral stream, which should be involved quite a lot in recognizing objects.",
                    "label": 0
                },
                {
                    "sent": "There is different streams of evidence pointing to that starting from lesions in patients that lose recognition ability for when they have lesions in parts of this ventral pathways to.",
                    "label": 0
                },
                {
                    "sent": "FMRI evidence in the meantime, Physiology from monkeys which have an architecture very similar architectures to humans.",
                    "label": 0
                },
                {
                    "sent": "In fact, this is the macaque monkey brain, and this is the back of the head, and this is the front information from the eyes goes to V1 primary visual cortex and then V2V four it and then to none purely visual areas like prefrontal cortex to a decision.",
                    "label": 0
                },
                {
                    "sent": "And planning is made and so.",
                    "label": 0
                },
                {
                    "sent": "Let's assume that in fact this plays a big role in object recognition, but this is by the way, the ventral stream here, the one here sharing some of the areas with the ventral stream is the dorsal stream, which traditionally is been regarded as describing more task where you have motion is involved and where things are come back to that later.",
                    "label": 1
                },
                {
                    "sent": "Briefly.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This is the kind of problems.",
                    "label": 0
                },
                {
                    "sent": "Which the ventral stream is supposed to be critical for, like answering questions like is your car in that image or not is an animal in that image or not?",
                    "label": 1
                },
                {
                    "sent": "And present images like this which you have never seen before.",
                    "label": 0
                },
                {
                    "sent": "Probably just exactly these images.",
                    "label": 0
                },
                {
                    "sent": "You still can answer this kind of questions very easy.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now just in terms of number, our brain consists of about 10 to the 11 neurons or so, 10 to the 14th synapses contracts between neurons.",
                    "label": 0
                },
                {
                    "sent": "Our brain is about 1,000,000 fly brain.",
                    "label": 0
                },
                {
                    "sent": "And the ventral stream is about 1 billion neurons, so it's large, but not very large.",
                    "label": 1
                },
                {
                    "sent": "We can start just recently to be able to simulate millions of neurons, or some models of them, and so we're getting close to be able to simulate structures like the ventral stream.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Typically, if you look at the Physiology of the last several years and by the way, all I've been saying also with respect to the what and where pathway and what I'm going to say now are simplification.",
                    "label": 0
                },
                {
                    "sent": "Things are always more complicated, so take what I say with some some care.",
                    "label": 0
                },
                {
                    "sent": "For instance, don't take this picture which comes from Keiji Tanaka more than 10 years ago, literally.",
                    "label": 0
                },
                {
                    "sent": "But this.",
                    "label": 0
                },
                {
                    "sent": "The message here is that if you look for stimuli that stimulate best neurons, single neurons are recording from with microelectrodes you find that in V1 neurons tend to be activated quite well by things like oriented counters.",
                    "label": 0
                },
                {
                    "sent": "So that's the preferred stimulus in view one.",
                    "label": 1
                },
                {
                    "sent": "Typically there are section and use as you go up this ventral pathway, you find that stimulate they excite most the neurons there become more and more complicated, up to a point where in the anterior part of infra temporal cortex you may find neurons that respond to faces and in some cases to specific individual faces.",
                    "label": 0
                },
                {
                    "sent": "OK, so at the same time as you go up the ventral pathway, you have a gradual increase in the size of the receptive field.",
                    "label": 0
                },
                {
                    "sent": "Receptive field is the part of the image that will be seen by a cell.",
                    "label": 0
                },
                {
                    "sent": "In other words that when something happens in the receptive fields, the cell will answer and whereas.",
                    "label": 0
                },
                {
                    "sent": "Neurons in V1 have a receptive field which in the fovea maybe less than one degree of visual angle.",
                    "label": 0
                },
                {
                    "sent": "In IT you find neurons that have typically receptive field which is at least five degrees in diameter or so.",
                    "label": 0
                },
                {
                    "sent": "So there is a gradual increase in the size of the receptive field.",
                    "label": 1
                },
                {
                    "sent": "The part of the image each neuron is looking at and also in the complexity of the stimuli and also.",
                    "label": 0
                },
                {
                    "sent": "It appears in tolerance, so not quite invariants, but tolerance to changes in position and size of the optimal stimuli.",
                    "label": 0
                },
                {
                    "sent": "In other words, in it you could, if you find the neurons responding to a face, it's a good bet that if you displace the face by 1 degree or two, the neuron will not change very much its response.",
                    "label": 0
                },
                {
                    "sent": "Whereas you know 2 degrees, say 1 degree of visual angles are 120 photoreceptors shift, so it's huge.",
                    "label": 0
                },
                {
                    "sent": "Photoreceptors in the fovea human fovea have diameter and the spacing of 30 seconds of Arc.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is again map of the visual area from David Finesse and John Maunsell, and this in calories.",
                    "label": 0
                },
                {
                    "sent": "The ventral pathway, as you can see, there are a lot of connections.",
                    "label": 1
                },
                {
                    "sent": "Essentially, the first rule is that everything is connected to everything else, and then you're looking for some exceptions, but in particular this connections are often almost always BI directional, so V1 goes to V2, but we two goes to V1.",
                    "label": 0
                },
                {
                    "sent": "And often the projection from higher areas to lower areas are stronger or more numerous than not stronger, but more numerous anatomically than the ones going from the bottom to the top.",
                    "label": 0
                },
                {
                    "sent": "Now, to simplify the modeling, we started taking, as others have done, taking the view that will.",
                    "label": 0
                },
                {
                    "sent": "Could see that first only the feedforward connections from.",
                    "label": 1
                },
                {
                    "sent": "We want to be 2 to be free and so on, and one of the argument is that we may be able to deal not with the reality of things.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Not vision at all, but with situation like this in which.",
                    "label": 0
                },
                {
                    "sent": "Images are presented very briefly and you don't have the time to move your eyes to expect an image, and you can use other arguments to argue that there is probably not enough time doing the experiment correctly for information to rely on feedback from higher areas to lower areas.",
                    "label": 0
                },
                {
                    "sent": "And we can discuss that later, so making this this simplification of considering feedwater connection.",
                    "label": 0
                },
                {
                    "sent": "May still allow us to consider recognition situation of that type in which I want to point out you can do pretty well.",
                    "label": 0
                },
                {
                    "sent": "You know I can present an image very briefly and you can still tell me weather for instance there there is or there is not an animal there or a car.",
                    "label": 0
                },
                {
                    "sent": "What a person now.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is going to give you some idea.",
                    "label": 0
                },
                {
                    "sent": "The estimates of the time that it takes to a neural signal to go from the eye.",
                    "label": 0
                },
                {
                    "sent": "To the IGN, which is a kind of for our purposes, consider data relay station and processing starting really in view on about 40 to 60 milliseconds after you flash the image in the retina, and then it takes up 200 or so milliseconds before signals arrive at the level of anterior infra temporal cortex.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Over the last my goodness.",
                    "label": 0
                },
                {
                    "sent": "Now it's almost 10 years.",
                    "label": 0
                },
                {
                    "sent": "Not quite but.",
                    "label": 0
                },
                {
                    "sent": "Actually 10 years we have been developing and comparing with experimental working so may mostly Physiology in monkeys working on collaboration with several experimental labs have been developing models of this type in which we have model units for each one of these main visual areas.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "We have an in a sequence of layers that we called simple one complex one simple to complex 2 and so on.",
                    "label": 0
                },
                {
                    "sent": "And you can think of.",
                    "label": 0
                },
                {
                    "sent": "So the the red one here is corresponding to the view and and and as two correspond to V2 and V4.",
                    "label": 0
                },
                {
                    "sent": "And then up to infra temporal cortex at say S4.",
                    "label": 0
                },
                {
                    "sent": "And then at the last at the top you can think of the very last connect connection from S4 to S5 as sake.",
                    "label": 0
                },
                {
                    "sent": "For simplicity, think of this as a set of circuits implementing a linear classifier.",
                    "label": 0
                },
                {
                    "sent": "And that's the only part I'll come to that later.",
                    "label": 0
                },
                {
                    "sent": "But it's the only part which is task dependent and would be.",
                    "label": 0
                },
                {
                    "sent": "You can think of it as being trained on a specific task, for instance.",
                    "label": 0
                },
                {
                    "sent": "Is there an animal in the image or not?",
                    "label": 0
                },
                {
                    "sent": "Everything else is you can think of as a preprocessing stage that is used for all different recognition tasks.",
                    "label": 0
                },
                {
                    "sent": "Now the.",
                    "label": 0
                },
                {
                    "sent": "This units healed correspond to cells in view one, and this character is the characterization of the cells in view.",
                    "label": 0
                },
                {
                    "sent": "One starts with Uber and Visa in 1968 or 1970 and the simple cells will be cells tuned to oriented contours, similar to Gabor filters.",
                    "label": 0
                },
                {
                    "sent": "You have seen quite a bit of that already, and.",
                    "label": 0
                },
                {
                    "sent": "Complex cells would be cells which have the same selectivity, say two oriented line with this orientation, but are more invariant to position and scale and so to some extent like Cuban visa in some way, like human is already described.",
                    "label": 0
                },
                {
                    "sent": "One conceptual model, what complex cells are doing is to pull pull together the inputs from simple cells at specific positions.",
                    "label": 0
                },
                {
                    "sent": "To get some invariants to position of the bar.",
                    "label": 0
                },
                {
                    "sent": "You want to be left open.",
                    "label": 0
                },
                {
                    "sent": "The nature of this pooling operation in this architecture described later, we have a maximum.",
                    "label": 0
                },
                {
                    "sent": "Here, so these cells here will have the value or the firing rate of the maximum of the firing rate of simple cells with the same selectivity at somewhat different positions.",
                    "label": 0
                },
                {
                    "sent": "OK, any questions so far.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This kind of model is is just an example of a whole family of model which was in words described by Huber and Visa in a very qualitative way and was first implemented by Fukushima.",
                    "label": 0
                },
                {
                    "sent": "And then by others.",
                    "label": 0
                },
                {
                    "sent": "Most of the models, they are really qualitative models.",
                    "label": 1
                },
                {
                    "sent": "And but they have recently very similar models by for instance, all men and younger kunan, yeah mate and so on.",
                    "label": 0
                },
                {
                    "sent": "Roughly in this general family of feedforward.",
                    "label": 1
                },
                {
                    "sent": "Here are chical models.",
                    "label": 0
                },
                {
                    "sent": "Now what we've done in a sense, to be to try to be more faithful to the data, Physiology and anatomy.",
                    "label": 0
                },
                {
                    "sent": "To build a simulation that is quite a bit larger than previous one in terms of number of units, there are millions of model neurons in in our model, and.",
                    "label": 1
                },
                {
                    "sent": "The the other thing.",
                    "label": 0
                },
                {
                    "sent": "To mention is that this as I said, there is a sequence of simple and complex cells, so you have a sequence of tuning and then invariants and then tuning to more complex feature combining simpler ones.",
                    "label": 0
                },
                {
                    "sent": "I'm using the word feature in a loser sense because they're not really feature and certainly not binary features.",
                    "label": 0
                },
                {
                    "sent": "They're like non linear combination of at least at this stage.",
                    "label": 0
                },
                {
                    "sent": "These are linear filters, but then there is a nonlinear Max operation and only.",
                    "label": 0
                },
                {
                    "sent": "A combination of these different filters, nonlinear filters and so on.",
                    "label": 0
                },
                {
                    "sent": "Combination as I would say in a second, are learned in an unsupervised way.",
                    "label": 0
                },
                {
                    "sent": "The invariances so the stage from the South to the sea layer are at the moment in the model built by hand through the connectivity they can be learned and we have demonstrated that they can be learned from natural images.",
                    "label": 1
                },
                {
                    "sent": "For instance the first level.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Can look as I'll say in a second.",
                    "label": 0
                },
                {
                    "sent": "OK, so the two operation corresponding to the tuning and the invariants are one.",
                    "label": 0
                },
                {
                    "sent": "The tuning is like a Gaussian like tuning.",
                    "label": 0
                },
                {
                    "sent": "So in this case.",
                    "label": 0
                },
                {
                    "sent": "The center of the Gaussian.",
                    "label": 0
                },
                {
                    "sent": "The optimal stimula will be a horizontal oriented bar and the activity of that unit will be described by the Gaussian function or well approximated by a normalized dot product.",
                    "label": 0
                },
                {
                    "sent": "And in our software you can choose between the two, the second one as a much more natural interpretation in terms of biophysics of what neurons and synapses can do.",
                    "label": 0
                },
                {
                    "sent": "And I'll come back to that later.",
                    "label": 0
                },
                {
                    "sent": "The other operation, going from S2C, is a Max like operation, so the first one is and like if you want a binary analogy, and this is all I can so you have.",
                    "label": 0
                },
                {
                    "sent": "A year or key of disjunctions of conjunctions similar to Stew, Jim and was speaking about yesterday only.",
                    "label": 0
                },
                {
                    "sent": "You're speaking in the generative sense and this is in the other direction.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just a quick note to say that for from the neuroscience point of view you can implement approximation of these two operations in terms of plausible synaptic properties and neural properties.",
                    "label": 0
                },
                {
                    "sent": "Essentially, lateral inhibition of the shunting type can do with different value of the parameters, either Gaussian like tuning actually something.",
                    "label": 0
                },
                {
                    "sent": "Similar to this.",
                    "label": 0
                },
                {
                    "sent": "And also a Max like operation.",
                    "label": 0
                },
                {
                    "sent": "So there are possible Inter neural implementation of these two operations.",
                    "label": 1
                },
                {
                    "sent": "There is also some evidence for the two operations at various levels in the visual pathway.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so that's for the architecture in terms of how the tuning is done.",
                    "label": 0
                },
                {
                    "sent": "We have a very simple way, so this should be regarded as only an initial way to do this is to learn the tuning of cells at the S levels.",
                    "label": 0
                },
                {
                    "sent": "For instance, yes, two cells.",
                    "label": 0
                },
                {
                    "sent": "The tuning of this size will depend on the W, the.",
                    "label": 0
                },
                {
                    "sent": "Sign optic weights going from this C1 cells to the S2 particulars two cells and those weights are learned by from a set of natural images.",
                    "label": 0
                },
                {
                    "sent": "Once for all you can think of this as a development development like stage Four, which this modelers.",
                    "label": 0
                },
                {
                    "sent": "This basic tuning and then this basic tuning remains fixed afterwards and used for all other recognition tasks.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "In our case it can speak more about it, but.",
                    "label": 0
                },
                {
                    "sent": "The tuning of a cell here will essentially represent the activity of units at this level elicited by, say, a Patch of natural image, and so this units are essentially memorizing activity.",
                    "label": 0
                },
                {
                    "sent": "Correct sponding to the presence of.",
                    "label": 0
                },
                {
                    "sent": "Common patches of natural images.",
                    "label": 0
                },
                {
                    "sent": "So the learning here is essentially random sampling of.",
                    "label": 0
                },
                {
                    "sent": "Activity induced by patches of natural images.",
                    "label": 0
                },
                {
                    "sent": "And you do this learning layer by layer one sequentially after the other.",
                    "label": 0
                },
                {
                    "sent": "And then at the top, as I said, you can think of a lost supervised stage classifier that would be trained with a set of labeled.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Examples and.",
                    "label": 0
                },
                {
                    "sent": "And the motivation that seems justified by empirical results so far is that this pre processing in which this set of layer learns a vocabulary of tunings that is learned from natural images.",
                    "label": 0
                },
                {
                    "sent": "So hopefully a natural vocabulary or Dictionary of tunings.",
                    "label": 0
                },
                {
                    "sent": "With their set of invariants is that this learning stage?",
                    "label": 0
                },
                {
                    "sent": "Will pre process and you input a new image in such a way that the classifier at the top as an easier job can do a good job by using a small set of training examples smaller than what you would have?",
                    "label": 0
                },
                {
                    "sent": "Labeled example smaller than you would have if you'd have to learn directly from the image.",
                    "label": 0
                },
                {
                    "sent": "And in part this is due to this.",
                    "label": 0
                },
                {
                    "sent": "The variance is that each see stage builds and so that by incrementally having more and more for instant translation or scaling variance, you get larger translation scaling variance at the top level.",
                    "label": 0
                },
                {
                    "sent": "So when I speak about simple complexity of the preprocessing stage, I really refer some measure of the number of labeled examples required by the classifier at the top.",
                    "label": 1
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me mention briefly just mention some of the evidence for that we have.",
                    "label": 0
                },
                {
                    "sent": "There are many to take a long time to go through all the comparisons we have made, especially with Physiology and.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What's up, psychophysics?",
                    "label": 0
                },
                {
                    "sent": "I'll just.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mentioned briefly.",
                    "label": 0
                },
                {
                    "sent": "That there is some evidence and you should not take this to be a proof in any sense that this family of model is correct.",
                    "label": 0
                },
                {
                    "sent": "This is just saying that they do a reasonable good job in terms of explaining and predicting some experimental results, for instance.",
                    "label": 0
                },
                {
                    "sent": "We we looked with the life of David, first, whether complex cells in V1 do a maximum like operation, and so it seems they do it.",
                    "label": 0
                },
                {
                    "sent": "So this was a kind of prediction of the model.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, we used some of the data from Nikos Logothetis in infra temporal cortex to actually fit some parameters of the model.",
                    "label": 0
                },
                {
                    "sent": "There are other things that this class of model is cost consistent with like properties of cells in V4 for various stimuli.",
                    "label": 0
                },
                {
                    "sent": "And some of them were predictions like results from before about, invariant from IT, about invariants, and selectivity of cells there.",
                    "label": 0
                },
                {
                    "sent": "So there is a number of evidence pieces of evidence that say this kind of description of the first 100 milliseconds of information processing in terms of the Physiology and anatomy is a reasonable.",
                    "label": 0
                },
                {
                    "sent": "Does not say at all that this class of objects of models is the correct one, especially because, as I mentioned, it does not take into account this connectivity.",
                    "label": 0
                },
                {
                    "sent": "The Backprojection, the connectivity from.",
                    "label": 0
                },
                {
                    "sent": "Layer higher up towards layer, lower down.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another set of evidence comes from the psychophysics.",
                    "label": 0
                },
                {
                    "sent": "For instance, you can do this kind of rapid categorization experiments and the way.",
                    "label": 1
                },
                {
                    "sent": "One way to do it is to present an image briefly and then to have a mask and the function of the mask is to block processing, essentially to try to perturb what's happening in the back projections so that you would this kind of experiment should force the observer to have his or her visual system operate in a feedforward mode, and if you do that.",
                    "label": 1
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That you find the the performance in a task like tell me whether there was an animal or not in the object.",
                    "label": 0
                },
                {
                    "sent": "The performance of the model and humans ice pretty similar.",
                    "label": 1
                },
                {
                    "sent": "It's about 80% correct.",
                    "label": 0
                },
                {
                    "sent": "This kind of natural images with a similar behavior in terms of being better for images where the object is is large where.",
                    "label": 0
                },
                {
                    "sent": "The clutter and background is small and getting worse for situations in which for images in which there is a lot of clutter and background.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For this kind of task you find also a high correlation between the.",
                    "label": 0
                },
                {
                    "sent": "So images for which the model is wrong are often images in which people are also wrong and vice versa.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now that I'm like three years ago, so I was also kind of surprised that this kind of models that was essentially trying to mimic what the Physiology in monkey was telling us.",
                    "label": 0
                },
                {
                    "sent": "I was also doing pretty well compared to computer vision systems in terms, for instance, of finding 10 different classes of objects in database, database of scenes, images of streets.",
                    "label": 1
                },
                {
                    "sent": "In Boston and Cambridge and.",
                    "label": 0
                },
                {
                    "sent": "Objects, like cars and pedestrian and bicycle and buildings and trees.",
                    "label": 0
                },
                {
                    "sent": "And straighten Sky and so on now.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So, so we have this kind of sub.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Active evidence that models of this type which I have are different from the ones coming from traditional, so to speak, learning theory, or at least for kernel machine type architecture.",
                    "label": 1
                },
                {
                    "sent": "There is some evidence coming from the Physiology, the psychophysics, the agreement between the models, and the experiments, and also the good performance of this architecture compared to computer vision system.",
                    "label": 0
                },
                {
                    "sent": "All of this.",
                    "label": 0
                },
                {
                    "sent": "So it seemed to say, well, this this type of architecture work well and and The thing is that we have built this models, but we don't really know WHI they work as well as they seem to work and so there is independent of whether these models are correct or not.",
                    "label": 0
                },
                {
                    "sent": "For Cortex there is this question of theoretical question of why they work and I think similar questions can be asked for architectures like.",
                    "label": 0
                },
                {
                    "sent": "What young lacuna is described, for instance, and so we are in this kind of ironic situation in which we have a model of the brain that works, but we don't quite understand why and whether this would be a general lessons at the very bottom of the brain.",
                    "label": 0
                },
                {
                    "sent": "Successful model will have this property or not, I don't know, but we certainly should try to develop some deeper understanding, at least of this kind of models.",
                    "label": 0
                },
                {
                    "sent": "And so this is what?",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What?",
                    "label": 0
                },
                {
                    "sent": "Steve has pushed us and to do and has been doing.",
                    "label": 0
                },
                {
                    "sent": "I want to give you just a brief brief mention.",
                    "label": 0
                },
                {
                    "sent": "A brief flavor of.",
                    "label": 0
                },
                {
                    "sent": "Work that is really at its beginning in trying to understand.",
                    "label": 0
                },
                {
                    "sent": "Mathematical properties of this type of your archical feedforward architecture.",
                    "label": 0
                },
                {
                    "sent": "Hopefully some point not only feedforward.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me speak about this.",
                    "label": 0
                },
                {
                    "sent": "Your archical architectures brief.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I'll.",
                    "label": 0
                },
                {
                    "sent": "I'll describe what is the main.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure whether to call it a result, but the result of the work, which is to formulate in a mathematical sandoway this type of networks and.",
                    "label": 0
                },
                {
                    "sent": "Of course there are things, and at least some of them at the end that we would like to prove about this kind of architectures find conditions under which.",
                    "label": 0
                },
                {
                    "sent": "They work in the sense of reducing the sample complexity of the problem and why, why, and when under which condition this happens.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So in terms of the mathematical formulation, we have a kind of your archical structure, somewhat reminding of what happens with wavelets and architecture of nested patches of increasing size as you go from the bottom to the top.",
                    "label": 0
                },
                {
                    "sent": "We have this in variances, which are a set of transformations from one layer to the next transformation that I'll speak mainly about translations, but they include other ones like scale and so on.",
                    "label": 0
                },
                {
                    "sent": "And you have different function spaces for each layer and functions will be images.",
                    "label": 0
                },
                {
                    "sent": "At least in the first layer, and then a set of templates which are this tunings that I spoke in the model?",
                    "label": 0
                },
                {
                    "sent": "At each layer which are really.",
                    "label": 0
                },
                {
                    "sent": "The connection with the.",
                    "label": 0
                },
                {
                    "sent": "The real world in the sense of representing an empirical measure of the probability distribution of images and patches.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is a case of a free layer situation in which you can think of this Patch as Q as the square square corresponding to the full image.",
                    "label": 0
                },
                {
                    "sent": "And you have a first layer where the receptive field size is V1 and you have this nested system of view one contained in V2 contained in the in SQL.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then for each for the on the square we consider space of functional space of images.",
                    "label": 0
                },
                {
                    "sent": "That are functions that map.",
                    "label": 0
                },
                {
                    "sent": "This is the domain of the.",
                    "label": 0
                },
                {
                    "sent": "Of of the image Askew into reals between zero and one, and you have similar function spaces but different ones.",
                    "label": 0
                },
                {
                    "sent": "Different function defined on V1 and V2.",
                    "label": 0
                },
                {
                    "sent": "And now I'm speaking about vision because I spoke so far about vision, but this kind of architecture could be used also on strings with a finite verb Dictionary of letters, for instance.",
                    "label": 0
                },
                {
                    "sent": "So for inside genomic sequence and other data structure is not limited to images.",
                    "label": 0
                },
                {
                    "sent": "But let's speak about images in this exam.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then there are, as I said, transformations that you can think of as Max from a Patch to the next larger Patch.",
                    "label": 0
                },
                {
                    "sent": "For instance, transformation, age, finite number of them contained in H subscript V1.",
                    "label": 0
                },
                {
                    "sent": "That might give you a name V2 and similarly from V22SQ and.",
                    "label": 0
                },
                {
                    "sent": "You can think of this transformation as restricting an image F. To that kind of receptive field at a position essentially described by age.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Templates are patches of images are images, so are functions in.",
                    "label": 0
                },
                {
                    "sent": "In V1 and V2 you can think of them as gain as finite number of templates at each level and a large number you can say and can think of them as we did in the model to be sampled from a large set of natural images.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There is so the setup leads to this definition in which.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have suppose that you define a measure of similarity or a set of normalized with positive elements feature map and one.",
                    "label": 0
                },
                {
                    "sent": "This would be for instance what you can get by.",
                    "label": 0
                },
                {
                    "sent": "By defining.",
                    "label": 0
                },
                {
                    "sent": "A. Kernel on the image themselves to start with and then once you have this you can define.",
                    "label": 0
                },
                {
                    "sent": "K1 this kernel as I have this would be N one of F and N1 of G and then.",
                    "label": 0
                },
                {
                    "sent": "The activity of this would correspond to complex cells at layer M. For a certain template T, and this is the activity of at layer M corresponding to an image F. This would be.",
                    "label": 0
                },
                {
                    "sent": "What a simple this would be the response of a simple salad, the layer below.",
                    "label": 0
                },
                {
                    "sent": "Which is put a particular simple cell will correspond to a specific age.",
                    "label": 0
                },
                {
                    "sent": "In the set of transformation associated with that layer, and this would be 18 specific template T. So this is the dot product between an of M -- 1.",
                    "label": 0
                },
                {
                    "sent": "Of F composed with age and an minus one of T so the neural activity associated with the template team.",
                    "label": 0
                },
                {
                    "sent": "Which is an image.",
                    "label": 0
                },
                {
                    "sent": "And then taking the Max over this simple or the simple cells.",
                    "label": 0
                },
                {
                    "sent": "In age 'cause this would correspond to simple size, this would give the neural activity of the complex size at level M. For for corresponding to the template T. And and so this is a recursive definition that.",
                    "label": 0
                },
                {
                    "sent": "And the only thing I neglected to say is that this is the start with kernel K1 and this had here describe a Colonel M -- 1 which is normalized so it's divided the normalized version of K1F, G would be K1F, G / sqrt K, one F, F time K1G, G. So the value of the maximum value of the normalized kernel is 1.",
                    "label": 0
                },
                {
                    "sent": "And and this gives away at a cursive way to compute.",
                    "label": 0
                },
                {
                    "sent": "The neural activity and this set of derived kernels at each layer.",
                    "label": 0
                },
                {
                    "sent": "This is a.",
                    "label": 0
                },
                {
                    "sent": "Pretty accurate description of what's going on in the model, and it's also an interesting way to extend in a hierarchical way.",
                    "label": 0
                },
                {
                    "sent": "Approaches like kernel machines, so the first, the first layer.",
                    "label": 0
                },
                {
                    "sent": "You can think of what's happening here, say, and two.",
                    "label": 0
                },
                {
                    "sent": "Would be the you describe an image F in terms of the similarity that this kernel would provide between the image and a set of templates.",
                    "label": 0
                },
                {
                    "sent": "You look for the maximum correlation if you want between the image and the template maximum under a set of transformations.",
                    "label": 0
                },
                {
                    "sent": "So that is standard kind of template matching.",
                    "label": 0
                },
                {
                    "sent": "Idea is the first layer.",
                    "label": 0
                },
                {
                    "sent": "You described any image in terms of a vector that describe the similarity to a given set of templates under transfer, a set of transformation similarities, maximum similarity for each template and for different age and then.",
                    "label": 0
                },
                {
                    "sent": "But then you iterate this organization so once you have this set of similarity, this is you can think of it as an image and then you are going to describe gain using a similar.",
                    "label": 0
                },
                {
                    "sent": "Approach and it's becoming very counter intuitive what's going on and from the 2nd to the third level.",
                    "label": 0
                },
                {
                    "sent": "But it becomes more intuitive, at least for me if I think about the fact that this is exactly what the border described earlier does.",
                    "label": 0
                },
                {
                    "sent": "And and this is a mathematical way to describe it that should provide.",
                    "label": 0
                },
                {
                    "sent": "A basis for which.",
                    "label": 0
                },
                {
                    "sent": "So that we one can prove things and.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So especially Steve Lorenzo and Jacob.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Started to do this and there are some initial results in terms of characterizing some invariants and selectivity properties of these architectures.",
                    "label": 0
                },
                {
                    "sent": "For instance, results that say that if the initial kernel with you start with is some invariants property where there is some specific transformation, then all other layers will essentially narrate this invariants property.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And some other ones that is valid for strings under some assumptions about the specific form of the architecture.",
                    "label": 0
                },
                {
                    "sent": "That says that if this some high level layer and the F&G have value one, so they're very similar according to this derived kernel, then F&G are essentially the same string apart from.",
                    "label": 0
                },
                {
                    "sent": "Some.",
                    "label": 0
                },
                {
                    "sent": "A logical situation in which one is the exactly the reversal of the other.",
                    "label": 0
                },
                {
                    "sent": "Or you have strings of a special kind like this.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Empirically.",
                    "label": 0
                },
                {
                    "sent": "There is some evidence that if you have more layers.",
                    "label": 0
                },
                {
                    "sent": "You can have a small number of labeled example the classifier looking at the top and still do a good job and so you have the case of.",
                    "label": 0
                },
                {
                    "sent": "One layer or just the image and two layers and free layers.",
                    "label": 0
                },
                {
                    "sent": "So for safe, yeah.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "It's bad.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What's up?",
                    "label": 0
                },
                {
                    "sent": "Weather all could be like a rotation of the image, for instance, or a reflection or.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These are just example because I kind of special case, but are these are, I'll say in a second but.",
                    "label": 0
                },
                {
                    "sent": "The real kind of things.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Like to prove up for its approved something like this, under which conditions you can improve performance by increasing the number of layers and what is the optimal number of layers and for certain classes of problems or images.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so, in fact, the open problems that are really the most more interesting one is this connection, really between the sample complexity number of layers, under which condition this theoretical architectures work.",
                    "label": 1
                },
                {
                    "sent": "I think properties two wants to add something because I learned from him they probably correspond to some basic properties of the data you fit in that in some sense.",
                    "label": 0
                },
                {
                    "sent": "They are.",
                    "label": 0
                },
                {
                    "sent": "They have some compositional properties.",
                    "label": 0
                },
                {
                    "sent": "They are made of parts intuitively and parts are made of parts, so this would be the intuition that these things don't work for any day kind of data.",
                    "label": 0
                },
                {
                    "sent": "But for certain type of data and they tried to be very interesting to find a characterization mathematical characterization of which conditions are necessary for this kind of your article architecture to do well.",
                    "label": 0
                },
                {
                    "sent": "And there are certain other things that are more obvious, like efficient learning of the templates.",
                    "label": 1
                },
                {
                    "sent": "You can think of doing certain types of dimensionality reductions like using Laplacian Eigen Maps or so going from one layer to another in terms rather than just random subsampling of natural images.",
                    "label": 0
                },
                {
                    "sent": "You can think of steps like this like corresponding to what deep belief networks are doing.",
                    "label": 0
                },
                {
                    "sent": "The kind of of architectures that young raccoon has been speaking about are very similar to this one.",
                    "label": 0
                },
                {
                    "sent": "They're fit for that runtime.",
                    "label": 0
                },
                {
                    "sent": "The only difference is the learning stage, where they use out encoding or restricted Boltzmann machine or these things I don't understand, but but it's essentially how how, the.",
                    "label": 0
                },
                {
                    "sent": "Features are learned in an unsupervised way, and so that's clearly a.",
                    "label": 0
                },
                {
                    "sent": "A near where one can do interesting things, empirical and theoretical.",
                    "label": 0
                },
                {
                    "sent": "But but as I said, there are a lot of open problems and hopefully this kind of mathematical framework will open the way to answer in terms of theorems.",
                    "label": 0
                },
                {
                    "sent": "Some of these questions.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now let me finish just now.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Mentioning a couple of things that are going back to the model that we are doing in extending it.",
                    "label": 0
                },
                {
                    "sent": "One is essentially an extension extension that include now the ventral dorsal stream, so motion so it's really extending the architecture to deal with video rather than isolated images, and so there is a system that to mass air and we run June have been developing that.",
                    "label": 0
                },
                {
                    "sent": "He's a model of the dorsal stream, but a version of it is used now for doing quantitative automatic phenotyping of mice behavior, in which you classify or the mouse in a cage is doing in terms of 10 or so basic actions like walking and freezing and hanging and eat.",
                    "label": 1
                },
                {
                    "sent": "And then you can build statistics and Markov chains and Markov models of this behavior, and in this way.",
                    "label": 0
                },
                {
                    "sent": "Associate a quantitative phenotype to specific.",
                    "label": 0
                },
                {
                    "sent": "Genotype biologists are dealing with hundreds and thousands of different mutants of mice.",
                    "label": 0
                },
                {
                    "sent": "Often these are models of diseases like mental diseases, schizophrenia, depression, and there are the genotype and quantitative characterization of the genome is now standard.",
                    "label": 0
                },
                {
                    "sent": "What is missing is a quantitative way to Pheno type the behavior and so far.",
                    "label": 0
                },
                {
                    "sent": "People have been doing this by hand, and of course this restricts how much of the behavior and the statistics they can do.",
                    "label": 0
                },
                {
                    "sent": "So these are interesting ways for the future in computer vision.",
                    "label": 0
                },
                {
                    "sent": "To do some useful applications, it's kind of again interesting that we start from a model of cortex and we do something that may be interesting for biology as an engineering application.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then, in terms of extensions of the model itself, we've been working on modeling attention and.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Starting from Physiology data, Bob the Simone and their Miller again work in monkeys and there are structures in cortex outside the ventral stream like frontal eye field, which is part of prefrontal quarters cortex.",
                    "label": 0
                },
                {
                    "sent": "An LIP which are likely to be involved in attention in and driving I movements.",
                    "label": 0
                },
                {
                    "sent": "And so.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have some model of of this interaction which is kind of in a sense now connecting the top to lower level.",
                    "label": 0
                },
                {
                    "sent": "And that is essentially capable of locating regions in the image which are likely to contain an object of interest.",
                    "label": 0
                },
                {
                    "sent": "And then restricting processing to that part, eliminating as much as possible of the clutter with decreases or the background, which decreases the performance of this feedforward model.",
                    "label": 0
                },
                {
                    "sent": "And by adding this attentional part to the other side described you improve performance in recognition.",
                    "label": 0
                },
                {
                    "sent": "And also you can.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And predict fairly well how people move their eyes when they have to look at an image.",
                    "label": 0
                },
                {
                    "sent": "Depending on the task.",
                    "label": 0
                },
                {
                    "sent": "For instance, people move their eyes in a different way.",
                    "label": 0
                },
                {
                    "sent": "If you tell them counted and cars in this image or for the same image you tell them count number of Podesta, count pedestrians and the model.",
                    "label": 0
                },
                {
                    "sent": "Depending on this task can predict value while the green area what people are going to do.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I finished just mentioning obvious limitation of this family of models.",
                    "label": 0
                },
                {
                    "sent": "I spoke about the feedforward one.",
                    "label": 0
                },
                {
                    "sent": "The main problem I see is that vision is much more than than classifying an image saying in an object, say a car or an animal is in the image or not because.",
                    "label": 0
                },
                {
                    "sent": "I can ask you any kind of question about images, specially in a set of infinite questions, and you can certainly answer.",
                    "label": 0
                },
                {
                    "sent": "You can tell me what are the objects here, even if you've never seen them before and you can make stories or interpretations of any image.",
                    "label": 0
                },
                {
                    "sent": "So this is where vision is really merging with general intelligence, and I don't see any straightforward way for the class of models I described to deal with situations of this kind.",
                    "label": 0
                },
                {
                    "sent": "So there are at least three options, and they're kind of vaguely defined for other types of models like.",
                    "label": 0
                },
                {
                    "sent": "Top down control.",
                    "label": 0
                },
                {
                    "sent": "Maybe in the sense of attention, but of different programs that you can imagine running in prefrontal cortex that are going to look at representations at a lower level in view.",
                    "label": 0
                },
                {
                    "sent": "One for instance, and Canaan Square question of whether, for instance, I'm to the left or to the right of the screen.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Or some probabilistic inference in the ventral stream?",
                    "label": 0
                },
                {
                    "sent": "I guess that's what David Mumford has suggested, and I'm not sure why there's two believes it or not, but.",
                    "label": 0
                },
                {
                    "sent": "And maybe things that are not your article in the same physical way as the ventral stream is, but.",
                    "label": 0
                },
                {
                    "sent": "Like here are called probabilistic inference.",
                    "label": 0
                },
                {
                    "sent": "And whether any of this is a good way to proceed or not, I don't know, but these are at least free broad possibilities to go beyond feedforward models.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I'll finish here, and this is the number of people in the group, specially Lorenzo and Jake Bouverie have been working with Steve Smale on what I described about the drives kernels and these are a number mostly of physiologists that with which with whom we have been collaborating over the past few years.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "Assumption that these lower levels of processing should be unsupervised learning is that based in is logical science.",
                    "label": 0
                },
                {
                    "sent": "Yes, I think.",
                    "label": 0
                },
                {
                    "sent": "There is a number of studies going back to at least let's Uber Visa and Colin Blakemore and so on that suggest that experience has an effect during critical phase of development in view.",
                    "label": 0
                },
                {
                    "sent": "One for instance.",
                    "label": 0
                },
                {
                    "sent": "And there is.",
                    "label": 0
                },
                {
                    "sent": "Direct indirect evidence that again experienced during development is important for the tuning properties of cells in the visual pathway.",
                    "label": 0
                },
                {
                    "sent": "There is also evidence that relatively fast learning can happen at higher levels.",
                    "label": 0
                },
                {
                    "sent": "Say IT probably faster than at lower levels.",
                    "label": 0
                },
                {
                    "sent": "But you know this is more of an educated guess, so the idea would be that it would take a longer time to set up bottom to talk.",
                    "label": 0
                },
                {
                    "sent": "But you know it's not proven right.",
                    "label": 0
                },
                {
                    "sent": "Physiologist are starting more or less now to record from the behaving monkeys and see learning effects in sales.",
                    "label": 0
                },
                {
                    "sent": "Jim Decarlo, for instance, have been doing this just a few months ago and so there is some evidence of plasticity in IT cells that we can measure during a recording session.",
                    "label": 0
                },
                {
                    "sent": "There are many limitations in terms of experimental techniques that so far I've been making this question a difficult one.",
                    "label": 0
                },
                {
                    "sent": "Steven basic.",
                    "label": 0
                },
                {
                    "sent": "Layer two, there are these templates, yeah?",
                    "label": 0
                },
                {
                    "sent": "Is that also based on Physiology called?",
                    "label": 0
                },
                {
                    "sent": "That's for example, one could imagine the kind of KB algorithm out of 454 and learning from the data on the way I know well, so the evidence is that various levels in the visual pathway.",
                    "label": 0
                },
                {
                    "sent": "We have cells that are tuned.",
                    "label": 0
                },
                {
                    "sent": "To specific stimuli and their tuned.",
                    "label": 0
                },
                {
                    "sent": "If I record now and they are tuned to the same type of Steam affair according in one hour or or two.",
                    "label": 0
                },
                {
                    "sent": "And people assume even in a few days, and so for instance, if I find myself in before that respond to some kind of contour or some pattern respond optimally, will continue to respond to it later on.",
                    "label": 0
                },
                {
                    "sent": "This this, you know, the assumption is this is a fixed tuning.",
                    "label": 0
                },
                {
                    "sent": "Now one has to be very careful, so maybe there is more plasticity than one.",
                    "label": 0
                },
                {
                    "sent": "This is also related to your question, but so far physiologists have been assuming that this tuning is.",
                    "label": 0
                },
                {
                    "sent": "You know this fixed.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "How do you identify that?",
                    "label": 0
                },
                {
                    "sent": "Well, you know this is a touchy area.",
                    "label": 0
                },
                {
                    "sent": "I mean you have some.",
                    "label": 0
                },
                {
                    "sent": "You measure some behavior that are.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "This is complicated so people can engineer can engineer different type of mutants.",
                    "label": 0
                },
                {
                    "sent": "So you can look at so you know that some.",
                    "label": 0
                },
                {
                    "sent": "There are some genes suspected to be involved in for instance.",
                    "label": 0
                },
                {
                    "sent": "Depression and so, and they typically maybe synaptic genes.",
                    "label": 0
                },
                {
                    "sent": "So then you can create mutants where your knockout the gene or you have a mutation that you know is in may be involved and then you look at the behavior of the mouse and see some some trades that you say OK they are similar to what I see in humans and that's what is very you know.",
                    "label": 0
                },
                {
                    "sent": "That's a guess work and then this becomes a potential model for that disease in the mouth, and hopefully some cases people have been able to make a strong case of this is not proof right?",
                    "label": 0
                },
                {
                    "sent": "But then you can.",
                    "label": 0
                },
                {
                    "sent": "You can look at, for instance, whether this has been done, whether drugs used for depression in humans do affect this behaviour in mouse that you think is similar to depression, and so you can get various kind of evidence supporting.",
                    "label": 0
                },
                {
                    "sent": "This model and you know some people are quite critical of this approach, but it is a reasonable 1.",
                    "label": 0
                },
                {
                    "sent": "One has to be careful because especially mental disease is very likely that the genes involved are many in the order of 50 or 100, so you cannot so far engineer all these mutations you are going to look at only a subset.",
                    "label": 0
                },
                {
                    "sent": "What may be involved in the Pheno type.",
                    "label": 0
                },
                {
                    "sent": "Monferno type.",
                    "label": 0
                },
                {
                    "sent": "Works like a single multiclass classifier, or works like some sort of combination socket classifier.",
                    "label": 0
                },
                {
                    "sent": "If you tell me.",
                    "label": 0
                },
                {
                    "sent": "Be happy I don't know what you mean in terms of award Physiology.",
                    "label": 0
                },
                {
                    "sent": "Behavior.",
                    "label": 0
                },
                {
                    "sent": "Then it's working there as well, like Singuefield multi class classifier, yeah?",
                    "label": 0
                },
                {
                    "sent": "China hierarchal systems different way where you combine different classifiers that if we wanted there is specializes something and then the second thing Oh yeah.",
                    "label": 0
                },
                {
                    "sent": "Now we know we have done that.",
                    "label": 0
                },
                {
                    "sent": "For instance, we have tested this class of models on the Caltech.",
                    "label": 0
                },
                {
                    "sent": "101 Database these are 101 different categories of objects, so we have done classification, multiclass classification.",
                    "label": 0
                },
                {
                    "sent": "Right, you use the same basic preprocessing stage and you have a set of different classifier for instance.",
                    "label": 0
                },
                {
                    "sent": "You know to do multiclass classification at the last stage.",
                    "label": 0
                },
                {
                    "sent": "Now that that works pretty well and all the first you know and layers are the same, you don't need to change them.",
                    "label": 0
                },
                {
                    "sent": "If he does, I like it what?",
                    "label": 0
                },
                {
                    "sent": "Socket classifiers, like ones that discriminate if this is.",
                    "label": 0
                },
                {
                    "sent": "Living thing.",
                    "label": 0
                },
                {
                    "sent": "An animal or bird and any suppliers and second little oh I see.",
                    "label": 0
                },
                {
                    "sent": "So you are saying going from, say for instance living non living vertebrate and then Tigers or so OK?",
                    "label": 0
                },
                {
                    "sent": "Multiclass classifier.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah, this is.",
                    "label": 0
                },
                {
                    "sent": "Let's see.",
                    "label": 0
                },
                {
                    "sent": "Yeah, there is some.",
                    "label": 0
                },
                {
                    "sent": "It's unclear in terms of the physiological evidence.",
                    "label": 0
                },
                {
                    "sent": "Let's see if there is some.",
                    "label": 0
                },
                {
                    "sent": "Some claim that you have.",
                    "label": 0
                },
                {
                    "sent": "Let's see that you have a cluster of activity 90 corresponding to different categories like living things and nonliving and tools.",
                    "label": 0
                },
                {
                    "sent": "And whether that's true or not is still completely open, and this may be a substrate for what you're saying.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you.",
                    "label": 0
                }
            ]
        }
    }
}