{
    "id": "2rzu5dyfjuk2xzmd2lqcxqa2xbi7bds3",
    "title": "Making a \"black box\" transparent: role of the open data in the building sector",
    "info": {
        "author": [
            "Ksenia Petrichenko, Global Buildings Performance Network (GBPN)"
        ],
        "published": "March 31, 2014",
        "recorded": "March 2014",
        "category": [
            "Top->Computer Science->Big Data",
            "Top->Computer Science->Data Visualisation",
            "Top->Social Sciences->Law->Regulations",
            "Top->Social Sciences->Society->Public Policy",
            "Top->Business->Management->Knowledge Management"
        ]
    },
    "url": "http://videolectures.net/dataforum2014_petrichenko_black_box/",
    "segmentation": [
        [
            "As it has been said and you can reach from the title, I'm going to focus on the role of open data in the building sector and by the end of presentation.",
            "Hopefully you will know what I mean by the black box and how to make it transparent."
        ],
        [
            "I'm representing here global building Performance Network, which is globally established and regionally focused.",
            "Best practice network with a mission to support and advanced policies in the building sector to reduce energy consumption and related greenhouse gas emissions.",
            "We work through the global center in Paris and we also have 4 regional hubs in China, India, yes and Europe, which all of them are conducting.",
            "Research in the related to energy performance in buildings and also provide policy advice and.",
            "Making focus on connecting different organizations.",
            "An institution in this field."
        ],
        [
            "So our mission as I said, to achieve significant and measurable energy consumption and greenhouse gas emissions reduction from buildings, and we're doing it through providing recommendations to the governments and policymakers as well as conducting quality research in this field.",
            "We also put a lot of emphasis on making the results of our research and data transparent and publicly available so that they can be used by other institutions in order to build.",
            "More knowledge in the field.",
            "We established different platforms for expertise and data exchange and collaboration, and I'll speak about it."
        ],
        [
            "Later, if you words about importance of our mission as you know, climate change is at the moment on the top of political agendas all over the world and building sector accounts for approximately 1/3 of global greenhouse gas emissions and energy use.",
            "At the same time, the sector presents a lot of cost effective opportunities for reducing energy consumption, and our research shows that by 2050, approximately 1/3 of global final.",
            "Thermal energy use can be reduced through applying solution solutions which are already available at the moment."
        ],
        [
            "And Japan has developed a number of products which on one hand show the potential in building sector, which can be realized and on the other hand proposing certain solutions on how this potential can be achieved.",
            "And robust data and information is very important for each and every of this product."
        ],
        [
            "So this is a very simplified product creation flow which we use in our organization starts with product design, but as you can see data collection data analysis is in."
        ],
        [
            "The core of this process, so we try to pay a lot of attention to the data in order to ensure the high quality of the final."
        ],
        [
            "Product the organization was established in 2011 and our first project was very ambitious one together with Central European University.",
            "We decided to develop a model with several scenarios for building energy use by 2050, which was aimed to demonstrate the potential in the building sector to reduce energy use and related greenhouse gas emissions.",
            "It had a global coverage with four target regions.",
            "We looked at different climate zones and conditions.",
            "We looked at three energy uses in building space, heating, cooling and water heating 9 building types and five building vintages.",
            "That gave us a lot of work in terms of data collection, we collected data for a number of parameters on building characteristics as well as energy using the exemplary buildings in different regions, we estimated that we had to fill in several thousands of data.",
            "Points."
        ],
        [
            "Unfortunately, the bar during the project we came to the conclusion that there really is a very strong lack of reliable data for buildings, and we did our best to fill these gaps through consulting different experts, crosschecking data and ensuring the like high quality of the data we used."
        ],
        [
            "At the same time, there was another project developed together with Lawrence Berkeley, a national lab that was focusing on the policies which would allow to achieve the potential which represented in the first study.",
            "It was also a very comprehensive data collection process because a lot of case studies on best practices policies were collected for four target regions.",
            "The study was looking at the effectiveness and cost effectiveness of different policies.",
            "Including building codes, energy labels, financial instruments in order to provide recommendations for policymakers to develop a very efficient policy package for to reduce energy use in buildings."
        ],
        [
            "However, this study also showed that there is a lack of data on policies, inputs and costs having these two."
        ],
        [
            "Experiences in hand.",
            "We decided to make our own research which would allow us to evaluate data quality and availability in the building sector.",
            "So we conducted a survey with a number of international organizations, research institutes and experts and we ask them about their experiences with data in the building sector.",
            "According to a number of parameters which we selected."
        ],
        [
            "This is the result for four target countries and you probably can't see all the access of the charts, but these are the parameters which we selected to evaluate for data availability and quality.",
            "It includes floor Arian for buildings in this count in each country, number of buildings, energy used by different end users, or ownership, and so on and so forth.",
            "We did it separately for residential and commercial buildings and we asked the experts to.",
            "Evaluate each of these parameter on the scale from zero to five, where five would be a very reliable and trustworthy data with good sources and zero would be either the absence of the data or poor quality of the data.",
            "So the full of the red are the better.",
            "The data in this country, and as you can see, probably yes presents the best quality of the data according to our results because they have a quite systematic efforts in data collection and presentation.",
            "Both for residential and commercial buildings, but other countries, even Europe have quite substantial data gaps in China and India.",
            "It's even more dramatic and it also related to privacy and confidential, confident confidence.",
            "E issues for revealing the data and also for the language because many number of data in China is available only in Chinese, an not translated to English."
        ],
        [
            "So that was our main conclusion that there is not enough data on the key parameters and buildings."
        ],
        [
            "Having this results, we came to the conclusion that data collection is.",
            "On one hand a very important step in every product project.",
            "On the other hand, it shows it appears to be a certain black box because when you start the project you never know if you're going to get enough reliable data and on the other hand even the data which you're getting.",
            "You're not always sure about the quality and where it's coming from, because many publications and reports do not reveal the whole process of data collection and.",
            "Prove."
        ],
        [
            "Adding the results."
        ],
        [
            "So GPN decided to go the other way and make this black box transparent."
        ],
        [
            "How did we do that?",
            "We decided to move towards community for better data on buildings and establish certain platforms and tools which allow us to do that.",
            "We decided that connecting to best sources and data on building energy use and policies worldwide would be a good idea and we also try to make our research and data as transparent as possible.",
            "Also, we accelerated the knowledge and information sharing for better for better policy making."
        ],
        [
            "First of all, we developed an interactive analytic website which you can all welcome to access and we have a data on.",
            "Have a section on databases and tools.",
            "This date this section includes two interactive tools at the moment and two more will come.",
            "About two of them, the 1st two of them, the policy tool for new buildings and Glossary.",
            "I will speak about in details because they are already there and you can access them.",
            "Renovation policy tool will come very soon and it will include interactive information and certain visualization output for best practices related to renovation of buildings and best policy packages, it involved a lot of data collection for different countries as well as.",
            "Evaluation of policy packages provided by experts and the last two which you can see here, which will come late spring, I think, is the tool for building energy use scenarios.",
            "That's the tool which will visualize the data from the first report I mentioned today.",
            "It will be an interactive tool where user can come an access data and make certain visual outputs and numerical outputs according to his or hers needs."
        ],
        [
            "So these two tools will come soon and we also have links to other data tools on from our partner hubs in Europe, Data Hub, Europe and."
        ],
        [
            "The tool on rating policies from US so the policy tool for newbuildings.",
            "That's the landing page of the tool which you will see if you come to our website.",
            "It's was aimed to visualize an interactive manner.",
            "The results of the research aimed at evaluating different building codes from several countries according to a number of criteria."
        ],
        [
            "We go out.",
            "We developed 15 criteria which are grouped in five topics and we asked 64 international experts to evaluate each policy instrument according to this criteria."
        ],
        [
            "The tool also offers on other opportunities such as the user can access you values presented in the building codes which we studied.",
            "It gives country profile for the countries which we analyzed and also performance values which were mentioned in the building codes."
        ],
        [
            "The next two is the Glossary, which involves a number of concepts and terms terms from related to building energy performance.",
            "The aim of this tool was to provide a common understanding of words which are critical for this field.",
            "We developed this in collaboration with Building Performance Institute Europe and all these terms are connected into interactive manner to each other and it's also linked open data which is also connected to the two hours of renewable energy and energy efficiency partnership.",
            "It's available in Chinese and we're planning to extend it further so we are open to linking to other similar Glossary Thesaurus."
        ],
        [
            "As I mentioned, we also.",
            "And present links to other data sources.",
            "For example, BP data hub.",
            "This is the data hub which was developed by our hub in Europe and as I said, we share the common Glossary and they also present country profiles with a lot of data for each country in Europe and also quite a detailed database or related to energy use in buildings and building characteristics based on the survey conducted for.",
            "Each European country using local expertise."
        ],
        [
            "The next information portal is the building rating.org developed by our Hub and USIMT.",
            "This is the information portal which puts together the data and information on the different building instruments related to rating and disclosure.",
            "They have interactive policy map where the user can zoom into certain regional part of the region where this kind of instruments exist and.",
            "Access the information about these instruments."
        ],
        [
            "And we also will integrate our Glossary with this."
        ],
        [
            "Information tool, so in the end of my presentation I would like to just assume."
        ],
        [
            "Rise how do you repair my makes this black data box more transparent and open?",
            "We use interactive website.",
            "As I mentioned.",
            "We develop open analytical tools which everybody can access, use and access the data we use linked open data in a number of our products, provide transparent reports which are all available on our website and also we encourage data sharing and cooperation also through web and R series as well as.",
            "Through different expert platforms and communication with partner organization and external organization.",
            "So we are very open to any other collaboration or which may arise after this event or any other events."
        ],
        [
            "So feel free to contact us and thank you very much for attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As it has been said and you can reach from the title, I'm going to focus on the role of open data in the building sector and by the end of presentation.",
                    "label": 0
                },
                {
                    "sent": "Hopefully you will know what I mean by the black box and how to make it transparent.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm representing here global building Performance Network, which is globally established and regionally focused.",
                    "label": 0
                },
                {
                    "sent": "Best practice network with a mission to support and advanced policies in the building sector to reduce energy consumption and related greenhouse gas emissions.",
                    "label": 1
                },
                {
                    "sent": "We work through the global center in Paris and we also have 4 regional hubs in China, India, yes and Europe, which all of them are conducting.",
                    "label": 0
                },
                {
                    "sent": "Research in the related to energy performance in buildings and also provide policy advice and.",
                    "label": 0
                },
                {
                    "sent": "Making focus on connecting different organizations.",
                    "label": 0
                },
                {
                    "sent": "An institution in this field.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So our mission as I said, to achieve significant and measurable energy consumption and greenhouse gas emissions reduction from buildings, and we're doing it through providing recommendations to the governments and policymakers as well as conducting quality research in this field.",
                    "label": 1
                },
                {
                    "sent": "We also put a lot of emphasis on making the results of our research and data transparent and publicly available so that they can be used by other institutions in order to build.",
                    "label": 1
                },
                {
                    "sent": "More knowledge in the field.",
                    "label": 0
                },
                {
                    "sent": "We established different platforms for expertise and data exchange and collaboration, and I'll speak about it.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Later, if you words about importance of our mission as you know, climate change is at the moment on the top of political agendas all over the world and building sector accounts for approximately 1/3 of global greenhouse gas emissions and energy use.",
                    "label": 1
                },
                {
                    "sent": "At the same time, the sector presents a lot of cost effective opportunities for reducing energy consumption, and our research shows that by 2050, approximately 1/3 of global final.",
                    "label": 0
                },
                {
                    "sent": "Thermal energy use can be reduced through applying solution solutions which are already available at the moment.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And Japan has developed a number of products which on one hand show the potential in building sector, which can be realized and on the other hand proposing certain solutions on how this potential can be achieved.",
                    "label": 0
                },
                {
                    "sent": "And robust data and information is very important for each and every of this product.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is a very simplified product creation flow which we use in our organization starts with product design, but as you can see data collection data analysis is in.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The core of this process, so we try to pay a lot of attention to the data in order to ensure the high quality of the final.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Product the organization was established in 2011 and our first project was very ambitious one together with Central European University.",
                    "label": 0
                },
                {
                    "sent": "We decided to develop a model with several scenarios for building energy use by 2050, which was aimed to demonstrate the potential in the building sector to reduce energy use and related greenhouse gas emissions.",
                    "label": 1
                },
                {
                    "sent": "It had a global coverage with four target regions.",
                    "label": 1
                },
                {
                    "sent": "We looked at different climate zones and conditions.",
                    "label": 0
                },
                {
                    "sent": "We looked at three energy uses in building space, heating, cooling and water heating 9 building types and five building vintages.",
                    "label": 1
                },
                {
                    "sent": "That gave us a lot of work in terms of data collection, we collected data for a number of parameters on building characteristics as well as energy using the exemplary buildings in different regions, we estimated that we had to fill in several thousands of data.",
                    "label": 0
                },
                {
                    "sent": "Points.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Unfortunately, the bar during the project we came to the conclusion that there really is a very strong lack of reliable data for buildings, and we did our best to fill these gaps through consulting different experts, crosschecking data and ensuring the like high quality of the data we used.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "At the same time, there was another project developed together with Lawrence Berkeley, a national lab that was focusing on the policies which would allow to achieve the potential which represented in the first study.",
                    "label": 0
                },
                {
                    "sent": "It was also a very comprehensive data collection process because a lot of case studies on best practices policies were collected for four target regions.",
                    "label": 1
                },
                {
                    "sent": "The study was looking at the effectiveness and cost effectiveness of different policies.",
                    "label": 0
                },
                {
                    "sent": "Including building codes, energy labels, financial instruments in order to provide recommendations for policymakers to develop a very efficient policy package for to reduce energy use in buildings.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "However, this study also showed that there is a lack of data on policies, inputs and costs having these two.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Experiences in hand.",
                    "label": 0
                },
                {
                    "sent": "We decided to make our own research which would allow us to evaluate data quality and availability in the building sector.",
                    "label": 1
                },
                {
                    "sent": "So we conducted a survey with a number of international organizations, research institutes and experts and we ask them about their experiences with data in the building sector.",
                    "label": 0
                },
                {
                    "sent": "According to a number of parameters which we selected.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is the result for four target countries and you probably can't see all the access of the charts, but these are the parameters which we selected to evaluate for data availability and quality.",
                    "label": 0
                },
                {
                    "sent": "It includes floor Arian for buildings in this count in each country, number of buildings, energy used by different end users, or ownership, and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "We did it separately for residential and commercial buildings and we asked the experts to.",
                    "label": 0
                },
                {
                    "sent": "Evaluate each of these parameter on the scale from zero to five, where five would be a very reliable and trustworthy data with good sources and zero would be either the absence of the data or poor quality of the data.",
                    "label": 0
                },
                {
                    "sent": "So the full of the red are the better.",
                    "label": 0
                },
                {
                    "sent": "The data in this country, and as you can see, probably yes presents the best quality of the data according to our results because they have a quite systematic efforts in data collection and presentation.",
                    "label": 0
                },
                {
                    "sent": "Both for residential and commercial buildings, but other countries, even Europe have quite substantial data gaps in China and India.",
                    "label": 0
                },
                {
                    "sent": "It's even more dramatic and it also related to privacy and confidential, confident confidence.",
                    "label": 0
                },
                {
                    "sent": "E issues for revealing the data and also for the language because many number of data in China is available only in Chinese, an not translated to English.",
                    "label": 1
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that was our main conclusion that there is not enough data on the key parameters and buildings.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Having this results, we came to the conclusion that data collection is.",
                    "label": 1
                },
                {
                    "sent": "On one hand a very important step in every product project.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, it shows it appears to be a certain black box because when you start the project you never know if you're going to get enough reliable data and on the other hand even the data which you're getting.",
                    "label": 0
                },
                {
                    "sent": "You're not always sure about the quality and where it's coming from, because many publications and reports do not reveal the whole process of data collection and.",
                    "label": 0
                },
                {
                    "sent": "Prove.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Adding the results.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So GPN decided to go the other way and make this black box transparent.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How did we do that?",
                    "label": 0
                },
                {
                    "sent": "We decided to move towards community for better data on buildings and establish certain platforms and tools which allow us to do that.",
                    "label": 0
                },
                {
                    "sent": "We decided that connecting to best sources and data on building energy use and policies worldwide would be a good idea and we also try to make our research and data as transparent as possible.",
                    "label": 0
                },
                {
                    "sent": "Also, we accelerated the knowledge and information sharing for better for better policy making.",
                    "label": 1
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "First of all, we developed an interactive analytic website which you can all welcome to access and we have a data on.",
                    "label": 0
                },
                {
                    "sent": "Have a section on databases and tools.",
                    "label": 0
                },
                {
                    "sent": "This date this section includes two interactive tools at the moment and two more will come.",
                    "label": 0
                },
                {
                    "sent": "About two of them, the 1st two of them, the policy tool for new buildings and Glossary.",
                    "label": 0
                },
                {
                    "sent": "I will speak about in details because they are already there and you can access them.",
                    "label": 0
                },
                {
                    "sent": "Renovation policy tool will come very soon and it will include interactive information and certain visualization output for best practices related to renovation of buildings and best policy packages, it involved a lot of data collection for different countries as well as.",
                    "label": 0
                },
                {
                    "sent": "Evaluation of policy packages provided by experts and the last two which you can see here, which will come late spring, I think, is the tool for building energy use scenarios.",
                    "label": 0
                },
                {
                    "sent": "That's the tool which will visualize the data from the first report I mentioned today.",
                    "label": 0
                },
                {
                    "sent": "It will be an interactive tool where user can come an access data and make certain visual outputs and numerical outputs according to his or hers needs.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So these two tools will come soon and we also have links to other data tools on from our partner hubs in Europe, Data Hub, Europe and.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The tool on rating policies from US so the policy tool for newbuildings.",
                    "label": 1
                },
                {
                    "sent": "That's the landing page of the tool which you will see if you come to our website.",
                    "label": 0
                },
                {
                    "sent": "It's was aimed to visualize an interactive manner.",
                    "label": 0
                },
                {
                    "sent": "The results of the research aimed at evaluating different building codes from several countries according to a number of criteria.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We go out.",
                    "label": 0
                },
                {
                    "sent": "We developed 15 criteria which are grouped in five topics and we asked 64 international experts to evaluate each policy instrument according to this criteria.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The tool also offers on other opportunities such as the user can access you values presented in the building codes which we studied.",
                    "label": 0
                },
                {
                    "sent": "It gives country profile for the countries which we analyzed and also performance values which were mentioned in the building codes.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The next two is the Glossary, which involves a number of concepts and terms terms from related to building energy performance.",
                    "label": 0
                },
                {
                    "sent": "The aim of this tool was to provide a common understanding of words which are critical for this field.",
                    "label": 1
                },
                {
                    "sent": "We developed this in collaboration with Building Performance Institute Europe and all these terms are connected into interactive manner to each other and it's also linked open data which is also connected to the two hours of renewable energy and energy efficiency partnership.",
                    "label": 0
                },
                {
                    "sent": "It's available in Chinese and we're planning to extend it further so we are open to linking to other similar Glossary Thesaurus.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As I mentioned, we also.",
                    "label": 0
                },
                {
                    "sent": "And present links to other data sources.",
                    "label": 0
                },
                {
                    "sent": "For example, BP data hub.",
                    "label": 0
                },
                {
                    "sent": "This is the data hub which was developed by our hub in Europe and as I said, we share the common Glossary and they also present country profiles with a lot of data for each country in Europe and also quite a detailed database or related to energy use in buildings and building characteristics based on the survey conducted for.",
                    "label": 0
                },
                {
                    "sent": "Each European country using local expertise.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The next information portal is the building rating.org developed by our Hub and USIMT.",
                    "label": 0
                },
                {
                    "sent": "This is the information portal which puts together the data and information on the different building instruments related to rating and disclosure.",
                    "label": 0
                },
                {
                    "sent": "They have interactive policy map where the user can zoom into certain regional part of the region where this kind of instruments exist and.",
                    "label": 0
                },
                {
                    "sent": "Access the information about these instruments.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we also will integrate our Glossary with this.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Information tool, so in the end of my presentation I would like to just assume.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Rise how do you repair my makes this black data box more transparent and open?",
                    "label": 0
                },
                {
                    "sent": "We use interactive website.",
                    "label": 0
                },
                {
                    "sent": "As I mentioned.",
                    "label": 0
                },
                {
                    "sent": "We develop open analytical tools which everybody can access, use and access the data we use linked open data in a number of our products, provide transparent reports which are all available on our website and also we encourage data sharing and cooperation also through web and R series as well as.",
                    "label": 0
                },
                {
                    "sent": "Through different expert platforms and communication with partner organization and external organization.",
                    "label": 0
                },
                {
                    "sent": "So we are very open to any other collaboration or which may arise after this event or any other events.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So feel free to contact us and thank you very much for attention.",
                    "label": 0
                }
            ]
        }
    }
}