{
    "id": "2sgn5tonumnouoljsecxcrxuhhllj2q4",
    "title": "Debate on \"OpenupEd, the first pan-European MOOCs initiative: specific features and perspectives\"",
    "info": {
        "author": [
            "Darco Jansen, EADTU",
            "Fred Mulder, UNESCO Chair on Open Educational Resources (OER)"
        ],
        "published": "Dec. 10, 2013",
        "recorded": "November 2013",
        "category": [
            "Top->Computer Science->Internet, World Wide Web",
            "Top->Social Sciences->Education",
            "Top->Technology"
        ]
    },
    "url": "http://videolectures.net/internetofeducation2013_mulder_jansen_debate/",
    "segmentation": [
        [
            "We just started and thank Felix for his very inspirational and stimulating talk because I think what he did was show that books can be used in a very nice way and can be very attractive and can be very useful for your own University.",
            "So I would like to thank you.",
            "I would have had some questions but there was no time.",
            "Anyway, thanks very much for your presentation and I would like to take you back to the conference that we had last year in on Cyprus.",
            "It was a conference which was organized by the European Association of Distance Universities.",
            "And I I was giving a presentation there and I was just throwing the idea whi.",
            "Do we allow the Stanford Center Berkeley's in the MIT center Harvard to run away?",
            "Was open online education whereas the universities have done this for decades already.",
            "So we should do something about that.",
            "And.",
            "Much to my surprise, after the conference, we all agreed that we should do it and we should take it up quite quickly and within about six months we succeeded in launching a new initiative, which is called Open event.",
            "I was referring to that already yesterday and today we will take some more time to share with you would open about stands for what it does and how it's increasing in number, of course is OK.",
            "Here we go again, so we."
        ],
        [
            "Decided to start a new initiative which is called Open event and.",
            "Because we observe the US dominance, we thought we should do something about that, and that's what we did.",
            "So there was time for European initiative.",
            "That's what we thought, and we were using the umbrella that European Commission was offering and launching this program, which is called opening up education.",
            "So we used the word open up add an.",
            "Actually, this is the first, and so far only European initiative.",
            "Felix was asking for European initiatives and German ones.",
            "There's a German one.",
            "This is the only European ones so far.",
            "We launched it on April 25.",
            "And as I said yesterday, it was a very interesting launch because European Commission was extremely enthusiastic about this first European initiative and are waiting for other ones.",
            "I'm sure about that.",
            "So this is the first one, and it's really based on the European values on equity quality and diversity."
        ],
        [
            "The partnership is, as I said yesterday, the Ministry of Higher Education from France, winner from Italy then the Technical University of Co. Nelson, Lithuania.",
            "The opening for the Netherlands, the openness of Portugal in Slovakia, detecting University of Association and the Association in Spain.",
            "It is unit and national opinion Aver City and in the UK.",
            "It's the Open University which is on board.",
            "So they decided to have two tracks.",
            "The Ventrac is future learn that they're leading in the other track is the European initiative and then outside of the EU we have some members from easy to you, which is messy direction up University which is Turkey Anadolu University which is a very big operation.",
            "They run 1.7 million students so that's really massive.",
            "I would say any universe of Israel and there's plenty to join other Members from you to you.",
            "The advice of Cyprus.",
            "It's always, I think, from Denmark and from Estonia, an Association I think, and then Fiat from France.",
            "The openness of Greece, Oscar from Ireland in Poland.",
            "There's two universities that want to join in Slovenia.",
            "We are in touch already with you gonna and in Spain the Open University of Catalonia, the walk so then more or less we cover the whole membership of idiots.",
            "You except for the German family which we.",
            "Very much regret, but I'm sure they will join at a certain state's order request to become a partner of open about as well."
        ],
        [
            "Now we decided to be pretty precise on framework that we want to use a framework which is stressing a number of features and the features are here.",
            "The 8 features that we have in common, more or less are the first one is openness to learners, which is really related to let's say, the classical openness of the Open University.",
            "So it's freedom of time, freedom of pace, freedom of place, open entry, of course, freedom of programming and all those types of openness which are really directed towards the learners are in place.",
            "The second one is the digital openness and digital.",
            "Open certainly means that there will be open licensing for all of the courses.",
            "That's a condition more or less so as explained yesterday, there's towards closing in open online courses and we really want to be as open as possible, which means a Creative Commons license which is CC by or CC by SA.",
            "So it's a very liberal approach.",
            "I must admit that not all of the courses on the on the portal already have this open licensing, but we're working on that.",
            "And then there's a learner centered approach, which of course is in the tradition of our universities be aren't developing and designing course materials.",
            "Also, in this tradition for independent or autonomous learning, the interaction is supported by media that can be at a different level.",
            "Of course, there's different various recognition options.",
            "The first ones to completion certificate, the second one is the batch, and the third one is full recognition by credits and archival.",
            "Just tell more about that how it's working.",
            "There's a strong focus on quality, so we want to make sure that the courses that we are delivering our meeting our normal quality conditions and we cherish diversity.",
            "Felix was referring to is a very English dominated and ever which is true, and I'm quite happy that the Germans are coming up in the Spanish are coming up and this initiative open event is really about diversity in language and not only language.",
            "Also the cultural context.",
            "That's why we choose.",
            "To have a partnership in so many countries."
        ],
        [
            "Different form future learn from Coursera from edx from diversity.",
            "This is a decentralized model, so we think the institution should be in the lead and it's not us coordinating open about, but it's the institutions that are in the lead and are responsible for their own operation.",
            "That means that we don't have a platform, a central platform.",
            "We don't need it becausw the Department of open about have their own platforms already in place.",
            "At least most of them.",
            "And if there's a partner that hasn't a platform, we can provide it from the different partners that are in place already.",
            "Or you could also use the edx platform because that's an open source platform, so there's many possibilities.",
            "It's not about a platform, that's our view, it's about how you provide you or your courses.",
            "So open event is not a platform, it's a portal, and the portal tells you what kind of courses are in place, what kind of conditions are met by those courses, who are.",
            "Providing the courses and so on, it's a refer atory rather than a repository of courses.",
            "Not driven by revenue, it's a public affair.",
            "More or less will be driven by service that we want to bring to the learns into society.",
            "And as I said before, it's a public domain rather than a private sector endeavor.",
            "Soda"
        ],
        [
            "Centralized, which is essential, but also there is a central component which has to do with quality and branding.",
            "So we want to make sure that open about has a strong branding along those eight common features and there is a procedure to become a partner.",
            "You cannot become a partner by just paying some money.",
            "You can become a partner by meeting the conditions that we have.",
            "An darker will explain what the conditions are and we have a label which is in place.",
            "There is a.",
            "Draft version of the quality level, which is called Open Net label.",
            "That is a condition for the moves that are being delivered by the partners as well, and you can review the.",
            "And look into the review version of the label on the website since there and there will be continuous monitoring of course and research and evaluation will be involved as well.",
            "So this I think is more or less my."
        ],
        [
            "Part of the story and then darker will take over.",
            "I'm the coordinator of open about this initiative and I'm working at the European Association of this.",
            "Is teaching universities, so most of the members of Open Pitan now from the Edu threads Shelton slide already that we already have 20 requests from non Elysium members.",
            "So on campus traditional universities to become member and it is not only limited to Europe, fat is already having a lot of discussion in partnership with Asia and Africa.",
            "So Government global initiative."
        ],
        [
            "But just look at the figures of the number of books.",
            "I did it yesterday about the number of books provided by different providers of moves.",
            "Corsair is by far the largest, is more than 500 courses already provided, and the top three are the starters of the books in the United States.",
            "In the middle you see older countries that has listed and provided their moves.",
            "So is Australia is open to study its myriad X from Spain and also with some Portuguese languages.",
            "Future learn from Britain, France University.",
            "In numeric you started a couple weeks ago.",
            "It already has 24 courses and in German language diversity and is already have 25 courses.",
            "We had opened a bit making love the boost we did start this 40 courses at 80 course at the end of September and now we have 174 courses.",
            "More than 100 of those courses have the opportunity for credit.",
            "This, recognized in a curriculum.",
            "So this about Izzie TS regular credits so that students following a course can choose for a batch.",
            "A certificate of Participation, a certificate of completion, or but then they have to pay a small amount of money and for more credit.",
            "They have to pay Bill 'cause there's authentication, authorization problem etc.",
            "So we have to go to the center and some of the parts even have the.",
            "Total system to authenticate and out of data set the person online.",
            "There's even online assessment etc so.",
            "There's also one main difference this to other providers.",
            "We do have a lot of opportunities for ECS."
        ],
        [
            "That's a map from you.",
            "See the URL.",
            "It's a MC map.",
            "You can show auto development is from April 2012 to October 2013, student at the right side hand side.",
            "And you can choose for the providers on the on the top of that right hand.",
            "You see that it's not the same list of providers.",
            "For example, mega decks from Spain is not on that list.",
            "On the previous slides for me, countless net was not on the list, so you can always have a discussion who are among providers, who are providers of open courseware, who are the providers of online courses, when it's an online course MOOC, etc.",
            "Previous talk already made some slides about is Watson, MC, etc.",
            "But you can always discuss what's a book provider, not.",
            "This one."
        ],
        [
            "List this is from Oped, Ocation Europe.",
            "This to figure in September then you will provides already 277 books.",
            "Anne."
        ],
        [
            "This is the list from October.",
            "And open a bit as now 174 courses.",
            "It's not all counted here.",
            "Becausw, yes, at the beginning of November we launched almost 19 additional courses.",
            "Most of them are from Italy and now the figure will be that Italy is the main provider of books in Europe.",
            "Not Spain, not Germany, not the UK, but Italy.",
            "It's foreman Telemedical University that has a lot of video and broadcasting, so they already had a lot of video databases and they decided to open up much of their existing courses for students."
        ],
        [
            "So.",
            "The increase of European part of Moocs is very large.",
            "This more than 50% by now.",
            "It's now at the end 50%.",
            "But we already have 990 looks more available on open a bed.",
            "So the increase of European part is large.",
            "But you have to distinct."
        ],
        [
            "This is the difference between a platform and a provider.",
            "Coceira is a platform where a University can provide their course.",
            "So the University provides the course.",
            "Kucera is the platform.",
            "So you can distinguish private companies like Corsair, Udacity, mirrored X Iversity.",
            "You also have collaborations.",
            "It can be an institutional collaboration, but for example, in France there's a national collaboration and they also have their own platform.",
            "France University numeric has.",
            "This.",
            "Platform is based on at X, not completely ethics that based on the open source platform of ethics and has his own platform.",
            "But this in collaboration.",
            "This open up part is the institutions have their own platform.",
            "But they can also choose platform from other parts of our prepared with for example Athabasca in Canada is also his own platform for the scene books etc most likely and hopefully Autobus cannot join open events in near future.",
            "So there's a difference between the providers and the platform providers.",
            "The content provider, course providers, and the platform providers."
        ],
        [
            "So for open a bit, for now we have 174 courses.",
            "There's a wide variety of subjects and level.",
            "12 languages most languages are non English.",
            "So domination by English language no, not in this case.",
            "It's scheduled and self based.",
            "So that's also an addition is that you can start whenever you want, and perhaps build your own network.",
            "I think that's not nice.",
            "You can continue to build networks and self paced.",
            "Mean you can start whenever you want.",
            "And scheduled you have to start at a certain moment.",
            "There's a range of study hours and recognition option.",
            "I already said the student can choose for a batch or even for ETS certificate."
        ],
        [
            "Some steps we did have didn't have any marketing until now.",
            "We did have in press releases to European Commission.",
            "We did have some talks at conferences, but that was all the marketing we did.",
            "Because we want to have the development of our quality branding and our label want to focus on that.",
            "And what's the quality?",
            "So we are almost ready with quality label so partners can join in.",
            "But for now if very satisfied with the number of people visiting our our platform, our portal my would say.",
            "And the most faces are from Spain, Italy and Portugal."
        ],
        [
            "I will demonstrates we examples of of the books fairly quickly just to demonstrate what's the main purpose of the books and how one is from unit.",
            "Unit is an open aver city public in Spain and they have an import check called soften Department called Unit Betta Betta stands for open.",
            "And their name for MC is Coma, so Coma.",
            "Is not in something foreign hospital or something like that.",
            "Now it's the term Spanish term for MC.",
            "For example, in Lithonia and it's Mike MIEK for the term of MC."
        ],
        [
            "Unit did provide 20 books.",
            "As part of open a bit, their first run with 2020 movies.",
            "They did have an enrollment of 160,000 students and all courses that had a minimum of 1000 students.",
            "They decided to have a new one so you can enroll in those courses.",
            "They're all Spanish and they will start at 11 November and one will start at the 24th of November.",
            "So much great vote, so myself based.",
            "They are mainly short courses.",
            "This video lectures but facilitate interaction, automated feedback, self test and peer to peer reviewing so that other main characteristic's of those kinds of books.",
            "And they have a freemium certification model, so again choose, the students can choose for a batch or even pay for a formal certificate.",
            "They also have an online examination form certificate.",
            "You have to pay a small amount of money, but you can have an official certificate.",
            "What's recognized potentially.",
            "Also for, is it yes?",
            "So it's tracked down to the person itself.",
            "You know that person completed the task and learned a lot.",
            "So just online explanation facilities they already did have those facilities because it's the last Open University.",
            "It's also have 250,000 students already, so they are used to do that also with relation to to other countries.",
            "Latin, Latin America to provide online explanation."
        ],
        [
            "They did have a special focus on social inclusion.",
            "And also the digital divide and digital liturgy so.",
            "When you want to really open up education for as many people as possible.",
            "You also have to focus on the on the digital literacy aspects, and two books were dedicated to developing teachers and students.",
            "Digital competence is it's the basic digital competence of students and teachers and it's about it purely for teachers.",
            "ICT for teaching and learning.",
            "So most of them students already have the skills to participate in a book, but it's also.",
            "For those elderly that don't, don't learn about ICT.",
            "How do I participate in a book but also for teachers?",
            "So that's also the other side.",
            "Where units did not focus on."
        ],
        [
            "Another example is from Portugal University, Alberta, Lisbon.",
            "They did one pilot on one book related to that pedagogical model and the pedagogical model is very much related to the Community and connectivism's aspects with flexible participation.",
            "Learner and student centered.",
            "A lot of social interaction.",
            "This learning community that also has a sustainability aspect and related to digital inclusion, but it's very hard to have a MOOC massive scale on that kind of pedagogical model, and they did have an experiment.",
            "They had to stop at 1000 students we opened at an April for enrollment and within 10 days they already had 1000 students.",
            "And they say stop in some pilot."
        ],
        [
            "Anne.",
            "So the main purpose was connecting formal and informal learning scenarios.",
            "Miss community related and how to connect to it through formal possibilities.",
            "They already provide also the possibility for a formal certificate.",
            "Only 11 did complete the complete certificate, but they have to approve opportunity to do that.",
            "And it's related to pedagogical innovation for digital inclusion, so very much related to make the previous talk.",
            "The main focus is on pedagogy is about innovation of dietetics related to digital inclusion.",
            "An opening up education for all?"
        ],
        [
            "The last example is from the Open University of Israel.",
            "They now have four books.",
            "An every book has a different language, is a language in Arabic in Russian and Hebrew and in English.",
            "The two of them already just started.",
            "You can still enroll in that.",
            "The modern Middle East in Hebrew will start in a couple of weeks, and there's a lot of interest in the last one in Halo, Halo, Cedar.",
            "An already is enrollment of 2000 students already, but it will start in six months, so that will increase a lot.",
            "An their basis is still video lectures, self test interaction, peer to peer etc.",
            "But they rely on high quality textbooks, so it's textbooks.",
            "Educational textbooks.",
            "There's alot of didactics and feedback included like the Open University models about the last 20 years and they're working on that will be open textbooks.",
            "So two of them already have an open license as an open textbook.",
            "So that will be in combination between self study and scheduled model."
        ],
        [
            "So.",
            "The main catch in open up it is not about the platform.",
            "It's about opening up.",
            "Education is about the digital and social inclusion.",
            "It's about the ticks and the pedal cottage model, suitable for as much students as possible.",
            "And therefore it has the distinct quality brands, the quality brand of those books are related to the features listed by Fred Mildan.",
            "What I just said.",
            "And the benefits for partner is that you need some kind of European and global collaboration, so you need in partnership with working on the quality and has collective exposure.",
            "You cannot do that at your institution.",
            "You need collaboration both on the didactics, both marketing, both on exposure, etc.",
            "And already started in this a lot of projects, partly also funded projects.",
            "One Portugal start in January, funded by the European Commission working on Business model on the pedagogical models for opening of education."
        ],
        [
            "Anne.",
            "Fred Nolan already mentioned that you cannot be partnered by paying an yearly fee.",
            "Fee is very low.",
            "We say it is only 2500 is non for profit is only to have the centralized operation possible.",
            "And but we feel that the books should be part of the higher educational system of a country, and that the quality system of an institution is also in operation of a MC.",
            "So we perhaps there are high quality moves just started by by teacher or professor that are very good, but we need to ensure, especially if we want to have credits in ECS quarters, the quality system of the country itself, but also quality system of the institution is in operation.",
            "So we have to check for that and we have to check if the features for opening up education are there.",
            "So we need to kind of entry check on the label or quality of the institution and quality of books.",
            "If they really provide evidence on opening of education, but it will not be definite heart entry check it also be and check if the institution is serious about opening up education so it hasn't development plan is set in strategic plan on.",
            "Open licensing on the diabetics etc.",
            "So Fed mode already set almost provided now do not have yet an open license policy, but we want to have it as much as possible.",
            "So when a partner wants to join, open a pet, they won't need to provide a development plan, they are serious about all the features."
        ],
        [
            "Federal level now take over and will also conclude with some possible questions for the panel.",
            "So there is some."
        ],
        [
            "Intentions on this slide.",
            "First of all, it was clear that we are partnering not only is open universities, but we are certainly.",
            "Enthusiastic about partnering with traditional universities.",
            "As long as you are meeting those conditions and the features that we are applying, the also reach out to other continents.",
            "I was starting this talk with referring to the European conference last year.",
            "I was two weeks ago, but I was in China at the World Conference of the Open Universities and I was just giving a talk on what we're doing in Europe and structure me that at the same feeling of urgency and momentum was at the World Conference and they said, well.",
            "Certainly four open universes in Africa, in South Africa and Tanzania and Nigeria, and in.",
            "Zimbabwe and the African Council for Distance Education, which is the sister organization of Media.",
            "To you they were very keen on trying to set up an African initiative which is quite similar to open about, and the same is true for Asia where the opening verses of Indonesia of China, which is a very big one of the Philippines of Malaysia of Korea and Japan, were very supportive of the idea, so they could also come up an Asian.",
            "Similar initiative, I don't know whether it will happen, but it's to me it was quite clear that the feeling that we had at the European conference last year was Wallace copied in the World Conference, and so I have a certain conviction that similar things might happen in Africa and Asia and hopefully also Latin America.",
            "There were not many people from Latin America to conference with, so.",
            "What you see is that.",
            "The Africans like to have their own initiative so we cannot export Northern components to Africa.",
            "They want to have their own books right?",
            "And it's quite you can understand that.",
            "So they are self confident in the last decade and they don't want to be overwhelmed by northern or Western products.",
            "They want to have their own products and the same of course is true for a ship.",
            "The only thing that we would like to consider is to have if this is going to happen.",
            "To have a branding common branding with Europe with Africa and was left with Service Asia.",
            "So that's the thing that's on the line and we'll see what comes out.",
            "Of course, we want to share our expertise with the other institutions in the perspective of opening up education for all that's important for all of us.",
            "I think that has a lot of potential, and there's the opportunity to contribute to the modernization agenda for education, which is has been specified and virtual.",
            "We explored further on.",
            "In the next next year, and I think that we can showcase that Moocs can indeed be part of the real open movement in open licensing and then contribute to the overall movement further, so that is more or less the end of our talk."
        ],
        [
            "The next slide will show some questions or some issues that we might use in the panel."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We just started and thank Felix for his very inspirational and stimulating talk because I think what he did was show that books can be used in a very nice way and can be very attractive and can be very useful for your own University.",
                    "label": 0
                },
                {
                    "sent": "So I would like to thank you.",
                    "label": 0
                },
                {
                    "sent": "I would have had some questions but there was no time.",
                    "label": 0
                },
                {
                    "sent": "Anyway, thanks very much for your presentation and I would like to take you back to the conference that we had last year in on Cyprus.",
                    "label": 0
                },
                {
                    "sent": "It was a conference which was organized by the European Association of Distance Universities.",
                    "label": 0
                },
                {
                    "sent": "And I I was giving a presentation there and I was just throwing the idea whi.",
                    "label": 0
                },
                {
                    "sent": "Do we allow the Stanford Center Berkeley's in the MIT center Harvard to run away?",
                    "label": 0
                },
                {
                    "sent": "Was open online education whereas the universities have done this for decades already.",
                    "label": 0
                },
                {
                    "sent": "So we should do something about that.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Much to my surprise, after the conference, we all agreed that we should do it and we should take it up quite quickly and within about six months we succeeded in launching a new initiative, which is called Open event.",
                    "label": 0
                },
                {
                    "sent": "I was referring to that already yesterday and today we will take some more time to share with you would open about stands for what it does and how it's increasing in number, of course is OK.",
                    "label": 0
                },
                {
                    "sent": "Here we go again, so we.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Decided to start a new initiative which is called Open event and.",
                    "label": 0
                },
                {
                    "sent": "Because we observe the US dominance, we thought we should do something about that, and that's what we did.",
                    "label": 0
                },
                {
                    "sent": "So there was time for European initiative.",
                    "label": 1
                },
                {
                    "sent": "That's what we thought, and we were using the umbrella that European Commission was offering and launching this program, which is called opening up education.",
                    "label": 0
                },
                {
                    "sent": "So we used the word open up add an.",
                    "label": 0
                },
                {
                    "sent": "Actually, this is the first, and so far only European initiative.",
                    "label": 0
                },
                {
                    "sent": "Felix was asking for European initiatives and German ones.",
                    "label": 0
                },
                {
                    "sent": "There's a German one.",
                    "label": 0
                },
                {
                    "sent": "This is the only European ones so far.",
                    "label": 0
                },
                {
                    "sent": "We launched it on April 25.",
                    "label": 0
                },
                {
                    "sent": "And as I said yesterday, it was a very interesting launch because European Commission was extremely enthusiastic about this first European initiative and are waiting for other ones.",
                    "label": 0
                },
                {
                    "sent": "I'm sure about that.",
                    "label": 0
                },
                {
                    "sent": "So this is the first one, and it's really based on the European values on equity quality and diversity.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The partnership is, as I said yesterday, the Ministry of Higher Education from France, winner from Italy then the Technical University of Co. Nelson, Lithuania.",
                    "label": 0
                },
                {
                    "sent": "The opening for the Netherlands, the openness of Portugal in Slovakia, detecting University of Association and the Association in Spain.",
                    "label": 0
                },
                {
                    "sent": "It is unit and national opinion Aver City and in the UK.",
                    "label": 0
                },
                {
                    "sent": "It's the Open University which is on board.",
                    "label": 0
                },
                {
                    "sent": "So they decided to have two tracks.",
                    "label": 0
                },
                {
                    "sent": "The Ventrac is future learn that they're leading in the other track is the European initiative and then outside of the EU we have some members from easy to you, which is messy direction up University which is Turkey Anadolu University which is a very big operation.",
                    "label": 1
                },
                {
                    "sent": "They run 1.7 million students so that's really massive.",
                    "label": 0
                },
                {
                    "sent": "I would say any universe of Israel and there's plenty to join other Members from you to you.",
                    "label": 0
                },
                {
                    "sent": "The advice of Cyprus.",
                    "label": 0
                },
                {
                    "sent": "It's always, I think, from Denmark and from Estonia, an Association I think, and then Fiat from France.",
                    "label": 0
                },
                {
                    "sent": "The openness of Greece, Oscar from Ireland in Poland.",
                    "label": 0
                },
                {
                    "sent": "There's two universities that want to join in Slovenia.",
                    "label": 0
                },
                {
                    "sent": "We are in touch already with you gonna and in Spain the Open University of Catalonia, the walk so then more or less we cover the whole membership of idiots.",
                    "label": 0
                },
                {
                    "sent": "You except for the German family which we.",
                    "label": 0
                },
                {
                    "sent": "Very much regret, but I'm sure they will join at a certain state's order request to become a partner of open about as well.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now we decided to be pretty precise on framework that we want to use a framework which is stressing a number of features and the features are here.",
                    "label": 0
                },
                {
                    "sent": "The 8 features that we have in common, more or less are the first one is openness to learners, which is really related to let's say, the classical openness of the Open University.",
                    "label": 1
                },
                {
                    "sent": "So it's freedom of time, freedom of pace, freedom of place, open entry, of course, freedom of programming and all those types of openness which are really directed towards the learners are in place.",
                    "label": 1
                },
                {
                    "sent": "The second one is the digital openness and digital.",
                    "label": 0
                },
                {
                    "sent": "Open certainly means that there will be open licensing for all of the courses.",
                    "label": 0
                },
                {
                    "sent": "That's a condition more or less so as explained yesterday, there's towards closing in open online courses and we really want to be as open as possible, which means a Creative Commons license which is CC by or CC by SA.",
                    "label": 0
                },
                {
                    "sent": "So it's a very liberal approach.",
                    "label": 0
                },
                {
                    "sent": "I must admit that not all of the courses on the on the portal already have this open licensing, but we're working on that.",
                    "label": 1
                },
                {
                    "sent": "And then there's a learner centered approach, which of course is in the tradition of our universities be aren't developing and designing course materials.",
                    "label": 1
                },
                {
                    "sent": "Also, in this tradition for independent or autonomous learning, the interaction is supported by media that can be at a different level.",
                    "label": 0
                },
                {
                    "sent": "Of course, there's different various recognition options.",
                    "label": 0
                },
                {
                    "sent": "The first ones to completion certificate, the second one is the batch, and the third one is full recognition by credits and archival.",
                    "label": 0
                },
                {
                    "sent": "Just tell more about that how it's working.",
                    "label": 0
                },
                {
                    "sent": "There's a strong focus on quality, so we want to make sure that the courses that we are delivering our meeting our normal quality conditions and we cherish diversity.",
                    "label": 0
                },
                {
                    "sent": "Felix was referring to is a very English dominated and ever which is true, and I'm quite happy that the Germans are coming up in the Spanish are coming up and this initiative open event is really about diversity in language and not only language.",
                    "label": 0
                },
                {
                    "sent": "Also the cultural context.",
                    "label": 0
                },
                {
                    "sent": "That's why we choose.",
                    "label": 0
                },
                {
                    "sent": "To have a partnership in so many countries.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Different form future learn from Coursera from edx from diversity.",
                    "label": 0
                },
                {
                    "sent": "This is a decentralized model, so we think the institution should be in the lead and it's not us coordinating open about, but it's the institutions that are in the lead and are responsible for their own operation.",
                    "label": 0
                },
                {
                    "sent": "That means that we don't have a platform, a central platform.",
                    "label": 0
                },
                {
                    "sent": "We don't need it becausw the Department of open about have their own platforms already in place.",
                    "label": 0
                },
                {
                    "sent": "At least most of them.",
                    "label": 0
                },
                {
                    "sent": "And if there's a partner that hasn't a platform, we can provide it from the different partners that are in place already.",
                    "label": 0
                },
                {
                    "sent": "Or you could also use the edx platform because that's an open source platform, so there's many possibilities.",
                    "label": 0
                },
                {
                    "sent": "It's not about a platform, that's our view, it's about how you provide you or your courses.",
                    "label": 0
                },
                {
                    "sent": "So open event is not a platform, it's a portal, and the portal tells you what kind of courses are in place, what kind of conditions are met by those courses, who are.",
                    "label": 0
                },
                {
                    "sent": "Providing the courses and so on, it's a refer atory rather than a repository of courses.",
                    "label": 0
                },
                {
                    "sent": "Not driven by revenue, it's a public affair.",
                    "label": 1
                },
                {
                    "sent": "More or less will be driven by service that we want to bring to the learns into society.",
                    "label": 1
                },
                {
                    "sent": "And as I said before, it's a public domain rather than a private sector endeavor.",
                    "label": 1
                },
                {
                    "sent": "Soda",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Centralized, which is essential, but also there is a central component which has to do with quality and branding.",
                    "label": 0
                },
                {
                    "sent": "So we want to make sure that open about has a strong branding along those eight common features and there is a procedure to become a partner.",
                    "label": 0
                },
                {
                    "sent": "You cannot become a partner by just paying some money.",
                    "label": 0
                },
                {
                    "sent": "You can become a partner by meeting the conditions that we have.",
                    "label": 0
                },
                {
                    "sent": "An darker will explain what the conditions are and we have a label which is in place.",
                    "label": 0
                },
                {
                    "sent": "There is a.",
                    "label": 0
                },
                {
                    "sent": "Draft version of the quality level, which is called Open Net label.",
                    "label": 0
                },
                {
                    "sent": "That is a condition for the moves that are being delivered by the partners as well, and you can review the.",
                    "label": 0
                },
                {
                    "sent": "And look into the review version of the label on the website since there and there will be continuous monitoring of course and research and evaluation will be involved as well.",
                    "label": 1
                },
                {
                    "sent": "So this I think is more or less my.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Part of the story and then darker will take over.",
                    "label": 0
                },
                {
                    "sent": "I'm the coordinator of open about this initiative and I'm working at the European Association of this.",
                    "label": 0
                },
                {
                    "sent": "Is teaching universities, so most of the members of Open Pitan now from the Edu threads Shelton slide already that we already have 20 requests from non Elysium members.",
                    "label": 0
                },
                {
                    "sent": "So on campus traditional universities to become member and it is not only limited to Europe, fat is already having a lot of discussion in partnership with Asia and Africa.",
                    "label": 0
                },
                {
                    "sent": "So Government global initiative.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But just look at the figures of the number of books.",
                    "label": 1
                },
                {
                    "sent": "I did it yesterday about the number of books provided by different providers of moves.",
                    "label": 0
                },
                {
                    "sent": "Corsair is by far the largest, is more than 500 courses already provided, and the top three are the starters of the books in the United States.",
                    "label": 0
                },
                {
                    "sent": "In the middle you see older countries that has listed and provided their moves.",
                    "label": 0
                },
                {
                    "sent": "So is Australia is open to study its myriad X from Spain and also with some Portuguese languages.",
                    "label": 0
                },
                {
                    "sent": "Future learn from Britain, France University.",
                    "label": 0
                },
                {
                    "sent": "In numeric you started a couple weeks ago.",
                    "label": 0
                },
                {
                    "sent": "It already has 24 courses and in German language diversity and is already have 25 courses.",
                    "label": 1
                },
                {
                    "sent": "We had opened a bit making love the boost we did start this 40 courses at 80 course at the end of September and now we have 174 courses.",
                    "label": 0
                },
                {
                    "sent": "More than 100 of those courses have the opportunity for credit.",
                    "label": 0
                },
                {
                    "sent": "This, recognized in a curriculum.",
                    "label": 0
                },
                {
                    "sent": "So this about Izzie TS regular credits so that students following a course can choose for a batch.",
                    "label": 0
                },
                {
                    "sent": "A certificate of Participation, a certificate of completion, or but then they have to pay a small amount of money and for more credit.",
                    "label": 0
                },
                {
                    "sent": "They have to pay Bill 'cause there's authentication, authorization problem etc.",
                    "label": 0
                },
                {
                    "sent": "So we have to go to the center and some of the parts even have the.",
                    "label": 0
                },
                {
                    "sent": "Total system to authenticate and out of data set the person online.",
                    "label": 0
                },
                {
                    "sent": "There's even online assessment etc so.",
                    "label": 0
                },
                {
                    "sent": "There's also one main difference this to other providers.",
                    "label": 0
                },
                {
                    "sent": "We do have a lot of opportunities for ECS.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's a map from you.",
                    "label": 0
                },
                {
                    "sent": "See the URL.",
                    "label": 0
                },
                {
                    "sent": "It's a MC map.",
                    "label": 0
                },
                {
                    "sent": "You can show auto development is from April 2012 to October 2013, student at the right side hand side.",
                    "label": 0
                },
                {
                    "sent": "And you can choose for the providers on the on the top of that right hand.",
                    "label": 0
                },
                {
                    "sent": "You see that it's not the same list of providers.",
                    "label": 0
                },
                {
                    "sent": "For example, mega decks from Spain is not on that list.",
                    "label": 0
                },
                {
                    "sent": "On the previous slides for me, countless net was not on the list, so you can always have a discussion who are among providers, who are providers of open courseware, who are the providers of online courses, when it's an online course MOOC, etc.",
                    "label": 0
                },
                {
                    "sent": "Previous talk already made some slides about is Watson, MC, etc.",
                    "label": 0
                },
                {
                    "sent": "But you can always discuss what's a book provider, not.",
                    "label": 0
                },
                {
                    "sent": "This one.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "List this is from Oped, Ocation Europe.",
                    "label": 0
                },
                {
                    "sent": "This to figure in September then you will provides already 277 books.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the list from October.",
                    "label": 0
                },
                {
                    "sent": "And open a bit as now 174 courses.",
                    "label": 0
                },
                {
                    "sent": "It's not all counted here.",
                    "label": 0
                },
                {
                    "sent": "Becausw, yes, at the beginning of November we launched almost 19 additional courses.",
                    "label": 0
                },
                {
                    "sent": "Most of them are from Italy and now the figure will be that Italy is the main provider of books in Europe.",
                    "label": 0
                },
                {
                    "sent": "Not Spain, not Germany, not the UK, but Italy.",
                    "label": 0
                },
                {
                    "sent": "It's foreman Telemedical University that has a lot of video and broadcasting, so they already had a lot of video databases and they decided to open up much of their existing courses for students.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The increase of European part of Moocs is very large.",
                    "label": 0
                },
                {
                    "sent": "This more than 50% by now.",
                    "label": 0
                },
                {
                    "sent": "It's now at the end 50%.",
                    "label": 0
                },
                {
                    "sent": "But we already have 990 looks more available on open a bed.",
                    "label": 0
                },
                {
                    "sent": "So the increase of European part is large.",
                    "label": 0
                },
                {
                    "sent": "But you have to distinct.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is the difference between a platform and a provider.",
                    "label": 0
                },
                {
                    "sent": "Coceira is a platform where a University can provide their course.",
                    "label": 0
                },
                {
                    "sent": "So the University provides the course.",
                    "label": 0
                },
                {
                    "sent": "Kucera is the platform.",
                    "label": 0
                },
                {
                    "sent": "So you can distinguish private companies like Corsair, Udacity, mirrored X Iversity.",
                    "label": 1
                },
                {
                    "sent": "You also have collaborations.",
                    "label": 0
                },
                {
                    "sent": "It can be an institutional collaboration, but for example, in France there's a national collaboration and they also have their own platform.",
                    "label": 0
                },
                {
                    "sent": "France University numeric has.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "Platform is based on at X, not completely ethics that based on the open source platform of ethics and has his own platform.",
                    "label": 0
                },
                {
                    "sent": "But this in collaboration.",
                    "label": 0
                },
                {
                    "sent": "This open up part is the institutions have their own platform.",
                    "label": 1
                },
                {
                    "sent": "But they can also choose platform from other parts of our prepared with for example Athabasca in Canada is also his own platform for the scene books etc most likely and hopefully Autobus cannot join open events in near future.",
                    "label": 0
                },
                {
                    "sent": "So there's a difference between the providers and the platform providers.",
                    "label": 0
                },
                {
                    "sent": "The content provider, course providers, and the platform providers.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for open a bit, for now we have 174 courses.",
                    "label": 0
                },
                {
                    "sent": "There's a wide variety of subjects and level.",
                    "label": 1
                },
                {
                    "sent": "12 languages most languages are non English.",
                    "label": 0
                },
                {
                    "sent": "So domination by English language no, not in this case.",
                    "label": 0
                },
                {
                    "sent": "It's scheduled and self based.",
                    "label": 0
                },
                {
                    "sent": "So that's also an addition is that you can start whenever you want, and perhaps build your own network.",
                    "label": 0
                },
                {
                    "sent": "I think that's not nice.",
                    "label": 0
                },
                {
                    "sent": "You can continue to build networks and self paced.",
                    "label": 0
                },
                {
                    "sent": "Mean you can start whenever you want.",
                    "label": 1
                },
                {
                    "sent": "And scheduled you have to start at a certain moment.",
                    "label": 0
                },
                {
                    "sent": "There's a range of study hours and recognition option.",
                    "label": 0
                },
                {
                    "sent": "I already said the student can choose for a batch or even for ETS certificate.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some steps we did have didn't have any marketing until now.",
                    "label": 0
                },
                {
                    "sent": "We did have in press releases to European Commission.",
                    "label": 0
                },
                {
                    "sent": "We did have some talks at conferences, but that was all the marketing we did.",
                    "label": 0
                },
                {
                    "sent": "Because we want to have the development of our quality branding and our label want to focus on that.",
                    "label": 0
                },
                {
                    "sent": "And what's the quality?",
                    "label": 0
                },
                {
                    "sent": "So we are almost ready with quality label so partners can join in.",
                    "label": 0
                },
                {
                    "sent": "But for now if very satisfied with the number of people visiting our our platform, our portal my would say.",
                    "label": 0
                },
                {
                    "sent": "And the most faces are from Spain, Italy and Portugal.",
                    "label": 1
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will demonstrates we examples of of the books fairly quickly just to demonstrate what's the main purpose of the books and how one is from unit.",
                    "label": 0
                },
                {
                    "sent": "Unit is an open aver city public in Spain and they have an import check called soften Department called Unit Betta Betta stands for open.",
                    "label": 0
                },
                {
                    "sent": "And their name for MC is Coma, so Coma.",
                    "label": 0
                },
                {
                    "sent": "Is not in something foreign hospital or something like that.",
                    "label": 0
                },
                {
                    "sent": "Now it's the term Spanish term for MC.",
                    "label": 0
                },
                {
                    "sent": "For example, in Lithonia and it's Mike MIEK for the term of MC.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Unit did provide 20 books.",
                    "label": 0
                },
                {
                    "sent": "As part of open a bit, their first run with 2020 movies.",
                    "label": 1
                },
                {
                    "sent": "They did have an enrollment of 160,000 students and all courses that had a minimum of 1000 students.",
                    "label": 0
                },
                {
                    "sent": "They decided to have a new one so you can enroll in those courses.",
                    "label": 0
                },
                {
                    "sent": "They're all Spanish and they will start at 11 November and one will start at the 24th of November.",
                    "label": 0
                },
                {
                    "sent": "So much great vote, so myself based.",
                    "label": 0
                },
                {
                    "sent": "They are mainly short courses.",
                    "label": 1
                },
                {
                    "sent": "This video lectures but facilitate interaction, automated feedback, self test and peer to peer reviewing so that other main characteristic's of those kinds of books.",
                    "label": 1
                },
                {
                    "sent": "And they have a freemium certification model, so again choose, the students can choose for a batch or even pay for a formal certificate.",
                    "label": 0
                },
                {
                    "sent": "They also have an online examination form certificate.",
                    "label": 0
                },
                {
                    "sent": "You have to pay a small amount of money, but you can have an official certificate.",
                    "label": 0
                },
                {
                    "sent": "What's recognized potentially.",
                    "label": 0
                },
                {
                    "sent": "Also for, is it yes?",
                    "label": 0
                },
                {
                    "sent": "So it's tracked down to the person itself.",
                    "label": 0
                },
                {
                    "sent": "You know that person completed the task and learned a lot.",
                    "label": 0
                },
                {
                    "sent": "So just online explanation facilities they already did have those facilities because it's the last Open University.",
                    "label": 0
                },
                {
                    "sent": "It's also have 250,000 students already, so they are used to do that also with relation to to other countries.",
                    "label": 0
                },
                {
                    "sent": "Latin, Latin America to provide online explanation.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "They did have a special focus on social inclusion.",
                    "label": 1
                },
                {
                    "sent": "And also the digital divide and digital liturgy so.",
                    "label": 0
                },
                {
                    "sent": "When you want to really open up education for as many people as possible.",
                    "label": 0
                },
                {
                    "sent": "You also have to focus on the on the digital literacy aspects, and two books were dedicated to developing teachers and students.",
                    "label": 1
                },
                {
                    "sent": "Digital competence is it's the basic digital competence of students and teachers and it's about it purely for teachers.",
                    "label": 1
                },
                {
                    "sent": "ICT for teaching and learning.",
                    "label": 0
                },
                {
                    "sent": "So most of them students already have the skills to participate in a book, but it's also.",
                    "label": 0
                },
                {
                    "sent": "For those elderly that don't, don't learn about ICT.",
                    "label": 0
                },
                {
                    "sent": "How do I participate in a book but also for teachers?",
                    "label": 0
                },
                {
                    "sent": "So that's also the other side.",
                    "label": 0
                },
                {
                    "sent": "Where units did not focus on.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another example is from Portugal University, Alberta, Lisbon.",
                    "label": 0
                },
                {
                    "sent": "They did one pilot on one book related to that pedagogical model and the pedagogical model is very much related to the Community and connectivism's aspects with flexible participation.",
                    "label": 1
                },
                {
                    "sent": "Learner and student centered.",
                    "label": 1
                },
                {
                    "sent": "A lot of social interaction.",
                    "label": 0
                },
                {
                    "sent": "This learning community that also has a sustainability aspect and related to digital inclusion, but it's very hard to have a MOOC massive scale on that kind of pedagogical model, and they did have an experiment.",
                    "label": 0
                },
                {
                    "sent": "They had to stop at 1000 students we opened at an April for enrollment and within 10 days they already had 1000 students.",
                    "label": 0
                },
                {
                    "sent": "And they say stop in some pilot.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "So the main purpose was connecting formal and informal learning scenarios.",
                    "label": 1
                },
                {
                    "sent": "Miss community related and how to connect to it through formal possibilities.",
                    "label": 0
                },
                {
                    "sent": "They already provide also the possibility for a formal certificate.",
                    "label": 0
                },
                {
                    "sent": "Only 11 did complete the complete certificate, but they have to approve opportunity to do that.",
                    "label": 1
                },
                {
                    "sent": "And it's related to pedagogical innovation for digital inclusion, so very much related to make the previous talk.",
                    "label": 0
                },
                {
                    "sent": "The main focus is on pedagogy is about innovation of dietetics related to digital inclusion.",
                    "label": 0
                },
                {
                    "sent": "An opening up education for all?",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The last example is from the Open University of Israel.",
                    "label": 1
                },
                {
                    "sent": "They now have four books.",
                    "label": 0
                },
                {
                    "sent": "An every book has a different language, is a language in Arabic in Russian and Hebrew and in English.",
                    "label": 0
                },
                {
                    "sent": "The two of them already just started.",
                    "label": 0
                },
                {
                    "sent": "You can still enroll in that.",
                    "label": 0
                },
                {
                    "sent": "The modern Middle East in Hebrew will start in a couple of weeks, and there's a lot of interest in the last one in Halo, Halo, Cedar.",
                    "label": 0
                },
                {
                    "sent": "An already is enrollment of 2000 students already, but it will start in six months, so that will increase a lot.",
                    "label": 0
                },
                {
                    "sent": "An their basis is still video lectures, self test interaction, peer to peer etc.",
                    "label": 0
                },
                {
                    "sent": "But they rely on high quality textbooks, so it's textbooks.",
                    "label": 0
                },
                {
                    "sent": "Educational textbooks.",
                    "label": 0
                },
                {
                    "sent": "There's alot of didactics and feedback included like the Open University models about the last 20 years and they're working on that will be open textbooks.",
                    "label": 0
                },
                {
                    "sent": "So two of them already have an open license as an open textbook.",
                    "label": 0
                },
                {
                    "sent": "So that will be in combination between self study and scheduled model.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The main catch in open up it is not about the platform.",
                    "label": 0
                },
                {
                    "sent": "It's about opening up.",
                    "label": 0
                },
                {
                    "sent": "Education is about the digital and social inclusion.",
                    "label": 0
                },
                {
                    "sent": "It's about the ticks and the pedal cottage model, suitable for as much students as possible.",
                    "label": 0
                },
                {
                    "sent": "And therefore it has the distinct quality brands, the quality brand of those books are related to the features listed by Fred Mildan.",
                    "label": 1
                },
                {
                    "sent": "What I just said.",
                    "label": 0
                },
                {
                    "sent": "And the benefits for partner is that you need some kind of European and global collaboration, so you need in partnership with working on the quality and has collective exposure.",
                    "label": 1
                },
                {
                    "sent": "You cannot do that at your institution.",
                    "label": 0
                },
                {
                    "sent": "You need collaboration both on the didactics, both marketing, both on exposure, etc.",
                    "label": 0
                },
                {
                    "sent": "And already started in this a lot of projects, partly also funded projects.",
                    "label": 0
                },
                {
                    "sent": "One Portugal start in January, funded by the European Commission working on Business model on the pedagogical models for opening of education.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Fred Nolan already mentioned that you cannot be partnered by paying an yearly fee.",
                    "label": 0
                },
                {
                    "sent": "Fee is very low.",
                    "label": 0
                },
                {
                    "sent": "We say it is only 2500 is non for profit is only to have the centralized operation possible.",
                    "label": 0
                },
                {
                    "sent": "And but we feel that the books should be part of the higher educational system of a country, and that the quality system of an institution is also in operation of a MC.",
                    "label": 0
                },
                {
                    "sent": "So we perhaps there are high quality moves just started by by teacher or professor that are very good, but we need to ensure, especially if we want to have credits in ECS quarters, the quality system of the country itself, but also quality system of the institution is in operation.",
                    "label": 0
                },
                {
                    "sent": "So we have to check for that and we have to check if the features for opening up education are there.",
                    "label": 0
                },
                {
                    "sent": "So we need to kind of entry check on the label or quality of the institution and quality of books.",
                    "label": 0
                },
                {
                    "sent": "If they really provide evidence on opening of education, but it will not be definite heart entry check it also be and check if the institution is serious about opening up education so it hasn't development plan is set in strategic plan on.",
                    "label": 0
                },
                {
                    "sent": "Open licensing on the diabetics etc.",
                    "label": 0
                },
                {
                    "sent": "So Fed mode already set almost provided now do not have yet an open license policy, but we want to have it as much as possible.",
                    "label": 0
                },
                {
                    "sent": "So when a partner wants to join, open a pet, they won't need to provide a development plan, they are serious about all the features.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Federal level now take over and will also conclude with some possible questions for the panel.",
                    "label": 0
                },
                {
                    "sent": "So there is some.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Intentions on this slide.",
                    "label": 0
                },
                {
                    "sent": "First of all, it was clear that we are partnering not only is open universities, but we are certainly.",
                    "label": 0
                },
                {
                    "sent": "Enthusiastic about partnering with traditional universities.",
                    "label": 1
                },
                {
                    "sent": "As long as you are meeting those conditions and the features that we are applying, the also reach out to other continents.",
                    "label": 0
                },
                {
                    "sent": "I was starting this talk with referring to the European conference last year.",
                    "label": 0
                },
                {
                    "sent": "I was two weeks ago, but I was in China at the World Conference of the Open Universities and I was just giving a talk on what we're doing in Europe and structure me that at the same feeling of urgency and momentum was at the World Conference and they said, well.",
                    "label": 0
                },
                {
                    "sent": "Certainly four open universes in Africa, in South Africa and Tanzania and Nigeria, and in.",
                    "label": 0
                },
                {
                    "sent": "Zimbabwe and the African Council for Distance Education, which is the sister organization of Media.",
                    "label": 0
                },
                {
                    "sent": "To you they were very keen on trying to set up an African initiative which is quite similar to open about, and the same is true for Asia where the opening verses of Indonesia of China, which is a very big one of the Philippines of Malaysia of Korea and Japan, were very supportive of the idea, so they could also come up an Asian.",
                    "label": 0
                },
                {
                    "sent": "Similar initiative, I don't know whether it will happen, but it's to me it was quite clear that the feeling that we had at the European conference last year was Wallace copied in the World Conference, and so I have a certain conviction that similar things might happen in Africa and Asia and hopefully also Latin America.",
                    "label": 0
                },
                {
                    "sent": "There were not many people from Latin America to conference with, so.",
                    "label": 0
                },
                {
                    "sent": "What you see is that.",
                    "label": 0
                },
                {
                    "sent": "The Africans like to have their own initiative so we cannot export Northern components to Africa.",
                    "label": 0
                },
                {
                    "sent": "They want to have their own books right?",
                    "label": 0
                },
                {
                    "sent": "And it's quite you can understand that.",
                    "label": 0
                },
                {
                    "sent": "So they are self confident in the last decade and they don't want to be overwhelmed by northern or Western products.",
                    "label": 0
                },
                {
                    "sent": "They want to have their own products and the same of course is true for a ship.",
                    "label": 0
                },
                {
                    "sent": "The only thing that we would like to consider is to have if this is going to happen.",
                    "label": 0
                },
                {
                    "sent": "To have a branding common branding with Europe with Africa and was left with Service Asia.",
                    "label": 0
                },
                {
                    "sent": "So that's the thing that's on the line and we'll see what comes out.",
                    "label": 0
                },
                {
                    "sent": "Of course, we want to share our expertise with the other institutions in the perspective of opening up education for all that's important for all of us.",
                    "label": 1
                },
                {
                    "sent": "I think that has a lot of potential, and there's the opportunity to contribute to the modernization agenda for education, which is has been specified and virtual.",
                    "label": 1
                },
                {
                    "sent": "We explored further on.",
                    "label": 0
                },
                {
                    "sent": "In the next next year, and I think that we can showcase that Moocs can indeed be part of the real open movement in open licensing and then contribute to the overall movement further, so that is more or less the end of our talk.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The next slide will show some questions or some issues that we might use in the panel.",
                    "label": 0
                }
            ]
        }
    }
}