{
    "id": "2shqaeqjzj2l2y4xpowntk6jjazhwgab",
    "title": "Theory of macromolecular transport through protein channels and nanopores",
    "info": {
        "author": [
            "Murugappan Muthukumar, Department of Polymer Science and Engineering, University of Massachusetts Amherst"
        ],
        "published": "Nov. 5, 2012",
        "recorded": "September 2012",
        "category": [
            "Top->Science->Materials Science->Polymer science"
        ]
    },
    "url": "http://videolectures.net/kolokviji_muthukumar_macromolecular_transport/",
    "segmentation": [
        [
            "It's really a great honor for me to be in this very famous Institute, and in a serendipitous way.",
            "I just discovered few minutes back that they found out this place is Anton Peterlin, whom I knew he was an extremely supportive scientist for me when I was starting my career.",
            "And I very vividly remember.",
            "The support and enthusiasm for science he had had and also the creativity that brought it to the polymer physics.",
            "These are very very early days or polymer physics when people were even debating about the existence of Poly mercy had this great ideas about statistical mechanics of these polymers, and I think I'll have a remark to make about his contribution very quickly thought about his work.",
            "In fact, in my thesis I refer to his work and my thesis as a young man was based related to his work on polymer.",
            "Information, so it's really a great pleasure for me to be here and I want to thank the organizers for making this arrangement.",
            "OK, so my topic today that I wish to share with you is about large macromolecules moving through space from one location to another location and it's like having a very large macromolecules in this room and trying to get through your small door into other big bigger room.",
            "And that's basically the question that I want to think about and I want to share with you.",
            "How we have been going about thinking about this issue and I have been very fortunate to had excellent graduate students who had shared this a burden of trying to figure this out over many years, and I'll pick a few items here and there and talk about the contributions from these people.",
            "And indeed we need money to do the research.",
            "And we need people to do research and this work that I'm going to be sharing with you is supported by National Institutes of Health and National Science Foundation of United States.",
            "So what is the?"
        ],
        [
            "Question I am interested in the following issue.",
            "If I take mammalian cell I put my pointer anywhere on this mammalian cell.",
            "I will meet an electrically charged large macromolecule.",
            "And in fact, in order for this cell to function, these molecules have to move from one place to the other.",
            "If I were to take Messenger RNA inside the nucleus, it has to come through this little hole an come out and give instructions for the synthesis of a protein.",
            "For example, and everywhere else I have to make these molecules to move from one location to another location.",
            "That's the way this cell functions, and as I speak, and as you would ask me some questions and I answer.",
            "Many many many many macromolecules have migrated from one location under location.",
            "During that small event, small duration of time.",
            "So that's my question.",
            "That's what I want to understand when I think we're more about this.",
            "This is this transport is not taking place in isolation.",
            "It's a very crowded environment and it's an electrolyte solution.",
            "Then I call this to be cool.",
            "Um, soup, it's very thick in terms of density as well as everywhere.",
            "All charges there is also another remarkable thing about these systems.",
            "If you look at the physiological temperature of any species, it's essentially fixed for us.",
            "Given our temperature in absolutist Calvin, the error of 2% would be deadly, so the temperature is really essentially fixed in our physiological system, so unlike the traditional physics problems, the biological physics problems are not a zero temperature phenomenon.",
            "High temperature phenomena.",
            "There's a very narrow range of temperature with which we had to work with.",
            "But then we know that the way these molecules have to migrate from one place to another place must be true free energy landscape.",
            "There is no exception to the Boltzmann's law.",
            "You know it has to be 3 landscape.",
            "Then let's think about that formula and I have to keep this temperature fixed.",
            "But I must have a large excursions in free energy landscape.",
            "How does that happen?",
            "It must happen through the entropy.",
            "And what better candidate can we have to have to end a large amount of entropy and variations?",
            "Entropy that is polymer?",
            "If you take a chromosome for example, you know is able to change.",
            "It's a confirmation from very big to small during the cell cycle and that accompanies humongous a changes in entropy, an contributing to the free landscape.",
            "So therefore I must really deal with the confirmation entropy of these.",
            "Ultimate change when I want to think about how these migrations take place.",
            "Now we have to pay attention to the extra mental facts we talked over biology, friends and what they tell us is oh everything is specificity.",
            "Because if I were to take one mutation of the protein, the behavior is going to be drastically different and it is true.",
            "It is indeed true that we have to account for specificity.",
            "But now what I'm going to do is in the in this context of.",
            "Of accomplishment soft matter physics.",
            "I'm going to think in terms of whether there are some general concepts from polymer physics that we can bring up first because of the large length scales involved and the conformational changes that are involved after addressing those things, we try to put specificity, and that's the attitude with which I'm going to present this story.",
            "And please interrupt, you know, at anytime we can discuss more in detail about the marriage between general ideas and specific details of.",
            "This polymer transport OK, so this is a general context and we can be lit."
        ],
        [
            "More polished and look for some specific cases as well, and if you take specific cases you know this is a famous example of phage containing double stranded DNA being pushed through a narrow channel into the victim.",
            "You know how does this will take place or if you look at genomic exchange between the male bacterium and the female bacterium.",
            "Here is your nanotube made up of possible charges.",
            "Protein code, so there is the internal diameter is roughly about 2 nanometers and then the genomic material is pushed from the male to female through this enano capillary.",
            "Or if you talk about the Messenger RNA getting out of the nucleus.",
            "This is a nuclear pore and here is my Messenger RNA and that's going to wiggle through this very complex charge decorated entity and come out and then let's pay little bit more attention to this and the M RNA is.",
            "Complex in with oppositely charged proteins in this very complicated form, and the typical size of this complex is about 50 nanometers, and the typical size of this agate is about 300 animators.",
            "These are very large length scale entities, and I'm trying to figure out how this complex is going to come through, so this is an example where the length scales are so large and the tools that we have learned in polymer physics could be very useful because we're talking about large length scale phenomena, and that's again the attitude Y.",
            "We are taking confirmation entropy as a thing.",
            "In addition to this very interesting fundamental issues, there is also yeah societal pressure right now.",
            "Which is it to figure out?"
        ],
        [
            "The genome very cheaply and very quickly.",
            "You know what is the how to read the sequence of double stranded DNA given the genome and we want to do it very inexpensively.",
            "And also we want to do this in a cheaper way and the premise is try to push your double sided DNA through a narrow four and ask if chain is being pushed through this in aeroport narrow hold you want to interrogate with some suitable techniques and then a measure.",
            "The identity of that base that is passing through right?",
            "So from technology point of view, as well as a fundamental biological point of view, this question of how molecules move from one domain to another domain is of interest to me.",
            "Now let's go to the drawing board and think about this problem when we think about this problem, the problem is already."
        ],
        [
            "Quite complicated.",
            "Let's take the simplest case of taking a polymer charger polymer like a DNA or approaching.",
            "Let's takes a single center DNA double stranded DNA, and then it has some typical size, which is a radius of gyration.",
            "And let me push through will push it through your channel or a big tube capillary and the diameter of this Kappel Aries are larger than the size of the polymer.",
            "In that case it is like a solution.",
            "So I have a.",
            "Two electrodes.",
            "I have a solution.",
            "Electrolyte solution.",
            "Put your charger polymer and with an electric field.",
            "I'm trying to move these molecules from one place to another place already.",
            "The results are very enigmatic.",
            "For example counter intuition.",
            "They polymer speed is independent of length and I could put two polymer chains or one is only 1000 basis, other one is million basis and with the field I want to see when they are going to go to the other world, both of them reach the wall at the same time.",
            "That's the reason why we do not use capital electric forces for separating DNA.",
            "We do generative forces because we put a blockade so that they would go to different speeds.",
            "But in solutions they move at the same speed.",
            "This already very, very fascinating and challenging issue.",
            "Now the other extreme would be when the diameter of the poor is a much smaller than the radius of gyration but barely bigger than size of the monomer that is going through.",
            "So I saw this base that is going through.",
            "In that case, the polymer chain will move as a single file mobility, and between these two extremes I can have the chain going like a hairpin, or like a slug depending upon the ratio of the diameter of the port to the radius gyration of the polymer.",
            "Now in this extreme example, the external context would be pushing this polymer through protein port, which would make like a Alpha hemolysin pore MSP airport, and that would constitute my presented talk and we can discuss this if you have more time later on.",
            "And if you have solid sanana ports where we can drill a little hole of certain duration of along the polar axis, we can have additional complications of this type.",
            "But there had been no lot of excellent data.",
            "When you look at those excellent data, the facts.",
            "These are facts, external facts.",
            "These facts are extremely rich and very challenging.",
            "That absolutely confusing the variety of data that we have gotten across this horizontal column.",
            "There's really.",
            "Amazing, and the question is can we think about it cleanly?",
            "Maybe more childlike, but try to get the governing principles, general principles which could help to organize these diverging exponential facts.",
            "I'll give you a few examples of this complicated facts and then we'll try to rationalize.",
            "Now let me take one of the typical experiments that people do in Alpha hemolysin pore.",
            "This single file port."
        ],
        [
            "Excellent so the XML setup is like this.",
            "There is a donor compartment and then receiver compartment and the donor compartment is a pasted with yeah a membrane black membrane phospholipid membrane.",
            "And then you did a little hole with your protein.",
            "In this particular case it's a toxin metapher talks and also humanizing port or a solid nanopore or MSP or its variant.",
            "Alright, so you make only one port.",
            "Concert date and then you have an electric solution.",
            "Measure the ionic current through this support.",
            "Since I have an electric charge carriers, potassium ion chloride ion electrolyte, I'll have a current.",
            "Then what I would do is I would introduce small amount of the polymer.",
            "In this particular case RNA or DNA or synthetic polyelectrolytes as in our case right put them in here and then when the chain now passes through this a little hole and that is the whole that is constituted at gate.",
            "Here and then, when the Parliament and goes through, here is going to block some space there for the number of charge carriers will be reduced.",
            "The number of charge carriers reduces.",
            "The current will go down so they trace would look like this.",
            "As originally reported, one of the early papers in here, the trace will look like this.",
            "This is the open port current right?",
            "And then suddenly there will be a blockade and then you measure the blockade duration of that blockade that gives that has some information about how long it takes for the polymer chain.",
            "Will reside in this channel.",
            "Whether it goes through or retracts back so it has something to do with the translocation time, which is a measure in here.",
            "So that's the extra mental setup.",
            "Now let's look at the data."
        ],
        [
            "It doesn't matter whether it is Alpha, hemolysin pore or the sister poor like Msba four or or whether it's a DNA that's being pushed through or sodium polystyrene sulfonate.",
            "That's being partial.",
            "Look at this data.",
            "This is the ionic current right?",
            "There's a blocked ionic current and this is the dwell time.",
            "We're talking about identical molecule.",
            "The identity of the molecule is the same in every data corresponds to one event.",
            "But this amazing stochastic city.",
            "Given voltage, look at this.",
            "These are all data points for identical molecule.",
            "Going through this and the key question is why is this so stochastic?",
            "That's that's a question.",
            "But this is a bit sore right when I have an eye of the needle and I have precise length of the polymer, same polymer, and pushing it through with some voltage.",
            "The time taken should be uniform because all molecules are identical.",
            "No, they are varying over many many orders of magnitude and time already.",
            "And then what is also surprising is this passage is rather quick.",
            "And it's so quick that is today we don't have the technology to measure the identity of the base as it's going through.",
            "So somehow if you understand this phenomenon, we may be able to slow it down to figure out how why this is going fast.",
            "Therefore, if it goes slow enough, we will be able to measure the identity of the base that is passing by.",
            "And why is this happening?",
            "So why do we have to do to look at this problem clearly?",
            "Let's think about the polymer.",
            "The Poly electrolyte."
        ],
        [
            "Is topological correlated because because of the chain connectivity, this monomer knows it is connected to this monomer?",
            "Because when I yank it out like this, this monomer will also follow through.",
            "Alright, so there is a topological connectivity that's long range within these selected scales and it's charged and we know that the charges systems are also long range correlated by Coulomb forces, right?",
            "So it is topological correlated and also because the electrostatics is also correlated.",
            "But in addition to that there is in a plasma it is this charge system because everything has to be electrically neutral, it is in a background often utilizing plasma.",
            "So there are lots of correlations are relative statics and its topological correlations, so they aren't they are coupled.",
            "For example, if the polymer chain isn't moving.",
            "Alright, and the counter ions which are attached to the backbone of the chain, the against the translation entropy of those ions are going to be around here, so the counter answers are going to be like address of this polymer chain.",
            "So this whole thing is like a quasiparticle.",
            "The polymer is not alone, so as a counter answer rearranging the confirmation of the Apollo mission would be changing.",
            "So in order to compute the entropy of this polymer chain I must have yourself consistent description of Parliament, the chain connectivity as well as the counterion in distribution.",
            "In a self consistent way so and I already told you that the entropy is one of the important things that we need to figure out.",
            "So this is an important thing that we have to know how to do it.",
            "When I left."
        ],
        [
            "Port the port is not done either.",
            "The port is complex too.",
            "If I look at the Alpha hemolysin pore.",
            "Please look at the color alone and there is a tremendous amount of charge heterogeneity.",
            "There are positive charges, negative charges, hydrophobicity, hydrophilicity so as a chain is trying to navigate through due to the applied field, it has to avoid all these bumps and avoid all those wells.",
            "It has somehow find the right path to go by as the chain is coming by the as a polymer.",
            "Charge this landscape is also changing, so there is there is a correlation between the landscape and the Department are going through and one has to work this out to make."
        ],
        [
            "Understanding of what's going on.",
            "But in addition to that, there is also flow, right?",
            "This is not in vacuum.",
            "There's a polymer chain is trying to go through the support.",
            "There is flow involved because it's a liquid, namely salty water.",
            "So in salty water with a finite viscosity.",
            "When I put the polymer chain in here, suppose I take one monomer and I produce some force field due to the hydrodynamics, and I put a force field that will travel through this.",
            "Do it by Navier Stokes and then give me the velocity field in here and as a response to this velocity field.",
            "This monomer would move again.",
            "So that will create the force due to local friction and that force will perpetuate through this fluid and influence the velocity of this monomer which in turn will ring the Bell over there and are not as a consequence of all this hydrodynamic coupling.",
            "The whole polymer chain would undergo dynamics and in the presence of the salt and counter ions same thing will happen when this creates here force.",
            "Due to electrostatic sore due to friction and that will create a perturbation on on say for example that monomer and again that perturbation coming from this charge would also perpetuate among all the monomers.",
            "So I have to worry about this a conformational dynamics through hydrodynamics which in the policies community is called as in dynamics and I must account for the cloud dynamics in addition and I had put them all together and work it out OK. You sounds very difficult to do but you know the community has been.",
            "Advance for the last six decades of how to deal with these things in a reasonable way in approximate way.",
            "But we can do it in a meaningful way and within 10% error with excellent data.",
            "OK then finally I told you that I had the 4th which are charged and that means that these charges on the ports are can be fixed.",
            "If that's the case, then the counter answer will come very close to the interface to maintain local electroneutrality, but on the other hand there mobile.",
            "And if I had in this geometry if I had a positive electrode there, this negatively charged accountants would like to move towards it.",
            "Possible echoed as they move.",
            "They will take water molecules with them, so there will be a flow field created by the surcharge.",
            "Permanent charges on the on the floor.",
            "So when this flow is moving in that direction if my night recharger polymer tries to go to the electrode there will be additional current which will try to drag the polymer chain.",
            "In write an we have to account for that additional flow coming from this Electro osmosis.",
            "This color osmosis.",
            "So I have to worry about Poly electrolyte.",
            "Physics, sorry about the poor physics I have to worry about hydrodynamics and also I have to worry about electrostatic coupling with hydrodynamics when we do all these things.",
            "Perhaps we have a reasonable way to think about what the exponents are teaching us and how we could contribute to make technology to come through.",
            "So let me it will take this theme of entropy instantly.",
            "If you have any questions, please feel free to interrupt you know my story is short, right?"
        ],
        [
            "OK, now let's look at the confirmation entropy.",
            "So I have large polymer chain in this room and this space is big enough.",
            "That is, a polymer chain can take lots of confirmations.",
            "Therefore the entropy is very large when the entropy is very large with a negative sign that being positive free energy would be low.",
            "Similar layer after the chain has gone through this gate, go to the other room and there's a big space over there as well, and then entropy is very large and free energy is low and I'm going to have an an electrochemical potential gradient to drive the polymer from this room to the other room there for the final free energy would be lower than the initial free energy OK, But as you can very clearly see in, it's a pathway the polymer chain right has to squeeze itself through the narrow gate, and that's not easy to.",
            "Number of confirmations is reduced.",
            "Because in the wall this space occupied by the wall, the chain cannot be there as a consequence of this number of confirmations lower therefore the free energy goes up.",
            "OK, so that's a typical fragile landscape, but the word this first of all, OK, this is.",
            "This makes sense based upon what we think about, and I said, is it really true in the context of the expulsion of a polymer chain from one domain to the other so?"
        ],
        [
            "It is a toy simulation.",
            "Suppose we take.",
            "Yeah, flexible Poly electrolyte and put it inside your vehicle inside an enclosed space and the calibrated.",
            "This is a simple simulation.",
            "You collaborated and open a little gate.",
            "Alright, at zero time and then watch it escape and I had thought that the chain is going to rush out.",
            "Right path in back to phages and things like that.",
            "Now the simulation showed that yes, one of the two ends is placed at the gate and then tries to come out.",
            "And to my surprise, it did not spill out.",
            "Instead it went back in.",
            "OK, that was really surprised because you know you shouldn't get out, but it doesn't.",
            "And then the game starts all over again after a few time units.",
            "One of those two ends is a place where they get tries to come out.",
            "No, it goes back again, so it makes about 300 attempts in this in these conditions and after that they chain puts enough number of monomers on the other side of the world.",
            "Then it slips out.",
            "OK, and we have seen this right.",
            "This is a multi color units but you know you could convert them later on.",
            "You can convert them into units for this kind of case.",
            "Suppose this would be something like a one Micron.",
            "Their timescale now would be something like a microsecond.",
            "One unit will be microseconds.",
            "Alright, So what is this?"
        ],
        [
            "This means.",
            "There's a nucleation growth because we're seeing this right.",
            "If I want to look at your system going from this state to this state, this is the kinetics of metastable state.",
            "So I have created a metastable, soon as you open the gate, they created metastable state and then how does escape from here to here?",
            "How does it go it in?",
            "There is a barrier nucleation barrier so it has to put enough number of monomers on the other side of the new creative that is healthy enough then that will grow and we're seeing this time and time again in the kinetics of 1st.",
            "Phase transitions, so the physics of kinetics of 1st order phase transitions are nucleation growth that we know very well in physical work can be implemented for the expulsion of A1 molecule, one macromolecule from one compartments compartment to the trans compartment right.",
            "OK, now let's see how that works.",
            "OK for typically, how do we think about this a barrier?",
            "So therefore I need to calculate this about."
        ],
        [
            "Yeah.",
            "Now let's look at your very famous polymer physics problem.",
            "Suppose I had a wall.",
            "Alright, I had a walk and then from the wall yeah tail comes out tail of certain number of monomers and we know how to calculate the number of confirmations of this retail.",
            "With the condition that the chain cannot penetrate through the wall in half space, we know how to compute the partition, some using filtering techniques and ignore that.",
            "But the answer is that the partition some goals, like the chain length, a length of the tail power, this magnetism, exponent surface, Micromax one gamma one.",
            "But for our purposes of a high salt in the experiment, that number would be 6.",
            "Nine OK, so therefore that's the chemical potential in this room.",
            "So I know how to compute the party.",
            "Therefore, I know how to compute the free energy.",
            "OK, so now what I will do is why did I?",
            "Why do we want to even think about this?"
        ],
        [
            "If I look at the translocation of a polymer chain through a little hole in an impenetrable wall, then I can imagine other changes going through.",
            "I can imagine this to be a pair of tails one tail in the receiver room, another tail in the donor room, and I know how to compute the positive sum in that.",
            "For that many monomers, and I know how to compute the partition in this monomers, I know the chemical potential here.",
            "I know the chemical potential there and therefore I know what the free energy of this confirmation is in the intermediate state of M monomers on the right side on the receiver side.",
            "Then the inoculation goes.",
            "Argument goes like this, right?",
            "Am can become M + 1 or it can become minus one or M -- 1 can be promoted to M or N + 1 can be demoted to M with the four elementary steps.",
            "Write down the probability of finding M at time T and it's a time evolution and this is, as most of you know, this is a democracy equation.",
            "Or equivalently, you can write this to be.",
            "The focal Planck equation, so therefore knowing what the free energy at AM and the derivative of that gives your drift, and then there is a local friction of this monomer against this support, and that's the diffusion local diffusion question monomer and the diffusion term that they drifted top.",
            "Once you write this one, it is exactly the same University class as are many of the problems that Steven did.",
            "You know, right?",
            "And it's exactly the same problem as a particle of the Brownian particles sedimenting under gravity.",
            "Ronan particles and diffusion at finite temperature and it due to the gravity they go down is exactly the same problem here.",
            "So this is like a gravitate right?",
            "This is electric field driving this polymer, and this is a diffusion that the chain is going back and forth.",
            "Now I have nucleated.",
            "The polymer changes certain number of monomers in there right by the stochastic process can go up and down depending on the magnitude of the diffusion of words with drift and eventually the number M would hit capital.",
            "N is the total length of the polymer chain, and that's the first passage type.",
            "The first time the chain is going to reach that value and that right, and then because from this equation we can compute the distribution of the first passage of time and then we can find the moments of this distribution function.",
            "And the algorithm translocation time can be calculated like this.",
            "So the recipient then is for a given problem Calculator free landscape for the translocation is a function of the translocation coordinate and put that in here and then it do this whole program product description and then get the distribution of the transportation time and then compute the average translocation time and compare with the experiments.",
            "So that's the that's the technique."
        ],
        [
            "The result is surprisingly simple, right?",
            "So here, that's free landscape you would get from such a simple calculation you can do with paper and pencil, and the distribution of the translocation time would look like this.",
            "It will sharply rise and then go up and come down like this exponentially coming down as a function of the translocation time.",
            "An in this asymptotically limit the average transportation time is directly proportional to chain length and inversely proportional voltage.",
            "No escape, this is what we get from this analytical calculation.",
            "This is more like a theorem.",
            "And in fact, it is observed in general.",
            "Right, it is observed in general.",
            "Now let me show you show you some tips."
        ],
        [
            "Results for example in this famous experiment, right, the histogram had this behavior right?",
            "So they had three peaks.",
            "This is a lifetime of a duration in here, and the number of blockheads so they had these three pics.",
            "So here is the first week we should ignore, but that's just the kissing of the molecule with the poor and they go away.",
            "They just don't penetrate through, just it goes there with the wrong orientation comes out.",
            "OK, so in fact.",
            "The duration has Nothing to do with molecular weight that is shown in here for.",
            "Are there different molecular weights corresponding that Pique their lifetime did not depend upon that, just the collision time?",
            "So let's ignore that the second pic is a translocation phenomenon, and 3rd is also a translocation phenomenon.",
            "And then if you take this speak and make the first moment and that depends upon chain, like the linearly, that is this line.",
            "And if you take that PIC measure as a function of chain length, mean first moment that's linear in time.",
            "So these two are called transactional translocation events.",
            "And then at the transportation time is proportional to in both of them.",
            "But the question is where do we get to two peaks?",
            "What's the reason for this?",
            "OK, and that was very difficult.",
            "In the simplest experiment and the rumor I showed you very broad distribution of the distribute the transportation times.",
            "That's because of this drawn out process where what could be the reason for these two peaks?",
            "Any suggestions?",
            "Rudy, do you have a suggestion?",
            "OK, so we didn't either right?",
            "So we decided to do a simulation because analytically we get one peak universal pick."
        ],
        [
            "So the simulation I'm not going to go into great details if there are published information please.",
            "You're most welcome to look at this.",
            "So we take the protein four and we can coarse grained them in the style of polymer physics.",
            "Every amino acid residue is taken to be on United Atom.",
            "The potentials are all documented very well known similarly for the polymer.",
            "For RNA each repeat unit is similar, or three beats one for the base, another for sugar, another phosphate phosphate group is a negative charge, different ADSL, etc.",
            "So that's the representation of this RNA.",
            "That would be the presentation of the protein for."
        ],
        [
            "And then and these are the potentials right for the for the RNA there is a bond stretching potential, bending potential, torsion potential, and one model protection correct?",
            "Typically in this external situations where we use a screen Coulomb interaction and then debacle, and then we take a Lennard Jones interaction before hydrophobic parts and then we take the Parliament the protein to be like this.",
            "We know the locations of positive charges.",
            "Charges from the protein port and then this fossil membrane is made of a dielectric constant of two and the solutions water salty water like 80.",
            "And then there's an external field.",
            "So what we do is we solve this large one equation.",
            "Therefore selfield comes from all these interactions and write a dielectric heterogeneity.",
            "There's a random force.",
            "The friction is satisfying fluctuation dissipation theorem.",
            "So you run this simulation."
        ],
        [
            "At the same time, we also do the classic argument of person learns plank that when I have a port on, the changes are passing through.",
            "So for any ion that is passing through the continuity equation is given by this, but the flux has two parts.",
            "One this is the diffusion part and the drift apart electrophoretic mobility part due to gradient of the potential.",
            "Now the gradient potential solved by Parsons equation, right?",
            "And then any charge coming from the.",
            "Polymer or from the port has to go into solving this puzzle.",
            "Bozeman equation and then I have this equation and then I have the dielectric mismatch Delta heterogeneity system because here it's two everywhere else is 80 and then from based upon these things we compute the ionic current as a polymer.",
            "Chain is going through the computer and strength."
        ],
        [
            "OK, so here is the trajectory of how this happens.",
            "So here is my polymer chain which is being pushed by an electric field, right?",
            "It goes not necessary like a head on into the port.",
            "It can even go like a hairpin and it rattles around inside this vestibule.",
            "The big funnel, like region and then puts its head through this beta barrel and then it doesn't come out right.",
            "It goes back and forth a little bit and then tries to come out.",
            "Right looks around little bit.",
            "Alright, and then it will slip up.",
            "Honey, do these simulations of thousands and thousands of times right, and then look at what is happening."
        ],
        [
            "And one more trajectory of this, I'll show you.",
            "And Meanwhile we also compute the ionic current.",
            "So the changes coming through and that is the open for current.",
            "Even with this simple description that is very similar to 130 pico amperes and measured in experiments.",
            "And as it goes through the beta barrel, only then I have this strong blockade.",
            "Of their current and then this noise that you see here is not noise.",
            "It is the polymer dynamics as a confirmation to changing the current is also fluctuate ING, so the correlation function of this say something about the dynamic is polymer and as you will see when the chain comes out, this will come back to the open for current."
        ],
        [
            "So how does a histogram look like?",
            "The histogram looks very much like in the experiments, but the advantage here is we can go and look at one event and ask why did that event.",
            "Took so long, whereas this event took short period of time to make a Long story short, those are long drawn events.",
            "Have something to do with this vestibule.",
            "I say totally the vestibule is big enough for the Parliament to reside and it's entropically confined, and therefore it actually can entropic trap in front of this beta.",
            "Barrel and stochastically, there are some events where it will directly go into the better, better in escape, so these two pics that we saw something to do with the existence of this.",
            "The vestibule region, because that acts as a secondary trap for the chain to recite there.",
            "So how do we test this?",
            "So get rid of it.",
            "In this simulation we can completely cut it out.",
            "Then I have only better barrel then this histogram in the scale is given here.",
            "That histogram now is transferred into this sharper Peak because now it's going only through beta barrel.",
            "So if you want to do the sequencing, Alpha hemolysin pore is probably not the best candidate because of this existence of vestibule.",
            "So probably solid nanopore is a better candidate where you have a narrow tube, so it can go through without participation with distribute.",
            "OK, now this thing let's a more investigation of."
        ],
        [
            "The ionic currents.",
            "So we went back and looked at the traces.",
            "So when you look at the ionic and traces.",
            "Right, so that would be the typical chart and what people were doing was they were trying to put a bin.",
            "Here they will draw a line there.",
            "Another line in here and calculate all these events and consider these programs so when we looked at it right, this is an expanded version of this.",
            "So when we looked at it, OK, Now we know that vestibular playing a role.",
            "We thought that when the chain goes into the vestibule, it resides there, right?",
            "That's why they blocked the current right, but not fully blocked occurrence.",
            "And then sometimes it comes back as this address shows.",
            "In this particular case, it goes into the vestibule and then it punches through the better barrel, then eventually comes out.",
            "OK.",
            "So this is the precursor state and then actual translocation, and here it went directly to the better, better.",
            "I met up.",
            "So what we decided to do was to counter these things from the experimental data and then counted these events and the problem."
        ],
        [
            "And what we found was, to our great surprise.",
            "Great surprise, right?",
            "Only those events depend on chain length like power 1 N power one.",
            "Alright, and these events did not depend upon changing at all, right?",
            "So therefore all these events, only those we must account to be actual translocation and the other events that are contributing here are failures.",
            "And how many of them are successful."
        ],
        [
            "Many of them are failures and this is a big shock right when we go to the usual conditions of pH of 7.5 using the experiments and what we found was almost 90% of the events don't make it.",
            "Alright, there only one small percentage of them.",
            "These are the ones which correspond to actual punching through the better, better than getting out and then here is the statement that even at very high voltage.",
            "Please remember that like a 25,000,000 walls will be like room temperature Katie when you drive like 150 million walls, right?",
            "That's a plenty of Katie.",
            "Lots of Fort, even there for this Alpha humanizing port.",
            "80% of them are failures.",
            "Only a very small percentage of our successful that came directly out of.",
            "Inspired by the simulation results of the participation with people.",
            "So how do we?",
            "How do we make this work?",
            "So we think about a little bit more."
        ],
        [
            "So here is when you look at the protein for decoration and that's the negatively charged.",
            "There's a net negative charge in here at the ring region and a pH of 7.5 the next night we charge is about to say I don't know negative 8, so suppose we would reducer charge.",
            "How do you reduce it?",
            "Because we know the sequence of these polypeptides which are making up constituting this approaching 4, so knowing their PKA values, theoretically we found out that if I lower my pH to be 4.",
            "And then I can reduce this negative charge barrier because the DNA is negatively charged.",
            "DNA is coming like this.",
            "I'm going trying to go through this yellow to static barrier.",
            "Suppose I demolish that barrier.",
            "Perhaps it will go through and that was the idea always.",
            "You could also do.",
            "Mutagenesis is really heavy work that's very, very hard to do.",
            "You can do messages for one site to do this very you know it's very quite labor intensive instead of the sellers simply changing pH and trans compartment in the receiver."
        ],
        [
            "That's what we did, and when we did that in our lab when we did that in Celsius 7.5 and we go to 4.5, what we find is the majority of the events and now are actually translocations.",
            "There is still there is some failure, but that's really very small amount.",
            "Now 80% of them actually go through.",
            "There are two such events right net 80 personal only about 5% are failures.",
            "90% actually go through.",
            "Only 5% are failures now.",
            "So by such a simple physical chemical argument of changing the pH.",
            "And Mother Nature uses all the time, right?",
            "We know that the proton pumps if pH gradients we use it, but here physical principle, right?",
            "Based upon just thinking we can make this process very, very quick and this is being used enough to push the polymer chains very effectively.",
            "Now let me switch gears to ask the following question.",
            "So far I have been focusing on how the chain is a penetrating through airport.",
            "Now imagine I have centimeter cubed vessel.",
            "And then I have a phospholipid membrane officer Micron layer and in there I drill like 1.2 nanometer whole.",
            "Right, the polymer chain living in this largest space much somehow search for that little hole and find their whole before it.",
            "Thread through right, and that is not a small task.",
            "Imagine in terms of scale of things this is really nontrivial.",
            "How does it do it?",
            "Because we know that they have looked at that race is we know that this happens, but how does a molecule find that or me as a technologies orifices?",
            "How do we bring the polymer China to the gate?"
        ],
        [
            "And experimentally we have some data.",
            "The data are the following right?",
            "So I know this trace is right and I measure the average duration of time between these events.",
            "Alright, and the reciprocal of that average duration is the capture rate, right?",
            "So the question is, what is the capture rate of this polymer given your small target?",
            "And this is a famous problem of small house key, right?",
            "Smaller house K looked at not for polyelectrolytes or not in this context, but he looked at what would be the capture rate for your small hole on a wall of some colloidal particles and particles coming through and he pointed out that it has something to do with the cross section of that hole and then it has something with the concentration of this.",
            "Colonial particles are the polymers and they also have something to do with diffusion coefficient of this polymer.",
            "This particle, and we know from stocks and Einstein, the diffusion coefficient is inversely proportional to the radius of the polymer and the radius of the polymer is now proportional to chain length power.",
            "Some exponent, like in these conditions then power Point 6.",
            "So therefore I would expect that the capture rate would be.",
            "Proportional to concentration but inversely related to molecular weight, an proportional cross sectional for the support cross section of the port is fixed for a particular equipment, so the major two major predictions would be is directly proportional consultation and inversely related to molecular weight."
        ],
        [
            "And here are the data.",
            "Look at this these later again.",
            "Very recent data right?",
            "So again I put together from various groups.",
            "So here as a functional voltage right there, the capture rate it increases the voltage and particularly the people with physics background would immediately recognize.",
            "It is very much like semiconductor physics.",
            "There's a barrier is trying to cross through right and then the barrier depends upon whether I was pushing from the frontal region into the transite or in the reverse direction, but nevertheless.",
            "It was a linear in concentration.",
            "OK, that's a small house key argument, right?",
            "Linear in concentration?",
            "Some other paper always linear in conservation.",
            "Some other people found that this capture rate as a function of voltage was a double exponential.",
            "For low voltage is exponential and higher voltages exponential same group of people.",
            "You know different time they found out that they capture rate is a linear.",
            "In a exponential voltage, 1st and linear in voltage for high voltages, but remarkably what they found was the capture.",
            "It increased with the molecular weight, right?",
            "Here is a dependence on molecular weight of the same data dependence.",
            "Our capture rate with molecular weight in a log rhythmic scale.",
            "So what they found was you need to change.",
            "You make the molecule bigger and bigger, the capture rate.",
            "Increases this exactly opposite of a small house key, right?",
            "And then eventually it doesn't depend upon molecular weight at all.",
            "Its independent molecular weight.",
            "OK man, you got to that many basis.",
            "Doesn't matter whether you make it big or small.",
            "These are all kind.",
            "Very surprising.",
            "How do we?",
            "How do you think about this so?"
        ],
        [
            "Again, let me look at this problem in general.",
            "So when I look at this problem, here is my poor.",
            "My polymer is a far away and then somehow I had to bring very close to this region of capture, right?",
            "And this polymer has to move a small Husky diffusion and also there is a weak electric field.",
            "So there is also drifted to so this mobility of this polymer chain is a combination of diffusion as well as electrical mobility.",
            "Then when it comes in here, maybe there are some flow fields as I told you before, like Ella automatic flow.",
            "Maybe the Parliament chain would be captured as rain comes in here due to some strong currents in front of the port.",
            "There's a capture region and then finally it will thread through.",
            "As I told you before.",
            "So there for free landscape would be something like this.",
            "The chain would come in here caught by the port and when it's caught the polymer chain is not jammed estate because the two ends of the chain are not necessarily with the right orientation to penetrate through the port and then it has a unravel itself.",
            "So there one in his place in here and that will take a huge of Entropic barrier.",
            "And then it will nucleator to make enough number of monomers on the right side.",
            "That's another barrier, little barrier there and then it will undergo another different diffusion through the raft and then come out.",
            "OK, so that's the general picture of Parliament location.",
            "But now I want to focus on this area to figure out some way to rationalize."
        ],
        [
            "Excellent facts, let's just go to the drawing board going to our elementary courses that we all learn and teach.",
            "OK, so this is a content equation.",
            "There's a flux.",
            "It has a diffusion and drift.",
            "And now let's check with the external facts for this equation, the.",
            "Diffusion coefficient.",
            "It's a given buy stocks Einstein no problem expertly we measure it right and now the electrophoretic mobility right?",
            "If we use again Einstein's relation that mobility divided by total charge of the polymer times the diffusion of the polymer should be that number at that temperature.",
            "You know this is a strokes disease.",
            "Hey Derek, you D is equal to that number.",
            "This is not true.",
            "For polymers.",
            "OK, what?"
        ],
        [
            "Let me show you the exact date.",
            "Right, the external data shows that that's the number that is expected, whether it's a single center DNA, double strand DNA, there's a very strong violation of this equation.",
            "This result.",
            "This is not my title.",
            "These are title of this paper.",
            "Alright, well they claimed that I instantly equation fails.",
            "Of course not right.",
            "It cannot fail.",
            "That means something is missing.",
            "OK, can anybody volunteer what could be missing?",
            "And the reason is, as I was trying to tell you in the introduction, the polymer is not alone League personal, only entity.",
            "It's a quasiparticle.",
            "They counter.",
            "Ions are also dressing it up so they are working together right.",
            "So one has to account for account for the coupling between counterion Sandy polymer because as a polymer most content cloud is also moving.",
            "So you have to do it."
        ],
        [
            "So, so the electromobility is independent polymer length.",
            "I told you right in the beginning, right in the capital pollicis is in the Pamela right.",
            "And that's the manifestation of this violation of Einstein's."
        ],
        [
            "And the reason is this one.",
            "So you have to account for the County on a dynamics versus and in addition to Parliament dynamics.",
            "If we do that in addition to this Einsteins factor there is the counter on cloud factor which was directed at work.",
            "So there is a counter on cloud factor.",
            "And then when you do this calculation as an extra day to the mobility is independent molecular weight over three orders of magnitude as shown experimentally.",
            "Or any order of magnitude and then they actual prefactor would depend upon the salt concentration.",
            "But independent of what constellation that is is always independent of the molecular weight.",
            "OK, so now let's look at the simple equation.",
            "The flux is given by diffusion and drift.",
            "If you do not account for this will have small house keys result where the capture rate would be inversely related to molecular weight.",
            "Now let's say for the time, let's assume that the gradient in concentrations week in such a way that they drifted term dominates.",
            "As soon as that dominates.",
            "The answer is very clear they capture rate.",
            "That's a flux that is a linear and concentration.",
            "That's one prediction and the linear in electric field.",
            "It is operating voltage.",
            "That is another prediction and it is independent molecular weight.",
            "That's another prediction.",
            "So as soon as I recognize these exporter facts right, then we know that if this dominates, these are the three results that must have come through and we saw them already in the experiments we saw them for very large voltages, right?",
            "We saw this really and concentration linear voltage an independent molecular weight.",
            "The panel that I showed you.",
            "So that's really the physics.",
            "Now let's."
        ],
        [
            "Look at the capture.",
            "When I look at this so that is the drift dominating drift, dominating, coming there.",
            "Now let's look at the capture right when I look at the capture here."
        ],
        [
            "Is a puzzle OK?",
            "Here are some external data coming from that particular work, so this is the power is about 50 nanometer coated with aluminum that is sitting right there so they their membrane like wall.",
            "There's a four right in the middle there and then outside this support in the donor compartment, fluorescently labeled DNA Lambda DNA molecules with that's the bright spots.",
            "Now what they found was there was a huge well of some 222.",
            "Micron 22 Micron radius, in which the polymer chains would jump double sided with jump into this world and disappear very quickly, but always this big well was maintained.",
            "There was an absorbing region of about 22 microns, 2.2 million.",
            "Humongous link this scale.",
            "How did this huge capture will come about?",
            "Any ideas?",
            "Let me pick on Rudy again.",
            "No, OK, now that was a big mysterious thing.",
            "How did this come about?",
            "And we're trying to do, you know, sequencing right and then?",
            "Meanwhile, you have this humongous or well that's being create."
        ],
        [
            "OK.",
            "Here the idea was is the following.",
            "In fact this is the right time that I must say something with Anton, once again, right when I met with him, he was telling me about his work on polymer chain under extensional flow, and he had computed the entropy or polymer chains.",
            "When you put the extension for, you know put an external.",
            "What happens polymer chain?",
            "How the problem is going to be formed?",
            "In fact this is the one that I use in my theory in those days to think about confirmations under hydrodynamic conditions.",
            "So it is very relevant to this problem in here, so here is my promotion coming in here.",
            "I told you that there is an electroosmotic flow and as a consequence its going to gradient so I can calculate what data flow."
        ],
        [
            "Is right, it's very easy right for this cylindrical geometry.",
            "I have pass on Bozeman equation.",
            "Let's not worry about mathematics.",
            "We can do it with paper and pencil, so local charge density can be."
        ],
        [
            "Suited once you have the local charge density do navier Stokes equation and get the fluid flux."
        ],
        [
            "Alright, so but the important thing is if I have a flex like this, there must be continuity of the flow, so the hemisphere, then half sphere in here if I look at the velocity at that location or from the port or square radius squared times you are velocity that should be exactly the same as a J, right?",
            "That means that the velocity field or the distance R should be 1 / R squared.",
            "That means velocity gradient should be on our R cubed.",
            "But then Anton and later on them showed.",
            "That if.",
            "I have a strong flow is a strong velocity gradient.",
            "The polymer chain can stretch, so therefore if there is a critical velocity gradient and if that is stretching, the velocity is stronger than that.",
            "Department will deform.",
            "So now let's look at that one.",
            "So if the if that velocity gradient is larger than one over rows time which it goes like RJ cubed, then I match this R and that RG.",
            "So if this or is comparable to that.",
            "And then the chain would stretch.",
            "So therefore the Parliament will come in here.",
            "If these are is comparable to that one, the politician is going to stretch.",
            "If it stretches, will jump into the world and disappear very quickly because."
        ],
        [
            "The entropy is reduced.",
            "And you can put all those numbers together.",
            "And here is a closer formula.",
            "Depends on the salt concentration, dielectric constant, temperature, viscosity and it depends upon the surface potential an.",
            "If you do this in the prediction is the capture radius is 3 times energy for Lambda DNA that .8 and they capture radius turns would be like a 2.4 microns and that's what we saw."
        ],
        [
            "OK, now in the interest of time I'm going to skip."
        ],
        [
            "A few things you can."
        ],
        [
            "Put the path barrier and compute everything."
        ],
        [
            "So kind of field theory, you can calculate all the."
        ],
        [
            "Things, and you put diffusion drift and barrier calculate the capture rate."
        ],
        [
            "And the conclusion is.",
            "The fan in general.",
            "There are two regimes and the four week voltages.",
            "The chain is a navigating through the airport by by an entropic barrier mechanism for high voltages is adrift.",
            "Dominant will be just rushing through there for capture rate would be exponential voltage.",
            "For low voltages and linear voltage for high voltages.",
            "In terms of molecular independence for high voltages or high molecular weight, it's adrift Dominator, but a low molecular weight.",
            "It's counter intuitive, but that's what the theory shows based upon all these arguments.",
            "And for intermediate to molecular weights, increase molecular weight and you get close forms, so in."
        ],
        [
            "Only then I want to show that we have to account for polymer entropy.",
            "We have to account for protein channels and it's a decoration and we also have to confirm flow.",
            "All of them contribute and it is possible to come up with one political frame to explain the variety of XML data which had been fragmented and puzzling.",
            "And now we're in a very reasonable position to really contribute to development of technology and also new experiments."
        ],
        [
            "So the same arguments are also true with biological context as well.",
            "So when I look at it, say, mitochondrion, a protein transport again, there's a recognition, there's approach, and then nucleation and and then it reading, and the mechanism is by adoption of.",
            "Appropriate appropriate chaperones which drives the emotion of this problem from left to right and the same technology that I described so far are being implemented to address these issues in a similar way.",
            "If you look at it, the translocation of well packed double sided DNA, enough age, how does it come out?",
            "Or how does it translocate?",
            "Same ideas that can be presented in these are biological context as well."
        ],
        [
            "So with that, let me close my presentation and I want to thank you for your attention and I'll be very happy to answer any questions you have.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's really a great honor for me to be in this very famous Institute, and in a serendipitous way.",
                    "label": 0
                },
                {
                    "sent": "I just discovered few minutes back that they found out this place is Anton Peterlin, whom I knew he was an extremely supportive scientist for me when I was starting my career.",
                    "label": 0
                },
                {
                    "sent": "And I very vividly remember.",
                    "label": 0
                },
                {
                    "sent": "The support and enthusiasm for science he had had and also the creativity that brought it to the polymer physics.",
                    "label": 0
                },
                {
                    "sent": "These are very very early days or polymer physics when people were even debating about the existence of Poly mercy had this great ideas about statistical mechanics of these polymers, and I think I'll have a remark to make about his contribution very quickly thought about his work.",
                    "label": 0
                },
                {
                    "sent": "In fact, in my thesis I refer to his work and my thesis as a young man was based related to his work on polymer.",
                    "label": 0
                },
                {
                    "sent": "Information, so it's really a great pleasure for me to be here and I want to thank the organizers for making this arrangement.",
                    "label": 0
                },
                {
                    "sent": "OK, so my topic today that I wish to share with you is about large macromolecules moving through space from one location to another location and it's like having a very large macromolecules in this room and trying to get through your small door into other big bigger room.",
                    "label": 0
                },
                {
                    "sent": "And that's basically the question that I want to think about and I want to share with you.",
                    "label": 0
                },
                {
                    "sent": "How we have been going about thinking about this issue and I have been very fortunate to had excellent graduate students who had shared this a burden of trying to figure this out over many years, and I'll pick a few items here and there and talk about the contributions from these people.",
                    "label": 0
                },
                {
                    "sent": "And indeed we need money to do the research.",
                    "label": 0
                },
                {
                    "sent": "And we need people to do research and this work that I'm going to be sharing with you is supported by National Institutes of Health and National Science Foundation of United States.",
                    "label": 0
                },
                {
                    "sent": "So what is the?",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Question I am interested in the following issue.",
                    "label": 0
                },
                {
                    "sent": "If I take mammalian cell I put my pointer anywhere on this mammalian cell.",
                    "label": 0
                },
                {
                    "sent": "I will meet an electrically charged large macromolecule.",
                    "label": 0
                },
                {
                    "sent": "And in fact, in order for this cell to function, these molecules have to move from one place to the other.",
                    "label": 0
                },
                {
                    "sent": "If I were to take Messenger RNA inside the nucleus, it has to come through this little hole an come out and give instructions for the synthesis of a protein.",
                    "label": 0
                },
                {
                    "sent": "For example, and everywhere else I have to make these molecules to move from one location to another location.",
                    "label": 0
                },
                {
                    "sent": "That's the way this cell functions, and as I speak, and as you would ask me some questions and I answer.",
                    "label": 0
                },
                {
                    "sent": "Many many many many macromolecules have migrated from one location under location.",
                    "label": 0
                },
                {
                    "sent": "During that small event, small duration of time.",
                    "label": 0
                },
                {
                    "sent": "So that's my question.",
                    "label": 0
                },
                {
                    "sent": "That's what I want to understand when I think we're more about this.",
                    "label": 0
                },
                {
                    "sent": "This is this transport is not taking place in isolation.",
                    "label": 0
                },
                {
                    "sent": "It's a very crowded environment and it's an electrolyte solution.",
                    "label": 0
                },
                {
                    "sent": "Then I call this to be cool.",
                    "label": 0
                },
                {
                    "sent": "Um, soup, it's very thick in terms of density as well as everywhere.",
                    "label": 0
                },
                {
                    "sent": "All charges there is also another remarkable thing about these systems.",
                    "label": 0
                },
                {
                    "sent": "If you look at the physiological temperature of any species, it's essentially fixed for us.",
                    "label": 0
                },
                {
                    "sent": "Given our temperature in absolutist Calvin, the error of 2% would be deadly, so the temperature is really essentially fixed in our physiological system, so unlike the traditional physics problems, the biological physics problems are not a zero temperature phenomenon.",
                    "label": 0
                },
                {
                    "sent": "High temperature phenomena.",
                    "label": 0
                },
                {
                    "sent": "There's a very narrow range of temperature with which we had to work with.",
                    "label": 0
                },
                {
                    "sent": "But then we know that the way these molecules have to migrate from one place to another place must be true free energy landscape.",
                    "label": 0
                },
                {
                    "sent": "There is no exception to the Boltzmann's law.",
                    "label": 0
                },
                {
                    "sent": "You know it has to be 3 landscape.",
                    "label": 0
                },
                {
                    "sent": "Then let's think about that formula and I have to keep this temperature fixed.",
                    "label": 0
                },
                {
                    "sent": "But I must have a large excursions in free energy landscape.",
                    "label": 0
                },
                {
                    "sent": "How does that happen?",
                    "label": 0
                },
                {
                    "sent": "It must happen through the entropy.",
                    "label": 0
                },
                {
                    "sent": "And what better candidate can we have to have to end a large amount of entropy and variations?",
                    "label": 0
                },
                {
                    "sent": "Entropy that is polymer?",
                    "label": 0
                },
                {
                    "sent": "If you take a chromosome for example, you know is able to change.",
                    "label": 0
                },
                {
                    "sent": "It's a confirmation from very big to small during the cell cycle and that accompanies humongous a changes in entropy, an contributing to the free landscape.",
                    "label": 0
                },
                {
                    "sent": "So therefore I must really deal with the confirmation entropy of these.",
                    "label": 0
                },
                {
                    "sent": "Ultimate change when I want to think about how these migrations take place.",
                    "label": 0
                },
                {
                    "sent": "Now we have to pay attention to the extra mental facts we talked over biology, friends and what they tell us is oh everything is specificity.",
                    "label": 0
                },
                {
                    "sent": "Because if I were to take one mutation of the protein, the behavior is going to be drastically different and it is true.",
                    "label": 0
                },
                {
                    "sent": "It is indeed true that we have to account for specificity.",
                    "label": 0
                },
                {
                    "sent": "But now what I'm going to do is in the in this context of.",
                    "label": 0
                },
                {
                    "sent": "Of accomplishment soft matter physics.",
                    "label": 0
                },
                {
                    "sent": "I'm going to think in terms of whether there are some general concepts from polymer physics that we can bring up first because of the large length scales involved and the conformational changes that are involved after addressing those things, we try to put specificity, and that's the attitude with which I'm going to present this story.",
                    "label": 1
                },
                {
                    "sent": "And please interrupt, you know, at anytime we can discuss more in detail about the marriage between general ideas and specific details of.",
                    "label": 0
                },
                {
                    "sent": "This polymer transport OK, so this is a general context and we can be lit.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "More polished and look for some specific cases as well, and if you take specific cases you know this is a famous example of phage containing double stranded DNA being pushed through a narrow channel into the victim.",
                    "label": 0
                },
                {
                    "sent": "You know how does this will take place or if you look at genomic exchange between the male bacterium and the female bacterium.",
                    "label": 0
                },
                {
                    "sent": "Here is your nanotube made up of possible charges.",
                    "label": 0
                },
                {
                    "sent": "Protein code, so there is the internal diameter is roughly about 2 nanometers and then the genomic material is pushed from the male to female through this enano capillary.",
                    "label": 0
                },
                {
                    "sent": "Or if you talk about the Messenger RNA getting out of the nucleus.",
                    "label": 0
                },
                {
                    "sent": "This is a nuclear pore and here is my Messenger RNA and that's going to wiggle through this very complex charge decorated entity and come out and then let's pay little bit more attention to this and the M RNA is.",
                    "label": 0
                },
                {
                    "sent": "Complex in with oppositely charged proteins in this very complicated form, and the typical size of this complex is about 50 nanometers, and the typical size of this agate is about 300 animators.",
                    "label": 0
                },
                {
                    "sent": "These are very large length scale entities, and I'm trying to figure out how this complex is going to come through, so this is an example where the length scales are so large and the tools that we have learned in polymer physics could be very useful because we're talking about large length scale phenomena, and that's again the attitude Y.",
                    "label": 0
                },
                {
                    "sent": "We are taking confirmation entropy as a thing.",
                    "label": 0
                },
                {
                    "sent": "In addition to this very interesting fundamental issues, there is also yeah societal pressure right now.",
                    "label": 0
                },
                {
                    "sent": "Which is it to figure out?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The genome very cheaply and very quickly.",
                    "label": 0
                },
                {
                    "sent": "You know what is the how to read the sequence of double stranded DNA given the genome and we want to do it very inexpensively.",
                    "label": 0
                },
                {
                    "sent": "And also we want to do this in a cheaper way and the premise is try to push your double sided DNA through a narrow four and ask if chain is being pushed through this in aeroport narrow hold you want to interrogate with some suitable techniques and then a measure.",
                    "label": 0
                },
                {
                    "sent": "The identity of that base that is passing through right?",
                    "label": 0
                },
                {
                    "sent": "So from technology point of view, as well as a fundamental biological point of view, this question of how molecules move from one domain to another domain is of interest to me.",
                    "label": 0
                },
                {
                    "sent": "Now let's go to the drawing board and think about this problem when we think about this problem, the problem is already.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Quite complicated.",
                    "label": 0
                },
                {
                    "sent": "Let's take the simplest case of taking a polymer charger polymer like a DNA or approaching.",
                    "label": 0
                },
                {
                    "sent": "Let's takes a single center DNA double stranded DNA, and then it has some typical size, which is a radius of gyration.",
                    "label": 0
                },
                {
                    "sent": "And let me push through will push it through your channel or a big tube capillary and the diameter of this Kappel Aries are larger than the size of the polymer.",
                    "label": 0
                },
                {
                    "sent": "In that case it is like a solution.",
                    "label": 0
                },
                {
                    "sent": "So I have a.",
                    "label": 0
                },
                {
                    "sent": "Two electrodes.",
                    "label": 0
                },
                {
                    "sent": "I have a solution.",
                    "label": 0
                },
                {
                    "sent": "Electrolyte solution.",
                    "label": 0
                },
                {
                    "sent": "Put your charger polymer and with an electric field.",
                    "label": 0
                },
                {
                    "sent": "I'm trying to move these molecules from one place to another place already.",
                    "label": 0
                },
                {
                    "sent": "The results are very enigmatic.",
                    "label": 0
                },
                {
                    "sent": "For example counter intuition.",
                    "label": 0
                },
                {
                    "sent": "They polymer speed is independent of length and I could put two polymer chains or one is only 1000 basis, other one is million basis and with the field I want to see when they are going to go to the other world, both of them reach the wall at the same time.",
                    "label": 1
                },
                {
                    "sent": "That's the reason why we do not use capital electric forces for separating DNA.",
                    "label": 0
                },
                {
                    "sent": "We do generative forces because we put a blockade so that they would go to different speeds.",
                    "label": 0
                },
                {
                    "sent": "But in solutions they move at the same speed.",
                    "label": 0
                },
                {
                    "sent": "This already very, very fascinating and challenging issue.",
                    "label": 0
                },
                {
                    "sent": "Now the other extreme would be when the diameter of the poor is a much smaller than the radius of gyration but barely bigger than size of the monomer that is going through.",
                    "label": 0
                },
                {
                    "sent": "So I saw this base that is going through.",
                    "label": 0
                },
                {
                    "sent": "In that case, the polymer chain will move as a single file mobility, and between these two extremes I can have the chain going like a hairpin, or like a slug depending upon the ratio of the diameter of the port to the radius gyration of the polymer.",
                    "label": 0
                },
                {
                    "sent": "Now in this extreme example, the external context would be pushing this polymer through protein port, which would make like a Alpha hemolysin pore MSP airport, and that would constitute my presented talk and we can discuss this if you have more time later on.",
                    "label": 0
                },
                {
                    "sent": "And if you have solid sanana ports where we can drill a little hole of certain duration of along the polar axis, we can have additional complications of this type.",
                    "label": 0
                },
                {
                    "sent": "But there had been no lot of excellent data.",
                    "label": 0
                },
                {
                    "sent": "When you look at those excellent data, the facts.",
                    "label": 0
                },
                {
                    "sent": "These are facts, external facts.",
                    "label": 0
                },
                {
                    "sent": "These facts are extremely rich and very challenging.",
                    "label": 0
                },
                {
                    "sent": "That absolutely confusing the variety of data that we have gotten across this horizontal column.",
                    "label": 0
                },
                {
                    "sent": "There's really.",
                    "label": 0
                },
                {
                    "sent": "Amazing, and the question is can we think about it cleanly?",
                    "label": 0
                },
                {
                    "sent": "Maybe more childlike, but try to get the governing principles, general principles which could help to organize these diverging exponential facts.",
                    "label": 0
                },
                {
                    "sent": "I'll give you a few examples of this complicated facts and then we'll try to rationalize.",
                    "label": 0
                },
                {
                    "sent": "Now let me take one of the typical experiments that people do in Alpha hemolysin pore.",
                    "label": 0
                },
                {
                    "sent": "This single file port.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Excellent so the XML setup is like this.",
                    "label": 0
                },
                {
                    "sent": "There is a donor compartment and then receiver compartment and the donor compartment is a pasted with yeah a membrane black membrane phospholipid membrane.",
                    "label": 0
                },
                {
                    "sent": "And then you did a little hole with your protein.",
                    "label": 0
                },
                {
                    "sent": "In this particular case it's a toxin metapher talks and also humanizing port or a solid nanopore or MSP or its variant.",
                    "label": 0
                },
                {
                    "sent": "Alright, so you make only one port.",
                    "label": 0
                },
                {
                    "sent": "Concert date and then you have an electric solution.",
                    "label": 0
                },
                {
                    "sent": "Measure the ionic current through this support.",
                    "label": 0
                },
                {
                    "sent": "Since I have an electric charge carriers, potassium ion chloride ion electrolyte, I'll have a current.",
                    "label": 0
                },
                {
                    "sent": "Then what I would do is I would introduce small amount of the polymer.",
                    "label": 0
                },
                {
                    "sent": "In this particular case RNA or DNA or synthetic polyelectrolytes as in our case right put them in here and then when the chain now passes through this a little hole and that is the whole that is constituted at gate.",
                    "label": 0
                },
                {
                    "sent": "Here and then, when the Parliament and goes through, here is going to block some space there for the number of charge carriers will be reduced.",
                    "label": 0
                },
                {
                    "sent": "The number of charge carriers reduces.",
                    "label": 0
                },
                {
                    "sent": "The current will go down so they trace would look like this.",
                    "label": 0
                },
                {
                    "sent": "As originally reported, one of the early papers in here, the trace will look like this.",
                    "label": 0
                },
                {
                    "sent": "This is the open port current right?",
                    "label": 0
                },
                {
                    "sent": "And then suddenly there will be a blockade and then you measure the blockade duration of that blockade that gives that has some information about how long it takes for the polymer chain.",
                    "label": 0
                },
                {
                    "sent": "Will reside in this channel.",
                    "label": 0
                },
                {
                    "sent": "Whether it goes through or retracts back so it has something to do with the translocation time, which is a measure in here.",
                    "label": 0
                },
                {
                    "sent": "So that's the extra mental setup.",
                    "label": 0
                },
                {
                    "sent": "Now let's look at the data.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It doesn't matter whether it is Alpha, hemolysin pore or the sister poor like Msba four or or whether it's a DNA that's being pushed through or sodium polystyrene sulfonate.",
                    "label": 0
                },
                {
                    "sent": "That's being partial.",
                    "label": 0
                },
                {
                    "sent": "Look at this data.",
                    "label": 0
                },
                {
                    "sent": "This is the ionic current right?",
                    "label": 0
                },
                {
                    "sent": "There's a blocked ionic current and this is the dwell time.",
                    "label": 0
                },
                {
                    "sent": "We're talking about identical molecule.",
                    "label": 0
                },
                {
                    "sent": "The identity of the molecule is the same in every data corresponds to one event.",
                    "label": 0
                },
                {
                    "sent": "But this amazing stochastic city.",
                    "label": 0
                },
                {
                    "sent": "Given voltage, look at this.",
                    "label": 0
                },
                {
                    "sent": "These are all data points for identical molecule.",
                    "label": 0
                },
                {
                    "sent": "Going through this and the key question is why is this so stochastic?",
                    "label": 0
                },
                {
                    "sent": "That's that's a question.",
                    "label": 0
                },
                {
                    "sent": "But this is a bit sore right when I have an eye of the needle and I have precise length of the polymer, same polymer, and pushing it through with some voltage.",
                    "label": 0
                },
                {
                    "sent": "The time taken should be uniform because all molecules are identical.",
                    "label": 0
                },
                {
                    "sent": "No, they are varying over many many orders of magnitude and time already.",
                    "label": 0
                },
                {
                    "sent": "And then what is also surprising is this passage is rather quick.",
                    "label": 0
                },
                {
                    "sent": "And it's so quick that is today we don't have the technology to measure the identity of the base as it's going through.",
                    "label": 0
                },
                {
                    "sent": "So somehow if you understand this phenomenon, we may be able to slow it down to figure out how why this is going fast.",
                    "label": 0
                },
                {
                    "sent": "Therefore, if it goes slow enough, we will be able to measure the identity of the base that is passing by.",
                    "label": 0
                },
                {
                    "sent": "And why is this happening?",
                    "label": 0
                },
                {
                    "sent": "So why do we have to do to look at this problem clearly?",
                    "label": 0
                },
                {
                    "sent": "Let's think about the polymer.",
                    "label": 0
                },
                {
                    "sent": "The Poly electrolyte.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is topological correlated because because of the chain connectivity, this monomer knows it is connected to this monomer?",
                    "label": 0
                },
                {
                    "sent": "Because when I yank it out like this, this monomer will also follow through.",
                    "label": 0
                },
                {
                    "sent": "Alright, so there is a topological connectivity that's long range within these selected scales and it's charged and we know that the charges systems are also long range correlated by Coulomb forces, right?",
                    "label": 0
                },
                {
                    "sent": "So it is topological correlated and also because the electrostatics is also correlated.",
                    "label": 0
                },
                {
                    "sent": "But in addition to that there is in a plasma it is this charge system because everything has to be electrically neutral, it is in a background often utilizing plasma.",
                    "label": 0
                },
                {
                    "sent": "So there are lots of correlations are relative statics and its topological correlations, so they aren't they are coupled.",
                    "label": 0
                },
                {
                    "sent": "For example, if the polymer chain isn't moving.",
                    "label": 0
                },
                {
                    "sent": "Alright, and the counter ions which are attached to the backbone of the chain, the against the translation entropy of those ions are going to be around here, so the counter answers are going to be like address of this polymer chain.",
                    "label": 0
                },
                {
                    "sent": "So this whole thing is like a quasiparticle.",
                    "label": 0
                },
                {
                    "sent": "The polymer is not alone, so as a counter answer rearranging the confirmation of the Apollo mission would be changing.",
                    "label": 0
                },
                {
                    "sent": "So in order to compute the entropy of this polymer chain I must have yourself consistent description of Parliament, the chain connectivity as well as the counterion in distribution.",
                    "label": 0
                },
                {
                    "sent": "In a self consistent way so and I already told you that the entropy is one of the important things that we need to figure out.",
                    "label": 0
                },
                {
                    "sent": "So this is an important thing that we have to know how to do it.",
                    "label": 0
                },
                {
                    "sent": "When I left.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Port the port is not done either.",
                    "label": 0
                },
                {
                    "sent": "The port is complex too.",
                    "label": 1
                },
                {
                    "sent": "If I look at the Alpha hemolysin pore.",
                    "label": 0
                },
                {
                    "sent": "Please look at the color alone and there is a tremendous amount of charge heterogeneity.",
                    "label": 0
                },
                {
                    "sent": "There are positive charges, negative charges, hydrophobicity, hydrophilicity so as a chain is trying to navigate through due to the applied field, it has to avoid all these bumps and avoid all those wells.",
                    "label": 0
                },
                {
                    "sent": "It has somehow find the right path to go by as the chain is coming by the as a polymer.",
                    "label": 0
                },
                {
                    "sent": "Charge this landscape is also changing, so there is there is a correlation between the landscape and the Department are going through and one has to work this out to make.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Understanding of what's going on.",
                    "label": 0
                },
                {
                    "sent": "But in addition to that, there is also flow, right?",
                    "label": 0
                },
                {
                    "sent": "This is not in vacuum.",
                    "label": 0
                },
                {
                    "sent": "There's a polymer chain is trying to go through the support.",
                    "label": 0
                },
                {
                    "sent": "There is flow involved because it's a liquid, namely salty water.",
                    "label": 0
                },
                {
                    "sent": "So in salty water with a finite viscosity.",
                    "label": 0
                },
                {
                    "sent": "When I put the polymer chain in here, suppose I take one monomer and I produce some force field due to the hydrodynamics, and I put a force field that will travel through this.",
                    "label": 0
                },
                {
                    "sent": "Do it by Navier Stokes and then give me the velocity field in here and as a response to this velocity field.",
                    "label": 0
                },
                {
                    "sent": "This monomer would move again.",
                    "label": 0
                },
                {
                    "sent": "So that will create the force due to local friction and that force will perpetuate through this fluid and influence the velocity of this monomer which in turn will ring the Bell over there and are not as a consequence of all this hydrodynamic coupling.",
                    "label": 0
                },
                {
                    "sent": "The whole polymer chain would undergo dynamics and in the presence of the salt and counter ions same thing will happen when this creates here force.",
                    "label": 0
                },
                {
                    "sent": "Due to electrostatic sore due to friction and that will create a perturbation on on say for example that monomer and again that perturbation coming from this charge would also perpetuate among all the monomers.",
                    "label": 0
                },
                {
                    "sent": "So I have to worry about this a conformational dynamics through hydrodynamics which in the policies community is called as in dynamics and I must account for the cloud dynamics in addition and I had put them all together and work it out OK. You sounds very difficult to do but you know the community has been.",
                    "label": 0
                },
                {
                    "sent": "Advance for the last six decades of how to deal with these things in a reasonable way in approximate way.",
                    "label": 0
                },
                {
                    "sent": "But we can do it in a meaningful way and within 10% error with excellent data.",
                    "label": 0
                },
                {
                    "sent": "OK then finally I told you that I had the 4th which are charged and that means that these charges on the ports are can be fixed.",
                    "label": 0
                },
                {
                    "sent": "If that's the case, then the counter answer will come very close to the interface to maintain local electroneutrality, but on the other hand there mobile.",
                    "label": 0
                },
                {
                    "sent": "And if I had in this geometry if I had a positive electrode there, this negatively charged accountants would like to move towards it.",
                    "label": 0
                },
                {
                    "sent": "Possible echoed as they move.",
                    "label": 0
                },
                {
                    "sent": "They will take water molecules with them, so there will be a flow field created by the surcharge.",
                    "label": 0
                },
                {
                    "sent": "Permanent charges on the on the floor.",
                    "label": 0
                },
                {
                    "sent": "So when this flow is moving in that direction if my night recharger polymer tries to go to the electrode there will be additional current which will try to drag the polymer chain.",
                    "label": 0
                },
                {
                    "sent": "In write an we have to account for that additional flow coming from this Electro osmosis.",
                    "label": 0
                },
                {
                    "sent": "This color osmosis.",
                    "label": 0
                },
                {
                    "sent": "So I have to worry about Poly electrolyte.",
                    "label": 0
                },
                {
                    "sent": "Physics, sorry about the poor physics I have to worry about hydrodynamics and also I have to worry about electrostatic coupling with hydrodynamics when we do all these things.",
                    "label": 0
                },
                {
                    "sent": "Perhaps we have a reasonable way to think about what the exponents are teaching us and how we could contribute to make technology to come through.",
                    "label": 0
                },
                {
                    "sent": "So let me it will take this theme of entropy instantly.",
                    "label": 0
                },
                {
                    "sent": "If you have any questions, please feel free to interrupt you know my story is short, right?",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, now let's look at the confirmation entropy.",
                    "label": 0
                },
                {
                    "sent": "So I have large polymer chain in this room and this space is big enough.",
                    "label": 0
                },
                {
                    "sent": "That is, a polymer chain can take lots of confirmations.",
                    "label": 0
                },
                {
                    "sent": "Therefore the entropy is very large when the entropy is very large with a negative sign that being positive free energy would be low.",
                    "label": 0
                },
                {
                    "sent": "Similar layer after the chain has gone through this gate, go to the other room and there's a big space over there as well, and then entropy is very large and free energy is low and I'm going to have an an electrochemical potential gradient to drive the polymer from this room to the other room there for the final free energy would be lower than the initial free energy OK, But as you can very clearly see in, it's a pathway the polymer chain right has to squeeze itself through the narrow gate, and that's not easy to.",
                    "label": 0
                },
                {
                    "sent": "Number of confirmations is reduced.",
                    "label": 0
                },
                {
                    "sent": "Because in the wall this space occupied by the wall, the chain cannot be there as a consequence of this number of confirmations lower therefore the free energy goes up.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's a typical fragile landscape, but the word this first of all, OK, this is.",
                    "label": 0
                },
                {
                    "sent": "This makes sense based upon what we think about, and I said, is it really true in the context of the expulsion of a polymer chain from one domain to the other so?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is a toy simulation.",
                    "label": 0
                },
                {
                    "sent": "Suppose we take.",
                    "label": 0
                },
                {
                    "sent": "Yeah, flexible Poly electrolyte and put it inside your vehicle inside an enclosed space and the calibrated.",
                    "label": 0
                },
                {
                    "sent": "This is a simple simulation.",
                    "label": 0
                },
                {
                    "sent": "You collaborated and open a little gate.",
                    "label": 0
                },
                {
                    "sent": "Alright, at zero time and then watch it escape and I had thought that the chain is going to rush out.",
                    "label": 0
                },
                {
                    "sent": "Right path in back to phages and things like that.",
                    "label": 0
                },
                {
                    "sent": "Now the simulation showed that yes, one of the two ends is placed at the gate and then tries to come out.",
                    "label": 0
                },
                {
                    "sent": "And to my surprise, it did not spill out.",
                    "label": 0
                },
                {
                    "sent": "Instead it went back in.",
                    "label": 0
                },
                {
                    "sent": "OK, that was really surprised because you know you shouldn't get out, but it doesn't.",
                    "label": 0
                },
                {
                    "sent": "And then the game starts all over again after a few time units.",
                    "label": 0
                },
                {
                    "sent": "One of those two ends is a place where they get tries to come out.",
                    "label": 0
                },
                {
                    "sent": "No, it goes back again, so it makes about 300 attempts in this in these conditions and after that they chain puts enough number of monomers on the other side of the world.",
                    "label": 0
                },
                {
                    "sent": "Then it slips out.",
                    "label": 0
                },
                {
                    "sent": "OK, and we have seen this right.",
                    "label": 0
                },
                {
                    "sent": "This is a multi color units but you know you could convert them later on.",
                    "label": 0
                },
                {
                    "sent": "You can convert them into units for this kind of case.",
                    "label": 0
                },
                {
                    "sent": "Suppose this would be something like a one Micron.",
                    "label": 0
                },
                {
                    "sent": "Their timescale now would be something like a microsecond.",
                    "label": 0
                },
                {
                    "sent": "One unit will be microseconds.",
                    "label": 0
                },
                {
                    "sent": "Alright, So what is this?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This means.",
                    "label": 0
                },
                {
                    "sent": "There's a nucleation growth because we're seeing this right.",
                    "label": 0
                },
                {
                    "sent": "If I want to look at your system going from this state to this state, this is the kinetics of metastable state.",
                    "label": 0
                },
                {
                    "sent": "So I have created a metastable, soon as you open the gate, they created metastable state and then how does escape from here to here?",
                    "label": 0
                },
                {
                    "sent": "How does it go it in?",
                    "label": 0
                },
                {
                    "sent": "There is a barrier nucleation barrier so it has to put enough number of monomers on the other side of the new creative that is healthy enough then that will grow and we're seeing this time and time again in the kinetics of 1st.",
                    "label": 0
                },
                {
                    "sent": "Phase transitions, so the physics of kinetics of 1st order phase transitions are nucleation growth that we know very well in physical work can be implemented for the expulsion of A1 molecule, one macromolecule from one compartments compartment to the trans compartment right.",
                    "label": 0
                },
                {
                    "sent": "OK, now let's see how that works.",
                    "label": 0
                },
                {
                    "sent": "OK for typically, how do we think about this a barrier?",
                    "label": 0
                },
                {
                    "sent": "So therefore I need to calculate this about.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Now let's look at your very famous polymer physics problem.",
                    "label": 0
                },
                {
                    "sent": "Suppose I had a wall.",
                    "label": 0
                },
                {
                    "sent": "Alright, I had a walk and then from the wall yeah tail comes out tail of certain number of monomers and we know how to calculate the number of confirmations of this retail.",
                    "label": 0
                },
                {
                    "sent": "With the condition that the chain cannot penetrate through the wall in half space, we know how to compute the partition, some using filtering techniques and ignore that.",
                    "label": 0
                },
                {
                    "sent": "But the answer is that the partition some goals, like the chain length, a length of the tail power, this magnetism, exponent surface, Micromax one gamma one.",
                    "label": 0
                },
                {
                    "sent": "But for our purposes of a high salt in the experiment, that number would be 6.",
                    "label": 1
                },
                {
                    "sent": "Nine OK, so therefore that's the chemical potential in this room.",
                    "label": 0
                },
                {
                    "sent": "So I know how to compute the party.",
                    "label": 1
                },
                {
                    "sent": "Therefore, I know how to compute the free energy.",
                    "label": 0
                },
                {
                    "sent": "OK, so now what I will do is why did I?",
                    "label": 0
                },
                {
                    "sent": "Why do we want to even think about this?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If I look at the translocation of a polymer chain through a little hole in an impenetrable wall, then I can imagine other changes going through.",
                    "label": 0
                },
                {
                    "sent": "I can imagine this to be a pair of tails one tail in the receiver room, another tail in the donor room, and I know how to compute the positive sum in that.",
                    "label": 0
                },
                {
                    "sent": "For that many monomers, and I know how to compute the partition in this monomers, I know the chemical potential here.",
                    "label": 0
                },
                {
                    "sent": "I know the chemical potential there and therefore I know what the free energy of this confirmation is in the intermediate state of M monomers on the right side on the receiver side.",
                    "label": 0
                },
                {
                    "sent": "Then the inoculation goes.",
                    "label": 0
                },
                {
                    "sent": "Argument goes like this, right?",
                    "label": 0
                },
                {
                    "sent": "Am can become M + 1 or it can become minus one or M -- 1 can be promoted to M or N + 1 can be demoted to M with the four elementary steps.",
                    "label": 0
                },
                {
                    "sent": "Write down the probability of finding M at time T and it's a time evolution and this is, as most of you know, this is a democracy equation.",
                    "label": 0
                },
                {
                    "sent": "Or equivalently, you can write this to be.",
                    "label": 0
                },
                {
                    "sent": "The focal Planck equation, so therefore knowing what the free energy at AM and the derivative of that gives your drift, and then there is a local friction of this monomer against this support, and that's the diffusion local diffusion question monomer and the diffusion term that they drifted top.",
                    "label": 0
                },
                {
                    "sent": "Once you write this one, it is exactly the same University class as are many of the problems that Steven did.",
                    "label": 0
                },
                {
                    "sent": "You know, right?",
                    "label": 0
                },
                {
                    "sent": "And it's exactly the same problem as a particle of the Brownian particles sedimenting under gravity.",
                    "label": 0
                },
                {
                    "sent": "Ronan particles and diffusion at finite temperature and it due to the gravity they go down is exactly the same problem here.",
                    "label": 0
                },
                {
                    "sent": "So this is like a gravitate right?",
                    "label": 0
                },
                {
                    "sent": "This is electric field driving this polymer, and this is a diffusion that the chain is going back and forth.",
                    "label": 0
                },
                {
                    "sent": "Now I have nucleated.",
                    "label": 0
                },
                {
                    "sent": "The polymer changes certain number of monomers in there right by the stochastic process can go up and down depending on the magnitude of the diffusion of words with drift and eventually the number M would hit capital.",
                    "label": 0
                },
                {
                    "sent": "N is the total length of the polymer chain, and that's the first passage type.",
                    "label": 0
                },
                {
                    "sent": "The first time the chain is going to reach that value and that right, and then because from this equation we can compute the distribution of the first passage of time and then we can find the moments of this distribution function.",
                    "label": 0
                },
                {
                    "sent": "And the algorithm translocation time can be calculated like this.",
                    "label": 0
                },
                {
                    "sent": "So the recipient then is for a given problem Calculator free landscape for the translocation is a function of the translocation coordinate and put that in here and then it do this whole program product description and then get the distribution of the transportation time and then compute the average translocation time and compare with the experiments.",
                    "label": 0
                },
                {
                    "sent": "So that's the that's the technique.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The result is surprisingly simple, right?",
                    "label": 0
                },
                {
                    "sent": "So here, that's free landscape you would get from such a simple calculation you can do with paper and pencil, and the distribution of the translocation time would look like this.",
                    "label": 0
                },
                {
                    "sent": "It will sharply rise and then go up and come down like this exponentially coming down as a function of the translocation time.",
                    "label": 0
                },
                {
                    "sent": "An in this asymptotically limit the average transportation time is directly proportional to chain length and inversely proportional voltage.",
                    "label": 0
                },
                {
                    "sent": "No escape, this is what we get from this analytical calculation.",
                    "label": 0
                },
                {
                    "sent": "This is more like a theorem.",
                    "label": 0
                },
                {
                    "sent": "And in fact, it is observed in general.",
                    "label": 0
                },
                {
                    "sent": "Right, it is observed in general.",
                    "label": 0
                },
                {
                    "sent": "Now let me show you show you some tips.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Results for example in this famous experiment, right, the histogram had this behavior right?",
                    "label": 0
                },
                {
                    "sent": "So they had three peaks.",
                    "label": 0
                },
                {
                    "sent": "This is a lifetime of a duration in here, and the number of blockheads so they had these three pics.",
                    "label": 0
                },
                {
                    "sent": "So here is the first week we should ignore, but that's just the kissing of the molecule with the poor and they go away.",
                    "label": 0
                },
                {
                    "sent": "They just don't penetrate through, just it goes there with the wrong orientation comes out.",
                    "label": 0
                },
                {
                    "sent": "OK, so in fact.",
                    "label": 0
                },
                {
                    "sent": "The duration has Nothing to do with molecular weight that is shown in here for.",
                    "label": 0
                },
                {
                    "sent": "Are there different molecular weights corresponding that Pique their lifetime did not depend upon that, just the collision time?",
                    "label": 0
                },
                {
                    "sent": "So let's ignore that the second pic is a translocation phenomenon, and 3rd is also a translocation phenomenon.",
                    "label": 0
                },
                {
                    "sent": "And then if you take this speak and make the first moment and that depends upon chain, like the linearly, that is this line.",
                    "label": 0
                },
                {
                    "sent": "And if you take that PIC measure as a function of chain length, mean first moment that's linear in time.",
                    "label": 0
                },
                {
                    "sent": "So these two are called transactional translocation events.",
                    "label": 0
                },
                {
                    "sent": "And then at the transportation time is proportional to in both of them.",
                    "label": 0
                },
                {
                    "sent": "But the question is where do we get to two peaks?",
                    "label": 0
                },
                {
                    "sent": "What's the reason for this?",
                    "label": 0
                },
                {
                    "sent": "OK, and that was very difficult.",
                    "label": 0
                },
                {
                    "sent": "In the simplest experiment and the rumor I showed you very broad distribution of the distribute the transportation times.",
                    "label": 0
                },
                {
                    "sent": "That's because of this drawn out process where what could be the reason for these two peaks?",
                    "label": 0
                },
                {
                    "sent": "Any suggestions?",
                    "label": 0
                },
                {
                    "sent": "Rudy, do you have a suggestion?",
                    "label": 0
                },
                {
                    "sent": "OK, so we didn't either right?",
                    "label": 0
                },
                {
                    "sent": "So we decided to do a simulation because analytically we get one peak universal pick.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the simulation I'm not going to go into great details if there are published information please.",
                    "label": 0
                },
                {
                    "sent": "You're most welcome to look at this.",
                    "label": 0
                },
                {
                    "sent": "So we take the protein four and we can coarse grained them in the style of polymer physics.",
                    "label": 0
                },
                {
                    "sent": "Every amino acid residue is taken to be on United Atom.",
                    "label": 0
                },
                {
                    "sent": "The potentials are all documented very well known similarly for the polymer.",
                    "label": 0
                },
                {
                    "sent": "For RNA each repeat unit is similar, or three beats one for the base, another for sugar, another phosphate phosphate group is a negative charge, different ADSL, etc.",
                    "label": 0
                },
                {
                    "sent": "So that's the representation of this RNA.",
                    "label": 0
                },
                {
                    "sent": "That would be the presentation of the protein for.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then and these are the potentials right for the for the RNA there is a bond stretching potential, bending potential, torsion potential, and one model protection correct?",
                    "label": 0
                },
                {
                    "sent": "Typically in this external situations where we use a screen Coulomb interaction and then debacle, and then we take a Lennard Jones interaction before hydrophobic parts and then we take the Parliament the protein to be like this.",
                    "label": 0
                },
                {
                    "sent": "We know the locations of positive charges.",
                    "label": 0
                },
                {
                    "sent": "Charges from the protein port and then this fossil membrane is made of a dielectric constant of two and the solutions water salty water like 80.",
                    "label": 0
                },
                {
                    "sent": "And then there's an external field.",
                    "label": 0
                },
                {
                    "sent": "So what we do is we solve this large one equation.",
                    "label": 0
                },
                {
                    "sent": "Therefore selfield comes from all these interactions and write a dielectric heterogeneity.",
                    "label": 0
                },
                {
                    "sent": "There's a random force.",
                    "label": 0
                },
                {
                    "sent": "The friction is satisfying fluctuation dissipation theorem.",
                    "label": 0
                },
                {
                    "sent": "So you run this simulation.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At the same time, we also do the classic argument of person learns plank that when I have a port on, the changes are passing through.",
                    "label": 0
                },
                {
                    "sent": "So for any ion that is passing through the continuity equation is given by this, but the flux has two parts.",
                    "label": 0
                },
                {
                    "sent": "One this is the diffusion part and the drift apart electrophoretic mobility part due to gradient of the potential.",
                    "label": 0
                },
                {
                    "sent": "Now the gradient potential solved by Parsons equation, right?",
                    "label": 0
                },
                {
                    "sent": "And then any charge coming from the.",
                    "label": 0
                },
                {
                    "sent": "Polymer or from the port has to go into solving this puzzle.",
                    "label": 0
                },
                {
                    "sent": "Bozeman equation and then I have this equation and then I have the dielectric mismatch Delta heterogeneity system because here it's two everywhere else is 80 and then from based upon these things we compute the ionic current as a polymer.",
                    "label": 0
                },
                {
                    "sent": "Chain is going through the computer and strength.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so here is the trajectory of how this happens.",
                    "label": 0
                },
                {
                    "sent": "So here is my polymer chain which is being pushed by an electric field, right?",
                    "label": 0
                },
                {
                    "sent": "It goes not necessary like a head on into the port.",
                    "label": 0
                },
                {
                    "sent": "It can even go like a hairpin and it rattles around inside this vestibule.",
                    "label": 0
                },
                {
                    "sent": "The big funnel, like region and then puts its head through this beta barrel and then it doesn't come out right.",
                    "label": 0
                },
                {
                    "sent": "It goes back and forth a little bit and then tries to come out.",
                    "label": 0
                },
                {
                    "sent": "Right looks around little bit.",
                    "label": 0
                },
                {
                    "sent": "Alright, and then it will slip up.",
                    "label": 0
                },
                {
                    "sent": "Honey, do these simulations of thousands and thousands of times right, and then look at what is happening.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And one more trajectory of this, I'll show you.",
                    "label": 0
                },
                {
                    "sent": "And Meanwhile we also compute the ionic current.",
                    "label": 0
                },
                {
                    "sent": "So the changes coming through and that is the open for current.",
                    "label": 0
                },
                {
                    "sent": "Even with this simple description that is very similar to 130 pico amperes and measured in experiments.",
                    "label": 0
                },
                {
                    "sent": "And as it goes through the beta barrel, only then I have this strong blockade.",
                    "label": 0
                },
                {
                    "sent": "Of their current and then this noise that you see here is not noise.",
                    "label": 0
                },
                {
                    "sent": "It is the polymer dynamics as a confirmation to changing the current is also fluctuate ING, so the correlation function of this say something about the dynamic is polymer and as you will see when the chain comes out, this will come back to the open for current.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So how does a histogram look like?",
                    "label": 0
                },
                {
                    "sent": "The histogram looks very much like in the experiments, but the advantage here is we can go and look at one event and ask why did that event.",
                    "label": 0
                },
                {
                    "sent": "Took so long, whereas this event took short period of time to make a Long story short, those are long drawn events.",
                    "label": 0
                },
                {
                    "sent": "Have something to do with this vestibule.",
                    "label": 0
                },
                {
                    "sent": "I say totally the vestibule is big enough for the Parliament to reside and it's entropically confined, and therefore it actually can entropic trap in front of this beta.",
                    "label": 0
                },
                {
                    "sent": "Barrel and stochastically, there are some events where it will directly go into the better, better in escape, so these two pics that we saw something to do with the existence of this.",
                    "label": 0
                },
                {
                    "sent": "The vestibule region, because that acts as a secondary trap for the chain to recite there.",
                    "label": 0
                },
                {
                    "sent": "So how do we test this?",
                    "label": 0
                },
                {
                    "sent": "So get rid of it.",
                    "label": 0
                },
                {
                    "sent": "In this simulation we can completely cut it out.",
                    "label": 0
                },
                {
                    "sent": "Then I have only better barrel then this histogram in the scale is given here.",
                    "label": 0
                },
                {
                    "sent": "That histogram now is transferred into this sharper Peak because now it's going only through beta barrel.",
                    "label": 0
                },
                {
                    "sent": "So if you want to do the sequencing, Alpha hemolysin pore is probably not the best candidate because of this existence of vestibule.",
                    "label": 0
                },
                {
                    "sent": "So probably solid nanopore is a better candidate where you have a narrow tube, so it can go through without participation with distribute.",
                    "label": 0
                },
                {
                    "sent": "OK, now this thing let's a more investigation of.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The ionic currents.",
                    "label": 0
                },
                {
                    "sent": "So we went back and looked at the traces.",
                    "label": 0
                },
                {
                    "sent": "So when you look at the ionic and traces.",
                    "label": 0
                },
                {
                    "sent": "Right, so that would be the typical chart and what people were doing was they were trying to put a bin.",
                    "label": 0
                },
                {
                    "sent": "Here they will draw a line there.",
                    "label": 0
                },
                {
                    "sent": "Another line in here and calculate all these events and consider these programs so when we looked at it right, this is an expanded version of this.",
                    "label": 0
                },
                {
                    "sent": "So when we looked at it, OK, Now we know that vestibular playing a role.",
                    "label": 0
                },
                {
                    "sent": "We thought that when the chain goes into the vestibule, it resides there, right?",
                    "label": 0
                },
                {
                    "sent": "That's why they blocked the current right, but not fully blocked occurrence.",
                    "label": 0
                },
                {
                    "sent": "And then sometimes it comes back as this address shows.",
                    "label": 0
                },
                {
                    "sent": "In this particular case, it goes into the vestibule and then it punches through the better barrel, then eventually comes out.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So this is the precursor state and then actual translocation, and here it went directly to the better, better.",
                    "label": 0
                },
                {
                    "sent": "I met up.",
                    "label": 0
                },
                {
                    "sent": "So what we decided to do was to counter these things from the experimental data and then counted these events and the problem.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And what we found was, to our great surprise.",
                    "label": 0
                },
                {
                    "sent": "Great surprise, right?",
                    "label": 0
                },
                {
                    "sent": "Only those events depend on chain length like power 1 N power one.",
                    "label": 0
                },
                {
                    "sent": "Alright, and these events did not depend upon changing at all, right?",
                    "label": 0
                },
                {
                    "sent": "So therefore all these events, only those we must account to be actual translocation and the other events that are contributing here are failures.",
                    "label": 0
                },
                {
                    "sent": "And how many of them are successful.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Many of them are failures and this is a big shock right when we go to the usual conditions of pH of 7.5 using the experiments and what we found was almost 90% of the events don't make it.",
                    "label": 0
                },
                {
                    "sent": "Alright, there only one small percentage of them.",
                    "label": 0
                },
                {
                    "sent": "These are the ones which correspond to actual punching through the better, better than getting out and then here is the statement that even at very high voltage.",
                    "label": 0
                },
                {
                    "sent": "Please remember that like a 25,000,000 walls will be like room temperature Katie when you drive like 150 million walls, right?",
                    "label": 0
                },
                {
                    "sent": "That's a plenty of Katie.",
                    "label": 0
                },
                {
                    "sent": "Lots of Fort, even there for this Alpha humanizing port.",
                    "label": 0
                },
                {
                    "sent": "80% of them are failures.",
                    "label": 0
                },
                {
                    "sent": "Only a very small percentage of our successful that came directly out of.",
                    "label": 0
                },
                {
                    "sent": "Inspired by the simulation results of the participation with people.",
                    "label": 0
                },
                {
                    "sent": "So how do we?",
                    "label": 0
                },
                {
                    "sent": "How do we make this work?",
                    "label": 0
                },
                {
                    "sent": "So we think about a little bit more.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here is when you look at the protein for decoration and that's the negatively charged.",
                    "label": 0
                },
                {
                    "sent": "There's a net negative charge in here at the ring region and a pH of 7.5 the next night we charge is about to say I don't know negative 8, so suppose we would reducer charge.",
                    "label": 0
                },
                {
                    "sent": "How do you reduce it?",
                    "label": 0
                },
                {
                    "sent": "Because we know the sequence of these polypeptides which are making up constituting this approaching 4, so knowing their PKA values, theoretically we found out that if I lower my pH to be 4.",
                    "label": 0
                },
                {
                    "sent": "And then I can reduce this negative charge barrier because the DNA is negatively charged.",
                    "label": 0
                },
                {
                    "sent": "DNA is coming like this.",
                    "label": 0
                },
                {
                    "sent": "I'm going trying to go through this yellow to static barrier.",
                    "label": 0
                },
                {
                    "sent": "Suppose I demolish that barrier.",
                    "label": 0
                },
                {
                    "sent": "Perhaps it will go through and that was the idea always.",
                    "label": 0
                },
                {
                    "sent": "You could also do.",
                    "label": 0
                },
                {
                    "sent": "Mutagenesis is really heavy work that's very, very hard to do.",
                    "label": 0
                },
                {
                    "sent": "You can do messages for one site to do this very you know it's very quite labor intensive instead of the sellers simply changing pH and trans compartment in the receiver.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's what we did, and when we did that in our lab when we did that in Celsius 7.5 and we go to 4.5, what we find is the majority of the events and now are actually translocations.",
                    "label": 0
                },
                {
                    "sent": "There is still there is some failure, but that's really very small amount.",
                    "label": 0
                },
                {
                    "sent": "Now 80% of them actually go through.",
                    "label": 0
                },
                {
                    "sent": "There are two such events right net 80 personal only about 5% are failures.",
                    "label": 0
                },
                {
                    "sent": "90% actually go through.",
                    "label": 0
                },
                {
                    "sent": "Only 5% are failures now.",
                    "label": 0
                },
                {
                    "sent": "So by such a simple physical chemical argument of changing the pH.",
                    "label": 0
                },
                {
                    "sent": "And Mother Nature uses all the time, right?",
                    "label": 0
                },
                {
                    "sent": "We know that the proton pumps if pH gradients we use it, but here physical principle, right?",
                    "label": 0
                },
                {
                    "sent": "Based upon just thinking we can make this process very, very quick and this is being used enough to push the polymer chains very effectively.",
                    "label": 0
                },
                {
                    "sent": "Now let me switch gears to ask the following question.",
                    "label": 0
                },
                {
                    "sent": "So far I have been focusing on how the chain is a penetrating through airport.",
                    "label": 0
                },
                {
                    "sent": "Now imagine I have centimeter cubed vessel.",
                    "label": 0
                },
                {
                    "sent": "And then I have a phospholipid membrane officer Micron layer and in there I drill like 1.2 nanometer whole.",
                    "label": 0
                },
                {
                    "sent": "Right, the polymer chain living in this largest space much somehow search for that little hole and find their whole before it.",
                    "label": 0
                },
                {
                    "sent": "Thread through right, and that is not a small task.",
                    "label": 0
                },
                {
                    "sent": "Imagine in terms of scale of things this is really nontrivial.",
                    "label": 0
                },
                {
                    "sent": "How does it do it?",
                    "label": 0
                },
                {
                    "sent": "Because we know that they have looked at that race is we know that this happens, but how does a molecule find that or me as a technologies orifices?",
                    "label": 0
                },
                {
                    "sent": "How do we bring the polymer China to the gate?",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And experimentally we have some data.",
                    "label": 0
                },
                {
                    "sent": "The data are the following right?",
                    "label": 0
                },
                {
                    "sent": "So I know this trace is right and I measure the average duration of time between these events.",
                    "label": 0
                },
                {
                    "sent": "Alright, and the reciprocal of that average duration is the capture rate, right?",
                    "label": 0
                },
                {
                    "sent": "So the question is, what is the capture rate of this polymer given your small target?",
                    "label": 1
                },
                {
                    "sent": "And this is a famous problem of small house key, right?",
                    "label": 0
                },
                {
                    "sent": "Smaller house K looked at not for polyelectrolytes or not in this context, but he looked at what would be the capture rate for your small hole on a wall of some colloidal particles and particles coming through and he pointed out that it has something to do with the cross section of that hole and then it has something with the concentration of this.",
                    "label": 0
                },
                {
                    "sent": "Colonial particles are the polymers and they also have something to do with diffusion coefficient of this polymer.",
                    "label": 0
                },
                {
                    "sent": "This particle, and we know from stocks and Einstein, the diffusion coefficient is inversely proportional to the radius of the polymer and the radius of the polymer is now proportional to chain length power.",
                    "label": 0
                },
                {
                    "sent": "Some exponent, like in these conditions then power Point 6.",
                    "label": 0
                },
                {
                    "sent": "So therefore I would expect that the capture rate would be.",
                    "label": 0
                },
                {
                    "sent": "Proportional to concentration but inversely related to molecular weight, an proportional cross sectional for the support cross section of the port is fixed for a particular equipment, so the major two major predictions would be is directly proportional consultation and inversely related to molecular weight.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here are the data.",
                    "label": 0
                },
                {
                    "sent": "Look at this these later again.",
                    "label": 0
                },
                {
                    "sent": "Very recent data right?",
                    "label": 0
                },
                {
                    "sent": "So again I put together from various groups.",
                    "label": 0
                },
                {
                    "sent": "So here as a functional voltage right there, the capture rate it increases the voltage and particularly the people with physics background would immediately recognize.",
                    "label": 0
                },
                {
                    "sent": "It is very much like semiconductor physics.",
                    "label": 0
                },
                {
                    "sent": "There's a barrier is trying to cross through right and then the barrier depends upon whether I was pushing from the frontal region into the transite or in the reverse direction, but nevertheless.",
                    "label": 0
                },
                {
                    "sent": "It was a linear in concentration.",
                    "label": 0
                },
                {
                    "sent": "OK, that's a small house key argument, right?",
                    "label": 0
                },
                {
                    "sent": "Linear in concentration?",
                    "label": 0
                },
                {
                    "sent": "Some other paper always linear in conservation.",
                    "label": 0
                },
                {
                    "sent": "Some other people found that this capture rate as a function of voltage was a double exponential.",
                    "label": 0
                },
                {
                    "sent": "For low voltage is exponential and higher voltages exponential same group of people.",
                    "label": 0
                },
                {
                    "sent": "You know different time they found out that they capture rate is a linear.",
                    "label": 0
                },
                {
                    "sent": "In a exponential voltage, 1st and linear in voltage for high voltages, but remarkably what they found was the capture.",
                    "label": 0
                },
                {
                    "sent": "It increased with the molecular weight, right?",
                    "label": 0
                },
                {
                    "sent": "Here is a dependence on molecular weight of the same data dependence.",
                    "label": 0
                },
                {
                    "sent": "Our capture rate with molecular weight in a log rhythmic scale.",
                    "label": 0
                },
                {
                    "sent": "So what they found was you need to change.",
                    "label": 0
                },
                {
                    "sent": "You make the molecule bigger and bigger, the capture rate.",
                    "label": 0
                },
                {
                    "sent": "Increases this exactly opposite of a small house key, right?",
                    "label": 0
                },
                {
                    "sent": "And then eventually it doesn't depend upon molecular weight at all.",
                    "label": 0
                },
                {
                    "sent": "Its independent molecular weight.",
                    "label": 0
                },
                {
                    "sent": "OK man, you got to that many basis.",
                    "label": 0
                },
                {
                    "sent": "Doesn't matter whether you make it big or small.",
                    "label": 0
                },
                {
                    "sent": "These are all kind.",
                    "label": 0
                },
                {
                    "sent": "Very surprising.",
                    "label": 0
                },
                {
                    "sent": "How do we?",
                    "label": 0
                },
                {
                    "sent": "How do you think about this so?",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Again, let me look at this problem in general.",
                    "label": 0
                },
                {
                    "sent": "So when I look at this problem, here is my poor.",
                    "label": 0
                },
                {
                    "sent": "My polymer is a far away and then somehow I had to bring very close to this region of capture, right?",
                    "label": 0
                },
                {
                    "sent": "And this polymer has to move a small Husky diffusion and also there is a weak electric field.",
                    "label": 0
                },
                {
                    "sent": "So there is also drifted to so this mobility of this polymer chain is a combination of diffusion as well as electrical mobility.",
                    "label": 0
                },
                {
                    "sent": "Then when it comes in here, maybe there are some flow fields as I told you before, like Ella automatic flow.",
                    "label": 0
                },
                {
                    "sent": "Maybe the Parliament chain would be captured as rain comes in here due to some strong currents in front of the port.",
                    "label": 0
                },
                {
                    "sent": "There's a capture region and then finally it will thread through.",
                    "label": 0
                },
                {
                    "sent": "As I told you before.",
                    "label": 0
                },
                {
                    "sent": "So there for free landscape would be something like this.",
                    "label": 0
                },
                {
                    "sent": "The chain would come in here caught by the port and when it's caught the polymer chain is not jammed estate because the two ends of the chain are not necessarily with the right orientation to penetrate through the port and then it has a unravel itself.",
                    "label": 0
                },
                {
                    "sent": "So there one in his place in here and that will take a huge of Entropic barrier.",
                    "label": 0
                },
                {
                    "sent": "And then it will nucleator to make enough number of monomers on the right side.",
                    "label": 0
                },
                {
                    "sent": "That's another barrier, little barrier there and then it will undergo another different diffusion through the raft and then come out.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's the general picture of Parliament location.",
                    "label": 0
                },
                {
                    "sent": "But now I want to focus on this area to figure out some way to rationalize.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Excellent facts, let's just go to the drawing board going to our elementary courses that we all learn and teach.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is a content equation.",
                    "label": 0
                },
                {
                    "sent": "There's a flux.",
                    "label": 0
                },
                {
                    "sent": "It has a diffusion and drift.",
                    "label": 0
                },
                {
                    "sent": "And now let's check with the external facts for this equation, the.",
                    "label": 0
                },
                {
                    "sent": "Diffusion coefficient.",
                    "label": 0
                },
                {
                    "sent": "It's a given buy stocks Einstein no problem expertly we measure it right and now the electrophoretic mobility right?",
                    "label": 0
                },
                {
                    "sent": "If we use again Einstein's relation that mobility divided by total charge of the polymer times the diffusion of the polymer should be that number at that temperature.",
                    "label": 0
                },
                {
                    "sent": "You know this is a strokes disease.",
                    "label": 0
                },
                {
                    "sent": "Hey Derek, you D is equal to that number.",
                    "label": 0
                },
                {
                    "sent": "This is not true.",
                    "label": 0
                },
                {
                    "sent": "For polymers.",
                    "label": 0
                },
                {
                    "sent": "OK, what?",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let me show you the exact date.",
                    "label": 0
                },
                {
                    "sent": "Right, the external data shows that that's the number that is expected, whether it's a single center DNA, double strand DNA, there's a very strong violation of this equation.",
                    "label": 0
                },
                {
                    "sent": "This result.",
                    "label": 0
                },
                {
                    "sent": "This is not my title.",
                    "label": 0
                },
                {
                    "sent": "These are title of this paper.",
                    "label": 0
                },
                {
                    "sent": "Alright, well they claimed that I instantly equation fails.",
                    "label": 1
                },
                {
                    "sent": "Of course not right.",
                    "label": 0
                },
                {
                    "sent": "It cannot fail.",
                    "label": 0
                },
                {
                    "sent": "That means something is missing.",
                    "label": 0
                },
                {
                    "sent": "OK, can anybody volunteer what could be missing?",
                    "label": 0
                },
                {
                    "sent": "And the reason is, as I was trying to tell you in the introduction, the polymer is not alone League personal, only entity.",
                    "label": 0
                },
                {
                    "sent": "It's a quasiparticle.",
                    "label": 0
                },
                {
                    "sent": "They counter.",
                    "label": 0
                },
                {
                    "sent": "Ions are also dressing it up so they are working together right.",
                    "label": 0
                },
                {
                    "sent": "So one has to account for account for the coupling between counterion Sandy polymer because as a polymer most content cloud is also moving.",
                    "label": 0
                },
                {
                    "sent": "So you have to do it.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So, so the electromobility is independent polymer length.",
                    "label": 1
                },
                {
                    "sent": "I told you right in the beginning, right in the capital pollicis is in the Pamela right.",
                    "label": 0
                },
                {
                    "sent": "And that's the manifestation of this violation of Einstein's.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the reason is this one.",
                    "label": 0
                },
                {
                    "sent": "So you have to account for the County on a dynamics versus and in addition to Parliament dynamics.",
                    "label": 0
                },
                {
                    "sent": "If we do that in addition to this Einsteins factor there is the counter on cloud factor which was directed at work.",
                    "label": 0
                },
                {
                    "sent": "So there is a counter on cloud factor.",
                    "label": 0
                },
                {
                    "sent": "And then when you do this calculation as an extra day to the mobility is independent molecular weight over three orders of magnitude as shown experimentally.",
                    "label": 0
                },
                {
                    "sent": "Or any order of magnitude and then they actual prefactor would depend upon the salt concentration.",
                    "label": 0
                },
                {
                    "sent": "But independent of what constellation that is is always independent of the molecular weight.",
                    "label": 0
                },
                {
                    "sent": "OK, so now let's look at the simple equation.",
                    "label": 0
                },
                {
                    "sent": "The flux is given by diffusion and drift.",
                    "label": 0
                },
                {
                    "sent": "If you do not account for this will have small house keys result where the capture rate would be inversely related to molecular weight.",
                    "label": 0
                },
                {
                    "sent": "Now let's say for the time, let's assume that the gradient in concentrations week in such a way that they drifted term dominates.",
                    "label": 0
                },
                {
                    "sent": "As soon as that dominates.",
                    "label": 0
                },
                {
                    "sent": "The answer is very clear they capture rate.",
                    "label": 0
                },
                {
                    "sent": "That's a flux that is a linear and concentration.",
                    "label": 0
                },
                {
                    "sent": "That's one prediction and the linear in electric field.",
                    "label": 0
                },
                {
                    "sent": "It is operating voltage.",
                    "label": 0
                },
                {
                    "sent": "That is another prediction and it is independent molecular weight.",
                    "label": 0
                },
                {
                    "sent": "That's another prediction.",
                    "label": 0
                },
                {
                    "sent": "So as soon as I recognize these exporter facts right, then we know that if this dominates, these are the three results that must have come through and we saw them already in the experiments we saw them for very large voltages, right?",
                    "label": 0
                },
                {
                    "sent": "We saw this really and concentration linear voltage an independent molecular weight.",
                    "label": 0
                },
                {
                    "sent": "The panel that I showed you.",
                    "label": 0
                },
                {
                    "sent": "So that's really the physics.",
                    "label": 0
                },
                {
                    "sent": "Now let's.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Look at the capture.",
                    "label": 0
                },
                {
                    "sent": "When I look at this so that is the drift dominating drift, dominating, coming there.",
                    "label": 0
                },
                {
                    "sent": "Now let's look at the capture right when I look at the capture here.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is a puzzle OK?",
                    "label": 0
                },
                {
                    "sent": "Here are some external data coming from that particular work, so this is the power is about 50 nanometer coated with aluminum that is sitting right there so they their membrane like wall.",
                    "label": 0
                },
                {
                    "sent": "There's a four right in the middle there and then outside this support in the donor compartment, fluorescently labeled DNA Lambda DNA molecules with that's the bright spots.",
                    "label": 0
                },
                {
                    "sent": "Now what they found was there was a huge well of some 222.",
                    "label": 0
                },
                {
                    "sent": "Micron 22 Micron radius, in which the polymer chains would jump double sided with jump into this world and disappear very quickly, but always this big well was maintained.",
                    "label": 1
                },
                {
                    "sent": "There was an absorbing region of about 22 microns, 2.2 million.",
                    "label": 1
                },
                {
                    "sent": "Humongous link this scale.",
                    "label": 0
                },
                {
                    "sent": "How did this huge capture will come about?",
                    "label": 0
                },
                {
                    "sent": "Any ideas?",
                    "label": 0
                },
                {
                    "sent": "Let me pick on Rudy again.",
                    "label": 0
                },
                {
                    "sent": "No, OK, now that was a big mysterious thing.",
                    "label": 0
                },
                {
                    "sent": "How did this come about?",
                    "label": 0
                },
                {
                    "sent": "And we're trying to do, you know, sequencing right and then?",
                    "label": 0
                },
                {
                    "sent": "Meanwhile, you have this humongous or well that's being create.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Here the idea was is the following.",
                    "label": 0
                },
                {
                    "sent": "In fact this is the right time that I must say something with Anton, once again, right when I met with him, he was telling me about his work on polymer chain under extensional flow, and he had computed the entropy or polymer chains.",
                    "label": 0
                },
                {
                    "sent": "When you put the extension for, you know put an external.",
                    "label": 0
                },
                {
                    "sent": "What happens polymer chain?",
                    "label": 0
                },
                {
                    "sent": "How the problem is going to be formed?",
                    "label": 0
                },
                {
                    "sent": "In fact this is the one that I use in my theory in those days to think about confirmations under hydrodynamic conditions.",
                    "label": 0
                },
                {
                    "sent": "So it is very relevant to this problem in here, so here is my promotion coming in here.",
                    "label": 0
                },
                {
                    "sent": "I told you that there is an electroosmotic flow and as a consequence its going to gradient so I can calculate what data flow.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is right, it's very easy right for this cylindrical geometry.",
                    "label": 0
                },
                {
                    "sent": "I have pass on Bozeman equation.",
                    "label": 0
                },
                {
                    "sent": "Let's not worry about mathematics.",
                    "label": 0
                },
                {
                    "sent": "We can do it with paper and pencil, so local charge density can be.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Suited once you have the local charge density do navier Stokes equation and get the fluid flux.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright, so but the important thing is if I have a flex like this, there must be continuity of the flow, so the hemisphere, then half sphere in here if I look at the velocity at that location or from the port or square radius squared times you are velocity that should be exactly the same as a J, right?",
                    "label": 0
                },
                {
                    "sent": "That means that the velocity field or the distance R should be 1 / R squared.",
                    "label": 0
                },
                {
                    "sent": "That means velocity gradient should be on our R cubed.",
                    "label": 1
                },
                {
                    "sent": "But then Anton and later on them showed.",
                    "label": 0
                },
                {
                    "sent": "That if.",
                    "label": 0
                },
                {
                    "sent": "I have a strong flow is a strong velocity gradient.",
                    "label": 1
                },
                {
                    "sent": "The polymer chain can stretch, so therefore if there is a critical velocity gradient and if that is stretching, the velocity is stronger than that.",
                    "label": 0
                },
                {
                    "sent": "Department will deform.",
                    "label": 0
                },
                {
                    "sent": "So now let's look at that one.",
                    "label": 0
                },
                {
                    "sent": "So if the if that velocity gradient is larger than one over rows time which it goes like RJ cubed, then I match this R and that RG.",
                    "label": 0
                },
                {
                    "sent": "So if this or is comparable to that.",
                    "label": 0
                },
                {
                    "sent": "And then the chain would stretch.",
                    "label": 0
                },
                {
                    "sent": "So therefore the Parliament will come in here.",
                    "label": 0
                },
                {
                    "sent": "If these are is comparable to that one, the politician is going to stretch.",
                    "label": 0
                },
                {
                    "sent": "If it stretches, will jump into the world and disappear very quickly because.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The entropy is reduced.",
                    "label": 0
                },
                {
                    "sent": "And you can put all those numbers together.",
                    "label": 0
                },
                {
                    "sent": "And here is a closer formula.",
                    "label": 0
                },
                {
                    "sent": "Depends on the salt concentration, dielectric constant, temperature, viscosity and it depends upon the surface potential an.",
                    "label": 0
                },
                {
                    "sent": "If you do this in the prediction is the capture radius is 3 times energy for Lambda DNA that .8 and they capture radius turns would be like a 2.4 microns and that's what we saw.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, now in the interest of time I'm going to skip.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A few things you can.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Put the path barrier and compute everything.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So kind of field theory, you can calculate all the.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Things, and you put diffusion drift and barrier calculate the capture rate.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the conclusion is.",
                    "label": 0
                },
                {
                    "sent": "The fan in general.",
                    "label": 0
                },
                {
                    "sent": "There are two regimes and the four week voltages.",
                    "label": 0
                },
                {
                    "sent": "The chain is a navigating through the airport by by an entropic barrier mechanism for high voltages is adrift.",
                    "label": 0
                },
                {
                    "sent": "Dominant will be just rushing through there for capture rate would be exponential voltage.",
                    "label": 0
                },
                {
                    "sent": "For low voltages and linear voltage for high voltages.",
                    "label": 0
                },
                {
                    "sent": "In terms of molecular independence for high voltages or high molecular weight, it's adrift Dominator, but a low molecular weight.",
                    "label": 0
                },
                {
                    "sent": "It's counter intuitive, but that's what the theory shows based upon all these arguments.",
                    "label": 0
                },
                {
                    "sent": "And for intermediate to molecular weights, increase molecular weight and you get close forms, so in.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Only then I want to show that we have to account for polymer entropy.",
                    "label": 0
                },
                {
                    "sent": "We have to account for protein channels and it's a decoration and we also have to confirm flow.",
                    "label": 0
                },
                {
                    "sent": "All of them contribute and it is possible to come up with one political frame to explain the variety of XML data which had been fragmented and puzzling.",
                    "label": 1
                },
                {
                    "sent": "And now we're in a very reasonable position to really contribute to development of technology and also new experiments.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the same arguments are also true with biological context as well.",
                    "label": 0
                },
                {
                    "sent": "So when I look at it, say, mitochondrion, a protein transport again, there's a recognition, there's approach, and then nucleation and and then it reading, and the mechanism is by adoption of.",
                    "label": 0
                },
                {
                    "sent": "Appropriate appropriate chaperones which drives the emotion of this problem from left to right and the same technology that I described so far are being implemented to address these issues in a similar way.",
                    "label": 0
                },
                {
                    "sent": "If you look at it, the translocation of well packed double sided DNA, enough age, how does it come out?",
                    "label": 0
                },
                {
                    "sent": "Or how does it translocate?",
                    "label": 0
                },
                {
                    "sent": "Same ideas that can be presented in these are biological context as well.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So with that, let me close my presentation and I want to thank you for your attention and I'll be very happy to answer any questions you have.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}