{
    "id": "2vfjjy6r7xiil24tir3f5gy2nrwkcakq",
    "title": "Towards Analytics Aware Ontology Based Access to Static and Streaming Data",
    "info": {
        "author": [
            "Evgeny Kharlamov, Department of Computer Science, University of Oxford"
        ],
        "published": "Nov. 10, 2016",
        "recorded": "October 2016",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2016_kharlamov_analytics_aware/",
    "segmentation": [
        [
            "This talk is about ontology ontology based data, access of over new generation.",
            "Basically we are revising existing ontology based data access approach and we would like to bring it to a new level.",
            "Anne, this work has been done within their scope of an optic project.",
            "It's European project and there is a bunch of partners and vote yes, so they are listed here involved in this in this part of research.",
            "And while asking questions, they may also involve some of the representative from the partners to go deep in some of the things that I'm presenting."
        ],
        [
            "So.",
            "Before going into how we revised existing OBD solution, ontology, beta data access, let's take a look.",
            "Let's refresh what ontology based data access is.",
            "It is an approach to data integration and in this approach the data consumers, users, applications.",
            "I separated from the data within Ontology ontologies.",
            "The mediator between the consumers and the data providers and this ontology offers an.",
            "Vocabulary vocabulary, like a unified vocabulary for all the databases.",
            "The mappings are then used to connect the vocabulary ontology to the schemas of the databases in the declarative fashion, usually using SQL queries.",
            "One could do this connection between intelligence and databases.",
            "Users access these kind of systems by posing queries on top of ontologies.",
            "Semantic queries the queries.",
            "Then they go through ontology.",
            "There is reasoning happening until clear is getting reached.",
            "Become smarter then this, enriched queries get unfolded via mappings into data queries and this data queries are related to other databases.",
            "We get data answers which are then shipped back to the user and while the while traveling mappings help to turn them into the semantic answers.",
            "So basically.",
            "One day consumers layer.",
            "We have semantic queries and answers.",
            "We have this enriched queries behind the hood, semantic queries and the data queries in data answers.",
            "The approach is beautiful vertical in which sense.",
            "So the data stays where it is.",
            "Data is waiting for the request to come and only on dim and the data is transferred to the consumers."
        ],
        [
            "This is an approach that has been taken by quite many and there is a lot of systems out there that implement a PDA up to some degree with different features.",
            "And OBJ has been also applied in various domains.",
            "It has been applied in cultural heritage, environmental organizations and even in industry.",
            "So within Optic we actually tried it with stolen Siemens.",
            "And there is also a fresh application that will be reported tomorrow by Martin Risk.",
            "It's a row can company who used to be in ecommerce.",
            "So OBD is is getting its customers.",
            "But let's see what are the limits of the system where the system cannot do.",
            "The job, which is expected from it to do."
        ],
        [
            "And these are the hard keys for BDM.",
            "This example example of Siemens turbine monitoring.",
            "So you have it turbine.",
            "I will explain you a little bit about them about this scenario.",
            "So there is to buy and it has about 2000 sensors.",
            "Sensors generate temperature, pressure and things like this and it streams it through some processing devices to the datacenters, so datacenters accumulate streaming data.",
            "They have archived streaming data from last years.",
            "They have static data about turbine structures and they have lots of other kind of data in this data centers on top of data centers.",
            "The rest service centers where engineers are looking after turbines.",
            "They posing queries to the data centers in order to check that everything is fine with the turbines.",
            "And let's look at the example of the request, which is typically asked by service engineers, which makes life a bit off.",
            "This is a query in a short form, so in junior would ask give me reliable sensors that are reporting alerting temperature.",
            "So reliable sensors are those sensors that say passed validation test with score at least 90% every score.",
            "This have proper sensors.",
            "And very putting chaotic temperature.",
            "What does it mean that the temperature is a loading?",
            "It means that it is similar to what we have seen a year ago when there was, when there was a problem.",
            "Then it's loading.",
            "And the similarity can be defined, say, by Pearson correlation.",
            "So you want to do Pearson correlation between the current stream and the archive stream from the last year.",
            "Let's this is what's written in this longer version of the query."
        ],
        [
            "And so the characteristics of this query that first it tries to access both static and streaming data.",
            "The current sensor data, historic data, some turbine structure.",
            "It tries to do some kind of simple analytics.",
            "It computes averages like aggregate which aggregate functions.",
            "Here's this at least 90, which is very comparison, and it has Pearson correlation, so this kind of things happening in this query.",
            "And this these things are hard for Billy, why?"
        ],
        [
            "M Well, first of all, existing committee systems focus.",
            "I don't static on streaming data and were not aware.",
            "Maybe the rabbit we're not aware of systems that can do both streaming and starting and well, not just swimming in static, but in general to combine sources or different nature.",
            "An another thing is that existing computer systems are really good for congenital queries, but they're not so good for analytics, in which sense?",
            "Whenever you have an analytical kind of query when if you want to compute just on average, how would you do it on a video game?",
            "You know BDA.",
            "You would first ship over data to the consumer and then you do your average on top of it.",
            "This is 1 approach and this approach has his limitations because then you would need to ship a lot of data just to get one average and a lot of data is redundant and you would ignore source capabilities.",
            "Average could have been already somewhere in the databases, but you just didn't check it this.",
            "This corresponds to the epistemic semantics of aggregates.",
            "An another way of doing aggregates is to encode them directly in mappings.",
            "You just can put all your analytics and mappings and and and that would do you the job, but.",
            "The problem here is that you're anyway breaking the OBD philosophy.",
            "You are going from a declarative specification into the very much query dependent specification of a system.",
            "And it requires you to encode a lot of values and their mappings.",
            "It's not cool, so this these two possible approaches that exists with existing copy we don't like."
        ],
        [
            "And what we think is a good way to go is to think of a different ability system.",
            "New generation system for the company.",
            "That's a processes data of various kinds, not just relation about streaming and so on data.",
            "And company that is naturally analytics oriented.",
            "So for them we think that it's really good to have systems that are first analytics aware.",
            "What does it mean reddix aware?",
            "So they support declarative specifications or analytic operations.",
            "So basically there all the things that we see here.",
            "So the ontology, then the query language and the mappings, they should become analytics aware they should know about analytics.",
            "And actually then we need a new processing mechanism that would take queries, analytical queries, rewrite them and then fold them into the data queries.",
            "So the whole the whole is architecture to hold these things should be rethink riford redesigned in order to support analytics.",
            "So it should become all ameritox aware.",
            "That's well, that's one thing that we.",
            "That we see relevant."
        ],
        [
            "Another thing is that.",
            "OBD system should become source and cost aware what does it mean?",
            "It should support sources of various kinds like this.",
            "Streaming, relational other whatever databases.",
            "So lots of databases should be possible to plug and the system should natively offer robust.",
            "Query planning and optimization back and so the back end optimization should not be seen as something that we don't care in a third party database will give it to us.",
            "It should be already in integral.",
            "A first class citizen inability system in order to support all these analytics and things that we need."
        ],
        [
            "Now in the remaining part of the talk, I will just give him fast tour through the things that we proposed as a possible way to make an OBD movies knew OBD.",
            "It will be.",
            "It will consist of two parts, so the first part is about this higher level about analytics where ontologies queries mappings and the query transformation.",
            "I will give you what we propose.",
            "I will show you what you propose.",
            "And then in the second part you will see the Dungeons.",
            "So the database part about you will see about career planning optimization.",
            "Then the experiments we conducted.",
            "That's the outline."
        ],
        [
            "OK. Let's move to the analytic awareness.",
            "The first thing that should become analytically risen, teologi as I said, and this is how this ontology may look like.",
            "It's a proposal where we took their light why daylight cause into the description.",
            "Logic behind I will do all Tokyo which is the language for OBD.",
            "And we enhanced their light with new types of concepts, analytical where concepts.",
            "This is how they look like.",
            "So in order to deal with reliability, one can say that entities whose minimum test score is at least .9 unreliable.",
            "So this kind of these kind of.",
            "Axiom with an aggregate.",
            "Class I could do the job to encode these aggregates and things, so the syntax of the language I don't want to go in details.",
            "It's basically dialight as it is with an extension that you have new types of of concepts and they should be used in a careful way in the axiomatics.",
            "And semantics for these concepts is closed world.",
            "Why?",
            "Because we're talking about aggregates.",
            "Open World doesn't even make sense for them.",
            "And conjunctive query answering under the restrictions that we imposed is tractable.",
            "Assuming that aggregation is tractable.",
            "And thanks to this closed world listen the assumptions.",
            "And yeah, there is a paper that gave us an inspiration to show their electability of conjunctive query answering.",
            "So this anthology underwear then we."
        ],
        [
            "The language statical some of you have seen it yesterday at the demo.",
            "This language inputs it allows so this is the query that actually expresses there this reliable turbine that returns suspicious data.",
            "So this is the running query written here.",
            "So in this query input static.",
            "Static data.",
            "The queries the queries for the for the static parts are conjunctive becausw.",
            "Our ontology does efficient processing only for conjunctive queries and the streaming part is about diagnostic queries with aggregation.",
            "Simple and advanced."
        ],
        [
            "So that's more or less what the query can do.",
            "How do we process these queries?",
            "We posted this queries in two steps.",
            "So first we take this statical query which has static conjunctive query in the streaming query, rewrite it into a static QCQ unit, union of conjunctive queries and then you streaming query and then you can fold it into aggregate SQL and still another streaming query that both fit in the Sqlplus language which is the language of our back end.",
            "So this rewriting essentially does the same thing as perfect information for the alive.",
            "Basically, we reuse the strategy of standard OBD and it's by design.",
            "We do this an unfolding relies on two kinds of mappings, standard mappings and aggregate mappings.",
            "That's an aggregate mapping to map aggregate concepts to the to the database so that we had to bring a new kind of mapping sent to the game."
        ],
        [
            "No.",
            "A couple of words about how we do."
        ],
        [
            "But at the back end.",
            "So in the in the data, then in the database Dungeons.",
            "So what's happening there?",
            "And we have a system exist stream integrated into this platform.",
            "Ann, this is the data stream management system that is extension of SQL, SQL Lite DB engine.",
            "It has this special sqlplus queries language.",
            "There is essentially SQL enhanced with special user defined functions for analytics.",
            "It has a smart planner, so this is the part in the Orange box, and the planning is based on queries and execution environment and so on.",
            "And it has the parallel parts, so a bunch of workers that is the green ones that can take care of parallel distribution, parallelization.",
            "So how the query processed so it comes to the gateway, then it goes through optimization.",
            "It comes, it reaches the scheduler, then it gets split into bunch of workers who then running the query.",
            "So that's essentially how this how the queries processed."
        ],
        [
            "Then to make these things run efficient, we developed a bunch of optimizations which essentially of three kinds.",
            "So one bunch of optimizations enabled streaming for streaming live streaming data.",
            "Another one is about archived data, and the third one is for queries which hybrid which combines streaming and archived data, and basically for all of them there are two directions.",
            "One Direction is data views, so we precompute relevant data in advance, and the second things.",
            "Is adaptive adaptive indexing that we that we are also using took care some other things?"
        ],
        [
            "Sam just a simple example how these views work.",
            "If you have such a table of measurements and what we do based on the frequently asked queries when this tent, which are relevant windows and then we precompute, average, safer this Windows or it could be any other function, and then we embed it into the historic data like this.",
            "There is fun fun calibration.",
            "You see, they move soaps or they don't anymore.",
            "So yeah, so this animation that does the job."
        ],
        [
            "OK, we evaluated our system optimizations.",
            "Do the great job view based optimization.",
            "Meet.",
            "Significant impact on Pearson correlation.",
            "An other analytical function.",
            "Simple aggregates.",
            "And parallelism also when we split into 16 nodes, it really gives us good performance.",
            "When we did analytics for one live stream and about 100,000 of archive streams.",
            "So we combine them together.",
            "One life 1000 / 100,000 archived streams."
        ],
        [
            "OK to conclude.",
            "What we proposed.",
            "So we started with with an understanding of limitations of classical BDA.",
            "We found the killer example of this turbine diagnostics where classical obedience failed to perform well.",
            "And we introduce.",
            "Type of wood media, which should be really relevant for industry because the example we gave it's not a very obscure example that is just to show the limits of ability limitations.",
            "It is a generic example of generic problems and industry and we propose new kind of a PDA.",
            "We instantiate it.",
            "This all these things, an example analytical where queries, ontologies, mappings and so on.",
            "And we conducted a bunch of experiments.",
            "So that's.",
            "That's what you've done, thank you.",
            "Yes, in our experience we actually push the aggregates and stuff.",
            "In the mappings.",
            "I mean, you say there's a tradeoff and stuff we we.",
            "We push everything to the database and look works great for us and you can see you can put that in the ontology.",
            "You can put that into query so there's different trade off so you can imagine.",
            "Have you compared about do what you did versus putting the aggregates.",
            "For example in the mappings and see what the difference is.",
            "So, well, conceptual one could do conceptual comparisons and also say execution some evaluation for the comparison.",
            "We didn't do any evaluations to compare these approaches, but on the conceptual site we see the main shortcomings we see is that if you put it all on the mappings then basically you don't know how these things are happening.",
            "You have some class say reliable in your ontology and you have no idea what does it really mean this reliable everything.",
            "That describes this reliable the sensor.",
            "This evaluation tests 90% or whatever averages all of that is hidden somewhere under the hood.",
            "In the mappings, and the data consumers.",
            "So the engineer who will will try to use reliable, he will not really know, is it the reliability he needs or not.",
            "So it's all hidden in the mappings and the consumers that don't have access to these mappings, they only see what is on the ontology level.",
            "And then, for example in this case, if you encode it all in the mappings, so we have one reliability for one type of turbines, which is say 90% of the tests.",
            "Robust, successfully, another kind of reliability and only 75% test and so on.",
            "So for each of them you will have the zillions of different.",
            "Glasses, reliability classes.",
            "Each of them doesn't say white is.",
            "What does reliability mean there?",
            "It's all hidden under the hood and then that will be quite quite challenging to to understand whether that.",
            "So that's this is the major say limitation we see from the conceptual site.",
            "That's a fairpoint.",
            "I think depending on the on the user right ginir want that.",
            "But yeah, right right.",
            "Please more questions.",
            "So you your example.",
            "You showed this streaming data but wouldn't the problems of classical lobby they also appear if you want some data analytics over static.",
            "Date does the zogre gates.",
            "I mean on other people who also should use this or be there to zero in that case and completely agree.",
            "So yes, so that's it already build manifest itself.",
            "Yeah, so definitely not the sort of simpler motivation why you need this ability to 0 or something like that.",
            "And well, we try to to address a wider scope.",
            "We try to address the wider scope of problems so and internist and problematic spider.",
            "But but I agree, so you could.",
            "You could separate the problem and separate, say faces.",
            "One is too.",
            "Support simple abelian obligation, but you can support data sources of variance, various counts, kinds, streaming some text files and whatever, and the other problem is to support aggregation, but in the in the example scenarios we've seen, like this one, we also seen scenarios from Statoil.",
            "They these problems are usually hard, and they don't rely on specific type of data sources, so it's just our observational that if you want the system to do something.",
            "Practical event it has to take several things into account.",
            "Already, so you cannot just make it solving one problem.",
            "Then it will not solve the bigger problems.",
            "OK, sorry, we're having time.",
            "So let's continue offline.",
            "Thank you, so let's thank the speaker.",
            "Thank you very much, thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This talk is about ontology ontology based data, access of over new generation.",
                    "label": 0
                },
                {
                    "sent": "Basically we are revising existing ontology based data access approach and we would like to bring it to a new level.",
                    "label": 0
                },
                {
                    "sent": "Anne, this work has been done within their scope of an optic project.",
                    "label": 0
                },
                {
                    "sent": "It's European project and there is a bunch of partners and vote yes, so they are listed here involved in this in this part of research.",
                    "label": 0
                },
                {
                    "sent": "And while asking questions, they may also involve some of the representative from the partners to go deep in some of the things that I'm presenting.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Before going into how we revised existing OBD solution, ontology, beta data access, let's take a look.",
                    "label": 0
                },
                {
                    "sent": "Let's refresh what ontology based data access is.",
                    "label": 1
                },
                {
                    "sent": "It is an approach to data integration and in this approach the data consumers, users, applications.",
                    "label": 1
                },
                {
                    "sent": "I separated from the data within Ontology ontologies.",
                    "label": 0
                },
                {
                    "sent": "The mediator between the consumers and the data providers and this ontology offers an.",
                    "label": 0
                },
                {
                    "sent": "Vocabulary vocabulary, like a unified vocabulary for all the databases.",
                    "label": 0
                },
                {
                    "sent": "The mappings are then used to connect the vocabulary ontology to the schemas of the databases in the declarative fashion, usually using SQL queries.",
                    "label": 0
                },
                {
                    "sent": "One could do this connection between intelligence and databases.",
                    "label": 0
                },
                {
                    "sent": "Users access these kind of systems by posing queries on top of ontologies.",
                    "label": 0
                },
                {
                    "sent": "Semantic queries the queries.",
                    "label": 0
                },
                {
                    "sent": "Then they go through ontology.",
                    "label": 0
                },
                {
                    "sent": "There is reasoning happening until clear is getting reached.",
                    "label": 0
                },
                {
                    "sent": "Become smarter then this, enriched queries get unfolded via mappings into data queries and this data queries are related to other databases.",
                    "label": 0
                },
                {
                    "sent": "We get data answers which are then shipped back to the user and while the while traveling mappings help to turn them into the semantic answers.",
                    "label": 0
                },
                {
                    "sent": "So basically.",
                    "label": 0
                },
                {
                    "sent": "One day consumers layer.",
                    "label": 1
                },
                {
                    "sent": "We have semantic queries and answers.",
                    "label": 0
                },
                {
                    "sent": "We have this enriched queries behind the hood, semantic queries and the data queries in data answers.",
                    "label": 0
                },
                {
                    "sent": "The approach is beautiful vertical in which sense.",
                    "label": 1
                },
                {
                    "sent": "So the data stays where it is.",
                    "label": 0
                },
                {
                    "sent": "Data is waiting for the request to come and only on dim and the data is transferred to the consumers.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is an approach that has been taken by quite many and there is a lot of systems out there that implement a PDA up to some degree with different features.",
                    "label": 0
                },
                {
                    "sent": "And OBJ has been also applied in various domains.",
                    "label": 0
                },
                {
                    "sent": "It has been applied in cultural heritage, environmental organizations and even in industry.",
                    "label": 1
                },
                {
                    "sent": "So within Optic we actually tried it with stolen Siemens.",
                    "label": 0
                },
                {
                    "sent": "And there is also a fresh application that will be reported tomorrow by Martin Risk.",
                    "label": 0
                },
                {
                    "sent": "It's a row can company who used to be in ecommerce.",
                    "label": 0
                },
                {
                    "sent": "So OBD is is getting its customers.",
                    "label": 1
                },
                {
                    "sent": "But let's see what are the limits of the system where the system cannot do.",
                    "label": 0
                },
                {
                    "sent": "The job, which is expected from it to do.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And these are the hard keys for BDM.",
                    "label": 0
                },
                {
                    "sent": "This example example of Siemens turbine monitoring.",
                    "label": 1
                },
                {
                    "sent": "So you have it turbine.",
                    "label": 0
                },
                {
                    "sent": "I will explain you a little bit about them about this scenario.",
                    "label": 1
                },
                {
                    "sent": "So there is to buy and it has about 2000 sensors.",
                    "label": 1
                },
                {
                    "sent": "Sensors generate temperature, pressure and things like this and it streams it through some processing devices to the datacenters, so datacenters accumulate streaming data.",
                    "label": 1
                },
                {
                    "sent": "They have archived streaming data from last years.",
                    "label": 1
                },
                {
                    "sent": "They have static data about turbine structures and they have lots of other kind of data in this data centers on top of data centers.",
                    "label": 0
                },
                {
                    "sent": "The rest service centers where engineers are looking after turbines.",
                    "label": 0
                },
                {
                    "sent": "They posing queries to the data centers in order to check that everything is fine with the turbines.",
                    "label": 0
                },
                {
                    "sent": "And let's look at the example of the request, which is typically asked by service engineers, which makes life a bit off.",
                    "label": 1
                },
                {
                    "sent": "This is a query in a short form, so in junior would ask give me reliable sensors that are reporting alerting temperature.",
                    "label": 1
                },
                {
                    "sent": "So reliable sensors are those sensors that say passed validation test with score at least 90% every score.",
                    "label": 1
                },
                {
                    "sent": "This have proper sensors.",
                    "label": 0
                },
                {
                    "sent": "And very putting chaotic temperature.",
                    "label": 0
                },
                {
                    "sent": "What does it mean that the temperature is a loading?",
                    "label": 1
                },
                {
                    "sent": "It means that it is similar to what we have seen a year ago when there was, when there was a problem.",
                    "label": 0
                },
                {
                    "sent": "Then it's loading.",
                    "label": 0
                },
                {
                    "sent": "And the similarity can be defined, say, by Pearson correlation.",
                    "label": 0
                },
                {
                    "sent": "So you want to do Pearson correlation between the current stream and the archive stream from the last year.",
                    "label": 0
                },
                {
                    "sent": "Let's this is what's written in this longer version of the query.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so the characteristics of this query that first it tries to access both static and streaming data.",
                    "label": 0
                },
                {
                    "sent": "The current sensor data, historic data, some turbine structure.",
                    "label": 0
                },
                {
                    "sent": "It tries to do some kind of simple analytics.",
                    "label": 0
                },
                {
                    "sent": "It computes averages like aggregate which aggregate functions.",
                    "label": 0
                },
                {
                    "sent": "Here's this at least 90, which is very comparison, and it has Pearson correlation, so this kind of things happening in this query.",
                    "label": 0
                },
                {
                    "sent": "And this these things are hard for Billy, why?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "M Well, first of all, existing committee systems focus.",
                    "label": 0
                },
                {
                    "sent": "I don't static on streaming data and were not aware.",
                    "label": 1
                },
                {
                    "sent": "Maybe the rabbit we're not aware of systems that can do both streaming and starting and well, not just swimming in static, but in general to combine sources or different nature.",
                    "label": 0
                },
                {
                    "sent": "An another thing is that existing computer systems are really good for congenital queries, but they're not so good for analytics, in which sense?",
                    "label": 1
                },
                {
                    "sent": "Whenever you have an analytical kind of query when if you want to compute just on average, how would you do it on a video game?",
                    "label": 0
                },
                {
                    "sent": "You know BDA.",
                    "label": 0
                },
                {
                    "sent": "You would first ship over data to the consumer and then you do your average on top of it.",
                    "label": 1
                },
                {
                    "sent": "This is 1 approach and this approach has his limitations because then you would need to ship a lot of data just to get one average and a lot of data is redundant and you would ignore source capabilities.",
                    "label": 1
                },
                {
                    "sent": "Average could have been already somewhere in the databases, but you just didn't check it this.",
                    "label": 1
                },
                {
                    "sent": "This corresponds to the epistemic semantics of aggregates.",
                    "label": 0
                },
                {
                    "sent": "An another way of doing aggregates is to encode them directly in mappings.",
                    "label": 1
                },
                {
                    "sent": "You just can put all your analytics and mappings and and and that would do you the job, but.",
                    "label": 0
                },
                {
                    "sent": "The problem here is that you're anyway breaking the OBD philosophy.",
                    "label": 0
                },
                {
                    "sent": "You are going from a declarative specification into the very much query dependent specification of a system.",
                    "label": 0
                },
                {
                    "sent": "And it requires you to encode a lot of values and their mappings.",
                    "label": 0
                },
                {
                    "sent": "It's not cool, so this these two possible approaches that exists with existing copy we don't like.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And what we think is a good way to go is to think of a different ability system.",
                    "label": 0
                },
                {
                    "sent": "New generation system for the company.",
                    "label": 0
                },
                {
                    "sent": "That's a processes data of various kinds, not just relation about streaming and so on data.",
                    "label": 1
                },
                {
                    "sent": "And company that is naturally analytics oriented.",
                    "label": 0
                },
                {
                    "sent": "So for them we think that it's really good to have systems that are first analytics aware.",
                    "label": 0
                },
                {
                    "sent": "What does it mean reddix aware?",
                    "label": 0
                },
                {
                    "sent": "So they support declarative specifications or analytic operations.",
                    "label": 0
                },
                {
                    "sent": "So basically there all the things that we see here.",
                    "label": 0
                },
                {
                    "sent": "So the ontology, then the query language and the mappings, they should become analytics aware they should know about analytics.",
                    "label": 1
                },
                {
                    "sent": "And actually then we need a new processing mechanism that would take queries, analytical queries, rewrite them and then fold them into the data queries.",
                    "label": 0
                },
                {
                    "sent": "So the whole the whole is architecture to hold these things should be rethink riford redesigned in order to support analytics.",
                    "label": 0
                },
                {
                    "sent": "So it should become all ameritox aware.",
                    "label": 0
                },
                {
                    "sent": "That's well, that's one thing that we.",
                    "label": 0
                },
                {
                    "sent": "That we see relevant.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another thing is that.",
                    "label": 0
                },
                {
                    "sent": "OBD system should become source and cost aware what does it mean?",
                    "label": 1
                },
                {
                    "sent": "It should support sources of various kinds like this.",
                    "label": 0
                },
                {
                    "sent": "Streaming, relational other whatever databases.",
                    "label": 1
                },
                {
                    "sent": "So lots of databases should be possible to plug and the system should natively offer robust.",
                    "label": 0
                },
                {
                    "sent": "Query planning and optimization back and so the back end optimization should not be seen as something that we don't care in a third party database will give it to us.",
                    "label": 0
                },
                {
                    "sent": "It should be already in integral.",
                    "label": 0
                },
                {
                    "sent": "A first class citizen inability system in order to support all these analytics and things that we need.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now in the remaining part of the talk, I will just give him fast tour through the things that we proposed as a possible way to make an OBD movies knew OBD.",
                    "label": 0
                },
                {
                    "sent": "It will be.",
                    "label": 0
                },
                {
                    "sent": "It will consist of two parts, so the first part is about this higher level about analytics where ontologies queries mappings and the query transformation.",
                    "label": 1
                },
                {
                    "sent": "I will give you what we propose.",
                    "label": 0
                },
                {
                    "sent": "I will show you what you propose.",
                    "label": 0
                },
                {
                    "sent": "And then in the second part you will see the Dungeons.",
                    "label": 0
                },
                {
                    "sent": "So the database part about you will see about career planning optimization.",
                    "label": 0
                },
                {
                    "sent": "Then the experiments we conducted.",
                    "label": 0
                },
                {
                    "sent": "That's the outline.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK. Let's move to the analytic awareness.",
                    "label": 1
                },
                {
                    "sent": "The first thing that should become analytically risen, teologi as I said, and this is how this ontology may look like.",
                    "label": 0
                },
                {
                    "sent": "It's a proposal where we took their light why daylight cause into the description.",
                    "label": 1
                },
                {
                    "sent": "Logic behind I will do all Tokyo which is the language for OBD.",
                    "label": 0
                },
                {
                    "sent": "And we enhanced their light with new types of concepts, analytical where concepts.",
                    "label": 0
                },
                {
                    "sent": "This is how they look like.",
                    "label": 0
                },
                {
                    "sent": "So in order to deal with reliability, one can say that entities whose minimum test score is at least .9 unreliable.",
                    "label": 1
                },
                {
                    "sent": "So this kind of these kind of.",
                    "label": 0
                },
                {
                    "sent": "Axiom with an aggregate.",
                    "label": 0
                },
                {
                    "sent": "Class I could do the job to encode these aggregates and things, so the syntax of the language I don't want to go in details.",
                    "label": 0
                },
                {
                    "sent": "It's basically dialight as it is with an extension that you have new types of of concepts and they should be used in a careful way in the axiomatics.",
                    "label": 1
                },
                {
                    "sent": "And semantics for these concepts is closed world.",
                    "label": 1
                },
                {
                    "sent": "Why?",
                    "label": 1
                },
                {
                    "sent": "Because we're talking about aggregates.",
                    "label": 0
                },
                {
                    "sent": "Open World doesn't even make sense for them.",
                    "label": 0
                },
                {
                    "sent": "And conjunctive query answering under the restrictions that we imposed is tractable.",
                    "label": 1
                },
                {
                    "sent": "Assuming that aggregation is tractable.",
                    "label": 0
                },
                {
                    "sent": "And thanks to this closed world listen the assumptions.",
                    "label": 0
                },
                {
                    "sent": "And yeah, there is a paper that gave us an inspiration to show their electability of conjunctive query answering.",
                    "label": 0
                },
                {
                    "sent": "So this anthology underwear then we.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The language statical some of you have seen it yesterday at the demo.",
                    "label": 0
                },
                {
                    "sent": "This language inputs it allows so this is the query that actually expresses there this reliable turbine that returns suspicious data.",
                    "label": 0
                },
                {
                    "sent": "So this is the running query written here.",
                    "label": 0
                },
                {
                    "sent": "So in this query input static.",
                    "label": 0
                },
                {
                    "sent": "Static data.",
                    "label": 0
                },
                {
                    "sent": "The queries the queries for the for the static parts are conjunctive becausw.",
                    "label": 0
                },
                {
                    "sent": "Our ontology does efficient processing only for conjunctive queries and the streaming part is about diagnostic queries with aggregation.",
                    "label": 0
                },
                {
                    "sent": "Simple and advanced.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that's more or less what the query can do.",
                    "label": 0
                },
                {
                    "sent": "How do we process these queries?",
                    "label": 0
                },
                {
                    "sent": "We posted this queries in two steps.",
                    "label": 0
                },
                {
                    "sent": "So first we take this statical query which has static conjunctive query in the streaming query, rewrite it into a static QCQ unit, union of conjunctive queries and then you streaming query and then you can fold it into aggregate SQL and still another streaming query that both fit in the Sqlplus language which is the language of our back end.",
                    "label": 1
                },
                {
                    "sent": "So this rewriting essentially does the same thing as perfect information for the alive.",
                    "label": 1
                },
                {
                    "sent": "Basically, we reuse the strategy of standard OBD and it's by design.",
                    "label": 0
                },
                {
                    "sent": "We do this an unfolding relies on two kinds of mappings, standard mappings and aggregate mappings.",
                    "label": 0
                },
                {
                    "sent": "That's an aggregate mapping to map aggregate concepts to the to the database so that we had to bring a new kind of mapping sent to the game.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "A couple of words about how we do.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But at the back end.",
                    "label": 0
                },
                {
                    "sent": "So in the in the data, then in the database Dungeons.",
                    "label": 0
                },
                {
                    "sent": "So what's happening there?",
                    "label": 0
                },
                {
                    "sent": "And we have a system exist stream integrated into this platform.",
                    "label": 0
                },
                {
                    "sent": "Ann, this is the data stream management system that is extension of SQL, SQL Lite DB engine.",
                    "label": 1
                },
                {
                    "sent": "It has this special sqlplus queries language.",
                    "label": 0
                },
                {
                    "sent": "There is essentially SQL enhanced with special user defined functions for analytics.",
                    "label": 1
                },
                {
                    "sent": "It has a smart planner, so this is the part in the Orange box, and the planning is based on queries and execution environment and so on.",
                    "label": 0
                },
                {
                    "sent": "And it has the parallel parts, so a bunch of workers that is the green ones that can take care of parallel distribution, parallelization.",
                    "label": 0
                },
                {
                    "sent": "So how the query processed so it comes to the gateway, then it goes through optimization.",
                    "label": 0
                },
                {
                    "sent": "It comes, it reaches the scheduler, then it gets split into bunch of workers who then running the query.",
                    "label": 0
                },
                {
                    "sent": "So that's essentially how this how the queries processed.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then to make these things run efficient, we developed a bunch of optimizations which essentially of three kinds.",
                    "label": 0
                },
                {
                    "sent": "So one bunch of optimizations enabled streaming for streaming live streaming data.",
                    "label": 0
                },
                {
                    "sent": "Another one is about archived data, and the third one is for queries which hybrid which combines streaming and archived data, and basically for all of them there are two directions.",
                    "label": 0
                },
                {
                    "sent": "One Direction is data views, so we precompute relevant data in advance, and the second things.",
                    "label": 0
                },
                {
                    "sent": "Is adaptive adaptive indexing that we that we are also using took care some other things?",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sam just a simple example how these views work.",
                    "label": 0
                },
                {
                    "sent": "If you have such a table of measurements and what we do based on the frequently asked queries when this tent, which are relevant windows and then we precompute, average, safer this Windows or it could be any other function, and then we embed it into the historic data like this.",
                    "label": 0
                },
                {
                    "sent": "There is fun fun calibration.",
                    "label": 0
                },
                {
                    "sent": "You see, they move soaps or they don't anymore.",
                    "label": 0
                },
                {
                    "sent": "So yeah, so this animation that does the job.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, we evaluated our system optimizations.",
                    "label": 0
                },
                {
                    "sent": "Do the great job view based optimization.",
                    "label": 1
                },
                {
                    "sent": "Meet.",
                    "label": 1
                },
                {
                    "sent": "Significant impact on Pearson correlation.",
                    "label": 0
                },
                {
                    "sent": "An other analytical function.",
                    "label": 0
                },
                {
                    "sent": "Simple aggregates.",
                    "label": 0
                },
                {
                    "sent": "And parallelism also when we split into 16 nodes, it really gives us good performance.",
                    "label": 0
                },
                {
                    "sent": "When we did analytics for one live stream and about 100,000 of archive streams.",
                    "label": 0
                },
                {
                    "sent": "So we combine them together.",
                    "label": 0
                },
                {
                    "sent": "One life 1000 / 100,000 archived streams.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK to conclude.",
                    "label": 0
                },
                {
                    "sent": "What we proposed.",
                    "label": 0
                },
                {
                    "sent": "So we started with with an understanding of limitations of classical BDA.",
                    "label": 0
                },
                {
                    "sent": "We found the killer example of this turbine diagnostics where classical obedience failed to perform well.",
                    "label": 0
                },
                {
                    "sent": "And we introduce.",
                    "label": 0
                },
                {
                    "sent": "Type of wood media, which should be really relevant for industry because the example we gave it's not a very obscure example that is just to show the limits of ability limitations.",
                    "label": 0
                },
                {
                    "sent": "It is a generic example of generic problems and industry and we propose new kind of a PDA.",
                    "label": 0
                },
                {
                    "sent": "We instantiate it.",
                    "label": 0
                },
                {
                    "sent": "This all these things, an example analytical where queries, ontologies, mappings and so on.",
                    "label": 0
                },
                {
                    "sent": "And we conducted a bunch of experiments.",
                    "label": 0
                },
                {
                    "sent": "So that's.",
                    "label": 0
                },
                {
                    "sent": "That's what you've done, thank you.",
                    "label": 0
                },
                {
                    "sent": "Yes, in our experience we actually push the aggregates and stuff.",
                    "label": 0
                },
                {
                    "sent": "In the mappings.",
                    "label": 0
                },
                {
                    "sent": "I mean, you say there's a tradeoff and stuff we we.",
                    "label": 0
                },
                {
                    "sent": "We push everything to the database and look works great for us and you can see you can put that in the ontology.",
                    "label": 0
                },
                {
                    "sent": "You can put that into query so there's different trade off so you can imagine.",
                    "label": 0
                },
                {
                    "sent": "Have you compared about do what you did versus putting the aggregates.",
                    "label": 0
                },
                {
                    "sent": "For example in the mappings and see what the difference is.",
                    "label": 0
                },
                {
                    "sent": "So, well, conceptual one could do conceptual comparisons and also say execution some evaluation for the comparison.",
                    "label": 0
                },
                {
                    "sent": "We didn't do any evaluations to compare these approaches, but on the conceptual site we see the main shortcomings we see is that if you put it all on the mappings then basically you don't know how these things are happening.",
                    "label": 0
                },
                {
                    "sent": "You have some class say reliable in your ontology and you have no idea what does it really mean this reliable everything.",
                    "label": 0
                },
                {
                    "sent": "That describes this reliable the sensor.",
                    "label": 0
                },
                {
                    "sent": "This evaluation tests 90% or whatever averages all of that is hidden somewhere under the hood.",
                    "label": 0
                },
                {
                    "sent": "In the mappings, and the data consumers.",
                    "label": 0
                },
                {
                    "sent": "So the engineer who will will try to use reliable, he will not really know, is it the reliability he needs or not.",
                    "label": 0
                },
                {
                    "sent": "So it's all hidden in the mappings and the consumers that don't have access to these mappings, they only see what is on the ontology level.",
                    "label": 0
                },
                {
                    "sent": "And then, for example in this case, if you encode it all in the mappings, so we have one reliability for one type of turbines, which is say 90% of the tests.",
                    "label": 0
                },
                {
                    "sent": "Robust, successfully, another kind of reliability and only 75% test and so on.",
                    "label": 0
                },
                {
                    "sent": "So for each of them you will have the zillions of different.",
                    "label": 0
                },
                {
                    "sent": "Glasses, reliability classes.",
                    "label": 0
                },
                {
                    "sent": "Each of them doesn't say white is.",
                    "label": 0
                },
                {
                    "sent": "What does reliability mean there?",
                    "label": 0
                },
                {
                    "sent": "It's all hidden under the hood and then that will be quite quite challenging to to understand whether that.",
                    "label": 0
                },
                {
                    "sent": "So that's this is the major say limitation we see from the conceptual site.",
                    "label": 0
                },
                {
                    "sent": "That's a fairpoint.",
                    "label": 0
                },
                {
                    "sent": "I think depending on the on the user right ginir want that.",
                    "label": 0
                },
                {
                    "sent": "But yeah, right right.",
                    "label": 0
                },
                {
                    "sent": "Please more questions.",
                    "label": 0
                },
                {
                    "sent": "So you your example.",
                    "label": 0
                },
                {
                    "sent": "You showed this streaming data but wouldn't the problems of classical lobby they also appear if you want some data analytics over static.",
                    "label": 0
                },
                {
                    "sent": "Date does the zogre gates.",
                    "label": 0
                },
                {
                    "sent": "I mean on other people who also should use this or be there to zero in that case and completely agree.",
                    "label": 0
                },
                {
                    "sent": "So yes, so that's it already build manifest itself.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so definitely not the sort of simpler motivation why you need this ability to 0 or something like that.",
                    "label": 0
                },
                {
                    "sent": "And well, we try to to address a wider scope.",
                    "label": 0
                },
                {
                    "sent": "We try to address the wider scope of problems so and internist and problematic spider.",
                    "label": 0
                },
                {
                    "sent": "But but I agree, so you could.",
                    "label": 0
                },
                {
                    "sent": "You could separate the problem and separate, say faces.",
                    "label": 0
                },
                {
                    "sent": "One is too.",
                    "label": 0
                },
                {
                    "sent": "Support simple abelian obligation, but you can support data sources of variance, various counts, kinds, streaming some text files and whatever, and the other problem is to support aggregation, but in the in the example scenarios we've seen, like this one, we also seen scenarios from Statoil.",
                    "label": 0
                },
                {
                    "sent": "They these problems are usually hard, and they don't rely on specific type of data sources, so it's just our observational that if you want the system to do something.",
                    "label": 0
                },
                {
                    "sent": "Practical event it has to take several things into account.",
                    "label": 0
                },
                {
                    "sent": "Already, so you cannot just make it solving one problem.",
                    "label": 0
                },
                {
                    "sent": "Then it will not solve the bigger problems.",
                    "label": 0
                },
                {
                    "sent": "OK, sorry, we're having time.",
                    "label": 0
                },
                {
                    "sent": "So let's continue offline.",
                    "label": 0
                },
                {
                    "sent": "Thank you, so let's thank the speaker.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much, thank you.",
                    "label": 0
                }
            ]
        }
    }
}