{
    "id": "2wl3kbzrbmbdbjkjft3rca7rt3zup65f",
    "title": "Mining Complex Entities from Heterogeneous Information Networks",
    "info": {
        "produced by": [
            "Data & Web Mining Lab"
        ],
        "author": [
            "Fabio Ciravegna, Department of Computer Science, University of Sheffield",
            "Andrea Varga, Department of Computer Science, University of Sheffield"
        ],
        "published": "Nov. 29, 2011",
        "recorded": "September 2011",
        "category": [
            "Top->Computer Science->Data Mining->Social Content",
            "Top->Computer Science->Network Analysis->Social Networks",
            "Top->Computer Science->Web Mining",
            "Top->Computer Science->Social Computing",
            "Top->Computer Science->Social Media"
        ]
    },
    "url": "http://videolectures.net/ecmlpkdd2011_ciravegna_varga_networks/",
    "segmentation": [
        [
            "Now first of all, thanks for coming in for staying for the last day, and this is a tutorial mining complex entities for literal genius information networks.",
            "There are three people who have contributed to this workshop, but just two are presenting stuff with the person is missing with young.",
            "Vicky's Chinese couldn't get the visa for the Schengen area is quite a common problem, becoming a serious problem when you travel from the UK.",
            "The other person is Andrea Vargas here with me an unfamiliar Wagner.",
            "We are from the University of Sheffield.",
            "OK, thank you OK. Now.",
            "This is a quite cozy environment.",
            "There are so many people, so if you have any question you want to interrupt it, feel free to do so.",
            "The only warning is that with the key mixing we may not be able to give all the answers because he's done apart and then we have tried.",
            "We will try our best.",
            "Let me ask you some questions.",
            "We start with asking the audience so it's always nice to ask the audience how many of you have used a social network.",
            "In your life, Facebook, Twitter.",
            "These kind of things.",
            "Right, it's quite interesting.",
            "I teach a module on I'd intelligent web, and until three years ago I had to explain to students with Facebook walls.",
            "And now when I start my lectures, I discovered that these students are able to develop applications in Facebook already, so things have become quite the basics and it's very interesting and this is what we want to talk about today.",
            "What we want to do today is talk about how to get information out of social networks when we.",
            "What we call it intelligence information networks.",
            "We actually mean social network."
        ],
        [
            "So I said you probably know what the social platform is.",
            "It don't think of just Facebook.",
            "Think of a number of other interesting applications that you may have used on the web.",
            "Edit The fundamental thing is that they generate.",
            "They allow you to generate user user generated content to generate user content.",
            "Now user content is the largest amount of information on the web at the moment.",
            "And it comes to be."
        ],
        [
            "Actually I research goldmine.",
            "Because you can, for the first time we can get an incredible amount of information.",
            "Completely available for free.",
            "If you think of just tweets with 200 million tweets a day, that's between 2000 to 600 a second, 66 or 2006 thousand a second, 6000 to pick it up big time.",
            "It's quite obvious that there is a lot of information, but it's too much information maybe.",
            "And what you can do with that you can get some knowledge of it if you are able to do it, you can create applications for marketing.",
            "You can application for trying to understand."
        ],
        [
            "Public opinion and it turns out that if you look out what happens, any event that you can think of.",
            "They tend to be covered by social networks, especially if you talk about Twitter or Facebook.",
            "And the, and especially when the when the news of breaking news like earthquakes or fires or shooting or whatever you can think of what Brian, if you're from the UK, this is quite a good topic.",
            "And they need to be covered very quickly by by social networks and much better generally than the normal news channels with.",
            "Basically 'cause people are everywhere, why the journalists are not everywhere and people tweet.",
            "I was discussing with one guy from the emergency services in Sheffield and he said imagine that you are stuck on a tree and there is a dog chasing you.",
            "What do you think the average person will do?",
            "Well most of the time they will tweet about that so they don't call the police, they treat and it's quite amazing every time there is an emergency people tweet again are about it.",
            "Now this is good because for the major events, while in any case there is coverage for the minor events like I don't know the local bonfire night in Sheffield.",
            "This is not covered by the dining news or it was covered with 10 minutes on the on the local news.",
            "You talk about road closures.",
            "Takes an awful lot of time to tell it to go through the radio, but it will be immediately there on Twitter or Facebook."
        ],
        [
            "And the kind of users that you can have tend to be quite broad.",
            "You can have users that are from all over the world or all over the place it depending on if it is a local event or not.",
            "They tend to a different age groups.",
            "Most people make the mistake of thinking of assuming the social networks are for young people.",
            "Actually the largest majority of Facebook users are my age.",
            "So this tells you that you know there is quite a widespread.",
            "They have different educational backgrounds and different cultures and different languages, which is of course the problem.",
            "And what is more, most important is that they tend to have a large number of points of use that is generally not what you get from."
        ],
        [
            "From the news.",
            "And is frequent and is instantaneously updated.",
            "So on in for example show that.",
            "Jordan did the fires in California in I think it was two years ago.",
            "The efficient news about where the fire was spreading the word very fast fires going through the country.",
            "The efficient use of very careful and basically they were not giving information because they didn't want to give any wrong information, therefore causing any any any harm to people like giving wrong information.",
            "But in doing so they were actually harming people because they were not telling them what was happening.",
            "But actually people were using Facebook and Twitter and with that they could pass very very careful information.",
            "If you think of the Virginia shooting I think it was three years ago.",
            "When a student, when they started killing people, equals Facebook, the main channel of communication for which people were actually telling each other, there is a guy with a gun going around and killing people.",
            "So this is quite important to get immediately when things happen, but it's also important to have comments and understanding what people have.",
            "The 2010 World Cup had 5200 messages that match just in English.",
            "Just just got this Twitter.",
            "So."
        ],
        [
            "Anything is fundamentally an opinion goldmine during both the 2008 US election and the 2010 UK election, it turned out that mining Twitter was actually able to tell you what the outcome of the election was going to be because that was quite precise.",
            "Even if you have to balance, because typically liberals tend to be twittering more.",
            "So you have to.",
            "You have to."
        ],
        [
            "Balance that.",
            "And what is most important for machine learning people is that is stacked standing, maybe in a weird way, but using tags in Twitter or using people in in Facebook, whatever you want to, Flickr has tax as well.",
            "But it's a formal tag and people tend to reduce taxes in Twitter you have retweets.",
            "You have mentioned people and so on and so on."
        ],
        [
            "So there is activated and large amount of information.",
            "But there are problems.",
            "There are clear problems because they are informal and they're driven by people."
        ],
        [
            "What have people done with this?",
            "But there are lots and lots of different studies have been done and Matthew and I have worked on identity disambiguation on the web for for understanding if your identity could be stolen with information that is on the web and what we did, we use information in social networks to train large scale classifiers or large scale information instruction.",
            "I'm getting better.",
            "Did to try to predict the strength of friendship by mining information by mining Facebook public opinions prediction using Twitter and identity communities and interest identification with with social networks.",
            "We will talk a little bit about the."
        ],
        [
            "If you flicker, of course you can use Clicker to create very larger corporate of images to type for information extraction using the captions.",
            "This is what Rebecca Barlow and I did.",
            "And then then.",
            "For example, Erica Moulton Lucia special worked in creating driving ontological relations from from tags from tags images in Flickr, and you can use YouTube to the sentiment analysis."
        ],
        [
            "Now there is a lot of interest this.",
            "These are two projects we have.",
            "And the first one was a European project called.",
            "We know it and the idea was also to harness collective intelligence.",
            "That means what everyone knows as a person as a community, as a mass of people, and in order to help the emergency services to react to a sudden event like a flood with a study.",
            "The Shepherd Flood in 2007.",
            "This will also mainly done by mining social networks and discussion forum.",
            "Plus people people could send messages and what you could do actually here was we provided a mobile application that continue over the event somewhere around and this is now finished and it's actually continued with another project is funded by by the UK Government.",
            "It is about tracking real time intelligence industries.",
            "That means in case of events like a riot or simply a festival, you want to know what is happening and why this happening so that emergency services or the police can go there.",
            "And this is, for example, one of the system was tested in the samples currently boarding Bristol that these are very happy event, but unfortunately there are also the nasty things happening and what the system was was actually instructing.",
            "Twitter and Facebook are to understand what was."
        ],
        [
            "There are lots and lots of workshops and this.",
            "Initial list of workshops and events.",
            "Academic events where you can get information and further papers, but let's talk about the techniques and the technical aspects of it."
        ],
        [
            "Anne.",
            "The fundamental thing that you want to do is restrict information over to get, for example, event information.",
            "Understanding what is happening and so on and so on.",
            "But first they have to cope with very large scale.",
            "The second thing is that you have to go be languages even know what languages did the tweet or Facebook would be awakening.",
            "And as a matter of fact understanding what the languages is quite complex and we'll see some examples later.",
            "And there is a variety of information and different expertise people just surround on Twitter or Facebook.",
            "Sometimes they don't really say anything.",
            "They just say what I what they feel or they're actually giving information.",
            "Some of the information can be misleading.",
            "Someone information can be wrong.",
            "Just what they think.",
            "You may consider people working more sensors that can be faulty or can be precise and so on its own rather than as people providing information.",
            "This is one of the things that people do.",
            "But it's fantastic because there is a lot of there, and therefore if you're able to remove the noise, you will have lots of information for free."
        ],
        [
            "So this is a scenario with.",
            "We will use briefly your in depth that is in the England versus Germany World Cup matches.",
            "It was a very controversial man match.",
            "What happened was this.",
            "Frank Lampard actually score a goal, scored a goal that neither free nor denies man actually saw, and that was two to one to Germany at the time.",
            "But they could have grown to two 2 instead of Germany, one for one.",
            "So it was a very controversial matched and you can think of.",
            "Running very high at the time, So what happens is that.",
            "What you want to do?",
            "You want to discover the events.",
            "During the match, you know what the events are because these are listed on the BBC website later, but if you can match those events with the ones that aren't mentioned in the tweets, you Start learning how how to extract to extract events from tweets.",
            "This is the fundamental thing you have.",
            "A fantastic training training corpus, or at least a corpus with answer.",
            "So what do you want to do?",
            "You want to know what the matches are?",
            "What happens with the players with the teams, and what the event."
        ],
        [
            "So how do we identify the content?"
        ],
        [
            "This is an example.",
            "Now this is an example of a tweet.",
            "I don't know if you can read it.",
            "It says I hate England, but they got robbed.",
            "The rights are proving the World Cup.",
            "They did it to the US twice and now they're doing it to England.",
            "Now, what does it say?",
            "It doesn't say anything, it just says it's referees fault.",
            "It's quite obvious this is what people generally do, but if you look at all the Twins, they tend to be talking about linesman referee.",
            "And it's quite clear in sequence.",
            "It's clear that there is an event there, and for some reason.",
            "If centered around the referee."
        ],
        [
            "So.",
            "What is there a free or or whatever The Who is in charge of the.",
            "Of the match is very interesting because one guy says, oh, it's a decision by the Empire.",
            "That is what you were using cricket and one other guys didn't actually is called the referee, so it's quite.",
            "I find it quite funny so you can talk about positive and negatives.",
            "Who is talking well about the referee who's who's actually criticizing everything.",
            "We know that no one talks really well about."
        ],
        [
            "Three, but this is the fundamental point.",
            "So how can we extract this information?",
            "And now can we get a list of of facts and events considering the fact that most people will actually be running like the guy we have seen, not giving exact information?",
            "There is a lot of work done on how people express feeling and how they behave during events.",
            "For example, people have realized that during an event when there is during a match, for example when there is an event, people don't retreat.",
            "This is very interesting because you are so excited.",
            "Immediately start typing.",
            "You don't look if someone else is already said so, but in a moment of quiet you see someone else has commented.",
            "Oh, you know, I really don't like this matches.",
            "So yeah, I agree.",
            "And you re tweet so by using all these here is clues and cues you can actually understand a lot about the context and therefore mining geology.",
            "But what we want to do first of all want to extract."
        ],
        [
            "Now we want to do it in a different in a difficult way.",
            "There are lots of techniques, shallow techniques that you can use in like a frequency analysis and so on and so now what we want to do here is to do something more complex, like extracting the information, the real information about the events.",
            "And we tried to use information instruction that is a technique that has about 20 years of history.",
            "Eddie Media is that you have pre specified information.",
            "You want to know about.",
            "This is generally summarized in the form of a template that is a kind of form to fill for the system run ontology.",
            "You're more up to date with the semantic Web, for example.",
            "And what you want to do you want to populate a structured information source like a database.",
            "That's a fundamental."
        ],
        [
            "Task and historically, this has been defined as the number of tasks is quite varied than in 20 years.",
            "Things have changed.",
            "This is a classic definition.",
            "If you have a piece of years, the simplest thing that you can do is to recognize a classified entities, and so in this case the polar jackels is actually a person and Quest Inc. And Sri international companies.",
            "This is very, very shallow, but you can do it.",
            "And another thing that you can do is you are the opposite is actually to see that there is an event.",
            "Where company and questing today has hired a person called poor jackals.",
            "At the dentist, Aurora president and the company, there is a company that is called Sri International.",
            "Where?"
        ],
        [
            "There is a person with leading scope or jackets.",
            "We used to be the vice president.",
            "So because this is clearly capturing the whole event, this is an example from I think 1993 or 1994.",
            "So this is a very old example.",
            "I think Paul Jackets in the meantime has already changed it.",
            "Three or four companies, but there's a fundamental thing is so well established."
        ],
        [
            "Now this guy, I don't know.",
            "Logic actually gave this classification of information instruction.",
            "When you talk about information instruction, you can actually describe a number of dimensions to define the task.",
            "The first one is the type of input, the type of document security according to the type of input, you will have different types of techniques that you can use.",
            "We will talk about, for example, microposts.",
            "These are wireless.",
            "Basically type of input.",
            "Then you may have resources to see the information to see their learning with.",
            "If you use machine learning for example.",
            "So the type of input resources changes the way you can behave.",
            "If you can use, for example, a supervisor algorithm or announced device or semi supervised algorithms.",
            "And the method used for extraction.",
            "Of course, the algorithm the output of instruction changes according to the task and changes according to what you want to do with the output."
        ],
        [
            "Now we can talk about input.",
            "You can see a number of them.",
            "The easiest one template based documents.",
            "There is an example in the right inside a page from Amazon.",
            "This is generated by a database.",
            "All of them are identical.",
            "So there was an area of research at the beginning of 2000 called rapid induction system.",
            "It actually is supervised methods to extract to learn how to extract information from these pages.",
            "Now the challenge that we have is actually to do it over large scale on the web without adding any training material.",
            "So you go to any site.",
            "We discovered this.",
            "This type of site and you try to extract or other large scale.",
            "This is the current focus of research.",
            "Then there are semi structured documents so typically tend to be email.",
            "Or ads or resumes.",
            "And useful sometimes in newspaper articles.",
            "They are very well organized.",
            "This is an example of an email.",
            "You don't see what he says, but if I tell you that this is a seminar announcement, you will immediately understand what it does.",
            "There is a title somewhere there is an over.",
            "There is an affiliation and then there would be probably an abstract.",
            "This is all we need to know.",
            "You know that those pieces are there.",
            "Then there are microposts like for example tweets and Facebook world posts.",
            "And then there are completely open any sources.",
            "This is my web page.",
            "This is written manually.",
            "I do whatever I want.",
            "This is this is a table but.",
            "This is our images, I just wanted to do it that way."
        ],
        [
            "Now, if you want to see learning because this is a machine learning conference.",
            "There are lots of things that you can use.",
            "The first thing that machine learning or sorry, one information instruction person has to think about is how to use what you use to extract information and the typical thing is that you discover you will have lots and lots of information in terms of gas teases are lists of objects that you can you can use.",
            "You can have documents that have been annotated, or you can ask a user to annotate documents, even if sometimes this might be quite complex.",
            "You can have structured databases giving you examples.",
            "Or you can have unlabeled structures of course, to do things, supervised and unsupervised learning or more and more.",
            "There is a usable in data you may may have heard about.",
            "It's like schema.org and is now currently sponsored by Google and Bing.",
            "That enables you to tag information within your your pages.",
            "So basically you tell the search engine, not just.",
            "This is my site, this is the site of the of the workshop.",
            "This is the program and things that you generally have in the output are structured, but you actually tells the information on selling a product.",
            "This product is a car.",
            "The price is so and so on.",
            "So in the linked data is a much more complex thing, But this is more and more.",
            "Interesting because this is very very large scale.",
            "You can have it.",
            "I don't know if you know about linked data, but it's growing and there are billions of facts now completely.",
            "Restructure basically databases tag semantical target on the web that you can use to see learning.",
            "And of course there are lots of lots of documents that are tagged using those concepts in those instances.",
            "An using on the FA is as basic extension over X HTML, but you can use in HTML.",
            "But also using schema.org."
        ],
        [
            "I think there are other things.",
            "Well, what do you think is learning to use?",
            "Proofread them by hand.",
            "Useful statistics.",
            "What kind of output use?",
            "Just distract the entities.",
            "You also class.",
            "If you classified entities or you also try to recognize uniquely what they are associating what is called a unique unique resource identifier similar to the URL in pages.",
            "If you don't know what it is, so a web identifier.",
            "You can extract relations you can extract."
        ],
        [
            "Now we talk about an information instruction architecture.",
            "Seen from the point of view of the of the machine learning.",
            "Once we have like a set of a number of steps, they tend to be linguistica para linguistic.",
            "They tend to create to provide the features.",
            "Basic features that are typically linguistic features or very close to invasive pages.",
            "And then there is the core of the information extraction system.",
            "This is traditionally called preprocessing in between.",
            "Of course there is everything that you want to do with the feature selection of goals.",
            "So I suppose you may not know much about it.",
            "Basically, so we will give a short description of each of these steps that you are all computational linguists.",
            "Just let me know and ask."
        ],
        [
            "K. And so the first thing is a segment."
        ],
        [
            "Tokenization that is basically taking a document or a micropost, whatever you have and try to recognize whether our sentences.",
            "In this case, if my there's a year descriptional blah blah blah blah.",
            "At some point there is a full stop and says he was a commentator.",
            "This is the end of a sentence.",
            "Explaining the sentence is very simple if you have."
        ],
        [
            "Paper articles.",
            "It becomes extremely complex if you talk about informal text like this one.",
            "To look for FIFA two 2010 World Cup features, do the following one select schedule residents ticket type, select number.",
            "Proceed to payment option where is the end of a sentence.",
            "You can understand it because of the way it is formatted, but you may ask, is this the end of a sentence or not?",
            "If you talk about this microphone that I'm instructed yesterday, this is fantastic.",
            "I have no clue about the guy is saying.",
            "But where is the sentence here?",
            "I suppose this is the end of the sentence, but there is a comma.",
            "I suppose this is another end of a sentence.",
            "And I suppose this is at the end of the sentence.",
            "Can you read what it says?",
            "It says something like retweets and then there is an identifier retweet identifier yield.",
            "Identify this is Rihanna, the singer.",
            "What's good bro bro is brother?",
            "Email that I am, I suppose, ring you you as you in 15 minutes.",
            "Minor minor aside, how do you call my woman probe whatever that means - She is one word.",
            "My bro invades one word.",
            "I don't know if you can make any sense of it.",
            "I can't, maybe I don't know enough about Brianna.",
            "But apart from extracting semantic from this, even if you try to extract the sentences."
        ],
        [
            "Or even if you try to identify the words, it becomes extremely complex in newspaper article.",
            "How to identify word is pretty simple."
        ],
        [
            "Practice so you may have problems with the UK.",
            "Is UK one word when we know it is, but does a system now?",
            "Or do you segmented as U dot NK dot or U?",
            "Dot K dot.",
            "What is the right way of doing?",
            "Is this date a single token?",
            "How do you know it's a single token?",
            "And so if this is a single token, is medieval times slash that dark ages past single token?",
            "And then when you are here, Brian Babes, how do you know it's one word or two words or whatever that is there will ever be.",
            "So the more you go through this micropulse an informal user generated content, the more this becomes complex.",
            "This in any course in standard natural language processing will be the first 5 minutes now with micro pulse is becoming."
        ],
        [
            "Very complex.",
            "The second step is trying to understand to try to generalize a little bit the fundamental issue of our languages.",
            "That language is data is data, as in inflected data.",
            "So there are different types of forms of the same words, and you want to generalize overtime.",
            "You want to attract more and more features."
        ],
        [
            "So the first thing you want to do is to do lexical analysis.",
            "You take a word and you won't recognize what is called the base form or the word that you will find you will find in a dictionary.",
            "If I tell you companies and I ask you, check it up on the dictionary, you will look for company.",
            "This is exactly the task.",
            "So you have both stemming and lemmatization.",
            "Allow queries that you want to recognize, query instead."
        ],
        [
            "So you know my eyes it this way.",
            "And then.",
            "The other way of doing it is actually standing.",
            "That means to remove the.",
            "Whatever is the extension of the testing, so queries should be query without prior without the I.",
            "In form because form and word because word so you don't normalize the words with the original state, you actually do it by removing their designate.",
            "So the suffix and the difference is that in order to do that you don't need to know the world.",
            "Why?",
            "If you try to normalize that we've seen before, you need to know what the original format is.",
            "So especially with growing babes, you wouldn't know how to do it, so this is."
        ],
        [
            "More effective.",
            "Actually, this is what I want to say, but basically, why do you want to do it?",
            "Because otherwise you have data sparsity.",
            "You want to reduce the display."
        ],
        [
            "I dream I want to do some statistics as well, but for some languages you actually need something more.",
            "You need more full morphological analysis.",
            "Languages that are highly reflected in German for example, or some positraction.",
            "Spanish and French, you want to extract features like gender, number and case.",
            "If you have a case, lasting is a good example as well, provided you are interested in extracting from laughing.",
            "Any specially languages that are implemented so they can create words out of other words in English in German, if you want to talk about speed limit in English speed limiter 2 words in German, it becomes one word machine dekuyper Council and this is just a word that is being created on the spot and you can create anywhere that you want in this way as long as it is composed.",
            "But the first step you have to do in order to reduce the capacity is to break those bones and that is not a trivial.",
            "You need the dictionary to do that.",
            "You need some morphological analysis also of the words between in between.",
            "For example, to understand when one word that is maybe unknown actually recognizes and then becomes, for example, ambiguous.",
            "And so this is not an easy step, but it's very important in highly inflected languages, especially when you have aggregation.",
            "And when you have cases.",
            "So if you have that word in German that has again easy genitive.",
            "In that case, the word is modified, so gets an A."
        ],
        [
            "And then the next step is part of speech tagging, part of speech tagging means recognizing the.",
            "World class.",
            "So like this is a verb.",
            "Now, amazingly, you don't need to do to do morphological analysis.",
            "To do that, you can do it by just using the sequences of words and having some kind of dictionary there.",
            "So it's quite interesting because it's really, really precise, at least in.",
            "Newspaper like text.",
            "Unfortunately, again with our friend Anna wrong, so it becomes extremely complex because no one has any type of training material for this kind of things.",
            "So again, water in the standard natural language processing task was 97% accuracy.",
            "Not a problem.",
            "Don't spend 5 minutes on that.",
            "What you do because you want to teach people, but the point is, you don't consider it now.",
            "It's becoming a problem and it becomes a problem because most of the steps that follow will actually depend on."
        ],
        [
            "These are actually something not many people use that is the syntactic analysis.",
            "No syntactic analysis needs.",
            "Try to recognize the different constituents of a sentence and trying to understand the role that they play.",
            "This is the subject of the sentence or whatever."
        ],
        [
            "Now, the simplest way of doing that is very, very useful is to try to chunk chunk means to recognize the main groups, like a nominal group or a verbal groping.",
            "I think in this example you will have that Haifa is a noun group.",
            "An located is a verb group 53 mile.",
            "Mile is a noun group from Tel Aviv is wanna propositional group or a noun group with the proposition whatever you want to call it will host is a verb group an in 20 times.",
            "Again prepositional group or a noun group with a proposition.",
            "Now this is quite useful.",
            "But it tends to depend heavily on the on the output of the part of speech tagger.",
            "Because you must know that horse is a verb in this case and not an hour.",
            "Because it can be a noun, of course.",
            "Potentially they will, again is not the name of a person's William, but is again and again if we go through this.",
            "So how Nana rogues thing?",
            "We won't have a dictionary for most of this, so we don't have the starting point.",
            "The part of speech tagging counts on the fact that even if there are unknown words that would be just one or two in a sentence, maybe one, but in this case we have most of them, so doing the non group recognition of the verb group recognition may become difficult.",
            "And that means that when you try to recognize terms.",
            "You are in trouble."
        ],
        [
            "Well, at least you don't have the support you with it.",
            "I feel the level over syntactic analysis is trying to create dependency.",
            "Now, dependency analysis can work at different levels, can be full dependency analysis.",
            "Basically the full path straight or it can be something where you just connect some of the non groups in some of the verb groups.",
            "So in this case there is clearly what you're trying to say is that Haifa will host and what would be half that will be ACNL, so you create long distance dependencies by understanding what the subject is now again when you have micropost this may be very difficult because the part of speech is wrong and because we don't have most of the terms you don't know, maybe you don't have the verb and so on and so on.",
            "And the thing that you made."
        ],
        [
            "Point better is to create a constituency free complete food pathway like.",
            "This one is probably the thing that you have studied in whatever is in 660 year of school.",
            "Asking all these graphs.",
            "This is very difficult.",
            "It's very difficult, incredibly difficult for four use paper life documents, but there are.",
            "You can use lots of corporate trainer system when you try to do it for Micropulse.",
            "While you don't have a sentence you don't have part of speech, so you become more."
        ],
        [
            "Of course, if you talk about the web.",
            "Microsoft seems to be a web pages.",
            "You have more things that are very useful life tables.",
            "One of the big challenges at the moment on the web is large scale recognition of peoples.",
            "Can you go to the web and get any random table on any random page and try to understand what it is?",
            "Well if you use millions of tables.",
            "You can do a lot of stuff and this is one of the things that you can do.",
            "When you have a web page, it's very useful to be able to understand the XML DHTML is there and try to get the X path because the X path, for example, will give you a block of text that may be very difficult to recognize if you just look at features that are.",
            "There are not formatting features.",
            "Formed something is involved.",
            "Complete this credit.",
            "Or in a microphone, if there is an act in front is very important.",
            "You don't pass whatever it is there because it's a reference to someone.",
            "Anne.",
            "So ordering dependencies if you're on Facebook and someone post on your wall or you post on your wall in someone, answer the fact that this person is answering to you is very important in Twitter is not very easy to do because you have to understand the reason at something on the person.",
            "Maybe Cope is part of your document.",
            "It's becomes very mad, but actually you can still do it.",
            "And if you can do it, there are two things that you can do.",
            "First, study the activity of the social network.",
            "And the second thing that you can do is to understand the context.",
            "Because he had mentioned that concept.",
            "Maybe the other person would use a program like.",
            "It provides a useful analysis microposts.",
            "And the president can just define it under defining.",
            "Like if you say, well, I'm in Geneva and the other one says how is the Lake sort of generically is the Lake of Geneva, so understanding the complex is very."
        ],
        [
            "And then there is finally information extraction.",
            "We have created lots and lots of features.",
            "Here we can select them, talk a little bit about that.",
            "I supposed to remember if you have that.",
            "Anne."
        ],
        [
            "Talk about information extraction now.",
            "Information instruction is always been seen as a natural language processing, but especially in the case of microphones, it tends to be rather difficult in this sense to interpret like that.",
            "We have large scale.",
            "We have robustness.",
            "We have tasks.",
            "Who defines a task and we could give us the entire tutorial on web scale information extraction.",
            "Can you go out there and then to recognize anything?",
            "Given any any other user sitting down defining a task and then you go to the wedding extract information.",
            "The fundamental thing is that you need domain specific knowledge.",
            "If you talk about football, you must know there is a referee.",
            "You must know something else and so and so."
        ],
        [
            "Now let me just spend a little bit of time on the natural language features becausw.",
            "This has been widely disregarded, but I think that's a mistake.",
            "I'm.",
            "They can indicate reduced dramatically data."
        ],
        [
            "So.",
            "They can give you clues.",
            "Words are not independent from each other.",
            "They have.",
            "They follow some kind of pattern and people designing them that way.",
            "So even if you talk about Co presence over is called currency worth.",
            "The way they Co occur can be influenced by a number of factors, so don't just say they could occur, but try to understand how they occur.",
            "For example, the older they haven't.",
            "Nothing song is on.",
            "There is a clear relationship if you can do even a little bit of simple syntax syntactic analysis, try to do it, because they will actually give you an approach information.",
            "Of course, there are elements that are known innumerable.",
            "You can't, of course, learn.",
            "You're more than depending on the fact that there is a three there.",
            "If you write rule, you can't have a rule for three or four or five before and so on and so on.",
            "So numbers, time expressions, they tend to be very easily regularised, so you have to do it before.",
            "Um?",
            "And it said you want to generalize.",
            "You don't want to rule the size of.",
            "Whatever you have a John Smith, that's a speaker.",
            "That doesn't mean anything you want to say.",
            "If there is John Smith talks, you want to generalize to personate or so you try to."
        ],
        [
            "You can, this is something I've done about 10 years ago, but you can show that.",
            "In that case."
        ],
        [
            "The coverage of rules."
        ],
        [
            "Changing the accuracy changes at night."
        ],
        [
            "Coverage changes.",
            "So now let's go to the the actual meet.",
            "The action was kind of introduction.",
            "In case you didn't know about about text extraction.",
            "I appreciate it if you knew already if they need that.",
            "If you didn't know about that program was too much.",
            "I tried to simplify it, so let's talk about the first task.",
            "The first task is to recognize entities.",
            "There are three steps in recognizing an entity.",
            "First one is to spot it, so this is an interview.",
            "I don't know what it is, but this is an entity similar to what we do with the with the noun group recognition.",
            "The second step is to say yes, this is an entity and this person.",
            "This is a protein.",
            "This is whatever.",
            "Part of a jet engine.",
            "And the third one is to give unique identification.",
            "So this is a person is not a random person.",
            "Is John speed and it's not a random Joe Smith is John Smith the test that specific identifier?",
            "For example web page is a unique identifier or better, you're right if you have one.",
            "These are three states that are typically done in.",
            "Well, either in sequence or at least the first 2 can be.",
            "Compress, but the third one tend to be separated.",
            "Most of the literature actually doesn't consider unique identification."
        ],
        [
            "Now classification can be according to a number of tasks.",
            "The Classic One, I think it had something like 6 classes, but then during the years people started talking of hundreds of classes.",
            "But we can identify two things.",
            "One is what we call the named Entity recognition dozen organizations, and so on and so on that you can have another 100 classes.",
            "But they do.",
            "They tend to be pretty generic classes that every person can recognize.",
            "And then there is what we call terminology recognition.",
            "Terminology recognition is typically domain dependent, and those terms tend to be pretty complex.",
            "Bioinformatics has lots of terms, mechanics have incredibly complex terms.",
            "We will see examples examples later.",
            "So."
        ],
        [
            "The unique identification, as said before, requires this recognition of.",
            "Person A unique way and this is.",
            "This is an HTTP UI that you would call it a URL, but it's not that you're right because it's actually a UI.",
            "Oryza type of Europe sorry get away around the URL is this type of you right?",
            "But this does this thing right?",
            "This is."
        ],
        [
            "Of the semantic web.",
            "Now when you do it with this structure, what people do at least is tokenization.",
            "But more and more people try to do so this space."
        ],
        [
            "So.",
            "It's very important you understand the domain and you start collecting terms that are relevant.",
            "Commonwealth seen before and after the candidate president.",
            "President typical introduces a person, the president of whatever introduces a company or an organization.",
            "So in this case.",
            "FIFA president Zach Blatter.",
            "You want to understand the president is relevant to recognize?"
        ],
        [
            "People in their role.",
            "At the same time, you can have a dictionary that tells you exactly.",
            "Is the name of the person the first name?",
            "You may know, you may not know Blatter because it specially surname, so you can't have on all the servers in the world.",
            "And if you have your in trouble because they think would be incredibly ambiguous.",
            "You can't have a complete list of more people names, but you can have a complete list of countries.",
            "Even if then they can be expressed in a slightly different way, so South Africa is, I think RSA is also called or can be called S dot Africa or whatever.",
            "So clearly the surface form can be different, but you can have a complete list."
        ],
        [
            "No, what we will do, we will briefly look at rules and then Andrea will introduce.",
            "Other types of more statistically oriented methods WHI do I introduce rules?",
            "Rules are not particularly considerate.",
            "Interesting is something that people were very keen on working at the beginning of 2002 thousand and three and then people set out.",
            "You can do actually much better with statistical methods.",
            "However, there is one fundamental reason why they are important.",
            "That you are as machine learning.",
            "People are always competing with the natural language.",
            "People who are writing rules and rules are incredibly powerful because people are incredibly smart, they can't cope with very large scale.",
            "But they can generalize very well.",
            "So understanding rules.",
            "Understanding your competitor is very important, so we give a short."
        ],
        [
            "Well, actually said this.",
            "Typically Arubas system has two parts.",
            "One is a collection of rules that can be learned or can be written by a person, and then there is a policy for applying."
        ],
        [
            "There are different types of entity rules, so you can generate.",
            "The goal is to introduce tags in the text, typically to the text, like SGML tags.",
            "In the old days, or today you can have XML tags or FA tags if you want.",
            "Um, there are fundamentally three approaches illiterate or one is discriminative.",
            "They try to recognize just the boundaries, or to classify the word in each individual word as belonging to an entity or outside DHT, or to recognize this is where your recognizes the entity and generative they try to recognize the whole entity and maybe a number of it."
        ],
        [
            "Now."
        ],
        [
            "Oh well, we you know."
        ],
        [
            "The features that you typically use it for role is autography type.",
            "In fact is lower case.",
            "For example, the part of speech.",
            "If you have one, 'cause it your information president is entitled.",
            "And then you can find more.",
            "Of course we have more clues."
        ],
        [
            "And this is the type of rule that.",
            "A person could write.",
            "This is from gate, DC, UK.",
            "That is something that a lot in Sheffield by another group.",
            "And what it tries to do, it tries to recognize subscription like a CME and TTD by using what is called designator.",
            "So you know that whatever is capitalized.",
            "Actually followed by one of these.",
            "Recognize these identifiers.",
            "It is actually.",
            "You know she's actually a company.",
            "It's a very simple rule, is very smart."
        ],
        [
            "And typically a general figure will have.",
            "With modern context, before the entity will try to model the entity with the things like, that can be more than one.",
            "In this case, is to recognize 3:00 PM.",
            "You can say there can be a number of digits.",
            "And then the context on the right hand side.",
            "And these tend to be incredibly good roles and they are applied also to my apples because a person can look at the macro posts and probably they can also understand him sometimes."
        ],
        [
            "You can try to identify more than an entity, of course.",
            "It would be fantastic to say every time a person talks about a person, it also mentioned the agent address.",
            "If you can do that, it's fantastic.",
            "OK if you do it by hand, you can do it.",
            "You try to learn.",
            "This becomes a little bit more more complex.",
            "This is an example of what today we would call the micropost that actually this is from 2000 I think, and that was just an ad for.",
            "A flat.",
            "Renting a flat.",
            "Now if you have never seen one, you don't have a clue what it means, but actually this is quite structured and if you can create a pattern like capital here, that is a place.",
            "Digit dollar number means that this is the neighborhood.",
            "This is the number of bedrooms and this is the data price.",
            "Sunderland data and begin."
        ],
        [
            "2000 again, but we will see that this is not very clever if you try to learn.",
            "If you use a discriminative rule, what you're trying to say is to say, well, look at this place here.",
            "Actually, it's the beginning of the start time.",
            "Start is start time.",
            "Also you know the seminar at 3:00 o'clock, so you don't want to say this is the start and you just say when it starts here and then another rule will tell you.",
            "This is where it ends, but it's another room.",
            "It's very difficult to write if you're a person, but you can learn that."
        ],
        [
            "I don't want another possibility is just to say in out in out in out.",
            "So this is not part of an entity.",
            "This is part of an entity or other versions are.",
            "This is the beginning of their entity.",
            "This is inside the entity.",
            "This is the end of an entity depends.",
            "There are several types of classification, but substantially they're all based on the classification of either of the single word or the classification of the space between 2 words."
        ],
        [
            "Belt.",
            "If you look at it from the point of view of learning.",
            "There is a fundamental difference if you try to model an entity, that's fine, But actually turns out that using discriminative rules it is actually more efficient.",
            "You need far more example less examples, because if you try to recognise something like regularly, what would be a regular instruction like at starting from when there is a time digit PM or AM time.",
            "This is a rule out right?",
            "If you try to recognize it, you need at least 4 examples.",
            "If you have a single roll.",
            "We that we we bounded rules, you just need 2.",
            "But actually if you try to learn this with multiple only becomes incredibly complex.",
            "So you need very lots and lots of examples.",
            "This is why those methods never never actually went.",
            "Very far away."
        ],
        [
            "Then, when the rules that we are the rules you have to fire them and you will have the usual issue of you will have competing rules for the same place.",
            "Saying that this is.",
            "This is a company.",
            "John Smith FTD is a company, but you will have a Rd sending you.",
            "John Smith is a person which one wins.",
            "Which one is the right one so you can choose the largest and you can train a machine learning system to try to recognize which cases are which.",
            "Or you can use.",
            "You can wait the rules.",
            "So, but this is actually where you lose lots of your.",
            "Your points."
        ],
        [
            "People tend to use rules with OK, so the question yes I was wondering.",
            "Find the beginning type but not the corresponding different one, but what happened exactly?",
            "Exactly, you have to balance them.",
            "Then see another task when use discriminative when you have a beginning and end, you also have to be sure that the pair and they don't care one at the beginning and the other one at the end of the text you have to wait the average length.",
            "You will have the maximum length, so there are lots and lots of things you have to do.",
            "The post processing is actually taking away a lot of results.",
            "If you if you don't do it properly.",
            "And you have to remove all these stories once as well.",
            "Well, I'm not going to do this again.",
            "This is something that is not being done for quite a long time.",
            "I mean there are lots of people still doing rule induction, but typically what people used to do at the time was considering that you can't simply learn all the rules in a silly way.",
            "People tend to use things like covering algorithm or Hill climbing.",
            "Or is that right or recognized?",
            "First of all, take an instance.",
            "Inducible and then we'd see walking distances in the training set will cover, remove them and start with another one.",
            "But I'm going to do this because I just wanted to mention it.",
            "Please don't forget about that because we're offering.",
            "So now these types of algorithms today rules tend to be quite effective.",
            "Any questions so far?"
        ],
        [
            "OK, so.",
            "I think I can give to Andrea to talk about more brain things that I'm able to do.",
            "One thing we don't have a break, but we may have time for one.",
            "So if you tell us about the break, if you need a break just.",
            "We may decide, maybe not in when you finish this, but maybe we can operate.",
            "Yes, OK can you?",
            "So what the accent?",
            "So five days begin expect and it is using the rule based approaches.",
            "But as the manual creation of the rules became very tedious so people started to use statistical machine learning approaches and what we will see in the next few few methods used to extract entity recognition.",
            "And after that we will discuss some other methods which were used for extracting relations."
        ],
        [
            "So there are two models for doing entity recognition.",
            "One is a local level model.",
            "When we are given a sentence and we consider a sentence as a sequence of tokens and they want to identify to classify each of the tokens whether they are part of an entity or they are.",
            "So in this example, given the centers assuming Aggrastat reserve PM is afternoon, the time expressions 3:30 PM.",
            "So this will return to us this time expression and also there is another way of decoding the boundaries of our entities.",
            "So we might want to identify two to denote.",
            "When did this start?",
            "And when it ends.",
            "And this type of formalization can be more important, can be more useful than the previous one.",
            "In cases when we have more entities one after another, it will allow us to distinguish when the second one starts."
        ],
        [
            "And there are the entity level models which will consider which we want to find them.",
            "Sentence it was it wants to return a sequence of entities by trying to group the words so they will return us as well.",
            "3:30 PM as being the time expression."
        ],
        [
            "So just to introduce a little bit of formalism which we will be using when we will discuss the statistical machine learning based approaches for entity recognition.",
            "So we will get along with X or the instances that we want to classify, for example, or the sentences and we will denote with why our label set plus one will denote that dog and is an entity belongs to an entity and minus one that isn't an entity.",
            "So such language could be like.",
            "Location or if you want to do recognition might be location person names.",
            "Or can I try that be by part of speech tags and Furthermore we make a statistical assumption that our data lies in so follows a distribution.",
            "Both our training and test data.",
            "And this first was the IID assumption that.",
            "Our training data is identically independently distributed from this trip in distribution.",
            "So what we are giving to the sticker machine learning.",
            "Classifier is a set of of instances which are labeled with the corresponding labels."
        ],
        [
            "And what we typically want to do, we want to learn a mapping function which will map our instances to our labels and in entity recognition our neighbors are discrete.",
            "We only want to identify whether a token is a location or a person.",
            "Oh, but in more general case, we might want to map our instances to real numbers.",
            "And we will know about the value of this function by while."
        ],
        [
            "So what we want to do, we want to find the optimal predictor which will give us the best label sequence for a given input sequence, and so we want to maximize this conditional probability distribution and by applying Bayes rule we can easily see that this is the same as maximizing this joint probability distribution.",
            "However, our problem is that we don't know this.",
            "Is so distribution before hand we only have a sample of training examples.",
            "So what we want to do, we want to estimate this empirical distribution and once we estimated we want to use this model to make further reading."
        ],
        [
            "So the question then arises, how can we decompose this joint probability distribution?",
            "And according to this the statistical machine learning approaches fall into two categories.",
            "One are the generative approaches which tries to explain the process behind how the data has been generated and the discriminative approaches which tries to directly model the data.",
            "And."
        ],
        [
            "Yes, so if you just have a short, for example, which demonstrates the idea behind these generative approaches.",
            "So let's say that we want to write a document about athletics.",
            "So about those specific events, so this article is from the Guardian whose value.",
            "And we trust different topics such as football, cricket, tennis and athletics.",
            "So if you know the topics and the content then we can write a story about the about this specific event."
        ],
        [
            "So which correspond, and if you know the probability distribution of the labels and this conditional probability, then we can.",
            "Right the the main story."
        ],
        [
            "And in one class the discriminative approaches, they directly want to know that.",
            "So they are only interested in modeling.",
            "The task, So what is the best best label sequence for a given input sequence?",
            "They don't want to know that the whole joint probability distribution, and because there is no need when we will do for the predictions in the future.",
            "So there is the one don't need for compute."
        ],
        [
            "That so this table contrast the two approaches before hand.",
            "If you're given a tax task, we don't really know which one works better, so people typically try both of the approaches.",
            "And so the generative approaches are useful, and we want to generate examples and discriminative approaches are used for doing good predictions.",
            "When our data fits the real world, the generative approaches works better.",
            "And the discriminative approaches works even when the nature of the distribution is unknown.",
            "And typically the generative approaches are often simple, similar to train, because it involves mostly just the counting and the discriminative approaches the model only this conditional distribution."
        ],
        [
            "So not coming back to the actual models which has been applied for entity recognition.",
            "So people firstly try to use generative approaches for doing anything recognition and then discriminative approaches and we will understand.",
            "So we will see in the coming slides.",
            "The main properties of this or this classify."
        ],
        [
            "Others.",
            "So we will start with him."
        ],
        [
            "Murders.",
            "So hidden Markov models tries to explain the data in the observation in terms of the hidden variables.",
            "So in what follows we will denote the observations that opens from the sentences with shaded circles and the label that we assign to them with the unshaded.",
            "So.",
            "Has somebody?",
            "Such as the transition probability.",
            "What is the probability of assigning the given label to token given the previous label assigned to the previous token and also the emission probabilities?",
            "Which is a probability of over token given the even the label.",
            "So what they do again?",
            "So they are generative approaches, so they model is joint probability distribution."
        ],
        [
            "And So what we want to do.",
            "So during training we want to estimate this probability distributions.",
            "The transition and emission probability distributions.",
            "And once we have have done during inference, we want to find the best label sequence for the.",
            "For The Vamps elevations and for this we can use the Witherby algorithm."
        ],
        [
            "Yeah, so there is an extension of the garment extensions we don't like with us.",
            "One of them it takes.",
            "It's called and order hidden Markov model, which when it makes a decision about a particular label, it takes into account not only the previous label but also the previous and label assigned to the previous and.",
            "Tokens.",
            "So this is a.",
            "So the transition probability will depend on the previous and labels as well, so there are some advantages of this model because it has has a better memory and.",
            "However, with this the number of parameters and the computations became much more heavier and difficult."
        ],
        [
            "So few limitations on the hidden Markov model.",
            "One is relies on its independent assumption that token only depends on the on the labor state, and therefore this model doesn't allow us to incorporate some important features that we have seen so far that capitalization and part of speech tagging are very indicative for Internet recognition, so this model doesn't let us incorporate this information.",
            "And the other one it comes from its generative nature that we typically don't want to estimate the whole joint probability distribution because what we want to do to just do predictions."
        ],
        [
            "So therefore the second class of algorithms trained overcome this problem and they are discriminative, so they only want to compute this discriminative this conditional probability."
        ],
        [
            "So one of them.",
            "One of the classifiers are the maximum entropy classifiers which allow us to incorporate arbitrary overlapping and conjunctive functions.",
            "So basically they are having an exponential model on the on the on the laborers and given the previous papers and and the token.",
            "And the parameters of the models are the weight vectors and some binary indicative features.",
            "And Furthermore, we have also a normalization factor."
        ],
        [
            "So just to give an example of the indicator features that we might want to use.",
            "So if you have the sender Jack London line to Paris, so the features is very similar to what we've seen so far.",
            "So we we can have features about the token and this as well as incorporate features based on the current label and current state and the previous page.",
            "And also we can use some features so if you have a guest appear of all the world cities, we can ask whether our token belong to that precompiled list of words."
        ],
        [
            "There is a problem with hidden Markov model.",
            "For maximum entropy models, which refers to us as the labeling balance problem, which basically has has a bias towards the state which has fewer ongoing transition.",
            "I'm not going into details how this can be proved, but the idea is that this model will so this model shows that for a given sentence such as Telstra shares rose sharply.",
            "A maximum entropy model aiming to do battle speech tagging on this sentence would return.",
            "Praise so yeah, not phrase.",
            "How?",
            "The word and.",
            "And for the other one, on the on the bottom it will be like again another phrasal verb phrase.",
            "No.",
            "So under this model, the probability of.",
            "Oversigning to to the sentence.",
            "Telstra shares the Sheriff throws in the same.",
            "Ability is is going to be the same that there's a shares is therefore the model will choose if we had the second sentence, it will choose the labels given by the Talkback, which might not be what we want."
        ],
        [
            "Yeah.",
            "And also the conditional random fields of generalization of the maximum entropy models which overcome this labor by this problem.",
            "And they do this by having so their exponential model are global, so it is on the entire state an input input space.",
            "An otherwise they ended are on directed, but otherwise they have the same parameters.",
            "They have the weight lifters and they have the can have the same indicator feature."
        ],
        [
            "So yeah, typically there is an important issue with this problem with these classifiers that they often overfit the data and in order to avoid this we can use a regularization term.",
            "And there are various regularization terms that we can use.",
            "An example is the M2 norm, which takes the length of the of the.",
            "With vector and basically what this regularization term needs to do, it aims to penalize solutions which has very large weight.",
            "And often for conditional random fields, it is common to use abortion prior with the specific mean and variance.",
            "And the the the the mean is typically set to 0 and the variance is just a constant balmy.",
            "That and we will see later when we will discuss about some intelligent algorithms used for dealing with informal text that this regularization basically are very important."
        ],
        [
            "So and now we will move to to perceptron and support vector machines."
        ],
        [
            "So perceptions algorithm.",
            "They try to find.",
            "Separating hyperplane which separates very well the positive and the negative examples where the X is denounced.",
            "The positive and posting with the negative."
        ],
        [
            "And the supervisor machine are just a way to train the perceptron.",
            "What they want to do?",
            "They want to find some support vectors to determine this, separating hyperplane, and for doing this they want to learn the the weight.",
            "And they they sold marketization problem."
        ],
        [
            "And just to remind you again, so we're giving the set of training examples to to the SVM where.",
            "Just wondering, on Staten Token is an entity and minus one little guy isn't an entity.",
            "This is also want to learn and regulation for solving the for finding the hyperplane.",
            "It is given by this equation.",
            "When we want to multiply the the weights with the feature with the feature vector and we have a swallow a bias term."
        ],
        [
            "And we want to do as well.",
            "We want to find some.",
            "I don't know hyperplanes which are as far as possible from the from the hyperplane, but they still separate the data very well.",
            "And we can describe this by by two equations by looking for a hyperplane.",
            "Which is very close to the positive examples, and one which is very close to the negative examples.",
            "And this can be basically get the same very very easily as an optimization problem."
        ],
        [
            "And I have just proves light switch illustrated graphically so once again we're going to find you want to find the separating hyperplane which will separate the positive examples from the negative examples and we as well want to find the.",
            "Blood disposable hyperplanes to this one which which is still separate."
        ],
        [
            "And.",
            "The instances which lie on this parallel hyperplanes are typical equord supervisors."
        ],
        [
            "And there is an extension of supervector machines to the structure models such as this negative recognition.",
            "And what they want to do is in the same iteration they compute the error made by our predictor and it is error is less than user defined error and the margin.",
            "Then they add this newly labeled instance to set up my strength and they basically solver optimization problem and.",
            "So they perform this iteration several times."
        ],
        [
            "So coming back to our initial architecture.",
            "So what we're interested in, we want to do information extraction and we have seen so far or the previous steps that we can perform to do it.",
            "So now we will be looking at how to extract domain specific terms such as referees when we are talking about the FIFA FIFA World Cup.",
            "Post on Facebook and now we will be looking.",
            "How can we extract this automatically?"
        ],
        [
            "So first you need to make a distinction between domain term recognition, an end entity recognition, because typically in domain term recognition we only want to say that this span of text is a domain term we are not in.",
            "We don't want to classify it.",
            "As in named entity recognition, what we will typically say that this text mom is location or reason.",
            "So for example, if you have an article about media coverage of this World Cup, which Reporter ratings for the US broadcasting companies ABC and ESPN?",
            "But the role of of entity recognition would be to say that ABC and ASP and our companies and 2010 is a date, while the objective of them recognition would pay only to say that these three are important, there's."
        ],
        [
            "Yeah, so this is very similar to keyboard extraction which is looking into the frequency of the of the words.",
            "However, in domain name recognition we consider also single and market word expressions and there are various techniques used for this.",
            "They can be based on content summarization or entity recognition or taking some other tasks such as relation."
        ],
        [
            "So for example, what we want to identify from.",
            "This post about the FIFA World Cup is like what are the what is the topic where they are talking about?",
            "So, uh, some potential terms from this game could be referee ref lines, linesman or line Frank Lombard, Lombard in Germany.",
            "So what?"
        ],
        [
            "Want to do?",
            "Then we want to cluster them based on their type so you can see that the prison with Germany and England is a comp.",
            "Country."
        ],
        [
            "So there are various ways to doing it if we take.",
            "Natural language which process so we might want to identify a set of candidate lexical.",
            "And we'll see whether they appeared in the lexicon or we also can do.",
            "Began to part of speech tagging and chase front trunk.",
            "Phrase.",
            "On the on the sentences and just pick the noun phrases and objective noun phrases as potential terms.",
            "So looking at N grams and another approach is more statistical based approach which tries to measure the significance of these terms in the lexicons.",
            "So the main problem is that the choice of the lexicon and statistical measures ISM is often domain specific."
        ],
        [
            "So there are three approaches proposed for doing for recognizing domains, domain terms one our so called term hold, another one is local unit food and there is a hybrid approach.",
            "So the term would once they want to find out the how representative the terms are by computing the frequency.",
            "So how strong IS Association of distances on domain specific concepts?",
            "And one way of doing it is to compute the dump."
        ],
        [
            "Which basically given.",
            "Document or.",
            "Document, it computes how frequent is each token in a document income, and it normalizes to the total number of.",
            "And then what we can do, we can rank that this distance by frequency and select the most frequent ones.",
            "However, with this method we will find that common words such as.",
            "The end a.",
            "And a will begin very very frequent, which are not going there.",
            "So this is maybe the best measure for finding."
        ],
        [
            "Return.",
            "So a better measure is if we combine this term frequency with the inverse document frequency.",
            "So we want to."
        ],
        [
            "So this basically takes into account not only the frequency of word in.",
            "1 corpus, but it also takes into account the overall frequency of of the token.",
            "In a subset of documents and in this way, common words such as the and a will be disregarded because they are equally.",
            "Frequently, for example in newswire domains.",
            "Yeah."
        ],
        [
            "Another approach is quite a business."
        ],
        [
            "Which basically it computes the frequency of a word in domain specific corpus and also in a referendum general topic corpus and an example of general topic corpus is the.",
            "The British National Corpus and basically it.",
            "It computes how frequent is is a word in a in a specific corpus, as opposed to a general specific corpus."
        ],
        [
            "And now there are the unique code approaches which basically tries to measure how important is to see to consecutive words together and.",
            "And therefore they they focusing in this market, work expressions which are basically for more tokens.",
            "And.",
            "One way of computing this is to apply pointer pointwise mutual information."
        ],
        [
            "Which, So what it does?",
            "For example, if you have given the world So what we're expecting is that words such as World Cup will be more frequently seen together in some posts about to the World Cup.",
            "And then seeing the world the also the two words separately, such as the world and God.",
            "And This is why when we compute this.",
            "This measure will be taking into account the frequency of seeing these two words together, as opposed to seeing them separately."
        ],
        [
            "And there are many other measures that we can use to to quantify the importance of a term or to filter out terms which are important.",
            "And a few of them are, so using T test or Chi Square measure or for log likelihood."
        ],
        [
            "And this method that we have seen it can be used for measuring their associations and collocations which wants to determine how much two non consecutive terms are associated by.",
            "Exploiting sounded stupid, some statistiques distribution recipes."
        ],
        [
            "And this is just an extension of the previously presented mutual information appointment user information measure, which also takes into account.",
            "The context window and the frequency of of the two words which was found within within the context now."
        ],
        [
            "And there are so called hybrid approaches which runs to capture both awesome and unique unit 2 in a balanced way, and one way of capturing this is by applying."
        ],
        [
            "See value measure, which basically what it tries to do, so when.",
            "Will turn consist more than two words?",
            "In that case it the the question arises whether it has any.",
            "If it has any other items nested in.",
            "And if it doesn't consist in, then just takes the frequency of the other string and the length of the string, and if it contains, it will look for other candidates terms which contains a as domestic store."
        ],
        [
            "And some other measures."
        ],
        [
            "Are the blue facts.",
            "Which things to consider it in first measures the term domain specificity and the atomic cohesion?",
            "And it computes these two and make makes a final decision based on these two dollars."
        ],
        [
            "And there are the."
        ],
        [
            "So one turning their Max measure which has three components.",
            "One aims to capture the domain partners.",
            "Which is which is the probability of the funding one domain as opposed to another domain?",
            "The domain consensus, which aims to capture that term is found in a corpus belonging to a domain of interest.",
            "And there is some lexical consensus which aims to capture the frequency of a term occurring as a single unit, as opposed to.",
            "Exception"
        ],
        [
            "Using trying to identify terms in some very complex technical domains such as the aerospace domain, this is the work with Jonathan and Fabio, so they will try it with draft.",
            "Space for me.",
            "Anne."
        ],
        [
            "No, I'm not.",
            "There might be a concept.",
            "This is a play.",
            "LB pressure routing stage to play, so all of the strings and related he refer to this.",
            "Disturbed.",
            "And then the task was to.",
            "Personally, find all these different variations.",
            "Strings which all refer to the same concept and to assign to them.",
            "Or you will write code which in this this case it was an 80 a cold."
        ],
        [
            "Spike.",
            "So when they conducted the study, which shows that the possible scenarios describing an entity increases exponentially.",
            "Sorry, nearly.",
            "So.",
            "Yes, so for example, if a frequency of token was 75, so they found 40 different synonyms describing the."
        ],
        [
            "So and what they were doing, they were first applying this techniques, which I presented.",
            "And they found that in such complex technical domains, these techniques doesn't work so well.",
            "And they did an extensive evaluation using analyzing 88,000 people.",
            "And what the results indicate that.",
            "But this measures performed very poorly on this complex domains and basically in it.",
            "In some cases they they have doubled.",
            "And there is a program to say what was the method used by them."
        ],
        [
            "So what they were doing is basically they had a candidate list of gazetteers and they were applying some similarity distant measures to.",
            "To guess whether string is a term.",
            "And they were so in this paper they detailed all the distant metrics that they were using.",
            "So if you're interested, you can.",
            "You can read more about this."
        ],
        [
            "Yeah.",
            "And now we will continue with some other tasks such as relation extraction.",
            "Which were represented by from you.",
            "Flying."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now first of all, thanks for coming in for staying for the last day, and this is a tutorial mining complex entities for literal genius information networks.",
                    "label": 1
                },
                {
                    "sent": "There are three people who have contributed to this workshop, but just two are presenting stuff with the person is missing with young.",
                    "label": 0
                },
                {
                    "sent": "Vicky's Chinese couldn't get the visa for the Schengen area is quite a common problem, becoming a serious problem when you travel from the UK.",
                    "label": 0
                },
                {
                    "sent": "The other person is Andrea Vargas here with me an unfamiliar Wagner.",
                    "label": 1
                },
                {
                    "sent": "We are from the University of Sheffield.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you OK. Now.",
                    "label": 0
                },
                {
                    "sent": "This is a quite cozy environment.",
                    "label": 0
                },
                {
                    "sent": "There are so many people, so if you have any question you want to interrupt it, feel free to do so.",
                    "label": 0
                },
                {
                    "sent": "The only warning is that with the key mixing we may not be able to give all the answers because he's done apart and then we have tried.",
                    "label": 0
                },
                {
                    "sent": "We will try our best.",
                    "label": 0
                },
                {
                    "sent": "Let me ask you some questions.",
                    "label": 0
                },
                {
                    "sent": "We start with asking the audience so it's always nice to ask the audience how many of you have used a social network.",
                    "label": 0
                },
                {
                    "sent": "In your life, Facebook, Twitter.",
                    "label": 0
                },
                {
                    "sent": "These kind of things.",
                    "label": 0
                },
                {
                    "sent": "Right, it's quite interesting.",
                    "label": 0
                },
                {
                    "sent": "I teach a module on I'd intelligent web, and until three years ago I had to explain to students with Facebook walls.",
                    "label": 0
                },
                {
                    "sent": "And now when I start my lectures, I discovered that these students are able to develop applications in Facebook already, so things have become quite the basics and it's very interesting and this is what we want to talk about today.",
                    "label": 0
                },
                {
                    "sent": "What we want to do today is talk about how to get information out of social networks when we.",
                    "label": 0
                },
                {
                    "sent": "What we call it intelligence information networks.",
                    "label": 0
                },
                {
                    "sent": "We actually mean social network.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I said you probably know what the social platform is.",
                    "label": 0
                },
                {
                    "sent": "It don't think of just Facebook.",
                    "label": 0
                },
                {
                    "sent": "Think of a number of other interesting applications that you may have used on the web.",
                    "label": 0
                },
                {
                    "sent": "Edit The fundamental thing is that they generate.",
                    "label": 0
                },
                {
                    "sent": "They allow you to generate user user generated content to generate user content.",
                    "label": 0
                },
                {
                    "sent": "Now user content is the largest amount of information on the web at the moment.",
                    "label": 0
                },
                {
                    "sent": "And it comes to be.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actually I research goldmine.",
                    "label": 0
                },
                {
                    "sent": "Because you can, for the first time we can get an incredible amount of information.",
                    "label": 0
                },
                {
                    "sent": "Completely available for free.",
                    "label": 0
                },
                {
                    "sent": "If you think of just tweets with 200 million tweets a day, that's between 2000 to 600 a second, 66 or 2006 thousand a second, 6000 to pick it up big time.",
                    "label": 0
                },
                {
                    "sent": "It's quite obvious that there is a lot of information, but it's too much information maybe.",
                    "label": 0
                },
                {
                    "sent": "And what you can do with that you can get some knowledge of it if you are able to do it, you can create applications for marketing.",
                    "label": 0
                },
                {
                    "sent": "You can application for trying to understand.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Public opinion and it turns out that if you look out what happens, any event that you can think of.",
                    "label": 0
                },
                {
                    "sent": "They tend to be covered by social networks, especially if you talk about Twitter or Facebook.",
                    "label": 0
                },
                {
                    "sent": "And the, and especially when the when the news of breaking news like earthquakes or fires or shooting or whatever you can think of what Brian, if you're from the UK, this is quite a good topic.",
                    "label": 0
                },
                {
                    "sent": "And they need to be covered very quickly by by social networks and much better generally than the normal news channels with.",
                    "label": 0
                },
                {
                    "sent": "Basically 'cause people are everywhere, why the journalists are not everywhere and people tweet.",
                    "label": 0
                },
                {
                    "sent": "I was discussing with one guy from the emergency services in Sheffield and he said imagine that you are stuck on a tree and there is a dog chasing you.",
                    "label": 0
                },
                {
                    "sent": "What do you think the average person will do?",
                    "label": 0
                },
                {
                    "sent": "Well most of the time they will tweet about that so they don't call the police, they treat and it's quite amazing every time there is an emergency people tweet again are about it.",
                    "label": 0
                },
                {
                    "sent": "Now this is good because for the major events, while in any case there is coverage for the minor events like I don't know the local bonfire night in Sheffield.",
                    "label": 0
                },
                {
                    "sent": "This is not covered by the dining news or it was covered with 10 minutes on the on the local news.",
                    "label": 0
                },
                {
                    "sent": "You talk about road closures.",
                    "label": 0
                },
                {
                    "sent": "Takes an awful lot of time to tell it to go through the radio, but it will be immediately there on Twitter or Facebook.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the kind of users that you can have tend to be quite broad.",
                    "label": 0
                },
                {
                    "sent": "You can have users that are from all over the world or all over the place it depending on if it is a local event or not.",
                    "label": 0
                },
                {
                    "sent": "They tend to a different age groups.",
                    "label": 0
                },
                {
                    "sent": "Most people make the mistake of thinking of assuming the social networks are for young people.",
                    "label": 0
                },
                {
                    "sent": "Actually the largest majority of Facebook users are my age.",
                    "label": 0
                },
                {
                    "sent": "So this tells you that you know there is quite a widespread.",
                    "label": 0
                },
                {
                    "sent": "They have different educational backgrounds and different cultures and different languages, which is of course the problem.",
                    "label": 0
                },
                {
                    "sent": "And what is more, most important is that they tend to have a large number of points of use that is generally not what you get from.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From the news.",
                    "label": 0
                },
                {
                    "sent": "And is frequent and is instantaneously updated.",
                    "label": 0
                },
                {
                    "sent": "So on in for example show that.",
                    "label": 0
                },
                {
                    "sent": "Jordan did the fires in California in I think it was two years ago.",
                    "label": 0
                },
                {
                    "sent": "The efficient news about where the fire was spreading the word very fast fires going through the country.",
                    "label": 0
                },
                {
                    "sent": "The efficient use of very careful and basically they were not giving information because they didn't want to give any wrong information, therefore causing any any any harm to people like giving wrong information.",
                    "label": 0
                },
                {
                    "sent": "But in doing so they were actually harming people because they were not telling them what was happening.",
                    "label": 0
                },
                {
                    "sent": "But actually people were using Facebook and Twitter and with that they could pass very very careful information.",
                    "label": 0
                },
                {
                    "sent": "If you think of the Virginia shooting I think it was three years ago.",
                    "label": 0
                },
                {
                    "sent": "When a student, when they started killing people, equals Facebook, the main channel of communication for which people were actually telling each other, there is a guy with a gun going around and killing people.",
                    "label": 0
                },
                {
                    "sent": "So this is quite important to get immediately when things happen, but it's also important to have comments and understanding what people have.",
                    "label": 0
                },
                {
                    "sent": "The 2010 World Cup had 5200 messages that match just in English.",
                    "label": 0
                },
                {
                    "sent": "Just just got this Twitter.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anything is fundamentally an opinion goldmine during both the 2008 US election and the 2010 UK election, it turned out that mining Twitter was actually able to tell you what the outcome of the election was going to be because that was quite precise.",
                    "label": 0
                },
                {
                    "sent": "Even if you have to balance, because typically liberals tend to be twittering more.",
                    "label": 0
                },
                {
                    "sent": "So you have to.",
                    "label": 0
                },
                {
                    "sent": "You have to.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Balance that.",
                    "label": 0
                },
                {
                    "sent": "And what is most important for machine learning people is that is stacked standing, maybe in a weird way, but using tags in Twitter or using people in in Facebook, whatever you want to, Flickr has tax as well.",
                    "label": 0
                },
                {
                    "sent": "But it's a formal tag and people tend to reduce taxes in Twitter you have retweets.",
                    "label": 0
                },
                {
                    "sent": "You have mentioned people and so on and so on.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So there is activated and large amount of information.",
                    "label": 0
                },
                {
                    "sent": "But there are problems.",
                    "label": 0
                },
                {
                    "sent": "There are clear problems because they are informal and they're driven by people.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What have people done with this?",
                    "label": 0
                },
                {
                    "sent": "But there are lots and lots of different studies have been done and Matthew and I have worked on identity disambiguation on the web for for understanding if your identity could be stolen with information that is on the web and what we did, we use information in social networks to train large scale classifiers or large scale information instruction.",
                    "label": 0
                },
                {
                    "sent": "I'm getting better.",
                    "label": 0
                },
                {
                    "sent": "Did to try to predict the strength of friendship by mining information by mining Facebook public opinions prediction using Twitter and identity communities and interest identification with with social networks.",
                    "label": 0
                },
                {
                    "sent": "We will talk a little bit about the.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you flicker, of course you can use Clicker to create very larger corporate of images to type for information extraction using the captions.",
                    "label": 0
                },
                {
                    "sent": "This is what Rebecca Barlow and I did.",
                    "label": 0
                },
                {
                    "sent": "And then then.",
                    "label": 0
                },
                {
                    "sent": "For example, Erica Moulton Lucia special worked in creating driving ontological relations from from tags from tags images in Flickr, and you can use YouTube to the sentiment analysis.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now there is a lot of interest this.",
                    "label": 0
                },
                {
                    "sent": "These are two projects we have.",
                    "label": 0
                },
                {
                    "sent": "And the first one was a European project called.",
                    "label": 0
                },
                {
                    "sent": "We know it and the idea was also to harness collective intelligence.",
                    "label": 0
                },
                {
                    "sent": "That means what everyone knows as a person as a community, as a mass of people, and in order to help the emergency services to react to a sudden event like a flood with a study.",
                    "label": 0
                },
                {
                    "sent": "The Shepherd Flood in 2007.",
                    "label": 0
                },
                {
                    "sent": "This will also mainly done by mining social networks and discussion forum.",
                    "label": 0
                },
                {
                    "sent": "Plus people people could send messages and what you could do actually here was we provided a mobile application that continue over the event somewhere around and this is now finished and it's actually continued with another project is funded by by the UK Government.",
                    "label": 0
                },
                {
                    "sent": "It is about tracking real time intelligence industries.",
                    "label": 0
                },
                {
                    "sent": "That means in case of events like a riot or simply a festival, you want to know what is happening and why this happening so that emergency services or the police can go there.",
                    "label": 0
                },
                {
                    "sent": "And this is, for example, one of the system was tested in the samples currently boarding Bristol that these are very happy event, but unfortunately there are also the nasty things happening and what the system was was actually instructing.",
                    "label": 0
                },
                {
                    "sent": "Twitter and Facebook are to understand what was.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There are lots and lots of workshops and this.",
                    "label": 0
                },
                {
                    "sent": "Initial list of workshops and events.",
                    "label": 0
                },
                {
                    "sent": "Academic events where you can get information and further papers, but let's talk about the techniques and the technical aspects of it.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "The fundamental thing that you want to do is restrict information over to get, for example, event information.",
                    "label": 0
                },
                {
                    "sent": "Understanding what is happening and so on and so on.",
                    "label": 0
                },
                {
                    "sent": "But first they have to cope with very large scale.",
                    "label": 1
                },
                {
                    "sent": "The second thing is that you have to go be languages even know what languages did the tweet or Facebook would be awakening.",
                    "label": 0
                },
                {
                    "sent": "And as a matter of fact understanding what the languages is quite complex and we'll see some examples later.",
                    "label": 0
                },
                {
                    "sent": "And there is a variety of information and different expertise people just surround on Twitter or Facebook.",
                    "label": 1
                },
                {
                    "sent": "Sometimes they don't really say anything.",
                    "label": 0
                },
                {
                    "sent": "They just say what I what they feel or they're actually giving information.",
                    "label": 1
                },
                {
                    "sent": "Some of the information can be misleading.",
                    "label": 0
                },
                {
                    "sent": "Someone information can be wrong.",
                    "label": 0
                },
                {
                    "sent": "Just what they think.",
                    "label": 0
                },
                {
                    "sent": "You may consider people working more sensors that can be faulty or can be precise and so on its own rather than as people providing information.",
                    "label": 0
                },
                {
                    "sent": "This is one of the things that people do.",
                    "label": 0
                },
                {
                    "sent": "But it's fantastic because there is a lot of there, and therefore if you're able to remove the noise, you will have lots of information for free.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is a scenario with.",
                    "label": 0
                },
                {
                    "sent": "We will use briefly your in depth that is in the England versus Germany World Cup matches.",
                    "label": 0
                },
                {
                    "sent": "It was a very controversial man match.",
                    "label": 0
                },
                {
                    "sent": "What happened was this.",
                    "label": 0
                },
                {
                    "sent": "Frank Lampard actually score a goal, scored a goal that neither free nor denies man actually saw, and that was two to one to Germany at the time.",
                    "label": 0
                },
                {
                    "sent": "But they could have grown to two 2 instead of Germany, one for one.",
                    "label": 0
                },
                {
                    "sent": "So it was a very controversial matched and you can think of.",
                    "label": 0
                },
                {
                    "sent": "Running very high at the time, So what happens is that.",
                    "label": 0
                },
                {
                    "sent": "What you want to do?",
                    "label": 0
                },
                {
                    "sent": "You want to discover the events.",
                    "label": 0
                },
                {
                    "sent": "During the match, you know what the events are because these are listed on the BBC website later, but if you can match those events with the ones that aren't mentioned in the tweets, you Start learning how how to extract to extract events from tweets.",
                    "label": 0
                },
                {
                    "sent": "This is the fundamental thing you have.",
                    "label": 0
                },
                {
                    "sent": "A fantastic training training corpus, or at least a corpus with answer.",
                    "label": 0
                },
                {
                    "sent": "So what do you want to do?",
                    "label": 0
                },
                {
                    "sent": "You want to know what the matches are?",
                    "label": 0
                },
                {
                    "sent": "What happens with the players with the teams, and what the event.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So how do we identify the content?",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is an example.",
                    "label": 0
                },
                {
                    "sent": "Now this is an example of a tweet.",
                    "label": 0
                },
                {
                    "sent": "I don't know if you can read it.",
                    "label": 0
                },
                {
                    "sent": "It says I hate England, but they got robbed.",
                    "label": 0
                },
                {
                    "sent": "The rights are proving the World Cup.",
                    "label": 0
                },
                {
                    "sent": "They did it to the US twice and now they're doing it to England.",
                    "label": 0
                },
                {
                    "sent": "Now, what does it say?",
                    "label": 0
                },
                {
                    "sent": "It doesn't say anything, it just says it's referees fault.",
                    "label": 0
                },
                {
                    "sent": "It's quite obvious this is what people generally do, but if you look at all the Twins, they tend to be talking about linesman referee.",
                    "label": 0
                },
                {
                    "sent": "And it's quite clear in sequence.",
                    "label": 0
                },
                {
                    "sent": "It's clear that there is an event there, and for some reason.",
                    "label": 0
                },
                {
                    "sent": "If centered around the referee.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What is there a free or or whatever The Who is in charge of the.",
                    "label": 0
                },
                {
                    "sent": "Of the match is very interesting because one guy says, oh, it's a decision by the Empire.",
                    "label": 0
                },
                {
                    "sent": "That is what you were using cricket and one other guys didn't actually is called the referee, so it's quite.",
                    "label": 0
                },
                {
                    "sent": "I find it quite funny so you can talk about positive and negatives.",
                    "label": 0
                },
                {
                    "sent": "Who is talking well about the referee who's who's actually criticizing everything.",
                    "label": 0
                },
                {
                    "sent": "We know that no one talks really well about.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Three, but this is the fundamental point.",
                    "label": 0
                },
                {
                    "sent": "So how can we extract this information?",
                    "label": 0
                },
                {
                    "sent": "And now can we get a list of of facts and events considering the fact that most people will actually be running like the guy we have seen, not giving exact information?",
                    "label": 0
                },
                {
                    "sent": "There is a lot of work done on how people express feeling and how they behave during events.",
                    "label": 0
                },
                {
                    "sent": "For example, people have realized that during an event when there is during a match, for example when there is an event, people don't retreat.",
                    "label": 0
                },
                {
                    "sent": "This is very interesting because you are so excited.",
                    "label": 0
                },
                {
                    "sent": "Immediately start typing.",
                    "label": 0
                },
                {
                    "sent": "You don't look if someone else is already said so, but in a moment of quiet you see someone else has commented.",
                    "label": 0
                },
                {
                    "sent": "Oh, you know, I really don't like this matches.",
                    "label": 0
                },
                {
                    "sent": "So yeah, I agree.",
                    "label": 0
                },
                {
                    "sent": "And you re tweet so by using all these here is clues and cues you can actually understand a lot about the context and therefore mining geology.",
                    "label": 0
                },
                {
                    "sent": "But what we want to do first of all want to extract.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now we want to do it in a different in a difficult way.",
                    "label": 0
                },
                {
                    "sent": "There are lots of techniques, shallow techniques that you can use in like a frequency analysis and so on and so now what we want to do here is to do something more complex, like extracting the information, the real information about the events.",
                    "label": 0
                },
                {
                    "sent": "And we tried to use information instruction that is a technique that has about 20 years of history.",
                    "label": 0
                },
                {
                    "sent": "Eddie Media is that you have pre specified information.",
                    "label": 0
                },
                {
                    "sent": "You want to know about.",
                    "label": 0
                },
                {
                    "sent": "This is generally summarized in the form of a template that is a kind of form to fill for the system run ontology.",
                    "label": 0
                },
                {
                    "sent": "You're more up to date with the semantic Web, for example.",
                    "label": 0
                },
                {
                    "sent": "And what you want to do you want to populate a structured information source like a database.",
                    "label": 1
                },
                {
                    "sent": "That's a fundamental.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Task and historically, this has been defined as the number of tasks is quite varied than in 20 years.",
                    "label": 0
                },
                {
                    "sent": "Things have changed.",
                    "label": 0
                },
                {
                    "sent": "This is a classic definition.",
                    "label": 0
                },
                {
                    "sent": "If you have a piece of years, the simplest thing that you can do is to recognize a classified entities, and so in this case the polar jackels is actually a person and Quest Inc. And Sri international companies.",
                    "label": 0
                },
                {
                    "sent": "This is very, very shallow, but you can do it.",
                    "label": 0
                },
                {
                    "sent": "And another thing that you can do is you are the opposite is actually to see that there is an event.",
                    "label": 0
                },
                {
                    "sent": "Where company and questing today has hired a person called poor jackals.",
                    "label": 0
                },
                {
                    "sent": "At the dentist, Aurora president and the company, there is a company that is called Sri International.",
                    "label": 0
                },
                {
                    "sent": "Where?",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There is a person with leading scope or jackets.",
                    "label": 0
                },
                {
                    "sent": "We used to be the vice president.",
                    "label": 0
                },
                {
                    "sent": "So because this is clearly capturing the whole event, this is an example from I think 1993 or 1994.",
                    "label": 0
                },
                {
                    "sent": "So this is a very old example.",
                    "label": 0
                },
                {
                    "sent": "I think Paul Jackets in the meantime has already changed it.",
                    "label": 0
                },
                {
                    "sent": "Three or four companies, but there's a fundamental thing is so well established.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now this guy, I don't know.",
                    "label": 0
                },
                {
                    "sent": "Logic actually gave this classification of information instruction.",
                    "label": 0
                },
                {
                    "sent": "When you talk about information instruction, you can actually describe a number of dimensions to define the task.",
                    "label": 0
                },
                {
                    "sent": "The first one is the type of input, the type of document security according to the type of input, you will have different types of techniques that you can use.",
                    "label": 1
                },
                {
                    "sent": "We will talk about, for example, microposts.",
                    "label": 0
                },
                {
                    "sent": "These are wireless.",
                    "label": 0
                },
                {
                    "sent": "Basically type of input.",
                    "label": 0
                },
                {
                    "sent": "Then you may have resources to see the information to see their learning with.",
                    "label": 0
                },
                {
                    "sent": "If you use machine learning for example.",
                    "label": 0
                },
                {
                    "sent": "So the type of input resources changes the way you can behave.",
                    "label": 0
                },
                {
                    "sent": "If you can use, for example, a supervisor algorithm or announced device or semi supervised algorithms.",
                    "label": 1
                },
                {
                    "sent": "And the method used for extraction.",
                    "label": 0
                },
                {
                    "sent": "Of course, the algorithm the output of instruction changes according to the task and changes according to what you want to do with the output.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now we can talk about input.",
                    "label": 0
                },
                {
                    "sent": "You can see a number of them.",
                    "label": 0
                },
                {
                    "sent": "The easiest one template based documents.",
                    "label": 0
                },
                {
                    "sent": "There is an example in the right inside a page from Amazon.",
                    "label": 0
                },
                {
                    "sent": "This is generated by a database.",
                    "label": 0
                },
                {
                    "sent": "All of them are identical.",
                    "label": 0
                },
                {
                    "sent": "So there was an area of research at the beginning of 2000 called rapid induction system.",
                    "label": 0
                },
                {
                    "sent": "It actually is supervised methods to extract to learn how to extract information from these pages.",
                    "label": 0
                },
                {
                    "sent": "Now the challenge that we have is actually to do it over large scale on the web without adding any training material.",
                    "label": 0
                },
                {
                    "sent": "So you go to any site.",
                    "label": 0
                },
                {
                    "sent": "We discovered this.",
                    "label": 0
                },
                {
                    "sent": "This type of site and you try to extract or other large scale.",
                    "label": 0
                },
                {
                    "sent": "This is the current focus of research.",
                    "label": 0
                },
                {
                    "sent": "Then there are semi structured documents so typically tend to be email.",
                    "label": 0
                },
                {
                    "sent": "Or ads or resumes.",
                    "label": 0
                },
                {
                    "sent": "And useful sometimes in newspaper articles.",
                    "label": 0
                },
                {
                    "sent": "They are very well organized.",
                    "label": 0
                },
                {
                    "sent": "This is an example of an email.",
                    "label": 0
                },
                {
                    "sent": "You don't see what he says, but if I tell you that this is a seminar announcement, you will immediately understand what it does.",
                    "label": 0
                },
                {
                    "sent": "There is a title somewhere there is an over.",
                    "label": 0
                },
                {
                    "sent": "There is an affiliation and then there would be probably an abstract.",
                    "label": 0
                },
                {
                    "sent": "This is all we need to know.",
                    "label": 0
                },
                {
                    "sent": "You know that those pieces are there.",
                    "label": 0
                },
                {
                    "sent": "Then there are microposts like for example tweets and Facebook world posts.",
                    "label": 0
                },
                {
                    "sent": "And then there are completely open any sources.",
                    "label": 0
                },
                {
                    "sent": "This is my web page.",
                    "label": 0
                },
                {
                    "sent": "This is written manually.",
                    "label": 0
                },
                {
                    "sent": "I do whatever I want.",
                    "label": 0
                },
                {
                    "sent": "This is this is a table but.",
                    "label": 0
                },
                {
                    "sent": "This is our images, I just wanted to do it that way.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now, if you want to see learning because this is a machine learning conference.",
                    "label": 0
                },
                {
                    "sent": "There are lots of things that you can use.",
                    "label": 0
                },
                {
                    "sent": "The first thing that machine learning or sorry, one information instruction person has to think about is how to use what you use to extract information and the typical thing is that you discover you will have lots and lots of information in terms of gas teases are lists of objects that you can you can use.",
                    "label": 0
                },
                {
                    "sent": "You can have documents that have been annotated, or you can ask a user to annotate documents, even if sometimes this might be quite complex.",
                    "label": 0
                },
                {
                    "sent": "You can have structured databases giving you examples.",
                    "label": 1
                },
                {
                    "sent": "Or you can have unlabeled structures of course, to do things, supervised and unsupervised learning or more and more.",
                    "label": 0
                },
                {
                    "sent": "There is a usable in data you may may have heard about.",
                    "label": 0
                },
                {
                    "sent": "It's like schema.org and is now currently sponsored by Google and Bing.",
                    "label": 0
                },
                {
                    "sent": "That enables you to tag information within your your pages.",
                    "label": 0
                },
                {
                    "sent": "So basically you tell the search engine, not just.",
                    "label": 0
                },
                {
                    "sent": "This is my site, this is the site of the of the workshop.",
                    "label": 1
                },
                {
                    "sent": "This is the program and things that you generally have in the output are structured, but you actually tells the information on selling a product.",
                    "label": 0
                },
                {
                    "sent": "This product is a car.",
                    "label": 0
                },
                {
                    "sent": "The price is so and so on.",
                    "label": 0
                },
                {
                    "sent": "So in the linked data is a much more complex thing, But this is more and more.",
                    "label": 0
                },
                {
                    "sent": "Interesting because this is very very large scale.",
                    "label": 0
                },
                {
                    "sent": "You can have it.",
                    "label": 0
                },
                {
                    "sent": "I don't know if you know about linked data, but it's growing and there are billions of facts now completely.",
                    "label": 1
                },
                {
                    "sent": "Restructure basically databases tag semantical target on the web that you can use to see learning.",
                    "label": 1
                },
                {
                    "sent": "And of course there are lots of lots of documents that are tagged using those concepts in those instances.",
                    "label": 0
                },
                {
                    "sent": "An using on the FA is as basic extension over X HTML, but you can use in HTML.",
                    "label": 0
                },
                {
                    "sent": "But also using schema.org.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I think there are other things.",
                    "label": 0
                },
                {
                    "sent": "Well, what do you think is learning to use?",
                    "label": 0
                },
                {
                    "sent": "Proofread them by hand.",
                    "label": 0
                },
                {
                    "sent": "Useful statistics.",
                    "label": 0
                },
                {
                    "sent": "What kind of output use?",
                    "label": 0
                },
                {
                    "sent": "Just distract the entities.",
                    "label": 0
                },
                {
                    "sent": "You also class.",
                    "label": 0
                },
                {
                    "sent": "If you classified entities or you also try to recognize uniquely what they are associating what is called a unique unique resource identifier similar to the URL in pages.",
                    "label": 0
                },
                {
                    "sent": "If you don't know what it is, so a web identifier.",
                    "label": 0
                },
                {
                    "sent": "You can extract relations you can extract.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now we talk about an information instruction architecture.",
                    "label": 0
                },
                {
                    "sent": "Seen from the point of view of the of the machine learning.",
                    "label": 0
                },
                {
                    "sent": "Once we have like a set of a number of steps, they tend to be linguistica para linguistic.",
                    "label": 0
                },
                {
                    "sent": "They tend to create to provide the features.",
                    "label": 0
                },
                {
                    "sent": "Basic features that are typically linguistic features or very close to invasive pages.",
                    "label": 0
                },
                {
                    "sent": "And then there is the core of the information extraction system.",
                    "label": 1
                },
                {
                    "sent": "This is traditionally called preprocessing in between.",
                    "label": 0
                },
                {
                    "sent": "Of course there is everything that you want to do with the feature selection of goals.",
                    "label": 0
                },
                {
                    "sent": "So I suppose you may not know much about it.",
                    "label": 0
                },
                {
                    "sent": "Basically, so we will give a short description of each of these steps that you are all computational linguists.",
                    "label": 0
                },
                {
                    "sent": "Just let me know and ask.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "K. And so the first thing is a segment.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Tokenization that is basically taking a document or a micropost, whatever you have and try to recognize whether our sentences.",
                    "label": 0
                },
                {
                    "sent": "In this case, if my there's a year descriptional blah blah blah blah.",
                    "label": 0
                },
                {
                    "sent": "At some point there is a full stop and says he was a commentator.",
                    "label": 1
                },
                {
                    "sent": "This is the end of a sentence.",
                    "label": 0
                },
                {
                    "sent": "Explaining the sentence is very simple if you have.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Paper articles.",
                    "label": 0
                },
                {
                    "sent": "It becomes extremely complex if you talk about informal text like this one.",
                    "label": 0
                },
                {
                    "sent": "To look for FIFA two 2010 World Cup features, do the following one select schedule residents ticket type, select number.",
                    "label": 1
                },
                {
                    "sent": "Proceed to payment option where is the end of a sentence.",
                    "label": 0
                },
                {
                    "sent": "You can understand it because of the way it is formatted, but you may ask, is this the end of a sentence or not?",
                    "label": 0
                },
                {
                    "sent": "If you talk about this microphone that I'm instructed yesterday, this is fantastic.",
                    "label": 0
                },
                {
                    "sent": "I have no clue about the guy is saying.",
                    "label": 0
                },
                {
                    "sent": "But where is the sentence here?",
                    "label": 0
                },
                {
                    "sent": "I suppose this is the end of the sentence, but there is a comma.",
                    "label": 0
                },
                {
                    "sent": "I suppose this is another end of a sentence.",
                    "label": 0
                },
                {
                    "sent": "And I suppose this is at the end of the sentence.",
                    "label": 0
                },
                {
                    "sent": "Can you read what it says?",
                    "label": 0
                },
                {
                    "sent": "It says something like retweets and then there is an identifier retweet identifier yield.",
                    "label": 0
                },
                {
                    "sent": "Identify this is Rihanna, the singer.",
                    "label": 0
                },
                {
                    "sent": "What's good bro bro is brother?",
                    "label": 0
                },
                {
                    "sent": "Email that I am, I suppose, ring you you as you in 15 minutes.",
                    "label": 0
                },
                {
                    "sent": "Minor minor aside, how do you call my woman probe whatever that means - She is one word.",
                    "label": 0
                },
                {
                    "sent": "My bro invades one word.",
                    "label": 0
                },
                {
                    "sent": "I don't know if you can make any sense of it.",
                    "label": 0
                },
                {
                    "sent": "I can't, maybe I don't know enough about Brianna.",
                    "label": 0
                },
                {
                    "sent": "But apart from extracting semantic from this, even if you try to extract the sentences.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or even if you try to identify the words, it becomes extremely complex in newspaper article.",
                    "label": 0
                },
                {
                    "sent": "How to identify word is pretty simple.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Practice so you may have problems with the UK.",
                    "label": 0
                },
                {
                    "sent": "Is UK one word when we know it is, but does a system now?",
                    "label": 0
                },
                {
                    "sent": "Or do you segmented as U dot NK dot or U?",
                    "label": 0
                },
                {
                    "sent": "Dot K dot.",
                    "label": 0
                },
                {
                    "sent": "What is the right way of doing?",
                    "label": 0
                },
                {
                    "sent": "Is this date a single token?",
                    "label": 0
                },
                {
                    "sent": "How do you know it's a single token?",
                    "label": 0
                },
                {
                    "sent": "And so if this is a single token, is medieval times slash that dark ages past single token?",
                    "label": 0
                },
                {
                    "sent": "And then when you are here, Brian Babes, how do you know it's one word or two words or whatever that is there will ever be.",
                    "label": 0
                },
                {
                    "sent": "So the more you go through this micropulse an informal user generated content, the more this becomes complex.",
                    "label": 0
                },
                {
                    "sent": "This in any course in standard natural language processing will be the first 5 minutes now with micro pulse is becoming.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Very complex.",
                    "label": 0
                },
                {
                    "sent": "The second step is trying to understand to try to generalize a little bit the fundamental issue of our languages.",
                    "label": 0
                },
                {
                    "sent": "That language is data is data, as in inflected data.",
                    "label": 0
                },
                {
                    "sent": "So there are different types of forms of the same words, and you want to generalize overtime.",
                    "label": 0
                },
                {
                    "sent": "You want to attract more and more features.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the first thing you want to do is to do lexical analysis.",
                    "label": 0
                },
                {
                    "sent": "You take a word and you won't recognize what is called the base form or the word that you will find you will find in a dictionary.",
                    "label": 0
                },
                {
                    "sent": "If I tell you companies and I ask you, check it up on the dictionary, you will look for company.",
                    "label": 0
                },
                {
                    "sent": "This is exactly the task.",
                    "label": 0
                },
                {
                    "sent": "So you have both stemming and lemmatization.",
                    "label": 1
                },
                {
                    "sent": "Allow queries that you want to recognize, query instead.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So you know my eyes it this way.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                },
                {
                    "sent": "The other way of doing it is actually standing.",
                    "label": 0
                },
                {
                    "sent": "That means to remove the.",
                    "label": 0
                },
                {
                    "sent": "Whatever is the extension of the testing, so queries should be query without prior without the I.",
                    "label": 0
                },
                {
                    "sent": "In form because form and word because word so you don't normalize the words with the original state, you actually do it by removing their designate.",
                    "label": 0
                },
                {
                    "sent": "So the suffix and the difference is that in order to do that you don't need to know the world.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "If you try to normalize that we've seen before, you need to know what the original format is.",
                    "label": 0
                },
                {
                    "sent": "So especially with growing babes, you wouldn't know how to do it, so this is.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "More effective.",
                    "label": 0
                },
                {
                    "sent": "Actually, this is what I want to say, but basically, why do you want to do it?",
                    "label": 0
                },
                {
                    "sent": "Because otherwise you have data sparsity.",
                    "label": 0
                },
                {
                    "sent": "You want to reduce the display.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I dream I want to do some statistics as well, but for some languages you actually need something more.",
                    "label": 0
                },
                {
                    "sent": "You need more full morphological analysis.",
                    "label": 0
                },
                {
                    "sent": "Languages that are highly reflected in German for example, or some positraction.",
                    "label": 0
                },
                {
                    "sent": "Spanish and French, you want to extract features like gender, number and case.",
                    "label": 0
                },
                {
                    "sent": "If you have a case, lasting is a good example as well, provided you are interested in extracting from laughing.",
                    "label": 0
                },
                {
                    "sent": "Any specially languages that are implemented so they can create words out of other words in English in German, if you want to talk about speed limit in English speed limiter 2 words in German, it becomes one word machine dekuyper Council and this is just a word that is being created on the spot and you can create anywhere that you want in this way as long as it is composed.",
                    "label": 0
                },
                {
                    "sent": "But the first step you have to do in order to reduce the capacity is to break those bones and that is not a trivial.",
                    "label": 0
                },
                {
                    "sent": "You need the dictionary to do that.",
                    "label": 0
                },
                {
                    "sent": "You need some morphological analysis also of the words between in between.",
                    "label": 0
                },
                {
                    "sent": "For example, to understand when one word that is maybe unknown actually recognizes and then becomes, for example, ambiguous.",
                    "label": 0
                },
                {
                    "sent": "And so this is not an easy step, but it's very important in highly inflected languages, especially when you have aggregation.",
                    "label": 0
                },
                {
                    "sent": "And when you have cases.",
                    "label": 0
                },
                {
                    "sent": "So if you have that word in German that has again easy genitive.",
                    "label": 0
                },
                {
                    "sent": "In that case, the word is modified, so gets an A.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then the next step is part of speech tagging, part of speech tagging means recognizing the.",
                    "label": 0
                },
                {
                    "sent": "World class.",
                    "label": 0
                },
                {
                    "sent": "So like this is a verb.",
                    "label": 0
                },
                {
                    "sent": "Now, amazingly, you don't need to do to do morphological analysis.",
                    "label": 0
                },
                {
                    "sent": "To do that, you can do it by just using the sequences of words and having some kind of dictionary there.",
                    "label": 0
                },
                {
                    "sent": "So it's quite interesting because it's really, really precise, at least in.",
                    "label": 0
                },
                {
                    "sent": "Newspaper like text.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, again with our friend Anna wrong, so it becomes extremely complex because no one has any type of training material for this kind of things.",
                    "label": 0
                },
                {
                    "sent": "So again, water in the standard natural language processing task was 97% accuracy.",
                    "label": 0
                },
                {
                    "sent": "Not a problem.",
                    "label": 0
                },
                {
                    "sent": "Don't spend 5 minutes on that.",
                    "label": 0
                },
                {
                    "sent": "What you do because you want to teach people, but the point is, you don't consider it now.",
                    "label": 0
                },
                {
                    "sent": "It's becoming a problem and it becomes a problem because most of the steps that follow will actually depend on.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These are actually something not many people use that is the syntactic analysis.",
                    "label": 0
                },
                {
                    "sent": "No syntactic analysis needs.",
                    "label": 0
                },
                {
                    "sent": "Try to recognize the different constituents of a sentence and trying to understand the role that they play.",
                    "label": 0
                },
                {
                    "sent": "This is the subject of the sentence or whatever.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, the simplest way of doing that is very, very useful is to try to chunk chunk means to recognize the main groups, like a nominal group or a verbal groping.",
                    "label": 0
                },
                {
                    "sent": "I think in this example you will have that Haifa is a noun group.",
                    "label": 0
                },
                {
                    "sent": "An located is a verb group 53 mile.",
                    "label": 0
                },
                {
                    "sent": "Mile is a noun group from Tel Aviv is wanna propositional group or a noun group with the proposition whatever you want to call it will host is a verb group an in 20 times.",
                    "label": 0
                },
                {
                    "sent": "Again prepositional group or a noun group with a proposition.",
                    "label": 0
                },
                {
                    "sent": "Now this is quite useful.",
                    "label": 0
                },
                {
                    "sent": "But it tends to depend heavily on the on the output of the part of speech tagger.",
                    "label": 0
                },
                {
                    "sent": "Because you must know that horse is a verb in this case and not an hour.",
                    "label": 0
                },
                {
                    "sent": "Because it can be a noun, of course.",
                    "label": 0
                },
                {
                    "sent": "Potentially they will, again is not the name of a person's William, but is again and again if we go through this.",
                    "label": 0
                },
                {
                    "sent": "So how Nana rogues thing?",
                    "label": 0
                },
                {
                    "sent": "We won't have a dictionary for most of this, so we don't have the starting point.",
                    "label": 0
                },
                {
                    "sent": "The part of speech tagging counts on the fact that even if there are unknown words that would be just one or two in a sentence, maybe one, but in this case we have most of them, so doing the non group recognition of the verb group recognition may become difficult.",
                    "label": 0
                },
                {
                    "sent": "And that means that when you try to recognize terms.",
                    "label": 0
                },
                {
                    "sent": "You are in trouble.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, at least you don't have the support you with it.",
                    "label": 0
                },
                {
                    "sent": "I feel the level over syntactic analysis is trying to create dependency.",
                    "label": 0
                },
                {
                    "sent": "Now, dependency analysis can work at different levels, can be full dependency analysis.",
                    "label": 0
                },
                {
                    "sent": "Basically the full path straight or it can be something where you just connect some of the non groups in some of the verb groups.",
                    "label": 0
                },
                {
                    "sent": "So in this case there is clearly what you're trying to say is that Haifa will host and what would be half that will be ACNL, so you create long distance dependencies by understanding what the subject is now again when you have micropost this may be very difficult because the part of speech is wrong and because we don't have most of the terms you don't know, maybe you don't have the verb and so on and so on.",
                    "label": 0
                },
                {
                    "sent": "And the thing that you made.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Point better is to create a constituency free complete food pathway like.",
                    "label": 0
                },
                {
                    "sent": "This one is probably the thing that you have studied in whatever is in 660 year of school.",
                    "label": 0
                },
                {
                    "sent": "Asking all these graphs.",
                    "label": 0
                },
                {
                    "sent": "This is very difficult.",
                    "label": 0
                },
                {
                    "sent": "It's very difficult, incredibly difficult for four use paper life documents, but there are.",
                    "label": 0
                },
                {
                    "sent": "You can use lots of corporate trainer system when you try to do it for Micropulse.",
                    "label": 0
                },
                {
                    "sent": "While you don't have a sentence you don't have part of speech, so you become more.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course, if you talk about the web.",
                    "label": 0
                },
                {
                    "sent": "Microsoft seems to be a web pages.",
                    "label": 0
                },
                {
                    "sent": "You have more things that are very useful life tables.",
                    "label": 0
                },
                {
                    "sent": "One of the big challenges at the moment on the web is large scale recognition of peoples.",
                    "label": 0
                },
                {
                    "sent": "Can you go to the web and get any random table on any random page and try to understand what it is?",
                    "label": 0
                },
                {
                    "sent": "Well if you use millions of tables.",
                    "label": 0
                },
                {
                    "sent": "You can do a lot of stuff and this is one of the things that you can do.",
                    "label": 0
                },
                {
                    "sent": "When you have a web page, it's very useful to be able to understand the XML DHTML is there and try to get the X path because the X path, for example, will give you a block of text that may be very difficult to recognize if you just look at features that are.",
                    "label": 0
                },
                {
                    "sent": "There are not formatting features.",
                    "label": 0
                },
                {
                    "sent": "Formed something is involved.",
                    "label": 0
                },
                {
                    "sent": "Complete this credit.",
                    "label": 0
                },
                {
                    "sent": "Or in a microphone, if there is an act in front is very important.",
                    "label": 0
                },
                {
                    "sent": "You don't pass whatever it is there because it's a reference to someone.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "So ordering dependencies if you're on Facebook and someone post on your wall or you post on your wall in someone, answer the fact that this person is answering to you is very important in Twitter is not very easy to do because you have to understand the reason at something on the person.",
                    "label": 0
                },
                {
                    "sent": "Maybe Cope is part of your document.",
                    "label": 0
                },
                {
                    "sent": "It's becomes very mad, but actually you can still do it.",
                    "label": 0
                },
                {
                    "sent": "And if you can do it, there are two things that you can do.",
                    "label": 0
                },
                {
                    "sent": "First, study the activity of the social network.",
                    "label": 0
                },
                {
                    "sent": "And the second thing that you can do is to understand the context.",
                    "label": 0
                },
                {
                    "sent": "Because he had mentioned that concept.",
                    "label": 0
                },
                {
                    "sent": "Maybe the other person would use a program like.",
                    "label": 0
                },
                {
                    "sent": "It provides a useful analysis microposts.",
                    "label": 0
                },
                {
                    "sent": "And the president can just define it under defining.",
                    "label": 0
                },
                {
                    "sent": "Like if you say, well, I'm in Geneva and the other one says how is the Lake sort of generically is the Lake of Geneva, so understanding the complex is very.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then there is finally information extraction.",
                    "label": 0
                },
                {
                    "sent": "We have created lots and lots of features.",
                    "label": 0
                },
                {
                    "sent": "Here we can select them, talk a little bit about that.",
                    "label": 0
                },
                {
                    "sent": "I supposed to remember if you have that.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Talk about information extraction now.",
                    "label": 0
                },
                {
                    "sent": "Information instruction is always been seen as a natural language processing, but especially in the case of microphones, it tends to be rather difficult in this sense to interpret like that.",
                    "label": 0
                },
                {
                    "sent": "We have large scale.",
                    "label": 0
                },
                {
                    "sent": "We have robustness.",
                    "label": 0
                },
                {
                    "sent": "We have tasks.",
                    "label": 0
                },
                {
                    "sent": "Who defines a task and we could give us the entire tutorial on web scale information extraction.",
                    "label": 0
                },
                {
                    "sent": "Can you go out there and then to recognize anything?",
                    "label": 0
                },
                {
                    "sent": "Given any any other user sitting down defining a task and then you go to the wedding extract information.",
                    "label": 0
                },
                {
                    "sent": "The fundamental thing is that you need domain specific knowledge.",
                    "label": 0
                },
                {
                    "sent": "If you talk about football, you must know there is a referee.",
                    "label": 0
                },
                {
                    "sent": "You must know something else and so and so.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now let me just spend a little bit of time on the natural language features becausw.",
                    "label": 0
                },
                {
                    "sent": "This has been widely disregarded, but I think that's a mistake.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "They can indicate reduced dramatically data.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "They can give you clues.",
                    "label": 0
                },
                {
                    "sent": "Words are not independent from each other.",
                    "label": 1
                },
                {
                    "sent": "They have.",
                    "label": 0
                },
                {
                    "sent": "They follow some kind of pattern and people designing them that way.",
                    "label": 0
                },
                {
                    "sent": "So even if you talk about Co presence over is called currency worth.",
                    "label": 0
                },
                {
                    "sent": "The way they Co occur can be influenced by a number of factors, so don't just say they could occur, but try to understand how they occur.",
                    "label": 0
                },
                {
                    "sent": "For example, the older they haven't.",
                    "label": 0
                },
                {
                    "sent": "Nothing song is on.",
                    "label": 0
                },
                {
                    "sent": "There is a clear relationship if you can do even a little bit of simple syntax syntactic analysis, try to do it, because they will actually give you an approach information.",
                    "label": 1
                },
                {
                    "sent": "Of course, there are elements that are known innumerable.",
                    "label": 0
                },
                {
                    "sent": "You can't, of course, learn.",
                    "label": 0
                },
                {
                    "sent": "You're more than depending on the fact that there is a three there.",
                    "label": 1
                },
                {
                    "sent": "If you write rule, you can't have a rule for three or four or five before and so on and so on.",
                    "label": 0
                },
                {
                    "sent": "So numbers, time expressions, they tend to be very easily regularised, so you have to do it before.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 1
                },
                {
                    "sent": "And it said you want to generalize.",
                    "label": 0
                },
                {
                    "sent": "You don't want to rule the size of.",
                    "label": 0
                },
                {
                    "sent": "Whatever you have a John Smith, that's a speaker.",
                    "label": 1
                },
                {
                    "sent": "That doesn't mean anything you want to say.",
                    "label": 0
                },
                {
                    "sent": "If there is John Smith talks, you want to generalize to personate or so you try to.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can, this is something I've done about 10 years ago, but you can show that.",
                    "label": 0
                },
                {
                    "sent": "In that case.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The coverage of rules.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Changing the accuracy changes at night.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Coverage changes.",
                    "label": 0
                },
                {
                    "sent": "So now let's go to the the actual meet.",
                    "label": 0
                },
                {
                    "sent": "The action was kind of introduction.",
                    "label": 1
                },
                {
                    "sent": "In case you didn't know about about text extraction.",
                    "label": 0
                },
                {
                    "sent": "I appreciate it if you knew already if they need that.",
                    "label": 0
                },
                {
                    "sent": "If you didn't know about that program was too much.",
                    "label": 0
                },
                {
                    "sent": "I tried to simplify it, so let's talk about the first task.",
                    "label": 0
                },
                {
                    "sent": "The first task is to recognize entities.",
                    "label": 0
                },
                {
                    "sent": "There are three steps in recognizing an entity.",
                    "label": 0
                },
                {
                    "sent": "First one is to spot it, so this is an interview.",
                    "label": 0
                },
                {
                    "sent": "I don't know what it is, but this is an entity similar to what we do with the with the noun group recognition.",
                    "label": 0
                },
                {
                    "sent": "The second step is to say yes, this is an entity and this person.",
                    "label": 0
                },
                {
                    "sent": "This is a protein.",
                    "label": 0
                },
                {
                    "sent": "This is whatever.",
                    "label": 0
                },
                {
                    "sent": "Part of a jet engine.",
                    "label": 0
                },
                {
                    "sent": "And the third one is to give unique identification.",
                    "label": 1
                },
                {
                    "sent": "So this is a person is not a random person.",
                    "label": 0
                },
                {
                    "sent": "Is John speed and it's not a random Joe Smith is John Smith the test that specific identifier?",
                    "label": 0
                },
                {
                    "sent": "For example web page is a unique identifier or better, you're right if you have one.",
                    "label": 1
                },
                {
                    "sent": "These are three states that are typically done in.",
                    "label": 0
                },
                {
                    "sent": "Well, either in sequence or at least the first 2 can be.",
                    "label": 0
                },
                {
                    "sent": "Compress, but the third one tend to be separated.",
                    "label": 0
                },
                {
                    "sent": "Most of the literature actually doesn't consider unique identification.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now classification can be according to a number of tasks.",
                    "label": 0
                },
                {
                    "sent": "The Classic One, I think it had something like 6 classes, but then during the years people started talking of hundreds of classes.",
                    "label": 0
                },
                {
                    "sent": "But we can identify two things.",
                    "label": 0
                },
                {
                    "sent": "One is what we call the named Entity recognition dozen organizations, and so on and so on that you can have another 100 classes.",
                    "label": 0
                },
                {
                    "sent": "But they do.",
                    "label": 0
                },
                {
                    "sent": "They tend to be pretty generic classes that every person can recognize.",
                    "label": 0
                },
                {
                    "sent": "And then there is what we call terminology recognition.",
                    "label": 0
                },
                {
                    "sent": "Terminology recognition is typically domain dependent, and those terms tend to be pretty complex.",
                    "label": 0
                },
                {
                    "sent": "Bioinformatics has lots of terms, mechanics have incredibly complex terms.",
                    "label": 0
                },
                {
                    "sent": "We will see examples examples later.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The unique identification, as said before, requires this recognition of.",
                    "label": 0
                },
                {
                    "sent": "Person A unique way and this is.",
                    "label": 0
                },
                {
                    "sent": "This is an HTTP UI that you would call it a URL, but it's not that you're right because it's actually a UI.",
                    "label": 1
                },
                {
                    "sent": "Oryza type of Europe sorry get away around the URL is this type of you right?",
                    "label": 0
                },
                {
                    "sent": "But this does this thing right?",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of the semantic web.",
                    "label": 0
                },
                {
                    "sent": "Now when you do it with this structure, what people do at least is tokenization.",
                    "label": 0
                },
                {
                    "sent": "But more and more people try to do so this space.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "It's very important you understand the domain and you start collecting terms that are relevant.",
                    "label": 0
                },
                {
                    "sent": "Commonwealth seen before and after the candidate president.",
                    "label": 0
                },
                {
                    "sent": "President typical introduces a person, the president of whatever introduces a company or an organization.",
                    "label": 0
                },
                {
                    "sent": "So in this case.",
                    "label": 0
                },
                {
                    "sent": "FIFA president Zach Blatter.",
                    "label": 0
                },
                {
                    "sent": "You want to understand the president is relevant to recognize?",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "People in their role.",
                    "label": 0
                },
                {
                    "sent": "At the same time, you can have a dictionary that tells you exactly.",
                    "label": 0
                },
                {
                    "sent": "Is the name of the person the first name?",
                    "label": 0
                },
                {
                    "sent": "You may know, you may not know Blatter because it specially surname, so you can't have on all the servers in the world.",
                    "label": 0
                },
                {
                    "sent": "And if you have your in trouble because they think would be incredibly ambiguous.",
                    "label": 0
                },
                {
                    "sent": "You can't have a complete list of more people names, but you can have a complete list of countries.",
                    "label": 0
                },
                {
                    "sent": "Even if then they can be expressed in a slightly different way, so South Africa is, I think RSA is also called or can be called S dot Africa or whatever.",
                    "label": 0
                },
                {
                    "sent": "So clearly the surface form can be different, but you can have a complete list.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, what we will do, we will briefly look at rules and then Andrea will introduce.",
                    "label": 0
                },
                {
                    "sent": "Other types of more statistically oriented methods WHI do I introduce rules?",
                    "label": 0
                },
                {
                    "sent": "Rules are not particularly considerate.",
                    "label": 0
                },
                {
                    "sent": "Interesting is something that people were very keen on working at the beginning of 2002 thousand and three and then people set out.",
                    "label": 0
                },
                {
                    "sent": "You can do actually much better with statistical methods.",
                    "label": 0
                },
                {
                    "sent": "However, there is one fundamental reason why they are important.",
                    "label": 0
                },
                {
                    "sent": "That you are as machine learning.",
                    "label": 0
                },
                {
                    "sent": "People are always competing with the natural language.",
                    "label": 0
                },
                {
                    "sent": "People who are writing rules and rules are incredibly powerful because people are incredibly smart, they can't cope with very large scale.",
                    "label": 0
                },
                {
                    "sent": "But they can generalize very well.",
                    "label": 0
                },
                {
                    "sent": "So understanding rules.",
                    "label": 0
                },
                {
                    "sent": "Understanding your competitor is very important, so we give a short.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, actually said this.",
                    "label": 0
                },
                {
                    "sent": "Typically Arubas system has two parts.",
                    "label": 0
                },
                {
                    "sent": "One is a collection of rules that can be learned or can be written by a person, and then there is a policy for applying.",
                    "label": 1
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There are different types of entity rules, so you can generate.",
                    "label": 1
                },
                {
                    "sent": "The goal is to introduce tags in the text, typically to the text, like SGML tags.",
                    "label": 0
                },
                {
                    "sent": "In the old days, or today you can have XML tags or FA tags if you want.",
                    "label": 0
                },
                {
                    "sent": "Um, there are fundamentally three approaches illiterate or one is discriminative.",
                    "label": 0
                },
                {
                    "sent": "They try to recognize just the boundaries, or to classify the word in each individual word as belonging to an entity or outside DHT, or to recognize this is where your recognizes the entity and generative they try to recognize the whole entity and maybe a number of it.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Oh well, we you know.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The features that you typically use it for role is autography type.",
                    "label": 0
                },
                {
                    "sent": "In fact is lower case.",
                    "label": 0
                },
                {
                    "sent": "For example, the part of speech.",
                    "label": 1
                },
                {
                    "sent": "If you have one, 'cause it your information president is entitled.",
                    "label": 0
                },
                {
                    "sent": "And then you can find more.",
                    "label": 0
                },
                {
                    "sent": "Of course we have more clues.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is the type of rule that.",
                    "label": 0
                },
                {
                    "sent": "A person could write.",
                    "label": 0
                },
                {
                    "sent": "This is from gate, DC, UK.",
                    "label": 0
                },
                {
                    "sent": "That is something that a lot in Sheffield by another group.",
                    "label": 0
                },
                {
                    "sent": "And what it tries to do, it tries to recognize subscription like a CME and TTD by using what is called designator.",
                    "label": 0
                },
                {
                    "sent": "So you know that whatever is capitalized.",
                    "label": 0
                },
                {
                    "sent": "Actually followed by one of these.",
                    "label": 0
                },
                {
                    "sent": "Recognize these identifiers.",
                    "label": 0
                },
                {
                    "sent": "It is actually.",
                    "label": 0
                },
                {
                    "sent": "You know she's actually a company.",
                    "label": 0
                },
                {
                    "sent": "It's a very simple rule, is very smart.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And typically a general figure will have.",
                    "label": 0
                },
                {
                    "sent": "With modern context, before the entity will try to model the entity with the things like, that can be more than one.",
                    "label": 0
                },
                {
                    "sent": "In this case, is to recognize 3:00 PM.",
                    "label": 0
                },
                {
                    "sent": "You can say there can be a number of digits.",
                    "label": 0
                },
                {
                    "sent": "And then the context on the right hand side.",
                    "label": 0
                },
                {
                    "sent": "And these tend to be incredibly good roles and they are applied also to my apples because a person can look at the macro posts and probably they can also understand him sometimes.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can try to identify more than an entity, of course.",
                    "label": 0
                },
                {
                    "sent": "It would be fantastic to say every time a person talks about a person, it also mentioned the agent address.",
                    "label": 0
                },
                {
                    "sent": "If you can do that, it's fantastic.",
                    "label": 0
                },
                {
                    "sent": "OK if you do it by hand, you can do it.",
                    "label": 0
                },
                {
                    "sent": "You try to learn.",
                    "label": 0
                },
                {
                    "sent": "This becomes a little bit more more complex.",
                    "label": 0
                },
                {
                    "sent": "This is an example of what today we would call the micropost that actually this is from 2000 I think, and that was just an ad for.",
                    "label": 0
                },
                {
                    "sent": "A flat.",
                    "label": 0
                },
                {
                    "sent": "Renting a flat.",
                    "label": 0
                },
                {
                    "sent": "Now if you have never seen one, you don't have a clue what it means, but actually this is quite structured and if you can create a pattern like capital here, that is a place.",
                    "label": 0
                },
                {
                    "sent": "Digit dollar number means that this is the neighborhood.",
                    "label": 0
                },
                {
                    "sent": "This is the number of bedrooms and this is the data price.",
                    "label": 0
                },
                {
                    "sent": "Sunderland data and begin.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "2000 again, but we will see that this is not very clever if you try to learn.",
                    "label": 0
                },
                {
                    "sent": "If you use a discriminative rule, what you're trying to say is to say, well, look at this place here.",
                    "label": 0
                },
                {
                    "sent": "Actually, it's the beginning of the start time.",
                    "label": 0
                },
                {
                    "sent": "Start is start time.",
                    "label": 0
                },
                {
                    "sent": "Also you know the seminar at 3:00 o'clock, so you don't want to say this is the start and you just say when it starts here and then another rule will tell you.",
                    "label": 0
                },
                {
                    "sent": "This is where it ends, but it's another room.",
                    "label": 0
                },
                {
                    "sent": "It's very difficult to write if you're a person, but you can learn that.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I don't want another possibility is just to say in out in out in out.",
                    "label": 0
                },
                {
                    "sent": "So this is not part of an entity.",
                    "label": 0
                },
                {
                    "sent": "This is part of an entity or other versions are.",
                    "label": 0
                },
                {
                    "sent": "This is the beginning of their entity.",
                    "label": 0
                },
                {
                    "sent": "This is inside the entity.",
                    "label": 0
                },
                {
                    "sent": "This is the end of an entity depends.",
                    "label": 0
                },
                {
                    "sent": "There are several types of classification, but substantially they're all based on the classification of either of the single word or the classification of the space between 2 words.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Belt.",
                    "label": 0
                },
                {
                    "sent": "If you look at it from the point of view of learning.",
                    "label": 0
                },
                {
                    "sent": "There is a fundamental difference if you try to model an entity, that's fine, But actually turns out that using discriminative rules it is actually more efficient.",
                    "label": 0
                },
                {
                    "sent": "You need far more example less examples, because if you try to recognise something like regularly, what would be a regular instruction like at starting from when there is a time digit PM or AM time.",
                    "label": 1
                },
                {
                    "sent": "This is a rule out right?",
                    "label": 0
                },
                {
                    "sent": "If you try to recognize it, you need at least 4 examples.",
                    "label": 0
                },
                {
                    "sent": "If you have a single roll.",
                    "label": 0
                },
                {
                    "sent": "We that we we bounded rules, you just need 2.",
                    "label": 0
                },
                {
                    "sent": "But actually if you try to learn this with multiple only becomes incredibly complex.",
                    "label": 0
                },
                {
                    "sent": "So you need very lots and lots of examples.",
                    "label": 0
                },
                {
                    "sent": "This is why those methods never never actually went.",
                    "label": 0
                },
                {
                    "sent": "Very far away.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then, when the rules that we are the rules you have to fire them and you will have the usual issue of you will have competing rules for the same place.",
                    "label": 0
                },
                {
                    "sent": "Saying that this is.",
                    "label": 0
                },
                {
                    "sent": "This is a company.",
                    "label": 0
                },
                {
                    "sent": "John Smith FTD is a company, but you will have a Rd sending you.",
                    "label": 0
                },
                {
                    "sent": "John Smith is a person which one wins.",
                    "label": 0
                },
                {
                    "sent": "Which one is the right one so you can choose the largest and you can train a machine learning system to try to recognize which cases are which.",
                    "label": 0
                },
                {
                    "sent": "Or you can use.",
                    "label": 0
                },
                {
                    "sent": "You can wait the rules.",
                    "label": 0
                },
                {
                    "sent": "So, but this is actually where you lose lots of your.",
                    "label": 0
                },
                {
                    "sent": "Your points.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "People tend to use rules with OK, so the question yes I was wondering.",
                    "label": 0
                },
                {
                    "sent": "Find the beginning type but not the corresponding different one, but what happened exactly?",
                    "label": 0
                },
                {
                    "sent": "Exactly, you have to balance them.",
                    "label": 0
                },
                {
                    "sent": "Then see another task when use discriminative when you have a beginning and end, you also have to be sure that the pair and they don't care one at the beginning and the other one at the end of the text you have to wait the average length.",
                    "label": 0
                },
                {
                    "sent": "You will have the maximum length, so there are lots and lots of things you have to do.",
                    "label": 0
                },
                {
                    "sent": "The post processing is actually taking away a lot of results.",
                    "label": 0
                },
                {
                    "sent": "If you if you don't do it properly.",
                    "label": 0
                },
                {
                    "sent": "And you have to remove all these stories once as well.",
                    "label": 0
                },
                {
                    "sent": "Well, I'm not going to do this again.",
                    "label": 0
                },
                {
                    "sent": "This is something that is not being done for quite a long time.",
                    "label": 0
                },
                {
                    "sent": "I mean there are lots of people still doing rule induction, but typically what people used to do at the time was considering that you can't simply learn all the rules in a silly way.",
                    "label": 0
                },
                {
                    "sent": "People tend to use things like covering algorithm or Hill climbing.",
                    "label": 0
                },
                {
                    "sent": "Or is that right or recognized?",
                    "label": 0
                },
                {
                    "sent": "First of all, take an instance.",
                    "label": 0
                },
                {
                    "sent": "Inducible and then we'd see walking distances in the training set will cover, remove them and start with another one.",
                    "label": 0
                },
                {
                    "sent": "But I'm going to do this because I just wanted to mention it.",
                    "label": 0
                },
                {
                    "sent": "Please don't forget about that because we're offering.",
                    "label": 0
                },
                {
                    "sent": "So now these types of algorithms today rules tend to be quite effective.",
                    "label": 0
                },
                {
                    "sent": "Any questions so far?",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "I think I can give to Andrea to talk about more brain things that I'm able to do.",
                    "label": 0
                },
                {
                    "sent": "One thing we don't have a break, but we may have time for one.",
                    "label": 0
                },
                {
                    "sent": "So if you tell us about the break, if you need a break just.",
                    "label": 0
                },
                {
                    "sent": "We may decide, maybe not in when you finish this, but maybe we can operate.",
                    "label": 0
                },
                {
                    "sent": "Yes, OK can you?",
                    "label": 0
                },
                {
                    "sent": "So what the accent?",
                    "label": 0
                },
                {
                    "sent": "So five days begin expect and it is using the rule based approaches.",
                    "label": 0
                },
                {
                    "sent": "But as the manual creation of the rules became very tedious so people started to use statistical machine learning approaches and what we will see in the next few few methods used to extract entity recognition.",
                    "label": 0
                },
                {
                    "sent": "And after that we will discuss some other methods which were used for extracting relations.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So there are two models for doing entity recognition.",
                    "label": 0
                },
                {
                    "sent": "One is a local level model.",
                    "label": 0
                },
                {
                    "sent": "When we are given a sentence and we consider a sentence as a sequence of tokens and they want to identify to classify each of the tokens whether they are part of an entity or they are.",
                    "label": 1
                },
                {
                    "sent": "So in this example, given the centers assuming Aggrastat reserve PM is afternoon, the time expressions 3:30 PM.",
                    "label": 0
                },
                {
                    "sent": "So this will return to us this time expression and also there is another way of decoding the boundaries of our entities.",
                    "label": 0
                },
                {
                    "sent": "So we might want to identify two to denote.",
                    "label": 0
                },
                {
                    "sent": "When did this start?",
                    "label": 0
                },
                {
                    "sent": "And when it ends.",
                    "label": 0
                },
                {
                    "sent": "And this type of formalization can be more important, can be more useful than the previous one.",
                    "label": 0
                },
                {
                    "sent": "In cases when we have more entities one after another, it will allow us to distinguish when the second one starts.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And there are the entity level models which will consider which we want to find them.",
                    "label": 1
                },
                {
                    "sent": "Sentence it was it wants to return a sequence of entities by trying to group the words so they will return us as well.",
                    "label": 1
                },
                {
                    "sent": "3:30 PM as being the time expression.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So just to introduce a little bit of formalism which we will be using when we will discuss the statistical machine learning based approaches for entity recognition.",
                    "label": 0
                },
                {
                    "sent": "So we will get along with X or the instances that we want to classify, for example, or the sentences and we will denote with why our label set plus one will denote that dog and is an entity belongs to an entity and minus one that isn't an entity.",
                    "label": 0
                },
                {
                    "sent": "So such language could be like.",
                    "label": 0
                },
                {
                    "sent": "Location or if you want to do recognition might be location person names.",
                    "label": 0
                },
                {
                    "sent": "Or can I try that be by part of speech tags and Furthermore we make a statistical assumption that our data lies in so follows a distribution.",
                    "label": 0
                },
                {
                    "sent": "Both our training and test data.",
                    "label": 0
                },
                {
                    "sent": "And this first was the IID assumption that.",
                    "label": 0
                },
                {
                    "sent": "Our training data is identically independently distributed from this trip in distribution.",
                    "label": 0
                },
                {
                    "sent": "So what we are giving to the sticker machine learning.",
                    "label": 0
                },
                {
                    "sent": "Classifier is a set of of instances which are labeled with the corresponding labels.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And what we typically want to do, we want to learn a mapping function which will map our instances to our labels and in entity recognition our neighbors are discrete.",
                    "label": 0
                },
                {
                    "sent": "We only want to identify whether a token is a location or a person.",
                    "label": 0
                },
                {
                    "sent": "Oh, but in more general case, we might want to map our instances to real numbers.",
                    "label": 0
                },
                {
                    "sent": "And we will know about the value of this function by while.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what we want to do, we want to find the optimal predictor which will give us the best label sequence for a given input sequence, and so we want to maximize this conditional probability distribution and by applying Bayes rule we can easily see that this is the same as maximizing this joint probability distribution.",
                    "label": 0
                },
                {
                    "sent": "However, our problem is that we don't know this.",
                    "label": 0
                },
                {
                    "sent": "Is so distribution before hand we only have a sample of training examples.",
                    "label": 0
                },
                {
                    "sent": "So what we want to do, we want to estimate this empirical distribution and once we estimated we want to use this model to make further reading.",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the question then arises, how can we decompose this joint probability distribution?",
                    "label": 0
                },
                {
                    "sent": "And according to this the statistical machine learning approaches fall into two categories.",
                    "label": 0
                },
                {
                    "sent": "One are the generative approaches which tries to explain the process behind how the data has been generated and the discriminative approaches which tries to directly model the data.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yes, so if you just have a short, for example, which demonstrates the idea behind these generative approaches.",
                    "label": 1
                },
                {
                    "sent": "So let's say that we want to write a document about athletics.",
                    "label": 0
                },
                {
                    "sent": "So about those specific events, so this article is from the Guardian whose value.",
                    "label": 0
                },
                {
                    "sent": "And we trust different topics such as football, cricket, tennis and athletics.",
                    "label": 0
                },
                {
                    "sent": "So if you know the topics and the content then we can write a story about the about this specific event.",
                    "label": 1
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So which correspond, and if you know the probability distribution of the labels and this conditional probability, then we can.",
                    "label": 0
                },
                {
                    "sent": "Right the the main story.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And in one class the discriminative approaches, they directly want to know that.",
                    "label": 1
                },
                {
                    "sent": "So they are only interested in modeling.",
                    "label": 0
                },
                {
                    "sent": "The task, So what is the best best label sequence for a given input sequence?",
                    "label": 0
                },
                {
                    "sent": "They don't want to know that the whole joint probability distribution, and because there is no need when we will do for the predictions in the future.",
                    "label": 0
                },
                {
                    "sent": "So there is the one don't need for compute.",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That so this table contrast the two approaches before hand.",
                    "label": 0
                },
                {
                    "sent": "If you're given a tax task, we don't really know which one works better, so people typically try both of the approaches.",
                    "label": 0
                },
                {
                    "sent": "And so the generative approaches are useful, and we want to generate examples and discriminative approaches are used for doing good predictions.",
                    "label": 0
                },
                {
                    "sent": "When our data fits the real world, the generative approaches works better.",
                    "label": 1
                },
                {
                    "sent": "And the discriminative approaches works even when the nature of the distribution is unknown.",
                    "label": 1
                },
                {
                    "sent": "And typically the generative approaches are often simple, similar to train, because it involves mostly just the counting and the discriminative approaches the model only this conditional distribution.",
                    "label": 0
                }
            ]
        },
        "clip_82": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So not coming back to the actual models which has been applied for entity recognition.",
                    "label": 0
                },
                {
                    "sent": "So people firstly try to use generative approaches for doing anything recognition and then discriminative approaches and we will understand.",
                    "label": 0
                },
                {
                    "sent": "So we will see in the coming slides.",
                    "label": 0
                },
                {
                    "sent": "The main properties of this or this classify.",
                    "label": 0
                }
            ]
        },
        "clip_83": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Others.",
                    "label": 0
                },
                {
                    "sent": "So we will start with him.",
                    "label": 0
                }
            ]
        },
        "clip_84": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Murders.",
                    "label": 0
                },
                {
                    "sent": "So hidden Markov models tries to explain the data in the observation in terms of the hidden variables.",
                    "label": 1
                },
                {
                    "sent": "So in what follows we will denote the observations that opens from the sentences with shaded circles and the label that we assign to them with the unshaded.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Has somebody?",
                    "label": 0
                },
                {
                    "sent": "Such as the transition probability.",
                    "label": 0
                },
                {
                    "sent": "What is the probability of assigning the given label to token given the previous label assigned to the previous token and also the emission probabilities?",
                    "label": 0
                },
                {
                    "sent": "Which is a probability of over token given the even the label.",
                    "label": 0
                },
                {
                    "sent": "So what they do again?",
                    "label": 0
                },
                {
                    "sent": "So they are generative approaches, so they model is joint probability distribution.",
                    "label": 0
                }
            ]
        },
        "clip_85": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And So what we want to do.",
                    "label": 0
                },
                {
                    "sent": "So during training we want to estimate this probability distributions.",
                    "label": 0
                },
                {
                    "sent": "The transition and emission probability distributions.",
                    "label": 0
                },
                {
                    "sent": "And once we have have done during inference, we want to find the best label sequence for the.",
                    "label": 0
                },
                {
                    "sent": "For The Vamps elevations and for this we can use the Witherby algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_86": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, so there is an extension of the garment extensions we don't like with us.",
                    "label": 0
                },
                {
                    "sent": "One of them it takes.",
                    "label": 0
                },
                {
                    "sent": "It's called and order hidden Markov model, which when it makes a decision about a particular label, it takes into account not only the previous label but also the previous and label assigned to the previous and.",
                    "label": 0
                },
                {
                    "sent": "Tokens.",
                    "label": 0
                },
                {
                    "sent": "So this is a.",
                    "label": 0
                },
                {
                    "sent": "So the transition probability will depend on the previous and labels as well, so there are some advantages of this model because it has has a better memory and.",
                    "label": 0
                },
                {
                    "sent": "However, with this the number of parameters and the computations became much more heavier and difficult.",
                    "label": 0
                }
            ]
        },
        "clip_87": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So few limitations on the hidden Markov model.",
                    "label": 0
                },
                {
                    "sent": "One is relies on its independent assumption that token only depends on the on the labor state, and therefore this model doesn't allow us to incorporate some important features that we have seen so far that capitalization and part of speech tagging are very indicative for Internet recognition, so this model doesn't let us incorporate this information.",
                    "label": 0
                },
                {
                    "sent": "And the other one it comes from its generative nature that we typically don't want to estimate the whole joint probability distribution because what we want to do to just do predictions.",
                    "label": 0
                }
            ]
        },
        "clip_88": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So therefore the second class of algorithms trained overcome this problem and they are discriminative, so they only want to compute this discriminative this conditional probability.",
                    "label": 0
                }
            ]
        },
        "clip_89": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So one of them.",
                    "label": 0
                },
                {
                    "sent": "One of the classifiers are the maximum entropy classifiers which allow us to incorporate arbitrary overlapping and conjunctive functions.",
                    "label": 1
                },
                {
                    "sent": "So basically they are having an exponential model on the on the on the laborers and given the previous papers and and the token.",
                    "label": 0
                },
                {
                    "sent": "And the parameters of the models are the weight vectors and some binary indicative features.",
                    "label": 0
                },
                {
                    "sent": "And Furthermore, we have also a normalization factor.",
                    "label": 0
                }
            ]
        },
        "clip_90": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So just to give an example of the indicator features that we might want to use.",
                    "label": 0
                },
                {
                    "sent": "So if you have the sender Jack London line to Paris, so the features is very similar to what we've seen so far.",
                    "label": 0
                },
                {
                    "sent": "So we we can have features about the token and this as well as incorporate features based on the current label and current state and the previous page.",
                    "label": 0
                },
                {
                    "sent": "And also we can use some features so if you have a guest appear of all the world cities, we can ask whether our token belong to that precompiled list of words.",
                    "label": 0
                }
            ]
        },
        "clip_91": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There is a problem with hidden Markov model.",
                    "label": 0
                },
                {
                    "sent": "For maximum entropy models, which refers to us as the labeling balance problem, which basically has has a bias towards the state which has fewer ongoing transition.",
                    "label": 0
                },
                {
                    "sent": "I'm not going into details how this can be proved, but the idea is that this model will so this model shows that for a given sentence such as Telstra shares rose sharply.",
                    "label": 0
                },
                {
                    "sent": "A maximum entropy model aiming to do battle speech tagging on this sentence would return.",
                    "label": 0
                },
                {
                    "sent": "Praise so yeah, not phrase.",
                    "label": 0
                },
                {
                    "sent": "How?",
                    "label": 0
                },
                {
                    "sent": "The word and.",
                    "label": 0
                },
                {
                    "sent": "And for the other one, on the on the bottom it will be like again another phrasal verb phrase.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "So under this model, the probability of.",
                    "label": 0
                },
                {
                    "sent": "Oversigning to to the sentence.",
                    "label": 0
                },
                {
                    "sent": "Telstra shares the Sheriff throws in the same.",
                    "label": 0
                },
                {
                    "sent": "Ability is is going to be the same that there's a shares is therefore the model will choose if we had the second sentence, it will choose the labels given by the Talkback, which might not be what we want.",
                    "label": 0
                }
            ]
        },
        "clip_92": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "And also the conditional random fields of generalization of the maximum entropy models which overcome this labor by this problem.",
                    "label": 1
                },
                {
                    "sent": "And they do this by having so their exponential model are global, so it is on the entire state an input input space.",
                    "label": 0
                },
                {
                    "sent": "An otherwise they ended are on directed, but otherwise they have the same parameters.",
                    "label": 0
                },
                {
                    "sent": "They have the weight lifters and they have the can have the same indicator feature.",
                    "label": 0
                }
            ]
        },
        "clip_93": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So yeah, typically there is an important issue with this problem with these classifiers that they often overfit the data and in order to avoid this we can use a regularization term.",
                    "label": 0
                },
                {
                    "sent": "And there are various regularization terms that we can use.",
                    "label": 0
                },
                {
                    "sent": "An example is the M2 norm, which takes the length of the of the.",
                    "label": 0
                },
                {
                    "sent": "With vector and basically what this regularization term needs to do, it aims to penalize solutions which has very large weight.",
                    "label": 0
                },
                {
                    "sent": "And often for conditional random fields, it is common to use abortion prior with the specific mean and variance.",
                    "label": 0
                },
                {
                    "sent": "And the the the the mean is typically set to 0 and the variance is just a constant balmy.",
                    "label": 0
                },
                {
                    "sent": "That and we will see later when we will discuss about some intelligent algorithms used for dealing with informal text that this regularization basically are very important.",
                    "label": 0
                }
            ]
        },
        "clip_94": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So and now we will move to to perceptron and support vector machines.",
                    "label": 0
                }
            ]
        },
        "clip_95": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So perceptions algorithm.",
                    "label": 0
                },
                {
                    "sent": "They try to find.",
                    "label": 0
                },
                {
                    "sent": "Separating hyperplane which separates very well the positive and the negative examples where the X is denounced.",
                    "label": 0
                },
                {
                    "sent": "The positive and posting with the negative.",
                    "label": 0
                }
            ]
        },
        "clip_96": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the supervisor machine are just a way to train the perceptron.",
                    "label": 1
                },
                {
                    "sent": "What they want to do?",
                    "label": 1
                },
                {
                    "sent": "They want to find some support vectors to determine this, separating hyperplane, and for doing this they want to learn the the weight.",
                    "label": 0
                },
                {
                    "sent": "And they they sold marketization problem.",
                    "label": 0
                }
            ]
        },
        "clip_97": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And just to remind you again, so we're giving the set of training examples to to the SVM where.",
                    "label": 1
                },
                {
                    "sent": "Just wondering, on Staten Token is an entity and minus one little guy isn't an entity.",
                    "label": 1
                },
                {
                    "sent": "This is also want to learn and regulation for solving the for finding the hyperplane.",
                    "label": 1
                },
                {
                    "sent": "It is given by this equation.",
                    "label": 0
                },
                {
                    "sent": "When we want to multiply the the weights with the feature with the feature vector and we have a swallow a bias term.",
                    "label": 0
                }
            ]
        },
        "clip_98": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we want to do as well.",
                    "label": 0
                },
                {
                    "sent": "We want to find some.",
                    "label": 1
                },
                {
                    "sent": "I don't know hyperplanes which are as far as possible from the from the hyperplane, but they still separate the data very well.",
                    "label": 1
                },
                {
                    "sent": "And we can describe this by by two equations by looking for a hyperplane.",
                    "label": 0
                },
                {
                    "sent": "Which is very close to the positive examples, and one which is very close to the negative examples.",
                    "label": 0
                },
                {
                    "sent": "And this can be basically get the same very very easily as an optimization problem.",
                    "label": 0
                }
            ]
        },
        "clip_99": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I have just proves light switch illustrated graphically so once again we're going to find you want to find the separating hyperplane which will separate the positive examples from the negative examples and we as well want to find the.",
                    "label": 0
                },
                {
                    "sent": "Blood disposable hyperplanes to this one which which is still separate.",
                    "label": 0
                }
            ]
        },
        "clip_100": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "The instances which lie on this parallel hyperplanes are typical equord supervisors.",
                    "label": 0
                }
            ]
        },
        "clip_101": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there is an extension of supervector machines to the structure models such as this negative recognition.",
                    "label": 0
                },
                {
                    "sent": "And what they want to do is in the same iteration they compute the error made by our predictor and it is error is less than user defined error and the margin.",
                    "label": 0
                },
                {
                    "sent": "Then they add this newly labeled instance to set up my strength and they basically solver optimization problem and.",
                    "label": 0
                },
                {
                    "sent": "So they perform this iteration several times.",
                    "label": 0
                }
            ]
        },
        "clip_102": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So coming back to our initial architecture.",
                    "label": 0
                },
                {
                    "sent": "So what we're interested in, we want to do information extraction and we have seen so far or the previous steps that we can perform to do it.",
                    "label": 0
                },
                {
                    "sent": "So now we will be looking at how to extract domain specific terms such as referees when we are talking about the FIFA FIFA World Cup.",
                    "label": 0
                },
                {
                    "sent": "Post on Facebook and now we will be looking.",
                    "label": 0
                },
                {
                    "sent": "How can we extract this automatically?",
                    "label": 0
                }
            ]
        },
        "clip_103": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So first you need to make a distinction between domain term recognition, an end entity recognition, because typically in domain term recognition we only want to say that this span of text is a domain term we are not in.",
                    "label": 1
                },
                {
                    "sent": "We don't want to classify it.",
                    "label": 0
                },
                {
                    "sent": "As in named entity recognition, what we will typically say that this text mom is location or reason.",
                    "label": 0
                },
                {
                    "sent": "So for example, if you have an article about media coverage of this World Cup, which Reporter ratings for the US broadcasting companies ABC and ESPN?",
                    "label": 0
                },
                {
                    "sent": "But the role of of entity recognition would be to say that ABC and ASP and our companies and 2010 is a date, while the objective of them recognition would pay only to say that these three are important, there's.",
                    "label": 0
                }
            ]
        },
        "clip_104": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, so this is very similar to keyboard extraction which is looking into the frequency of the of the words.",
                    "label": 0
                },
                {
                    "sent": "However, in domain name recognition we consider also single and market word expressions and there are various techniques used for this.",
                    "label": 0
                },
                {
                    "sent": "They can be based on content summarization or entity recognition or taking some other tasks such as relation.",
                    "label": 0
                }
            ]
        },
        "clip_105": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So for example, what we want to identify from.",
                    "label": 0
                },
                {
                    "sent": "This post about the FIFA World Cup is like what are the what is the topic where they are talking about?",
                    "label": 0
                },
                {
                    "sent": "So, uh, some potential terms from this game could be referee ref lines, linesman or line Frank Lombard, Lombard in Germany.",
                    "label": 0
                },
                {
                    "sent": "So what?",
                    "label": 0
                }
            ]
        },
        "clip_106": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Want to do?",
                    "label": 0
                },
                {
                    "sent": "Then we want to cluster them based on their type so you can see that the prison with Germany and England is a comp.",
                    "label": 0
                },
                {
                    "sent": "Country.",
                    "label": 0
                }
            ]
        },
        "clip_107": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So there are various ways to doing it if we take.",
                    "label": 0
                },
                {
                    "sent": "Natural language which process so we might want to identify a set of candidate lexical.",
                    "label": 0
                },
                {
                    "sent": "And we'll see whether they appeared in the lexicon or we also can do.",
                    "label": 0
                },
                {
                    "sent": "Began to part of speech tagging and chase front trunk.",
                    "label": 0
                },
                {
                    "sent": "Phrase.",
                    "label": 0
                },
                {
                    "sent": "On the on the sentences and just pick the noun phrases and objective noun phrases as potential terms.",
                    "label": 0
                },
                {
                    "sent": "So looking at N grams and another approach is more statistical based approach which tries to measure the significance of these terms in the lexicons.",
                    "label": 0
                },
                {
                    "sent": "So the main problem is that the choice of the lexicon and statistical measures ISM is often domain specific.",
                    "label": 0
                }
            ]
        },
        "clip_108": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So there are three approaches proposed for doing for recognizing domains, domain terms one our so called term hold, another one is local unit food and there is a hybrid approach.",
                    "label": 0
                },
                {
                    "sent": "So the term would once they want to find out the how representative the terms are by computing the frequency.",
                    "label": 0
                },
                {
                    "sent": "So how strong IS Association of distances on domain specific concepts?",
                    "label": 0
                },
                {
                    "sent": "And one way of doing it is to compute the dump.",
                    "label": 0
                }
            ]
        },
        "clip_109": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which basically given.",
                    "label": 0
                },
                {
                    "sent": "Document or.",
                    "label": 0
                },
                {
                    "sent": "Document, it computes how frequent is each token in a document income, and it normalizes to the total number of.",
                    "label": 0
                },
                {
                    "sent": "And then what we can do, we can rank that this distance by frequency and select the most frequent ones.",
                    "label": 0
                },
                {
                    "sent": "However, with this method we will find that common words such as.",
                    "label": 0
                },
                {
                    "sent": "The end a.",
                    "label": 0
                },
                {
                    "sent": "And a will begin very very frequent, which are not going there.",
                    "label": 0
                },
                {
                    "sent": "So this is maybe the best measure for finding.",
                    "label": 0
                }
            ]
        },
        "clip_110": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Return.",
                    "label": 0
                },
                {
                    "sent": "So a better measure is if we combine this term frequency with the inverse document frequency.",
                    "label": 0
                },
                {
                    "sent": "So we want to.",
                    "label": 0
                }
            ]
        },
        "clip_111": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this basically takes into account not only the frequency of word in.",
                    "label": 0
                },
                {
                    "sent": "1 corpus, but it also takes into account the overall frequency of of the token.",
                    "label": 0
                },
                {
                    "sent": "In a subset of documents and in this way, common words such as the and a will be disregarded because they are equally.",
                    "label": 0
                },
                {
                    "sent": "Frequently, for example in newswire domains.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_112": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another approach is quite a business.",
                    "label": 0
                }
            ]
        },
        "clip_113": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which basically it computes the frequency of a word in domain specific corpus and also in a referendum general topic corpus and an example of general topic corpus is the.",
                    "label": 0
                },
                {
                    "sent": "The British National Corpus and basically it.",
                    "label": 0
                },
                {
                    "sent": "It computes how frequent is is a word in a in a specific corpus, as opposed to a general specific corpus.",
                    "label": 0
                }
            ]
        },
        "clip_114": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And now there are the unique code approaches which basically tries to measure how important is to see to consecutive words together and.",
                    "label": 0
                },
                {
                    "sent": "And therefore they they focusing in this market, work expressions which are basically for more tokens.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "One way of computing this is to apply pointer pointwise mutual information.",
                    "label": 0
                }
            ]
        },
        "clip_115": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which, So what it does?",
                    "label": 0
                },
                {
                    "sent": "For example, if you have given the world So what we're expecting is that words such as World Cup will be more frequently seen together in some posts about to the World Cup.",
                    "label": 0
                },
                {
                    "sent": "And then seeing the world the also the two words separately, such as the world and God.",
                    "label": 0
                },
                {
                    "sent": "And This is why when we compute this.",
                    "label": 0
                },
                {
                    "sent": "This measure will be taking into account the frequency of seeing these two words together, as opposed to seeing them separately.",
                    "label": 0
                }
            ]
        },
        "clip_116": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there are many other measures that we can use to to quantify the importance of a term or to filter out terms which are important.",
                    "label": 0
                },
                {
                    "sent": "And a few of them are, so using T test or Chi Square measure or for log likelihood.",
                    "label": 0
                }
            ]
        },
        "clip_117": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this method that we have seen it can be used for measuring their associations and collocations which wants to determine how much two non consecutive terms are associated by.",
                    "label": 0
                },
                {
                    "sent": "Exploiting sounded stupid, some statistiques distribution recipes.",
                    "label": 0
                }
            ]
        },
        "clip_118": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is just an extension of the previously presented mutual information appointment user information measure, which also takes into account.",
                    "label": 0
                },
                {
                    "sent": "The context window and the frequency of of the two words which was found within within the context now.",
                    "label": 0
                }
            ]
        },
        "clip_119": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there are so called hybrid approaches which runs to capture both awesome and unique unit 2 in a balanced way, and one way of capturing this is by applying.",
                    "label": 0
                }
            ]
        },
        "clip_120": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "See value measure, which basically what it tries to do, so when.",
                    "label": 0
                },
                {
                    "sent": "Will turn consist more than two words?",
                    "label": 0
                },
                {
                    "sent": "In that case it the the question arises whether it has any.",
                    "label": 0
                },
                {
                    "sent": "If it has any other items nested in.",
                    "label": 0
                },
                {
                    "sent": "And if it doesn't consist in, then just takes the frequency of the other string and the length of the string, and if it contains, it will look for other candidates terms which contains a as domestic store.",
                    "label": 0
                }
            ]
        },
        "clip_121": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And some other measures.",
                    "label": 0
                }
            ]
        },
        "clip_122": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Are the blue facts.",
                    "label": 0
                },
                {
                    "sent": "Which things to consider it in first measures the term domain specificity and the atomic cohesion?",
                    "label": 0
                },
                {
                    "sent": "And it computes these two and make makes a final decision based on these two dollars.",
                    "label": 0
                }
            ]
        },
        "clip_123": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there are the.",
                    "label": 0
                }
            ]
        },
        "clip_124": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So one turning their Max measure which has three components.",
                    "label": 0
                },
                {
                    "sent": "One aims to capture the domain partners.",
                    "label": 0
                },
                {
                    "sent": "Which is which is the probability of the funding one domain as opposed to another domain?",
                    "label": 0
                },
                {
                    "sent": "The domain consensus, which aims to capture that term is found in a corpus belonging to a domain of interest.",
                    "label": 0
                },
                {
                    "sent": "And there is some lexical consensus which aims to capture the frequency of a term occurring as a single unit, as opposed to.",
                    "label": 0
                },
                {
                    "sent": "Exception",
                    "label": 0
                }
            ]
        },
        "clip_125": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Using trying to identify terms in some very complex technical domains such as the aerospace domain, this is the work with Jonathan and Fabio, so they will try it with draft.",
                    "label": 0
                },
                {
                    "sent": "Space for me.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_126": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, I'm not.",
                    "label": 0
                },
                {
                    "sent": "There might be a concept.",
                    "label": 0
                },
                {
                    "sent": "This is a play.",
                    "label": 0
                },
                {
                    "sent": "LB pressure routing stage to play, so all of the strings and related he refer to this.",
                    "label": 0
                },
                {
                    "sent": "Disturbed.",
                    "label": 0
                },
                {
                    "sent": "And then the task was to.",
                    "label": 0
                },
                {
                    "sent": "Personally, find all these different variations.",
                    "label": 0
                },
                {
                    "sent": "Strings which all refer to the same concept and to assign to them.",
                    "label": 0
                },
                {
                    "sent": "Or you will write code which in this this case it was an 80 a cold.",
                    "label": 0
                }
            ]
        },
        "clip_127": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Spike.",
                    "label": 0
                },
                {
                    "sent": "So when they conducted the study, which shows that the possible scenarios describing an entity increases exponentially.",
                    "label": 0
                },
                {
                    "sent": "Sorry, nearly.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Yes, so for example, if a frequency of token was 75, so they found 40 different synonyms describing the.",
                    "label": 0
                }
            ]
        },
        "clip_128": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So and what they were doing, they were first applying this techniques, which I presented.",
                    "label": 0
                },
                {
                    "sent": "And they found that in such complex technical domains, these techniques doesn't work so well.",
                    "label": 0
                },
                {
                    "sent": "And they did an extensive evaluation using analyzing 88,000 people.",
                    "label": 0
                },
                {
                    "sent": "And what the results indicate that.",
                    "label": 0
                },
                {
                    "sent": "But this measures performed very poorly on this complex domains and basically in it.",
                    "label": 0
                },
                {
                    "sent": "In some cases they they have doubled.",
                    "label": 0
                },
                {
                    "sent": "And there is a program to say what was the method used by them.",
                    "label": 0
                }
            ]
        },
        "clip_129": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what they were doing is basically they had a candidate list of gazetteers and they were applying some similarity distant measures to.",
                    "label": 0
                },
                {
                    "sent": "To guess whether string is a term.",
                    "label": 0
                },
                {
                    "sent": "And they were so in this paper they detailed all the distant metrics that they were using.",
                    "label": 0
                },
                {
                    "sent": "So if you're interested, you can.",
                    "label": 0
                },
                {
                    "sent": "You can read more about this.",
                    "label": 0
                }
            ]
        },
        "clip_130": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "And now we will continue with some other tasks such as relation extraction.",
                    "label": 0
                },
                {
                    "sent": "Which were represented by from you.",
                    "label": 0
                },
                {
                    "sent": "Flying.",
                    "label": 0
                }
            ]
        }
    }
}