{
    "id": "2wzyoivlbvbtbn6efppe56obuguwr6jy",
    "title": "Plenary Session: The Role of Teachers, Students and Institutions on OER",
    "info": {
        "author": [
            "Helge Schwitters, European Students’ Union (ESU)"
        ],
        "published": "Oct. 12, 2017",
        "recorded": "September 2017",
        "category": [
            "Top->Social Sciences->Education",
            "Top->Social Sciences->Society",
            "Top->Technology"
        ]
    },
    "url": "http://videolectures.net/oercongress2017_schwitters_teachers_students/",
    "segmentation": [
        [
            "OK, then we busted the 1st."
        ],
        [
            "Smith, which is that my generation is way better at handling digital tools than yours are because I'm completely this technique and I've been so from a very young age an I haven't developed my technical technological skills along the way.",
            "But anyways, I'm here representing the European Students union.",
            "For those who don't know about our organization, where the umbrella organization for national unions of students in Europe and we represent the big majority of national unions of students in Europe.",
            "Re represent unions from 37 countries and altogether 42 unions.",
            "We start off with.",
            "Unfortunately, we don't have any say colleagues from other nations or other continents represented here at this Congress, which is meant to be representing the whole world.",
            "But therefore I want to go back to a document, a statement made by students from national unions of students from around the world.",
            "Now this was only a small sample, but this is a document called the Bergen Declaration.",
            "Which was written by representatives from Burkina Faso, Zimbabwe.",
            "The small Pacific Island state of Niue.",
            "Canada.",
            "Columbia.",
            "And.",
            "Kazakhstan, together with some old Myanmar and some European countries.",
            "And we gathered a couple of these unions together in a hotel somewhere in the mountains of Norway, and we came up to try to find the values of the student movement.",
            "And there were a couple of things that we agreed upon and which were.",
            "So easy to find and that is that education should be a public good.",
            "It should not be a privilege to the few and one of the most important thing that we can do with higher education is to make it accessible to all.",
            "Anne.",
            "It's true and students sitting there not only interested in improving the quality of their own education, but also on how higher education impacts the society around us and also has an impact on the potential students that wish to pursue an to take a higher education well.",
            "When we go through all of these values, all these building building blocks of the student movement, it would be come as no surprise that we're also big supporters of the Open Access and open educational resources movement.",
            "This is out."
        ],
        [
            "Of, say, two pillars and the things I have here on my.",
            "On my PowerPoint presentation does not cover anything near of all the arguments there are for having open educational resources accessible to students, but the main two arguments I would cluster into access and quality.",
            "The access argument has been made a couple of times already that there is too much public money being wasted in buying the rights to research that has already been paid for.",
            "With public funding and this money could be used elsewhere to improve access to education by either decreasing or taking away tuition fees to hire more teachers to have more classes, etc.",
            "But there are other things with access that can be provided through open educational resources, and one of the more important thing.",
            "Is to have access to all the resources from home.",
            "Most teach most textbooks in the old format are able to be taken back home.",
            "Their fiscal you take them into your backpack.",
            "You go home, you can read it there.",
            "But in the digital world, we often access the articles online.",
            "And due to the fact that they've been bought by University libraries often create some behind this payment wall, which only makes them accessible at the institution itself.",
            "And not accessible back home.",
            "This course also a barrier to students that are not able to participate in the same way as what we consider to be the typical student.",
            "Those are students with children.",
            "Students in rural areas.",
            "Students with disability, you name it.",
            "There are a couple of reasons to not be able to go to campus.",
            "There are also more adaptable to individual learners needs through customizations and by opening up the axis we're also creating this gateway in to translate the educational resources that we have.",
            "They also, on the quality side they.",
            "They make this also by being translatable, but also by being shared more easily.",
            "Makes this knowledge that we create cross borders.",
            "This in itself also increases the internationalization we get more in touch with resources from outside our countries.",
            "Many countries are still quite isolated in many countries you don't have access to educational resources that are not say.",
            "Opened up by either say, regime, the politics of a given regime or by not being say, informed about the possibilities that are out there.",
            "They foster critical thinking.",
            "They also foster creativity problem solving, but I'm going to focus a bit on the second last point on that list, which are students as Co producers of knowledge.",
            "Because.",
            "We often we can talk about technological innovations as.",
            "You have the disruptive technologies, but you also have technologies that basically do not change a paradigm totally, but that offers us new new possibilities and I don't think that we should treat open educational resources as some kind of disruptive technology.",
            "Yet we do not know if we're going to get there at some point.",
            "There is simply not there hasn't been remixed enough to know where we're actually getting to in the end, and therefore I think it's.",
            "Important that we use existing good frameworks.",
            "In pedagogy, when we include open educational resources and those are."
        ],
        [
            "From S's perspective, the student centered learning paradigm.",
            "Student centered Learning is a concept that, together with other stakeholders ESU, was part of developing, which are a couple of principles for good teaching and learning.",
            "Basically, it's a change from C, putting the teacher at the center of learning, and to focus this around the learner.",
            "Now this seems very simple, but it's often.",
            "Not implemented, even though it's kind of natural for us to see the learner as the learner and the teacher not to be the one learning.",
            "But in surprisingly surprisingly many universities an in class, is it still the teacher thinking about only their role in bringing across a message?",
            "Well, open educational resources.",
            "What can they bring us?",
            "Well, they offers us more choice to choose our own curricula.",
            "They also offers students the opportunity to be part of this.",
            "Re mixing of water learning.",
            "It also offers students the chance of together with the teachers, go on and further develop both the teaching methods and the content being provided an not only by.",
            "How do we want to sit together and learn but also?",
            "What kind of tools are we using?"
        ],
        [
            "So the beginning I would say to everyone here that is part of the administration of higher education institutions and also to all teachers that we must never be afraid to set new expectations from the very beginning to students.",
            "When I began to study, I had no idea where where knowledge came from.",
            "Well, I knew where the textbooks came from, but we were given this computer with access to all these incredible articles.",
            "But to know where where the sums all that money that was being spent was completely invisible to us.",
            "I come from a very, very.",
            "Privileged country and from Norway myself.",
            "So all we saw was basically some kind of Google service, making it possible for us to look for information.",
            "Well.",
            "By this what I'm what I'm trying to say here is that in the same way as I had no idea where knowledge came from, we can also form students that are coming at the universities too.",
            "To only to see open educational resources and Open Access as the norm and not as the.",
            "Not as the more ideal alternative, and we can see this being done in a couple of countries already by, for example, putting requirements that all all the research conducted by students has to be published in Open Access.",
            "We also see this through the EU has been good at this in the Horizon 2020 projects to require all research made with their funding to be published.",
            "Open Access and this is a message that should.",
            "Fee taught to students from the very beginning."
        ],
        [
            "So a good strategy for the implementation of open educational resources, which I feel needs to be done centrally because students can.",
            "Can do not, will not fight it if you introduce it is that we have to have a strategy that recognizes students as Co producers of knowledge and therefore also.",
            "Able to take actively part injury, mixing, reshaping and the sharing of the open educational resources.",
            "It's one that places students creativity in the center of interaction with the educational resources, one that aims to make use of the full potential to adapt and to customize the resources that we have and that one that sets early expectations for students to contributes to the O ER community.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, then we busted the 1st.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Smith, which is that my generation is way better at handling digital tools than yours are because I'm completely this technique and I've been so from a very young age an I haven't developed my technical technological skills along the way.",
                    "label": 0
                },
                {
                    "sent": "But anyways, I'm here representing the European Students union.",
                    "label": 0
                },
                {
                    "sent": "For those who don't know about our organization, where the umbrella organization for national unions of students in Europe and we represent the big majority of national unions of students in Europe.",
                    "label": 0
                },
                {
                    "sent": "Re represent unions from 37 countries and altogether 42 unions.",
                    "label": 0
                },
                {
                    "sent": "We start off with.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, we don't have any say colleagues from other nations or other continents represented here at this Congress, which is meant to be representing the whole world.",
                    "label": 0
                },
                {
                    "sent": "But therefore I want to go back to a document, a statement made by students from national unions of students from around the world.",
                    "label": 0
                },
                {
                    "sent": "Now this was only a small sample, but this is a document called the Bergen Declaration.",
                    "label": 0
                },
                {
                    "sent": "Which was written by representatives from Burkina Faso, Zimbabwe.",
                    "label": 0
                },
                {
                    "sent": "The small Pacific Island state of Niue.",
                    "label": 0
                },
                {
                    "sent": "Canada.",
                    "label": 0
                },
                {
                    "sent": "Columbia.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Kazakhstan, together with some old Myanmar and some European countries.",
                    "label": 0
                },
                {
                    "sent": "And we gathered a couple of these unions together in a hotel somewhere in the mountains of Norway, and we came up to try to find the values of the student movement.",
                    "label": 0
                },
                {
                    "sent": "And there were a couple of things that we agreed upon and which were.",
                    "label": 0
                },
                {
                    "sent": "So easy to find and that is that education should be a public good.",
                    "label": 1
                },
                {
                    "sent": "It should not be a privilege to the few and one of the most important thing that we can do with higher education is to make it accessible to all.",
                    "label": 1
                },
                {
                    "sent": "Anne.",
                    "label": 1
                },
                {
                    "sent": "It's true and students sitting there not only interested in improving the quality of their own education, but also on how higher education impacts the society around us and also has an impact on the potential students that wish to pursue an to take a higher education well.",
                    "label": 0
                },
                {
                    "sent": "When we go through all of these values, all these building building blocks of the student movement, it would be come as no surprise that we're also big supporters of the Open Access and open educational resources movement.",
                    "label": 0
                },
                {
                    "sent": "This is out.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of, say, two pillars and the things I have here on my.",
                    "label": 0
                },
                {
                    "sent": "On my PowerPoint presentation does not cover anything near of all the arguments there are for having open educational resources accessible to students, but the main two arguments I would cluster into access and quality.",
                    "label": 0
                },
                {
                    "sent": "The access argument has been made a couple of times already that there is too much public money being wasted in buying the rights to research that has already been paid for.",
                    "label": 0
                },
                {
                    "sent": "With public funding and this money could be used elsewhere to improve access to education by either decreasing or taking away tuition fees to hire more teachers to have more classes, etc.",
                    "label": 0
                },
                {
                    "sent": "But there are other things with access that can be provided through open educational resources, and one of the more important thing.",
                    "label": 0
                },
                {
                    "sent": "Is to have access to all the resources from home.",
                    "label": 0
                },
                {
                    "sent": "Most teach most textbooks in the old format are able to be taken back home.",
                    "label": 0
                },
                {
                    "sent": "Their fiscal you take them into your backpack.",
                    "label": 0
                },
                {
                    "sent": "You go home, you can read it there.",
                    "label": 0
                },
                {
                    "sent": "But in the digital world, we often access the articles online.",
                    "label": 0
                },
                {
                    "sent": "And due to the fact that they've been bought by University libraries often create some behind this payment wall, which only makes them accessible at the institution itself.",
                    "label": 0
                },
                {
                    "sent": "And not accessible back home.",
                    "label": 0
                },
                {
                    "sent": "This course also a barrier to students that are not able to participate in the same way as what we consider to be the typical student.",
                    "label": 0
                },
                {
                    "sent": "Those are students with children.",
                    "label": 0
                },
                {
                    "sent": "Students in rural areas.",
                    "label": 0
                },
                {
                    "sent": "Students with disability, you name it.",
                    "label": 0
                },
                {
                    "sent": "There are a couple of reasons to not be able to go to campus.",
                    "label": 0
                },
                {
                    "sent": "There are also more adaptable to individual learners needs through customizations and by opening up the axis we're also creating this gateway in to translate the educational resources that we have.",
                    "label": 1
                },
                {
                    "sent": "They also, on the quality side they.",
                    "label": 0
                },
                {
                    "sent": "They make this also by being translatable, but also by being shared more easily.",
                    "label": 0
                },
                {
                    "sent": "Makes this knowledge that we create cross borders.",
                    "label": 0
                },
                {
                    "sent": "This in itself also increases the internationalization we get more in touch with resources from outside our countries.",
                    "label": 0
                },
                {
                    "sent": "Many countries are still quite isolated in many countries you don't have access to educational resources that are not say.",
                    "label": 0
                },
                {
                    "sent": "Opened up by either say, regime, the politics of a given regime or by not being say, informed about the possibilities that are out there.",
                    "label": 0
                },
                {
                    "sent": "They foster critical thinking.",
                    "label": 1
                },
                {
                    "sent": "They also foster creativity problem solving, but I'm going to focus a bit on the second last point on that list, which are students as Co producers of knowledge.",
                    "label": 0
                },
                {
                    "sent": "Because.",
                    "label": 0
                },
                {
                    "sent": "We often we can talk about technological innovations as.",
                    "label": 0
                },
                {
                    "sent": "You have the disruptive technologies, but you also have technologies that basically do not change a paradigm totally, but that offers us new new possibilities and I don't think that we should treat open educational resources as some kind of disruptive technology.",
                    "label": 0
                },
                {
                    "sent": "Yet we do not know if we're going to get there at some point.",
                    "label": 0
                },
                {
                    "sent": "There is simply not there hasn't been remixed enough to know where we're actually getting to in the end, and therefore I think it's.",
                    "label": 1
                },
                {
                    "sent": "Important that we use existing good frameworks.",
                    "label": 0
                },
                {
                    "sent": "In pedagogy, when we include open educational resources and those are.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From S's perspective, the student centered learning paradigm.",
                    "label": 0
                },
                {
                    "sent": "Student centered Learning is a concept that, together with other stakeholders ESU, was part of developing, which are a couple of principles for good teaching and learning.",
                    "label": 0
                },
                {
                    "sent": "Basically, it's a change from C, putting the teacher at the center of learning, and to focus this around the learner.",
                    "label": 0
                },
                {
                    "sent": "Now this seems very simple, but it's often.",
                    "label": 0
                },
                {
                    "sent": "Not implemented, even though it's kind of natural for us to see the learner as the learner and the teacher not to be the one learning.",
                    "label": 0
                },
                {
                    "sent": "But in surprisingly surprisingly many universities an in class, is it still the teacher thinking about only their role in bringing across a message?",
                    "label": 0
                },
                {
                    "sent": "Well, open educational resources.",
                    "label": 0
                },
                {
                    "sent": "What can they bring us?",
                    "label": 0
                },
                {
                    "sent": "Well, they offers us more choice to choose our own curricula.",
                    "label": 0
                },
                {
                    "sent": "They also offers students the opportunity to be part of this.",
                    "label": 0
                },
                {
                    "sent": "Re mixing of water learning.",
                    "label": 0
                },
                {
                    "sent": "It also offers students the chance of together with the teachers, go on and further develop both the teaching methods and the content being provided an not only by.",
                    "label": 0
                },
                {
                    "sent": "How do we want to sit together and learn but also?",
                    "label": 0
                },
                {
                    "sent": "What kind of tools are we using?",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the beginning I would say to everyone here that is part of the administration of higher education institutions and also to all teachers that we must never be afraid to set new expectations from the very beginning to students.",
                    "label": 1
                },
                {
                    "sent": "When I began to study, I had no idea where where knowledge came from.",
                    "label": 0
                },
                {
                    "sent": "Well, I knew where the textbooks came from, but we were given this computer with access to all these incredible articles.",
                    "label": 0
                },
                {
                    "sent": "But to know where where the sums all that money that was being spent was completely invisible to us.",
                    "label": 0
                },
                {
                    "sent": "I come from a very, very.",
                    "label": 0
                },
                {
                    "sent": "Privileged country and from Norway myself.",
                    "label": 0
                },
                {
                    "sent": "So all we saw was basically some kind of Google service, making it possible for us to look for information.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "By this what I'm what I'm trying to say here is that in the same way as I had no idea where knowledge came from, we can also form students that are coming at the universities too.",
                    "label": 0
                },
                {
                    "sent": "To only to see open educational resources and Open Access as the norm and not as the.",
                    "label": 0
                },
                {
                    "sent": "Not as the more ideal alternative, and we can see this being done in a couple of countries already by, for example, putting requirements that all all the research conducted by students has to be published in Open Access.",
                    "label": 0
                },
                {
                    "sent": "We also see this through the EU has been good at this in the Horizon 2020 projects to require all research made with their funding to be published.",
                    "label": 0
                },
                {
                    "sent": "Open Access and this is a message that should.",
                    "label": 0
                },
                {
                    "sent": "Fee taught to students from the very beginning.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So a good strategy for the implementation of open educational resources, which I feel needs to be done centrally because students can.",
                    "label": 0
                },
                {
                    "sent": "Can do not, will not fight it if you introduce it is that we have to have a strategy that recognizes students as Co producers of knowledge and therefore also.",
                    "label": 0
                },
                {
                    "sent": "Able to take actively part injury, mixing, reshaping and the sharing of the open educational resources.",
                    "label": 0
                },
                {
                    "sent": "It's one that places students creativity in the center of interaction with the educational resources, one that aims to make use of the full potential to adapt and to customize the resources that we have and that one that sets early expectations for students to contributes to the O ER community.",
                    "label": 1
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": []
        }
    }
}