{
    "id": "2yh46y5bdyvylhjo3mvwu4hrypa7k5a2",
    "title": "DESSO: Cradle to Cradle Company",
    "info": {
        "author": [
            "Julian Richardson, DESSO"
        ],
        "published": "Nov. 12, 2010",
        "recorded": "October 2010",
        "category": [
            "Top->Technology",
            "Top->Business"
        ]
    },
    "url": "http://videolectures.net/bio2010_richardson_desso/",
    "segmentation": [
        [
            "Neither was the jail system era yesterday, so.",
            "He is a pro, she could make it transparent.",
            "Being a member.",
            "Is it standard?",
            "Julian the breeder in upgrade an AK or team.",
            "Cool with the kind in the caption, achieved the long perpendicular employer 440.",
            "I see you didn't.",
            "Managed to get the earphones so OK, so I just sent a little bit short introduction about what you have done in the company and that you will tell us more about it.",
            "Is over here.",
            "My name is Julie images and I'm representing decimal.",
            "Before we go into the kids will just like to introduce Des or two and what the company is."
        ],
        [
            "No.",
            "Largest textile manufacturer for carpets.",
            "We started in the 1930s in Belgium.",
            "And in 1950, the name Dessel was established into the market.",
            "In 1988 we also started manufacturing artificial grass."
        ],
        [
            "The artificial grass is for football stadiums and sports arenas and leisure centres.",
            "But the most important date for us in our history is in 2007 we was bought by NPN.",
            "It was a Dutch investment bank.",
            "And this is the date that marks our new beginning and we will see you're currently is with Steven and I settled on this path, infiltrated, and I'm speaking from a business point of view.",
            "And this has actually made fantastic business opportunities for us."
        ],
        [
            "We are split into different divisions.",
            "We have the contract division hospitality add or marine form and sport."
        ],
        [
            "To give you a scale of the size of the company we currently employ about 1000 employees and it cannot be.",
            "Towns alone would produce 7 million square meters per year in broadloom 5,000,000 square meters per year and artificial gas nearly three.",
            "So.",
            "When you actually look at those white, extremely large figures, we also see that we have an issue with landfill.",
            "Potentially all that is landfill.",
            "So you can see that we've got a good challenge ahead of us and with cradle to cradle, we've actually started to make a change to that figure."
        ],
        [
            "As a statement says, we are happy to be apart of cradle cradle.",
            "We actually promote it first and foremost as a business.",
            "It is purely one of our core values of Dessel."
        ],
        [
            "Now.",
            "The equal efficiency that we've been going through this last number of years.",
            "You can see that we've actually reduced our water content consumption 50 by 50% in Belgium.",
            "Our energy consumption is reduced by 23% over the last 10 years.",
            "And we have been recycling our material waste in the factory back in again.",
            "But this is sustainability.",
            "This is reducing the fact, but it's not doing good.",
            "You know we're doing less bad.",
            "So from now on we move forward and we're now cradle to people moving about."
        ],
        [
            "We are now created created.",
            "One of the things that we will do, people say talk about minimizing their footprint.",
            "We're not doing that.",
            "We are going to give the biggest footprint possible, but a very good one.",
            "We want to improve the quality of life and the environment.",
            "We utilize all our materials using post proposed consumer raw materials and obviously all our tables are going to our campus.",
            "Want to be 100% safe for people and the environment and use the neural energies."
        ],
        [
            "Implication decimal to develop new products for indoor air quality.",
            "Dessel is the first company to produce a child which we now call Airmaster, which is the first time ever to have the gold standard in the GUT for indoor air quality, at literally acts as an air filter and cleans the air 4 times better than a standard carpet and eight times better than a hard floor.",
            "So again.",
            "Using the cradle to cradle philosophy and starting with ideas from design, we actually created new products and new business opportunities.",
            "And we want to promote creativity and invite new designers, young designers, architects to come along today.",
            "So help is improved and obviously come up with creating new ideas."
        ],
        [
            "Where we going to go from 2010 to 2020?",
            "50% of all our products will be used from post consumer waste.",
            "We will be using 100% renewable energy obviously, and going down take back systems is going to be vital which we will go into in a second.",
            "At the moment we have probably 10 products which are filled, cradle certified and by the end of this year, sorry.",
            "Next year all now account details or standard ranges will be created to create a basic certification which is a fantastic step for us.",
            "Safe external materials and we use the side."
        ],
        [
            "The strategic plan Dessel we are investing our we're looking at currently actually building our own biomass energy center.",
            "This is in the media about 12 million euros that we're looking, and we're currently in partnership at the moment, but we're looking at wind energy and solar energy.",
            "As well as that, and we've also got the first green roof on the factory, so we are enticing wildlife and specific animals and insects back onto.",
            "Designs."
        ],
        [
            "Biological circle we do work in both sides.",
            "The biological circle and the technical technological field.",
            "As you can see, the product or what you buy your carpet or carpet tiles you can actually use it, but the end of its life to give him.",
            "You have to decompose and return itself back into raw materials or this road nutrients.",
            "So then we can grow.",
            "That's got product again and then go back to the."
        ],
        [
            "Do we have some?",
            "Prototypes, but we are working.",
            "We are actually trying to develop floorcoverings made from paper and jute."
        ],
        [
            "And here is 1 made of bamboo, so we're trying different natural fibers, which again can be totally easily decomposed back into the soil to be a nutrient again to grow that."
        ],
        [
            "He is 1 just from jute."
        ],
        [
            "But most of these hotels in which is not a bad thing to say.",
            "Most of our sales, about 99% of the wheels are made from plastic nylon.",
            "Which is not a bad thing for so long as that material comes back into the cycle and be reused.",
            "There's nothing wrong with it.",
            "Waste and it's not going back into the environment is not hurting anything and nothing else is coming from the environment to go into it."
        ],
        [
            "So when you look at accounts how people think or counting cars just made of nylon top and a bit you mean back or in some cases you know nasty PVCS.",
            "We do not use PVC for obvious reasons.",
            "You know due to poisonous issues that we don't touch them.",
            "Is more than that.",
            "When we actually analyze with partnership with EPA is probably about 800 chemicals in a carpet tile.",
            "So.",
            "We saw the graph previously.",
            "We find we're identifying all the nasty unwanted chemical elements in there and replacing them with good ones."
        ],
        [
            "And here we are.",
            "The basic test vessel."
        ],
        [
            "Now we do use Beitchman as a carpet back.",
            "We've been in natural product.",
            "You know it's quite safe, but under critical we cannot guarantee.",
            "The contents 100% all of the time.",
            "It can very convenient.",
            "So when you put your hand on your heart and if you're going to do the right thing, which decimal is wanting to do?",
            "We have to move away from Richmond."
        ],
        [
            "So.",
            "Again, join."
        ],
        [
            "We are coming."
        ],
        [
            "And you bucking made from."
        ],
        [
            "Nylon it's totally 100% safe for humans and the environment.",
            "And more importantly, is 100% recycled back into its original form, so we do not need to take anymore funding from the environment, and we do not need to put anything into landfill or to be bird.",
            "So is a fantastic step."
        ],
        [
            "Recently installed."
        ],
        [
            "But when you're looking at account big title, you know you might want to choose a red one or a blue one.",
            "We've got some wonderful designs in there, but on the credit card we have to actually analyze every single tile.",
            "Because there's gonna be different chemical elements in a blue one than this 2 available.",
            "And we all know that the dying industry in various parts of the world is not very nice.",
            "Is is dependent on heavy metals and lots of nasty elements.",
            "So it takes a long time and a lot of investment to come this far.",
            "But it's important that we do it.",
            "Do it for you that may do for the environment.",
            "So when we look at a one of our titles now is positively defined dyestuffs.",
            "PS6 young reason that we're moving more towards that are not not nylon.",
            "66 is purely we can actually depolymerize nylon 6 back into white Virgin yarn again again, the cradle to cradle closing that loop not being take anything else from the environment.",
            "Hotmail stabilizer on the polyolefin."
        ],
        [
            "Now, one thing about cradle to cradle with an existing product.",
            "It takes a lot of time, a lot of investment to get to this stage.",
            "But critics feelings about design.",
            "If you design a tile from the beginning to actually be able to take it apart and recycle it with no other resources under percent energy, you can forget master sustainability because you can do it all the time.",
            "Then you can have a defined lifespan.",
            "Economies can keep going, can still keep on selling copies.",
            "You know, if we sell copies that last 45 years, people don't want it because I want to change the color.",
            "It keeps the economy going.",
            "You know nobody's probably got a laptop that's over 25 years old, or the phone over 15 years old.",
            "People want to new things and keep on moving forward.",
            "Cradle to cradle allows you to do that.",
            "Without harming the environment without harming people?"
        ],
        [
            "This is just showing we did a recent exhibition in Holland trying to get the cradle to cradle message over to people about waste makes you know your raw materials."
        ],
        [
            "So people came along, so the bins and actually put all the papers, all the waste food in there."
        ],
        [
            "But here we go, we are investing heavily in new technology.",
            "This is a new plant for the new back in the new EcoBoost.",
            "Back in total cradle to create."
        ],
        [
            "You know we."
        ],
        [
            "With this, or we do actually want to be totally see to see with investing heavily in money, it makes business sense and it creates business opportunities.",
            "Some of the ideas that we've come out with, like the airmaster, the equal base.",
            "It is successful.",
            "It makes people buy the product they want to believe in it.",
            "It's not just a story.",
            "But with everything else, we still have to go through rigorous testing for all outfit available products.",
            "You know, we want people to buy out the trust in Dessel.",
            "The dimensional stability of the products you know light less light on the floor.",
            "It lasts a lifetime that the client wants it."
        ],
        [
            "But then the day we have to.",
            "Get the carpet back.",
            "This is logistically this is quite difficult.",
            "We do not want anybody to put carpet tiles into a landfill site.",
            "And Dessel will take back carpet tiles from anybody.",
            "Except for PVC back County towns, because we don't want to handle poisonous goods.",
            "So if you've got carpet tiles and you're going to do a building or you want to do a building, send them back today so I'm not bothered if they're not vessels.",
            "We will recycle them, yeah?",
            "Because we can, or we are one of the only ones who can actually dismantle these carpets and get the goodness out of them and use them."
        ],
        [
            "What we currently do."
        ],
        [
            "As we go."
        ],
        [
            "And we shred it.",
            "We got paid in reading about half a million euros for the machine to do."
        ],
        [
            "And then we slowly start separating into a special process what's ours."
        ],
        [
            "And then we become reusable young again.",
            "This goes back to our suppliers, who then can depolarize it and turn it back into Virgin white material.",
            "So yes, we recycle.",
            "Copies we recycled carbon fiber book.",
            "When you think about it.",
            "We actually make copies of Virgin material.",
            "Because we turn it back into white yarn again so it can be colored toward any color you want and it's endless.",
            "So this is unique."
        ],
        [
            "With the with the bucking the equal base because of polyolefin nylon, this can go straight back into the process, be melted and turned back into the back in again.",
            "Norlander is if people actually outside Dessel wanted new carpet and decide to put their old carpet into a landfill and let's face it, that's not good.",
            "We will take it back.",
            "And most people pay for the privilege to put into landfills through taxes.",
            "Yeah."
        ],
        [
            "So that's equal this."
        ],
        [
            "Now when we take him back, we talk about equal base and how wonderful it is that it can be recycled endlessly.",
            "Currently we will take carpet back with Benjamin back in the yard.",
            "Still going good.",
            "Still goes to exactly the same process but the young goes through for depolymerization or via extruding.",
            "The Beitchman currently goes into the cement industry for fuel or we now.",
            "Put it as Rd services.",
            "Cortana.",
            "Again, is not the Lord that want to go down.",
            "Eventually all our products will be equal base cradle to cradle 100% recycled."
        ],
        [
            "One thing for us is obviously most of our projects are refurbishment projects.",
            "And.",
            "I guess some of you people in the architects and some of the architects are the projects are coming on.",
            "Recently.",
            "Years are fantastic.",
            "Green buildings are wonderful but it just goes to show that from a site and the structure of somebody building a new building.",
            "You can see.",
            "As the time scale goes on to the right that.",
            "The amount of turnover inside the building that the walls the systems inside get changed three times.",
            "The systems four times, but the stuff.",
            "Like carpets might change over 8 times compared to building 1 building.",
            "So what do you think of the footprint?",
            "You know a building have a massive turnover.",
            "His life of products and carpets inside, so that's why it's important for us to get a grasp of this because our footprint in a building.",
            "Can be detrimental but under credit created.",
            "He's got no footprints.",
            "It's got no issues.",
            "So I just thought that was quite."
        ],
        [
            "Dessel we are committed to credit created and we are committed to helping businesses, especially our suppliers.",
            "It's vital for our suppliers.",
            "To understand, because we don't make the young.",
            "You know, we don't make we have to buy components in so they have to get on board with us and believe in it.",
            "Also.",
            "Waste management companies or material handling companies are now starting to believe it as well, and we've got a great cycle going on so.",
            "This actually funds out for other businesses to get on board with it as well so.",
            "No, we will encourage all stakeholders, suppliers, design, community waste management companies to consider products and seek to see design programs and we have to.",
            "Jointly, you know, get everybody involved."
        ],
        [
            "And that's it all in 20 minutes."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Neither was the jail system era yesterday, so.",
                    "label": 0
                },
                {
                    "sent": "He is a pro, she could make it transparent.",
                    "label": 0
                },
                {
                    "sent": "Being a member.",
                    "label": 0
                },
                {
                    "sent": "Is it standard?",
                    "label": 0
                },
                {
                    "sent": "Julian the breeder in upgrade an AK or team.",
                    "label": 0
                },
                {
                    "sent": "Cool with the kind in the caption, achieved the long perpendicular employer 440.",
                    "label": 0
                },
                {
                    "sent": "I see you didn't.",
                    "label": 0
                },
                {
                    "sent": "Managed to get the earphones so OK, so I just sent a little bit short introduction about what you have done in the company and that you will tell us more about it.",
                    "label": 0
                },
                {
                    "sent": "Is over here.",
                    "label": 0
                },
                {
                    "sent": "My name is Julie images and I'm representing decimal.",
                    "label": 0
                },
                {
                    "sent": "Before we go into the kids will just like to introduce Des or two and what the company is.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "Largest textile manufacturer for carpets.",
                    "label": 0
                },
                {
                    "sent": "We started in the 1930s in Belgium.",
                    "label": 0
                },
                {
                    "sent": "And in 1950, the name Dessel was established into the market.",
                    "label": 0
                },
                {
                    "sent": "In 1988 we also started manufacturing artificial grass.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The artificial grass is for football stadiums and sports arenas and leisure centres.",
                    "label": 0
                },
                {
                    "sent": "But the most important date for us in our history is in 2007 we was bought by NPN.",
                    "label": 0
                },
                {
                    "sent": "It was a Dutch investment bank.",
                    "label": 0
                },
                {
                    "sent": "And this is the date that marks our new beginning and we will see you're currently is with Steven and I settled on this path, infiltrated, and I'm speaking from a business point of view.",
                    "label": 0
                },
                {
                    "sent": "And this has actually made fantastic business opportunities for us.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We are split into different divisions.",
                    "label": 0
                },
                {
                    "sent": "We have the contract division hospitality add or marine form and sport.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To give you a scale of the size of the company we currently employ about 1000 employees and it cannot be.",
                    "label": 0
                },
                {
                    "sent": "Towns alone would produce 7 million square meters per year in broadloom 5,000,000 square meters per year and artificial gas nearly three.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "When you actually look at those white, extremely large figures, we also see that we have an issue with landfill.",
                    "label": 0
                },
                {
                    "sent": "Potentially all that is landfill.",
                    "label": 0
                },
                {
                    "sent": "So you can see that we've got a good challenge ahead of us and with cradle to cradle, we've actually started to make a change to that figure.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As a statement says, we are happy to be apart of cradle cradle.",
                    "label": 0
                },
                {
                    "sent": "We actually promote it first and foremost as a business.",
                    "label": 0
                },
                {
                    "sent": "It is purely one of our core values of Dessel.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "The equal efficiency that we've been going through this last number of years.",
                    "label": 0
                },
                {
                    "sent": "You can see that we've actually reduced our water content consumption 50 by 50% in Belgium.",
                    "label": 1
                },
                {
                    "sent": "Our energy consumption is reduced by 23% over the last 10 years.",
                    "label": 1
                },
                {
                    "sent": "And we have been recycling our material waste in the factory back in again.",
                    "label": 0
                },
                {
                    "sent": "But this is sustainability.",
                    "label": 0
                },
                {
                    "sent": "This is reducing the fact, but it's not doing good.",
                    "label": 0
                },
                {
                    "sent": "You know we're doing less bad.",
                    "label": 0
                },
                {
                    "sent": "So from now on we move forward and we're now cradle to people moving about.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We are now created created.",
                    "label": 0
                },
                {
                    "sent": "One of the things that we will do, people say talk about minimizing their footprint.",
                    "label": 0
                },
                {
                    "sent": "We're not doing that.",
                    "label": 0
                },
                {
                    "sent": "We are going to give the biggest footprint possible, but a very good one.",
                    "label": 0
                },
                {
                    "sent": "We want to improve the quality of life and the environment.",
                    "label": 1
                },
                {
                    "sent": "We utilize all our materials using post proposed consumer raw materials and obviously all our tables are going to our campus.",
                    "label": 1
                },
                {
                    "sent": "Want to be 100% safe for people and the environment and use the neural energies.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Implication decimal to develop new products for indoor air quality.",
                    "label": 1
                },
                {
                    "sent": "Dessel is the first company to produce a child which we now call Airmaster, which is the first time ever to have the gold standard in the GUT for indoor air quality, at literally acts as an air filter and cleans the air 4 times better than a standard carpet and eight times better than a hard floor.",
                    "label": 0
                },
                {
                    "sent": "So again.",
                    "label": 1
                },
                {
                    "sent": "Using the cradle to cradle philosophy and starting with ideas from design, we actually created new products and new business opportunities.",
                    "label": 0
                },
                {
                    "sent": "And we want to promote creativity and invite new designers, young designers, architects to come along today.",
                    "label": 0
                },
                {
                    "sent": "So help is improved and obviously come up with creating new ideas.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Where we going to go from 2010 to 2020?",
                    "label": 0
                },
                {
                    "sent": "50% of all our products will be used from post consumer waste.",
                    "label": 0
                },
                {
                    "sent": "We will be using 100% renewable energy obviously, and going down take back systems is going to be vital which we will go into in a second.",
                    "label": 1
                },
                {
                    "sent": "At the moment we have probably 10 products which are filled, cradle certified and by the end of this year, sorry.",
                    "label": 0
                },
                {
                    "sent": "Next year all now account details or standard ranges will be created to create a basic certification which is a fantastic step for us.",
                    "label": 0
                },
                {
                    "sent": "Safe external materials and we use the side.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The strategic plan Dessel we are investing our we're looking at currently actually building our own biomass energy center.",
                    "label": 0
                },
                {
                    "sent": "This is in the media about 12 million euros that we're looking, and we're currently in partnership at the moment, but we're looking at wind energy and solar energy.",
                    "label": 1
                },
                {
                    "sent": "As well as that, and we've also got the first green roof on the factory, so we are enticing wildlife and specific animals and insects back onto.",
                    "label": 1
                },
                {
                    "sent": "Designs.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Biological circle we do work in both sides.",
                    "label": 0
                },
                {
                    "sent": "The biological circle and the technical technological field.",
                    "label": 0
                },
                {
                    "sent": "As you can see, the product or what you buy your carpet or carpet tiles you can actually use it, but the end of its life to give him.",
                    "label": 0
                },
                {
                    "sent": "You have to decompose and return itself back into raw materials or this road nutrients.",
                    "label": 0
                },
                {
                    "sent": "So then we can grow.",
                    "label": 0
                },
                {
                    "sent": "That's got product again and then go back to the.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Do we have some?",
                    "label": 0
                },
                {
                    "sent": "Prototypes, but we are working.",
                    "label": 0
                },
                {
                    "sent": "We are actually trying to develop floorcoverings made from paper and jute.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here is 1 made of bamboo, so we're trying different natural fibers, which again can be totally easily decomposed back into the soil to be a nutrient again to grow that.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "He is 1 just from jute.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But most of these hotels in which is not a bad thing to say.",
                    "label": 0
                },
                {
                    "sent": "Most of our sales, about 99% of the wheels are made from plastic nylon.",
                    "label": 0
                },
                {
                    "sent": "Which is not a bad thing for so long as that material comes back into the cycle and be reused.",
                    "label": 0
                },
                {
                    "sent": "There's nothing wrong with it.",
                    "label": 0
                },
                {
                    "sent": "Waste and it's not going back into the environment is not hurting anything and nothing else is coming from the environment to go into it.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So when you look at accounts how people think or counting cars just made of nylon top and a bit you mean back or in some cases you know nasty PVCS.",
                    "label": 0
                },
                {
                    "sent": "We do not use PVC for obvious reasons.",
                    "label": 0
                },
                {
                    "sent": "You know due to poisonous issues that we don't touch them.",
                    "label": 0
                },
                {
                    "sent": "Is more than that.",
                    "label": 0
                },
                {
                    "sent": "When we actually analyze with partnership with EPA is probably about 800 chemicals in a carpet tile.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We saw the graph previously.",
                    "label": 0
                },
                {
                    "sent": "We find we're identifying all the nasty unwanted chemical elements in there and replacing them with good ones.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here we are.",
                    "label": 0
                },
                {
                    "sent": "The basic test vessel.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now we do use Beitchman as a carpet back.",
                    "label": 0
                },
                {
                    "sent": "We've been in natural product.",
                    "label": 0
                },
                {
                    "sent": "You know it's quite safe, but under critical we cannot guarantee.",
                    "label": 0
                },
                {
                    "sent": "The contents 100% all of the time.",
                    "label": 0
                },
                {
                    "sent": "It can very convenient.",
                    "label": 0
                },
                {
                    "sent": "So when you put your hand on your heart and if you're going to do the right thing, which decimal is wanting to do?",
                    "label": 0
                },
                {
                    "sent": "We have to move away from Richmond.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Again, join.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We are coming.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you bucking made from.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nylon it's totally 100% safe for humans and the environment.",
                    "label": 0
                },
                {
                    "sent": "And more importantly, is 100% recycled back into its original form, so we do not need to take anymore funding from the environment, and we do not need to put anything into landfill or to be bird.",
                    "label": 0
                },
                {
                    "sent": "So is a fantastic step.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Recently installed.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But when you're looking at account big title, you know you might want to choose a red one or a blue one.",
                    "label": 0
                },
                {
                    "sent": "We've got some wonderful designs in there, but on the credit card we have to actually analyze every single tile.",
                    "label": 0
                },
                {
                    "sent": "Because there's gonna be different chemical elements in a blue one than this 2 available.",
                    "label": 0
                },
                {
                    "sent": "And we all know that the dying industry in various parts of the world is not very nice.",
                    "label": 0
                },
                {
                    "sent": "Is is dependent on heavy metals and lots of nasty elements.",
                    "label": 0
                },
                {
                    "sent": "So it takes a long time and a lot of investment to come this far.",
                    "label": 0
                },
                {
                    "sent": "But it's important that we do it.",
                    "label": 0
                },
                {
                    "sent": "Do it for you that may do for the environment.",
                    "label": 0
                },
                {
                    "sent": "So when we look at a one of our titles now is positively defined dyestuffs.",
                    "label": 0
                },
                {
                    "sent": "PS6 young reason that we're moving more towards that are not not nylon.",
                    "label": 0
                },
                {
                    "sent": "66 is purely we can actually depolymerize nylon 6 back into white Virgin yarn again again, the cradle to cradle closing that loop not being take anything else from the environment.",
                    "label": 0
                },
                {
                    "sent": "Hotmail stabilizer on the polyolefin.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, one thing about cradle to cradle with an existing product.",
                    "label": 0
                },
                {
                    "sent": "It takes a lot of time, a lot of investment to get to this stage.",
                    "label": 0
                },
                {
                    "sent": "But critics feelings about design.",
                    "label": 0
                },
                {
                    "sent": "If you design a tile from the beginning to actually be able to take it apart and recycle it with no other resources under percent energy, you can forget master sustainability because you can do it all the time.",
                    "label": 0
                },
                {
                    "sent": "Then you can have a defined lifespan.",
                    "label": 0
                },
                {
                    "sent": "Economies can keep going, can still keep on selling copies.",
                    "label": 0
                },
                {
                    "sent": "You know, if we sell copies that last 45 years, people don't want it because I want to change the color.",
                    "label": 0
                },
                {
                    "sent": "It keeps the economy going.",
                    "label": 0
                },
                {
                    "sent": "You know nobody's probably got a laptop that's over 25 years old, or the phone over 15 years old.",
                    "label": 0
                },
                {
                    "sent": "People want to new things and keep on moving forward.",
                    "label": 0
                },
                {
                    "sent": "Cradle to cradle allows you to do that.",
                    "label": 0
                },
                {
                    "sent": "Without harming the environment without harming people?",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is just showing we did a recent exhibition in Holland trying to get the cradle to cradle message over to people about waste makes you know your raw materials.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So people came along, so the bins and actually put all the papers, all the waste food in there.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But here we go, we are investing heavily in new technology.",
                    "label": 0
                },
                {
                    "sent": "This is a new plant for the new back in the new EcoBoost.",
                    "label": 0
                },
                {
                    "sent": "Back in total cradle to create.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You know we.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With this, or we do actually want to be totally see to see with investing heavily in money, it makes business sense and it creates business opportunities.",
                    "label": 0
                },
                {
                    "sent": "Some of the ideas that we've come out with, like the airmaster, the equal base.",
                    "label": 0
                },
                {
                    "sent": "It is successful.",
                    "label": 0
                },
                {
                    "sent": "It makes people buy the product they want to believe in it.",
                    "label": 0
                },
                {
                    "sent": "It's not just a story.",
                    "label": 0
                },
                {
                    "sent": "But with everything else, we still have to go through rigorous testing for all outfit available products.",
                    "label": 0
                },
                {
                    "sent": "You know, we want people to buy out the trust in Dessel.",
                    "label": 0
                },
                {
                    "sent": "The dimensional stability of the products you know light less light on the floor.",
                    "label": 0
                },
                {
                    "sent": "It lasts a lifetime that the client wants it.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But then the day we have to.",
                    "label": 0
                },
                {
                    "sent": "Get the carpet back.",
                    "label": 0
                },
                {
                    "sent": "This is logistically this is quite difficult.",
                    "label": 0
                },
                {
                    "sent": "We do not want anybody to put carpet tiles into a landfill site.",
                    "label": 0
                },
                {
                    "sent": "And Dessel will take back carpet tiles from anybody.",
                    "label": 1
                },
                {
                    "sent": "Except for PVC back County towns, because we don't want to handle poisonous goods.",
                    "label": 0
                },
                {
                    "sent": "So if you've got carpet tiles and you're going to do a building or you want to do a building, send them back today so I'm not bothered if they're not vessels.",
                    "label": 0
                },
                {
                    "sent": "We will recycle them, yeah?",
                    "label": 0
                },
                {
                    "sent": "Because we can, or we are one of the only ones who can actually dismantle these carpets and get the goodness out of them and use them.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What we currently do.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As we go.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we shred it.",
                    "label": 0
                },
                {
                    "sent": "We got paid in reading about half a million euros for the machine to do.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we slowly start separating into a special process what's ours.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we become reusable young again.",
                    "label": 0
                },
                {
                    "sent": "This goes back to our suppliers, who then can depolarize it and turn it back into Virgin white material.",
                    "label": 0
                },
                {
                    "sent": "So yes, we recycle.",
                    "label": 0
                },
                {
                    "sent": "Copies we recycled carbon fiber book.",
                    "label": 0
                },
                {
                    "sent": "When you think about it.",
                    "label": 0
                },
                {
                    "sent": "We actually make copies of Virgin material.",
                    "label": 0
                },
                {
                    "sent": "Because we turn it back into white yarn again so it can be colored toward any color you want and it's endless.",
                    "label": 0
                },
                {
                    "sent": "So this is unique.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With the with the bucking the equal base because of polyolefin nylon, this can go straight back into the process, be melted and turned back into the back in again.",
                    "label": 0
                },
                {
                    "sent": "Norlander is if people actually outside Dessel wanted new carpet and decide to put their old carpet into a landfill and let's face it, that's not good.",
                    "label": 0
                },
                {
                    "sent": "We will take it back.",
                    "label": 0
                },
                {
                    "sent": "And most people pay for the privilege to put into landfills through taxes.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's equal this.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now when we take him back, we talk about equal base and how wonderful it is that it can be recycled endlessly.",
                    "label": 0
                },
                {
                    "sent": "Currently we will take carpet back with Benjamin back in the yard.",
                    "label": 0
                },
                {
                    "sent": "Still going good.",
                    "label": 0
                },
                {
                    "sent": "Still goes to exactly the same process but the young goes through for depolymerization or via extruding.",
                    "label": 0
                },
                {
                    "sent": "The Beitchman currently goes into the cement industry for fuel or we now.",
                    "label": 0
                },
                {
                    "sent": "Put it as Rd services.",
                    "label": 0
                },
                {
                    "sent": "Cortana.",
                    "label": 0
                },
                {
                    "sent": "Again, is not the Lord that want to go down.",
                    "label": 0
                },
                {
                    "sent": "Eventually all our products will be equal base cradle to cradle 100% recycled.",
                    "label": 1
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One thing for us is obviously most of our projects are refurbishment projects.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "I guess some of you people in the architects and some of the architects are the projects are coming on.",
                    "label": 0
                },
                {
                    "sent": "Recently.",
                    "label": 0
                },
                {
                    "sent": "Years are fantastic.",
                    "label": 0
                },
                {
                    "sent": "Green buildings are wonderful but it just goes to show that from a site and the structure of somebody building a new building.",
                    "label": 0
                },
                {
                    "sent": "You can see.",
                    "label": 0
                },
                {
                    "sent": "As the time scale goes on to the right that.",
                    "label": 0
                },
                {
                    "sent": "The amount of turnover inside the building that the walls the systems inside get changed three times.",
                    "label": 0
                },
                {
                    "sent": "The systems four times, but the stuff.",
                    "label": 0
                },
                {
                    "sent": "Like carpets might change over 8 times compared to building 1 building.",
                    "label": 0
                },
                {
                    "sent": "So what do you think of the footprint?",
                    "label": 0
                },
                {
                    "sent": "You know a building have a massive turnover.",
                    "label": 0
                },
                {
                    "sent": "His life of products and carpets inside, so that's why it's important for us to get a grasp of this because our footprint in a building.",
                    "label": 0
                },
                {
                    "sent": "Can be detrimental but under credit created.",
                    "label": 0
                },
                {
                    "sent": "He's got no footprints.",
                    "label": 0
                },
                {
                    "sent": "It's got no issues.",
                    "label": 0
                },
                {
                    "sent": "So I just thought that was quite.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Dessel we are committed to credit created and we are committed to helping businesses, especially our suppliers.",
                    "label": 0
                },
                {
                    "sent": "It's vital for our suppliers.",
                    "label": 0
                },
                {
                    "sent": "To understand, because we don't make the young.",
                    "label": 0
                },
                {
                    "sent": "You know, we don't make we have to buy components in so they have to get on board with us and believe in it.",
                    "label": 0
                },
                {
                    "sent": "Also.",
                    "label": 0
                },
                {
                    "sent": "Waste management companies or material handling companies are now starting to believe it as well, and we've got a great cycle going on so.",
                    "label": 0
                },
                {
                    "sent": "This actually funds out for other businesses to get on board with it as well so.",
                    "label": 0
                },
                {
                    "sent": "No, we will encourage all stakeholders, suppliers, design, community waste management companies to consider products and seek to see design programs and we have to.",
                    "label": 1
                },
                {
                    "sent": "Jointly, you know, get everybody involved.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that's it all in 20 minutes.",
                    "label": 0
                }
            ]
        }
    }
}