{
    "id": "2zekfyn6nrmqr5nyh6atw5gk7w6y54tr",
    "title": "Internationalized Domain Names: Challenges and Opportunities",
    "info": {
        "author": [
            "Pat Kane, VeriSign, Inc."
        ],
        "published": "June 19, 2013",
        "recorded": "March 2013",
        "category": [
            "Top->Computer Science->Multilingual Information Access"
        ]
    },
    "url": "http://videolectures.net/w3cworkshop2013_kane_names/",
    "segmentation": [
        [
            "So good morning, my name is Pat Kane.",
            "I've been with Verisign for about 13 years and one of the things I want to talk to you today about some of the growth in operations that we see from an internationalized domain standpoint, but also covers some of the information that we've collected overtime doing user research and consumer and Business Research about their feelings about internationalized domain names."
        ],
        [
            "So when we think about domain names, think about interfacing with the Internet end users, whether it be a consumer and image consumer small medium business.",
            "We want to focus on everything about about the end user, and I guess the word user dropped off their butt."
        ],
        [
            "You think about Denk Foo.",
            "Foo is a 35 year old Chinese national who is a freelance photographer.",
            "Manage his own life on the Internet all over the place, writes blogs, post pictures, does email, and when he interacts with the Internet."
        ],
        [
            "It's completely in his own script.",
            "It's completely in his own language, representing himself to his family, to his friends, to his customers in a script that they are familiar with.",
            "Well, not really."
        ],
        [
            "I mean reality little different today we don't have all of that today available.",
            "It's not adopted well, it's not trusted well within the community.",
            "And we still have a long way to go.",
            "So we think about."
        ],
        [
            "The Internet and the population that was on the Internet would go back to 1996.",
            "Largely English driven was largely English language, Latin based languages on the Internet.",
            "Even some of the Latin characters weren't available.",
            "Still not available.",
            "As that is progressed overtime, we've had growth in Asia Pacific where 41% of the end users today come from Asia Pacific.",
            "China today is the largest online population.",
            "I think everybody is very aware of that.",
            "So when we think about the growth going from an English based environment, Latin based environment and now we have people who are underserved by the Latin based environment who are now the largest populations on the Internet today.",
            "Why is it that we have an American who some people say barely speaks English?",
            "Talking about internationalization of the Internet?",
            "Well, 13 years ago when I joined their assigned as a as an engineering program manager, we talked about internationalized domain names and someone asked if I could speak baci.",
            "And basically I said yes I could.",
            "And so Uncle Owen gave me the program management position around Idens.",
            "So in the first six months of the IDN program, at various time we had common org, and on November 9th of 2000 we launched an we registered about a million domain names within about six months, and that largely came from the Hongell script from the CJK idea graphs Unicode pages is where most of it came from, so aft."
        ],
        [
            "13 years of pushing internationalized domain names.",
            "We have about 1.3 million.",
            "Registrations in just common net, so they've been adopted very well.",
            "We've seen a lot of really positive growth in 13 years when it comes to the actual registration base.",
            "I thought that might elicit some humor, however, but if you see what the scripts are, there still largely mostly CJK idea graphs about about half of those registrations, 662 thousand of them have contains at least one character from the CJK unified ID graph web pages, the second largest being Latin one which is extended Latin, and the third one being the Hungol script.",
            "And for the Korean population, so.",
            "That's where that's where the large populations have been.",
            "There's been a lot of.",
            "There's been more awareness in those communities because we have some scripts that are completely underserved like the Armenian script that Jose talked about earlier today, where we have 121 Armenian registrations in common.net today.",
            "So there's still some awareness that needs to take place, and there's still some growth opportunities moving forward in terms of helping people to understand what is there and what's available to them.",
            "When we think about ideas where they are today, you know as far."
        ],
        [
            "Has availability, the web browsers major browsers handle ideas today very well we we see some email applications still have some ways to go.",
            "I saw yesterday that Thunderbird now supports supports IDN's, so this is wrong in terms of saying it doesn't.",
            "I saw yesterday that it does now, which is fantastic, but we still have a lot of growth to do an email and one of the things when I think about email and email applications not being able to handle ID NS.",
            "I think about all of the applications that I go to where I use my.",
            "Email address as an identifier so when I sit down, I log into my social application and I want to retrieve my password.",
            "I can't use my ID and email address because it doesn't.",
            "It doesn't respond, it doesn't recognize it, so it's not just email applications, it's applications across in today that don't have the ability to use IDs."
        ],
        [
            "So UNESCO in Europe put out a published report in December of last year to talk about what, from a registry perspective, what's lacking, what's?",
            "Hindering adoption of registration of domains and largely this has been a supplier driven discussion.",
            "It's the registries is the people that are offering ideas that have been driving this discussion for some period of time.",
            "And so these are the kinds of things that, when they ask their respondents to the survey, that they did what would make ideas more attractive from small businesses and from consumers an from registrars trying to distribute ideas to their customers as well.",
            "Email of course, talked about that a little bit greater user awareness, wider supported a registrar level.",
            "We certainly have a lot of registrars who don't use who don't offer ideas today, so out of the top 10 registrars that we sell domain names within common Net.",
            "Eight of them come from Korea, Japan, China, and the other two are two large American registrars as well.",
            "Better support in browsers.",
            "I think we thought that's probably mobile mobile browsers and then the greater adoption but easy management tools.",
            "One of the things that my sysadmins at Verisign talking about when we try to do the bear sign versions that we've done.",
            "Transliterations of registrations.",
            "We done for sorry.com verisign.com is they have a tough time keying in the XN dash Dash BR549Q7 MN dot COM.",
            "It's clunky, it's it's open for errors.",
            "It's got great opportunity for, for Mistyping and those kinds of things."
        ],
        [
            "So issues with the DNN.",
            "There's no ubiquity.",
            "There's no consistent user experience across locales, regions, browsers themselves.",
            "We have a lack of awareness which all drives to a lack of trust.",
            "Now when we think about trust within Bear sign, we define trust by what is it, what is the intent for an individual to register a domain?",
            "So we did a study two years ago and this is a little data we're updating it this year to take a look at what Korean, Korean and Chinese businesses would look at.",
            "An consumers would look at when they were, when they were offered the opportunity to register and all ASCII string and.",
            "IDN dot ASCII string or an ID and.",
            "IDN string.",
            "An across the board.",
            "They were interested in the idea and IDN strings because it fully represented who they were, their country, their locale, their culture.",
            "One of the things in doing and managing ideas for 13 years at their assigned I've understood is that people are passionate about their language.",
            "People are passionate about the script that represents their language.",
            "It's not like being an American where English English alphabet where you can go all across the globe.",
            "And see English and see the Latin based script everywhere.",
            "I didn't have any appreciation for that, and so I started to do my DNN and so just how passionate people were.",
            "So they want ID and ID NS, but they're not going to buy them because they're not ubiquitous and there's not.",
            "There's not trust, and I'll put some more detail behind that.",
            "The one thing that they they are comfortable with asking an ASCII they're used to it.",
            "It works well.",
            "One of the presenters morning talked about, it talked about a first class citizen and clearly ASCII domains.",
            "Our first class domains I DNN really are second class domains.",
            "They get treated differently.",
            "They look different people, people don't.",
            "People won't go there to the websites because they don't know what to expect and when you get reflected back in the browser or another application, the underlying punycode people have their concerned about where they're going to go certificates today they don't handle ideas very well either, so if I get a SSL certificate.",
            "I end up getting my business accredited, but yet when I go, there's a mismatch between what I'm seeing and what's on the certificate sometimes, so there's still issues with that.",
            "So as we take a look at the the one thing that they don't want overtime as they don't want the ID and ASCII.",
            "Now we have 1.3 million registrations were the second largest is the Latin one.",
            "They're going to be fine with ID and ASCII because they see the COM or the net or the UK and they're comfortable with that because it's part of it's part of their part of the script.",
            "Part of the language.",
            "What they're not comfortable with is the Chinese dot English, but they registered it because it's something that they could register something that represented at least partially what they were doing, and it works in the browser's today.",
            "So there's still intent to buy or intend to register those domains from several end users from several small medium businesses from several Internet end users.",
            "But it's not exactly what they want.",
            "Well, we did find is that small medium businesses in China were more open to the IDN dot DNZ as a primary as a primary registration and in Korea that consumers are more interested in identified ideas.",
            "Excuse me, small medium businesses were not as interested in ID and ID NS as the Chinese were."
        ],
        [
            "So some of the qualitative things we learn from our research by key Insights, ID and utility is not currently perceived as well appreciated.",
            "I think that's I think everybody understands that that people want more utility in their ideas, and it's not there today.",
            "There's initial resistance to adopting ID and ideas.",
            "Again, it comes back to what is, what is the user experience, how it is the end user looking at the registration.",
            "What comes back to him was reflected back to them.",
            "Preferences do emerge for translation or translation, transliteration dependent upon the country.",
            "This is interesting when you take a look at some of the new G TLD applications that have been that have been applied for in the ICANN process.",
            "China today runs a regionally resolving domain name called Gangsu which is Chinese for company, whereas Verisign is applied for a transliteration in chinaof.com and what we find is that there's some there's equal attraction.",
            "For Chinese population, for both of those strings in terms of the market studies that we've done so in a marketplace like China, the transliteration of calm, while not preserved, preserved with the language, 'cause 'cause they actually translate transliterations, commas, we've we've applied for.",
            "But there's there's appreciation for that.",
            "In places like Korea, there's also transliteration is appreciated when it comes to a stringlike.com.",
            "It's not.",
            "It's not the same when we go to other to other locales.",
            "In arabicthe.com translation we applied for is actually a brand new word in the Arabic language, and that's an that's that's not something that is as interesting in other in other scripts as it is in Arabic.",
            "Interesting ideas at this point appears moderate and their reservations.",
            "And overall, the registrar channel expectations and this is the ICANN accredited registrars.",
            "About 1000 of them.",
            "They actually mirror the same things about the countries that they serve.",
            "So registrars are saying the tools aren't available for me to manage.",
            "My customer set today.",
            "So how do I?",
            "How do I manage a customer experience in a customer relationship in Chinese if I don't have Chinese tools and I don't have system administration capabilities for hosting in those kinds of things without without those kinds of tools?"
        ],
        [
            "So these are some details I know that the presentation will be available later, so I'm not going to try to read through every single everything here, but when we go to China and we take a look at the ID and status in China, the Chinese population is fine with.",
            "Ask you not asking the rope, they're OK with that.",
            "They're not OK with IDN dot ASCII and they really do want ID and IDN in the long run, but the small medium businesses we found that they are they are more interested in the Latin base.",
            "We see a lot of number registrations for domain names inside of China as well, but the Chinese population themselves are going to gravitate towards more of an idea and idea overtime and skip the idea and I ask but right now they ask you that ASCII seems to be working fine inside of China."
        ],
        [
            "In India, China, China is the prevalent.",
            "We actually applied for a devnagari string for translation.com, but we find that since the population in India is largely using English for business, that the 15 to 20% of the population that is online today is perfectly fine within within, within, within ASCII based and English domain name.",
            "Today we see less transliteration done in India.",
            "ID and ASCII is not is not as popular and ID and IDN still faces some challenges against the all English strings."
        ],
        [
            "In Japan, we found a similar.",
            "We found we found a similar.",
            "Result from the population, not so much.",
            "For the same reasons as in India towards words.",
            "The language of it's the language of business, but they're comfortable with English with all English today and the Japanese.",
            "Japanese ideas themselves saw some prevalence early on, but they've retracted from that overtime."
        ],
        [
            "Korea, however, happens to be the most passionate country that we didn't.",
            "We did study it up the studies on on moving and migrating towards IBM dot ideas and getting away from all English capabilities.",
            "So we think that this is 1 marketplace where you've got a really captive audience around internationalization.",
            "Captive audience, about Hongell, and the focus on their own, their own language identifiers, and actually last time I was in Seoul we started to see a lot of IDN dot cars and a lot of IDN comms being used in businesses, so I expect that we'll start to see in advertising in Korea to see a lot more ID.",
            "And that idea is used."
        ],
        [
            "So when we think about the future usage, you're likely to visit the website, so this is not.",
            "Registering them but likely to visit a website and so we still see that the numbers are low when people are saying would I go visit a website that's all localized characters?",
            "If I saw it in an email advertisement I saw it on a website as a string, so there's still some reluctance to even go to those sites because there's a lack of trust."
        ],
        [
            "So moving forward, we have to have groups getting together from different disciplines to make certain that we are able to adopt ideas and be able to push ideas.",
            "So of course the registries were the ones that have been have been provisioning domain names.",
            "I know that that aren't that DOT RF.",
            "the Russian Cyrillic TLD is about 800,000 registrations, and that's really that's really a good litmus in terms of what the demand is in that particular area.",
            "We know that in China, CN Nick has put out the Gangsu company and hunger low, which is their version of Network, which again originally resolving domain names that they're actually getting quite some adoption as well.",
            "As there is there dot China, their CC TLD in Chinese script is getting some great adoption as well.",
            "We have to continue to work with the registrars.",
            "I look at that as the responsibility of registries to make certain that we have tools capable that allow the registrars to help to register domain names for their customers content creators.",
            "There's lots of content being created.",
            "We know that the content is moving away from English.",
            "Overtime you guys see that as much as anybody.",
            "Application developers this is really where we have to have have to have some push and getting application developers to create tools to create social applications that actually do adopt ID NS as identifiers.",
            "Whether it be for Mail or for websites.",
            "This is this is really where the heavy lifting has to take place in the next couple of years.",
            "And then governments and businesses.",
            "An different organ standards.",
            "Organizations helping to get this on the forefront of agendas such as W3C.",
            "One of the one of the nice government actions that's taken place in the last couple of years is Turkey has made has made some some legislation to wear all small medium businesses need to be on line so that is actually driven a lot of small medium businesses to go online for the first time so that they can be reached in be identified.",
            "So if we had that kind of government assistance in terms of adoption, I think that would help grow this particular aspect of the multilingual web."
        ],
        [
            "So really, if we want adoption, we need ubiquity.",
            "And if we if we have Ubiquiti, we get adoption.",
            "So it's really the chicken and egg which came first.",
            "We're going to drive first.",
            "We don't have either.",
            "Right now I was talking with the gentleman from Microsoft and Microsoft was determining whether or not they wanted to.",
            "Internationalize all of their other software products for them.",
            "It's a huge investment, so without some adoption we're not going to see internationalized domain names roll off the table at Microsoft because it's really it's really huge financial investment for them to undertake and modify their software so."
        ],
        [
            "Against chicken egg with."
        ],
        [
            "Wow, the ecosystem that we have to have to move forward to get everyone involved and engaged to improve the user experience.",
            "We want to make certain that the end user is comfortable with domains that internationalized domain names become first class citizens.",
            "They become equivalent to an ASCII domain name today."
        ],
        [
            "Because once we have that ubiquity equals trust, an just.",
            "'cause I like to market trust really, really important.",
            "We see that being the key factor in registration, the key factor in adoption and until a domain name is a domain name, regardless of what the characters were in that domain name, it's going to be.",
            "It's going to be trust.",
            "It's interesting that I think back 15 years ago, 13 years ago when I started to work on ID NS, one of the big questions was what will we do for encoding on the DNS DNS?",
            "It's we have this ASCII compatible encoding and I don't know if it translates around the globe, but we have a product of the states called.",
            "A switch is an ace bandage, and so I think about a some being kind of a band aid for the DNS and with little progress we've made today.",
            "I kind of wonder if we've gone back 15 years ago and said, let's make let's fundamentally change the underlying fabric to accept UTF 8 or UTF 16.",
            "Would that have been a better decision when it comes to internationalization today?",
            "Now we can't go back and fix that, but it's just something that I have a question about.",
            "Quite a bit."
        ],
        [
            "So ubiquity doesn't mean just the desktop.",
            "The desktop software.",
            "I think that browsers are certainly working well."
        ],
        [
            "But ubiquity also means mobile, and especially in the marketplaces we're talking about when we talk about China, we talk about India when we talk about the large populations that are going to rely upon an international eyes or a multilingual web.",
            "From a script standpoint.",
            "These are these are populations that are going to be largely mobile, so we have to make sure that we move into the mobile space as well."
        ],
        [
            "It'll print, it'll overtake desktop usage by 2015."
        ],
        [
            "Mobile applications from a penetration standpoint are far less capable of handling ideas today."
        ],
        [
            "And so we think about the world in terms of where where this use is going to place again 37%.",
            "Internet users speak start off with non English not English is they don't speak English as a primary language.",
            "China as I said as I said earlier, is the largest Internet population today and that's going to be our growth market so that Dang Phu."
        ],
        [
            "Can utilize the Internet in the way that he wants to."
        ],
        [
            "And just know that I like to finish with is that this is something that I would like to be able to get done and there's a manifesto have done out there and the point of getting things done is to go get something else done so."
        ],
        [
            "Thank you very much for your time today.",
            "I wanted to open up any questions that you may have or want to the end.",
            "Take question that?",
            "OK, well thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So good morning, my name is Pat Kane.",
                    "label": 0
                },
                {
                    "sent": "I've been with Verisign for about 13 years and one of the things I want to talk to you today about some of the growth in operations that we see from an internationalized domain standpoint, but also covers some of the information that we've collected overtime doing user research and consumer and Business Research about their feelings about internationalized domain names.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So when we think about domain names, think about interfacing with the Internet end users, whether it be a consumer and image consumer small medium business.",
                    "label": 0
                },
                {
                    "sent": "We want to focus on everything about about the end user, and I guess the word user dropped off their butt.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You think about Denk Foo.",
                    "label": 0
                },
                {
                    "sent": "Foo is a 35 year old Chinese national who is a freelance photographer.",
                    "label": 0
                },
                {
                    "sent": "Manage his own life on the Internet all over the place, writes blogs, post pictures, does email, and when he interacts with the Internet.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's completely in his own script.",
                    "label": 0
                },
                {
                    "sent": "It's completely in his own language, representing himself to his family, to his friends, to his customers in a script that they are familiar with.",
                    "label": 0
                },
                {
                    "sent": "Well, not really.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I mean reality little different today we don't have all of that today available.",
                    "label": 0
                },
                {
                    "sent": "It's not adopted well, it's not trusted well within the community.",
                    "label": 0
                },
                {
                    "sent": "And we still have a long way to go.",
                    "label": 1
                },
                {
                    "sent": "So we think about.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The Internet and the population that was on the Internet would go back to 1996.",
                    "label": 0
                },
                {
                    "sent": "Largely English driven was largely English language, Latin based languages on the Internet.",
                    "label": 0
                },
                {
                    "sent": "Even some of the Latin characters weren't available.",
                    "label": 0
                },
                {
                    "sent": "Still not available.",
                    "label": 0
                },
                {
                    "sent": "As that is progressed overtime, we've had growth in Asia Pacific where 41% of the end users today come from Asia Pacific.",
                    "label": 1
                },
                {
                    "sent": "China today is the largest online population.",
                    "label": 1
                },
                {
                    "sent": "I think everybody is very aware of that.",
                    "label": 0
                },
                {
                    "sent": "So when we think about the growth going from an English based environment, Latin based environment and now we have people who are underserved by the Latin based environment who are now the largest populations on the Internet today.",
                    "label": 0
                },
                {
                    "sent": "Why is it that we have an American who some people say barely speaks English?",
                    "label": 0
                },
                {
                    "sent": "Talking about internationalization of the Internet?",
                    "label": 0
                },
                {
                    "sent": "Well, 13 years ago when I joined their assigned as a as an engineering program manager, we talked about internationalized domain names and someone asked if I could speak baci.",
                    "label": 0
                },
                {
                    "sent": "And basically I said yes I could.",
                    "label": 0
                },
                {
                    "sent": "And so Uncle Owen gave me the program management position around Idens.",
                    "label": 0
                },
                {
                    "sent": "So in the first six months of the IDN program, at various time we had common org, and on November 9th of 2000 we launched an we registered about a million domain names within about six months, and that largely came from the Hongell script from the CJK idea graphs Unicode pages is where most of it came from, so aft.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "13 years of pushing internationalized domain names.",
                    "label": 0
                },
                {
                    "sent": "We have about 1.3 million.",
                    "label": 0
                },
                {
                    "sent": "Registrations in just common net, so they've been adopted very well.",
                    "label": 0
                },
                {
                    "sent": "We've seen a lot of really positive growth in 13 years when it comes to the actual registration base.",
                    "label": 0
                },
                {
                    "sent": "I thought that might elicit some humor, however, but if you see what the scripts are, there still largely mostly CJK idea graphs about about half of those registrations, 662 thousand of them have contains at least one character from the CJK unified ID graph web pages, the second largest being Latin one which is extended Latin, and the third one being the Hungol script.",
                    "label": 0
                },
                {
                    "sent": "And for the Korean population, so.",
                    "label": 0
                },
                {
                    "sent": "That's where that's where the large populations have been.",
                    "label": 0
                },
                {
                    "sent": "There's been a lot of.",
                    "label": 0
                },
                {
                    "sent": "There's been more awareness in those communities because we have some scripts that are completely underserved like the Armenian script that Jose talked about earlier today, where we have 121 Armenian registrations in common.net today.",
                    "label": 0
                },
                {
                    "sent": "So there's still some awareness that needs to take place, and there's still some growth opportunities moving forward in terms of helping people to understand what is there and what's available to them.",
                    "label": 0
                },
                {
                    "sent": "When we think about ideas where they are today, you know as far.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Has availability, the web browsers major browsers handle ideas today very well we we see some email applications still have some ways to go.",
                    "label": 0
                },
                {
                    "sent": "I saw yesterday that Thunderbird now supports supports IDN's, so this is wrong in terms of saying it doesn't.",
                    "label": 0
                },
                {
                    "sent": "I saw yesterday that it does now, which is fantastic, but we still have a lot of growth to do an email and one of the things when I think about email and email applications not being able to handle ID NS.",
                    "label": 0
                },
                {
                    "sent": "I think about all of the applications that I go to where I use my.",
                    "label": 0
                },
                {
                    "sent": "Email address as an identifier so when I sit down, I log into my social application and I want to retrieve my password.",
                    "label": 0
                },
                {
                    "sent": "I can't use my ID and email address because it doesn't.",
                    "label": 0
                },
                {
                    "sent": "It doesn't respond, it doesn't recognize it, so it's not just email applications, it's applications across in today that don't have the ability to use IDs.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So UNESCO in Europe put out a published report in December of last year to talk about what, from a registry perspective, what's lacking, what's?",
                    "label": 0
                },
                {
                    "sent": "Hindering adoption of registration of domains and largely this has been a supplier driven discussion.",
                    "label": 0
                },
                {
                    "sent": "It's the registries is the people that are offering ideas that have been driving this discussion for some period of time.",
                    "label": 0
                },
                {
                    "sent": "And so these are the kinds of things that, when they ask their respondents to the survey, that they did what would make ideas more attractive from small businesses and from consumers an from registrars trying to distribute ideas to their customers as well.",
                    "label": 0
                },
                {
                    "sent": "Email of course, talked about that a little bit greater user awareness, wider supported a registrar level.",
                    "label": 1
                },
                {
                    "sent": "We certainly have a lot of registrars who don't use who don't offer ideas today, so out of the top 10 registrars that we sell domain names within common Net.",
                    "label": 0
                },
                {
                    "sent": "Eight of them come from Korea, Japan, China, and the other two are two large American registrars as well.",
                    "label": 0
                },
                {
                    "sent": "Better support in browsers.",
                    "label": 1
                },
                {
                    "sent": "I think we thought that's probably mobile mobile browsers and then the greater adoption but easy management tools.",
                    "label": 0
                },
                {
                    "sent": "One of the things that my sysadmins at Verisign talking about when we try to do the bear sign versions that we've done.",
                    "label": 0
                },
                {
                    "sent": "Transliterations of registrations.",
                    "label": 0
                },
                {
                    "sent": "We done for sorry.com verisign.com is they have a tough time keying in the XN dash Dash BR549Q7 MN dot COM.",
                    "label": 0
                },
                {
                    "sent": "It's clunky, it's it's open for errors.",
                    "label": 0
                },
                {
                    "sent": "It's got great opportunity for, for Mistyping and those kinds of things.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So issues with the DNN.",
                    "label": 1
                },
                {
                    "sent": "There's no ubiquity.",
                    "label": 0
                },
                {
                    "sent": "There's no consistent user experience across locales, regions, browsers themselves.",
                    "label": 1
                },
                {
                    "sent": "We have a lack of awareness which all drives to a lack of trust.",
                    "label": 1
                },
                {
                    "sent": "Now when we think about trust within Bear sign, we define trust by what is it, what is the intent for an individual to register a domain?",
                    "label": 0
                },
                {
                    "sent": "So we did a study two years ago and this is a little data we're updating it this year to take a look at what Korean, Korean and Chinese businesses would look at.",
                    "label": 0
                },
                {
                    "sent": "An consumers would look at when they were, when they were offered the opportunity to register and all ASCII string and.",
                    "label": 0
                },
                {
                    "sent": "IDN dot ASCII string or an ID and.",
                    "label": 0
                },
                {
                    "sent": "IDN string.",
                    "label": 0
                },
                {
                    "sent": "An across the board.",
                    "label": 0
                },
                {
                    "sent": "They were interested in the idea and IDN strings because it fully represented who they were, their country, their locale, their culture.",
                    "label": 0
                },
                {
                    "sent": "One of the things in doing and managing ideas for 13 years at their assigned I've understood is that people are passionate about their language.",
                    "label": 0
                },
                {
                    "sent": "People are passionate about the script that represents their language.",
                    "label": 0
                },
                {
                    "sent": "It's not like being an American where English English alphabet where you can go all across the globe.",
                    "label": 0
                },
                {
                    "sent": "And see English and see the Latin based script everywhere.",
                    "label": 0
                },
                {
                    "sent": "I didn't have any appreciation for that, and so I started to do my DNN and so just how passionate people were.",
                    "label": 0
                },
                {
                    "sent": "So they want ID and ID NS, but they're not going to buy them because they're not ubiquitous and there's not.",
                    "label": 0
                },
                {
                    "sent": "There's not trust, and I'll put some more detail behind that.",
                    "label": 0
                },
                {
                    "sent": "The one thing that they they are comfortable with asking an ASCII they're used to it.",
                    "label": 0
                },
                {
                    "sent": "It works well.",
                    "label": 0
                },
                {
                    "sent": "One of the presenters morning talked about, it talked about a first class citizen and clearly ASCII domains.",
                    "label": 0
                },
                {
                    "sent": "Our first class domains I DNN really are second class domains.",
                    "label": 0
                },
                {
                    "sent": "They get treated differently.",
                    "label": 0
                },
                {
                    "sent": "They look different people, people don't.",
                    "label": 0
                },
                {
                    "sent": "People won't go there to the websites because they don't know what to expect and when you get reflected back in the browser or another application, the underlying punycode people have their concerned about where they're going to go certificates today they don't handle ideas very well either, so if I get a SSL certificate.",
                    "label": 0
                },
                {
                    "sent": "I end up getting my business accredited, but yet when I go, there's a mismatch between what I'm seeing and what's on the certificate sometimes, so there's still issues with that.",
                    "label": 0
                },
                {
                    "sent": "So as we take a look at the the one thing that they don't want overtime as they don't want the ID and ASCII.",
                    "label": 0
                },
                {
                    "sent": "Now we have 1.3 million registrations were the second largest is the Latin one.",
                    "label": 0
                },
                {
                    "sent": "They're going to be fine with ID and ASCII because they see the COM or the net or the UK and they're comfortable with that because it's part of it's part of their part of the script.",
                    "label": 0
                },
                {
                    "sent": "Part of the language.",
                    "label": 0
                },
                {
                    "sent": "What they're not comfortable with is the Chinese dot English, but they registered it because it's something that they could register something that represented at least partially what they were doing, and it works in the browser's today.",
                    "label": 0
                },
                {
                    "sent": "So there's still intent to buy or intend to register those domains from several end users from several small medium businesses from several Internet end users.",
                    "label": 0
                },
                {
                    "sent": "But it's not exactly what they want.",
                    "label": 0
                },
                {
                    "sent": "Well, we did find is that small medium businesses in China were more open to the IDN dot DNZ as a primary as a primary registration and in Korea that consumers are more interested in identified ideas.",
                    "label": 0
                },
                {
                    "sent": "Excuse me, small medium businesses were not as interested in ID and ID NS as the Chinese were.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So some of the qualitative things we learn from our research by key Insights, ID and utility is not currently perceived as well appreciated.",
                    "label": 1
                },
                {
                    "sent": "I think that's I think everybody understands that that people want more utility in their ideas, and it's not there today.",
                    "label": 1
                },
                {
                    "sent": "There's initial resistance to adopting ID and ideas.",
                    "label": 0
                },
                {
                    "sent": "Again, it comes back to what is, what is the user experience, how it is the end user looking at the registration.",
                    "label": 0
                },
                {
                    "sent": "What comes back to him was reflected back to them.",
                    "label": 1
                },
                {
                    "sent": "Preferences do emerge for translation or translation, transliteration dependent upon the country.",
                    "label": 0
                },
                {
                    "sent": "This is interesting when you take a look at some of the new G TLD applications that have been that have been applied for in the ICANN process.",
                    "label": 0
                },
                {
                    "sent": "China today runs a regionally resolving domain name called Gangsu which is Chinese for company, whereas Verisign is applied for a transliteration in chinaof.com and what we find is that there's some there's equal attraction.",
                    "label": 0
                },
                {
                    "sent": "For Chinese population, for both of those strings in terms of the market studies that we've done so in a marketplace like China, the transliteration of calm, while not preserved, preserved with the language, 'cause 'cause they actually translate transliterations, commas, we've we've applied for.",
                    "label": 0
                },
                {
                    "sent": "But there's there's appreciation for that.",
                    "label": 0
                },
                {
                    "sent": "In places like Korea, there's also transliteration is appreciated when it comes to a stringlike.com.",
                    "label": 0
                },
                {
                    "sent": "It's not.",
                    "label": 1
                },
                {
                    "sent": "It's not the same when we go to other to other locales.",
                    "label": 1
                },
                {
                    "sent": "In arabicthe.com translation we applied for is actually a brand new word in the Arabic language, and that's an that's that's not something that is as interesting in other in other scripts as it is in Arabic.",
                    "label": 0
                },
                {
                    "sent": "Interesting ideas at this point appears moderate and their reservations.",
                    "label": 0
                },
                {
                    "sent": "And overall, the registrar channel expectations and this is the ICANN accredited registrars.",
                    "label": 0
                },
                {
                    "sent": "About 1000 of them.",
                    "label": 0
                },
                {
                    "sent": "They actually mirror the same things about the countries that they serve.",
                    "label": 0
                },
                {
                    "sent": "So registrars are saying the tools aren't available for me to manage.",
                    "label": 0
                },
                {
                    "sent": "My customer set today.",
                    "label": 0
                },
                {
                    "sent": "So how do I?",
                    "label": 0
                },
                {
                    "sent": "How do I manage a customer experience in a customer relationship in Chinese if I don't have Chinese tools and I don't have system administration capabilities for hosting in those kinds of things without without those kinds of tools?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So these are some details I know that the presentation will be available later, so I'm not going to try to read through every single everything here, but when we go to China and we take a look at the ID and status in China, the Chinese population is fine with.",
                    "label": 0
                },
                {
                    "sent": "Ask you not asking the rope, they're OK with that.",
                    "label": 0
                },
                {
                    "sent": "They're not OK with IDN dot ASCII and they really do want ID and IDN in the long run, but the small medium businesses we found that they are they are more interested in the Latin base.",
                    "label": 0
                },
                {
                    "sent": "We see a lot of number registrations for domain names inside of China as well, but the Chinese population themselves are going to gravitate towards more of an idea and idea overtime and skip the idea and I ask but right now they ask you that ASCII seems to be working fine inside of China.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In India, China, China is the prevalent.",
                    "label": 1
                },
                {
                    "sent": "We actually applied for a devnagari string for translation.com, but we find that since the population in India is largely using English for business, that the 15 to 20% of the population that is online today is perfectly fine within within, within, within ASCII based and English domain name.",
                    "label": 1
                },
                {
                    "sent": "Today we see less transliteration done in India.",
                    "label": 1
                },
                {
                    "sent": "ID and ASCII is not is not as popular and ID and IDN still faces some challenges against the all English strings.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In Japan, we found a similar.",
                    "label": 0
                },
                {
                    "sent": "We found we found a similar.",
                    "label": 0
                },
                {
                    "sent": "Result from the population, not so much.",
                    "label": 0
                },
                {
                    "sent": "For the same reasons as in India towards words.",
                    "label": 0
                },
                {
                    "sent": "The language of it's the language of business, but they're comfortable with English with all English today and the Japanese.",
                    "label": 0
                },
                {
                    "sent": "Japanese ideas themselves saw some prevalence early on, but they've retracted from that overtime.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Korea, however, happens to be the most passionate country that we didn't.",
                    "label": 0
                },
                {
                    "sent": "We did study it up the studies on on moving and migrating towards IBM dot ideas and getting away from all English capabilities.",
                    "label": 0
                },
                {
                    "sent": "So we think that this is 1 marketplace where you've got a really captive audience around internationalization.",
                    "label": 0
                },
                {
                    "sent": "Captive audience, about Hongell, and the focus on their own, their own language identifiers, and actually last time I was in Seoul we started to see a lot of IDN dot cars and a lot of IDN comms being used in businesses, so I expect that we'll start to see in advertising in Korea to see a lot more ID.",
                    "label": 0
                },
                {
                    "sent": "And that idea is used.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So when we think about the future usage, you're likely to visit the website, so this is not.",
                    "label": 1
                },
                {
                    "sent": "Registering them but likely to visit a website and so we still see that the numbers are low when people are saying would I go visit a website that's all localized characters?",
                    "label": 0
                },
                {
                    "sent": "If I saw it in an email advertisement I saw it on a website as a string, so there's still some reluctance to even go to those sites because there's a lack of trust.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So moving forward, we have to have groups getting together from different disciplines to make certain that we are able to adopt ideas and be able to push ideas.",
                    "label": 0
                },
                {
                    "sent": "So of course the registries were the ones that have been have been provisioning domain names.",
                    "label": 1
                },
                {
                    "sent": "I know that that aren't that DOT RF.",
                    "label": 0
                },
                {
                    "sent": "the Russian Cyrillic TLD is about 800,000 registrations, and that's really that's really a good litmus in terms of what the demand is in that particular area.",
                    "label": 0
                },
                {
                    "sent": "We know that in China, CN Nick has put out the Gangsu company and hunger low, which is their version of Network, which again originally resolving domain names that they're actually getting quite some adoption as well.",
                    "label": 0
                },
                {
                    "sent": "As there is there dot China, their CC TLD in Chinese script is getting some great adoption as well.",
                    "label": 0
                },
                {
                    "sent": "We have to continue to work with the registrars.",
                    "label": 0
                },
                {
                    "sent": "I look at that as the responsibility of registries to make certain that we have tools capable that allow the registrars to help to register domain names for their customers content creators.",
                    "label": 1
                },
                {
                    "sent": "There's lots of content being created.",
                    "label": 0
                },
                {
                    "sent": "We know that the content is moving away from English.",
                    "label": 1
                },
                {
                    "sent": "Overtime you guys see that as much as anybody.",
                    "label": 0
                },
                {
                    "sent": "Application developers this is really where we have to have have to have some push and getting application developers to create tools to create social applications that actually do adopt ID NS as identifiers.",
                    "label": 0
                },
                {
                    "sent": "Whether it be for Mail or for websites.",
                    "label": 0
                },
                {
                    "sent": "This is this is really where the heavy lifting has to take place in the next couple of years.",
                    "label": 0
                },
                {
                    "sent": "And then governments and businesses.",
                    "label": 0
                },
                {
                    "sent": "An different organ standards.",
                    "label": 0
                },
                {
                    "sent": "Organizations helping to get this on the forefront of agendas such as W3C.",
                    "label": 0
                },
                {
                    "sent": "One of the one of the nice government actions that's taken place in the last couple of years is Turkey has made has made some some legislation to wear all small medium businesses need to be on line so that is actually driven a lot of small medium businesses to go online for the first time so that they can be reached in be identified.",
                    "label": 0
                },
                {
                    "sent": "So if we had that kind of government assistance in terms of adoption, I think that would help grow this particular aspect of the multilingual web.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So really, if we want adoption, we need ubiquity.",
                    "label": 0
                },
                {
                    "sent": "And if we if we have Ubiquiti, we get adoption.",
                    "label": 0
                },
                {
                    "sent": "So it's really the chicken and egg which came first.",
                    "label": 0
                },
                {
                    "sent": "We're going to drive first.",
                    "label": 0
                },
                {
                    "sent": "We don't have either.",
                    "label": 0
                },
                {
                    "sent": "Right now I was talking with the gentleman from Microsoft and Microsoft was determining whether or not they wanted to.",
                    "label": 0
                },
                {
                    "sent": "Internationalize all of their other software products for them.",
                    "label": 0
                },
                {
                    "sent": "It's a huge investment, so without some adoption we're not going to see internationalized domain names roll off the table at Microsoft because it's really it's really huge financial investment for them to undertake and modify their software so.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Against chicken egg with.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Wow, the ecosystem that we have to have to move forward to get everyone involved and engaged to improve the user experience.",
                    "label": 1
                },
                {
                    "sent": "We want to make certain that the end user is comfortable with domains that internationalized domain names become first class citizens.",
                    "label": 0
                },
                {
                    "sent": "They become equivalent to an ASCII domain name today.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Because once we have that ubiquity equals trust, an just.",
                    "label": 0
                },
                {
                    "sent": "'cause I like to market trust really, really important.",
                    "label": 0
                },
                {
                    "sent": "We see that being the key factor in registration, the key factor in adoption and until a domain name is a domain name, regardless of what the characters were in that domain name, it's going to be.",
                    "label": 0
                },
                {
                    "sent": "It's going to be trust.",
                    "label": 0
                },
                {
                    "sent": "It's interesting that I think back 15 years ago, 13 years ago when I started to work on ID NS, one of the big questions was what will we do for encoding on the DNS DNS?",
                    "label": 0
                },
                {
                    "sent": "It's we have this ASCII compatible encoding and I don't know if it translates around the globe, but we have a product of the states called.",
                    "label": 0
                },
                {
                    "sent": "A switch is an ace bandage, and so I think about a some being kind of a band aid for the DNS and with little progress we've made today.",
                    "label": 0
                },
                {
                    "sent": "I kind of wonder if we've gone back 15 years ago and said, let's make let's fundamentally change the underlying fabric to accept UTF 8 or UTF 16.",
                    "label": 0
                },
                {
                    "sent": "Would that have been a better decision when it comes to internationalization today?",
                    "label": 0
                },
                {
                    "sent": "Now we can't go back and fix that, but it's just something that I have a question about.",
                    "label": 0
                },
                {
                    "sent": "Quite a bit.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So ubiquity doesn't mean just the desktop.",
                    "label": 0
                },
                {
                    "sent": "The desktop software.",
                    "label": 0
                },
                {
                    "sent": "I think that browsers are certainly working well.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But ubiquity also means mobile, and especially in the marketplaces we're talking about when we talk about China, we talk about India when we talk about the large populations that are going to rely upon an international eyes or a multilingual web.",
                    "label": 0
                },
                {
                    "sent": "From a script standpoint.",
                    "label": 0
                },
                {
                    "sent": "These are these are populations that are going to be largely mobile, so we have to make sure that we move into the mobile space as well.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It'll print, it'll overtake desktop usage by 2015.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mobile applications from a penetration standpoint are far less capable of handling ideas today.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so we think about the world in terms of where where this use is going to place again 37%.",
                    "label": 0
                },
                {
                    "sent": "Internet users speak start off with non English not English is they don't speak English as a primary language.",
                    "label": 1
                },
                {
                    "sent": "China as I said as I said earlier, is the largest Internet population today and that's going to be our growth market so that Dang Phu.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Can utilize the Internet in the way that he wants to.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And just know that I like to finish with is that this is something that I would like to be able to get done and there's a manifesto have done out there and the point of getting things done is to go get something else done so.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you very much for your time today.",
                    "label": 0
                },
                {
                    "sent": "I wanted to open up any questions that you may have or want to the end.",
                    "label": 0
                },
                {
                    "sent": "Take question that?",
                    "label": 0
                },
                {
                    "sent": "OK, well thank you very much.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": []
        }
    }
}