{
    "id": "3b4vbs5ih6rfcfmrapvekfm3paxpcwq5",
    "title": "Pitfalls and shortcomings of pharmacogenomic association studies: The tamoxifen controversy",
    "info": {
        "author": [
            "Hiltrud Brauch, Dr. Margarete Fischer-Bosch-Institute of Clinical Pharmacology (IKP)"
        ],
        "published": "July 21, 2014",
        "recorded": "May 2014",
        "category": [
            "Top->Medicine"
        ]
    },
    "url": "http://videolectures.net/mdo2014_brauch_tamoxifen_controversy/",
    "segmentation": [
        [
            "Before I start, I would like to thank the organizers for giving me an opportunity to talk about the pitfalls and the shortcomings of Pharmacogenomic Association studies.",
            "The example I will be talking about is tamoxifen, whose outcome can be predicted by polymorphisms in the CYP 2D6 enzyme.",
            "And this can be could be just as good as a textbook example like Abacavir.",
            "Because we know the mechanism behind that, we know how to stratify the patients and we have an alternative.",
            "In the case of post menopausal patients, however, the translation into the clinics is very difficult and this is due to a controversy in the literature, and this controversy has to do with the lack of replication in large studies."
        ],
        [
            "Now before I get to the C 26 part, let me quickly recall what is tamoxifen and why this is so important.",
            "So tamoxifen is a trifle ethylene compound.",
            "It's a non steroidal anti estrogen selective estrogen receptor modulator that is used for the treatment of all kinds of cancer.",
            "It's around for over 40 years and it's being used in more than 120 countries in this world and it's very valuable.",
            "In the clinic becausw, it efficiently reduces the the recurrence and mortality."
        ],
        [
            "Its mode of action is that tamoxifen competes with estrogen for the binding at the estrogen receptor.",
            "And in doing this it blocks cell cancer growth and this is.",
            "And a treatment option for breast cancers that express the estrogen receptor.",
            "And this is the case in over 70% of all breast cancers.",
            "And mind you that there is an annual number of new diagnosis that which is almost 1.5 million globally, so this is relevant to thousands and thousands of patients care enough to mention that there is and that there is another treatment.",
            "Option which just works similar except through a different mechanism by blocking the aromatisse for the production of estrogen."
        ],
        [
            "And in fact, both treatment options have similar efficacy.",
            "They are both successful, with a slight advantage given to the Aromat ace inhibitors.",
            "But given the fact of two equal treatment option, one would like to know which drug serves better the individual patients and mind you endocrine treatment in breast cancer is a long term treatment for five years and even longer, so it would be very important to know.",
            "Upfront which drug has the best efficacy in which patient?"
        ],
        [
            "And this can be investigated and even done for tamoxifen becausw tamoxifen metabolism is very well known.",
            "We know that tamoxifen is approach track and needs to be converted into active metabolites.",
            "Four hydroxy Finn.",
            "And endoxifen.",
            "And.",
            "The Endoxifen is considered to be the main metabolite because its serum concentration is higher than that of four hydroxy tamoxifen, and if you look at the metabolism you see that the limiting enzyme for the conversion from the endless material tamoxifen to the end is the CYP 2D6 and This is why we focus on the CYP 2D6."
        ],
        [
            "It has been said by Andrew already that is highly polymorphic and throughout the population we have individuals that are poor metabolizers that do not have CYP 2D6 function and the hypothesis is that whoever is a poor metabolizer will not have sufficient tamoxifen benefit."
        ],
        [
            "This is just a reminder that how the phenotypes are distributed throughout the population, so about 50% I extensive matab tell extensive metabolizers, 8% upper metabolizers and the other 50% are somewhere in between."
        ],
        [
            "So we tested the hypothesis that by the C2D6 can be used as a bio."
        ],
        [
            "Marker for breast cancer outcome and this is the recurrence frequency in a cohort of more than 1300 patients without stratification by Dino type.",
            "But if we."
        ],
        [
            "Do the genotyping, then it becomes evident that patients who are poor metabolizers have much worse and this is significant outcome from tamoxifen.",
            "Then for example, the extensive metabolizers and based on this result one would conclude that the poor metabolizers would be the ones to go Alternatively on the aromat ACE inhibitors whereas the EM patients."
        ],
        [
            "Could take the tamoxifen and as a matter of fact we have published in 2009 that the benefit of the EM patient would be compareable with that of hypo hypothetical aromat ACE inhibitor treatment now."
        ],
        [
            "As I mentioned already in the beginning, this results or this finding is not readily translated into the clinic, and the reason for that is that this.",
            "Designs have been obtained in a retrospective study and although the criteria for the inclusion have been very well specified, like a histologically proven cancer, no chemotherapy mono active on tamoxifen, no meta static disease receptor steroid positive, and the most patients have been post menopausal.",
            "This is not accepted by the clinicians.",
            "Because clinicians prefer to have prospective study."
        ],
        [
            "And.",
            "Although, and this is a publication that we first to the level of evidence needed in biomarker studies, and again they point out that it would be the gold standard would be a prospective clinical trial.",
            "However, respective studies can be used if certain criteria are observed."
        ],
        [
            "So the final evidence was expected from so-called perspective studies that have been conducted initially within the context of comparing the efficacy between tamoxifen and aromat ACE inhibitors and a follow up or a secondary analysis.",
            "Doing a pharmacogenetic work up actually showed no Association between CYP 2D6 polymorphism and tamoxifen outcome, and that came kind of shocked."
        ],
        [
            "Community because one would have expected that the perspective studies would show some correlation between the CYP 2D6 in the tamoxifen outcome and for a better understanding of that discrepancy in results of these three large studies being conducted, I have prepared that table which gives you our study which was a retrospective study based on 1500 cases.",
            "1300 Geno type and the two studies attack.",
            "303 thousand patients initially, but only included in the pharmacogenetic analysis, less than 20% of the patients in the Big 198 studies, starting with two and half thousand patients, and about 50% had been genotyped."
        ],
        [
            "How about the source of the DNA they had used in the studies?",
            "Our study had about half of it DNA that have been has been derived from blood samples.",
            "So that was germline DNA and the other half was isolated from tumor sections and in the both in the attack study and in the Big 198 study they used.",
            "Tumor, called biopsies, which is an enrichment."
        ],
        [
            "The tumor in in the samples for the DNA isolation.",
            "Now a rigorous comparison of these studies by statisticians showed that in the case of the attack study, and in the case of the Big 198 study, they were far out of Hardy Weinberg equilibrium, which is a measure of the quality of your genotyping.",
            "In order to show whether you reach the distribution throughout the population and based on this deviation of Hardy Weinberg equilibrium, it has been suggested that they have.",
            "Been technical difficulties in this study and therefore this study cannot be interpreted.",
            "And although we had also slide deviation of Hardy Weinberg equilibrium in our.",
            "In our tumor derived DNA samples overall.",
            "That really did not affect the results in our study."
        ],
        [
            "So.",
            "When it comes to pharmacogenetic analysis, the DNA source is very critical and the reason for that is that tumor DNA or the DNA derived from a tumor sample may not represent the dinamik the constitutional DNA DNA of an individual, and this is just big cause the human genome is characterized by loss of heterozygosity, which is the loss of genetic material.",
            "And that has been recognized in the 80s already as a hallmark in cancer.",
            "So we need to be aware of that.",
            "The tumor genome is different from the."
        ],
        [
            "Constitutional genome and in fact this is true for breast cancer.",
            "Many studies have shown that breast cancer is affected by loss of heterozygosity and also the lock was harboring the CYP 2D6 enzyme, which is the chromosome 20 Q 13 band is affected by loss of hetero."
        ],
        [
            "Zygosity and even though studies showing showing that DNA derived from blood.",
            "Versus DNA derived from tumor can end up in the similar results.",
            "This is at."
        ],
        [
            "Really not relevant because we have to show that in your actual study you under investigation that do indeed have analyzed the constitutional Geno type."
        ],
        [
            "And just because it has also been questioned whether this all is true for for breast cancer, that loss of heterozygosity may indeed affect the interpretation of phenotypes.",
            "This is just an example of a deep sequencing generated by the Cancer Genome Atlas team to show that indeed up to 30% of breast cancers have loss of heterozygosity at the chromosome 22.",
            "Relevant lockers and this is even higher for the ER, positive tumors.",
            "So in conclusion, the the deviation from."
        ],
        [
            "The Hardy Weinberg equilibrium in the Big 198 and Attack study is most likely due to loss of heterozygosity in their DNA that has been derived from tumor course.",
            "So, in conclusion, attention must be paid when we do analyze the DNA for pharmacogenetic investigations.",
            "The best source is the black, of course, because this gives us the constitutional intact.",
            "DNA of a person versus whenever we isolate DNA from archive tissue, especially core punches, then the risk of having to deal with LOH is."
        ],
        [
            "Is a given.",
            "Now other than pounding around these technical issues, the question is, is there more evidence?",
            "Is there are other evidence?",
            "What kind of evidence do we have to support the idea that ship to this six polymorphisms can be used to predict outcome?",
            "This is another study that has been published last year coming from an Austrian trial that indeed shows shows a correlation between the PMS that have.",
            "Higher that have a higher risk for recurrence, and this indeed is also a prospectively collected patient cohort, just like the Big 198 or the attack or reach."
        ],
        [
            "Nearly and Meanwhile published also is the meta analysis of the globally available CYP 2D6 Tamoxifin data collaboration between different countries between different continents.",
            "And also they confirmed that the risk for recurrence is statistically increased in patients with a poor metabolizer phenotype."
        ],
        [
            "So.",
            "That was the Geno types.",
            "The question is can be gained some more information when we look at the metabolites and this is just the endoxifen concentrations analyzed in relation to the the different underlying Geno types.",
            "And given the same dose of the drug which is 20 milligram per day, you can see that there is a clear correlation between the levels of the endoxifen in the blood with very low levels with regard to the poor metabolizers in higher levels.",
            "With increasing gene dose."
        ],
        [
            "And this is actually a significant gene dose effect, both with regard to the endoxifen and the metabolic ratio.",
            "Between this and this material, tamoxifen, endoxifen and the Inter individual variability.",
            "The contribution to that is about 70%."
        ],
        [
            "Now the correlation of metabolites with outcome has first address has first been addressed and this is the only study in the well study the women's healthy eating, living trial and they indeed showed that patients who are in the lower quintile of endoxifen concentration in their in their plasma do have indeed lower.",
            "A lower outcome at higher risk to develop recurrence."
        ],
        [
            "So in conclusion, we think that in the post, menopause is setting the two D6 and the endoxifen matters for the outcome."
        ],
        [
            "But the question is.",
            "Can this also applied for premium Apostle patients who as you know these are the patients who still have ovarian function and due to their through this strong?",
            "Hipot alimic between Terry control of the estrogen levels cannot use Aromat ace inhibitors for the treatment of their ear positive cancer and.",
            "Premenopausal patients, of course, are very young and they are also prone to discontinue the truck, so compliance with premium participations is even a higher problem than in general.",
            "So we were asking the question whether the principles of the CYP 2D6 prediction in outcome or the prediction using metabolite levels for outcome in order then to encourage the patient to stay on the track could be applied to premium participations.",
            "And we got encouraged to follow that up by in vitro studies that investigated the effect of endoxifen in relation to premenopausal concentrations of eastern and tamoxifen and the metabolite cocktail, and this study suggested that endoxifen is relevant in premenopausal patients to control."
        ],
        [
            "Cancer growth and this is premenopausal patients are not as frequently around as possible in a positive patients.",
            "So you need you.",
            "It's harder to collect them and but we were lucky enough to have three cohorts being available to us and they happen to be even from three different ethnicities.",
            "The posh individuals, a UK Caucasian as sample cohort.",
            "The Lebanon samples for Middle Eastern Arabs and a cohort from Singapore representative for East Asian and what you can tell.",
            "And these are the different metabolise measured in this theorem.",
            "This remark comes look similar to those of the patients and indeed we do have similar metabolite levels throughout ethnicities here."
        ],
        [
            "And there is also a significant gene dose effect in the combined cohort, but also in the individual cohorts.",
            "So that's pretty similar to."
        ],
        [
            "The post menopause situation, and if we look whether the CYP 2D6 predicts outcome and this is now restricted restricted to the UK Caucasian samples because only those had outcome data available, then we can see statistically significant difference between the PMS and the EM patients.",
            "However, this is only based on 300 page."
        ],
        [
            "Patients looking at the metabolites and in particularly for the metabolic ratio.",
            "In this material, tamoxifen and endoxifen we also see that the patients with a higher metabolic ratio do much worse than those patients with a lower metabolic ratio, which are the ones who produce endoxifen."
        ],
        [
            "Now, in the interest of time, I will not go into that, but this is just to say that other ships also influence the Inter individual variability of the tamoxifen metabolism with regard for hydroxy tamoxifen inoran."
        ],
        [
            "Loxapine but I would like to stick with the CYP 2D6 and summarize that in the case of possibly an Apostle patients, we believe that there is enough evidence to say that CYP 2D6 can predict outcome an could be used as an outcome predictor.",
            "However, in terms of regulatory advice, this has not manifested in clear recommendation of a genetic test for the outcome prediction, but a little bit indirectly.",
            "It is integrated into the guidelines that patients are advised not to use CYP 2D6 inhibitors because they may block the ship 26 enzyme and also some kind of an indirect advice is to advise patients to stick with the track in order to have a treatment success.",
            "With regard to the premium process situation, we believe that we have generated first evidence that Endoxifen concentration an CYP 2D6 activity can predict outcome as well in these patients."
        ],
        [
            "King now to summarize on what I have said with regard to the pitfalls, this is a flow chart I have taken from that revenue by had a Wheeler at all in nature review, Genetics and it just takes you through the different steps how you should design A pharmacogenetic study and it pretty much picks up."
        ],
        [
            "On the points I have touched and this is just to say that while the investigators of the studies I have talked about today, the pick 198 in the attack tried to pay attention to that.",
            "What has been set throughout that meeting already?",
            "You know, typing is a critical step.",
            "They try to observe that by doing a comprehensive CYP 2D6 genotyping and you know that many polymorphisms contribute to the.",
            "Phenotypic activity they."
        ],
        [
            "Actually made the mistake in the very first step in choosing the patient cohort and then not paying attention to the source of the germline DNA.",
            "Mind you that whenever you have not a clinical prospective study available or blood sample available, you have to take care of."
        ],
        [
            "All you have to.",
            "We remember that the tumor DNA does not reflect fully the germline DNA and this is where the trouble came from, which resulted in an invalid analysis."
        ],
        [
            "So it is of no surprise that quality control is of the highest importance in pharmacogenomic studies and the take home message is that whenever you use whenever.",
            "Oops.",
            "Whenever you use.",
            "Genotyping in order to delineate a phenotype then.",
            "Then your statistiques must.",
            "Must take care by Hardy Weinberg, equilibrium testing and of course this applies for the over Statistiques as well."
        ],
        [
            "And having said that, I would like to thank all my collaborators at Ikapi who are in the audience today.",
            "In particularly, I would like to mention that this has been part of PhD thesis of Pila salad or as supported by Boyan Gunship and major input to that study came from Vanish Rd to mass murder and Steven Winter and the Premium Apostle.",
            "Aspects of this study would not have been possible without our collaborators from the University of Southampton.",
            "Diana anchors and 13 the American University of Beirut, Natalie escape.",
            "Enter team.",
            "In Byram Job INTJ's team from the National Cancer Centre Singapore thank you very much.",
            "Thank you very much for for this nice talk.",
            "I was wondering if you look at the benefit of the cytochrome 26 testing for tamoxifen.",
            "As you know, I'm quite convinced.",
            "Hold on, let our clinicians are stating well in the Netherlands.",
            "Patients will be on tamoxifen for 2 1/2 years and then they will be switched to aromatize inhibitors automatically.",
            "So will there still be a benefit then for doing the genotyping?",
            "Has that been included because I can only see trials in which there is like 15 years followups on tamoxifen.",
            "I mean, it's always an issue that the patient can be switched to the aromat ACE inhibitors, but to maybe not everybody can be switched or not.",
            "Everybody can tolerate aromatize inhibitors because the side effect profile is different from tamoxifen and whenever tamoxifen is given to a patient then one should take advantage of the current knowledge whether a patient is able to produce sufficient metabolite.",
            "Endoxifen or not, and if not, they should go right away on an aromat ACE inhibitor all the five years.",
            "But in Germany patients are indeed like 10 or 15 years from tamoxifen monotherapy.",
            "The fashions are changing, so there was a time when everybody would be switched and I have heard in meetings with clinicians that this is no more the case, so there is not a clear benefit from the switching, but on the other hand, to be on the safe side, you may take advantage from both treatment principles, so this is not a black and white situation in the clinic.",
            "Last question, man.",
            "Thanks for a very interesting and nice overview.",
            "I mean it would be of course evident that premenopausal that you have higher estrogen levels and the effect of the 36 point morphis is much higher.",
            "And in a study published in Sweden from Sweden, pharmacogenomics, you had an odds ratio about 2.2 in pre menopausal women.",
            "And and which is higher and more reproducible, maybe than the post menopausal women so?",
            "And this makes sense.",
            "Of course, much more sense than to do it in postmenopausal women do.",
            "Are you studying this topic to focus on the premium reports of women?",
            "Well, we would very much like to extend that because you could see from the numbers I have presented that this is still a very small study and we know that we need more than 1000 patients in order to have statistically sound studies.",
            "So replication is very important for that, but I think it would be very important even though the premium PASA patients do not have currently an alternative, but it would be very important based on the.",
            "Evidence from the metabolite levels, or maybe even the CYP 2D6 status, to help them to stick with the drug and to increase their chances of controlling the disease, thanks.",
            "That's all we have.",
            "Thank you very much, Hilton."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Before I start, I would like to thank the organizers for giving me an opportunity to talk about the pitfalls and the shortcomings of Pharmacogenomic Association studies.",
                    "label": 1
                },
                {
                    "sent": "The example I will be talking about is tamoxifen, whose outcome can be predicted by polymorphisms in the CYP 2D6 enzyme.",
                    "label": 0
                },
                {
                    "sent": "And this can be could be just as good as a textbook example like Abacavir.",
                    "label": 0
                },
                {
                    "sent": "Because we know the mechanism behind that, we know how to stratify the patients and we have an alternative.",
                    "label": 0
                },
                {
                    "sent": "In the case of post menopausal patients, however, the translation into the clinics is very difficult and this is due to a controversy in the literature, and this controversy has to do with the lack of replication in large studies.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now before I get to the C 26 part, let me quickly recall what is tamoxifen and why this is so important.",
                    "label": 0
                },
                {
                    "sent": "So tamoxifen is a trifle ethylene compound.",
                    "label": 0
                },
                {
                    "sent": "It's a non steroidal anti estrogen selective estrogen receptor modulator that is used for the treatment of all kinds of cancer.",
                    "label": 1
                },
                {
                    "sent": "It's around for over 40 years and it's being used in more than 120 countries in this world and it's very valuable.",
                    "label": 0
                },
                {
                    "sent": "In the clinic becausw, it efficiently reduces the the recurrence and mortality.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Its mode of action is that tamoxifen competes with estrogen for the binding at the estrogen receptor.",
                    "label": 0
                },
                {
                    "sent": "And in doing this it blocks cell cancer growth and this is.",
                    "label": 0
                },
                {
                    "sent": "And a treatment option for breast cancers that express the estrogen receptor.",
                    "label": 0
                },
                {
                    "sent": "And this is the case in over 70% of all breast cancers.",
                    "label": 1
                },
                {
                    "sent": "And mind you that there is an annual number of new diagnosis that which is almost 1.5 million globally, so this is relevant to thousands and thousands of patients care enough to mention that there is and that there is another treatment.",
                    "label": 0
                },
                {
                    "sent": "Option which just works similar except through a different mechanism by blocking the aromatisse for the production of estrogen.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in fact, both treatment options have similar efficacy.",
                    "label": 0
                },
                {
                    "sent": "They are both successful, with a slight advantage given to the Aromat ace inhibitors.",
                    "label": 0
                },
                {
                    "sent": "But given the fact of two equal treatment option, one would like to know which drug serves better the individual patients and mind you endocrine treatment in breast cancer is a long term treatment for five years and even longer, so it would be very important to know.",
                    "label": 0
                },
                {
                    "sent": "Upfront which drug has the best efficacy in which patient?",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this can be investigated and even done for tamoxifen becausw tamoxifen metabolism is very well known.",
                    "label": 0
                },
                {
                    "sent": "We know that tamoxifen is approach track and needs to be converted into active metabolites.",
                    "label": 0
                },
                {
                    "sent": "Four hydroxy Finn.",
                    "label": 0
                },
                {
                    "sent": "And endoxifen.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "The Endoxifen is considered to be the main metabolite because its serum concentration is higher than that of four hydroxy tamoxifen, and if you look at the metabolism you see that the limiting enzyme for the conversion from the endless material tamoxifen to the end is the CYP 2D6 and This is why we focus on the CYP 2D6.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It has been said by Andrew already that is highly polymorphic and throughout the population we have individuals that are poor metabolizers that do not have CYP 2D6 function and the hypothesis is that whoever is a poor metabolizer will not have sufficient tamoxifen benefit.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is just a reminder that how the phenotypes are distributed throughout the population, so about 50% I extensive matab tell extensive metabolizers, 8% upper metabolizers and the other 50% are somewhere in between.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we tested the hypothesis that by the C2D6 can be used as a bio.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Marker for breast cancer outcome and this is the recurrence frequency in a cohort of more than 1300 patients without stratification by Dino type.",
                    "label": 0
                },
                {
                    "sent": "But if we.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Do the genotyping, then it becomes evident that patients who are poor metabolizers have much worse and this is significant outcome from tamoxifen.",
                    "label": 0
                },
                {
                    "sent": "Then for example, the extensive metabolizers and based on this result one would conclude that the poor metabolizers would be the ones to go Alternatively on the aromat ACE inhibitors whereas the EM patients.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Could take the tamoxifen and as a matter of fact we have published in 2009 that the benefit of the EM patient would be compareable with that of hypo hypothetical aromat ACE inhibitor treatment now.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As I mentioned already in the beginning, this results or this finding is not readily translated into the clinic, and the reason for that is that this.",
                    "label": 0
                },
                {
                    "sent": "Designs have been obtained in a retrospective study and although the criteria for the inclusion have been very well specified, like a histologically proven cancer, no chemotherapy mono active on tamoxifen, no meta static disease receptor steroid positive, and the most patients have been post menopausal.",
                    "label": 1
                },
                {
                    "sent": "This is not accepted by the clinicians.",
                    "label": 0
                },
                {
                    "sent": "Because clinicians prefer to have prospective study.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Although, and this is a publication that we first to the level of evidence needed in biomarker studies, and again they point out that it would be the gold standard would be a prospective clinical trial.",
                    "label": 1
                },
                {
                    "sent": "However, respective studies can be used if certain criteria are observed.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the final evidence was expected from so-called perspective studies that have been conducted initially within the context of comparing the efficacy between tamoxifen and aromat ACE inhibitors and a follow up or a secondary analysis.",
                    "label": 0
                },
                {
                    "sent": "Doing a pharmacogenetic work up actually showed no Association between CYP 2D6 polymorphism and tamoxifen outcome, and that came kind of shocked.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Community because one would have expected that the perspective studies would show some correlation between the CYP 2D6 in the tamoxifen outcome and for a better understanding of that discrepancy in results of these three large studies being conducted, I have prepared that table which gives you our study which was a retrospective study based on 1500 cases.",
                    "label": 0
                },
                {
                    "sent": "1300 Geno type and the two studies attack.",
                    "label": 0
                },
                {
                    "sent": "303 thousand patients initially, but only included in the pharmacogenetic analysis, less than 20% of the patients in the Big 198 studies, starting with two and half thousand patients, and about 50% had been genotyped.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How about the source of the DNA they had used in the studies?",
                    "label": 0
                },
                {
                    "sent": "Our study had about half of it DNA that have been has been derived from blood samples.",
                    "label": 0
                },
                {
                    "sent": "So that was germline DNA and the other half was isolated from tumor sections and in the both in the attack study and in the Big 198 study they used.",
                    "label": 0
                },
                {
                    "sent": "Tumor, called biopsies, which is an enrichment.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The tumor in in the samples for the DNA isolation.",
                    "label": 0
                },
                {
                    "sent": "Now a rigorous comparison of these studies by statisticians showed that in the case of the attack study, and in the case of the Big 198 study, they were far out of Hardy Weinberg equilibrium, which is a measure of the quality of your genotyping.",
                    "label": 0
                },
                {
                    "sent": "In order to show whether you reach the distribution throughout the population and based on this deviation of Hardy Weinberg equilibrium, it has been suggested that they have.",
                    "label": 0
                },
                {
                    "sent": "Been technical difficulties in this study and therefore this study cannot be interpreted.",
                    "label": 0
                },
                {
                    "sent": "And although we had also slide deviation of Hardy Weinberg equilibrium in our.",
                    "label": 0
                },
                {
                    "sent": "In our tumor derived DNA samples overall.",
                    "label": 0
                },
                {
                    "sent": "That really did not affect the results in our study.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "When it comes to pharmacogenetic analysis, the DNA source is very critical and the reason for that is that tumor DNA or the DNA derived from a tumor sample may not represent the dinamik the constitutional DNA DNA of an individual, and this is just big cause the human genome is characterized by loss of heterozygosity, which is the loss of genetic material.",
                    "label": 1
                },
                {
                    "sent": "And that has been recognized in the 80s already as a hallmark in cancer.",
                    "label": 1
                },
                {
                    "sent": "So we need to be aware of that.",
                    "label": 0
                },
                {
                    "sent": "The tumor genome is different from the.",
                    "label": 1
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Constitutional genome and in fact this is true for breast cancer.",
                    "label": 0
                },
                {
                    "sent": "Many studies have shown that breast cancer is affected by loss of heterozygosity and also the lock was harboring the CYP 2D6 enzyme, which is the chromosome 20 Q 13 band is affected by loss of hetero.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Zygosity and even though studies showing showing that DNA derived from blood.",
                    "label": 0
                },
                {
                    "sent": "Versus DNA derived from tumor can end up in the similar results.",
                    "label": 0
                },
                {
                    "sent": "This is at.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Really not relevant because we have to show that in your actual study you under investigation that do indeed have analyzed the constitutional Geno type.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And just because it has also been questioned whether this all is true for for breast cancer, that loss of heterozygosity may indeed affect the interpretation of phenotypes.",
                    "label": 0
                },
                {
                    "sent": "This is just an example of a deep sequencing generated by the Cancer Genome Atlas team to show that indeed up to 30% of breast cancers have loss of heterozygosity at the chromosome 22.",
                    "label": 0
                },
                {
                    "sent": "Relevant lockers and this is even higher for the ER, positive tumors.",
                    "label": 0
                },
                {
                    "sent": "So in conclusion, the the deviation from.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The Hardy Weinberg equilibrium in the Big 198 and Attack study is most likely due to loss of heterozygosity in their DNA that has been derived from tumor course.",
                    "label": 0
                },
                {
                    "sent": "So, in conclusion, attention must be paid when we do analyze the DNA for pharmacogenetic investigations.",
                    "label": 1
                },
                {
                    "sent": "The best source is the black, of course, because this gives us the constitutional intact.",
                    "label": 0
                },
                {
                    "sent": "DNA of a person versus whenever we isolate DNA from archive tissue, especially core punches, then the risk of having to deal with LOH is.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is a given.",
                    "label": 0
                },
                {
                    "sent": "Now other than pounding around these technical issues, the question is, is there more evidence?",
                    "label": 0
                },
                {
                    "sent": "Is there are other evidence?",
                    "label": 0
                },
                {
                    "sent": "What kind of evidence do we have to support the idea that ship to this six polymorphisms can be used to predict outcome?",
                    "label": 0
                },
                {
                    "sent": "This is another study that has been published last year coming from an Austrian trial that indeed shows shows a correlation between the PMS that have.",
                    "label": 0
                },
                {
                    "sent": "Higher that have a higher risk for recurrence, and this indeed is also a prospectively collected patient cohort, just like the Big 198 or the attack or reach.",
                    "label": 1
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nearly and Meanwhile published also is the meta analysis of the globally available CYP 2D6 Tamoxifin data collaboration between different countries between different continents.",
                    "label": 0
                },
                {
                    "sent": "And also they confirmed that the risk for recurrence is statistically increased in patients with a poor metabolizer phenotype.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "That was the Geno types.",
                    "label": 0
                },
                {
                    "sent": "The question is can be gained some more information when we look at the metabolites and this is just the endoxifen concentrations analyzed in relation to the the different underlying Geno types.",
                    "label": 0
                },
                {
                    "sent": "And given the same dose of the drug which is 20 milligram per day, you can see that there is a clear correlation between the levels of the endoxifen in the blood with very low levels with regard to the poor metabolizers in higher levels.",
                    "label": 0
                },
                {
                    "sent": "With increasing gene dose.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is actually a significant gene dose effect, both with regard to the endoxifen and the metabolic ratio.",
                    "label": 0
                },
                {
                    "sent": "Between this and this material, tamoxifen, endoxifen and the Inter individual variability.",
                    "label": 0
                },
                {
                    "sent": "The contribution to that is about 70%.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now the correlation of metabolites with outcome has first address has first been addressed and this is the only study in the well study the women's healthy eating, living trial and they indeed showed that patients who are in the lower quintile of endoxifen concentration in their in their plasma do have indeed lower.",
                    "label": 0
                },
                {
                    "sent": "A lower outcome at higher risk to develop recurrence.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in conclusion, we think that in the post, menopause is setting the two D6 and the endoxifen matters for the outcome.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But the question is.",
                    "label": 0
                },
                {
                    "sent": "Can this also applied for premium Apostle patients who as you know these are the patients who still have ovarian function and due to their through this strong?",
                    "label": 0
                },
                {
                    "sent": "Hipot alimic between Terry control of the estrogen levels cannot use Aromat ace inhibitors for the treatment of their ear positive cancer and.",
                    "label": 1
                },
                {
                    "sent": "Premenopausal patients, of course, are very young and they are also prone to discontinue the truck, so compliance with premium participations is even a higher problem than in general.",
                    "label": 0
                },
                {
                    "sent": "So we were asking the question whether the principles of the CYP 2D6 prediction in outcome or the prediction using metabolite levels for outcome in order then to encourage the patient to stay on the track could be applied to premium participations.",
                    "label": 1
                },
                {
                    "sent": "And we got encouraged to follow that up by in vitro studies that investigated the effect of endoxifen in relation to premenopausal concentrations of eastern and tamoxifen and the metabolite cocktail, and this study suggested that endoxifen is relevant in premenopausal patients to control.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cancer growth and this is premenopausal patients are not as frequently around as possible in a positive patients.",
                    "label": 0
                },
                {
                    "sent": "So you need you.",
                    "label": 0
                },
                {
                    "sent": "It's harder to collect them and but we were lucky enough to have three cohorts being available to us and they happen to be even from three different ethnicities.",
                    "label": 0
                },
                {
                    "sent": "The posh individuals, a UK Caucasian as sample cohort.",
                    "label": 0
                },
                {
                    "sent": "The Lebanon samples for Middle Eastern Arabs and a cohort from Singapore representative for East Asian and what you can tell.",
                    "label": 0
                },
                {
                    "sent": "And these are the different metabolise measured in this theorem.",
                    "label": 0
                },
                {
                    "sent": "This remark comes look similar to those of the patients and indeed we do have similar metabolite levels throughout ethnicities here.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there is also a significant gene dose effect in the combined cohort, but also in the individual cohorts.",
                    "label": 0
                },
                {
                    "sent": "So that's pretty similar to.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The post menopause situation, and if we look whether the CYP 2D6 predicts outcome and this is now restricted restricted to the UK Caucasian samples because only those had outcome data available, then we can see statistically significant difference between the PMS and the EM patients.",
                    "label": 0
                },
                {
                    "sent": "However, this is only based on 300 page.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Patients looking at the metabolites and in particularly for the metabolic ratio.",
                    "label": 0
                },
                {
                    "sent": "In this material, tamoxifen and endoxifen we also see that the patients with a higher metabolic ratio do much worse than those patients with a lower metabolic ratio, which are the ones who produce endoxifen.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, in the interest of time, I will not go into that, but this is just to say that other ships also influence the Inter individual variability of the tamoxifen metabolism with regard for hydroxy tamoxifen inoran.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Loxapine but I would like to stick with the CYP 2D6 and summarize that in the case of possibly an Apostle patients, we believe that there is enough evidence to say that CYP 2D6 can predict outcome an could be used as an outcome predictor.",
                    "label": 0
                },
                {
                    "sent": "However, in terms of regulatory advice, this has not manifested in clear recommendation of a genetic test for the outcome prediction, but a little bit indirectly.",
                    "label": 0
                },
                {
                    "sent": "It is integrated into the guidelines that patients are advised not to use CYP 2D6 inhibitors because they may block the ship 26 enzyme and also some kind of an indirect advice is to advise patients to stick with the track in order to have a treatment success.",
                    "label": 0
                },
                {
                    "sent": "With regard to the premium process situation, we believe that we have generated first evidence that Endoxifen concentration an CYP 2D6 activity can predict outcome as well in these patients.",
                    "label": 1
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "King now to summarize on what I have said with regard to the pitfalls, this is a flow chart I have taken from that revenue by had a Wheeler at all in nature review, Genetics and it just takes you through the different steps how you should design A pharmacogenetic study and it pretty much picks up.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the points I have touched and this is just to say that while the investigators of the studies I have talked about today, the pick 198 in the attack tried to pay attention to that.",
                    "label": 0
                },
                {
                    "sent": "What has been set throughout that meeting already?",
                    "label": 0
                },
                {
                    "sent": "You know, typing is a critical step.",
                    "label": 0
                },
                {
                    "sent": "They try to observe that by doing a comprehensive CYP 2D6 genotyping and you know that many polymorphisms contribute to the.",
                    "label": 0
                },
                {
                    "sent": "Phenotypic activity they.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actually made the mistake in the very first step in choosing the patient cohort and then not paying attention to the source of the germline DNA.",
                    "label": 0
                },
                {
                    "sent": "Mind you that whenever you have not a clinical prospective study available or blood sample available, you have to take care of.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All you have to.",
                    "label": 0
                },
                {
                    "sent": "We remember that the tumor DNA does not reflect fully the germline DNA and this is where the trouble came from, which resulted in an invalid analysis.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So it is of no surprise that quality control is of the highest importance in pharmacogenomic studies and the take home message is that whenever you use whenever.",
                    "label": 0
                },
                {
                    "sent": "Oops.",
                    "label": 0
                },
                {
                    "sent": "Whenever you use.",
                    "label": 0
                },
                {
                    "sent": "Genotyping in order to delineate a phenotype then.",
                    "label": 0
                },
                {
                    "sent": "Then your statistiques must.",
                    "label": 0
                },
                {
                    "sent": "Must take care by Hardy Weinberg, equilibrium testing and of course this applies for the over Statistiques as well.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And having said that, I would like to thank all my collaborators at Ikapi who are in the audience today.",
                    "label": 0
                },
                {
                    "sent": "In particularly, I would like to mention that this has been part of PhD thesis of Pila salad or as supported by Boyan Gunship and major input to that study came from Vanish Rd to mass murder and Steven Winter and the Premium Apostle.",
                    "label": 0
                },
                {
                    "sent": "Aspects of this study would not have been possible without our collaborators from the University of Southampton.",
                    "label": 0
                },
                {
                    "sent": "Diana anchors and 13 the American University of Beirut, Natalie escape.",
                    "label": 0
                },
                {
                    "sent": "Enter team.",
                    "label": 0
                },
                {
                    "sent": "In Byram Job INTJ's team from the National Cancer Centre Singapore thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much for for this nice talk.",
                    "label": 0
                },
                {
                    "sent": "I was wondering if you look at the benefit of the cytochrome 26 testing for tamoxifen.",
                    "label": 0
                },
                {
                    "sent": "As you know, I'm quite convinced.",
                    "label": 0
                },
                {
                    "sent": "Hold on, let our clinicians are stating well in the Netherlands.",
                    "label": 0
                },
                {
                    "sent": "Patients will be on tamoxifen for 2 1/2 years and then they will be switched to aromatize inhibitors automatically.",
                    "label": 0
                },
                {
                    "sent": "So will there still be a benefit then for doing the genotyping?",
                    "label": 0
                },
                {
                    "sent": "Has that been included because I can only see trials in which there is like 15 years followups on tamoxifen.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's always an issue that the patient can be switched to the aromat ACE inhibitors, but to maybe not everybody can be switched or not.",
                    "label": 0
                },
                {
                    "sent": "Everybody can tolerate aromatize inhibitors because the side effect profile is different from tamoxifen and whenever tamoxifen is given to a patient then one should take advantage of the current knowledge whether a patient is able to produce sufficient metabolite.",
                    "label": 0
                },
                {
                    "sent": "Endoxifen or not, and if not, they should go right away on an aromat ACE inhibitor all the five years.",
                    "label": 0
                },
                {
                    "sent": "But in Germany patients are indeed like 10 or 15 years from tamoxifen monotherapy.",
                    "label": 0
                },
                {
                    "sent": "The fashions are changing, so there was a time when everybody would be switched and I have heard in meetings with clinicians that this is no more the case, so there is not a clear benefit from the switching, but on the other hand, to be on the safe side, you may take advantage from both treatment principles, so this is not a black and white situation in the clinic.",
                    "label": 0
                },
                {
                    "sent": "Last question, man.",
                    "label": 0
                },
                {
                    "sent": "Thanks for a very interesting and nice overview.",
                    "label": 0
                },
                {
                    "sent": "I mean it would be of course evident that premenopausal that you have higher estrogen levels and the effect of the 36 point morphis is much higher.",
                    "label": 0
                },
                {
                    "sent": "And in a study published in Sweden from Sweden, pharmacogenomics, you had an odds ratio about 2.2 in pre menopausal women.",
                    "label": 0
                },
                {
                    "sent": "And and which is higher and more reproducible, maybe than the post menopausal women so?",
                    "label": 0
                },
                {
                    "sent": "And this makes sense.",
                    "label": 0
                },
                {
                    "sent": "Of course, much more sense than to do it in postmenopausal women do.",
                    "label": 0
                },
                {
                    "sent": "Are you studying this topic to focus on the premium reports of women?",
                    "label": 0
                },
                {
                    "sent": "Well, we would very much like to extend that because you could see from the numbers I have presented that this is still a very small study and we know that we need more than 1000 patients in order to have statistically sound studies.",
                    "label": 0
                },
                {
                    "sent": "So replication is very important for that, but I think it would be very important even though the premium PASA patients do not have currently an alternative, but it would be very important based on the.",
                    "label": 0
                },
                {
                    "sent": "Evidence from the metabolite levels, or maybe even the CYP 2D6 status, to help them to stick with the drug and to increase their chances of controlling the disease, thanks.",
                    "label": 0
                },
                {
                    "sent": "That's all we have.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much, Hilton.",
                    "label": 0
                }
            ]
        }
    }
}