{
    "id": "3bdtbszl64bwfhrp7gtktvh5w4c3ckif",
    "title": "Measuring science: Fears, challenges and opportunities",
    "info": {
        "author": [
            "Luis A.N. Amaral, University of Lisbon"
        ],
        "published": "Sept. 26, 2008",
        "recorded": "August 2008",
        "category": [
            "Top->Science->Complexity Science"
        ]
    },
    "url": "http://videolectures.net/cvss08_amaral_msfc/",
    "segmentation": [
        [
            "So real pleasure to be here and talking to you, and I'm particularly grateful.",
            "Grateful that you are here at 9:00 AM.",
            "So I hope this is somewhat entertaining this early in the morning.",
            "It's it's not going to be very technical.",
            "I will also try to be a little bit polemic, so feel free to interrupt and complain and disagree.",
            "Other thing is that not all the results that I'm going to present are published, so some of it is still work in progress so.",
            "Of the results that are still in progress, yes, you are and you are allowed to make fun of the mistakes in interpretation or analysis of the results that are still in progress.",
            "So that way it will become much more interesting.",
            "So let me start to tell you why I'm interested in this topic of measuring science.",
            "The reason I'm interested is that I mean, we all know this doing science is doing creative work.",
            "Like all creative work, there is the act of creation and there is the the wish to communicate that that we created to others.",
            "There is this attitude that this is creation is a mysterious thing and it should not be quantified.",
            "It should not be analyzed in sort of a scientific way.",
            "Many people are very strong."
        ],
        [
            "Reverse of that, I am not.",
            "I think that it's important to try to quantify, analyze, model what's going on so we actually can understand what are the correct ristic's of people, environments that actually lead to more creative work.",
            "I think it's clear that critical mass is an important factor.",
            "We also know that it's actually.",
            "Really hard to create something tremendously new and innovative in sort of isolation.",
            "The physicists will certainly know the quote from Einstein that he actually wanted to leave in light house away from everybody and just thinking.",
            "But if you think about it, a lot of work and a lot of what he did was actually due to talking with other people.",
            "So it's not clear that if he had lived.",
            "Always life in a lighthouse isolated from the rest of the world.",
            "You would have created as much as he did.",
            "So there are many interesting questions.",
            "Many things that it would be nice to analyze comprehend.",
            "So then we actually can do a better job.",
            "We all would like to be better creators, so if we understand the conditions that lead to greater creativity, maybe that will help us all.",
            "So that is the main motivation.",
            "But so as I said, it's do we measure?",
            "Or do we not measure?",
            "The first question is is when these are distinct measurable?",
            "I mean measure of all in a meaningful way.",
            "And.",
            "I be measured with sort of a single number.",
            "Or do we need sort of a range of quantities and a good quantification can only be given by that sort of set of measures?",
            "And then what is also very important is do the values of any of these measures have kind of characteristic values?",
            "And this is not such an important question, right?",
            "I mean.",
            "Bomb.",
            "If we ask, is someone tall or not?",
            "Facts are relatively straightforward question right?",
            "If you pick up a population, very likely the distribution of Heights is going to be Gaussian, so you know what the mean is.",
            "You know what the standard deviation is, so you can say this person is 2 standard deviation taller than the mean.",
            "So yeah, that's pretty tall.",
            "Or this person is within one standard deviation of the mean.",
            "But if you think about financial wealth.",
            "That's harder, right?",
            "I mean, yeah, I mean we all agree.",
            "Agree that Bill Gates is wealthy, right?",
            "Am I wealthy or not?",
            "Depends if you are comparing me with all the peasants in India.",
            "I'm extremely wealthy.",
            "Right, but it's like saying if we're talking about Heights, it's like someone is walking around that is 1 kilometer tall.",
            "And then there are most of us that are about.",
            "A meter 80 or something like that.",
            "And then there are all these little dwarfs that are 1 centimeter going around, right?",
            "There is no characteristic scale really.",
            "Thinking of what is good, what is bad is very hard.",
            "So the question of there being characteristic scales or not is extremely important."
        ],
        [
            "So.",
            "I said, do we measure or do we not measure?",
            "Fortunately there are a lot of people that have answered the question.",
            "In the positive we are going to measure and they started to propose quantities that could be calculated for papers for scientific papers.",
            "And here there are just a few of those and also that could be defined for scientists for producers of those papers.",
            "How many of you are familiar with?",
            "Page ranking, h-index, and that sort of stuff?",
            "OK.",
            "There is no purpose to this question except to make sure that some of you at least are awake and can still find enough energy to raise the arm.",
            "OK, so so there are all these measures and we actually think that we know a bunch of things about the properties of these measures in different groups and populations.",
            "So one thing that is.",
            "Hard to handle is the fact that many of these measures have highly skewed distributions, so in a sense they resemble the wealth distribution which raises the problem of what does it mean to be good or what does it mean to be average?",
            "What does it mean to be bad?",
            "And it goes everywhere.",
            "I mean, this one came as a shock to me when I found out that I always thought that paper site between 30 or 100 other papers and I thought, OK, maybe a review will have a few hundreds of references.",
            "Actually there are some papers out there that have over 20,000 references.",
            "I cannot imagine why, but it's true."
        ],
        [
            "Then there is also the case of the distribution of number of citations that is set to decay as a power law.",
            "I will not go into that, but.",
            "But some interesting facts just to give you an idea of what's going on with the number of citations.",
            "So if you look at papers from a long time ago, so papers that mostly many of them have stopped receiving any citations, 30% of them have not received any citations and are not going to receive any citations.",
            "And this is true of essentially every paper published every year.",
            "OK. Now the median number of citations.",
            "That is 50% of the papers.",
            "There are fewer than that and 50% higher of papers that have been out there for long enough that the rate at which they are accumulating new citations as essentially gone to zero is 5.",
            "OK.",
            "The mean is small."
        ],
        [
            "Planter the highest cited paper in this particular database called Web of Science as 200,000 citations.",
            "It's an assay biochemistry assay.",
            "And just to give you an idea, does anyone here is familiar with George Whitesides, a chemist in in?",
            "Harvard.",
            "Yes, an h-index of 140 something.",
            "OK.",
            "So yes, many papers with thousands of citations is total number of citations for the career for all these papers is about 80,000.",
            "There is a paper out there that has received 200,000 citations.",
            "How the heck does this effort and what does this mean?",
            "These are these paper 40,000 times better than the median paper published.",
            "All of these are interesting questions.",
            "I think.",
            "That number of publications is also quite skewed, not as extreme as some of the other ones, but but still there are people that publish thousands of papers.",
            "Now, one thing that is sort of interesting and reassuring is that many of these measures that you can define.",
            "For instance for researchers or organizations, tend to be highly correlated.",
            "So the number of papers tends to correlate with the total number of citations and to correlate with the H-index.",
            "So it's not like.",
            "Yet people always say, oh, I mean, all of those things.",
            "None of those things work because I know of that one person that has published one paper and the paper has 2000 citations, and so the h-index is 1.",
            "But the person is a paper with 2000 citation.",
            "Yes, there is one example out there.",
            "There are a few, but for most people.",
            "These things are actually very strongly correlated.",
            "These include self citations.",
            "Now, doing analysis on researchers are organizations is actually ardler than doing research on individuals and I should move away from the edge.",
            "Otherwise you guys will be extremely amused 'cause I will fall and.",
            "Do my Charlie Chaplin impersonation but.",
            "So there are some difficulties.",
            "Becausw length of career will affect the results if you just started your papers were published recently, so they haven't had time to accumulate citations, so some of those things are going to be different.",
            "A lot of these results are done for successful researcher researchers that have been around for long enough 'cause you don't want to do some of the checks that you have to do for hundreds of thousands of researchers.",
            "Some of them will have very short careers and there are difficulties like figuring out in these databases who is who.",
            "Some of us have names that are pretty unique, or names and combinations of initials that are pretty.",
            "Unique, some of us don't, and if we don't, all of these analysis becomes much, much harder.",
            "OK. Now.",
            "Why do some people think that measuring is bad?",
            "Well, I think."
        ],
        [
            "It's human to feel afraid to be measured right, sort of if I will calculate some quantity on myself on my research productivity there is bound to be someone that has done much better than me.",
            "So am I going to feel embarrassed about that right?",
            "It's natural.",
            "We would always like to be, and it's very human to think that I'm better than what those measures say, or that there is this paper of mine that has only received three citations, but I think should have received the 1000.",
            "Right and end it all of us.",
            "You know, I think of papers as children when they are born.",
            "They are just beautiful, but they are so great.",
            "I all, I think that all of them should be doing astonishingly well and then so when they do, they don't.",
            "So there is that fear of of measuring of things.",
            "Don't turning out to be as good as we wish our hope they would be, but there is also there is also even the question of some people say, well, you cannot measure because what you are measuring is not meaningful.",
            "How are we going to measure something about the paper paper for instance?",
            "Or a researcher does not have an intrinsic quality?",
            "Well, there have been some and you could ask say the same thing about papers or about grant proposals.",
            "But there have been some studies that suggest that actually, if you have a group of people reading with some level of expertise reading a paper, there is sort of a central tendency to the evaluation that they do off the paper.",
            "Now this is very different of the decision of publish or not to publish on a given Journal.",
            "Because that includes more components.",
            "When you are deciding if a paper deserves to be published on on a given Journal, there are two things that are.",
            "Interacting one of them is your evaluation of your paper.",
            "Of the paper and another one is what you believe is that threshold for publication in the Journal.",
            "Right, so you need to know is this paper good enough to be published in this particular Journal?",
            "And you need to know how good the paper is so you actually are going to get more variability in decisions about should it be published or not.",
            "Then you are going to get on the if you are just trying to evaluate the intrinsic quality of the paper.",
            "So when when the question is evaluating intrinsic qualities of papers, things are more normally.",
            "More there is more of a convergence with multiple evaluators of the quality of the paper.",
            "Now the problem is that it depends on how.",
            "Accurate, you want to have that evaluation.",
            "So if you have a bunch of reviewers and all of them give a score to a paper, that is the actual quality of the paper plus the reviewer error, and you assume that that error has some standard deviation.",
            "Now, if you want to score.",
            "The papers on some scale, let's say zero to five.",
            "Depending on the precision that you want for that for the estimation of the mean.",
            "You need to have more and more.",
            "Evaluators and the problem is that.",
            "This thing.",
            "There is an expression that you can use of how many evaluators do you need to knowing that the error of the evaluators is Sigma and you want the precision of, let's say, .01.",
            "And if you want to be confident at the 5% level that the difference between the two papers that are very close is actually real.",
            "You would need about 40,000 evaluators.",
            "To distinguish papers at that level.",
            "But if you are happy with saying, oh, this paper is essentially a for that paper, is A5, and so you are not going to make a mistake in papers that are.",
            "Apart, a score of one you only need about four reviewers to do that.",
            "So there is this idea that you actually can score papers consistently and depending on the precision, you actually might not need that many reviewers to distinguish papers that are of relatively distinct qualities."
        ],
        [
            "Now, even if you have that, some people still think that it's not a good idea to make these measurements and.",
            "Peter Lawrence, who is at the University of Cambridge, wrote this article, which was about measuring science.",
            "It was an entire issue in this Journal, Ethics in Science and Environmental Politics, and he says our measurement arm science.",
            "There were a few other papers in that issue.",
            "One was called hidden dangers of a citation culture.",
            "This one was called the Siege of Science about the the wish of measuring all these things.",
            "And to summarize, the argument is to say if you use some of these things, then even Noble prize winners at some point in their career who they have failed to perform according to these things.",
            "Yes, but should we just stop measuring everything because of that?",
            "I mean because some experiments sometimes go wrong.",
            "Should we stop making experiments?",
            "Don't agree with that.",
            "So.",
            "What time?"
        ],
        [
            "Going to try to do is the following.",
            "I'm going to try to assume that papers can be quantified.",
            "Can be scored on that score if you had enough.",
            "Reviewers could be made very accurate.",
            "So the papers have sort of an intrinsic quality and the question is can we define measures to quantify that quality and what does if we can do that?",
            "What do we gain by doing it OK?"
        ],
        [
            "Another thing that I would like to say is that when we are having interdisciplinary research, it's actually.",
            "Good and useful to have measures of quality right?",
            "If you want to collaborate with someone from another field.",
            "I mean, there are some researchers that are not very good and you really do not want to collaborate with them.",
            "Right, if they are in another field, so it would be good to have some measure of avoiding people that would enable to avoid people that are not very good.",
            "It's our people, very offended that I say that some researchers are not very good.",
            "Why?",
            "Would you be offended if I say some people are short?",
            "Shortness.",
            "Yes.",
            "But if I said that I was not going to be friends with you because I thought you were too tall, I think it's been quite a bit.",
            "I didn't say anything about friendship that if you were going to play basketball and I was this short, would you, without knowing anything else about me, would you put me in your team?",
            "But maybe we're not playing well.",
            "Maybe we aren't, and but what I'm trying to say is that I'm trying to find the measure that it will be relevant for the equivalent of playing basketball.",
            "The study of exceptions, but there is general agreement about what science is, what fun should be doing, yeah.",
            "Everything will follow.",
            "Yep.",
            "Like that's cool, OK, and So what I'm trying to do is to provide evidence that it is.",
            "OK, so let me tell you what is that?",
            "Sorry.",
            "Reply."
        ],
        [
            "Ha.",
            "Correct?",
            "85 OK.",
            "The argument that I'm going to use and this is an argument that has been investigated empirically quite broadly, is that.",
            "Something like the number of citations they impact is a good proxy for.",
            "What a set of reviewers would score as the quality of a paper.",
            "So it's there is a strong correlation between the two things.",
            "So good papers get.",
            "Citations not so good papers will not get so many citations, so that is sort of my assumption.",
            "Like anything.",
            "I'm going to argue later that citations as to do with what would be the intrinsic quality of the paper, but we told F to do it a few other things, but I'm going to assume that the largest component.",
            "Is coming from what the intrinsic quality of the paper is.",
            "Burger King night.",
            "By someone who is prominent in the field in from another language I don't know.",
            "I will collaborate with the Chinese anthology.",
            "Yep.",
            "I totally agree.",
            "But you know, I I know there is the issue of yes.",
            "What if other people do not use English?",
            "Well and.",
            "And it's sad.",
            "But right now we have nothing that does really high-quality quick translation, so we need the lingua franca and English right now is, and you could.",
            "Your measurement argument is based on the fact yes.",
            "Ripe.",
            "Yeah, right and and and if the way that I'm thinking about quality of a paper is the quality is the result of a number of things.",
            "And if I would be trying to list them I would go something like this, I would say.",
            "You chose the topic.",
            "The problem that you are doing.",
            "You did the research.",
            "You wrote the paper.",
            "You wrote the description of what you did and you wrote a sort of a motivation and a discussion.",
            "Why other people should care.",
            "Each one of these things could be broken in a number of other things, but you could imagine that the quality of the paper is the sum of what you did in each one of these things.",
            "If you are having a lot of trouble in doing this last part because you are not so fluent in English, yeah, you are screwed.",
            "I'm sorry, but what am I going to do?",
            "Am I going to learn Chinese also to be able to read that paper or that author?",
            "It's I mean at some point is a reality of life so so mostly?",
            "You have to learn Chinese when you have a critical mass of yes and those things happen right?",
            "I mean, in physics, German used to be the language.",
            "Right and then after Second World War it became English.",
            "So it's not like things are frozen in a certain place.",
            "There can be events that lead to a change.",
            "Oh wow.",
            "OK, so this is the data that I looked at.",
            "I looked at the data from web of science.",
            "There were about 20 million scientific papers published between 95 and 2006.",
            "Many journals, many researchers.",
            "I also did some analysis related to.",
            "Faculty in certain departments, and this was to try to move beyond papers and now starting to move towards what's going on with researchers.",
            "I think that looking at papers is easier because you don't have to have difficulties in finding out.",
            "Is this paper by this person or not?",
            "OK."
        ],
        [
            "So."
        ],
        [
            "And this is brings up another problem of that we are facing right now, right?",
            "Web of Science adds about 1,000,000 new papers to the database every year.",
            "Even within each of our own.",
            "Research areas there are maybe several thousand papers published a year.",
            "If we would be reading them all, we would not be doing anything else.",
            "Right, so we have to choose how much time we spend reading, how much time we spend doing.",
            "So we would want to read.",
            "As little as possible, unlearn as much as possible.",
            "Right, so the question is, how are you going to identify what to read?",
            "Well, there are many strategies right?",
            "You could assume that there are good journals and you are going to read preferentially papers published in those journals.",
            "You could assume that there are good researchers and you are preferentially going to read from those researchers.",
            "You could also talk with other people and find out what they thought was good.",
            "Or you can wait a little longer and start seeing what is being cited by someone else.",
            "So there are many different strategies that you could use and we all use them.",
            "I.",
            "And maybe I'm wrong.",
            "Is there anyone here that actually tries to read everything in their field?",
            "Not mentioning basically.",
            "One other side actually.",
            "Brief papers which are cited.",
            "You're able to buy food.",
            "Yes yes, no things started to be that way.",
            "To find out what is getting cited.",
            "What should I go and read?",
            "But but see that is always.",
            "Retrospective, right?",
            "You have two if you want to be more confident, you have to wait longer to for things to have accumulated more citations to be.",
            "For you to be sure that this is something that you want to read, but at the same time if you wait very long sort of starts being old news, so that's why you need to develop other istics and that's why some of these risks might be, and there could be some other.",
            "I'm just giving an example some things that could be so you see that there are some idea here that there are good journals that there are good authors when you do something like this."
        ],
        [
            "OK, now one of the.",
            "Indexes that essentially came up to try to rank journals and say this is a good Journal.",
            "This is a bad Journal was the Journal Impact Factor.",
            "OK, now my personal feelings about the Journal Impact Factor is that it's crap, but it's not totally crap and it's because it's not totally crapped that actually, even though we all complain, we still pay attention to it and everybody pays attention to it.",
            "But if we understand better about outings work, we probably could do better than we.",
            "They Journal.",
            "Impact factor does.",
            "OK, so.",
            "So what I did, what we did was we looked at journals OK so we are trying to look at this first touristic.",
            "We want to read from good journals.",
            "So the question is, do good journals exist?",
            "Can we rank journals?",
            "And if we rank journals, this the ranking serve any useful predictive purpose.",
            "OK. Now."
        ],
        [
            "How?",
            "This is data for the Journal of Biological Chemistry and what is being shown here is the log 10 of the number of citations.",
            "For papers that were published in this Journal in a given year, each curve is a different here.",
            "So the dark black solid line is papers published in 2004 and this is the distribution of the log 10 of number of citations by the end of 2006, and what you can see as you move into the past.",
            "This distribution is moving towards the.",
            "Well, the right OK so and.",
            "The solid blue line is papers published in 1998.",
            "OK, now there are a few interesting things.",
            "If you.",
            "What what kind of distribution form do you think those curves have?",
            "Oh, come on.",
            "Ha.",
            "Yeah, but it's it's nice caption, isn't it?",
            "Nice thing about Gaussians is that it puts us back to where we were talking about Heights right of a mean being meaningful, standard deviations being meaningful and so actually being able to say oh this is in the top 2% and I know how many standard deviations that are from the mean actual distribution of number of citations is not like that 'cause that is log normal, but the distribution of the logarithm of the number of citations is Gaussian.",
            "Now you can see that it's moving.",
            "But, and that is 1998.",
            "And then it's after 1998.",
            "There are many, many, many curves in there.",
            "And that dashed black line is the same dashed black line that is in there.",
            "So it does converge.",
            "So if you wait long enough, the distribution of the log of number of citations as converge to a steady state.",
            "For that Journal, that thing is pretty stable.",
            "OK. Now this is at least intriguing, right?",
            "Now this is."
        ],
        [
            "It's true not only for that Journal that is true pretty much.",
            "For.",
            "90% of the journals in in the database.",
            "And what I'm showing here is the the mean of the logarithm.",
            "Of the number of citations for papers that have more than zero citations for.",
            "Different tiers for articles published in different tiers in different journals and what you can see is that.",
            "So for instance, this one is for the Astrophysical Journal.",
            "You can see that after a while there is a region in which that mean and the bars are the standard deviation of the of the distribution becomes very stable.",
            "Actually.",
            "You can do more than that.",
            "'cause that's just the mean.",
            "You actually can look at the distributions and you can use the Kolmogorov Smirnov test.",
            "To see if you can reject the null hypothesis that the samples.",
            "Pipes published in different years come from the same distribution or not, and so this is the P value of the Kolmogorov Smirnov statistic.",
            "And these are the distributions in there, and what you can see is that there are these regions in which to good approximation that you cannot reject the hypothesis that the distributions are the same.",
            "So it's not that only that they look the same.",
            "In here you can apply a statistical test and.",
            "To a good degree."
        ],
        [
            "You cannot reject that they are drawn from the same distribution, so things really go too astray."
        ],
        [
            "Able place now what is also interesting is that you can see that different journals end up in different places.",
            "OK. What means that if you publish the if a paper was published in a Journal and you wait long enough?",
            "You know what the distribution of the number of citations of that paper is going to be.",
            "You can predict and that is pretty much independent of when the paper was published.",
            "So.",
            "The Journal in which.",
            "A paper was published.",
            "Is a good indicator.",
            "Of what the number of ultimate number of citations of that paper is going to be?",
            "So it's reproducible.",
            "Right?",
            "If it was an experiment, it was a reproducible experiment."
        ],
        [
            "So how can we understand this?",
            "So the way that we could understand this was.",
            "Trying to make we try to make a statistical model of our data.",
            "Now this is not the mechanistic model we don't worry about.",
            "Our paper accumulates citations every year to come up with a certain number of total citations.",
            "We just say this distribution converges to a certain form.",
            "And we are trying to understand what that form is.",
            "OK, so can we find out some statistical model that describes it and so our statistical model as one.",
            "Hidden variable, so there is something that we don't have direct access to.",
            "And then we called it Q.",
            "And that Q is going to determine the the distribution of something that we have access to, which is the number of citations.",
            "And So what we do is we assume that Q as a Gaussian distribution Gaussian.",
            "It will have a certain mean.",
            "It will have a certain standard deviation and now.",
            "Through some model that I'm expressing here, that Q is going to be transformed into a number of citations.",
            "OK, and so.",
            "Q is a continuum variable an is an integer variable.",
            "And so our model is the following.",
            "The number of citations is going to be the maximum of 0 or the floor of exponential of cube minus gamma.",
            "Actually, I should have written that this 10 to the Q just.",
            "That should have been 10 to the Q cause the.",
            "Of course if I use exponential or or power 10, it's going to be different.",
            "That the mean value, and then we say minus some gamma and the minus game is that well, we have to decide if we are going to put floor or ceiling, that is it the.",
            "Smallest integer larger than the number?",
            "Or is it the largest integer smaller than the real number?",
            "But so we can handle that by putting a game in there.",
            "But basically the idea is that if you have a normal distribution of queues, depending on the value of Q, if your Q false linear, you are going to get ends zero citations if it falls in here it's going to get one citation.",
            "If your Q falls in there, it's going to have one citation.",
            "Or two, and so you actually can.",
            "If this is normally distributed, you can calculate the area that falls inside each one of those bins, and you can predict how many papers are going to have a given number of citations.",
            "OK, so you can now try to find out what the value of.",
            "The mean and the standard deviation of Q is for the articles published in any Journal."
        ],
        [
            "Now.",
            "What we did is the following.",
            "We did a minimization of the Chi square statistics so we had to be in the data and we defined the bins in such a way that our expectation would be to have about 10 papers within each of those beings.",
            "There's just a technical detail, so this is the estimate of Sigma, so the standard deviation of Q as a function of the.",
            "Mean logarithm of the number of citations and you can see that it's a cloud, but Sigma is more or less constant for all the journals gamma is going is raising growing exponentially with mu.",
            "So there is a relatively straightforward relation between them, but now if we have found out what the value of Sigma is and we can relate, we can find out what the value of mu is.",
            "We actually can calculate, for instance, the moments of the distribution of something that is integer and compare it with the prediction of our."
        ],
        [
            "Other would be and the red curve is the prediction, so this is the fraction of papers with zero citations.",
            "Depending on the average of the logarithm of the number of citations of papers that have more.",
            "They have at least one citation and you can see that distinct."
        ],
        [
            "This is the skewness.",
            "This is the excess kurtosis and you can see that.",
            "Each one of those points is 1 Journal.",
            "And there are about 8000 points in there.",
            "Run.",
            "Seems to work pretty well.",
            "OK."
        ],
        [
            "How much time do I have?",
            "Hours and hours.",
            "So the idea is that we find that the distribution of these cues is normal, but the outcome.",
            "The number of citations is not.",
            "Is not normal, is very broad, but The thing is that actually you can explain.",
            "Distinct by sort of the dynamics of of the process right.",
            "The more citations you have, the more citations you are going to get, so small differences in Q end up being translated in enormous differences in the number of citations.",
            "And that's why you have something that has 200,000 freaking citations out there.",
            "That seems impossible.",
            "OK, so the question is.",
            "What makes up this queue right?",
            "Maybe it's noise, maybe it's.",
            "You could say, well, there is noise.",
            "There is intrinsic quality and there is the Journal effect and you can make different hypothesis.",
            "May be nice dominates, maybe intrinsic quality dominates.",
            "Maybe Journal dominates.",
            "Maybe they are all about the same.",
            "Now there has been."
        ],
        [
            "It is very interesting study by someone actually here at Ath, Bornemann and Daniel and what they did is actually they had information about papers that were submitted to.",
            "Anger vent to me.",
            "I'm probably murdering the name of the Journal, but you'll forgive me and so essentially they are.",
            "The information about the papers that were submitted.",
            "They knew which ones were accepted for publication.",
            "They knew which ones were rejected.",
            "They could track down the ones that were rejected where they were published.",
            "OK. And the reason why I think this is very interesting is the following.",
            "OK, so this is for papers that were submitted in 2002.",
            "The Journal.",
            "These were papers that were accepted and published in 2000 and this is the citation count in 2008.",
            "And what you can see is that.",
            "So that's the median there.",
            "That's where the 1/4 quantile.",
            "The three quarters quantile.",
            "And these were the papers that had been rejected in that Journal, but were published in another Journal.",
            "Of lower quality.",
            "And they define this by saying their impact factor is lower.",
            "We know the impact factor is not perfect, but.",
            "This is what happens with the papers that were rejected by.",
            "By that by Anchorman.",
            "You can see that they have.",
            "Lower citations.",
            "What happened to the papers that were submitted in 2001?",
            "That were accepted and the ones that were rejected.",
            "The ones that accepted behave pretty much the same way.",
            "The ones that were rejected behave.",
            "This pretty much the same way.",
            "Now what is interesting is that.",
            "This.",
            "Distribution of number of citations for the papers that were rejected in anger.",
            "Thank me.",
            "Put those papers.",
            "In a.",
            "Those papers got more citations than other papers that have not been submitted to anger rank me in those other chemistry journals.",
            "So.",
            "That leads me to two things.",
            "That actually the authors were able to identify the intrinsic quality of the paper because they thought that the paper had a chance of being published in anger and Kimi.",
            "And that other people's interpretation of the quality of the paper matched the authors becausw, even though those papers were published in other journals, they end up with more citations than the typical paper published in those other journals.",
            "So what this?",
            "What I?"
        ],
        [
            "I see that is as evidence that."
        ],
        [
            "The number of citations is dominated by the intrinsic quality of the paper."
        ],
        [
            "Now.",
            "As I said, the impact factor raises a lot of problems, and because it's a bad quality quantity, it leads to a lot of misleading ideas.",
            "So people think that papers in physics are more cited than papers in other areas.",
            "They think that.",
            "The typical number of citations is very different in different areas, and if you would be looking at this so these are five journals, these are the periods in which we find the distribution of number of citations is stationary.",
            "And out here is the Journal.",
            "The recent Journal Impact Factor for each one of those journals.",
            "So the impact factor for PRL is 7.",
            "Ecology almost 4.8 American Sociological Review 3.2 econometric at 24 and Alan Mathematic 24.",
            "What do you think is the ranking of the median number of citations of papers published in those journals?",
            "Who wants to make the guess about which Journal will have the highest median?",
            "Huh?",
            "So that's the median 50% of the papers have lower number of citations, 50% have more.",
            "Look at this case.",
            "PRL impact factor.",
            "7 ecology impact factor point 4.8 million 22 million 52.",
            "I used to think that papers in physics got many more citations and papers in ecology.",
            "Those are the top journals in the two fields.",
            "Now.",
            "If you have a lognormal distribution and you have many more papers published in physics, then you have in ecology.",
            "Your extreme out there is going to get a huge number of citations, so the most cited paper in physics every year has more citations than the most cited paper in.",
            "In ecology.",
            "But that's not about.",
            "Typical, and so the mu, the average queue of the papers published in those journals are actually not so different.",
            "So actually number of citations of papers.",
            "Are not so different if you wait long enough in different disciplines.",
            "And so this is the problem of the Journal impact factor.",
            "It's that it gives credit to."
        ],
        [
            "Speed of publication Becausw in Physics people published can get the paper published very quickly after submitting.",
            "It starts accumulating citations very fast.",
            "Which doesn't happen in economics or math, right?",
            "So you get this idea that papers in economics are not going to be cited at all.",
            "No, they are.",
            "It's just that the impact factor is getting it wrong.",
            "And actually this is about mental things.",
            "And I'm not talking too much and I'm not going to have time to get to anything but.",
            "There is some time and this idea that, oh physicists, we are doing really cool stuff because our stuff is so highly cited and things in other disciplines aren't.",
            "The human brain works in weird twice, and it's even if you think you are not doing that you are but and the same thing about medicine, you know the medical doctors we published in these journals in medicine.",
            "We are so good we get so many citations and they think those mathematicians don't know how to do anything.",
            "They never get any citation, right?",
            "And it's crap.",
            "The impact factor essentially makes journals and in medicine and physics to be overrated by the impact factor.",
            "And makes journals in a bunch of other fields being underrated.",
            "People have this idea that the papers there get much less citations.",
            "OK, now what I'm going to show is that you actually can use this ranking to decide."
        ],
        [
            "What to read?"
        ],
        [
            "OK, so the basic idea is the following and I'm going to finish here.",
            "I'm not going to talk about anything else.",
            "Imagine that you have a method to rank journals and you have rank this Journal higher than this other Journal OK?",
            "When is this ranking useful?",
            "The ranking is useful if if you pick a paper from the higher rank Journal at random and you pick a paper from the lower Rank Journal at Random, the one from the higher rank Journal as a higher than 50% probability of being higher quality.",
            "Right?",
            "The higher the probability is that the one from the higher rank Journal is of higher quality, the better ranking is working for you.",
            "OK, everybody on board on this.",
            "If you want, these figures are going to be.",
            "Completely senseless.",
            "OK.",
            "I'll assume so.",
            "What we did is the following.",
            "We rank all the journals in a given field and these are two fields, experimental psychology and ecology.",
            "Actually, if you go to the PLOS Website and download the our supplementary material, you can see these figures.",
            "For.",
            "300 fields OK. You actually can see the feeds of the data for the 8000 journals.",
            "So you can go and look at your favorite Journal of your least favorite Journal.",
            "You can look everything.",
            "So green means that what you would want is happening.",
            "That"
        ],
        [
            "When you pick from the highest ranked Journal, the probability of the paper having eventually more citations is higher.",
            "This is what happens when you order things according to the Journal Impact Factor.",
            "You have lots of things that are not red.",
            "So you have lots of things in which actually it would be wiser to read from the lowest rank Journal.",
            "Try.",
            "This is what happens when you use the average cue from the distribution that we estimate.",
            "If you compare the top Journal with the bottom one.",
            "The chance of picking up a paper from the bottom ranked Journal that has more citations than one from the top ranked Journal is less than 5%.",
            "You can see that this essentially accept here one and two in which.",
            "They are pretty much indistinguishable.",
            "Everything else is.",
            "You have a better chance of reading a better paper from the higher ranked Journal."
        ],
        [
            "This is what you get.",
            "You actually can use something that is the optimal ranking and you could get rid of that issue, but that value of Q is essentially providing you an accurate and useful ranking because it tells you that the papers in those journals have a higher probability of end up being more cited, which you can understand.",
            "This then having higher quality.",
            "So.",
            "I talk too much.",
            "I didn't finish what I wanted to do.",
            "I will be happy to answer any questions and I thank you very much for your attention and for the questions and comments."
        ],
        [
            "So I would like to make.",
            "There's something going on with the kind of copying process, so we're not even certain care.",
            "You don't sign that Journal.",
            "There."
        ],
        [
            "They might be.",
            "I'm sending out a general which only has 50 references.",
            "Then insert fraction of them have to be to that Journal.",
            "That would give a kind of copying process.",
            "But the copying is about.",
            "The Journal and.",
            "Journal.",
            "The number but The thing is that even if you have to cite from a given Journal right, you can cite from any place in the past, so the availability that the actual number of papers that you could be citing these very large and.",
            "Distributing a few more citations to each one of those.",
            "Papers if you are not actually citing papers that are actually the relevant ones, and that you think are the good ones, wouldn't.",
            "Pull up everything.",
            "Papers.",
            "Recently I.",
            "It is not true and it has become less through with the advent of the web actually.",
            "People have been able to sight farther back in the past, 'cause it's actually easier to find the references.",
            "Right now.",
            "You can very easily.",
            "Instead of going to the library and look at, you actually can very quickly find out things.",
            "No.",
            "That is, yeah.",
            "But we had a discussion over that with email, 'cause I actually they wrote a news piece and they asked my opinion about it and I said that I didn't.",
            "I think that it was true and and he said, well, this is actually an effect that goes against what is actually the average trend, and all of them, so it's.",
            "Classic wow, interesting.",
            "Decatur Public 1st paper by publications.",
            "In my Journal.",
            "Cool science metrics.",
            "Birthday.",
            "Argue that simply applying these kinds of analysis.",
            "But Ramada.",
            "What is that?",
            "It's interesting to me that.",
            "You makes me feel better.",
            "Yeah.",
            "Work on measuring time.",
            "Because.",
            "Is actually.",
            "I know.",
            "Second point was to send it well at one stage support.",
            "What, why should it matter at Washington?",
            "I'm the kind of answer you gave was, but it will help us to identify good scientists and good papers, but I think they also didn't remember this, so other uses for this.",
            "UK.",
            "After we got these kinds.",
            "For assessing the quality falls in place of Department, and.",
            "Find metal people killing.",
            "Yeah.",
            "It's also.",
            "Am I going to go and I think therefore there is a lot of policy and professional classical infected with this word, so we need special counsel requesting help.",
            "So let me ask you a question.",
            "Do you think that someone because they got the PHD's the right to a lifetime long job regardless of what they do?",
            "Cause for instance, that was what was happening in Portugal when I was there.",
            "There were all these people that haven't been doing anything and so shouldn't you know?",
            "In almost any karere, people are actually asked are you performing?",
            "Are you doing something that has a certain quality?",
            "So should we not somehow measure what scientists are doing?",
            "Should we be exempt of those measurements?",
            "'cause 'cause then it's.",
            "We should not.",
            "Measure funded quality and indeed I happen to be a member of the UK Research Assessment Exercise.",
            "Reading.",
            "Physiology.",
            "Really hard work.",
            "Fire.",
            "What I am saying is that if we are.",
            "Devising quantitative and plan as well, mechanical and automatic measures.",
            "Reportedly.",
            "We also do that with a great deal of parent caution and awareness of the consequences.",
            "That's not right.",
            "No, what?",
            "Why is it slightly different?",
            "I mean what I'm saying is that.",
            "We OK you can you can take one of two attitudes right?",
            "You can say, well we should not be doing this measurement 'cause some that exist are not so good and they are being used and they can have bad consequences right?",
            "And I agree with that.",
            "I mean I actually think that.",
            "One of my points is that there is a lot of relevance giving to the Journal impact factor and the Journal Impact Factor has a lot of problems and issues right?",
            "And I mean what the problems and issues that we find match a lot of.",
            "Essentially what had been set for the longest time, right?",
            "I mean, we didn't even look into the stuff of the language, but you know all of those issues are well known.",
            "Now what we ask this, can we do something that is better and you know it's sort of?",
            "By doing extremely systematic analysis, and I think there has been no analysis at the same level of magnitude that we did in here.",
            "Right, I mean I do not know of any analysis of this magnitude.",
            "And I don't."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So real pleasure to be here and talking to you, and I'm particularly grateful.",
                    "label": 0
                },
                {
                    "sent": "Grateful that you are here at 9:00 AM.",
                    "label": 0
                },
                {
                    "sent": "So I hope this is somewhat entertaining this early in the morning.",
                    "label": 1
                },
                {
                    "sent": "It's it's not going to be very technical.",
                    "label": 0
                },
                {
                    "sent": "I will also try to be a little bit polemic, so feel free to interrupt and complain and disagree.",
                    "label": 0
                },
                {
                    "sent": "Other thing is that not all the results that I'm going to present are published, so some of it is still work in progress so.",
                    "label": 0
                },
                {
                    "sent": "Of the results that are still in progress, yes, you are and you are allowed to make fun of the mistakes in interpretation or analysis of the results that are still in progress.",
                    "label": 0
                },
                {
                    "sent": "So that way it will become much more interesting.",
                    "label": 1
                },
                {
                    "sent": "So let me start to tell you why I'm interested in this topic of measuring science.",
                    "label": 0
                },
                {
                    "sent": "The reason I'm interested is that I mean, we all know this doing science is doing creative work.",
                    "label": 0
                },
                {
                    "sent": "Like all creative work, there is the act of creation and there is the the wish to communicate that that we created to others.",
                    "label": 0
                },
                {
                    "sent": "There is this attitude that this is creation is a mysterious thing and it should not be quantified.",
                    "label": 0
                },
                {
                    "sent": "It should not be analyzed in sort of a scientific way.",
                    "label": 0
                },
                {
                    "sent": "Many people are very strong.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Reverse of that, I am not.",
                    "label": 0
                },
                {
                    "sent": "I think that it's important to try to quantify, analyze, model what's going on so we actually can understand what are the correct ristic's of people, environments that actually lead to more creative work.",
                    "label": 0
                },
                {
                    "sent": "I think it's clear that critical mass is an important factor.",
                    "label": 0
                },
                {
                    "sent": "We also know that it's actually.",
                    "label": 0
                },
                {
                    "sent": "Really hard to create something tremendously new and innovative in sort of isolation.",
                    "label": 0
                },
                {
                    "sent": "The physicists will certainly know the quote from Einstein that he actually wanted to leave in light house away from everybody and just thinking.",
                    "label": 0
                },
                {
                    "sent": "But if you think about it, a lot of work and a lot of what he did was actually due to talking with other people.",
                    "label": 0
                },
                {
                    "sent": "So it's not clear that if he had lived.",
                    "label": 0
                },
                {
                    "sent": "Always life in a lighthouse isolated from the rest of the world.",
                    "label": 0
                },
                {
                    "sent": "You would have created as much as he did.",
                    "label": 0
                },
                {
                    "sent": "So there are many interesting questions.",
                    "label": 0
                },
                {
                    "sent": "Many things that it would be nice to analyze comprehend.",
                    "label": 0
                },
                {
                    "sent": "So then we actually can do a better job.",
                    "label": 0
                },
                {
                    "sent": "We all would like to be better creators, so if we understand the conditions that lead to greater creativity, maybe that will help us all.",
                    "label": 0
                },
                {
                    "sent": "So that is the main motivation.",
                    "label": 0
                },
                {
                    "sent": "But so as I said, it's do we measure?",
                    "label": 0
                },
                {
                    "sent": "Or do we not measure?",
                    "label": 1
                },
                {
                    "sent": "The first question is is when these are distinct measurable?",
                    "label": 0
                },
                {
                    "sent": "I mean measure of all in a meaningful way.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "I be measured with sort of a single number.",
                    "label": 1
                },
                {
                    "sent": "Or do we need sort of a range of quantities and a good quantification can only be given by that sort of set of measures?",
                    "label": 0
                },
                {
                    "sent": "And then what is also very important is do the values of any of these measures have kind of characteristic values?",
                    "label": 0
                },
                {
                    "sent": "And this is not such an important question, right?",
                    "label": 0
                },
                {
                    "sent": "I mean.",
                    "label": 0
                },
                {
                    "sent": "Bomb.",
                    "label": 0
                },
                {
                    "sent": "If we ask, is someone tall or not?",
                    "label": 0
                },
                {
                    "sent": "Facts are relatively straightforward question right?",
                    "label": 0
                },
                {
                    "sent": "If you pick up a population, very likely the distribution of Heights is going to be Gaussian, so you know what the mean is.",
                    "label": 0
                },
                {
                    "sent": "You know what the standard deviation is, so you can say this person is 2 standard deviation taller than the mean.",
                    "label": 0
                },
                {
                    "sent": "So yeah, that's pretty tall.",
                    "label": 0
                },
                {
                    "sent": "Or this person is within one standard deviation of the mean.",
                    "label": 0
                },
                {
                    "sent": "But if you think about financial wealth.",
                    "label": 0
                },
                {
                    "sent": "That's harder, right?",
                    "label": 0
                },
                {
                    "sent": "I mean, yeah, I mean we all agree.",
                    "label": 0
                },
                {
                    "sent": "Agree that Bill Gates is wealthy, right?",
                    "label": 0
                },
                {
                    "sent": "Am I wealthy or not?",
                    "label": 0
                },
                {
                    "sent": "Depends if you are comparing me with all the peasants in India.",
                    "label": 0
                },
                {
                    "sent": "I'm extremely wealthy.",
                    "label": 0
                },
                {
                    "sent": "Right, but it's like saying if we're talking about Heights, it's like someone is walking around that is 1 kilometer tall.",
                    "label": 0
                },
                {
                    "sent": "And then there are most of us that are about.",
                    "label": 0
                },
                {
                    "sent": "A meter 80 or something like that.",
                    "label": 0
                },
                {
                    "sent": "And then there are all these little dwarfs that are 1 centimeter going around, right?",
                    "label": 0
                },
                {
                    "sent": "There is no characteristic scale really.",
                    "label": 0
                },
                {
                    "sent": "Thinking of what is good, what is bad is very hard.",
                    "label": 0
                },
                {
                    "sent": "So the question of there being characteristic scales or not is extremely important.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I said, do we measure or do we not measure?",
                    "label": 0
                },
                {
                    "sent": "Fortunately there are a lot of people that have answered the question.",
                    "label": 0
                },
                {
                    "sent": "In the positive we are going to measure and they started to propose quantities that could be calculated for papers for scientific papers.",
                    "label": 0
                },
                {
                    "sent": "And here there are just a few of those and also that could be defined for scientists for producers of those papers.",
                    "label": 0
                },
                {
                    "sent": "How many of you are familiar with?",
                    "label": 0
                },
                {
                    "sent": "Page ranking, h-index, and that sort of stuff?",
                    "label": 1
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "There is no purpose to this question except to make sure that some of you at least are awake and can still find enough energy to raise the arm.",
                    "label": 0
                },
                {
                    "sent": "OK, so so there are all these measures and we actually think that we know a bunch of things about the properties of these measures in different groups and populations.",
                    "label": 0
                },
                {
                    "sent": "So one thing that is.",
                    "label": 0
                },
                {
                    "sent": "Hard to handle is the fact that many of these measures have highly skewed distributions, so in a sense they resemble the wealth distribution which raises the problem of what does it mean to be good or what does it mean to be average?",
                    "label": 0
                },
                {
                    "sent": "What does it mean to be bad?",
                    "label": 0
                },
                {
                    "sent": "And it goes everywhere.",
                    "label": 0
                },
                {
                    "sent": "I mean, this one came as a shock to me when I found out that I always thought that paper site between 30 or 100 other papers and I thought, OK, maybe a review will have a few hundreds of references.",
                    "label": 0
                },
                {
                    "sent": "Actually there are some papers out there that have over 20,000 references.",
                    "label": 0
                },
                {
                    "sent": "I cannot imagine why, but it's true.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then there is also the case of the distribution of number of citations that is set to decay as a power law.",
                    "label": 1
                },
                {
                    "sent": "I will not go into that, but.",
                    "label": 0
                },
                {
                    "sent": "But some interesting facts just to give you an idea of what's going on with the number of citations.",
                    "label": 0
                },
                {
                    "sent": "So if you look at papers from a long time ago, so papers that mostly many of them have stopped receiving any citations, 30% of them have not received any citations and are not going to receive any citations.",
                    "label": 0
                },
                {
                    "sent": "And this is true of essentially every paper published every year.",
                    "label": 1
                },
                {
                    "sent": "OK. Now the median number of citations.",
                    "label": 0
                },
                {
                    "sent": "That is 50% of the papers.",
                    "label": 0
                },
                {
                    "sent": "There are fewer than that and 50% higher of papers that have been out there for long enough that the rate at which they are accumulating new citations as essentially gone to zero is 5.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "The mean is small.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Planter the highest cited paper in this particular database called Web of Science as 200,000 citations.",
                    "label": 0
                },
                {
                    "sent": "It's an assay biochemistry assay.",
                    "label": 0
                },
                {
                    "sent": "And just to give you an idea, does anyone here is familiar with George Whitesides, a chemist in in?",
                    "label": 0
                },
                {
                    "sent": "Harvard.",
                    "label": 0
                },
                {
                    "sent": "Yes, an h-index of 140 something.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So yes, many papers with thousands of citations is total number of citations for the career for all these papers is about 80,000.",
                    "label": 0
                },
                {
                    "sent": "There is a paper out there that has received 200,000 citations.",
                    "label": 0
                },
                {
                    "sent": "How the heck does this effort and what does this mean?",
                    "label": 0
                },
                {
                    "sent": "These are these paper 40,000 times better than the median paper published.",
                    "label": 0
                },
                {
                    "sent": "All of these are interesting questions.",
                    "label": 0
                },
                {
                    "sent": "I think.",
                    "label": 0
                },
                {
                    "sent": "That number of publications is also quite skewed, not as extreme as some of the other ones, but but still there are people that publish thousands of papers.",
                    "label": 0
                },
                {
                    "sent": "Now, one thing that is sort of interesting and reassuring is that many of these measures that you can define.",
                    "label": 1
                },
                {
                    "sent": "For instance for researchers or organizations, tend to be highly correlated.",
                    "label": 1
                },
                {
                    "sent": "So the number of papers tends to correlate with the total number of citations and to correlate with the H-index.",
                    "label": 0
                },
                {
                    "sent": "So it's not like.",
                    "label": 0
                },
                {
                    "sent": "Yet people always say, oh, I mean, all of those things.",
                    "label": 1
                },
                {
                    "sent": "None of those things work because I know of that one person that has published one paper and the paper has 2000 citations, and so the h-index is 1.",
                    "label": 0
                },
                {
                    "sent": "But the person is a paper with 2000 citation.",
                    "label": 0
                },
                {
                    "sent": "Yes, there is one example out there.",
                    "label": 1
                },
                {
                    "sent": "There are a few, but for most people.",
                    "label": 0
                },
                {
                    "sent": "These things are actually very strongly correlated.",
                    "label": 0
                },
                {
                    "sent": "These include self citations.",
                    "label": 0
                },
                {
                    "sent": "Now, doing analysis on researchers are organizations is actually ardler than doing research on individuals and I should move away from the edge.",
                    "label": 0
                },
                {
                    "sent": "Otherwise you guys will be extremely amused 'cause I will fall and.",
                    "label": 0
                },
                {
                    "sent": "Do my Charlie Chaplin impersonation but.",
                    "label": 0
                },
                {
                    "sent": "So there are some difficulties.",
                    "label": 0
                },
                {
                    "sent": "Becausw length of career will affect the results if you just started your papers were published recently, so they haven't had time to accumulate citations, so some of those things are going to be different.",
                    "label": 0
                },
                {
                    "sent": "A lot of these results are done for successful researcher researchers that have been around for long enough 'cause you don't want to do some of the checks that you have to do for hundreds of thousands of researchers.",
                    "label": 0
                },
                {
                    "sent": "Some of them will have very short careers and there are difficulties like figuring out in these databases who is who.",
                    "label": 0
                },
                {
                    "sent": "Some of us have names that are pretty unique, or names and combinations of initials that are pretty.",
                    "label": 0
                },
                {
                    "sent": "Unique, some of us don't, and if we don't, all of these analysis becomes much, much harder.",
                    "label": 0
                },
                {
                    "sent": "OK. Now.",
                    "label": 0
                },
                {
                    "sent": "Why do some people think that measuring is bad?",
                    "label": 0
                },
                {
                    "sent": "Well, I think.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's human to feel afraid to be measured right, sort of if I will calculate some quantity on myself on my research productivity there is bound to be someone that has done much better than me.",
                    "label": 0
                },
                {
                    "sent": "So am I going to feel embarrassed about that right?",
                    "label": 0
                },
                {
                    "sent": "It's natural.",
                    "label": 0
                },
                {
                    "sent": "We would always like to be, and it's very human to think that I'm better than what those measures say, or that there is this paper of mine that has only received three citations, but I think should have received the 1000.",
                    "label": 0
                },
                {
                    "sent": "Right and end it all of us.",
                    "label": 0
                },
                {
                    "sent": "You know, I think of papers as children when they are born.",
                    "label": 0
                },
                {
                    "sent": "They are just beautiful, but they are so great.",
                    "label": 0
                },
                {
                    "sent": "I all, I think that all of them should be doing astonishingly well and then so when they do, they don't.",
                    "label": 0
                },
                {
                    "sent": "So there is that fear of of measuring of things.",
                    "label": 0
                },
                {
                    "sent": "Don't turning out to be as good as we wish our hope they would be, but there is also there is also even the question of some people say, well, you cannot measure because what you are measuring is not meaningful.",
                    "label": 0
                },
                {
                    "sent": "How are we going to measure something about the paper paper for instance?",
                    "label": 0
                },
                {
                    "sent": "Or a researcher does not have an intrinsic quality?",
                    "label": 1
                },
                {
                    "sent": "Well, there have been some and you could ask say the same thing about papers or about grant proposals.",
                    "label": 0
                },
                {
                    "sent": "But there have been some studies that suggest that actually, if you have a group of people reading with some level of expertise reading a paper, there is sort of a central tendency to the evaluation that they do off the paper.",
                    "label": 0
                },
                {
                    "sent": "Now this is very different of the decision of publish or not to publish on a given Journal.",
                    "label": 0
                },
                {
                    "sent": "Because that includes more components.",
                    "label": 0
                },
                {
                    "sent": "When you are deciding if a paper deserves to be published on on a given Journal, there are two things that are.",
                    "label": 0
                },
                {
                    "sent": "Interacting one of them is your evaluation of your paper.",
                    "label": 0
                },
                {
                    "sent": "Of the paper and another one is what you believe is that threshold for publication in the Journal.",
                    "label": 0
                },
                {
                    "sent": "Right, so you need to know is this paper good enough to be published in this particular Journal?",
                    "label": 0
                },
                {
                    "sent": "And you need to know how good the paper is so you actually are going to get more variability in decisions about should it be published or not.",
                    "label": 0
                },
                {
                    "sent": "Then you are going to get on the if you are just trying to evaluate the intrinsic quality of the paper.",
                    "label": 0
                },
                {
                    "sent": "So when when the question is evaluating intrinsic qualities of papers, things are more normally.",
                    "label": 0
                },
                {
                    "sent": "More there is more of a convergence with multiple evaluators of the quality of the paper.",
                    "label": 0
                },
                {
                    "sent": "Now the problem is that it depends on how.",
                    "label": 0
                },
                {
                    "sent": "Accurate, you want to have that evaluation.",
                    "label": 0
                },
                {
                    "sent": "So if you have a bunch of reviewers and all of them give a score to a paper, that is the actual quality of the paper plus the reviewer error, and you assume that that error has some standard deviation.",
                    "label": 0
                },
                {
                    "sent": "Now, if you want to score.",
                    "label": 0
                },
                {
                    "sent": "The papers on some scale, let's say zero to five.",
                    "label": 0
                },
                {
                    "sent": "Depending on the precision that you want for that for the estimation of the mean.",
                    "label": 0
                },
                {
                    "sent": "You need to have more and more.",
                    "label": 0
                },
                {
                    "sent": "Evaluators and the problem is that.",
                    "label": 0
                },
                {
                    "sent": "This thing.",
                    "label": 0
                },
                {
                    "sent": "There is an expression that you can use of how many evaluators do you need to knowing that the error of the evaluators is Sigma and you want the precision of, let's say, .01.",
                    "label": 0
                },
                {
                    "sent": "And if you want to be confident at the 5% level that the difference between the two papers that are very close is actually real.",
                    "label": 0
                },
                {
                    "sent": "You would need about 40,000 evaluators.",
                    "label": 0
                },
                {
                    "sent": "To distinguish papers at that level.",
                    "label": 0
                },
                {
                    "sent": "But if you are happy with saying, oh, this paper is essentially a for that paper, is A5, and so you are not going to make a mistake in papers that are.",
                    "label": 0
                },
                {
                    "sent": "Apart, a score of one you only need about four reviewers to do that.",
                    "label": 0
                },
                {
                    "sent": "So there is this idea that you actually can score papers consistently and depending on the precision, you actually might not need that many reviewers to distinguish papers that are of relatively distinct qualities.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, even if you have that, some people still think that it's not a good idea to make these measurements and.",
                    "label": 0
                },
                {
                    "sent": "Peter Lawrence, who is at the University of Cambridge, wrote this article, which was about measuring science.",
                    "label": 0
                },
                {
                    "sent": "It was an entire issue in this Journal, Ethics in Science and Environmental Politics, and he says our measurement arm science.",
                    "label": 0
                },
                {
                    "sent": "There were a few other papers in that issue.",
                    "label": 0
                },
                {
                    "sent": "One was called hidden dangers of a citation culture.",
                    "label": 0
                },
                {
                    "sent": "This one was called the Siege of Science about the the wish of measuring all these things.",
                    "label": 0
                },
                {
                    "sent": "And to summarize, the argument is to say if you use some of these things, then even Noble prize winners at some point in their career who they have failed to perform according to these things.",
                    "label": 0
                },
                {
                    "sent": "Yes, but should we just stop measuring everything because of that?",
                    "label": 0
                },
                {
                    "sent": "I mean because some experiments sometimes go wrong.",
                    "label": 0
                },
                {
                    "sent": "Should we stop making experiments?",
                    "label": 0
                },
                {
                    "sent": "Don't agree with that.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What time?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Going to try to do is the following.",
                    "label": 0
                },
                {
                    "sent": "I'm going to try to assume that papers can be quantified.",
                    "label": 1
                },
                {
                    "sent": "Can be scored on that score if you had enough.",
                    "label": 0
                },
                {
                    "sent": "Reviewers could be made very accurate.",
                    "label": 1
                },
                {
                    "sent": "So the papers have sort of an intrinsic quality and the question is can we define measures to quantify that quality and what does if we can do that?",
                    "label": 0
                },
                {
                    "sent": "What do we gain by doing it OK?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another thing that I would like to say is that when we are having interdisciplinary research, it's actually.",
                    "label": 0
                },
                {
                    "sent": "Good and useful to have measures of quality right?",
                    "label": 0
                },
                {
                    "sent": "If you want to collaborate with someone from another field.",
                    "label": 0
                },
                {
                    "sent": "I mean, there are some researchers that are not very good and you really do not want to collaborate with them.",
                    "label": 0
                },
                {
                    "sent": "Right, if they are in another field, so it would be good to have some measure of avoiding people that would enable to avoid people that are not very good.",
                    "label": 0
                },
                {
                    "sent": "It's our people, very offended that I say that some researchers are not very good.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Would you be offended if I say some people are short?",
                    "label": 0
                },
                {
                    "sent": "Shortness.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "But if I said that I was not going to be friends with you because I thought you were too tall, I think it's been quite a bit.",
                    "label": 0
                },
                {
                    "sent": "I didn't say anything about friendship that if you were going to play basketball and I was this short, would you, without knowing anything else about me, would you put me in your team?",
                    "label": 0
                },
                {
                    "sent": "But maybe we're not playing well.",
                    "label": 0
                },
                {
                    "sent": "Maybe we aren't, and but what I'm trying to say is that I'm trying to find the measure that it will be relevant for the equivalent of playing basketball.",
                    "label": 0
                },
                {
                    "sent": "The study of exceptions, but there is general agreement about what science is, what fun should be doing, yeah.",
                    "label": 0
                },
                {
                    "sent": "Everything will follow.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "Like that's cool, OK, and So what I'm trying to do is to provide evidence that it is.",
                    "label": 0
                },
                {
                    "sent": "OK, so let me tell you what is that?",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "Reply.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ha.",
                    "label": 0
                },
                {
                    "sent": "Correct?",
                    "label": 0
                },
                {
                    "sent": "85 OK.",
                    "label": 0
                },
                {
                    "sent": "The argument that I'm going to use and this is an argument that has been investigated empirically quite broadly, is that.",
                    "label": 0
                },
                {
                    "sent": "Something like the number of citations they impact is a good proxy for.",
                    "label": 1
                },
                {
                    "sent": "What a set of reviewers would score as the quality of a paper.",
                    "label": 0
                },
                {
                    "sent": "So it's there is a strong correlation between the two things.",
                    "label": 0
                },
                {
                    "sent": "So good papers get.",
                    "label": 0
                },
                {
                    "sent": "Citations not so good papers will not get so many citations, so that is sort of my assumption.",
                    "label": 0
                },
                {
                    "sent": "Like anything.",
                    "label": 0
                },
                {
                    "sent": "I'm going to argue later that citations as to do with what would be the intrinsic quality of the paper, but we told F to do it a few other things, but I'm going to assume that the largest component.",
                    "label": 0
                },
                {
                    "sent": "Is coming from what the intrinsic quality of the paper is.",
                    "label": 0
                },
                {
                    "sent": "Burger King night.",
                    "label": 0
                },
                {
                    "sent": "By someone who is prominent in the field in from another language I don't know.",
                    "label": 0
                },
                {
                    "sent": "I will collaborate with the Chinese anthology.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "I totally agree.",
                    "label": 0
                },
                {
                    "sent": "But you know, I I know there is the issue of yes.",
                    "label": 0
                },
                {
                    "sent": "What if other people do not use English?",
                    "label": 0
                },
                {
                    "sent": "Well and.",
                    "label": 0
                },
                {
                    "sent": "And it's sad.",
                    "label": 0
                },
                {
                    "sent": "But right now we have nothing that does really high-quality quick translation, so we need the lingua franca and English right now is, and you could.",
                    "label": 0
                },
                {
                    "sent": "Your measurement argument is based on the fact yes.",
                    "label": 0
                },
                {
                    "sent": "Ripe.",
                    "label": 0
                },
                {
                    "sent": "Yeah, right and and and if the way that I'm thinking about quality of a paper is the quality is the result of a number of things.",
                    "label": 0
                },
                {
                    "sent": "And if I would be trying to list them I would go something like this, I would say.",
                    "label": 0
                },
                {
                    "sent": "You chose the topic.",
                    "label": 0
                },
                {
                    "sent": "The problem that you are doing.",
                    "label": 0
                },
                {
                    "sent": "You did the research.",
                    "label": 0
                },
                {
                    "sent": "You wrote the paper.",
                    "label": 0
                },
                {
                    "sent": "You wrote the description of what you did and you wrote a sort of a motivation and a discussion.",
                    "label": 0
                },
                {
                    "sent": "Why other people should care.",
                    "label": 0
                },
                {
                    "sent": "Each one of these things could be broken in a number of other things, but you could imagine that the quality of the paper is the sum of what you did in each one of these things.",
                    "label": 0
                },
                {
                    "sent": "If you are having a lot of trouble in doing this last part because you are not so fluent in English, yeah, you are screwed.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry, but what am I going to do?",
                    "label": 0
                },
                {
                    "sent": "Am I going to learn Chinese also to be able to read that paper or that author?",
                    "label": 0
                },
                {
                    "sent": "It's I mean at some point is a reality of life so so mostly?",
                    "label": 0
                },
                {
                    "sent": "You have to learn Chinese when you have a critical mass of yes and those things happen right?",
                    "label": 0
                },
                {
                    "sent": "I mean, in physics, German used to be the language.",
                    "label": 0
                },
                {
                    "sent": "Right and then after Second World War it became English.",
                    "label": 0
                },
                {
                    "sent": "So it's not like things are frozen in a certain place.",
                    "label": 0
                },
                {
                    "sent": "There can be events that lead to a change.",
                    "label": 0
                },
                {
                    "sent": "Oh wow.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is the data that I looked at.",
                    "label": 0
                },
                {
                    "sent": "I looked at the data from web of science.",
                    "label": 1
                },
                {
                    "sent": "There were about 20 million scientific papers published between 95 and 2006.",
                    "label": 0
                },
                {
                    "sent": "Many journals, many researchers.",
                    "label": 0
                },
                {
                    "sent": "I also did some analysis related to.",
                    "label": 0
                },
                {
                    "sent": "Faculty in certain departments, and this was to try to move beyond papers and now starting to move towards what's going on with researchers.",
                    "label": 0
                },
                {
                    "sent": "I think that looking at papers is easier because you don't have to have difficulties in finding out.",
                    "label": 0
                },
                {
                    "sent": "Is this paper by this person or not?",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is brings up another problem of that we are facing right now, right?",
                    "label": 0
                },
                {
                    "sent": "Web of Science adds about 1,000,000 new papers to the database every year.",
                    "label": 1
                },
                {
                    "sent": "Even within each of our own.",
                    "label": 0
                },
                {
                    "sent": "Research areas there are maybe several thousand papers published a year.",
                    "label": 0
                },
                {
                    "sent": "If we would be reading them all, we would not be doing anything else.",
                    "label": 0
                },
                {
                    "sent": "Right, so we have to choose how much time we spend reading, how much time we spend doing.",
                    "label": 0
                },
                {
                    "sent": "So we would want to read.",
                    "label": 0
                },
                {
                    "sent": "As little as possible, unlearn as much as possible.",
                    "label": 0
                },
                {
                    "sent": "Right, so the question is, how are you going to identify what to read?",
                    "label": 0
                },
                {
                    "sent": "Well, there are many strategies right?",
                    "label": 0
                },
                {
                    "sent": "You could assume that there are good journals and you are going to read preferentially papers published in those journals.",
                    "label": 1
                },
                {
                    "sent": "You could assume that there are good researchers and you are preferentially going to read from those researchers.",
                    "label": 0
                },
                {
                    "sent": "You could also talk with other people and find out what they thought was good.",
                    "label": 0
                },
                {
                    "sent": "Or you can wait a little longer and start seeing what is being cited by someone else.",
                    "label": 0
                },
                {
                    "sent": "So there are many different strategies that you could use and we all use them.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "And maybe I'm wrong.",
                    "label": 0
                },
                {
                    "sent": "Is there anyone here that actually tries to read everything in their field?",
                    "label": 0
                },
                {
                    "sent": "Not mentioning basically.",
                    "label": 0
                },
                {
                    "sent": "One other side actually.",
                    "label": 0
                },
                {
                    "sent": "Brief papers which are cited.",
                    "label": 0
                },
                {
                    "sent": "You're able to buy food.",
                    "label": 0
                },
                {
                    "sent": "Yes yes, no things started to be that way.",
                    "label": 0
                },
                {
                    "sent": "To find out what is getting cited.",
                    "label": 0
                },
                {
                    "sent": "What should I go and read?",
                    "label": 0
                },
                {
                    "sent": "But but see that is always.",
                    "label": 0
                },
                {
                    "sent": "Retrospective, right?",
                    "label": 0
                },
                {
                    "sent": "You have two if you want to be more confident, you have to wait longer to for things to have accumulated more citations to be.",
                    "label": 0
                },
                {
                    "sent": "For you to be sure that this is something that you want to read, but at the same time if you wait very long sort of starts being old news, so that's why you need to develop other istics and that's why some of these risks might be, and there could be some other.",
                    "label": 0
                },
                {
                    "sent": "I'm just giving an example some things that could be so you see that there are some idea here that there are good journals that there are good authors when you do something like this.",
                    "label": 1
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, now one of the.",
                    "label": 0
                },
                {
                    "sent": "Indexes that essentially came up to try to rank journals and say this is a good Journal.",
                    "label": 0
                },
                {
                    "sent": "This is a bad Journal was the Journal Impact Factor.",
                    "label": 1
                },
                {
                    "sent": "OK, now my personal feelings about the Journal Impact Factor is that it's crap, but it's not totally crap and it's because it's not totally crapped that actually, even though we all complain, we still pay attention to it and everybody pays attention to it.",
                    "label": 0
                },
                {
                    "sent": "But if we understand better about outings work, we probably could do better than we.",
                    "label": 0
                },
                {
                    "sent": "They Journal.",
                    "label": 0
                },
                {
                    "sent": "Impact factor does.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "So what I did, what we did was we looked at journals OK so we are trying to look at this first touristic.",
                    "label": 0
                },
                {
                    "sent": "We want to read from good journals.",
                    "label": 0
                },
                {
                    "sent": "So the question is, do good journals exist?",
                    "label": 0
                },
                {
                    "sent": "Can we rank journals?",
                    "label": 0
                },
                {
                    "sent": "And if we rank journals, this the ranking serve any useful predictive purpose.",
                    "label": 0
                },
                {
                    "sent": "OK. Now.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How?",
                    "label": 0
                },
                {
                    "sent": "This is data for the Journal of Biological Chemistry and what is being shown here is the log 10 of the number of citations.",
                    "label": 1
                },
                {
                    "sent": "For papers that were published in this Journal in a given year, each curve is a different here.",
                    "label": 0
                },
                {
                    "sent": "So the dark black solid line is papers published in 2004 and this is the distribution of the log 10 of number of citations by the end of 2006, and what you can see as you move into the past.",
                    "label": 0
                },
                {
                    "sent": "This distribution is moving towards the.",
                    "label": 0
                },
                {
                    "sent": "Well, the right OK so and.",
                    "label": 0
                },
                {
                    "sent": "The solid blue line is papers published in 1998.",
                    "label": 0
                },
                {
                    "sent": "OK, now there are a few interesting things.",
                    "label": 0
                },
                {
                    "sent": "If you.",
                    "label": 0
                },
                {
                    "sent": "What what kind of distribution form do you think those curves have?",
                    "label": 0
                },
                {
                    "sent": "Oh, come on.",
                    "label": 0
                },
                {
                    "sent": "Ha.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but it's it's nice caption, isn't it?",
                    "label": 0
                },
                {
                    "sent": "Nice thing about Gaussians is that it puts us back to where we were talking about Heights right of a mean being meaningful, standard deviations being meaningful and so actually being able to say oh this is in the top 2% and I know how many standard deviations that are from the mean actual distribution of number of citations is not like that 'cause that is log normal, but the distribution of the logarithm of the number of citations is Gaussian.",
                    "label": 0
                },
                {
                    "sent": "Now you can see that it's moving.",
                    "label": 0
                },
                {
                    "sent": "But, and that is 1998.",
                    "label": 0
                },
                {
                    "sent": "And then it's after 1998.",
                    "label": 0
                },
                {
                    "sent": "There are many, many, many curves in there.",
                    "label": 0
                },
                {
                    "sent": "And that dashed black line is the same dashed black line that is in there.",
                    "label": 0
                },
                {
                    "sent": "So it does converge.",
                    "label": 0
                },
                {
                    "sent": "So if you wait long enough, the distribution of the log of number of citations as converge to a steady state.",
                    "label": 0
                },
                {
                    "sent": "For that Journal, that thing is pretty stable.",
                    "label": 0
                },
                {
                    "sent": "OK. Now this is at least intriguing, right?",
                    "label": 0
                },
                {
                    "sent": "Now this is.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's true not only for that Journal that is true pretty much.",
                    "label": 0
                },
                {
                    "sent": "For.",
                    "label": 0
                },
                {
                    "sent": "90% of the journals in in the database.",
                    "label": 0
                },
                {
                    "sent": "And what I'm showing here is the the mean of the logarithm.",
                    "label": 0
                },
                {
                    "sent": "Of the number of citations for papers that have more than zero citations for.",
                    "label": 0
                },
                {
                    "sent": "Different tiers for articles published in different tiers in different journals and what you can see is that.",
                    "label": 0
                },
                {
                    "sent": "So for instance, this one is for the Astrophysical Journal.",
                    "label": 0
                },
                {
                    "sent": "You can see that after a while there is a region in which that mean and the bars are the standard deviation of the of the distribution becomes very stable.",
                    "label": 0
                },
                {
                    "sent": "Actually.",
                    "label": 0
                },
                {
                    "sent": "You can do more than that.",
                    "label": 0
                },
                {
                    "sent": "'cause that's just the mean.",
                    "label": 0
                },
                {
                    "sent": "You actually can look at the distributions and you can use the Kolmogorov Smirnov test.",
                    "label": 0
                },
                {
                    "sent": "To see if you can reject the null hypothesis that the samples.",
                    "label": 0
                },
                {
                    "sent": "Pipes published in different years come from the same distribution or not, and so this is the P value of the Kolmogorov Smirnov statistic.",
                    "label": 0
                },
                {
                    "sent": "And these are the distributions in there, and what you can see is that there are these regions in which to good approximation that you cannot reject the hypothesis that the distributions are the same.",
                    "label": 0
                },
                {
                    "sent": "So it's not that only that they look the same.",
                    "label": 0
                },
                {
                    "sent": "In here you can apply a statistical test and.",
                    "label": 0
                },
                {
                    "sent": "To a good degree.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You cannot reject that they are drawn from the same distribution, so things really go too astray.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Able place now what is also interesting is that you can see that different journals end up in different places.",
                    "label": 0
                },
                {
                    "sent": "OK. What means that if you publish the if a paper was published in a Journal and you wait long enough?",
                    "label": 0
                },
                {
                    "sent": "You know what the distribution of the number of citations of that paper is going to be.",
                    "label": 0
                },
                {
                    "sent": "You can predict and that is pretty much independent of when the paper was published.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The Journal in which.",
                    "label": 0
                },
                {
                    "sent": "A paper was published.",
                    "label": 0
                },
                {
                    "sent": "Is a good indicator.",
                    "label": 0
                },
                {
                    "sent": "Of what the number of ultimate number of citations of that paper is going to be?",
                    "label": 0
                },
                {
                    "sent": "So it's reproducible.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "If it was an experiment, it was a reproducible experiment.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So how can we understand this?",
                    "label": 0
                },
                {
                    "sent": "So the way that we could understand this was.",
                    "label": 0
                },
                {
                    "sent": "Trying to make we try to make a statistical model of our data.",
                    "label": 0
                },
                {
                    "sent": "Now this is not the mechanistic model we don't worry about.",
                    "label": 0
                },
                {
                    "sent": "Our paper accumulates citations every year to come up with a certain number of total citations.",
                    "label": 0
                },
                {
                    "sent": "We just say this distribution converges to a certain form.",
                    "label": 0
                },
                {
                    "sent": "And we are trying to understand what that form is.",
                    "label": 0
                },
                {
                    "sent": "OK, so can we find out some statistical model that describes it and so our statistical model as one.",
                    "label": 0
                },
                {
                    "sent": "Hidden variable, so there is something that we don't have direct access to.",
                    "label": 0
                },
                {
                    "sent": "And then we called it Q.",
                    "label": 0
                },
                {
                    "sent": "And that Q is going to determine the the distribution of something that we have access to, which is the number of citations.",
                    "label": 0
                },
                {
                    "sent": "And So what we do is we assume that Q as a Gaussian distribution Gaussian.",
                    "label": 0
                },
                {
                    "sent": "It will have a certain mean.",
                    "label": 0
                },
                {
                    "sent": "It will have a certain standard deviation and now.",
                    "label": 0
                },
                {
                    "sent": "Through some model that I'm expressing here, that Q is going to be transformed into a number of citations.",
                    "label": 0
                },
                {
                    "sent": "OK, and so.",
                    "label": 0
                },
                {
                    "sent": "Q is a continuum variable an is an integer variable.",
                    "label": 0
                },
                {
                    "sent": "And so our model is the following.",
                    "label": 0
                },
                {
                    "sent": "The number of citations is going to be the maximum of 0 or the floor of exponential of cube minus gamma.",
                    "label": 0
                },
                {
                    "sent": "Actually, I should have written that this 10 to the Q just.",
                    "label": 0
                },
                {
                    "sent": "That should have been 10 to the Q cause the.",
                    "label": 0
                },
                {
                    "sent": "Of course if I use exponential or or power 10, it's going to be different.",
                    "label": 0
                },
                {
                    "sent": "That the mean value, and then we say minus some gamma and the minus game is that well, we have to decide if we are going to put floor or ceiling, that is it the.",
                    "label": 0
                },
                {
                    "sent": "Smallest integer larger than the number?",
                    "label": 0
                },
                {
                    "sent": "Or is it the largest integer smaller than the real number?",
                    "label": 0
                },
                {
                    "sent": "But so we can handle that by putting a game in there.",
                    "label": 0
                },
                {
                    "sent": "But basically the idea is that if you have a normal distribution of queues, depending on the value of Q, if your Q false linear, you are going to get ends zero citations if it falls in here it's going to get one citation.",
                    "label": 0
                },
                {
                    "sent": "If your Q falls in there, it's going to have one citation.",
                    "label": 0
                },
                {
                    "sent": "Or two, and so you actually can.",
                    "label": 0
                },
                {
                    "sent": "If this is normally distributed, you can calculate the area that falls inside each one of those bins, and you can predict how many papers are going to have a given number of citations.",
                    "label": 0
                },
                {
                    "sent": "OK, so you can now try to find out what the value of.",
                    "label": 0
                },
                {
                    "sent": "The mean and the standard deviation of Q is for the articles published in any Journal.",
                    "label": 1
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "What we did is the following.",
                    "label": 0
                },
                {
                    "sent": "We did a minimization of the Chi square statistics so we had to be in the data and we defined the bins in such a way that our expectation would be to have about 10 papers within each of those beings.",
                    "label": 1
                },
                {
                    "sent": "There's just a technical detail, so this is the estimate of Sigma, so the standard deviation of Q as a function of the.",
                    "label": 0
                },
                {
                    "sent": "Mean logarithm of the number of citations and you can see that it's a cloud, but Sigma is more or less constant for all the journals gamma is going is raising growing exponentially with mu.",
                    "label": 0
                },
                {
                    "sent": "So there is a relatively straightforward relation between them, but now if we have found out what the value of Sigma is and we can relate, we can find out what the value of mu is.",
                    "label": 0
                },
                {
                    "sent": "We actually can calculate, for instance, the moments of the distribution of something that is integer and compare it with the prediction of our.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Other would be and the red curve is the prediction, so this is the fraction of papers with zero citations.",
                    "label": 0
                },
                {
                    "sent": "Depending on the average of the logarithm of the number of citations of papers that have more.",
                    "label": 0
                },
                {
                    "sent": "They have at least one citation and you can see that distinct.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the skewness.",
                    "label": 0
                },
                {
                    "sent": "This is the excess kurtosis and you can see that.",
                    "label": 0
                },
                {
                    "sent": "Each one of those points is 1 Journal.",
                    "label": 0
                },
                {
                    "sent": "And there are about 8000 points in there.",
                    "label": 0
                },
                {
                    "sent": "Run.",
                    "label": 0
                },
                {
                    "sent": "Seems to work pretty well.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How much time do I have?",
                    "label": 0
                },
                {
                    "sent": "Hours and hours.",
                    "label": 0
                },
                {
                    "sent": "So the idea is that we find that the distribution of these cues is normal, but the outcome.",
                    "label": 0
                },
                {
                    "sent": "The number of citations is not.",
                    "label": 0
                },
                {
                    "sent": "Is not normal, is very broad, but The thing is that actually you can explain.",
                    "label": 0
                },
                {
                    "sent": "Distinct by sort of the dynamics of of the process right.",
                    "label": 0
                },
                {
                    "sent": "The more citations you have, the more citations you are going to get, so small differences in Q end up being translated in enormous differences in the number of citations.",
                    "label": 0
                },
                {
                    "sent": "And that's why you have something that has 200,000 freaking citations out there.",
                    "label": 0
                },
                {
                    "sent": "That seems impossible.",
                    "label": 0
                },
                {
                    "sent": "OK, so the question is.",
                    "label": 0
                },
                {
                    "sent": "What makes up this queue right?",
                    "label": 1
                },
                {
                    "sent": "Maybe it's noise, maybe it's.",
                    "label": 0
                },
                {
                    "sent": "You could say, well, there is noise.",
                    "label": 1
                },
                {
                    "sent": "There is intrinsic quality and there is the Journal effect and you can make different hypothesis.",
                    "label": 0
                },
                {
                    "sent": "May be nice dominates, maybe intrinsic quality dominates.",
                    "label": 0
                },
                {
                    "sent": "Maybe Journal dominates.",
                    "label": 0
                },
                {
                    "sent": "Maybe they are all about the same.",
                    "label": 0
                },
                {
                    "sent": "Now there has been.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is very interesting study by someone actually here at Ath, Bornemann and Daniel and what they did is actually they had information about papers that were submitted to.",
                    "label": 0
                },
                {
                    "sent": "Anger vent to me.",
                    "label": 0
                },
                {
                    "sent": "I'm probably murdering the name of the Journal, but you'll forgive me and so essentially they are.",
                    "label": 0
                },
                {
                    "sent": "The information about the papers that were submitted.",
                    "label": 0
                },
                {
                    "sent": "They knew which ones were accepted for publication.",
                    "label": 0
                },
                {
                    "sent": "They knew which ones were rejected.",
                    "label": 0
                },
                {
                    "sent": "They could track down the ones that were rejected where they were published.",
                    "label": 0
                },
                {
                    "sent": "OK. And the reason why I think this is very interesting is the following.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is for papers that were submitted in 2002.",
                    "label": 0
                },
                {
                    "sent": "The Journal.",
                    "label": 0
                },
                {
                    "sent": "These were papers that were accepted and published in 2000 and this is the citation count in 2008.",
                    "label": 0
                },
                {
                    "sent": "And what you can see is that.",
                    "label": 0
                },
                {
                    "sent": "So that's the median there.",
                    "label": 0
                },
                {
                    "sent": "That's where the 1/4 quantile.",
                    "label": 0
                },
                {
                    "sent": "The three quarters quantile.",
                    "label": 0
                },
                {
                    "sent": "And these were the papers that had been rejected in that Journal, but were published in another Journal.",
                    "label": 0
                },
                {
                    "sent": "Of lower quality.",
                    "label": 0
                },
                {
                    "sent": "And they define this by saying their impact factor is lower.",
                    "label": 0
                },
                {
                    "sent": "We know the impact factor is not perfect, but.",
                    "label": 0
                },
                {
                    "sent": "This is what happens with the papers that were rejected by.",
                    "label": 0
                },
                {
                    "sent": "By that by Anchorman.",
                    "label": 0
                },
                {
                    "sent": "You can see that they have.",
                    "label": 0
                },
                {
                    "sent": "Lower citations.",
                    "label": 0
                },
                {
                    "sent": "What happened to the papers that were submitted in 2001?",
                    "label": 0
                },
                {
                    "sent": "That were accepted and the ones that were rejected.",
                    "label": 0
                },
                {
                    "sent": "The ones that accepted behave pretty much the same way.",
                    "label": 0
                },
                {
                    "sent": "The ones that were rejected behave.",
                    "label": 0
                },
                {
                    "sent": "This pretty much the same way.",
                    "label": 0
                },
                {
                    "sent": "Now what is interesting is that.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "Distribution of number of citations for the papers that were rejected in anger.",
                    "label": 0
                },
                {
                    "sent": "Thank me.",
                    "label": 0
                },
                {
                    "sent": "Put those papers.",
                    "label": 0
                },
                {
                    "sent": "In a.",
                    "label": 0
                },
                {
                    "sent": "Those papers got more citations than other papers that have not been submitted to anger rank me in those other chemistry journals.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "That leads me to two things.",
                    "label": 0
                },
                {
                    "sent": "That actually the authors were able to identify the intrinsic quality of the paper because they thought that the paper had a chance of being published in anger and Kimi.",
                    "label": 0
                },
                {
                    "sent": "And that other people's interpretation of the quality of the paper matched the authors becausw, even though those papers were published in other journals, they end up with more citations than the typical paper published in those other journals.",
                    "label": 0
                },
                {
                    "sent": "So what this?",
                    "label": 0
                },
                {
                    "sent": "What I?",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I see that is as evidence that.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The number of citations is dominated by the intrinsic quality of the paper.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "As I said, the impact factor raises a lot of problems, and because it's a bad quality quantity, it leads to a lot of misleading ideas.",
                    "label": 0
                },
                {
                    "sent": "So people think that papers in physics are more cited than papers in other areas.",
                    "label": 0
                },
                {
                    "sent": "They think that.",
                    "label": 0
                },
                {
                    "sent": "The typical number of citations is very different in different areas, and if you would be looking at this so these are five journals, these are the periods in which we find the distribution of number of citations is stationary.",
                    "label": 0
                },
                {
                    "sent": "And out here is the Journal.",
                    "label": 0
                },
                {
                    "sent": "The recent Journal Impact Factor for each one of those journals.",
                    "label": 0
                },
                {
                    "sent": "So the impact factor for PRL is 7.",
                    "label": 0
                },
                {
                    "sent": "Ecology almost 4.8 American Sociological Review 3.2 econometric at 24 and Alan Mathematic 24.",
                    "label": 0
                },
                {
                    "sent": "What do you think is the ranking of the median number of citations of papers published in those journals?",
                    "label": 0
                },
                {
                    "sent": "Who wants to make the guess about which Journal will have the highest median?",
                    "label": 0
                },
                {
                    "sent": "Huh?",
                    "label": 0
                },
                {
                    "sent": "So that's the median 50% of the papers have lower number of citations, 50% have more.",
                    "label": 0
                },
                {
                    "sent": "Look at this case.",
                    "label": 0
                },
                {
                    "sent": "PRL impact factor.",
                    "label": 0
                },
                {
                    "sent": "7 ecology impact factor point 4.8 million 22 million 52.",
                    "label": 0
                },
                {
                    "sent": "I used to think that papers in physics got many more citations and papers in ecology.",
                    "label": 0
                },
                {
                    "sent": "Those are the top journals in the two fields.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "If you have a lognormal distribution and you have many more papers published in physics, then you have in ecology.",
                    "label": 0
                },
                {
                    "sent": "Your extreme out there is going to get a huge number of citations, so the most cited paper in physics every year has more citations than the most cited paper in.",
                    "label": 0
                },
                {
                    "sent": "In ecology.",
                    "label": 0
                },
                {
                    "sent": "But that's not about.",
                    "label": 0
                },
                {
                    "sent": "Typical, and so the mu, the average queue of the papers published in those journals are actually not so different.",
                    "label": 0
                },
                {
                    "sent": "So actually number of citations of papers.",
                    "label": 0
                },
                {
                    "sent": "Are not so different if you wait long enough in different disciplines.",
                    "label": 0
                },
                {
                    "sent": "And so this is the problem of the Journal impact factor.",
                    "label": 0
                },
                {
                    "sent": "It's that it gives credit to.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Speed of publication Becausw in Physics people published can get the paper published very quickly after submitting.",
                    "label": 0
                },
                {
                    "sent": "It starts accumulating citations very fast.",
                    "label": 0
                },
                {
                    "sent": "Which doesn't happen in economics or math, right?",
                    "label": 0
                },
                {
                    "sent": "So you get this idea that papers in economics are not going to be cited at all.",
                    "label": 0
                },
                {
                    "sent": "No, they are.",
                    "label": 0
                },
                {
                    "sent": "It's just that the impact factor is getting it wrong.",
                    "label": 0
                },
                {
                    "sent": "And actually this is about mental things.",
                    "label": 0
                },
                {
                    "sent": "And I'm not talking too much and I'm not going to have time to get to anything but.",
                    "label": 0
                },
                {
                    "sent": "There is some time and this idea that, oh physicists, we are doing really cool stuff because our stuff is so highly cited and things in other disciplines aren't.",
                    "label": 0
                },
                {
                    "sent": "The human brain works in weird twice, and it's even if you think you are not doing that you are but and the same thing about medicine, you know the medical doctors we published in these journals in medicine.",
                    "label": 0
                },
                {
                    "sent": "We are so good we get so many citations and they think those mathematicians don't know how to do anything.",
                    "label": 0
                },
                {
                    "sent": "They never get any citation, right?",
                    "label": 0
                },
                {
                    "sent": "And it's crap.",
                    "label": 0
                },
                {
                    "sent": "The impact factor essentially makes journals and in medicine and physics to be overrated by the impact factor.",
                    "label": 0
                },
                {
                    "sent": "And makes journals in a bunch of other fields being underrated.",
                    "label": 0
                },
                {
                    "sent": "People have this idea that the papers there get much less citations.",
                    "label": 0
                },
                {
                    "sent": "OK, now what I'm going to show is that you actually can use this ranking to decide.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What to read?",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so the basic idea is the following and I'm going to finish here.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to talk about anything else.",
                    "label": 0
                },
                {
                    "sent": "Imagine that you have a method to rank journals and you have rank this Journal higher than this other Journal OK?",
                    "label": 0
                },
                {
                    "sent": "When is this ranking useful?",
                    "label": 0
                },
                {
                    "sent": "The ranking is useful if if you pick a paper from the higher rank Journal at random and you pick a paper from the lower Rank Journal at Random, the one from the higher rank Journal as a higher than 50% probability of being higher quality.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "The higher the probability is that the one from the higher rank Journal is of higher quality, the better ranking is working for you.",
                    "label": 0
                },
                {
                    "sent": "OK, everybody on board on this.",
                    "label": 0
                },
                {
                    "sent": "If you want, these figures are going to be.",
                    "label": 0
                },
                {
                    "sent": "Completely senseless.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "I'll assume so.",
                    "label": 0
                },
                {
                    "sent": "What we did is the following.",
                    "label": 0
                },
                {
                    "sent": "We rank all the journals in a given field and these are two fields, experimental psychology and ecology.",
                    "label": 1
                },
                {
                    "sent": "Actually, if you go to the PLOS Website and download the our supplementary material, you can see these figures.",
                    "label": 0
                },
                {
                    "sent": "For.",
                    "label": 0
                },
                {
                    "sent": "300 fields OK. You actually can see the feeds of the data for the 8000 journals.",
                    "label": 0
                },
                {
                    "sent": "So you can go and look at your favorite Journal of your least favorite Journal.",
                    "label": 0
                },
                {
                    "sent": "You can look everything.",
                    "label": 0
                },
                {
                    "sent": "So green means that what you would want is happening.",
                    "label": 0
                },
                {
                    "sent": "That",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When you pick from the highest ranked Journal, the probability of the paper having eventually more citations is higher.",
                    "label": 0
                },
                {
                    "sent": "This is what happens when you order things according to the Journal Impact Factor.",
                    "label": 0
                },
                {
                    "sent": "You have lots of things that are not red.",
                    "label": 0
                },
                {
                    "sent": "So you have lots of things in which actually it would be wiser to read from the lowest rank Journal.",
                    "label": 0
                },
                {
                    "sent": "Try.",
                    "label": 0
                },
                {
                    "sent": "This is what happens when you use the average cue from the distribution that we estimate.",
                    "label": 0
                },
                {
                    "sent": "If you compare the top Journal with the bottom one.",
                    "label": 0
                },
                {
                    "sent": "The chance of picking up a paper from the bottom ranked Journal that has more citations than one from the top ranked Journal is less than 5%.",
                    "label": 0
                },
                {
                    "sent": "You can see that this essentially accept here one and two in which.",
                    "label": 0
                },
                {
                    "sent": "They are pretty much indistinguishable.",
                    "label": 0
                },
                {
                    "sent": "Everything else is.",
                    "label": 0
                },
                {
                    "sent": "You have a better chance of reading a better paper from the higher ranked Journal.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is what you get.",
                    "label": 0
                },
                {
                    "sent": "You actually can use something that is the optimal ranking and you could get rid of that issue, but that value of Q is essentially providing you an accurate and useful ranking because it tells you that the papers in those journals have a higher probability of end up being more cited, which you can understand.",
                    "label": 0
                },
                {
                    "sent": "This then having higher quality.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I talk too much.",
                    "label": 0
                },
                {
                    "sent": "I didn't finish what I wanted to do.",
                    "label": 0
                },
                {
                    "sent": "I will be happy to answer any questions and I thank you very much for your attention and for the questions and comments.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I would like to make.",
                    "label": 0
                },
                {
                    "sent": "There's something going on with the kind of copying process, so we're not even certain care.",
                    "label": 0
                },
                {
                    "sent": "You don't sign that Journal.",
                    "label": 0
                },
                {
                    "sent": "There.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "They might be.",
                    "label": 0
                },
                {
                    "sent": "I'm sending out a general which only has 50 references.",
                    "label": 0
                },
                {
                    "sent": "Then insert fraction of them have to be to that Journal.",
                    "label": 0
                },
                {
                    "sent": "That would give a kind of copying process.",
                    "label": 0
                },
                {
                    "sent": "But the copying is about.",
                    "label": 0
                },
                {
                    "sent": "The Journal and.",
                    "label": 0
                },
                {
                    "sent": "Journal.",
                    "label": 0
                },
                {
                    "sent": "The number but The thing is that even if you have to cite from a given Journal right, you can cite from any place in the past, so the availability that the actual number of papers that you could be citing these very large and.",
                    "label": 0
                },
                {
                    "sent": "Distributing a few more citations to each one of those.",
                    "label": 0
                },
                {
                    "sent": "Papers if you are not actually citing papers that are actually the relevant ones, and that you think are the good ones, wouldn't.",
                    "label": 0
                },
                {
                    "sent": "Pull up everything.",
                    "label": 0
                },
                {
                    "sent": "Papers.",
                    "label": 0
                },
                {
                    "sent": "Recently I.",
                    "label": 0
                },
                {
                    "sent": "It is not true and it has become less through with the advent of the web actually.",
                    "label": 0
                },
                {
                    "sent": "People have been able to sight farther back in the past, 'cause it's actually easier to find the references.",
                    "label": 0
                },
                {
                    "sent": "Right now.",
                    "label": 0
                },
                {
                    "sent": "You can very easily.",
                    "label": 0
                },
                {
                    "sent": "Instead of going to the library and look at, you actually can very quickly find out things.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "That is, yeah.",
                    "label": 0
                },
                {
                    "sent": "But we had a discussion over that with email, 'cause I actually they wrote a news piece and they asked my opinion about it and I said that I didn't.",
                    "label": 0
                },
                {
                    "sent": "I think that it was true and and he said, well, this is actually an effect that goes against what is actually the average trend, and all of them, so it's.",
                    "label": 0
                },
                {
                    "sent": "Classic wow, interesting.",
                    "label": 0
                },
                {
                    "sent": "Decatur Public 1st paper by publications.",
                    "label": 0
                },
                {
                    "sent": "In my Journal.",
                    "label": 0
                },
                {
                    "sent": "Cool science metrics.",
                    "label": 0
                },
                {
                    "sent": "Birthday.",
                    "label": 0
                },
                {
                    "sent": "Argue that simply applying these kinds of analysis.",
                    "label": 0
                },
                {
                    "sent": "But Ramada.",
                    "label": 0
                },
                {
                    "sent": "What is that?",
                    "label": 0
                },
                {
                    "sent": "It's interesting to me that.",
                    "label": 0
                },
                {
                    "sent": "You makes me feel better.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Work on measuring time.",
                    "label": 0
                },
                {
                    "sent": "Because.",
                    "label": 0
                },
                {
                    "sent": "Is actually.",
                    "label": 0
                },
                {
                    "sent": "I know.",
                    "label": 0
                },
                {
                    "sent": "Second point was to send it well at one stage support.",
                    "label": 0
                },
                {
                    "sent": "What, why should it matter at Washington?",
                    "label": 0
                },
                {
                    "sent": "I'm the kind of answer you gave was, but it will help us to identify good scientists and good papers, but I think they also didn't remember this, so other uses for this.",
                    "label": 0
                },
                {
                    "sent": "UK.",
                    "label": 0
                },
                {
                    "sent": "After we got these kinds.",
                    "label": 0
                },
                {
                    "sent": "For assessing the quality falls in place of Department, and.",
                    "label": 0
                },
                {
                    "sent": "Find metal people killing.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "It's also.",
                    "label": 0
                },
                {
                    "sent": "Am I going to go and I think therefore there is a lot of policy and professional classical infected with this word, so we need special counsel requesting help.",
                    "label": 0
                },
                {
                    "sent": "So let me ask you a question.",
                    "label": 0
                },
                {
                    "sent": "Do you think that someone because they got the PHD's the right to a lifetime long job regardless of what they do?",
                    "label": 0
                },
                {
                    "sent": "Cause for instance, that was what was happening in Portugal when I was there.",
                    "label": 0
                },
                {
                    "sent": "There were all these people that haven't been doing anything and so shouldn't you know?",
                    "label": 0
                },
                {
                    "sent": "In almost any karere, people are actually asked are you performing?",
                    "label": 0
                },
                {
                    "sent": "Are you doing something that has a certain quality?",
                    "label": 0
                },
                {
                    "sent": "So should we not somehow measure what scientists are doing?",
                    "label": 0
                },
                {
                    "sent": "Should we be exempt of those measurements?",
                    "label": 0
                },
                {
                    "sent": "'cause 'cause then it's.",
                    "label": 0
                },
                {
                    "sent": "We should not.",
                    "label": 0
                },
                {
                    "sent": "Measure funded quality and indeed I happen to be a member of the UK Research Assessment Exercise.",
                    "label": 0
                },
                {
                    "sent": "Reading.",
                    "label": 0
                },
                {
                    "sent": "Physiology.",
                    "label": 0
                },
                {
                    "sent": "Really hard work.",
                    "label": 0
                },
                {
                    "sent": "Fire.",
                    "label": 0
                },
                {
                    "sent": "What I am saying is that if we are.",
                    "label": 0
                },
                {
                    "sent": "Devising quantitative and plan as well, mechanical and automatic measures.",
                    "label": 0
                },
                {
                    "sent": "Reportedly.",
                    "label": 0
                },
                {
                    "sent": "We also do that with a great deal of parent caution and awareness of the consequences.",
                    "label": 0
                },
                {
                    "sent": "That's not right.",
                    "label": 0
                },
                {
                    "sent": "No, what?",
                    "label": 0
                },
                {
                    "sent": "Why is it slightly different?",
                    "label": 0
                },
                {
                    "sent": "I mean what I'm saying is that.",
                    "label": 0
                },
                {
                    "sent": "We OK you can you can take one of two attitudes right?",
                    "label": 0
                },
                {
                    "sent": "You can say, well we should not be doing this measurement 'cause some that exist are not so good and they are being used and they can have bad consequences right?",
                    "label": 0
                },
                {
                    "sent": "And I agree with that.",
                    "label": 0
                },
                {
                    "sent": "I mean I actually think that.",
                    "label": 0
                },
                {
                    "sent": "One of my points is that there is a lot of relevance giving to the Journal impact factor and the Journal Impact Factor has a lot of problems and issues right?",
                    "label": 0
                },
                {
                    "sent": "And I mean what the problems and issues that we find match a lot of.",
                    "label": 0
                },
                {
                    "sent": "Essentially what had been set for the longest time, right?",
                    "label": 0
                },
                {
                    "sent": "I mean, we didn't even look into the stuff of the language, but you know all of those issues are well known.",
                    "label": 0
                },
                {
                    "sent": "Now what we ask this, can we do something that is better and you know it's sort of?",
                    "label": 0
                },
                {
                    "sent": "By doing extremely systematic analysis, and I think there has been no analysis at the same level of magnitude that we did in here.",
                    "label": 0
                },
                {
                    "sent": "Right, I mean I do not know of any analysis of this magnitude.",
                    "label": 0
                },
                {
                    "sent": "And I don't.",
                    "label": 0
                }
            ]
        }
    }
}