{
    "id": "3bhqatsgo4eanfrxcilorqx72z4qwwc7",
    "title": "Discovering Leaders from Community Actions",
    "info": {
        "author": [
            "Amit Goyal, Department of Computer Science, University of British Columbia"
        ],
        "published": "Nov. 19, 2008",
        "recorded": "October 2008",
        "category": [
            "Top->Computer Science",
            "Top->Computer Science->Data Mining"
        ]
    },
    "url": "http://videolectures.net/cikm08_goyal_dlfca/",
    "segmentation": [
        [
            "Thank fuck with my professor Laxius Luxman, an Francisco Benchy who is working in Yahoo search."
        ],
        [
            "Barcelona contact segment.",
            "Let us talk about the context and motivate."
        ],
        [
            "Which is well, marketing?",
            "So we are more influenced by friends then asked then strangers because we trust our friends.",
            "According to a study by Berg, 68% of the consumers consult their friends and family before purchasing home electronics.",
            "So.",
            "Yeah, so this this idea has been used, often used by the advertising companies, which is an.",
            "This idea is known as well."
        ],
        [
            "Marketing this is also known as target advertising.",
            "By identifying and targeting influential users in a community, it is possible to spread the adoption of the technology.",
            "By initiating a chain reaction by bird of multifactor.",
            "This has often been used by advertising companies to achieve maximum gain through low using only low investments."
        ],
        [
            "So till now, while marketing has been studied as an optimization problem, the problem is defined as follows.",
            "The given the network with influence probabilities.",
            "The problem is to select top key leaders such that by targeting them, the spread of influence is maximized.",
            "For example, if you consider this node B and not a, the influence probability is .3.",
            "That means if node B perform certain action, the user A will follow.",
            "That action is the probability for that is .3.",
            "Some classical papers which talk about his timing goes in 2001.",
            "Richardson, Campy and today we saw a similar paper by Hama in just which to which talks about maximizing the influence in our social network, but the but they leave an open issue that how to calculate these influence probabilities.",
            "They are not available in the real world data set."
        ],
        [
            "We propose a completely different approach, which is based on frequent pattern mining.",
            "As most of you know, frequent better mining is a method to calculate Association between items in transaction data set.",
            "We focus on we focus on actions performed by the users and action can be joining a Community rating, a song, or a movie, whatever.",
            "And while we focus on actions because they are available directly in the real world datasets, nor an inference, priorities are not available.",
            "We give importance to time in which the actions are performed.",
            "Often all the advertising companies want to estimate the time in which they get returns, so it is very important to give an emphasis on time.",
            "Our assumption is that users can see their friends action online.",
            "For example, if you go to Facebook or Orkut or any any.",
            "Networking website they to the fix they can actually see what their friends did in the in."
        ],
        [
            "In time.",
            "So in a nutshell, our contribution is to 1st be formally defined.",
            "The notion of leaders and its various flavors.",
            "Then we develop efficient algorithms for extracting these leaders.",
            "Then we go ahead and demonstrate the utility utility and scalability of algorithms wine.",
            "Extensive set of experiments on real world data set data set contains a Yahoo Messenger which is social graph and Yahoo."
        ],
        [
            "Visiting my rest of the talk will far away first talk about the framework definition.",
            "Then we will discuss the algorithms.",
            "Then we'll see what results and then the related work and."
        ],
        [
            "Conclusions.",
            "Let's talk about that, Ephraim."
        ],
        [
            "1st.",
            "So we consider two types of input, the first of which is a social network.",
            "A social network is an undirected graph where the nodes are the users and the edges represent social ties.",
            "We all know that the users declare their friends, such as in Facebook or Yahoo Messenger or any kind of social coming online commune."
        ],
        [
            "Our second input is an action log which is sorted in chronological order.",
            "An action log is a relation of users, action and time.",
            "For example, Jack join below comedic time 5 minutes, which means that Jack is a user and actions are joining a new community and the time is 5.",
            "Again, our assumption is that users can see their friends actions."
        ],
        [
            "Two feats.",
            "So for example, let's consider that the it's a social network which has three users.",
            "Jack children marry, Jack and Jill are friends.",
            "Jack and Maria friends and let's say the action is joining the user community and say that to Jack join the yogurt time five Gillette timing.",
            "Then we say that the action has been propagated from check to Jill in three time units.",
            "Similarly, if Mary joined your community at 10,000, then we see that the action has been propagated from check to marry in 995 times units.",
            "We use the term.",
            "Influence here saying that Jill has been influenced by Jack in three time units, but note that we use the term influence in a loose sense."
        ],
        [
            "By extending the idea of action publication, we can make a propagation graph as follows.",
            "Like there are five users in a network and they join.",
            "They did the same action at different timestamps and we get the propagation graph.",
            "So we say that the child has been influenced by Jack, but can we say that Mary has been influenced by that may be new because the time is very substantial.",
            "It's nine 9510 minutes here."
        ],
        [
            "User conference call.",
            "So as I told when an action public it's from 1 user to another.",
            "We might think that the second user has been influenced by first user.",
            "Influential decay in time cause as a time as I told that the Mary may not be may not be influenced by check in the in this example.",
            "So the user influence graph object does not contain Mary, but all the three users one.",
            "We found that the size of these influence graph is much less than the size of propagation graph, although it depends on the time window what time window we want to consider.",
            "But in most for any reasonable time window, the size of influence graph is generally less than the size of property."
        ],
        [
            "So who should be a leader in our in our community?",
            "So first thing that comes intuitively in our mind that for an action it should influence sufficiently large number of users.",
            "We parameterized this condition by saying that the number of users should be getting inside the another condition should be that leader should influence these users in a reasonable amount of time.",
            "It should not take infinite time.",
            "We parameterized this condition by saying that I'm should be lessened by.",
            "I mean, the leader should act as a leader in sufficiently large number of actions.",
            "We say that Sigma Sigma threshold on those number of actions.",
            "For example, in the same example that we saw earlier.",
            "The FCC is equal to 2 users.",
            "Bicycle 15 time units and Sigma is going to 1 action.",
            "Then both Jack and Jill are leaders in this example because Jill has influenced Joy, Joey and Ben and Jack has influenced chill Joanne Pen in surface."
        ],
        [
            "Reasonable amount of time.",
            "Then we then we say a leader may influence different users for different actions.",
            "What if a leader leads only a fixed set of users for different actions?",
            "For example, in this, if you see this graph that Jack has been a leader in three actions, even a two and a three.",
            "But this intersection is a set of users whom Jack has influenced for all the actions.",
            "So we say that this orange thing is just right for the Jack.",
            "And the jacket, the tribe leader.",
            "This can be considered as these types can be considered at small communities."
        ],
        [
            "We also put additional country constraint like genuineness and confidence.",
            "Let's first talk about genuineness.",
            "It may happen that one leader use one lead 1 user act as a leader, but in concrete he's always a follower of other leaders.",
            "For example.",
            "Have you seen Jill has been leader in three actions, even 823, but for action even it was he was influenced by check and fractionate too.",
            "He was influenced by Tom, so we want the Sowjanya score of this Jill of this use leader.",
            "Jill is 1 by three.",
            "We want to avoid these kind of fake leaders in some scenarios.",
            "Another constraint that we talk about his confidence but due to lack of time I'm not."
        ],
        [
            "Going to download.",
            "Select see how will I?",
            "How how do we discover all these leaders and various notions of leaders?"
        ],
        [
            "So our first assumption is that the social graph and action lock, which is an input, is very huge.",
            "They had they contain the million of notes and millions of millions of couples.",
            "Then the second assumption is the size of user inference.",
            "Graph is much less than the size of propagation graph for all the users, and it has been approved by the experiment that we did in the real data set.",
            "Although it depends on the time window of size file, but for any reasonable time window the size of user inference, gas graph is less.",
            "So our algorithms that we design are able to extract the patterns.",
            "That is all the leaders, tribe leaders, and other other notions of leaders is no more than one does not use no more than one is kind of."
        ],
        [
            "Action lock table.",
            "So how do we define the leaders?",
            "How do we extrapolate this?",
            "Lee scandal Misconnection Lock table by means of time window size pie.",
            "Note that pie is a threshold on time.",
            "We slide the time window backward in time.",
            "Yeah backward in time that is the start from the bottom of the action of table and we go upside.",
            "Using this, we officially confused the influence metrics and entry and influence matrix represent the number of users that have been influenced by any user with respect to detection in.",
            "It is clear that once we compute the influence metrics, it's very easy to compute the leaders from influence matrix.",
            "So for example, if we see the previous example.",
            "I am entry the influence metric influence metrics entry for the user Jack for the action.",
            "Joining your community is 3 if the time window is is the threshold and time is 10 time limits.",
            "So."
        ],
        [
            "Let's see how we compute the influence metrics.",
            "We use a big factor influence which factor to track which users are influenced by given user and we update these influence vectors incrementally.",
            "For example, if we slide the time window some some notes will appear in the time window and some nodes will drop off from the time window.",
            "So we want to.",
            "So we want to compute the influence vector incrementally and updated.",
            "We use two mechanisms update and propagate to to compute the influence vector incrementally.",
            "As we as we move the time window, some of the notes will appear and some of the notes will disappear from the time window.",
            "So we use to keep to manage which index which bit belongs to what user.",
            "We use a locking mechanism which is known as lock with vector in a lot of vector.",
            "The 0 means a free entry and the one means an occupied occupied, but that is the lock is issued.",
            "For example, if you see the user V. In a queue we can see that the Lock pick index of two has been occupied by V. That is, the 2nd entry from the right, which is.",
            "If we assume that the indexes started from zero from the right in the locking deadlock.",
            "With vector sonotube, it index mapping is stored in a Q and obviously say this all the bits.",
            "All the logs should be allocated dynamically.",
            "So let's let's consider the node W here.",
            "Then W at the lock to W is 1 and we can see only the node V is influenced by the node W in this time window.",
            "So if you could see the inference vector of node off node W, the big one and two are one which one bit is corresponding to node B and one week to respond to itself.",
            "That is double."
        ],
        [
            "So let's say we slide up the current time window.",
            "So this node we will drop off from the current time window.",
            "So we first delete the entry from the queue.",
            "Then we update the lock as we see here that is we free the lock that is by making the big O.",
            "Then we update all the influence vectors that is we go to all the nodes in the current time we do.",
            "We make that Big Zero because now the lock is."
        ],
        [
            "Now let's say a new note has been added to the to the time window.",
            "So the first issue, the lock, then add the enter into the queue, so the first 3 lock is the bit index two that we allocate to be assertive, and then we compute's influence vector by propagation.",
            "Which is like this.",
            "So we see the number of followers of Note P is 4 in this time window, and it's a number of bits number of 1 bits in the influence vector of bits minus one.",
            "So we can calculate the influence metrics just by counting the number of 1 bits into the influence vector.",
            "But and once we compute the influence metrics, it's very easy to compute all the."
        ],
        [
            "Leaders, but when it comes to the tribe leaders, the influence metrics is not enough.",
            "So we extend the idea of influence metrics to influence cube, which is a 3 dimensional data structure where each entry represent that the user V is influenced by user.",
            "Further action a within time within the time threshold type.",
            "We do not explicitly compute the whole cube due to sparsity.",
            "We do a lot of optimization, but do a lack of time.",
            "I will not go into all these optimizations.",
            "We see that the.",
            "Sorry, so the computing tribe leaders.",
            "The problem computing Tribe leaders is same as discovering existence of frequent item sets of size larger than a given threshold.",
            "A lot of work has been done in the frequent pattern mining an Association rule mining, so we will not go into this."
        ],
        [
            "But it's very fast, like, although the theoretical complexity is exponential, but in practice it's very fast.",
            "So as we see in the in the in previous algorithms the only true, although there are many thresholds like the threshold on the number of users, had told the number of actions on time.",
            "But the only truly mandatory sexual desire which is a time threshold and other threshold come into role only when the influence metrics has been computed.",
            "So we just need one scan for one time or the action.",
            "So the complexity of influence computing influence metrics is order of Tiana Square in bit level operations.",
            "It's much faster than the normal operations.",
            "So the capital T is a total number of couples in action log.",
            "Capital A is a total number of distinct actions and small N is a maximum number of nodes that are visible in any opposition of the current time window all the time window.",
            "We already know that the smaller is much, much less than capital and becausw the size of influence.",
            "User influence graph is much less than size of propagation craft.",
            "The.",
            "The complexity of tribe leaders is as follows.",
            "The complexity of computing influence Cuba is same as computing influence metrics, but finding existence of recurrent item sets is exponential in fury in.",
            "But there are lots of optimizations that work has been done and there are lots of optimization.",
            "One other people is is presented by one of the Co authors."
        ],
        [
            "Launch in 2003.",
            "Let's start."
        ],
        [
            "See the results.",
            "So data we use Yahoo Messenger, Yahoo Instant Messenger, the social Graph and Yahoo movies rating as an action or where we consider the action as user U rated the movie and at time step T. We join these two graphs through the common user identifier, so we started with the Yahoo Instant Messenger graph with 110 million nodes which are most active users in this and 21 million ratings from Yahoo movies.",
            "But when we took a map join of these two, we ended with 217 thousand nodes and 221 thousand edges with 1.8."
        ],
        [
            "Greetings, let's see how the data look likes.",
            "So when we took him join we see there are a lot of different day lot of disjoint connected components, the number of which is 46,000.",
            "One of them is a giant component which contains 94 K users and rest of all are small small connected components have which have less than 50 or so."
        ],
        [
            "Note so this graph shows the number of leaders that we discovered with respect to the user threshold side.",
            "We obviously that number of Tribe leaders would be the lesson number of leaders because all the tribe leaders are leaders we see.",
            "As you can see, it looks like exponential degrees with the parameters side."
        ],
        [
            "This graph shows the number of leaders that we discovered with respect to two different.",
            "The constraints, which is a PSI which is titled or number of users answering machine threshold and number of actions as expected.",
            "As we make the all the threshold title, the number of leaders discovered are less."
        ],
        [
            "This graph shows the scalability of our of our algorithm.",
            "As you can see, even if we consider 2 million ratings which is on the right side, the time taken is only one minute to scan the whole table to compute the all the leaders.",
            "And this is the cause.",
            "All the operations are big level up."
        ],
        [
            "Actions.",
            "As you recall, the genuine we want to avoid the fake leaders due to some of the advertising campaigns like they can ask that we just we just want to target the general leaders.",
            "We found that the generously leadership is almost in binary concept.",
            "That means either all the leaders.",
            "Either the leaders are totally genuine or they're totally fake that is dominated by others."
        ],
        [
            "So.",
            "This table shows the top ten tribe leaders with respect to type size.",
            "As you can say, we found that the tribe leaders exhibit high confidence that you can see the generally the confidence is higher on the higher side.",
            "We also found that the tribe leaders who has lower general score for the.",
            "For example in the rank 5 user they are dominated by the other tribe leaders present in the same table.",
            "For example, this user five has been dominated by user four and six in the current in the industry.",
            "We found we also found that many users that act as a leader in many actions, but not being a try."
        ],
        [
            "Yeah, so a lot of work has been done in the domain.",
            "For example identifying influential users that their classical papers are Domino's Richardson campy days upon very good paper in identifying influential bloggers by other wall.",
            "There's a lot of work has been done in identifying communities of traffic."
        ],
        [
            "Add this and this.",
            "Days of work done in influence and coalition social network by Alice Ann.",
            "Sorry I can't pronounce it there is a work done by in revenue maximization in viral marketing by hotline.",
            "There is also worked on in near optimal sensor placement for a great detection and we saw that today in earlier to our support there's a heat diffusion model.",
            "Very interesting paper."
        ],
        [
            "By Elmo.",
            "So conclusion we propose a framework.",
            "So in this paper we proposed framework which is based on frequent pattern mining for discovering leaders in social network.",
            "We formally define the problem of extracting leaders from social graph and action log.",
            "We define lot various motions of leaders, tribe leaders there variants like confidence genuine.",
            "Then we go ahead and develop the efficient algorithms for extracting these leaders of various flavors.",
            "We just need the one Passover.",
            "The whole action lock table to compute all all these things and we demonstrated the utility and scalability.",
            "Algorithms by an extensive set of experiments on available data set, which is Yahoo Move Messenger."
        ],
        [
            "Home visiting so the ongoing work so grew.",
            "Mine is a pattern mining system for discovering leaders and tribe, which is to appear in the ICD 2009.",
            "We are also working on the leadership cube which I tried the following question.",
            "What kind of leaders attract?",
            "What kind of followers for what kind of actions?",
            "Like in some domains, some users are leader but in other domains they're not.",
            "They're not effective at all, so we want to see what leaders actually are effective in what domains.",
            "We are also looking how this framework can be used in solving the viral marketing problems.",
            "And it is interesting to ask the question that whether whether, for example, in the paper that I paper by Aris.",
            "They show that it's not.",
            "It's very challenging to define the term influence, so we come.",
            "We presented a computational framework to identify the leaders and it is.",
            "It's an interesting question to ask whether to keep this computational computational framework and still have this strong."
        ],
        [
            "Notion of influence thanks.",
            "OK, now it's for the questions.",
            "Hi Sam of life or I should be or how long can determine the true pie according to state with the name that you will have and also whether the algorithm with generalized if you say a going over the same data set with the.",
            "In Central Valley supplies.",
            "It's a very interesting question.",
            "So basically I'm finding the true value of π.",
            "It's the it's very similar to what we use in the frequent pattern mining like we have support and confidence.",
            "We play with different threshold and see what is, uh, what should be the true value of any of any threshold.",
            "But generally like if we see the pile should be like in the weeks one week, two weeks, three weeks or one month.",
            "So the domain shoot of the pipe should be like months or weeks depending on what's your what are you looking at like?",
            "What's your technologies?",
            "One more question.",
            "Connected component.",
            "So basically, if you see the original Yahoo Messenger graph, OK here, Lexa.",
            "So my quarter.",
            "My call from Member Services market.",
            "I'm not sure about about.",
            "This really is a football game.",
            "OK thanks."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank fuck with my professor Laxius Luxman, an Francisco Benchy who is working in Yahoo search.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Barcelona contact segment.",
                    "label": 0
                },
                {
                    "sent": "Let us talk about the context and motivate.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Which is well, marketing?",
                    "label": 0
                },
                {
                    "sent": "So we are more influenced by friends then asked then strangers because we trust our friends.",
                    "label": 1
                },
                {
                    "sent": "According to a study by Berg, 68% of the consumers consult their friends and family before purchasing home electronics.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so this this idea has been used, often used by the advertising companies, which is an.",
                    "label": 0
                },
                {
                    "sent": "This idea is known as well.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Marketing this is also known as target advertising.",
                    "label": 1
                },
                {
                    "sent": "By identifying and targeting influential users in a community, it is possible to spread the adoption of the technology.",
                    "label": 0
                },
                {
                    "sent": "By initiating a chain reaction by bird of multifactor.",
                    "label": 0
                },
                {
                    "sent": "This has often been used by advertising companies to achieve maximum gain through low using only low investments.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So till now, while marketing has been studied as an optimization problem, the problem is defined as follows.",
                    "label": 0
                },
                {
                    "sent": "The given the network with influence probabilities.",
                    "label": 1
                },
                {
                    "sent": "The problem is to select top key leaders such that by targeting them, the spread of influence is maximized.",
                    "label": 1
                },
                {
                    "sent": "For example, if you consider this node B and not a, the influence probability is .3.",
                    "label": 0
                },
                {
                    "sent": "That means if node B perform certain action, the user A will follow.",
                    "label": 0
                },
                {
                    "sent": "That action is the probability for that is .3.",
                    "label": 0
                },
                {
                    "sent": "Some classical papers which talk about his timing goes in 2001.",
                    "label": 0
                },
                {
                    "sent": "Richardson, Campy and today we saw a similar paper by Hama in just which to which talks about maximizing the influence in our social network, but the but they leave an open issue that how to calculate these influence probabilities.",
                    "label": 0
                },
                {
                    "sent": "They are not available in the real world data set.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We propose a completely different approach, which is based on frequent pattern mining.",
                    "label": 1
                },
                {
                    "sent": "As most of you know, frequent better mining is a method to calculate Association between items in transaction data set.",
                    "label": 1
                },
                {
                    "sent": "We focus on we focus on actions performed by the users and action can be joining a Community rating, a song, or a movie, whatever.",
                    "label": 0
                },
                {
                    "sent": "And while we focus on actions because they are available directly in the real world datasets, nor an inference, priorities are not available.",
                    "label": 0
                },
                {
                    "sent": "We give importance to time in which the actions are performed.",
                    "label": 0
                },
                {
                    "sent": "Often all the advertising companies want to estimate the time in which they get returns, so it is very important to give an emphasis on time.",
                    "label": 0
                },
                {
                    "sent": "Our assumption is that users can see their friends action online.",
                    "label": 0
                },
                {
                    "sent": "For example, if you go to Facebook or Orkut or any any.",
                    "label": 0
                },
                {
                    "sent": "Networking website they to the fix they can actually see what their friends did in the in.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In time.",
                    "label": 0
                },
                {
                    "sent": "So in a nutshell, our contribution is to 1st be formally defined.",
                    "label": 0
                },
                {
                    "sent": "The notion of leaders and its various flavors.",
                    "label": 1
                },
                {
                    "sent": "Then we develop efficient algorithms for extracting these leaders.",
                    "label": 0
                },
                {
                    "sent": "Then we go ahead and demonstrate the utility utility and scalability of algorithms wine.",
                    "label": 1
                },
                {
                    "sent": "Extensive set of experiments on real world data set data set contains a Yahoo Messenger which is social graph and Yahoo.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Visiting my rest of the talk will far away first talk about the framework definition.",
                    "label": 1
                },
                {
                    "sent": "Then we will discuss the algorithms.",
                    "label": 0
                },
                {
                    "sent": "Then we'll see what results and then the related work and.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Conclusions.",
                    "label": 0
                },
                {
                    "sent": "Let's talk about that, Ephraim.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "1st.",
                    "label": 0
                },
                {
                    "sent": "So we consider two types of input, the first of which is a social network.",
                    "label": 0
                },
                {
                    "sent": "A social network is an undirected graph where the nodes are the users and the edges represent social ties.",
                    "label": 1
                },
                {
                    "sent": "We all know that the users declare their friends, such as in Facebook or Yahoo Messenger or any kind of social coming online commune.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our second input is an action log which is sorted in chronological order.",
                    "label": 1
                },
                {
                    "sent": "An action log is a relation of users, action and time.",
                    "label": 0
                },
                {
                    "sent": "For example, Jack join below comedic time 5 minutes, which means that Jack is a user and actions are joining a new community and the time is 5.",
                    "label": 0
                },
                {
                    "sent": "Again, our assumption is that users can see their friends actions.",
                    "label": 1
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Two feats.",
                    "label": 0
                },
                {
                    "sent": "So for example, let's consider that the it's a social network which has three users.",
                    "label": 0
                },
                {
                    "sent": "Jack children marry, Jack and Jill are friends.",
                    "label": 1
                },
                {
                    "sent": "Jack and Maria friends and let's say the action is joining the user community and say that to Jack join the yogurt time five Gillette timing.",
                    "label": 0
                },
                {
                    "sent": "Then we say that the action has been propagated from check to Jill in three time units.",
                    "label": 0
                },
                {
                    "sent": "Similarly, if Mary joined your community at 10,000, then we see that the action has been propagated from check to marry in 995 times units.",
                    "label": 0
                },
                {
                    "sent": "We use the term.",
                    "label": 0
                },
                {
                    "sent": "Influence here saying that Jill has been influenced by Jack in three time units, but note that we use the term influence in a loose sense.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "By extending the idea of action publication, we can make a propagation graph as follows.",
                    "label": 0
                },
                {
                    "sent": "Like there are five users in a network and they join.",
                    "label": 0
                },
                {
                    "sent": "They did the same action at different timestamps and we get the propagation graph.",
                    "label": 0
                },
                {
                    "sent": "So we say that the child has been influenced by Jack, but can we say that Mary has been influenced by that may be new because the time is very substantial.",
                    "label": 1
                },
                {
                    "sent": "It's nine 9510 minutes here.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "User conference call.",
                    "label": 0
                },
                {
                    "sent": "So as I told when an action public it's from 1 user to another.",
                    "label": 1
                },
                {
                    "sent": "We might think that the second user has been influenced by first user.",
                    "label": 1
                },
                {
                    "sent": "Influential decay in time cause as a time as I told that the Mary may not be may not be influenced by check in the in this example.",
                    "label": 1
                },
                {
                    "sent": "So the user influence graph object does not contain Mary, but all the three users one.",
                    "label": 0
                },
                {
                    "sent": "We found that the size of these influence graph is much less than the size of propagation graph, although it depends on the time window what time window we want to consider.",
                    "label": 0
                },
                {
                    "sent": "But in most for any reasonable time window, the size of influence graph is generally less than the size of property.",
                    "label": 1
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So who should be a leader in our in our community?",
                    "label": 0
                },
                {
                    "sent": "So first thing that comes intuitively in our mind that for an action it should influence sufficiently large number of users.",
                    "label": 1
                },
                {
                    "sent": "We parameterized this condition by saying that the number of users should be getting inside the another condition should be that leader should influence these users in a reasonable amount of time.",
                    "label": 1
                },
                {
                    "sent": "It should not take infinite time.",
                    "label": 0
                },
                {
                    "sent": "We parameterized this condition by saying that I'm should be lessened by.",
                    "label": 1
                },
                {
                    "sent": "I mean, the leader should act as a leader in sufficiently large number of actions.",
                    "label": 0
                },
                {
                    "sent": "We say that Sigma Sigma threshold on those number of actions.",
                    "label": 0
                },
                {
                    "sent": "For example, in the same example that we saw earlier.",
                    "label": 1
                },
                {
                    "sent": "The FCC is equal to 2 users.",
                    "label": 0
                },
                {
                    "sent": "Bicycle 15 time units and Sigma is going to 1 action.",
                    "label": 0
                },
                {
                    "sent": "Then both Jack and Jill are leaders in this example because Jill has influenced Joy, Joey and Ben and Jack has influenced chill Joanne Pen in surface.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Reasonable amount of time.",
                    "label": 0
                },
                {
                    "sent": "Then we then we say a leader may influence different users for different actions.",
                    "label": 1
                },
                {
                    "sent": "What if a leader leads only a fixed set of users for different actions?",
                    "label": 1
                },
                {
                    "sent": "For example, in this, if you see this graph that Jack has been a leader in three actions, even a two and a three.",
                    "label": 0
                },
                {
                    "sent": "But this intersection is a set of users whom Jack has influenced for all the actions.",
                    "label": 0
                },
                {
                    "sent": "So we say that this orange thing is just right for the Jack.",
                    "label": 1
                },
                {
                    "sent": "And the jacket, the tribe leader.",
                    "label": 0
                },
                {
                    "sent": "This can be considered as these types can be considered at small communities.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We also put additional country constraint like genuineness and confidence.",
                    "label": 0
                },
                {
                    "sent": "Let's first talk about genuineness.",
                    "label": 0
                },
                {
                    "sent": "It may happen that one leader use one lead 1 user act as a leader, but in concrete he's always a follower of other leaders.",
                    "label": 1
                },
                {
                    "sent": "For example.",
                    "label": 0
                },
                {
                    "sent": "Have you seen Jill has been leader in three actions, even 823, but for action even it was he was influenced by check and fractionate too.",
                    "label": 0
                },
                {
                    "sent": "He was influenced by Tom, so we want the Sowjanya score of this Jill of this use leader.",
                    "label": 0
                },
                {
                    "sent": "Jill is 1 by three.",
                    "label": 1
                },
                {
                    "sent": "We want to avoid these kind of fake leaders in some scenarios.",
                    "label": 0
                },
                {
                    "sent": "Another constraint that we talk about his confidence but due to lack of time I'm not.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Going to download.",
                    "label": 0
                },
                {
                    "sent": "Select see how will I?",
                    "label": 1
                },
                {
                    "sent": "How how do we discover all these leaders and various notions of leaders?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So our first assumption is that the social graph and action lock, which is an input, is very huge.",
                    "label": 0
                },
                {
                    "sent": "They had they contain the million of notes and millions of millions of couples.",
                    "label": 1
                },
                {
                    "sent": "Then the second assumption is the size of user inference.",
                    "label": 1
                },
                {
                    "sent": "Graph is much less than the size of propagation graph for all the users, and it has been approved by the experiment that we did in the real data set.",
                    "label": 1
                },
                {
                    "sent": "Although it depends on the time window of size file, but for any reasonable time window the size of user inference, gas graph is less.",
                    "label": 1
                },
                {
                    "sent": "So our algorithms that we design are able to extract the patterns.",
                    "label": 1
                },
                {
                    "sent": "That is all the leaders, tribe leaders, and other other notions of leaders is no more than one does not use no more than one is kind of.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Action lock table.",
                    "label": 0
                },
                {
                    "sent": "So how do we define the leaders?",
                    "label": 0
                },
                {
                    "sent": "How do we extrapolate this?",
                    "label": 0
                },
                {
                    "sent": "Lee scandal Misconnection Lock table by means of time window size pie.",
                    "label": 1
                },
                {
                    "sent": "Note that pie is a threshold on time.",
                    "label": 0
                },
                {
                    "sent": "We slide the time window backward in time.",
                    "label": 1
                },
                {
                    "sent": "Yeah backward in time that is the start from the bottom of the action of table and we go upside.",
                    "label": 1
                },
                {
                    "sent": "Using this, we officially confused the influence metrics and entry and influence matrix represent the number of users that have been influenced by any user with respect to detection in.",
                    "label": 0
                },
                {
                    "sent": "It is clear that once we compute the influence metrics, it's very easy to compute the leaders from influence matrix.",
                    "label": 0
                },
                {
                    "sent": "So for example, if we see the previous example.",
                    "label": 0
                },
                {
                    "sent": "I am entry the influence metric influence metrics entry for the user Jack for the action.",
                    "label": 0
                },
                {
                    "sent": "Joining your community is 3 if the time window is is the threshold and time is 10 time limits.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's see how we compute the influence metrics.",
                    "label": 0
                },
                {
                    "sent": "We use a big factor influence which factor to track which users are influenced by given user and we update these influence vectors incrementally.",
                    "label": 1
                },
                {
                    "sent": "For example, if we slide the time window some some notes will appear in the time window and some nodes will drop off from the time window.",
                    "label": 0
                },
                {
                    "sent": "So we want to.",
                    "label": 0
                },
                {
                    "sent": "So we want to compute the influence vector incrementally and updated.",
                    "label": 0
                },
                {
                    "sent": "We use two mechanisms update and propagate to to compute the influence vector incrementally.",
                    "label": 0
                },
                {
                    "sent": "As we as we move the time window, some of the notes will appear and some of the notes will disappear from the time window.",
                    "label": 0
                },
                {
                    "sent": "So we use to keep to manage which index which bit belongs to what user.",
                    "label": 1
                },
                {
                    "sent": "We use a locking mechanism which is known as lock with vector in a lot of vector.",
                    "label": 0
                },
                {
                    "sent": "The 0 means a free entry and the one means an occupied occupied, but that is the lock is issued.",
                    "label": 0
                },
                {
                    "sent": "For example, if you see the user V. In a queue we can see that the Lock pick index of two has been occupied by V. That is, the 2nd entry from the right, which is.",
                    "label": 0
                },
                {
                    "sent": "If we assume that the indexes started from zero from the right in the locking deadlock.",
                    "label": 0
                },
                {
                    "sent": "With vector sonotube, it index mapping is stored in a Q and obviously say this all the bits.",
                    "label": 0
                },
                {
                    "sent": "All the logs should be allocated dynamically.",
                    "label": 0
                },
                {
                    "sent": "So let's let's consider the node W here.",
                    "label": 0
                },
                {
                    "sent": "Then W at the lock to W is 1 and we can see only the node V is influenced by the node W in this time window.",
                    "label": 0
                },
                {
                    "sent": "So if you could see the inference vector of node off node W, the big one and two are one which one bit is corresponding to node B and one week to respond to itself.",
                    "label": 0
                },
                {
                    "sent": "That is double.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let's say we slide up the current time window.",
                    "label": 1
                },
                {
                    "sent": "So this node we will drop off from the current time window.",
                    "label": 1
                },
                {
                    "sent": "So we first delete the entry from the queue.",
                    "label": 0
                },
                {
                    "sent": "Then we update the lock as we see here that is we free the lock that is by making the big O.",
                    "label": 0
                },
                {
                    "sent": "Then we update all the influence vectors that is we go to all the nodes in the current time we do.",
                    "label": 0
                },
                {
                    "sent": "We make that Big Zero because now the lock is.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now let's say a new note has been added to the to the time window.",
                    "label": 1
                },
                {
                    "sent": "So the first issue, the lock, then add the enter into the queue, so the first 3 lock is the bit index two that we allocate to be assertive, and then we compute's influence vector by propagation.",
                    "label": 1
                },
                {
                    "sent": "Which is like this.",
                    "label": 0
                },
                {
                    "sent": "So we see the number of followers of Note P is 4 in this time window, and it's a number of bits number of 1 bits in the influence vector of bits minus one.",
                    "label": 1
                },
                {
                    "sent": "So we can calculate the influence metrics just by counting the number of 1 bits into the influence vector.",
                    "label": 0
                },
                {
                    "sent": "But and once we compute the influence metrics, it's very easy to compute all the.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Leaders, but when it comes to the tribe leaders, the influence metrics is not enough.",
                    "label": 0
                },
                {
                    "sent": "So we extend the idea of influence metrics to influence cube, which is a 3 dimensional data structure where each entry represent that the user V is influenced by user.",
                    "label": 0
                },
                {
                    "sent": "Further action a within time within the time threshold type.",
                    "label": 0
                },
                {
                    "sent": "We do not explicitly compute the whole cube due to sparsity.",
                    "label": 1
                },
                {
                    "sent": "We do a lot of optimization, but do a lack of time.",
                    "label": 0
                },
                {
                    "sent": "I will not go into all these optimizations.",
                    "label": 0
                },
                {
                    "sent": "We see that the.",
                    "label": 0
                },
                {
                    "sent": "Sorry, so the computing tribe leaders.",
                    "label": 0
                },
                {
                    "sent": "The problem computing Tribe leaders is same as discovering existence of frequent item sets of size larger than a given threshold.",
                    "label": 1
                },
                {
                    "sent": "A lot of work has been done in the frequent pattern mining an Association rule mining, so we will not go into this.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But it's very fast, like, although the theoretical complexity is exponential, but in practice it's very fast.",
                    "label": 0
                },
                {
                    "sent": "So as we see in the in the in previous algorithms the only true, although there are many thresholds like the threshold on the number of users, had told the number of actions on time.",
                    "label": 0
                },
                {
                    "sent": "But the only truly mandatory sexual desire which is a time threshold and other threshold come into role only when the influence metrics has been computed.",
                    "label": 0
                },
                {
                    "sent": "So we just need one scan for one time or the action.",
                    "label": 0
                },
                {
                    "sent": "So the complexity of influence computing influence metrics is order of Tiana Square in bit level operations.",
                    "label": 1
                },
                {
                    "sent": "It's much faster than the normal operations.",
                    "label": 0
                },
                {
                    "sent": "So the capital T is a total number of couples in action log.",
                    "label": 1
                },
                {
                    "sent": "Capital A is a total number of distinct actions and small N is a maximum number of nodes that are visible in any opposition of the current time window all the time window.",
                    "label": 1
                },
                {
                    "sent": "We already know that the smaller is much, much less than capital and becausw the size of influence.",
                    "label": 0
                },
                {
                    "sent": "User influence graph is much less than size of propagation craft.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "The complexity of tribe leaders is as follows.",
                    "label": 0
                },
                {
                    "sent": "The complexity of computing influence Cuba is same as computing influence metrics, but finding existence of recurrent item sets is exponential in fury in.",
                    "label": 0
                },
                {
                    "sent": "But there are lots of optimizations that work has been done and there are lots of optimization.",
                    "label": 0
                },
                {
                    "sent": "One other people is is presented by one of the Co authors.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Launch in 2003.",
                    "label": 0
                },
                {
                    "sent": "Let's start.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "See the results.",
                    "label": 0
                },
                {
                    "sent": "So data we use Yahoo Messenger, Yahoo Instant Messenger, the social Graph and Yahoo movies rating as an action or where we consider the action as user U rated the movie and at time step T. We join these two graphs through the common user identifier, so we started with the Yahoo Instant Messenger graph with 110 million nodes which are most active users in this and 21 million ratings from Yahoo movies.",
                    "label": 1
                },
                {
                    "sent": "But when we took a map join of these two, we ended with 217 thousand nodes and 221 thousand edges with 1.8.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Greetings, let's see how the data look likes.",
                    "label": 0
                },
                {
                    "sent": "So when we took him join we see there are a lot of different day lot of disjoint connected components, the number of which is 46,000.",
                    "label": 0
                },
                {
                    "sent": "One of them is a giant component which contains 94 K users and rest of all are small small connected components have which have less than 50 or so.",
                    "label": 1
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Note so this graph shows the number of leaders that we discovered with respect to the user threshold side.",
                    "label": 0
                },
                {
                    "sent": "We obviously that number of Tribe leaders would be the lesson number of leaders because all the tribe leaders are leaders we see.",
                    "label": 1
                },
                {
                    "sent": "As you can see, it looks like exponential degrees with the parameters side.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This graph shows the number of leaders that we discovered with respect to two different.",
                    "label": 1
                },
                {
                    "sent": "The constraints, which is a PSI which is titled or number of users answering machine threshold and number of actions as expected.",
                    "label": 1
                },
                {
                    "sent": "As we make the all the threshold title, the number of leaders discovered are less.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This graph shows the scalability of our of our algorithm.",
                    "label": 0
                },
                {
                    "sent": "As you can see, even if we consider 2 million ratings which is on the right side, the time taken is only one minute to scan the whole table to compute the all the leaders.",
                    "label": 0
                },
                {
                    "sent": "And this is the cause.",
                    "label": 0
                },
                {
                    "sent": "All the operations are big level up.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Actions.",
                    "label": 0
                },
                {
                    "sent": "As you recall, the genuine we want to avoid the fake leaders due to some of the advertising campaigns like they can ask that we just we just want to target the general leaders.",
                    "label": 0
                },
                {
                    "sent": "We found that the generously leadership is almost in binary concept.",
                    "label": 1
                },
                {
                    "sent": "That means either all the leaders.",
                    "label": 0
                },
                {
                    "sent": "Either the leaders are totally genuine or they're totally fake that is dominated by others.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This table shows the top ten tribe leaders with respect to type size.",
                    "label": 0
                },
                {
                    "sent": "As you can say, we found that the tribe leaders exhibit high confidence that you can see the generally the confidence is higher on the higher side.",
                    "label": 1
                },
                {
                    "sent": "We also found that the tribe leaders who has lower general score for the.",
                    "label": 0
                },
                {
                    "sent": "For example in the rank 5 user they are dominated by the other tribe leaders present in the same table.",
                    "label": 1
                },
                {
                    "sent": "For example, this user five has been dominated by user four and six in the current in the industry.",
                    "label": 0
                },
                {
                    "sent": "We found we also found that many users that act as a leader in many actions, but not being a try.",
                    "label": 1
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, so a lot of work has been done in the domain.",
                    "label": 0
                },
                {
                    "sent": "For example identifying influential users that their classical papers are Domino's Richardson campy days upon very good paper in identifying influential bloggers by other wall.",
                    "label": 1
                },
                {
                    "sent": "There's a lot of work has been done in identifying communities of traffic.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Add this and this.",
                    "label": 0
                },
                {
                    "sent": "Days of work done in influence and coalition social network by Alice Ann.",
                    "label": 1
                },
                {
                    "sent": "Sorry I can't pronounce it there is a work done by in revenue maximization in viral marketing by hotline.",
                    "label": 0
                },
                {
                    "sent": "There is also worked on in near optimal sensor placement for a great detection and we saw that today in earlier to our support there's a heat diffusion model.",
                    "label": 1
                },
                {
                    "sent": "Very interesting paper.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "By Elmo.",
                    "label": 0
                },
                {
                    "sent": "So conclusion we propose a framework.",
                    "label": 0
                },
                {
                    "sent": "So in this paper we proposed framework which is based on frequent pattern mining for discovering leaders in social network.",
                    "label": 1
                },
                {
                    "sent": "We formally define the problem of extracting leaders from social graph and action log.",
                    "label": 1
                },
                {
                    "sent": "We define lot various motions of leaders, tribe leaders there variants like confidence genuine.",
                    "label": 0
                },
                {
                    "sent": "Then we go ahead and develop the efficient algorithms for extracting these leaders of various flavors.",
                    "label": 1
                },
                {
                    "sent": "We just need the one Passover.",
                    "label": 0
                },
                {
                    "sent": "The whole action lock table to compute all all these things and we demonstrated the utility and scalability.",
                    "label": 0
                },
                {
                    "sent": "Algorithms by an extensive set of experiments on available data set, which is Yahoo Move Messenger.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Home visiting so the ongoing work so grew.",
                    "label": 0
                },
                {
                    "sent": "Mine is a pattern mining system for discovering leaders and tribe, which is to appear in the ICD 2009.",
                    "label": 1
                },
                {
                    "sent": "We are also working on the leadership cube which I tried the following question.",
                    "label": 1
                },
                {
                    "sent": "What kind of leaders attract?",
                    "label": 0
                },
                {
                    "sent": "What kind of followers for what kind of actions?",
                    "label": 1
                },
                {
                    "sent": "Like in some domains, some users are leader but in other domains they're not.",
                    "label": 0
                },
                {
                    "sent": "They're not effective at all, so we want to see what leaders actually are effective in what domains.",
                    "label": 0
                },
                {
                    "sent": "We are also looking how this framework can be used in solving the viral marketing problems.",
                    "label": 0
                },
                {
                    "sent": "And it is interesting to ask the question that whether whether, for example, in the paper that I paper by Aris.",
                    "label": 0
                },
                {
                    "sent": "They show that it's not.",
                    "label": 0
                },
                {
                    "sent": "It's very challenging to define the term influence, so we come.",
                    "label": 0
                },
                {
                    "sent": "We presented a computational framework to identify the leaders and it is.",
                    "label": 0
                },
                {
                    "sent": "It's an interesting question to ask whether to keep this computational computational framework and still have this strong.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Notion of influence thanks.",
                    "label": 0
                },
                {
                    "sent": "OK, now it's for the questions.",
                    "label": 0
                },
                {
                    "sent": "Hi Sam of life or I should be or how long can determine the true pie according to state with the name that you will have and also whether the algorithm with generalized if you say a going over the same data set with the.",
                    "label": 0
                },
                {
                    "sent": "In Central Valley supplies.",
                    "label": 0
                },
                {
                    "sent": "It's a very interesting question.",
                    "label": 0
                },
                {
                    "sent": "So basically I'm finding the true value of π.",
                    "label": 0
                },
                {
                    "sent": "It's the it's very similar to what we use in the frequent pattern mining like we have support and confidence.",
                    "label": 0
                },
                {
                    "sent": "We play with different threshold and see what is, uh, what should be the true value of any of any threshold.",
                    "label": 0
                },
                {
                    "sent": "But generally like if we see the pile should be like in the weeks one week, two weeks, three weeks or one month.",
                    "label": 0
                },
                {
                    "sent": "So the domain shoot of the pipe should be like months or weeks depending on what's your what are you looking at like?",
                    "label": 0
                },
                {
                    "sent": "What's your technologies?",
                    "label": 0
                },
                {
                    "sent": "One more question.",
                    "label": 0
                },
                {
                    "sent": "Connected component.",
                    "label": 0
                },
                {
                    "sent": "So basically, if you see the original Yahoo Messenger graph, OK here, Lexa.",
                    "label": 0
                },
                {
                    "sent": "So my quarter.",
                    "label": 0
                },
                {
                    "sent": "My call from Member Services market.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure about about.",
                    "label": 0
                },
                {
                    "sent": "This really is a football game.",
                    "label": 0
                },
                {
                    "sent": "OK thanks.",
                    "label": 0
                }
            ]
        }
    }
}