{
    "id": "3dbptawg4s4cxd6eqocsomfyhpe4yen3",
    "title": "Network reconstruction",
    "info": {
        "author": [
            "Ljupčo Todorovski, Department of Intelligent Systems, Jožef Stefan Institute"
        ],
        "published": "Jan. 31, 2017",
        "recorded": "September 2016",
        "category": [
            "Top->Computer Science",
            "Top->Data Science"
        ]
    },
    "url": "http://videolectures.net/miningdata2016_todorovski_network_reconstruction/",
    "segmentation": [
        [
            "So I'm talking about I'm going to continue to talk about network network mining away, but I will.",
            "I will stick to one point which is.",
            "Remember the logical slide with all the possible task for a bit.",
            "Listen.",
            "Happy posting these it this point of this type of area very tiny square.",
            "Which step network reconstruction so networking construction is what I'm going to talk about here.",
            "This is joint work with plugging in special for this difference."
        ],
        [
            "So the network reconstruction task is also important as network inference task, and in particular we have here a situation where we have we already know that we observe some notes in the network and we observed time series data in each node.",
            "And what we are interested to find an both what we would like to find as an output of the National People's Action Task is what kind of network topology?",
            "What kind of network structure in terms of connection between nodes, would lead to the behavior we observe at the left hand side.",
            "So what how can we infer the direct links between the nodes from the observed time series individuals?",
            "That's the.",
            "That's the task I'm going to talk about here."
        ],
        [
            "There, what is the motivation for solving this task?",
            "There are many applications actually and I am going to focus and there are many develop methods for solving this this task, and if I if I try to motivate this this task I would.",
            "I would emphasize several applications, most notably in by informatics we have gene expression data time serious or gene expression data.",
            "So genes are known denouncing the network unknown, but we want to infer.",
            "The change regulatory networks, meaning that we want to find the edges which represents regulations.",
            "Then in social networks, for example, from time series of number of retweets of a particular Twitter account and many Twitter accounts, we want to infer, for example, influence network.",
            "So how how the information is being spread in?",
            "You can also imagine similar applications in collaborative environments.",
            "Such as Wikipedia, where we observe the number of particle edits and we want to see how they may be to infer from that the information propagation thing.",
            "So how I'm doing probation is being propagated between R and etc etc.",
            "So in climate, for example, you can observe on a regular grid grid, from from the satellite screening of, for example, participation at different around the globe.",
            "You can identify the geographical regions affected by linear example by observing.",
            "The neighboring node that is very firm.",
            "So anyway, there are many so motivated by this wide variety of applications which can be tackled, tackled using the general network reconstruction methods.",
            "Many methods have been developed there and they operate actually on various staring with formal representation of the network, summer sometime revision, some of them have differential equations in the non summer, so the terministic stochastic etc.",
            "So again I will refer to the slides that we.",
            "So just in the previous talk, we saw that there are variety of networks that can be resolved.",
            "But what we are doing here is actually we take the relevance network approach and I'm going to focus on on particular on a single method where we actually."
        ],
        [
            "We came as equal standing connect work with just the terministic connection."
        ],
        [
            "It's not exactly easy, network is just."
        ],
        [
            "Regular network without victory stick and actions and interpretation.",
            "So the assumption of the randomness network approach is that the high similarity between the time series we observe in two notes actually indicate the presence of a network link between them.",
            "Uh, approach and the focus.",
            "Then these methods in actually or measuring how how similar are the time series into not the problem.",
            "Of course, we observed immediately.",
            "Is that the similarity measure on?",
            "Between the notes is symmetric, meaning that we we're going to end up with undirected network because all the all the similarity measures and also personalized measure service metric solely as a solution.",
            "We have these two step algorithm wherein the first step using the similarity measures we get to the similarity matrix which is symmetric.",
            "Then we have a symmetry breaking scoring scheme.",
            "The symmetry basically storage scheme transforms a similarity metrics into the weights, metrics metrics of.",
            "Weights on on the particular agent edges in the network, and then we usually apply a simple thresholding scheme to decide which are present and wish her the absolute means.",
            "Oranges in the in the Internet, and that with the best in metrics which can be actually interpreted.",
            "So that's a basic overview of the relevance network approach is pretty simple."
        ],
        [
            "This has been used in this context.",
            "And what is not there now?",
            "This talk about is that apart from giving a brief survey of their elements, network approaches and I will mostly focus on introducing different similarity measures that can be used in the story.",
            "Seems that have been used and I can give you a solid for the first part of the talk in some better manual.",
            "I mean, really, a large amount of.",
            "Of different measures and schemes have been used.",
            "So the question I'm trying to answer here is next in line to measure in each story speed should be used in University restriction.",
            "Now Michelangelo's answer you.",
            "You're going to hear tomorrow, I suppose.",
            "Is that we should use all of them at the same time, then learn how to combine.",
            "But I will rephrase the question in the hidden slightly different manner and I would ask myself what works there.",
            "So I'm curious to find out which similarity, measure and restarted scheme is appropriate in a in a in a given prompts given the paramount network size, time series, land headset.",
            "So ideally by doing this I will be able to provide recommendations.",
            "Lamb to Partitioner who has a particular data set three times it is to have a idea about the size of network, because the number of nodes is known and then somehow I would like.",
            "Director, writer, compassionate shape you know you should use Measure X and scoring scheme Y see if there is a large number of nodes you observe and the thanks here is not working.",
            "So basically that's."
        ],
        [
            "So that's the end of this obvious stop before getting there, I'm going first introduced the.",
            "I almost introduced available network approach, but now I'm going to need to talk about the details.",
            "What kind of similarity measures can be used?",
            "Both of the scoring schemes and then I will go into presenting comparison methodology actually which helps us compare different relevance networks, algorithm variants and then provide these recommendations may be in if we find something interesting, so we performed a lot of experimental.",
            "Operation on many datasets and from these empirical data using the methodology, I'm going to present this in breaker results and try to answer the question what works where."
        ],
        [
            "So the similarity among similarity measure and how so the pain serious offenders form to this similarity metrics using a similarity measure Now similarity measure is pretty simple mapping.",
            "So given two times serious here, I assume that the time series have orders in all the nodes are in the same lens.",
            "Now Samsung Life measure can code also with different me here so.",
            "These numbers are different, but the mostly network reconstruction task is about observing the same time the same length time series in all the nodes, and then I want to say how similar so the result says or detects whether there is a.",
            "What is the extent of the nonlinear relation between the two given time series?",
            "Like so many different measures have been proposed in literature, will record the networking perception task of course, and I'm going to present here similarity measures from 5 clusters, so some of them are based on distances.",
            "Then we have done anything.",
            "Dropping relations, mutual information and symbolic appearance in bowling seems when I ask myself what works where another spoiler alert, it seems that symbolic symbolic dynamics.",
            "So make sure it's based on symbolic dynamics.",
            "Work so well so dedicated, more time, exciting design.",
            "I assume that most of your machine learning will know what the others."
        ],
        [
            "So, but there, but just to remind you so distances are being used in terms of measuring the similarity.",
            "In contrast serious by making quite a injured assumption that that actually time seriously, we regard that I'm serious are vectors and then we measure the distance between the back.",
            "And here, in order to measure the similarity between the time series, we actually meant to measure the distance between the two vectors.",
            "Something new, two vectors is simply the penor motivator.",
            "It's X -- Y index empire measuring on.",
            "The P norm uses the usual forms of being or we uses the metric distance 41 and it didn't make sense for me to an often used with non resident wiper network.",
            "Reconstruction is also setting P = 10, that's.",
            "I wonder why quotes?",
            "I mean from 10 being the next room number.",
            "I don't know what the reason was.",
            "So for Gleason, so similar to similarity, what should what can we do?",
            "Because it's obviously there are, you know the opposite terms of distance is not really similarity, but very simple frequency continues to to actually transfer."
        ],
        [
            "Measuring similarity, and you need the same transformation of business measuring the similarity if you want to measure the similarity of time series based on dynamic thing, time, role.",
            "So if you use the usual distance between time series, the usual distance between times, here's assumes a fixed alignment between points.",
            "Because you have one times.",
            "Here's another time series and the same the same.",
            "You measure actually the distance is indeed illegal time points.",
            "And you assume this mapping one to one mapping between the time points.",
            "Now in general, when you have a serious, you might be also interesting to fail to to take into account.",
            "Maybe the the face delays and then to play around with the mapping in different time points.",
            "So you say you know that I'm pointing the 1st.",
            "I'm serious the first time point is related actually to the feast time point in the second day.",
            "And what you are looking for in dynamic time wrapping wrapping is actually optimal mapping between 2 * 0 X&Y such that the points of all the points for Macs are linked to all the points on why?",
            "So?",
            "Each point should participate, know all the points, so each point index is participate in at least one Lincoln.",
            "It's going and why as well.",
            "So so you somehow find a mapping with complete coverage of the points in X&Y and the sum of the link lengths then.",
            "The differences between the values on the on the notes at the end of this link is supposed to be minimal, so here is the difference between X&Y illustrated is at a different time points, so we have.",
            "We are seven 9.056 time points, and you deserve that.",
            "There is small difference here, but there are large differences on the side and then what you would like to see the Shades of Grey actually like compared with smaller defense.",
            "And actually then you use dynamic programming to find this optimal mapping the optimal path through these metrics actually, which then leads to the to the dynamic does to the distance in terms of dynamic dynamic camera timer.",
            "So so this particular mapping here showed tells you that, for example the mapping the endpoint 10.1 is related to something trackpoint pointing in the second time series and look at the end of it as a friend.",
            ".2.",
            "Connection to two.",
            "Points there now different variants of the dynamic programming formula leads to different."
        ],
        [
            "Dynamic time roping valiance available online.",
            "So another way to measure similarity between times here is which we already.",
            "So in the landlord's office.",
            "Croatians now he had all the formulas, but they don't think anything standing match day, so they usually want experience some.",
            "But then if you are, if you are worried about robustness to nonlocal distributions then you can replace them in Spearman or Kendall.",
            "Gangl correlation coefficient.",
            "Often in network for network construction we use simply the square value, so we don't care whether the correlation coefficient have negative or positive value, because the direction of a relationship is not really important, but we are interested in is the degree of relationship between between the two nodes.",
            "And please don't confuse it at this point.",
            "Please don't confuse the direction of relationship in terms of positive and negative with the causal direction, so we're not there.",
            "Whenever we have correlation, we can.",
            "Also we can only.",
            "Infer that agree of correlation between those who knows, but we don't have a clue what is the direction of the of the connection between."
        ],
        [
            "So another way to measure as a measure of similarity between time series is mutual information that mutual information read the time series again as random variables and what we observe here is actually the.",
            "What is the amount of of the of the of entropy which remains when you observe the X&Y?",
            "So X&Y, have some interdependence, and then we measure actually the mutual information between X&Y and use that as an indicator of similarity with these two Times Now to properly measure to properly measure the entropy.",
            "These methods usually require discretization of America variables and here and hence again when using mutual information to measure similarity.",
            "Because I'm serious, what you can expect is different variance.",
            "The variance of the metals are actually different discretization methods which are being used to calculate them the.",
            "There in what is being discretized actually is really surprised by just an accident right before going to the Calculator.",
            "The entropy is there."
        ],
        [
            "Now, as I said at the beginning that it seems that for network construction quality or symbolic distance measure work very well and I'm going to illustrate here 2 simple variants of these symbolic symbolic distance measures, just to give you a glimpse of how however healthy work and what is the basic idea.",
            "So we have here 2 times Heroes X&Y, that seems too.",
            "They seem to be pretty similar.",
            "And now, in this evolving approach, we have not really interested in that if I even want to put any kind of scale on the on the on the Y axis here.",
            "So the scale here is not very important.",
            "What we observe is actually the ordering or the other trend patterns in the.",
            "Ataxia, so we started to observe from here we make all of the possible pairwise comparisons between the time points.",
            "If we say OK to observe, this is the first and the second time point.",
            "We see that the X increases and the same happens with.",
            "Why?",
            "So here it is actually this morning and then we can repeat this 10 times for all the pairwise combinations of nine points.",
            "And then we can see that there is a single point where the two times here is actually disagree in terms of these points.",
            "In this particular case, so we say simply here, and these are the points.",
            "Actually.",
            "The second important point.",
            "So we have decreasing percent serious, an increase in the 2nd, and we seem to say OK, so the distance between these two is 1 / 10 years ago.",
            "And then of course, this is the very the most simple variant of the symbolic distance distance.",
            "Now in symbolic dynamics they developed."
        ],
        [
            "They developed the different variants of this of this approach and more general variance.",
            "So the more general kinda obvious visualization of the previous slide showed is instead of observing only the pairwise, the pairs of time points, you can observe top also of time point, so 2344 couples, etc.",
            "So for three couples then you go through a single time series.",
            "And you identify the symbols are associated with a patient.",
            "So for three or four or this three time points patterns, you can see here that the first we have these patterns where the time series increases and decreases but decreases again.",
            "If I compare, these two actually decreases less that increasing the first step.",
            "So actually we have a pattern P2.",
            "But then, for example, if I deserve this type in here, I can see that the spectrum here which is between.",
            "The second, the 3rd and 4th point.",
            "That's the pattern P4.",
            "CNN, there's limited number of papers we could observe here you have a complete set of six patterns for the treat them points, so you have the.",
            "So what happens in these symbolic dynamics approach is actually you transform your observed time series into a vacuum versus Poly vector of paper and sort of trend patterns and ordering patterns.",
            "In the meantime serious.",
            "And then you can imagine that this is just a symbolic vector and we can compare them symbolic vectors in time series.",
            "That's the best approach being used.",
            "And of course there are variants here for four to five seats that I mean usually after spending time points is being used as a."
        ],
        [
            "Tricks of similarity.",
            "And those deal now.",
            "Actually, I provided a brief overview of what kind of the OR you got a glimpse of what kind of measure can be used to for simulating a time series.",
            "And now we're going into this.",
            "Second, the second phase of the relevance network approach where we apply a scoring scheme and this scoring scheme is applied in order to break the symmetry of the.",
            "Uh.",
            "Similarity measure Now the the most commonly used approach to break the symmetry of the similarity metrics is to apply timesheet.",
            "No, the fashion conservative, awaiting further direction not if you cover.",
            "Of course all the relationships and it relies on a very simple, observational, very simple touristic.",
            "I would say that if you assume so you observe ahead relation between X&Y and you would like to know whether it is X influences Y or Brian.",
            "Can you see what you can do is to start shifting X the assumed cause in this relationship you start to shift their time series to the right.",
            "You supported him time and then you expect also that the similarity correlation between X&Y would increase.",
            "Because the cost is somehow preceding the.",
            "But what happens to captains after so so?",
            "Actually if you move the course or working time, you're going to be aligned with the consequences.",
            "So that's the time shifting the time shifting support so that I'm shooting or actually score.",
            "It doesn't exactly that, it shifts the.",
            "The Times Leader said goodbye and thanks to figure out what is the direction of them of the.",
            "How bad relationship?",
            "And after that we also have many.",
            "Apart from that we could also body and switch would develop which would mostly developed in gene reconstruction network context.",
            "I numerate them here."
        ],
        [
            "But there are widely presented elsewhere vintage and I'm keen to go to my."
        ],
        [
            "Actually, to my last part of the talk.",
            "So we had a we had different scoring schemes, some of them in there.",
            "Maybe that is interesting.",
            "There's an imp."
        ],
        [
            "Additional sample bank still magic combined with crashing into identify the causal direction, but some of them are important to mention here because they focus on finding out spurious connections between you because you can imagine that if you measure correlations between nodes, you're not going to identify only the direct links, but you're also going to identify the uh, never might be on direct between us in terms of X is connected to yyz and then you."
        ],
        [
            "Also find out the colorations of today."
        ],
        [
            "This is it later to see, but but maybe that was like this.",
            "Sleep, which will be included in the network.",
            "So in order to find out now which similarity measure in which correct scheme works where we performed extensive experiments, one second variance was reported, 44 E gene regulatory networks here have some statistics about them.",
            "We have 313 times serious data.",
            "They have copper.",
            "Partially covered network nodes.",
            "And we select for each network we selected only those datasets they fought with the power at least 95% of the network nodes.",
            "Because we wanted to do to do reconstruction.",
            "So some of these I'm serious actually cover only 50% of the number of nodes they wanted to have something from.",
            "The data set is really aligned with the network we were trying to to infer.",
            "So that means that we had 2020 Denver construction.",
            "Because for some for some members we had available state assessment without my money.",
            "Anyway, we also."
        ],
        [
            "Applied the rebel centric approach to the well known Dream Challenge.",
            "Example people section we we do or.",
            "The challenge and the challenge would be the.",
            "Engineer was the Eagles, actually 2 two networks.",
            "The datasets are syntactic because they are they are produced with the simulation tool, but the two datasets were related to the first is large compared to the other side.",
            "Here in large networks.",
            "You know, expressing thousands of nodes and we had four network reconstruction task."
        ],
        [
            "Path on the previous slide.",
            "We can't go on the East Network and the other side.",
            "We have small networks."
        ],
        [
            "300 nodes"
        ],
        [
            "The metrics we apply to you already seem there are 19 different similarity measures.",
            "There're 6 coding schemes giving 100 and.",
            "14 instances of the general relevance network approach we perform more than two almost 3000 experiments to cover all the datasets with all the methods and we observe 3 performance measures thing to realize whether the.",
            "Regular method works so well, so.",
            "In our area under precision recall Curve and Eddie Anderson, Precision recall curve curve you interested in only if they really only focus only there is cereal types."
        ],
        [
            "So the comparison methodology is.",
            "It is a bit complex.",
            "We couldn't go into into evidence, drank beer comes because every trade diagram.",
            "So only focus on a single performance measure.",
            "So you have to select one among the performance measure results before and we want example to be more general and can be able to say something about the comparisons of the method in the context of three of three performance measures at the same time and then to do that we went through this three step.",
            "Protocol, the first step is to to actually throw out the best performance using the student.",
            "He said the lady of 0.05 it's a 1 sample student test and we're interested.",
            "Actually, in we check whether the method does at least as well as the default.",
            "And then if he doesn't we we, we broke out from other people and the average was also of course calculating on the whole network.",
            "Then then we go a step further and compare the average rankings of the well performing methods by obtaining the parade of currency.",
            "The 3D performance space.",
            "So now we don't have a simple linear linear ordering of the of the methods because we don't compare one performance measure, we get 3.",
            "So we have decided to proceed.",
            "The dimension space and we we observe actually what is included in the in the first part of town.",
            "So the breaker.",
            "We rank them.",
            "We actually instead of having a sheet or best friend method, we have a whole.",
            "All safe medical switch which rely on from that.",
            "And then we analyzed for the top three rate of.",
            "Once we analyze what similarity measure can be used in what's next?"
        ],
        [
            "So to make it simpler that he test is just a little late in the metrics that I mean it's selecting the metals which game which have apartments above."
        ],
        [
            "Skull.",
            "Then this is the projection of the three dimensional performance space into 2 dimensional performance space where we can see the points are metals.",
            "And the and the lines here and different colors like isn't practical.",
            "So this is the.",
            "This is a great product with the test methods.",
            "As you can see here the symbolic.",
            "This is the simplest symbolic.",
            "A symbolic qualitative distance measure is the exact values of death.",
            "With three different scoring schemes is ranked among the best of three methyl around, best, and indistinguishable between them.",
            "They are every transfer between 6 and 13.",
            "Then we have again on the second level, correct problem with the second best Director Front.",
            "We have also pre mentals.",
            "We have Pearson correlation with the mutual information and again symbolic qualitative distance measure.",
            "But then on the second vehicle, from the metrics kept the ranking between 8 and 13.",
            "So we clearly see how the ranks now increase.",
            "The logic and find actually group of methods which really worked well for formatting.",
            "At least you can interpret as a kind of more complex ranking diagram where different colors are actually actually corresponding to the top end networks.",
            "The middle rank medals, and this is the worst network, and then there are some methods which were reported to memorize.",
            "The difference between these interactions are before is that we don't have any angle of measure of significant at this point.",
            "How significant is the difference between the 1st and the performance in the 1st and the 2nd?",
            "This is the two."
        ],
        [
            "Projection along Richmond to see this is this is the MBS transformation of the three despacito 20 just to have the service station so it's.",
            "Multidimensional scaling mathematicians."
        ],
        [
            "OK, and then we do the analysis of the parade performed in terms of how often different similarity measures now are observed in the first cycle, prompting the second biographies and top meter.",
            "The top performing metal piece of the uniform measures and and and.",
            "So there are all performing well as opposed to the address.",
            "And now we're interested to see what kind of similarity measures could involve there and what kind of scoring seems.",
            "Now we can see that overall experience is the similarity measures show that mostly symbolic similarity measure is.",
            "Is involved in the top performing variants of the album?",
            "Some of them also include mutual information and then we have somewhere correlation stuff as well.",
            "But what is missing from this slide?",
            "We can see that actually no different based metrics are being included in the among the top performance.",
            "So from this from the left hand side here, but we can say for network reconstruction algorithms, if you want to do a good network introspection, you shouldn't go forward the link with the with the with distance, measure pets name on the on the all experiments that we confirm, that's the average.",
            "And when it comes to on the other hand, when it comes to scoring, seems intended restoring be transferring schemes can be found among the top problems, so there is no clear conclusion about what scoring scheme."
        ],
        [
            "Recommendation can be provided to you.",
            "But what we did the front on is we're wanting to find.",
            "Also, as I said, what works where, so we want it also to distinguish between large network, small networks, East network being challenge network, and a long time serious sharpened series.",
            "So two different properties of the data and then put the task we wanted to see."
        ],
        [
            "How bad influence on the?"
        ],
        [
            "On the performance of the method and at this point we want to check how much time we have till the end.",
            "Repos like.",
            "10 + 10 Plus."
        ],
        [
            "OK, other words.",
            "The warning before was for 50.",
            "OK, thank you.",
            "Yeah, sure OK, no nothing to carry.",
            "I will go slowly.",
            "So.",
            "First, we compared whether the source of the data set in the network have some kind of influence on the performance and on the top performance.",
            "So we wanted to find out whether you know the network construction methods perform differently in East Forest Networks and for 3:55 challenge networks.",
            "And here we compare the similarity measure.",
            "And we can see that the from the color field that the changes.",
            "In East, all the top performers in for these networks use the simple symbolic quality distance measure I showed you, which just observing the pair raise the pairwise dance.",
            "And the four bedroom 5 these are in larger networks.",
            "If you remember, we said the metals which are larger, the best performers, are still the only the dark green, which means the symbolic similarity measures are also almost exclusively among the top performer.",
            "So.",
            "But we see, we see here that if we end up there, if we see what kind of measures are being really used.",
            "Is that those are the more complex symbolic measures which include the symbolic happens not on the pairwise comparison, but under on the model?",
            "Conclusion from these slides can be again that we both cases no symbolic measures at the top performance, but then in the case of East also mutual information, the light green color.",
            "The Nike measures based on mutual information."
        ],
        [
            "Again, when it comes to scoring, scheme is difficult in sequel to generalize, what happens in the East Network that is surprisingly enough for the larger networks beyond the I mean the the only scoring scheme which appears among the top performances, marinated in knowing that the murder Net was the only the only scoring scheme which are missing among the top performances in this case.",
            "So there is obviously some.",
            "Important influence of the scoring scheme on the on the size of the network on the selection of the storage scheme.",
            "What is that kind of influence?",
            "I think that there's a better time.",
            "Require certain instigation, but the indicator of this slide is that modern at might be responding scheme which is now central specialized portal largely.",
            "And works well."
        ],
        [
            "Then we analyze also the influence of the network sites.",
            "So here we will regroup the networks.",
            "I showed you the six networks I showed you into three groups, group of small networks at the Group of Medium Network and group of large input which obviously coins needs with the group of the networks on the dynamic.",
            "From the three 5 change.",
            "So this is the same group as we were before.",
            "But then put the East the actually the cluster planning to two groups and observe what works now for small networks or medium networks in terms of large networks and again for large networks.",
            "We saw that before large networks, actually complex symbolic similarity measure work best, but again among the top performers we see a lot of.",
            "A lot of symbolic measures again, so they prevailed almost in all cases.",
            "The only case where we see the prevailing on sort of mutual information based similarity measures is when we observe medium size networks.",
            "So for medium size network, it seems that the individual information correlation receptionist and works well as well.",
            "For the other cases, the there is the symbolic.",
            "That similarity measure prevail.",
            "But the another indicator of the differences we observe here is that the network price seems to be important factor when selecting the appropriate similarity measure, which was discipline to certain extent it was, it was something unexpected, but we."
        ],
        [
            "We see that there are even more important factors.",
            "Now the scoring schemes.",
            "If we see what is the influence of how, how the size of a network influences on top performance in terms of the scoring schemes.",
            "Now this coding schemes in this situation is just like before we can see the storage schemes activities, which only means it's very hard to say among company.",
            "For this you can see almost everything is small and medium scale networks, but again there is an absence of murder next coding scheme and then murder mates.",
            "Going scheme actually works well for the large network which we realized.",
            "So there is no obvious relation here and Onvia's conclusion which can be used for a clear recommendation of what kind of scoring scheme."
        ],
        [
            "And the and the final analysis we did.",
            "We also did the analysis based on the property of the data set in terms of how longer that I'm serious, which are provided for network construction wanted.",
            "Also think wanted to see how that influence on the performing different methods.",
            "So now again we see three graphs of top performers when it comes to short the bank serious, medium term, serious and long time series against the group.",
            "And now we can see an important difference here.",
            "So for the long time series, the red color actually chorus.",
            "Come to the Pearson correlation coefficient.",
            "Use this as a way to Nationals in that entire series, and you can see that there's some correlation works well for long time series which was expected somehow.",
            "It's a.",
            "It's a well known fact that if you have long time serious, probably it's not very wise to go into this symbolic.",
            "Sorry it's not.",
            "It's the plane distances.",
            "And that was a surprise.",
            "I mean, people, corporations are expected to be here, but what works actually best among the long time series is the Caribbean and help anymore.",
            "So it's playing distances between vectors to be observed.",
            "So we regard for defense inspectors in playing the videos that you measured the distances and that is the formula for example.",
            "In long-term any points.",
            "Longest how many points along is more than 59 points?",
            "Which is good when you combine it with symbolic symbolic.",
            "I mean, yeah, it was.",
            "Symbolic symbolic of metals Cordova.",
            "Measuring the similarity functions that Ncos were actually developed for short.",
            "And in terms of computational efficiency, because yeah, from that point of view, it's good that they are best for me.",
            "Not sure whether that's about.",
            "Operations on different levels, so that's."
        ],
        [
            "And again, when it comes to when it comes to time, seriously, it seems that I'm super sensitive, not important factor when any.",
            "The thinking is second most important factors that would provide us any kind of hint on how to select the story.",
            "So this call is being nice again.",
            "Here and we cannot provide a reasonable recommendation, except that maybe."
        ],
        [
            "All of them should be tried.",
            "So."
        ],
        [
            "What would be the general conclusion then of what?"
        ],
        [
            "Provided.",
            "Conclusion is pretty clear if you want to do network reconstruction, and you're not sure what kind of similarity measure to use, it's certainly very safe to assume that you would go into measuring the similarities using symbolic dynamics and the.",
            "Just based on that.",
            "At the simple quality distance measurer showed is the best overall performer.",
            "The doctors order for small medium networks and short to medium length lenses.",
            "You would go into more complex symbolic measures if you could.",
            "If you sort of like larger networks, no, not necessarily longer time serious, but sometime before election networks.",
            "Now, if you will.",
            "If you observe a medium size network, then you can also maybe look into using Pearson correlation or instead of symbolic measures for the obvious reason of complexity.",
            "Computational complexity.",
            "Distance is work well for long time series, so here it is also obvious that we could observe one thing seriously wouldn't go into into struggles of calibrating the symbolic hammocks and everything.",
            "Mutual Info top performers are also among the exhaust for Porsche.",
            "I'm serious for you, so if you have short, I'm serious.",
            "You actually have a whole a whole range of possible Maple syrup select among and it was very interesting observation to see that the thing that I'm referring to when it comes to network people section is never among the top performers.",
            "So probably it's pretty expensive.",
            "I mean, it's quite impressive to to calculate this.",
            "Probably if you do network reconstruction with scene."
        ],
        [
            "That this results for Gene.",
            "Puerto Rico Section G network.",
            "It seems that the results indicate that you might also consider it going in.",
            "There are several local issues we're looking at right now.",
            "Analysis One open issue is where we are now a decomposed the analysis into analysis of the performance with regard to this Internet connection and separately with regard to the scoring scheme.",
            "Now it seems there is a conjecture that signal is something like measure, so it's working better with some scoring schemes and vice versa.",
            "And then we would like also to extend this analysis in that sense, like to see what are the.",
            "Combination both of the combo switch which worked well and we took the breaking of broken combinations.",
            "Do never performed well.",
            "Of course, if you want to do a deeper analysis with.",
            "Conservation professionals we need more exciting releases.",
            "The boring part of work.",
            "We need more experiments and more benchmarks, so we had to like probably the other gene regulatory network.",
            "Benchmarks perform experiments and then include that in our analysis and we would like also to see other domains because that would be that would also show whether whether these similarity network transporting schemes should be differently chosen for different domains, so.",
            "They might be offsetting.",
            "But what a sample excited excites us most about this research is that also it provides a general methodology for comparison of metrics performance in machine learning.",
            "The machine learning.",
            "Mostly we're obsessed with this, comparing which to make up words Becker or significantly better.",
            "And this methodology is usually, I mean wherever the drinkability, which is why we use now focused on the single performance measure.",
            "So we want to know what is the, what is the ranking with regard to the single performance measure.",
            "What we provide here.",
            "But we try to tackle here is taking into account multiple performance.",
            "It's more complex than visualizations, are more complex, but I think it's worth the effort because it's not only accuracy, it's not only one aspect of accuracy is usually interesting when they want is to.",
            "When they want to choose their metaphor.",
            "Mental.",
            "Thanks for using the practical application."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'm talking about I'm going to continue to talk about network network mining away, but I will.",
                    "label": 0
                },
                {
                    "sent": "I will stick to one point which is.",
                    "label": 0
                },
                {
                    "sent": "Remember the logical slide with all the possible task for a bit.",
                    "label": 0
                },
                {
                    "sent": "Listen.",
                    "label": 0
                },
                {
                    "sent": "Happy posting these it this point of this type of area very tiny square.",
                    "label": 0
                },
                {
                    "sent": "Which step network reconstruction so networking construction is what I'm going to talk about here.",
                    "label": 0
                },
                {
                    "sent": "This is joint work with plugging in special for this difference.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the network reconstruction task is also important as network inference task, and in particular we have here a situation where we have we already know that we observe some notes in the network and we observed time series data in each node.",
                    "label": 1
                },
                {
                    "sent": "And what we are interested to find an both what we would like to find as an output of the National People's Action Task is what kind of network topology?",
                    "label": 0
                },
                {
                    "sent": "What kind of network structure in terms of connection between nodes, would lead to the behavior we observe at the left hand side.",
                    "label": 0
                },
                {
                    "sent": "So what how can we infer the direct links between the nodes from the observed time series individuals?",
                    "label": 0
                },
                {
                    "sent": "That's the.",
                    "label": 0
                },
                {
                    "sent": "That's the task I'm going to talk about here.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There, what is the motivation for solving this task?",
                    "label": 0
                },
                {
                    "sent": "There are many applications actually and I am going to focus and there are many develop methods for solving this this task, and if I if I try to motivate this this task I would.",
                    "label": 0
                },
                {
                    "sent": "I would emphasize several applications, most notably in by informatics we have gene expression data time serious or gene expression data.",
                    "label": 0
                },
                {
                    "sent": "So genes are known denouncing the network unknown, but we want to infer.",
                    "label": 0
                },
                {
                    "sent": "The change regulatory networks, meaning that we want to find the edges which represents regulations.",
                    "label": 0
                },
                {
                    "sent": "Then in social networks, for example, from time series of number of retweets of a particular Twitter account and many Twitter accounts, we want to infer, for example, influence network.",
                    "label": 1
                },
                {
                    "sent": "So how how the information is being spread in?",
                    "label": 1
                },
                {
                    "sent": "You can also imagine similar applications in collaborative environments.",
                    "label": 0
                },
                {
                    "sent": "Such as Wikipedia, where we observe the number of particle edits and we want to see how they may be to infer from that the information propagation thing.",
                    "label": 0
                },
                {
                    "sent": "So how I'm doing probation is being propagated between R and etc etc.",
                    "label": 1
                },
                {
                    "sent": "So in climate, for example, you can observe on a regular grid grid, from from the satellite screening of, for example, participation at different around the globe.",
                    "label": 1
                },
                {
                    "sent": "You can identify the geographical regions affected by linear example by observing.",
                    "label": 0
                },
                {
                    "sent": "The neighboring node that is very firm.",
                    "label": 1
                },
                {
                    "sent": "So anyway, there are many so motivated by this wide variety of applications which can be tackled, tackled using the general network reconstruction methods.",
                    "label": 0
                },
                {
                    "sent": "Many methods have been developed there and they operate actually on various staring with formal representation of the network, summer sometime revision, some of them have differential equations in the non summer, so the terministic stochastic etc.",
                    "label": 0
                },
                {
                    "sent": "So again I will refer to the slides that we.",
                    "label": 0
                },
                {
                    "sent": "So just in the previous talk, we saw that there are variety of networks that can be resolved.",
                    "label": 0
                },
                {
                    "sent": "But what we are doing here is actually we take the relevance network approach and I'm going to focus on on particular on a single method where we actually.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We came as equal standing connect work with just the terministic connection.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's not exactly easy, network is just.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Regular network without victory stick and actions and interpretation.",
                    "label": 0
                },
                {
                    "sent": "So the assumption of the randomness network approach is that the high similarity between the time series we observe in two notes actually indicate the presence of a network link between them.",
                    "label": 1
                },
                {
                    "sent": "Uh, approach and the focus.",
                    "label": 0
                },
                {
                    "sent": "Then these methods in actually or measuring how how similar are the time series into not the problem.",
                    "label": 1
                },
                {
                    "sent": "Of course, we observed immediately.",
                    "label": 0
                },
                {
                    "sent": "Is that the similarity measure on?",
                    "label": 0
                },
                {
                    "sent": "Between the notes is symmetric, meaning that we we're going to end up with undirected network because all the all the similarity measures and also personalized measure service metric solely as a solution.",
                    "label": 0
                },
                {
                    "sent": "We have these two step algorithm wherein the first step using the similarity measures we get to the similarity matrix which is symmetric.",
                    "label": 0
                },
                {
                    "sent": "Then we have a symmetry breaking scoring scheme.",
                    "label": 0
                },
                {
                    "sent": "The symmetry basically storage scheme transforms a similarity metrics into the weights, metrics metrics of.",
                    "label": 0
                },
                {
                    "sent": "Weights on on the particular agent edges in the network, and then we usually apply a simple thresholding scheme to decide which are present and wish her the absolute means.",
                    "label": 0
                },
                {
                    "sent": "Oranges in the in the Internet, and that with the best in metrics which can be actually interpreted.",
                    "label": 0
                },
                {
                    "sent": "So that's a basic overview of the relevance network approach is pretty simple.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This has been used in this context.",
                    "label": 0
                },
                {
                    "sent": "And what is not there now?",
                    "label": 1
                },
                {
                    "sent": "This talk about is that apart from giving a brief survey of their elements, network approaches and I will mostly focus on introducing different similarity measures that can be used in the story.",
                    "label": 1
                },
                {
                    "sent": "Seems that have been used and I can give you a solid for the first part of the talk in some better manual.",
                    "label": 0
                },
                {
                    "sent": "I mean, really, a large amount of.",
                    "label": 0
                },
                {
                    "sent": "Of different measures and schemes have been used.",
                    "label": 0
                },
                {
                    "sent": "So the question I'm trying to answer here is next in line to measure in each story speed should be used in University restriction.",
                    "label": 0
                },
                {
                    "sent": "Now Michelangelo's answer you.",
                    "label": 1
                },
                {
                    "sent": "You're going to hear tomorrow, I suppose.",
                    "label": 1
                },
                {
                    "sent": "Is that we should use all of them at the same time, then learn how to combine.",
                    "label": 0
                },
                {
                    "sent": "But I will rephrase the question in the hidden slightly different manner and I would ask myself what works there.",
                    "label": 1
                },
                {
                    "sent": "So I'm curious to find out which similarity, measure and restarted scheme is appropriate in a in a in a given prompts given the paramount network size, time series, land headset.",
                    "label": 0
                },
                {
                    "sent": "So ideally by doing this I will be able to provide recommendations.",
                    "label": 0
                },
                {
                    "sent": "Lamb to Partitioner who has a particular data set three times it is to have a idea about the size of network, because the number of nodes is known and then somehow I would like.",
                    "label": 0
                },
                {
                    "sent": "Director, writer, compassionate shape you know you should use Measure X and scoring scheme Y see if there is a large number of nodes you observe and the thanks here is not working.",
                    "label": 1
                },
                {
                    "sent": "So basically that's.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that's the end of this obvious stop before getting there, I'm going first introduced the.",
                    "label": 0
                },
                {
                    "sent": "I almost introduced available network approach, but now I'm going to need to talk about the details.",
                    "label": 0
                },
                {
                    "sent": "What kind of similarity measures can be used?",
                    "label": 1
                },
                {
                    "sent": "Both of the scoring schemes and then I will go into presenting comparison methodology actually which helps us compare different relevance networks, algorithm variants and then provide these recommendations may be in if we find something interesting, so we performed a lot of experimental.",
                    "label": 1
                },
                {
                    "sent": "Operation on many datasets and from these empirical data using the methodology, I'm going to present this in breaker results and try to answer the question what works where.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the similarity among similarity measure and how so the pain serious offenders form to this similarity metrics using a similarity measure Now similarity measure is pretty simple mapping.",
                    "label": 0
                },
                {
                    "sent": "So given two times serious here, I assume that the time series have orders in all the nodes are in the same lens.",
                    "label": 0
                },
                {
                    "sent": "Now Samsung Life measure can code also with different me here so.",
                    "label": 0
                },
                {
                    "sent": "These numbers are different, but the mostly network reconstruction task is about observing the same time the same length time series in all the nodes, and then I want to say how similar so the result says or detects whether there is a.",
                    "label": 0
                },
                {
                    "sent": "What is the extent of the nonlinear relation between the two given time series?",
                    "label": 1
                },
                {
                    "sent": "Like so many different measures have been proposed in literature, will record the networking perception task of course, and I'm going to present here similarity measures from 5 clusters, so some of them are based on distances.",
                    "label": 0
                },
                {
                    "sent": "Then we have done anything.",
                    "label": 0
                },
                {
                    "sent": "Dropping relations, mutual information and symbolic appearance in bowling seems when I ask myself what works where another spoiler alert, it seems that symbolic symbolic dynamics.",
                    "label": 0
                },
                {
                    "sent": "So make sure it's based on symbolic dynamics.",
                    "label": 0
                },
                {
                    "sent": "Work so well so dedicated, more time, exciting design.",
                    "label": 0
                },
                {
                    "sent": "I assume that most of your machine learning will know what the others.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So, but there, but just to remind you so distances are being used in terms of measuring the similarity.",
                    "label": 0
                },
                {
                    "sent": "In contrast serious by making quite a injured assumption that that actually time seriously, we regard that I'm serious are vectors and then we measure the distance between the back.",
                    "label": 0
                },
                {
                    "sent": "And here, in order to measure the similarity between the time series, we actually meant to measure the distance between the two vectors.",
                    "label": 1
                },
                {
                    "sent": "Something new, two vectors is simply the penor motivator.",
                    "label": 0
                },
                {
                    "sent": "It's X -- Y index empire measuring on.",
                    "label": 1
                },
                {
                    "sent": "The P norm uses the usual forms of being or we uses the metric distance 41 and it didn't make sense for me to an often used with non resident wiper network.",
                    "label": 0
                },
                {
                    "sent": "Reconstruction is also setting P = 10, that's.",
                    "label": 0
                },
                {
                    "sent": "I wonder why quotes?",
                    "label": 0
                },
                {
                    "sent": "I mean from 10 being the next room number.",
                    "label": 0
                },
                {
                    "sent": "I don't know what the reason was.",
                    "label": 1
                },
                {
                    "sent": "So for Gleason, so similar to similarity, what should what can we do?",
                    "label": 0
                },
                {
                    "sent": "Because it's obviously there are, you know the opposite terms of distance is not really similarity, but very simple frequency continues to to actually transfer.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Measuring similarity, and you need the same transformation of business measuring the similarity if you want to measure the similarity of time series based on dynamic thing, time, role.",
                    "label": 0
                },
                {
                    "sent": "So if you use the usual distance between time series, the usual distance between times, here's assumes a fixed alignment between points.",
                    "label": 0
                },
                {
                    "sent": "Because you have one times.",
                    "label": 0
                },
                {
                    "sent": "Here's another time series and the same the same.",
                    "label": 0
                },
                {
                    "sent": "You measure actually the distance is indeed illegal time points.",
                    "label": 0
                },
                {
                    "sent": "And you assume this mapping one to one mapping between the time points.",
                    "label": 0
                },
                {
                    "sent": "Now in general, when you have a serious, you might be also interesting to fail to to take into account.",
                    "label": 0
                },
                {
                    "sent": "Maybe the the face delays and then to play around with the mapping in different time points.",
                    "label": 0
                },
                {
                    "sent": "So you say you know that I'm pointing the 1st.",
                    "label": 0
                },
                {
                    "sent": "I'm serious the first time point is related actually to the feast time point in the second day.",
                    "label": 0
                },
                {
                    "sent": "And what you are looking for in dynamic time wrapping wrapping is actually optimal mapping between 2 * 0 X&Y such that the points of all the points for Macs are linked to all the points on why?",
                    "label": 0
                },
                {
                    "sent": "So?",
                    "label": 0
                },
                {
                    "sent": "Each point should participate, know all the points, so each point index is participate in at least one Lincoln.",
                    "label": 1
                },
                {
                    "sent": "It's going and why as well.",
                    "label": 1
                },
                {
                    "sent": "So so you somehow find a mapping with complete coverage of the points in X&Y and the sum of the link lengths then.",
                    "label": 0
                },
                {
                    "sent": "The differences between the values on the on the notes at the end of this link is supposed to be minimal, so here is the difference between X&Y illustrated is at a different time points, so we have.",
                    "label": 0
                },
                {
                    "sent": "We are seven 9.056 time points, and you deserve that.",
                    "label": 0
                },
                {
                    "sent": "There is small difference here, but there are large differences on the side and then what you would like to see the Shades of Grey actually like compared with smaller defense.",
                    "label": 0
                },
                {
                    "sent": "And actually then you use dynamic programming to find this optimal mapping the optimal path through these metrics actually, which then leads to the to the dynamic does to the distance in terms of dynamic dynamic camera timer.",
                    "label": 0
                },
                {
                    "sent": "So so this particular mapping here showed tells you that, for example the mapping the endpoint 10.1 is related to something trackpoint pointing in the second time series and look at the end of it as a friend.",
                    "label": 0
                },
                {
                    "sent": ".2.",
                    "label": 0
                },
                {
                    "sent": "Connection to two.",
                    "label": 1
                },
                {
                    "sent": "Points there now different variants of the dynamic programming formula leads to different.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Dynamic time roping valiance available online.",
                    "label": 0
                },
                {
                    "sent": "So another way to measure similarity between times here is which we already.",
                    "label": 0
                },
                {
                    "sent": "So in the landlord's office.",
                    "label": 0
                },
                {
                    "sent": "Croatians now he had all the formulas, but they don't think anything standing match day, so they usually want experience some.",
                    "label": 0
                },
                {
                    "sent": "But then if you are, if you are worried about robustness to nonlocal distributions then you can replace them in Spearman or Kendall.",
                    "label": 0
                },
                {
                    "sent": "Gangl correlation coefficient.",
                    "label": 0
                },
                {
                    "sent": "Often in network for network construction we use simply the square value, so we don't care whether the correlation coefficient have negative or positive value, because the direction of a relationship is not really important, but we are interested in is the degree of relationship between between the two nodes.",
                    "label": 0
                },
                {
                    "sent": "And please don't confuse it at this point.",
                    "label": 0
                },
                {
                    "sent": "Please don't confuse the direction of relationship in terms of positive and negative with the causal direction, so we're not there.",
                    "label": 1
                },
                {
                    "sent": "Whenever we have correlation, we can.",
                    "label": 0
                },
                {
                    "sent": "Also we can only.",
                    "label": 1
                },
                {
                    "sent": "Infer that agree of correlation between those who knows, but we don't have a clue what is the direction of the of the connection between.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So another way to measure as a measure of similarity between time series is mutual information that mutual information read the time series again as random variables and what we observe here is actually the.",
                    "label": 1
                },
                {
                    "sent": "What is the amount of of the of the of entropy which remains when you observe the X&Y?",
                    "label": 0
                },
                {
                    "sent": "So X&Y, have some interdependence, and then we measure actually the mutual information between X&Y and use that as an indicator of similarity with these two Times Now to properly measure to properly measure the entropy.",
                    "label": 0
                },
                {
                    "sent": "These methods usually require discretization of America variables and here and hence again when using mutual information to measure similarity.",
                    "label": 0
                },
                {
                    "sent": "Because I'm serious, what you can expect is different variance.",
                    "label": 1
                },
                {
                    "sent": "The variance of the metals are actually different discretization methods which are being used to calculate them the.",
                    "label": 0
                },
                {
                    "sent": "There in what is being discretized actually is really surprised by just an accident right before going to the Calculator.",
                    "label": 0
                },
                {
                    "sent": "The entropy is there.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, as I said at the beginning that it seems that for network construction quality or symbolic distance measure work very well and I'm going to illustrate here 2 simple variants of these symbolic symbolic distance measures, just to give you a glimpse of how however healthy work and what is the basic idea.",
                    "label": 0
                },
                {
                    "sent": "So we have here 2 times Heroes X&Y, that seems too.",
                    "label": 0
                },
                {
                    "sent": "They seem to be pretty similar.",
                    "label": 0
                },
                {
                    "sent": "And now, in this evolving approach, we have not really interested in that if I even want to put any kind of scale on the on the on the Y axis here.",
                    "label": 0
                },
                {
                    "sent": "So the scale here is not very important.",
                    "label": 0
                },
                {
                    "sent": "What we observe is actually the ordering or the other trend patterns in the.",
                    "label": 0
                },
                {
                    "sent": "Ataxia, so we started to observe from here we make all of the possible pairwise comparisons between the time points.",
                    "label": 0
                },
                {
                    "sent": "If we say OK to observe, this is the first and the second time point.",
                    "label": 0
                },
                {
                    "sent": "We see that the X increases and the same happens with.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "So here it is actually this morning and then we can repeat this 10 times for all the pairwise combinations of nine points.",
                    "label": 0
                },
                {
                    "sent": "And then we can see that there is a single point where the two times here is actually disagree in terms of these points.",
                    "label": 0
                },
                {
                    "sent": "In this particular case, so we say simply here, and these are the points.",
                    "label": 0
                },
                {
                    "sent": "Actually.",
                    "label": 0
                },
                {
                    "sent": "The second important point.",
                    "label": 0
                },
                {
                    "sent": "So we have decreasing percent serious, an increase in the 2nd, and we seem to say OK, so the distance between these two is 1 / 10 years ago.",
                    "label": 0
                },
                {
                    "sent": "And then of course, this is the very the most simple variant of the symbolic distance distance.",
                    "label": 0
                },
                {
                    "sent": "Now in symbolic dynamics they developed.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "They developed the different variants of this of this approach and more general variance.",
                    "label": 0
                },
                {
                    "sent": "So the more general kinda obvious visualization of the previous slide showed is instead of observing only the pairwise, the pairs of time points, you can observe top also of time point, so 2344 couples, etc.",
                    "label": 1
                },
                {
                    "sent": "So for three couples then you go through a single time series.",
                    "label": 0
                },
                {
                    "sent": "And you identify the symbols are associated with a patient.",
                    "label": 0
                },
                {
                    "sent": "So for three or four or this three time points patterns, you can see here that the first we have these patterns where the time series increases and decreases but decreases again.",
                    "label": 0
                },
                {
                    "sent": "If I compare, these two actually decreases less that increasing the first step.",
                    "label": 0
                },
                {
                    "sent": "So actually we have a pattern P2.",
                    "label": 0
                },
                {
                    "sent": "But then, for example, if I deserve this type in here, I can see that the spectrum here which is between.",
                    "label": 0
                },
                {
                    "sent": "The second, the 3rd and 4th point.",
                    "label": 0
                },
                {
                    "sent": "That's the pattern P4.",
                    "label": 0
                },
                {
                    "sent": "CNN, there's limited number of papers we could observe here you have a complete set of six patterns for the treat them points, so you have the.",
                    "label": 0
                },
                {
                    "sent": "So what happens in these symbolic dynamics approach is actually you transform your observed time series into a vacuum versus Poly vector of paper and sort of trend patterns and ordering patterns.",
                    "label": 1
                },
                {
                    "sent": "In the meantime serious.",
                    "label": 0
                },
                {
                    "sent": "And then you can imagine that this is just a symbolic vector and we can compare them symbolic vectors in time series.",
                    "label": 1
                },
                {
                    "sent": "That's the best approach being used.",
                    "label": 0
                },
                {
                    "sent": "And of course there are variants here for four to five seats that I mean usually after spending time points is being used as a.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Tricks of similarity.",
                    "label": 0
                },
                {
                    "sent": "And those deal now.",
                    "label": 0
                },
                {
                    "sent": "Actually, I provided a brief overview of what kind of the OR you got a glimpse of what kind of measure can be used to for simulating a time series.",
                    "label": 1
                },
                {
                    "sent": "And now we're going into this.",
                    "label": 0
                },
                {
                    "sent": "Second, the second phase of the relevance network approach where we apply a scoring scheme and this scoring scheme is applied in order to break the symmetry of the.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "Similarity measure Now the the most commonly used approach to break the symmetry of the similarity metrics is to apply timesheet.",
                    "label": 0
                },
                {
                    "sent": "No, the fashion conservative, awaiting further direction not if you cover.",
                    "label": 0
                },
                {
                    "sent": "Of course all the relationships and it relies on a very simple, observational, very simple touristic.",
                    "label": 0
                },
                {
                    "sent": "I would say that if you assume so you observe ahead relation between X&Y and you would like to know whether it is X influences Y or Brian.",
                    "label": 0
                },
                {
                    "sent": "Can you see what you can do is to start shifting X the assumed cause in this relationship you start to shift their time series to the right.",
                    "label": 1
                },
                {
                    "sent": "You supported him time and then you expect also that the similarity correlation between X&Y would increase.",
                    "label": 0
                },
                {
                    "sent": "Because the cost is somehow preceding the.",
                    "label": 0
                },
                {
                    "sent": "But what happens to captains after so so?",
                    "label": 1
                },
                {
                    "sent": "Actually if you move the course or working time, you're going to be aligned with the consequences.",
                    "label": 0
                },
                {
                    "sent": "So that's the time shifting the time shifting support so that I'm shooting or actually score.",
                    "label": 0
                },
                {
                    "sent": "It doesn't exactly that, it shifts the.",
                    "label": 1
                },
                {
                    "sent": "The Times Leader said goodbye and thanks to figure out what is the direction of them of the.",
                    "label": 0
                },
                {
                    "sent": "How bad relationship?",
                    "label": 0
                },
                {
                    "sent": "And after that we also have many.",
                    "label": 0
                },
                {
                    "sent": "Apart from that we could also body and switch would develop which would mostly developed in gene reconstruction network context.",
                    "label": 0
                },
                {
                    "sent": "I numerate them here.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But there are widely presented elsewhere vintage and I'm keen to go to my.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Actually, to my last part of the talk.",
                    "label": 1
                },
                {
                    "sent": "So we had a we had different scoring schemes, some of them in there.",
                    "label": 0
                },
                {
                    "sent": "Maybe that is interesting.",
                    "label": 0
                },
                {
                    "sent": "There's an imp.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Additional sample bank still magic combined with crashing into identify the causal direction, but some of them are important to mention here because they focus on finding out spurious connections between you because you can imagine that if you measure correlations between nodes, you're not going to identify only the direct links, but you're also going to identify the uh, never might be on direct between us in terms of X is connected to yyz and then you.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also find out the colorations of today.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is it later to see, but but maybe that was like this.",
                    "label": 0
                },
                {
                    "sent": "Sleep, which will be included in the network.",
                    "label": 0
                },
                {
                    "sent": "So in order to find out now which similarity measure in which correct scheme works where we performed extensive experiments, one second variance was reported, 44 E gene regulatory networks here have some statistics about them.",
                    "label": 0
                },
                {
                    "sent": "We have 313 times serious data.",
                    "label": 0
                },
                {
                    "sent": "They have copper.",
                    "label": 0
                },
                {
                    "sent": "Partially covered network nodes.",
                    "label": 0
                },
                {
                    "sent": "And we select for each network we selected only those datasets they fought with the power at least 95% of the network nodes.",
                    "label": 1
                },
                {
                    "sent": "Because we wanted to do to do reconstruction.",
                    "label": 0
                },
                {
                    "sent": "So some of these I'm serious actually cover only 50% of the number of nodes they wanted to have something from.",
                    "label": 0
                },
                {
                    "sent": "The data set is really aligned with the network we were trying to to infer.",
                    "label": 0
                },
                {
                    "sent": "So that means that we had 2020 Denver construction.",
                    "label": 0
                },
                {
                    "sent": "Because for some for some members we had available state assessment without my money.",
                    "label": 0
                },
                {
                    "sent": "Anyway, we also.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Applied the rebel centric approach to the well known Dream Challenge.",
                    "label": 0
                },
                {
                    "sent": "Example people section we we do or.",
                    "label": 0
                },
                {
                    "sent": "The challenge and the challenge would be the.",
                    "label": 0
                },
                {
                    "sent": "Engineer was the Eagles, actually 2 two networks.",
                    "label": 0
                },
                {
                    "sent": "The datasets are syntactic because they are they are produced with the simulation tool, but the two datasets were related to the first is large compared to the other side.",
                    "label": 0
                },
                {
                    "sent": "Here in large networks.",
                    "label": 0
                },
                {
                    "sent": "You know, expressing thousands of nodes and we had four network reconstruction task.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Path on the previous slide.",
                    "label": 0
                },
                {
                    "sent": "We can't go on the East Network and the other side.",
                    "label": 0
                },
                {
                    "sent": "We have small networks.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "300 nodes",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The metrics we apply to you already seem there are 19 different similarity measures.",
                    "label": 1
                },
                {
                    "sent": "There're 6 coding schemes giving 100 and.",
                    "label": 0
                },
                {
                    "sent": "14 instances of the general relevance network approach we perform more than two almost 3000 experiments to cover all the datasets with all the methods and we observe 3 performance measures thing to realize whether the.",
                    "label": 1
                },
                {
                    "sent": "Regular method works so well, so.",
                    "label": 0
                },
                {
                    "sent": "In our area under precision recall Curve and Eddie Anderson, Precision recall curve curve you interested in only if they really only focus only there is cereal types.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the comparison methodology is.",
                    "label": 1
                },
                {
                    "sent": "It is a bit complex.",
                    "label": 0
                },
                {
                    "sent": "We couldn't go into into evidence, drank beer comes because every trade diagram.",
                    "label": 1
                },
                {
                    "sent": "So only focus on a single performance measure.",
                    "label": 0
                },
                {
                    "sent": "So you have to select one among the performance measure results before and we want example to be more general and can be able to say something about the comparisons of the method in the context of three of three performance measures at the same time and then to do that we went through this three step.",
                    "label": 0
                },
                {
                    "sent": "Protocol, the first step is to to actually throw out the best performance using the student.",
                    "label": 0
                },
                {
                    "sent": "He said the lady of 0.05 it's a 1 sample student test and we're interested.",
                    "label": 1
                },
                {
                    "sent": "Actually, in we check whether the method does at least as well as the default.",
                    "label": 0
                },
                {
                    "sent": "And then if he doesn't we we, we broke out from other people and the average was also of course calculating on the whole network.",
                    "label": 0
                },
                {
                    "sent": "Then then we go a step further and compare the average rankings of the well performing methods by obtaining the parade of currency.",
                    "label": 1
                },
                {
                    "sent": "The 3D performance space.",
                    "label": 0
                },
                {
                    "sent": "So now we don't have a simple linear linear ordering of the of the methods because we don't compare one performance measure, we get 3.",
                    "label": 0
                },
                {
                    "sent": "So we have decided to proceed.",
                    "label": 1
                },
                {
                    "sent": "The dimension space and we we observe actually what is included in the in the first part of town.",
                    "label": 0
                },
                {
                    "sent": "So the breaker.",
                    "label": 1
                },
                {
                    "sent": "We rank them.",
                    "label": 0
                },
                {
                    "sent": "We actually instead of having a sheet or best friend method, we have a whole.",
                    "label": 0
                },
                {
                    "sent": "All safe medical switch which rely on from that.",
                    "label": 0
                },
                {
                    "sent": "And then we analyzed for the top three rate of.",
                    "label": 0
                },
                {
                    "sent": "Once we analyze what similarity measure can be used in what's next?",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to make it simpler that he test is just a little late in the metrics that I mean it's selecting the metals which game which have apartments above.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Skull.",
                    "label": 0
                },
                {
                    "sent": "Then this is the projection of the three dimensional performance space into 2 dimensional performance space where we can see the points are metals.",
                    "label": 1
                },
                {
                    "sent": "And the and the lines here and different colors like isn't practical.",
                    "label": 0
                },
                {
                    "sent": "So this is the.",
                    "label": 0
                },
                {
                    "sent": "This is a great product with the test methods.",
                    "label": 0
                },
                {
                    "sent": "As you can see here the symbolic.",
                    "label": 0
                },
                {
                    "sent": "This is the simplest symbolic.",
                    "label": 0
                },
                {
                    "sent": "A symbolic qualitative distance measure is the exact values of death.",
                    "label": 0
                },
                {
                    "sent": "With three different scoring schemes is ranked among the best of three methyl around, best, and indistinguishable between them.",
                    "label": 0
                },
                {
                    "sent": "They are every transfer between 6 and 13.",
                    "label": 0
                },
                {
                    "sent": "Then we have again on the second level, correct problem with the second best Director Front.",
                    "label": 0
                },
                {
                    "sent": "We have also pre mentals.",
                    "label": 0
                },
                {
                    "sent": "We have Pearson correlation with the mutual information and again symbolic qualitative distance measure.",
                    "label": 0
                },
                {
                    "sent": "But then on the second vehicle, from the metrics kept the ranking between 8 and 13.",
                    "label": 0
                },
                {
                    "sent": "So we clearly see how the ranks now increase.",
                    "label": 0
                },
                {
                    "sent": "The logic and find actually group of methods which really worked well for formatting.",
                    "label": 0
                },
                {
                    "sent": "At least you can interpret as a kind of more complex ranking diagram where different colors are actually actually corresponding to the top end networks.",
                    "label": 0
                },
                {
                    "sent": "The middle rank medals, and this is the worst network, and then there are some methods which were reported to memorize.",
                    "label": 0
                },
                {
                    "sent": "The difference between these interactions are before is that we don't have any angle of measure of significant at this point.",
                    "label": 1
                },
                {
                    "sent": "How significant is the difference between the 1st and the performance in the 1st and the 2nd?",
                    "label": 0
                },
                {
                    "sent": "This is the two.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Projection along Richmond to see this is this is the MBS transformation of the three despacito 20 just to have the service station so it's.",
                    "label": 0
                },
                {
                    "sent": "Multidimensional scaling mathematicians.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, and then we do the analysis of the parade performed in terms of how often different similarity measures now are observed in the first cycle, prompting the second biographies and top meter.",
                    "label": 1
                },
                {
                    "sent": "The top performing metal piece of the uniform measures and and and.",
                    "label": 0
                },
                {
                    "sent": "So there are all performing well as opposed to the address.",
                    "label": 0
                },
                {
                    "sent": "And now we're interested to see what kind of similarity measures could involve there and what kind of scoring seems.",
                    "label": 1
                },
                {
                    "sent": "Now we can see that overall experience is the similarity measures show that mostly symbolic similarity measure is.",
                    "label": 0
                },
                {
                    "sent": "Is involved in the top performing variants of the album?",
                    "label": 0
                },
                {
                    "sent": "Some of them also include mutual information and then we have somewhere correlation stuff as well.",
                    "label": 0
                },
                {
                    "sent": "But what is missing from this slide?",
                    "label": 0
                },
                {
                    "sent": "We can see that actually no different based metrics are being included in the among the top performance.",
                    "label": 0
                },
                {
                    "sent": "So from this from the left hand side here, but we can say for network reconstruction algorithms, if you want to do a good network introspection, you shouldn't go forward the link with the with the with distance, measure pets name on the on the all experiments that we confirm, that's the average.",
                    "label": 0
                },
                {
                    "sent": "And when it comes to on the other hand, when it comes to scoring, seems intended restoring be transferring schemes can be found among the top problems, so there is no clear conclusion about what scoring scheme.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Recommendation can be provided to you.",
                    "label": 0
                },
                {
                    "sent": "But what we did the front on is we're wanting to find.",
                    "label": 0
                },
                {
                    "sent": "Also, as I said, what works where, so we want it also to distinguish between large network, small networks, East network being challenge network, and a long time serious sharpened series.",
                    "label": 0
                },
                {
                    "sent": "So two different properties of the data and then put the task we wanted to see.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How bad influence on the?",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the performance of the method and at this point we want to check how much time we have till the end.",
                    "label": 0
                },
                {
                    "sent": "Repos like.",
                    "label": 0
                },
                {
                    "sent": "10 + 10 Plus.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, other words.",
                    "label": 0
                },
                {
                    "sent": "The warning before was for 50.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you.",
                    "label": 0
                },
                {
                    "sent": "Yeah, sure OK, no nothing to carry.",
                    "label": 0
                },
                {
                    "sent": "I will go slowly.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "First, we compared whether the source of the data set in the network have some kind of influence on the performance and on the top performance.",
                    "label": 0
                },
                {
                    "sent": "So we wanted to find out whether you know the network construction methods perform differently in East Forest Networks and for 3:55 challenge networks.",
                    "label": 0
                },
                {
                    "sent": "And here we compare the similarity measure.",
                    "label": 0
                },
                {
                    "sent": "And we can see that the from the color field that the changes.",
                    "label": 0
                },
                {
                    "sent": "In East, all the top performers in for these networks use the simple symbolic quality distance measure I showed you, which just observing the pair raise the pairwise dance.",
                    "label": 1
                },
                {
                    "sent": "And the four bedroom 5 these are in larger networks.",
                    "label": 0
                },
                {
                    "sent": "If you remember, we said the metals which are larger, the best performers, are still the only the dark green, which means the symbolic similarity measures are also almost exclusively among the top performer.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 1
                },
                {
                    "sent": "But we see, we see here that if we end up there, if we see what kind of measures are being really used.",
                    "label": 1
                },
                {
                    "sent": "Is that those are the more complex symbolic measures which include the symbolic happens not on the pairwise comparison, but under on the model?",
                    "label": 0
                },
                {
                    "sent": "Conclusion from these slides can be again that we both cases no symbolic measures at the top performance, but then in the case of East also mutual information, the light green color.",
                    "label": 0
                },
                {
                    "sent": "The Nike measures based on mutual information.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Again, when it comes to scoring, scheme is difficult in sequel to generalize, what happens in the East Network that is surprisingly enough for the larger networks beyond the I mean the the only scoring scheme which appears among the top performances, marinated in knowing that the murder Net was the only the only scoring scheme which are missing among the top performances in this case.",
                    "label": 1
                },
                {
                    "sent": "So there is obviously some.",
                    "label": 0
                },
                {
                    "sent": "Important influence of the scoring scheme on the on the size of the network on the selection of the storage scheme.",
                    "label": 0
                },
                {
                    "sent": "What is that kind of influence?",
                    "label": 0
                },
                {
                    "sent": "I think that there's a better time.",
                    "label": 0
                },
                {
                    "sent": "Require certain instigation, but the indicator of this slide is that modern at might be responding scheme which is now central specialized portal largely.",
                    "label": 0
                },
                {
                    "sent": "And works well.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then we analyze also the influence of the network sites.",
                    "label": 0
                },
                {
                    "sent": "So here we will regroup the networks.",
                    "label": 0
                },
                {
                    "sent": "I showed you the six networks I showed you into three groups, group of small networks at the Group of Medium Network and group of large input which obviously coins needs with the group of the networks on the dynamic.",
                    "label": 0
                },
                {
                    "sent": "From the three 5 change.",
                    "label": 0
                },
                {
                    "sent": "So this is the same group as we were before.",
                    "label": 0
                },
                {
                    "sent": "But then put the East the actually the cluster planning to two groups and observe what works now for small networks or medium networks in terms of large networks and again for large networks.",
                    "label": 1
                },
                {
                    "sent": "We saw that before large networks, actually complex symbolic similarity measure work best, but again among the top performers we see a lot of.",
                    "label": 1
                },
                {
                    "sent": "A lot of symbolic measures again, so they prevailed almost in all cases.",
                    "label": 0
                },
                {
                    "sent": "The only case where we see the prevailing on sort of mutual information based similarity measures is when we observe medium size networks.",
                    "label": 0
                },
                {
                    "sent": "So for medium size network, it seems that the individual information correlation receptionist and works well as well.",
                    "label": 1
                },
                {
                    "sent": "For the other cases, the there is the symbolic.",
                    "label": 0
                },
                {
                    "sent": "That similarity measure prevail.",
                    "label": 0
                },
                {
                    "sent": "But the another indicator of the differences we observe here is that the network price seems to be important factor when selecting the appropriate similarity measure, which was discipline to certain extent it was, it was something unexpected, but we.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We see that there are even more important factors.",
                    "label": 1
                },
                {
                    "sent": "Now the scoring schemes.",
                    "label": 0
                },
                {
                    "sent": "If we see what is the influence of how, how the size of a network influences on top performance in terms of the scoring schemes.",
                    "label": 0
                },
                {
                    "sent": "Now this coding schemes in this situation is just like before we can see the storage schemes activities, which only means it's very hard to say among company.",
                    "label": 1
                },
                {
                    "sent": "For this you can see almost everything is small and medium scale networks, but again there is an absence of murder next coding scheme and then murder mates.",
                    "label": 0
                },
                {
                    "sent": "Going scheme actually works well for the large network which we realized.",
                    "label": 0
                },
                {
                    "sent": "So there is no obvious relation here and Onvia's conclusion which can be used for a clear recommendation of what kind of scoring scheme.",
                    "label": 1
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the and the final analysis we did.",
                    "label": 0
                },
                {
                    "sent": "We also did the analysis based on the property of the data set in terms of how longer that I'm serious, which are provided for network construction wanted.",
                    "label": 0
                },
                {
                    "sent": "Also think wanted to see how that influence on the performing different methods.",
                    "label": 0
                },
                {
                    "sent": "So now again we see three graphs of top performers when it comes to short the bank serious, medium term, serious and long time series against the group.",
                    "label": 0
                },
                {
                    "sent": "And now we can see an important difference here.",
                    "label": 0
                },
                {
                    "sent": "So for the long time series, the red color actually chorus.",
                    "label": 1
                },
                {
                    "sent": "Come to the Pearson correlation coefficient.",
                    "label": 0
                },
                {
                    "sent": "Use this as a way to Nationals in that entire series, and you can see that there's some correlation works well for long time series which was expected somehow.",
                    "label": 1
                },
                {
                    "sent": "It's a.",
                    "label": 0
                },
                {
                    "sent": "It's a well known fact that if you have long time serious, probably it's not very wise to go into this symbolic.",
                    "label": 0
                },
                {
                    "sent": "Sorry it's not.",
                    "label": 0
                },
                {
                    "sent": "It's the plane distances.",
                    "label": 1
                },
                {
                    "sent": "And that was a surprise.",
                    "label": 0
                },
                {
                    "sent": "I mean, people, corporations are expected to be here, but what works actually best among the long time series is the Caribbean and help anymore.",
                    "label": 0
                },
                {
                    "sent": "So it's playing distances between vectors to be observed.",
                    "label": 0
                },
                {
                    "sent": "So we regard for defense inspectors in playing the videos that you measured the distances and that is the formula for example.",
                    "label": 0
                },
                {
                    "sent": "In long-term any points.",
                    "label": 0
                },
                {
                    "sent": "Longest how many points along is more than 59 points?",
                    "label": 0
                },
                {
                    "sent": "Which is good when you combine it with symbolic symbolic.",
                    "label": 0
                },
                {
                    "sent": "I mean, yeah, it was.",
                    "label": 0
                },
                {
                    "sent": "Symbolic symbolic of metals Cordova.",
                    "label": 0
                },
                {
                    "sent": "Measuring the similarity functions that Ncos were actually developed for short.",
                    "label": 0
                },
                {
                    "sent": "And in terms of computational efficiency, because yeah, from that point of view, it's good that they are best for me.",
                    "label": 0
                },
                {
                    "sent": "Not sure whether that's about.",
                    "label": 0
                },
                {
                    "sent": "Operations on different levels, so that's.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And again, when it comes to when it comes to time, seriously, it seems that I'm super sensitive, not important factor when any.",
                    "label": 0
                },
                {
                    "sent": "The thinking is second most important factors that would provide us any kind of hint on how to select the story.",
                    "label": 0
                },
                {
                    "sent": "So this call is being nice again.",
                    "label": 0
                },
                {
                    "sent": "Here and we cannot provide a reasonable recommendation, except that maybe.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All of them should be tried.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What would be the general conclusion then of what?",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Provided.",
                    "label": 0
                },
                {
                    "sent": "Conclusion is pretty clear if you want to do network reconstruction, and you're not sure what kind of similarity measure to use, it's certainly very safe to assume that you would go into measuring the similarities using symbolic dynamics and the.",
                    "label": 0
                },
                {
                    "sent": "Just based on that.",
                    "label": 0
                },
                {
                    "sent": "At the simple quality distance measurer showed is the best overall performer.",
                    "label": 1
                },
                {
                    "sent": "The doctors order for small medium networks and short to medium length lenses.",
                    "label": 1
                },
                {
                    "sent": "You would go into more complex symbolic measures if you could.",
                    "label": 0
                },
                {
                    "sent": "If you sort of like larger networks, no, not necessarily longer time serious, but sometime before election networks.",
                    "label": 0
                },
                {
                    "sent": "Now, if you will.",
                    "label": 0
                },
                {
                    "sent": "If you observe a medium size network, then you can also maybe look into using Pearson correlation or instead of symbolic measures for the obvious reason of complexity.",
                    "label": 1
                },
                {
                    "sent": "Computational complexity.",
                    "label": 0
                },
                {
                    "sent": "Distance is work well for long time series, so here it is also obvious that we could observe one thing seriously wouldn't go into into struggles of calibrating the symbolic hammocks and everything.",
                    "label": 1
                },
                {
                    "sent": "Mutual Info top performers are also among the exhaust for Porsche.",
                    "label": 0
                },
                {
                    "sent": "I'm serious for you, so if you have short, I'm serious.",
                    "label": 0
                },
                {
                    "sent": "You actually have a whole a whole range of possible Maple syrup select among and it was very interesting observation to see that the thing that I'm referring to when it comes to network people section is never among the top performers.",
                    "label": 0
                },
                {
                    "sent": "So probably it's pretty expensive.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's quite impressive to to calculate this.",
                    "label": 0
                },
                {
                    "sent": "Probably if you do network reconstruction with scene.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That this results for Gene.",
                    "label": 0
                },
                {
                    "sent": "Puerto Rico Section G network.",
                    "label": 0
                },
                {
                    "sent": "It seems that the results indicate that you might also consider it going in.",
                    "label": 0
                },
                {
                    "sent": "There are several local issues we're looking at right now.",
                    "label": 0
                },
                {
                    "sent": "Analysis One open issue is where we are now a decomposed the analysis into analysis of the performance with regard to this Internet connection and separately with regard to the scoring scheme.",
                    "label": 1
                },
                {
                    "sent": "Now it seems there is a conjecture that signal is something like measure, so it's working better with some scoring schemes and vice versa.",
                    "label": 0
                },
                {
                    "sent": "And then we would like also to extend this analysis in that sense, like to see what are the.",
                    "label": 1
                },
                {
                    "sent": "Combination both of the combo switch which worked well and we took the breaking of broken combinations.",
                    "label": 0
                },
                {
                    "sent": "Do never performed well.",
                    "label": 0
                },
                {
                    "sent": "Of course, if you want to do a deeper analysis with.",
                    "label": 0
                },
                {
                    "sent": "Conservation professionals we need more exciting releases.",
                    "label": 0
                },
                {
                    "sent": "The boring part of work.",
                    "label": 1
                },
                {
                    "sent": "We need more experiments and more benchmarks, so we had to like probably the other gene regulatory network.",
                    "label": 0
                },
                {
                    "sent": "Benchmarks perform experiments and then include that in our analysis and we would like also to see other domains because that would be that would also show whether whether these similarity network transporting schemes should be differently chosen for different domains, so.",
                    "label": 1
                },
                {
                    "sent": "They might be offsetting.",
                    "label": 0
                },
                {
                    "sent": "But what a sample excited excites us most about this research is that also it provides a general methodology for comparison of metrics performance in machine learning.",
                    "label": 0
                },
                {
                    "sent": "The machine learning.",
                    "label": 0
                },
                {
                    "sent": "Mostly we're obsessed with this, comparing which to make up words Becker or significantly better.",
                    "label": 0
                },
                {
                    "sent": "And this methodology is usually, I mean wherever the drinkability, which is why we use now focused on the single performance measure.",
                    "label": 0
                },
                {
                    "sent": "So we want to know what is the, what is the ranking with regard to the single performance measure.",
                    "label": 0
                },
                {
                    "sent": "What we provide here.",
                    "label": 0
                },
                {
                    "sent": "But we try to tackle here is taking into account multiple performance.",
                    "label": 1
                },
                {
                    "sent": "It's more complex than visualizations, are more complex, but I think it's worth the effort because it's not only accuracy, it's not only one aspect of accuracy is usually interesting when they want is to.",
                    "label": 0
                },
                {
                    "sent": "When they want to choose their metaphor.",
                    "label": 0
                },
                {
                    "sent": "Mental.",
                    "label": 0
                },
                {
                    "sent": "Thanks for using the practical application.",
                    "label": 0
                }
            ]
        }
    }
}