{
    "id": "3dgqqcy4s6epktrdow6j77agm43ws4o4",
    "title": "Can anyone become an internet troll?",
    "info": {
        "author": [
            "Jure Leskovec, Computer Science Department, Stanford University"
        ],
        "published": "Jan. 4, 2017",
        "recorded": "December 2016",
        "category": [
            "Top->Computer Science"
        ]
    },
    "url": "http://videolectures.net/solomon_leskovec_internet_troll/",
    "segmentation": [
        [
            "So I'm really happy to be here and what I want to talk to you about today is something we all have experienced on the on the Internet.",
            "It's this kind of bad, antisocial behavior that seems to be everywhere, and it's kind of not even clear how to think about it and how can we analyze it and how can we detect it and so on.",
            "So this is kind of about bad behavior on the Internet."
        ],
        [
            "OK, and if you kind of make a step back and you say how should I think about behaviors on the on the web or on the Internet?",
            "There are really kind of two metaphors for the way to think about the web.",
            "One is to think about the web as a library where you know you come.",
            "You and you read and you browse the library and you read a web page and you kind of put it back and go to the next book and so on and so forth.",
            "And the other one.",
            "The other metaphor is something that's kind of much more about.",
            "It's a social place where people gather where people interact with each other.",
            "And really, what has happened in previous years is that this type of metaphor of the web allowed for very different kinds of interactions and kind of created this idea of web."
        ],
        [
            "Other social place, right?",
            "And the crucial part of this idea of web as a social play place is the ability of users to provide content and also feedback on that content that users can interact with each other and that users are the ones that are providing the content.",
            "If you think about Facebook, if nobody would post anything, Facebook would be kind of useless and other social networks as well right?",
            "So it's crucial for people to contribute content and then we can interact with that content, provide feedback, discuss it and so on and so forth."
        ],
        [
            "Right and some successful examples of this.",
            "For example, on Reddit, people would post interesting things."
        ],
        [
            "The largest question answering website.",
            "I'm sure everyone knows it, Stackoverflow.",
            "Whenever you kind of have a programming question somebody has already asked this question on Stackoverflow and somebody has already answered it.",
            "That's kind of a common experience of a programmer today.",
            "You type it on Google.",
            "The first hit is on Stackoverflow and there's your answer."
        ],
        [
            "And of course, even like news websites like CNN, so kind of traditional media, they rely on users for input, so they kind of have this commenting interfaces where discussions about particular news articles can happen."
        ],
        [
            "Of course, many of Slovenian media we kind of many times CD Artikkel and then people can comment.",
            "And there's this like kind of endless pages of comments.",
            "This article, I think, is like 2 days old, but it's already 8 pages of comments and things like that, right?",
            "So this is kind of the user generated."
        ],
        [
            "Right, so how do these two metaphors now compare, right?",
            "Like if you think of web as a library, that's a very kind of easy and simple ecosystem, right?",
            "Everything is static.",
            "Every users experience is the same.",
            "You know the book is the same for everyone.",
            "Maybe some people like one type of books.",
            "Other people, like other types of books, but kind of the content is pre specified.",
            "You go, you read it and you're gone, right?",
            "But if you think about this web as a social place, it's kind of a total mess, right?",
            "Because it is kind of calm like complex dynamic.",
            "Feedback effects where you know one users experience is a function of other users experiences, right?",
            "So if I post something that will affect kind of the entire community and however that Community reacts to that piece of content, that will again affect me.",
            "So it's kind of much more complex, complex way to interact and also more complex to analyze.",
            "So this is kind of very important to realize that it's not that users experience does not only depend on the.",
            "Whoever build the application, but also it depends.",
            "It is a function of everyone else's behavior on the system OK."
        ],
        [
            "So right?",
            "So what do you want now?",
            "If you are the owner of these kinds of websites, you want your users to engage and contribute good content, right?",
            "Cause kind of your application is useless unless people contribute good signal and good content, right?",
            "So in this way, if people are happy if they engage in contributed good content, this means other experience of your other users will be will be better because of that right?",
            "So if you are now let's say someone who wants to build the next social network or the next.",
            "Application that many users would use.",
            "You would start asking yourself how do I keep users engaged?",
            "How do I promote good behavior in my in my system?",
            "How do I ensure the health of the community and the content ecosystem right?",
            "Like if you are an application that is used by many people, these are some of the kind of essential questions you are asking yourself.",
            "How do I ensure my content ecosystem is healthy, meaning that I get new content that you know old content is available?",
            "That content is good.",
            "How do I make sure my community is healthy, right?",
            "That kind of.",
            "People don't fight things like that."
        ],
        [
            "OK, so these are these are the questions.",
            "So now what are some challenges challenges are that we know a lot about kind of average overall behavior of users in online communities.",
            "But many times only a small subset of users in these communities can have like a big effect on the entire community.",
            "So the question then becomes, how do I study and model behavior of such kind of small small groups of users that can have big effect on the community?",
            "And how could I use this insights?",
            "To improve, you know the functioning of online communities."
        ],
        [
            "So this is when we come to this idea of users or small groups of users who behave badly and can have this big disproportionate effects and kind of just to make things simple.",
            "This is what I will call called Troll."
        ],
        [
            "Or throwing right?",
            "So for example, the I'll borrow a definition from Wikipedia, which says that an Internet troll is a person who kind of goes around and shows discord on the Internet, right?",
            "So kind of it starts arguments and upsets people.",
            "It's post inflammatory content, extraneous and off topic messages in a community, right?",
            "And this is kind of what I'd like to study in this talk.",
            "Is is this type of people or this type of behavior that you know?",
            "The that are of this type and just with one word I will call it antisocial behavior.",
            "OK so this is what we're talking about and what I want to do now."
        ],
        [
            "Give us some examples of these types of behavior and this would be in particular.",
            "Here's an article on CNN that discuss is how social media and Facebook kind of impacts women and how women and girls perceived perceived themselves.",
            "It's kind of how it changes and Arthur's self perception because of using social media and all these kind of beautiful happy people posting pictures there."
        ],
        [
            "Right now what I'll show you some series of comments that that you could find if you Scroll down the article.",
            "So here is, you know.",
            "Here's one comment.",
            "You know it says something.",
            "It's on topic we discuss is what the article was."
        ],
        [
            "Here's another one, right like that, maybe is a bit different, right?",
            "Kind of brings in religion immediately.",
            "Things like that.",
            "I give you time, time to read right now.",
            "Given this comment, you can start asking.",
            "OK, what would the replies be?",
            "So here are some of."
        ],
        [
            "The replies to this to this comment right?",
            "Like you see #2, you can read this one right like very quickly things get out of hand right?",
            "So you see that kind of this comment got quite a lot of replies while the previous comment didn't get any replies actually."
        ],
        [
            "So really, and you know, some people come and use kind of profane language and then many."
        ],
        [
            "Times people would actually say, oh, you are a troll, right?",
            "Like this was a reply to that particular content, right?",
            "So kind of what's the problem?"
        ],
        [
            "The problem is that this trolls go and disrupt online online discussions.",
            "So what I want to do first is talk about how are these discussions disrupted OK and then, and then we'll continue and ask further questions.",
            "But the first question is how are online discussion disrupt?"
        ],
        [
            "Right and what we will do is we will examine of the posts of all the users that sometime in the future will be banned from the community.",
            "Will be they be blocked or removed from the community and will ask what?",
            "How are the posts of this user is different than the posts of the rest of the population?"
        ],
        [
            "So for example, the way I'll show you this, I'll show you by examples.",
            "But really at the back end is an analysis statistical analysis that compares average posts and contrast them with the post from this bad users and we ask how are these different an I'm just, you know, give you a fact.",
            "But really at the end there is like AP value behind this and a proper statistical test.",
            "So all the comments I'll give you are.",
            "Real, and this is the title of the article.",
            "This is the article I was talking about before about self perception, right?",
            "Here's a comment.",
            "One thing you notice is that these comments are less positive, so they kind of use more net."
        ],
        [
            "The words the other thing you learn, they use a lot of profane language, right?",
            "Lots of swear words, things like that.",
            "What is also interesting is if you go beyond."
        ],
        [
            "Single post level.",
            "You can start asking how about kind of discussion level and here I'll show you an example.",
            "This was about an article about an NBA star kind of going back and helping his community and kind of bring back dreams and kind of doing something good for the community where this person grew up and you see a lot of kind of nice positive comments.",
            "But then."
        ],
        [
            "When kind of these these bad users come in post, most often you know like what you learn is that the kind of post off topic.",
            "So whatever is the text they post is less similar to the original article or to the post of other people then then what you'd expect.",
            "So really it's kind of less.",
            "It's off topic.",
            "It's more different than the discussion other users are providing and then write what is also interesting is if you now start asking.",
            "OK, so here is this type of post, how much?",
            "Attention does it get by the community and you?"
        ],
        [
            "Quickly learning that actually this type of posts get more replies than normal positive posts, right?",
            "So so they opposed by people who will be banned in the future kind of receive more attention in terms of people replying to them and so on."
        ],
        [
            "And then you can also ask how about this bad users, right?",
            "Maybe if people reply to them or something, do they?",
            "Do they post more and it turns out that actually the trolls tend to post more frequently and also post more into the same thread, right?",
            "Kind of they post to the replies of their own, right?",
            "So kind of you have this small group of people that have that has a very big impact on the on the discussion dynamics in the Community.",
            "So now let me kind of tell you a bit more detail what we did.",
            "And."
        ],
        [
            "How we did it?",
            "OK, so we did a study on city different online communities.",
            "They're quite different, so one is CNN.",
            "IGN is international gamers Network, so this is a site where you can discuss computer games and Breit.",
            "Bart is a site where you can kind of discuss politics and another website we did that I don't mention here is all Kpop which is a website where you can discuss Korean pop music and we get complete data from this website.",
            "So we.",
            "We know the users, we know the posts and we also know the votes we know for every user what articles they voted on and you can vote positively or negatively.",
            "OK and all of these sites are also moderated, right?",
            "So for."
        ],
        [
            "People, if you look at these different websites, you can ask how many posts get deleted by the by the administrators and how many users get banned or blocked from the community and you see for example that on CNN, more than 20% of all posts get deleted by the administrators and then in other communities communities that that number is a bit 10 times slower and then in terms of user banned rate right when user get blocked from the Community it's about 3% in CNN and a bit less in the other.",
            "In the other two community.",
            "And really, everything I will tell you today generalizes across these three very different communities, right?",
            "So kind of events, news, computer games, and politics.",
            "So with these statistics."
        ],
        [
            "What will this stock be about?",
            "It will be about large scale investigation of strolling in online discussion communities and what we will do that will be interesting is we will complement observational data analysis with human experiments, so I will actually be messing with humans and seeing how they react."
        ],
        [
            "OK, so there will be three things I will I will be asking.",
            "First question will be who are trolls, right?",
            "You know what are?",
            "What are kind of mechanisms behind trolling behavior?",
            "Arthros these bad people who maybe were born one way and they just cannot help it themselves or anyone you know here in this room can become a troll.",
            "And actually what will turn out is that we can experimentally manipulate mood and discussion context and show that we can kind of get ordinary people to troll.",
            "So that will be the first thing.",
            "The second thing I will show.",
            "Is that all these feedback loops that I was saying before by being able to vote and being able to reply just makes everything worse.",
            "That voting and replying to each other creates this cascades of bad behavior spreading throughout networks.",
            "This kind of downward spirals and then the last thing I will show you just very briefly about.",
            "How can we detect trolls or bad users very early and we can do about after 10 posts of a person we can detect whether that person will be blocked from the community in the future with, I think 8080%.",
            "What is your 80% AUC?",
            "OK, so these are the three parts of my talk so."
        ],
        [
            "First thing I want to talk about is you know, who are these people?",
            "Who are these trolls?",
            "What makes them troll and why?",
            "Strolling so common?",
            "This is this paper that is about to be published.",
            "I think in February."
        ],
        [
            "And the way prior research has thought about this problem is that you know there are kind of the normal users and then there are these bad users.",
            "You know a few of them spreading the intercom."
        ],
        [
            "Unity, and that is there's a lot of kind of news articles or research around things like Confessions of a former Internet troll.",
            "You know, Internet trolls really horrible people.",
            "Things like that, right?",
            "Like even psychology of Internet trolls and so on.",
            "So what price?"
        ],
        [
            "Research suggests is that troll trolls are born and not made and that these are, you know they have particular personality and that these are this kind of psychopathic individuals, right?",
            "And we kind of wanted to challenge this assumption and say, you know, are trolls really special people?",
            "Or can anyone be turned into a troll?"
        ],
        [
            "OK, So what we start with is this question.",
            "Can we turn ordinary people into into trolling behavior and the way we will?"
        ],
        [
            "We will do this is to we have a hypothesis that there are two mechanisms that modulate this type of behavior.",
            "First, mechanism is the mood of the person, right?",
            "We hypothesize that negative mood increases persons likelihood of trolling, meaning posting bad comments and the other one is that discussion context affects the user susceptibility to troll.",
            "Meaning if the discussion is friendly and there's no troll posts, you are less likely to troll.",
            "If there's already lots of bad comments.",
            "The hypothesis is, or.",
            "The prediction is that you will be more likely to throw OK, so that's those are two hypothesis.",
            "I want to eval."
        ],
        [
            "And the way we'll evaluate this is to use Amazon Mechanical Turk.",
            "Do people know that now, yes, yeah, shall I explain?",
            "Yeah no, yeah.",
            "OK so Amazon mechanical.",
            "So the story goes like this.",
            "This is the story about the Mechanical Turk which was this robot that was able to be humans in chess and there was a little person hidden inside.",
            "OK so Mechanical Turk is a service offered by Amazon where you can create small micro tasks and then humans will solve them and you pay them two cents or something.",
            "And lots of people go on Mechanical Turk and solve tasks so you can use it.",
            "To do any kind of labeling to clean your data, the idea is to have a gazillion of small tasks that people through the web browser can solve.",
            "And if you want to do social science research, this is like the best possible platform because you can just ask people to do anything they are already there.",
            "You don't have to recruit them, you pay them a couple of cents and kind of life is good.",
            "OK, So what we will do?",
            "What we will do is we will want to get this Mechanical Turk workers who are there to earn money.",
            "We will want to.",
            "Try to get them to troll, but we must not tell them that we want to get them to throw because you want to do kind of a proper scientific experiments, right?",
            "So so the game will be how?",
            "How do I take these people who only care about?",
            "You know, solving the tasks they were told to solve and getting paid and kind of prepare them to do or get them to behave truthfully and behave.",
            "They would behave in real life without just thinking.",
            "I want to solve this and I want to move to the next task so I can get paid paid.",
            "OK, so the question is how do we design?",
            "The experiment under this setting.",
            "So here is how we do it."
        ],
        [
            "We'll do this kind of two by two experimental design where there will be 2 steps.",
            "The first step will be that we will get people to take a quick test where we will try to manipulate their mood and the way we will do this is that we have two versions of the test will have an easy version of the test and a hard version of the test.",
            "If the person takes an easy version of the test, will tell them they did great and if they take the bad version of the test, will tell them they did poor and they did much worse than anyone else ever did.",
            "And they will do this test for five minutes.",
            "I'll show you the questions and then we will drop them in a discussion forum where we have two versions of the discussion forum will have a neutral discussion forum without kind of bad comments and will have a negative context.",
            "Context will have a discussion forum with already bad context comments and we will just ask these people that they can comment if they feel like doing so.",
            "We won't give them any any any context about why are they really there, why they think they are there is to solve this test.",
            "Right we tell them hi welcome, we have this test for you to solve.",
            "Please solve it and if you do well we will pay you.",
            "OK, so that's what user thinks they're doing, but after they've done what they think the experiment was, we actually drop them into this artificial discussion forum and save them.",
            "You know, spend some time here and then you can leave, right?",
            "So they're not really being paid to comment.",
            "They're being paid to solve that, that test that we don't really care about right?",
            "And then only after the experiment is done, we actually let the people know.",
            "What was the real person of purpose of the experiment and what we were trying to test, right?",
            "So people learn about the experiment, but only after the experiment is already done so that we don't influence them by telling them what is going."
        ],
        [
            "To happen.",
            "OK, so here's the easy quiz.",
            "Decrease take 5 minutes down.",
            "Here is a counter to kind of increase the suspense.",
            "It's counting down in real time and it's questions like you know, unscramble the words.",
            "I'm sure you can do that.",
            "One you know.",
            "Subtract 3000 from 5000.",
            "Easy questions, right?",
            "And we tell them that on average a person gets 8 questions correct?",
            "This is an easy one."
        ],
        [
            "And here is a hard one.",
            "We still tell them that on average a person gets 8 correct and they have the same 5 minutes.",
            "But questions are much harder.",
            "It's unscramble these things, yeah.",
            "Can you do it?",
            "Annoyed, great.",
            "Yes it is.",
            "Then subtract this long thing and things like that right?",
            "And this is the first part."
        ],
        [
            "The experiment and then the second part is we show them some real real article.",
            "We tell them here is some news of the day it was around US presidential election.",
            "So it's all about Hillary.",
            "And then you know we give them some real comments.",
            "Here is 1 example of a real comment and you know they can.",
            "The turkor the person can write a comment here and post it and they can also vote if they like on others but we don't give them any specific instructions what we'd like them to do.",
            "So this is the new."
        ],
        [
            "Context, and this is the negative context you see now.",
            "Right, I had to redirect a few a few words.",
            "So this is the negative context, OK?"
        ],
        [
            "What experiment we had almost 660 different participants.",
            "40% were female age 32 only or 34.",
            "Sorry only from United States, 54% were Democrat.",
            "We ask them for political affiliation.",
            "25 were moderate and 21 were Republican and these people at the end they solve those quizzes, but then by themselves also contributed almost 800 posts with around.",
            "40 words proposed, and they produced almost 1400 votes, so we got quite a bit of activity from them without even asking them.",
            "OK, so now let's look at what Happ."
        ],
        [
            "So first is the."
        ],
        [
            "Performance on the test right.",
            "We had an easy test and a hard test on an easy test.",
            "People would get 11 out of 15 questions correct?",
            "We would tell them that an average person gets 8 so they would feel good.",
            "They got three more than what an average person would do right in the heart test.",
            "They got 2 out of 15 correct, but we would still tell them that an average person gets eight.",
            "OK.",
            "So the first question is, does doing good, well or or not on this test does it affects?",
            "A person's mood."
        ],
        [
            "So what we actually did is we got people to solve another questionnaire of 65 questions to understand how is the mood of the person being affected by us telling them that they did really poorly or telling them they did really well and you can measure that people in the negative mood treatment.",
            "So in the heart test they really felt worse.",
            "And what we find is that they have higher profile for anger, confusion, depression, fatigue and tension scores.",
            "And you can do this by using this profile of mood states.",
            "Questionnaire of 65 questions that psychologists have built in the past.",
            "OK, so we know that people who take the bet the hard test feel worse.",
            "They feel angry if you like.",
            "So now the question is how about the comments?",
            "So what we did is we took this comment and we created another Mechanical Turk task.",
            "Where we where we gave them the question, the comment and we asked some other set of people.",
            "Is this a good comment or not?",
            "Is this an on topic comment or is it an off topic comment, right?",
            "So we created another kind of human labeling task where we obtained ground truth.",
            "Information about whether these comments are good or not OK."
        ],
        [
            "So what did we learn there?",
            "What I'm showing you here is proportion of bad posts and because I have a two by two design, right?",
            "Some people would write.",
            "This is the test they get and then they get dropped into the neutral context or into a negative context, right?",
            "A good set of forum posts or a bad set of forum posts.",
            "And the number here is the proportion of bad posts.",
            "So proportion of posts that some other independent people labeled as bad posts.",
            "What do you see?",
            "You see quite a lot of interesting things.",
            "For example, you see that users in the negative mood condition are 80% more likely to write troll posts than people in the positive mood treatment, right?",
            "So these numbers are much higher than the numbers on the left, right?",
            "So scoring value on the test really increased the number of bad comment."
        ],
        [
            "The other thing you can also do is you can compare line by line and what you find is that people who were who were put into the into the context where there is already many bad posts they've wrote posts that were much worse than people who were put in the neutral context right?",
            "So here the negative context is more is also leads to more negative or more bad posts, and you can also do the post."
        ],
        [
            "Analysis and you can actually find that this pose that are created are much more negative than then in the across different treatment conditions, right?",
            "So negative, so this is now there is a.",
            "A set of, like again, psychologists, came up with different word lists and there is a particular whirly word list that tries to measure the negative effect in the in the in the piece of text.",
            "So by counting those words from that word list, you find that people who are in the Hoover in the negative mood or who are in the negative context they have more of these negative affect words.",
            "Then let's say people who are in the positive mood or in the positive.",
            "Context, so this means that negative mood and negative context lead to more negative posts.",
            "OK, So what we learn now is 2 things.",
            "First, we saw that this trolls variety this bad posts.",
            "We did this human experiment where we see that based on how people feel and in what environment they are put that significant significantly changes or shifts their probability to write bad posts right.",
            "It almost doubles it.",
            "It goes from 35% to 68%.",
            "And the question now."
        ],
        [
            "These you know, if bad mood and context made people write bad posts, how could we combat that right?",
            "How could we correct for people who, you know, woke up angry and now they're going to spread their anger on our forums?"
        ],
        [
            "And our websites.",
            "So what websites try to do is to allow users to vote on content and kind of hopefully bad posts will give will get voted down right?",
            "So anywhere on the web you have some kind of like and dislike plus minus type buttons and you hope that those will help you identify the bad content and move it down so nobody sees it.",
            "OK so that's the hope."
        ],
        [
            "Some examples of voting on Reddit.",
            "You can vote.",
            "This is Reddit about cute cat pictures, and you can kind of vote whether you like a given cat picture or not, and you hope that you know bad Cat pictures would get few votes.",
            "Maybe this one right?",
            "So that's the idea similar."
        ],
        [
            "For example, instead in question answering in Stackoverflow, people can come and create, vote and vote whether the question is good and whether the answers that are provided are good, so that you know the good answer.",
            "The authoritative answer is ranked on top and bad answers off topic answers are here at the bottom of the web page, right?"
        ],
        [
            "And similarly writing this news.",
            "Commenting websites people can upload and download, where again the idea is that good posts would be uploaded so they are on top.",
            "But bad posts are downvoted, so they appear at the bottom where people don't look OK.",
            "So the question is, does this voting help right?",
            "Is this the effective way to treat or kind of these types of?"
        ],
        [
            "Behavior, so here's now the next question, right?",
            "The idea is that when a user votes on a comment, then this user is indirectly evaluating the author of that comment as well, right?",
            "So if I post a comment and some people come and put lots of plus votes on it, I will feel happy.",
            "But if I post a comment and I get lots of minus votes, I won't feel happy.",
            "OK, so the question is, then do such evaluations that the author receives do they contribute?",
            "To better content right?",
            "So for example, you could imagine that if I get lots of plus words, I'm like, yes, this was a good comment.",
            "I will write more of those comments, but if I get lots of negative votes, I'm like this was a bad post.",
            "Obviously I have to change something and I won't post on that topic anymore.",
            "'cause the community doesn't seem to like."
        ],
        [
            "OK, So what we try to understand this you have a person they will receive, write a post and then they will either receive a negative or a positive vote on it.",
            "And what we want to know is what happens to that author of the post afterwards, right?",
            "I want to know how people react towards receiving this up and downloads."
        ],
        [
            "OK, the way we will do this is that for every post.",
            "We will take all the votes and we will summarize them and say that a given post is either positively or negatively evaluated and the way we will measure whether a post is positively or negatively evaluated is we will simply take the ratio of positive or the fraction of positive votes.",
            "And if this will be above some threshold, we will say this post was positively evaluated, and if it's below that threshold will say it's a negatively evaluated post.",
            "Here you may want to ask is taking the ratio.",
            "The best thing you do, maybe you should take the difference.",
            "Maybe you should just look at the uploads.",
            "It actually turns out that taking the ratio is the best way to do this.",
            "Happy to say why later.",
            "OK, so now every post is either positively or negatively evaluated by the Community based on the fraction of positive votes it receives."
        ],
        [
            "OK, so now the question is how does the this positive or negative feedback that the author of the Post receives?",
            "How does it influence the subsequent behavior of the author write?",
            "I want to know how votes changed the voting on someone's content changes the behavior of the author of that con."
        ],
        [
            "OK, so there are a few things we will look at.",
            "So first thing we will look at the post quality right?",
            "If you receive good or bad feedback, do you change the quality of your posts?",
            "Then we will talk about Community bias in a sense that if you are known to receive, let's say negative votes then regardless of what kind of posts you write, community knows you and they just give you more negative votes right?",
            "So there will be some kind of bias from the community whether Community likes you or not, right?",
            "Then we will look at the posting frequency.",
            "And also the voting behavior of the author, right?",
            "So the idea is you write a post, you get some feedback.",
            "How do you do?",
            "How are your votes when you vote on other people's posts, right?",
            "Are those votes more positive or more negative?"
        ],
        [
            "And with the way we can think about this, is the following right?",
            "Like psychology would say that we should votes should improve people's behavior.",
            "It's almost like you can think about training a dog right where the idea is that right positive feedback would leave towards better behavior cause uploads are like a reward.",
            "Stimuli and downloads are like punishment stimuli, right?",
            "And if you kind of get punished, you don't do that.",
            "Again, you do something else.",
            "And if you get rewarded, you do that more often, right?",
            "That's the that's the that's the idea.",
            "So right that users would improve by receiving this feedback."
        ],
        [
            "On the community.",
            "Another way to think about is that actually feedback could have also negative effects.",
            "'cause you know people who are only given positive feedback.",
            "They tend to become lazy and complacent, right?",
            "And and you know, bad behaviors.",
            "Kind of you know, or bad impressions.",
            "They are very quick to form and they are more resistant to this confirmation, right?",
            "If somebody receives a negative vote, maybe the community kind of puts them on the side and they will never trust that person again, right?",
            "So the question is, after somebody receives positive or negative votes.",
            "How does their behavior change in the future?"
        ],
        [
            "So the way we will do here is we won't do an experiment, but we'll do a study where we will try to get this causal relationship between what happens.",
            "What happens after you receive a certain type of feedback and the problem is that we don't see.",
            "We kind of don't see the counterfactual right?",
            "We don't see what would happen if you would receive positive feedback and what would happen if you receive a negative feedback.",
            "We only see one, right.",
            "You create a post and we cannot take that post.",
            "Split it into two and have two parallel worlds.",
            "Where in one you would receive positive and in one you would receive negative feedback.",
            "So the way we will do this is that we will think of nature doing this experiment for us.",
            "So we will take different people who who look very similar to each other.",
            "They will post on similar topics.",
            "They use the similar number of words they post with similar frequency and we will match these people and then we will.",
            "We will match them on their behavior before they they write this post.",
            "That either gets positively or negatively evaluated, right?",
            "So will take different pairs of people wear before this this event happening, they are indistinguishable to us.",
            "They look the same, so that's the idea, right?",
            "The idea is we'll take these people who look indistinguishable to us, but then for one reason or another, somebody will get this positive evaluated post.",
            "Another person will get a negatively evaluated post, and then the question is what happens here and will be looking at what happens in the three posts after this evaluation happens."
        ],
        [
            "So now the idea is that we find pairs of people that kind of look the same to us.",
            "So how do we define whether they look the same to us the way we will do that is that we will match pairs of people based on the following characteristics.",
            "So historical text quality we will try to evaluate how good pose do they write?",
            "How many posts have they posted?",
            "How long are those posts and also how many upvotes or downvotes have they received from the community, right?",
            "So I want to take pairs of people that kind of look and behave exactly the same.",
            "That would be, that would be the idea and the way we evaluate text quality is that we will determine it by training a machine learning classifier based on some ground truth labels provided to us by human by human evaluators.",
            "OK, so that's the that's the methodology.",
            "So we have no pairs of people like going back where they ride the same style.",
            "Here the same frequency, they're indistinguishable.",
            "Then they pose this post.",
            "Some one of the one of the people in the pair.",
            "Gets it negatively evaluated.",
            "The other person gets it positively evaluated, and then we'll ask what happens afterwards.",
            "What happens here OK?"
        ],
        [
            "So here is now the way to read this is that I have here I'm showing you proportion the uploads and this is proportion of uploads before and proportion of uploads after this pose that got either positively evaluated or negatively evaluated.",
            "And what you find is that after positive evaluation the posts of the positively evaluated person they get still the same number of uploads, while the post of the negatively evaluated person they actually their future.",
            "Posts are more negatively evaluated than what they were before.",
            "OK, and you can now ask why does this happen?",
            "Right?"
        ],
        [
            "And there could be 2 reasons why this could happen.",
            "So one thing would be that this person is just writing even more supposed to in the future.",
            "So many other people come and give it negative votes, right?",
            "So people download cause of the post content.",
            "Another reason for downloading would be that people are just saying regardless of what this person right they say we don't like you.",
            "Please go away.",
            "We don't trust you an give negative votes and we would like to distinguish between these two kind of competing explanation.",
            "One that people are writing bad posts.",
            "And the other one is that community dislikes the person and regardless of what the person writes, they will give this negative votes.",
            "That's the.",
            "That's the idea.",
            "OK, and the way you can tease this these two out is that you can take a post and say given the text of the post, how many uploads would I expect?",
            "And then you see what happened in real life and the discrepancy between the real number of uploads they got in the predicted number of uploads tells you how much community dislikes the person.",
            "Right, if that difference is big, then it means that they gave you more than what you deserve based on the text of your post and if the difference between predicted and the real is small, then it was based on the Community, reacted to the post the person wrote.",
            "OK, what do we learn?"
        ],
        [
            "We learn that the text quality drops significantly after the positive evaluation, but does not change after sorry drop significantly after the negative evaluation, but does not change after the positive evaluation.",
            "That's that's the first thing, so people tend to write worse posts.",
            "Actually, after they are negatively evaluated.",
            "How about community bias?"
        ],
        [
            "Right how people perceive this person.",
            "Do they dislike them or not?",
            "And the way we, the way we try to answer this here is to ask, you know, there's the Community perception of a user change after the evaluation."
        ],
        [
            "Right and the way we're trying to do this is we have up and downloads.",
            "We have the text quality and we have the what we call the Community bias and what I wanted to explain before is what we do is we get the actual evaluation.",
            "The actual fraction of positive and negative votes based on the text text.",
            "We can predict how many of positive or negative votes we would expect, so the discrepancy between these two is the bias that comes from the community, right?",
            "It's like how many votes came that we cannot explain by the text of the posts.",
            "That's the that's the idea.",
            "Now we can ask what happens we?"
        ],
        [
            "With the community bias so we can, we can compare Community bias before and after the evaluation."
        ],
        [
            "Here is what we find.",
            "We find that posts made after a negative evaluation were perceived worse than those made after a positive evaluation.",
            "For example, on CNN, on average, pose get evaluated 48% worse than they would be just based on the text quality.",
            "So community very quickly learns who are who.",
            "Are the people that contribute bad content, and from then on they just receive negative evaluations or a big part of their minus votes is just who they are, but not what they contributed community has.",
            "Memory in this this means community has memory, exactly the.",
            "The negative votes keep coming."
        ],
        [
            "OK, so why did we did we learn?",
            "So here is kind of graphics.",
            "YX is more positive.",
            "This is before and this is after an becausw we did the matching we know that the two users have positive history.",
            "So sorry have similar histories so they both kind of right about the same level and they also receive about the same number of uploads and downloads the the the polls that gets positively or negatively evaluated.",
            "The two are also textually very similar.",
            "So what happens is now one of them receives a positive evaluation and the other person receives the negative evaluation and the question is what happens after and what we can establish is the following.",
            "We can establish that the positively evaluated person does not change the text quality.",
            "The negatively evaluated person drops the quality significantly and also the difference between the quality of the good post good person and a bad person is.",
            "Is significant?",
            "What is even more interesting is that the final effect, the final number of downloads they receive or uploads, is that positively evaluated person.",
            "There is no positive memory in the community.",
            "They don't get.",
            "This difference is not statistically significant, meaning that the the fraction of uploads are positively evaluated.",
            "Person receives is no higher than what the text quality would say, but the negatively evaluated person gets punished so.",
            "Their number, their negative votes are even worse.",
            "While the text quality would say so.",
            "Basically negatively evaluated people right, worse and get worse perception from the community.",
            "OK, so negative effect twice."
        ],
        [
            "Good so maybe right.",
            "OK, maybe people, right.",
            "They've right worse things afterwards, but maybe they learn to go away right?",
            "So you know what could happen is that this voting would affect posting frequency, meaning that people who receive negative votes.",
            "They learn the community doesn't like them and they go away.",
            "OK, So what we will do is."
        ],
        [
            "We will ask, you know, the user supposed to more or less after this positive or negative evaluation happens, and if you look at this."
        ],
        [
            "Here is what you find.",
            "You find that any kind of evaluation, positive or negative, leads people posting more.",
            "This is number of times that they are posting more frequently than what they were doing before.",
            "So even if you receive positive evaluations, you are about two times more likely to post right.",
            "But negatively evaluated people are even more likely to post, so they don't go away.",
            "They actually come back more often.",
            "OK, and of course, so this is now kind of the second back.",
            "Bad thing that's happening.",
            "It's not only people, right, worse?",
            "But actually come back more often to write, worse, OK, and then the last question."
        ],
        [
            "We will look at is to ask you know, maybe let's look at how the voting behavior of the author of the Post is affected, right?",
            "So the question is thus feedback that disposed as the author receives that kind of lead to backlash of negative behavior throughout the community and the way."
        ],
        [
            "You can do this is the following.",
            "You ask how many uploads did the author of the Post give before the evaluation and after the evaluation and what you again find is that people who get positively evaluated their fraction of positive votes doesn't really change.",
            "These are positive votes given to others while the people who get negatively evaluated their proportion of positive votes given to others drops OK, so users who receive negative feedback.",
            "Are more likely to download other users in the community.",
            "OK, so just to say."
        ],
        [
            "Arise what did we learn?",
            "We learn that negatively evaluated users, right?",
            "Worse, actually worse.",
            "They write more, they evaluate other or worse, and they are evaluated worse by the community as well.",
            "While positively evaluated, users don't really do any better.",
            "OK, so then you can."
        ],
        [
            "Start asking right?",
            "Is there kind of a downward spiral in this community?",
            "So if I tell you if you get a download you will kind of give 2 downvotes to others, so it seems it would get out of hand."
        ],
        [
            "So it almost seems like trolling could be contagious.",
            "Where you know maybe only one person is in bad mood, but then others get in bad mood and so."
        ],
        [
            "And so forth.",
            "So the question is, is there any evidence that things are things are getting out of hand and I'll actually show you now some evidence."
        ],
        [
            "So here is one piece of evidence from CNN, so this is 6 actually.",
            "Yeah, this is six months of data where on the Y axis I'm showing proportion of up of down votes on the articles on CNN as a function of time.",
            "And you see how this goes in half a year from let's say 19% to more than 22%.",
            "So it increased the fraction of downloads per article on on average artikkel increased by 3%.",
            "The other thing you see that the total number of negative votes more than doubled from .8 million to 1.7 million, right?",
            "So proportion of negative votes is increasing overtime in these communities.",
            "And it's not only in C."
        ],
        [
            "But you see it everywhere, right?",
            "So you see that kind of negativity in is increasing as a function of time, so.",
            "It's not right.",
            "It seems things are like this negative spirals of bad behavior are really taking place on CNN, computer games, politics and this is the Korean pop music, right?",
            "And you see how it goes up.",
            "OK, so now the last question.",
            "I want to quickly ask."
        ],
        [
            "You know, can I go and identify antisocial behavior quickly and prevent these downward spirals before they happen, right?",
            "So the damage is not just posting a bad post, but the person coming back and kind of spreading that bad behavior so."
        ],
        [
            "Just quickly to do this, the prediction task is I want to detect whether the user will be banned from the Community in the future.",
            "I can look at their posting posting what are the words, what is their behavior, how the community treats them and also how moderators treat that person and we will do this for 20,000 CNN users where half of them are blocked in the future and half of them are not and we will look at their first.",
            "In posts of a person."
        ],
        [
            "So this is the success metric.",
            "One is best .5 is random guessing OK, so whatever is better than .5 is good.",
            "Closer to one, it is the better it is.",
            "If we could perfectly identify who will be blocked from the community in the future, we would get a score of 1 S using just the words we can do around let's say 70% accuracy.",
            "If you want to think of it that way.",
            "If we look just under dilution rate of their posts, it's about 74% right?",
            "So this is for example, how?",
            "Accurate humans are because they are deleting the posts of this person."
        ],
        [
            "If you just look at the properties of the of the of the.",
            "Of the of the post in which where it's posted and so on, you are actually not doing so well.",
            "You are doing 62%."
        ],
        [
            "If you start adding in activity of the person, how the feedback from the community and also the feedback from the moderate are's you can push this up to around 84% right?",
            "So you can do actually quite well in detecting who these people are that that at some point in time you will say hey, it's been enough, you cannot come back to this community.",
            "You are blocked from the community."
        ],
        [
            "And just maybe one last thing I will show is if you look at the first N posts from the person versus how well you are doing for people who post different number of posts right?",
            "So I was showing you.",
            "This one for 10 an I and for example you see if somebody will.",
            "If you look at what can you do at after 10 posts you can detect it with.",
            "We had 84 but for example for people who will write many many posts in the community.",
            "So these are the yellow guys you don't detect them so well.",
            "While the guys who will be banned very quickly you can detect them quite well very early after.",
            "Let's say this would be after five posts for people that will.",
            "Bband after 10 to writing 10 to 20 posts and what is also interesting is that."
        ],
        [
            "These models are very general, So what you can do is you can train these models on a given community, but then you evaluate them or diploid them on a different community, right?",
            "And of course this is still properly cross validated, but if you build a model for CNN then you do really well on CNN, but you can take this.",
            "Let's say, same same model.",
            "Apply it on IGN, for example, or you apply it on Breit Bart, right?",
            "So now you say if I take the Breit Bart model and I apply it on right mark.",
            "This is what I get.",
            "But if I get take a CNN model and apply it to bribe art, this is what I get, right?",
            "And I get a drop of only 4%.",
            "So basically this models generalize well across different different communities.",
            "OK, so the CNN model works as well on Breit Bart.",
            "As the breitbarth model and brag and you can see.",
            "Similarly, in other cases, these IGN is a bit different, but otherwise generalizations are quite good OK?"
        ],
        [
            "So now let me quickly conclude because time is running out right, so few few ideas to conclude first thing Web is a social place.",
            "An people are less inhibited online online than they are in real kind of person to person interactions.",
            "It is important to understand interaction mechanisms and behavioral patterns and kind of this.",
            "Researchers trying to go.",
            "You know, how do we build create kurate better more, welcoming, healthier online communities so?"
        ],
        [
            "It was a large scale longitudinal study of antisocial behavior in discussion forums, and it was a combination of data analysis and human experiments.",
            "The first part kind of showed that trolls are no special people, but by just simple manipulations of the mood and the context we can, we can increase the probability of trolling of every person and then the second."
        ],
        [
            "Part of the talk was about basically that bad behavior is contagious and can spread right.",
            "So we saw how voting negative feedback can have this kind of more pronounced effects in terms of people writing worse and more being evaluated worse by the community and also then spreading this bad behavior to others by giving them bad evaluations while positively evaluated users, you know don't do any better at all, OK?"
        ],
        [
            "And the last thing we did was look at this prediction task where basically the first 10 posts are more than enough to be able to detect who who is a bad person who's a bad user that you will have to block from the community in the future.",
            "And the interesting thing was that these models seem to generalize quite well."
        ],
        [
            "So what are some open questions?",
            "It's interesting to think about these social feedback loops, right?",
            "And kind of one question is are, are trolls really socially created in a sense that these are people who come to the community they receive lots of bad feedback and then kind of data in they turn hostile and kind of the community is creating them.",
            "It's interesting to think about different reputation models rather than voting that would help kind of surface good content and push back the bad one.",
            "Understanding the role of moderators would be interesting, right?",
            "Are moderating moderators really helping the community?",
            "Moderating understanding, doing some linguistic analysis.",
            "This is what we are doing now in terms of understanding what kind of language people use and how.",
            "Using different language trolling could be.",
            "A modulated and then also write communities.",
            "What would happen?",
            "For example, if you only have a like button right?",
            "In some sense you cannot dislike.",
            "You can only upvote.",
            "Would would bad behavior in this community is be less pronounced because there would be no downloading.",
            "But really, if I kind of conclude, conclude my talk with one take."
        ],
        [
            "Or message then it's this one, right?",
            "Like the important thing is, don't feed the trolls.",
            "Just let them be and they'll go away.",
            "Any kind of feedback just leads to more bad behavior online.",
            "So with this I'm done.",
            "Very happy to take questions."
        ],
        [
            "And here are the three papers I discussed, thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'm really happy to be here and what I want to talk to you about today is something we all have experienced on the on the Internet.",
                    "label": 0
                },
                {
                    "sent": "It's this kind of bad, antisocial behavior that seems to be everywhere, and it's kind of not even clear how to think about it and how can we analyze it and how can we detect it and so on.",
                    "label": 0
                },
                {
                    "sent": "So this is kind of about bad behavior on the Internet.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, and if you kind of make a step back and you say how should I think about behaviors on the on the web or on the Internet?",
                    "label": 0
                },
                {
                    "sent": "There are really kind of two metaphors for the way to think about the web.",
                    "label": 1
                },
                {
                    "sent": "One is to think about the web as a library where you know you come.",
                    "label": 0
                },
                {
                    "sent": "You and you read and you browse the library and you read a web page and you kind of put it back and go to the next book and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "And the other one.",
                    "label": 1
                },
                {
                    "sent": "The other metaphor is something that's kind of much more about.",
                    "label": 0
                },
                {
                    "sent": "It's a social place where people gather where people interact with each other.",
                    "label": 0
                },
                {
                    "sent": "And really, what has happened in previous years is that this type of metaphor of the web allowed for very different kinds of interactions and kind of created this idea of web.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Other social place, right?",
                    "label": 0
                },
                {
                    "sent": "And the crucial part of this idea of web as a social play place is the ability of users to provide content and also feedback on that content that users can interact with each other and that users are the ones that are providing the content.",
                    "label": 1
                },
                {
                    "sent": "If you think about Facebook, if nobody would post anything, Facebook would be kind of useless and other social networks as well right?",
                    "label": 1
                },
                {
                    "sent": "So it's crucial for people to contribute content and then we can interact with that content, provide feedback, discuss it and so on and so forth.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right and some successful examples of this.",
                    "label": 0
                },
                {
                    "sent": "For example, on Reddit, people would post interesting things.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The largest question answering website.",
                    "label": 0
                },
                {
                    "sent": "I'm sure everyone knows it, Stackoverflow.",
                    "label": 0
                },
                {
                    "sent": "Whenever you kind of have a programming question somebody has already asked this question on Stackoverflow and somebody has already answered it.",
                    "label": 0
                },
                {
                    "sent": "That's kind of a common experience of a programmer today.",
                    "label": 0
                },
                {
                    "sent": "You type it on Google.",
                    "label": 0
                },
                {
                    "sent": "The first hit is on Stackoverflow and there's your answer.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of course, even like news websites like CNN, so kind of traditional media, they rely on users for input, so they kind of have this commenting interfaces where discussions about particular news articles can happen.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course, many of Slovenian media we kind of many times CD Artikkel and then people can comment.",
                    "label": 0
                },
                {
                    "sent": "And there's this like kind of endless pages of comments.",
                    "label": 0
                },
                {
                    "sent": "This article, I think, is like 2 days old, but it's already 8 pages of comments and things like that, right?",
                    "label": 0
                },
                {
                    "sent": "So this is kind of the user generated.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right, so how do these two metaphors now compare, right?",
                    "label": 0
                },
                {
                    "sent": "Like if you think of web as a library, that's a very kind of easy and simple ecosystem, right?",
                    "label": 0
                },
                {
                    "sent": "Everything is static.",
                    "label": 0
                },
                {
                    "sent": "Every users experience is the same.",
                    "label": 0
                },
                {
                    "sent": "You know the book is the same for everyone.",
                    "label": 0
                },
                {
                    "sent": "Maybe some people like one type of books.",
                    "label": 0
                },
                {
                    "sent": "Other people, like other types of books, but kind of the content is pre specified.",
                    "label": 0
                },
                {
                    "sent": "You go, you read it and you're gone, right?",
                    "label": 0
                },
                {
                    "sent": "But if you think about this web as a social place, it's kind of a total mess, right?",
                    "label": 0
                },
                {
                    "sent": "Because it is kind of calm like complex dynamic.",
                    "label": 0
                },
                {
                    "sent": "Feedback effects where you know one users experience is a function of other users experiences, right?",
                    "label": 1
                },
                {
                    "sent": "So if I post something that will affect kind of the entire community and however that Community reacts to that piece of content, that will again affect me.",
                    "label": 0
                },
                {
                    "sent": "So it's kind of much more complex, complex way to interact and also more complex to analyze.",
                    "label": 0
                },
                {
                    "sent": "So this is kind of very important to realize that it's not that users experience does not only depend on the.",
                    "label": 0
                },
                {
                    "sent": "Whoever build the application, but also it depends.",
                    "label": 0
                },
                {
                    "sent": "It is a function of everyone else's behavior on the system OK.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So right?",
                    "label": 0
                },
                {
                    "sent": "So what do you want now?",
                    "label": 0
                },
                {
                    "sent": "If you are the owner of these kinds of websites, you want your users to engage and contribute good content, right?",
                    "label": 1
                },
                {
                    "sent": "Cause kind of your application is useless unless people contribute good signal and good content, right?",
                    "label": 0
                },
                {
                    "sent": "So in this way, if people are happy if they engage in contributed good content, this means other experience of your other users will be will be better because of that right?",
                    "label": 0
                },
                {
                    "sent": "So if you are now let's say someone who wants to build the next social network or the next.",
                    "label": 0
                },
                {
                    "sent": "Application that many users would use.",
                    "label": 1
                },
                {
                    "sent": "You would start asking yourself how do I keep users engaged?",
                    "label": 0
                },
                {
                    "sent": "How do I promote good behavior in my in my system?",
                    "label": 0
                },
                {
                    "sent": "How do I ensure the health of the community and the content ecosystem right?",
                    "label": 1
                },
                {
                    "sent": "Like if you are an application that is used by many people, these are some of the kind of essential questions you are asking yourself.",
                    "label": 0
                },
                {
                    "sent": "How do I ensure my content ecosystem is healthy, meaning that I get new content that you know old content is available?",
                    "label": 0
                },
                {
                    "sent": "That content is good.",
                    "label": 0
                },
                {
                    "sent": "How do I make sure my community is healthy, right?",
                    "label": 0
                },
                {
                    "sent": "That kind of.",
                    "label": 0
                },
                {
                    "sent": "People don't fight things like that.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so these are these are the questions.",
                    "label": 0
                },
                {
                    "sent": "So now what are some challenges challenges are that we know a lot about kind of average overall behavior of users in online communities.",
                    "label": 1
                },
                {
                    "sent": "But many times only a small subset of users in these communities can have like a big effect on the entire community.",
                    "label": 1
                },
                {
                    "sent": "So the question then becomes, how do I study and model behavior of such kind of small small groups of users that can have big effect on the community?",
                    "label": 1
                },
                {
                    "sent": "And how could I use this insights?",
                    "label": 0
                },
                {
                    "sent": "To improve, you know the functioning of online communities.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is when we come to this idea of users or small groups of users who behave badly and can have this big disproportionate effects and kind of just to make things simple.",
                    "label": 0
                },
                {
                    "sent": "This is what I will call called Troll.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or throwing right?",
                    "label": 0
                },
                {
                    "sent": "So for example, the I'll borrow a definition from Wikipedia, which says that an Internet troll is a person who kind of goes around and shows discord on the Internet, right?",
                    "label": 1
                },
                {
                    "sent": "So kind of it starts arguments and upsets people.",
                    "label": 0
                },
                {
                    "sent": "It's post inflammatory content, extraneous and off topic messages in a community, right?",
                    "label": 0
                },
                {
                    "sent": "And this is kind of what I'd like to study in this talk.",
                    "label": 0
                },
                {
                    "sent": "Is is this type of people or this type of behavior that you know?",
                    "label": 0
                },
                {
                    "sent": "The that are of this type and just with one word I will call it antisocial behavior.",
                    "label": 0
                },
                {
                    "sent": "OK so this is what we're talking about and what I want to do now.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Give us some examples of these types of behavior and this would be in particular.",
                    "label": 0
                },
                {
                    "sent": "Here's an article on CNN that discuss is how social media and Facebook kind of impacts women and how women and girls perceived perceived themselves.",
                    "label": 0
                },
                {
                    "sent": "It's kind of how it changes and Arthur's self perception because of using social media and all these kind of beautiful happy people posting pictures there.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right now what I'll show you some series of comments that that you could find if you Scroll down the article.",
                    "label": 0
                },
                {
                    "sent": "So here is, you know.",
                    "label": 0
                },
                {
                    "sent": "Here's one comment.",
                    "label": 0
                },
                {
                    "sent": "You know it says something.",
                    "label": 0
                },
                {
                    "sent": "It's on topic we discuss is what the article was.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here's another one, right like that, maybe is a bit different, right?",
                    "label": 0
                },
                {
                    "sent": "Kind of brings in religion immediately.",
                    "label": 0
                },
                {
                    "sent": "Things like that.",
                    "label": 0
                },
                {
                    "sent": "I give you time, time to read right now.",
                    "label": 0
                },
                {
                    "sent": "Given this comment, you can start asking.",
                    "label": 0
                },
                {
                    "sent": "OK, what would the replies be?",
                    "label": 0
                },
                {
                    "sent": "So here are some of.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The replies to this to this comment right?",
                    "label": 0
                },
                {
                    "sent": "Like you see #2, you can read this one right like very quickly things get out of hand right?",
                    "label": 0
                },
                {
                    "sent": "So you see that kind of this comment got quite a lot of replies while the previous comment didn't get any replies actually.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So really, and you know, some people come and use kind of profane language and then many.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Times people would actually say, oh, you are a troll, right?",
                    "label": 0
                },
                {
                    "sent": "Like this was a reply to that particular content, right?",
                    "label": 0
                },
                {
                    "sent": "So kind of what's the problem?",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The problem is that this trolls go and disrupt online online discussions.",
                    "label": 1
                },
                {
                    "sent": "So what I want to do first is talk about how are these discussions disrupted OK and then, and then we'll continue and ask further questions.",
                    "label": 1
                },
                {
                    "sent": "But the first question is how are online discussion disrupt?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right and what we will do is we will examine of the posts of all the users that sometime in the future will be banned from the community.",
                    "label": 1
                },
                {
                    "sent": "Will be they be blocked or removed from the community and will ask what?",
                    "label": 0
                },
                {
                    "sent": "How are the posts of this user is different than the posts of the rest of the population?",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for example, the way I'll show you this, I'll show you by examples.",
                    "label": 0
                },
                {
                    "sent": "But really at the back end is an analysis statistical analysis that compares average posts and contrast them with the post from this bad users and we ask how are these different an I'm just, you know, give you a fact.",
                    "label": 0
                },
                {
                    "sent": "But really at the end there is like AP value behind this and a proper statistical test.",
                    "label": 0
                },
                {
                    "sent": "So all the comments I'll give you are.",
                    "label": 0
                },
                {
                    "sent": "Real, and this is the title of the article.",
                    "label": 0
                },
                {
                    "sent": "This is the article I was talking about before about self perception, right?",
                    "label": 0
                },
                {
                    "sent": "Here's a comment.",
                    "label": 0
                },
                {
                    "sent": "One thing you notice is that these comments are less positive, so they kind of use more net.",
                    "label": 1
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The words the other thing you learn, they use a lot of profane language, right?",
                    "label": 0
                },
                {
                    "sent": "Lots of swear words, things like that.",
                    "label": 0
                },
                {
                    "sent": "What is also interesting is if you go beyond.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Single post level.",
                    "label": 0
                },
                {
                    "sent": "You can start asking how about kind of discussion level and here I'll show you an example.",
                    "label": 0
                },
                {
                    "sent": "This was about an article about an NBA star kind of going back and helping his community and kind of bring back dreams and kind of doing something good for the community where this person grew up and you see a lot of kind of nice positive comments.",
                    "label": 0
                },
                {
                    "sent": "But then.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When kind of these these bad users come in post, most often you know like what you learn is that the kind of post off topic.",
                    "label": 0
                },
                {
                    "sent": "So whatever is the text they post is less similar to the original article or to the post of other people then then what you'd expect.",
                    "label": 0
                },
                {
                    "sent": "So really it's kind of less.",
                    "label": 0
                },
                {
                    "sent": "It's off topic.",
                    "label": 0
                },
                {
                    "sent": "It's more different than the discussion other users are providing and then write what is also interesting is if you now start asking.",
                    "label": 0
                },
                {
                    "sent": "OK, so here is this type of post, how much?",
                    "label": 0
                },
                {
                    "sent": "Attention does it get by the community and you?",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Quickly learning that actually this type of posts get more replies than normal positive posts, right?",
                    "label": 0
                },
                {
                    "sent": "So so they opposed by people who will be banned in the future kind of receive more attention in terms of people replying to them and so on.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then you can also ask how about this bad users, right?",
                    "label": 0
                },
                {
                    "sent": "Maybe if people reply to them or something, do they?",
                    "label": 0
                },
                {
                    "sent": "Do they post more and it turns out that actually the trolls tend to post more frequently and also post more into the same thread, right?",
                    "label": 0
                },
                {
                    "sent": "Kind of they post to the replies of their own, right?",
                    "label": 0
                },
                {
                    "sent": "So kind of you have this small group of people that have that has a very big impact on the on the discussion dynamics in the Community.",
                    "label": 0
                },
                {
                    "sent": "So now let me kind of tell you a bit more detail what we did.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How we did it?",
                    "label": 0
                },
                {
                    "sent": "OK, so we did a study on city different online communities.",
                    "label": 0
                },
                {
                    "sent": "They're quite different, so one is CNN.",
                    "label": 0
                },
                {
                    "sent": "IGN is international gamers Network, so this is a site where you can discuss computer games and Breit.",
                    "label": 0
                },
                {
                    "sent": "Bart is a site where you can kind of discuss politics and another website we did that I don't mention here is all Kpop which is a website where you can discuss Korean pop music and we get complete data from this website.",
                    "label": 0
                },
                {
                    "sent": "So we.",
                    "label": 0
                },
                {
                    "sent": "We know the users, we know the posts and we also know the votes we know for every user what articles they voted on and you can vote positively or negatively.",
                    "label": 0
                },
                {
                    "sent": "OK and all of these sites are also moderated, right?",
                    "label": 0
                },
                {
                    "sent": "So for.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "People, if you look at these different websites, you can ask how many posts get deleted by the by the administrators and how many users get banned or blocked from the community and you see for example that on CNN, more than 20% of all posts get deleted by the administrators and then in other communities communities that that number is a bit 10 times slower and then in terms of user banned rate right when user get blocked from the Community it's about 3% in CNN and a bit less in the other.",
                    "label": 0
                },
                {
                    "sent": "In the other two community.",
                    "label": 0
                },
                {
                    "sent": "And really, everything I will tell you today generalizes across these three very different communities, right?",
                    "label": 0
                },
                {
                    "sent": "So kind of events, news, computer games, and politics.",
                    "label": 0
                },
                {
                    "sent": "So with these statistics.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What will this stock be about?",
                    "label": 0
                },
                {
                    "sent": "It will be about large scale investigation of strolling in online discussion communities and what we will do that will be interesting is we will complement observational data analysis with human experiments, so I will actually be messing with humans and seeing how they react.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so there will be three things I will I will be asking.",
                    "label": 0
                },
                {
                    "sent": "First question will be who are trolls, right?",
                    "label": 1
                },
                {
                    "sent": "You know what are?",
                    "label": 1
                },
                {
                    "sent": "What are kind of mechanisms behind trolling behavior?",
                    "label": 0
                },
                {
                    "sent": "Arthros these bad people who maybe were born one way and they just cannot help it themselves or anyone you know here in this room can become a troll.",
                    "label": 0
                },
                {
                    "sent": "And actually what will turn out is that we can experimentally manipulate mood and discussion context and show that we can kind of get ordinary people to troll.",
                    "label": 0
                },
                {
                    "sent": "So that will be the first thing.",
                    "label": 0
                },
                {
                    "sent": "The second thing I will show.",
                    "label": 0
                },
                {
                    "sent": "Is that all these feedback loops that I was saying before by being able to vote and being able to reply just makes everything worse.",
                    "label": 0
                },
                {
                    "sent": "That voting and replying to each other creates this cascades of bad behavior spreading throughout networks.",
                    "label": 0
                },
                {
                    "sent": "This kind of downward spirals and then the last thing I will show you just very briefly about.",
                    "label": 0
                },
                {
                    "sent": "How can we detect trolls or bad users very early and we can do about after 10 posts of a person we can detect whether that person will be blocked from the community in the future with, I think 8080%.",
                    "label": 1
                },
                {
                    "sent": "What is your 80% AUC?",
                    "label": 0
                },
                {
                    "sent": "OK, so these are the three parts of my talk so.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First thing I want to talk about is you know, who are these people?",
                    "label": 1
                },
                {
                    "sent": "Who are these trolls?",
                    "label": 0
                },
                {
                    "sent": "What makes them troll and why?",
                    "label": 1
                },
                {
                    "sent": "Strolling so common?",
                    "label": 0
                },
                {
                    "sent": "This is this paper that is about to be published.",
                    "label": 0
                },
                {
                    "sent": "I think in February.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the way prior research has thought about this problem is that you know there are kind of the normal users and then there are these bad users.",
                    "label": 0
                },
                {
                    "sent": "You know a few of them spreading the intercom.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Unity, and that is there's a lot of kind of news articles or research around things like Confessions of a former Internet troll.",
                    "label": 0
                },
                {
                    "sent": "You know, Internet trolls really horrible people.",
                    "label": 0
                },
                {
                    "sent": "Things like that, right?",
                    "label": 0
                },
                {
                    "sent": "Like even psychology of Internet trolls and so on.",
                    "label": 0
                },
                {
                    "sent": "So what price?",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Research suggests is that troll trolls are born and not made and that these are, you know they have particular personality and that these are this kind of psychopathic individuals, right?",
                    "label": 1
                },
                {
                    "sent": "And we kind of wanted to challenge this assumption and say, you know, are trolls really special people?",
                    "label": 1
                },
                {
                    "sent": "Or can anyone be turned into a troll?",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, So what we start with is this question.",
                    "label": 0
                },
                {
                    "sent": "Can we turn ordinary people into into trolling behavior and the way we will?",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We will do this is to we have a hypothesis that there are two mechanisms that modulate this type of behavior.",
                    "label": 0
                },
                {
                    "sent": "First, mechanism is the mood of the person, right?",
                    "label": 0
                },
                {
                    "sent": "We hypothesize that negative mood increases persons likelihood of trolling, meaning posting bad comments and the other one is that discussion context affects the user susceptibility to troll.",
                    "label": 1
                },
                {
                    "sent": "Meaning if the discussion is friendly and there's no troll posts, you are less likely to troll.",
                    "label": 0
                },
                {
                    "sent": "If there's already lots of bad comments.",
                    "label": 0
                },
                {
                    "sent": "The hypothesis is, or.",
                    "label": 0
                },
                {
                    "sent": "The prediction is that you will be more likely to throw OK, so that's those are two hypothesis.",
                    "label": 0
                },
                {
                    "sent": "I want to eval.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the way we'll evaluate this is to use Amazon Mechanical Turk.",
                    "label": 0
                },
                {
                    "sent": "Do people know that now, yes, yeah, shall I explain?",
                    "label": 0
                },
                {
                    "sent": "Yeah no, yeah.",
                    "label": 0
                },
                {
                    "sent": "OK so Amazon mechanical.",
                    "label": 0
                },
                {
                    "sent": "So the story goes like this.",
                    "label": 0
                },
                {
                    "sent": "This is the story about the Mechanical Turk which was this robot that was able to be humans in chess and there was a little person hidden inside.",
                    "label": 0
                },
                {
                    "sent": "OK so Mechanical Turk is a service offered by Amazon where you can create small micro tasks and then humans will solve them and you pay them two cents or something.",
                    "label": 0
                },
                {
                    "sent": "And lots of people go on Mechanical Turk and solve tasks so you can use it.",
                    "label": 0
                },
                {
                    "sent": "To do any kind of labeling to clean your data, the idea is to have a gazillion of small tasks that people through the web browser can solve.",
                    "label": 0
                },
                {
                    "sent": "And if you want to do social science research, this is like the best possible platform because you can just ask people to do anything they are already there.",
                    "label": 0
                },
                {
                    "sent": "You don't have to recruit them, you pay them a couple of cents and kind of life is good.",
                    "label": 0
                },
                {
                    "sent": "OK, So what we will do?",
                    "label": 0
                },
                {
                    "sent": "What we will do is we will want to get this Mechanical Turk workers who are there to earn money.",
                    "label": 0
                },
                {
                    "sent": "We will want to.",
                    "label": 0
                },
                {
                    "sent": "Try to get them to troll, but we must not tell them that we want to get them to throw because you want to do kind of a proper scientific experiments, right?",
                    "label": 0
                },
                {
                    "sent": "So so the game will be how?",
                    "label": 0
                },
                {
                    "sent": "How do I take these people who only care about?",
                    "label": 1
                },
                {
                    "sent": "You know, solving the tasks they were told to solve and getting paid and kind of prepare them to do or get them to behave truthfully and behave.",
                    "label": 0
                },
                {
                    "sent": "They would behave in real life without just thinking.",
                    "label": 0
                },
                {
                    "sent": "I want to solve this and I want to move to the next task so I can get paid paid.",
                    "label": 0
                },
                {
                    "sent": "OK, so the question is how do we design?",
                    "label": 1
                },
                {
                    "sent": "The experiment under this setting.",
                    "label": 0
                },
                {
                    "sent": "So here is how we do it.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We'll do this kind of two by two experimental design where there will be 2 steps.",
                    "label": 1
                },
                {
                    "sent": "The first step will be that we will get people to take a quick test where we will try to manipulate their mood and the way we will do this is that we have two versions of the test will have an easy version of the test and a hard version of the test.",
                    "label": 0
                },
                {
                    "sent": "If the person takes an easy version of the test, will tell them they did great and if they take the bad version of the test, will tell them they did poor and they did much worse than anyone else ever did.",
                    "label": 1
                },
                {
                    "sent": "And they will do this test for five minutes.",
                    "label": 0
                },
                {
                    "sent": "I'll show you the questions and then we will drop them in a discussion forum where we have two versions of the discussion forum will have a neutral discussion forum without kind of bad comments and will have a negative context.",
                    "label": 1
                },
                {
                    "sent": "Context will have a discussion forum with already bad context comments and we will just ask these people that they can comment if they feel like doing so.",
                    "label": 0
                },
                {
                    "sent": "We won't give them any any any context about why are they really there, why they think they are there is to solve this test.",
                    "label": 0
                },
                {
                    "sent": "Right we tell them hi welcome, we have this test for you to solve.",
                    "label": 0
                },
                {
                    "sent": "Please solve it and if you do well we will pay you.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's what user thinks they're doing, but after they've done what they think the experiment was, we actually drop them into this artificial discussion forum and save them.",
                    "label": 0
                },
                {
                    "sent": "You know, spend some time here and then you can leave, right?",
                    "label": 0
                },
                {
                    "sent": "So they're not really being paid to comment.",
                    "label": 0
                },
                {
                    "sent": "They're being paid to solve that, that test that we don't really care about right?",
                    "label": 0
                },
                {
                    "sent": "And then only after the experiment is done, we actually let the people know.",
                    "label": 0
                },
                {
                    "sent": "What was the real person of purpose of the experiment and what we were trying to test, right?",
                    "label": 0
                },
                {
                    "sent": "So people learn about the experiment, but only after the experiment is already done so that we don't influence them by telling them what is going.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To happen.",
                    "label": 0
                },
                {
                    "sent": "OK, so here's the easy quiz.",
                    "label": 0
                },
                {
                    "sent": "Decrease take 5 minutes down.",
                    "label": 0
                },
                {
                    "sent": "Here is a counter to kind of increase the suspense.",
                    "label": 0
                },
                {
                    "sent": "It's counting down in real time and it's questions like you know, unscramble the words.",
                    "label": 0
                },
                {
                    "sent": "I'm sure you can do that.",
                    "label": 0
                },
                {
                    "sent": "One you know.",
                    "label": 0
                },
                {
                    "sent": "Subtract 3000 from 5000.",
                    "label": 0
                },
                {
                    "sent": "Easy questions, right?",
                    "label": 0
                },
                {
                    "sent": "And we tell them that on average a person gets 8 questions correct?",
                    "label": 0
                },
                {
                    "sent": "This is an easy one.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here is a hard one.",
                    "label": 0
                },
                {
                    "sent": "We still tell them that on average a person gets 8 correct and they have the same 5 minutes.",
                    "label": 0
                },
                {
                    "sent": "But questions are much harder.",
                    "label": 0
                },
                {
                    "sent": "It's unscramble these things, yeah.",
                    "label": 0
                },
                {
                    "sent": "Can you do it?",
                    "label": 0
                },
                {
                    "sent": "Annoyed, great.",
                    "label": 0
                },
                {
                    "sent": "Yes it is.",
                    "label": 0
                },
                {
                    "sent": "Then subtract this long thing and things like that right?",
                    "label": 0
                },
                {
                    "sent": "And this is the first part.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The experiment and then the second part is we show them some real real article.",
                    "label": 0
                },
                {
                    "sent": "We tell them here is some news of the day it was around US presidential election.",
                    "label": 0
                },
                {
                    "sent": "So it's all about Hillary.",
                    "label": 0
                },
                {
                    "sent": "And then you know we give them some real comments.",
                    "label": 0
                },
                {
                    "sent": "Here is 1 example of a real comment and you know they can.",
                    "label": 0
                },
                {
                    "sent": "The turkor the person can write a comment here and post it and they can also vote if they like on others but we don't give them any specific instructions what we'd like them to do.",
                    "label": 0
                },
                {
                    "sent": "So this is the new.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Context, and this is the negative context you see now.",
                    "label": 0
                },
                {
                    "sent": "Right, I had to redirect a few a few words.",
                    "label": 0
                },
                {
                    "sent": "So this is the negative context, OK?",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What experiment we had almost 660 different participants.",
                    "label": 0
                },
                {
                    "sent": "40% were female age 32 only or 34.",
                    "label": 1
                },
                {
                    "sent": "Sorry only from United States, 54% were Democrat.",
                    "label": 0
                },
                {
                    "sent": "We ask them for political affiliation.",
                    "label": 0
                },
                {
                    "sent": "25 were moderate and 21 were Republican and these people at the end they solve those quizzes, but then by themselves also contributed almost 800 posts with around.",
                    "label": 0
                },
                {
                    "sent": "40 words proposed, and they produced almost 1400 votes, so we got quite a bit of activity from them without even asking them.",
                    "label": 0
                },
                {
                    "sent": "OK, so now let's look at what Happ.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So first is the.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Performance on the test right.",
                    "label": 1
                },
                {
                    "sent": "We had an easy test and a hard test on an easy test.",
                    "label": 0
                },
                {
                    "sent": "People would get 11 out of 15 questions correct?",
                    "label": 1
                },
                {
                    "sent": "We would tell them that an average person gets 8 so they would feel good.",
                    "label": 0
                },
                {
                    "sent": "They got three more than what an average person would do right in the heart test.",
                    "label": 1
                },
                {
                    "sent": "They got 2 out of 15 correct, but we would still tell them that an average person gets eight.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So the first question is, does doing good, well or or not on this test does it affects?",
                    "label": 0
                },
                {
                    "sent": "A person's mood.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what we actually did is we got people to solve another questionnaire of 65 questions to understand how is the mood of the person being affected by us telling them that they did really poorly or telling them they did really well and you can measure that people in the negative mood treatment.",
                    "label": 0
                },
                {
                    "sent": "So in the heart test they really felt worse.",
                    "label": 0
                },
                {
                    "sent": "And what we find is that they have higher profile for anger, confusion, depression, fatigue and tension scores.",
                    "label": 1
                },
                {
                    "sent": "And you can do this by using this profile of mood states.",
                    "label": 0
                },
                {
                    "sent": "Questionnaire of 65 questions that psychologists have built in the past.",
                    "label": 0
                },
                {
                    "sent": "OK, so we know that people who take the bet the hard test feel worse.",
                    "label": 0
                },
                {
                    "sent": "They feel angry if you like.",
                    "label": 0
                },
                {
                    "sent": "So now the question is how about the comments?",
                    "label": 0
                },
                {
                    "sent": "So what we did is we took this comment and we created another Mechanical Turk task.",
                    "label": 0
                },
                {
                    "sent": "Where we where we gave them the question, the comment and we asked some other set of people.",
                    "label": 0
                },
                {
                    "sent": "Is this a good comment or not?",
                    "label": 0
                },
                {
                    "sent": "Is this an on topic comment or is it an off topic comment, right?",
                    "label": 0
                },
                {
                    "sent": "So we created another kind of human labeling task where we obtained ground truth.",
                    "label": 0
                },
                {
                    "sent": "Information about whether these comments are good or not OK.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what did we learn there?",
                    "label": 0
                },
                {
                    "sent": "What I'm showing you here is proportion of bad posts and because I have a two by two design, right?",
                    "label": 0
                },
                {
                    "sent": "Some people would write.",
                    "label": 0
                },
                {
                    "sent": "This is the test they get and then they get dropped into the neutral context or into a negative context, right?",
                    "label": 0
                },
                {
                    "sent": "A good set of forum posts or a bad set of forum posts.",
                    "label": 0
                },
                {
                    "sent": "And the number here is the proportion of bad posts.",
                    "label": 0
                },
                {
                    "sent": "So proportion of posts that some other independent people labeled as bad posts.",
                    "label": 0
                },
                {
                    "sent": "What do you see?",
                    "label": 0
                },
                {
                    "sent": "You see quite a lot of interesting things.",
                    "label": 0
                },
                {
                    "sent": "For example, you see that users in the negative mood condition are 80% more likely to write troll posts than people in the positive mood treatment, right?",
                    "label": 1
                },
                {
                    "sent": "So these numbers are much higher than the numbers on the left, right?",
                    "label": 0
                },
                {
                    "sent": "So scoring value on the test really increased the number of bad comment.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The other thing you can also do is you can compare line by line and what you find is that people who were who were put into the into the context where there is already many bad posts they've wrote posts that were much worse than people who were put in the neutral context right?",
                    "label": 0
                },
                {
                    "sent": "So here the negative context is more is also leads to more negative or more bad posts, and you can also do the post.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Analysis and you can actually find that this pose that are created are much more negative than then in the across different treatment conditions, right?",
                    "label": 0
                },
                {
                    "sent": "So negative, so this is now there is a.",
                    "label": 0
                },
                {
                    "sent": "A set of, like again, psychologists, came up with different word lists and there is a particular whirly word list that tries to measure the negative effect in the in the in the piece of text.",
                    "label": 0
                },
                {
                    "sent": "So by counting those words from that word list, you find that people who are in the Hoover in the negative mood or who are in the negative context they have more of these negative affect words.",
                    "label": 0
                },
                {
                    "sent": "Then let's say people who are in the positive mood or in the positive.",
                    "label": 0
                },
                {
                    "sent": "Context, so this means that negative mood and negative context lead to more negative posts.",
                    "label": 1
                },
                {
                    "sent": "OK, So what we learn now is 2 things.",
                    "label": 0
                },
                {
                    "sent": "First, we saw that this trolls variety this bad posts.",
                    "label": 0
                },
                {
                    "sent": "We did this human experiment where we see that based on how people feel and in what environment they are put that significant significantly changes or shifts their probability to write bad posts right.",
                    "label": 0
                },
                {
                    "sent": "It almost doubles it.",
                    "label": 0
                },
                {
                    "sent": "It goes from 35% to 68%.",
                    "label": 0
                },
                {
                    "sent": "And the question now.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These you know, if bad mood and context made people write bad posts, how could we combat that right?",
                    "label": 0
                },
                {
                    "sent": "How could we correct for people who, you know, woke up angry and now they're going to spread their anger on our forums?",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And our websites.",
                    "label": 0
                },
                {
                    "sent": "So what websites try to do is to allow users to vote on content and kind of hopefully bad posts will give will get voted down right?",
                    "label": 1
                },
                {
                    "sent": "So anywhere on the web you have some kind of like and dislike plus minus type buttons and you hope that those will help you identify the bad content and move it down so nobody sees it.",
                    "label": 0
                },
                {
                    "sent": "OK so that's the hope.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some examples of voting on Reddit.",
                    "label": 0
                },
                {
                    "sent": "You can vote.",
                    "label": 0
                },
                {
                    "sent": "This is Reddit about cute cat pictures, and you can kind of vote whether you like a given cat picture or not, and you hope that you know bad Cat pictures would get few votes.",
                    "label": 0
                },
                {
                    "sent": "Maybe this one right?",
                    "label": 0
                },
                {
                    "sent": "So that's the idea similar.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For example, instead in question answering in Stackoverflow, people can come and create, vote and vote whether the question is good and whether the answers that are provided are good, so that you know the good answer.",
                    "label": 0
                },
                {
                    "sent": "The authoritative answer is ranked on top and bad answers off topic answers are here at the bottom of the web page, right?",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And similarly writing this news.",
                    "label": 0
                },
                {
                    "sent": "Commenting websites people can upload and download, where again the idea is that good posts would be uploaded so they are on top.",
                    "label": 0
                },
                {
                    "sent": "But bad posts are downvoted, so they appear at the bottom where people don't look OK.",
                    "label": 0
                },
                {
                    "sent": "So the question is, does this voting help right?",
                    "label": 0
                },
                {
                    "sent": "Is this the effective way to treat or kind of these types of?",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Behavior, so here's now the next question, right?",
                    "label": 0
                },
                {
                    "sent": "The idea is that when a user votes on a comment, then this user is indirectly evaluating the author of that comment as well, right?",
                    "label": 1
                },
                {
                    "sent": "So if I post a comment and some people come and put lots of plus votes on it, I will feel happy.",
                    "label": 0
                },
                {
                    "sent": "But if I post a comment and I get lots of minus votes, I won't feel happy.",
                    "label": 1
                },
                {
                    "sent": "OK, so the question is, then do such evaluations that the author receives do they contribute?",
                    "label": 0
                },
                {
                    "sent": "To better content right?",
                    "label": 0
                },
                {
                    "sent": "So for example, you could imagine that if I get lots of plus words, I'm like, yes, this was a good comment.",
                    "label": 0
                },
                {
                    "sent": "I will write more of those comments, but if I get lots of negative votes, I'm like this was a bad post.",
                    "label": 0
                },
                {
                    "sent": "Obviously I have to change something and I won't post on that topic anymore.",
                    "label": 0
                },
                {
                    "sent": "'cause the community doesn't seem to like.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, So what we try to understand this you have a person they will receive, write a post and then they will either receive a negative or a positive vote on it.",
                    "label": 0
                },
                {
                    "sent": "And what we want to know is what happens to that author of the post afterwards, right?",
                    "label": 0
                },
                {
                    "sent": "I want to know how people react towards receiving this up and downloads.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, the way we will do this is that for every post.",
                    "label": 0
                },
                {
                    "sent": "We will take all the votes and we will summarize them and say that a given post is either positively or negatively evaluated and the way we will measure whether a post is positively or negatively evaluated is we will simply take the ratio of positive or the fraction of positive votes.",
                    "label": 1
                },
                {
                    "sent": "And if this will be above some threshold, we will say this post was positively evaluated, and if it's below that threshold will say it's a negatively evaluated post.",
                    "label": 0
                },
                {
                    "sent": "Here you may want to ask is taking the ratio.",
                    "label": 0
                },
                {
                    "sent": "The best thing you do, maybe you should take the difference.",
                    "label": 0
                },
                {
                    "sent": "Maybe you should just look at the uploads.",
                    "label": 0
                },
                {
                    "sent": "It actually turns out that taking the ratio is the best way to do this.",
                    "label": 0
                },
                {
                    "sent": "Happy to say why later.",
                    "label": 0
                },
                {
                    "sent": "OK, so now every post is either positively or negatively evaluated by the Community based on the fraction of positive votes it receives.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so now the question is how does the this positive or negative feedback that the author of the Post receives?",
                    "label": 0
                },
                {
                    "sent": "How does it influence the subsequent behavior of the author write?",
                    "label": 1
                },
                {
                    "sent": "I want to know how votes changed the voting on someone's content changes the behavior of the author of that con.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so there are a few things we will look at.",
                    "label": 0
                },
                {
                    "sent": "So first thing we will look at the post quality right?",
                    "label": 1
                },
                {
                    "sent": "If you receive good or bad feedback, do you change the quality of your posts?",
                    "label": 0
                },
                {
                    "sent": "Then we will talk about Community bias in a sense that if you are known to receive, let's say negative votes then regardless of what kind of posts you write, community knows you and they just give you more negative votes right?",
                    "label": 0
                },
                {
                    "sent": "So there will be some kind of bias from the community whether Community likes you or not, right?",
                    "label": 1
                },
                {
                    "sent": "Then we will look at the posting frequency.",
                    "label": 1
                },
                {
                    "sent": "And also the voting behavior of the author, right?",
                    "label": 0
                },
                {
                    "sent": "So the idea is you write a post, you get some feedback.",
                    "label": 0
                },
                {
                    "sent": "How do you do?",
                    "label": 0
                },
                {
                    "sent": "How are your votes when you vote on other people's posts, right?",
                    "label": 1
                },
                {
                    "sent": "Are those votes more positive or more negative?",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And with the way we can think about this, is the following right?",
                    "label": 0
                },
                {
                    "sent": "Like psychology would say that we should votes should improve people's behavior.",
                    "label": 0
                },
                {
                    "sent": "It's almost like you can think about training a dog right where the idea is that right positive feedback would leave towards better behavior cause uploads are like a reward.",
                    "label": 1
                },
                {
                    "sent": "Stimuli and downloads are like punishment stimuli, right?",
                    "label": 0
                },
                {
                    "sent": "And if you kind of get punished, you don't do that.",
                    "label": 0
                },
                {
                    "sent": "Again, you do something else.",
                    "label": 0
                },
                {
                    "sent": "And if you get rewarded, you do that more often, right?",
                    "label": 0
                },
                {
                    "sent": "That's the that's the that's the idea.",
                    "label": 0
                },
                {
                    "sent": "So right that users would improve by receiving this feedback.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On the community.",
                    "label": 0
                },
                {
                    "sent": "Another way to think about is that actually feedback could have also negative effects.",
                    "label": 0
                },
                {
                    "sent": "'cause you know people who are only given positive feedback.",
                    "label": 1
                },
                {
                    "sent": "They tend to become lazy and complacent, right?",
                    "label": 1
                },
                {
                    "sent": "And and you know, bad behaviors.",
                    "label": 1
                },
                {
                    "sent": "Kind of you know, or bad impressions.",
                    "label": 0
                },
                {
                    "sent": "They are very quick to form and they are more resistant to this confirmation, right?",
                    "label": 1
                },
                {
                    "sent": "If somebody receives a negative vote, maybe the community kind of puts them on the side and they will never trust that person again, right?",
                    "label": 0
                },
                {
                    "sent": "So the question is, after somebody receives positive or negative votes.",
                    "label": 0
                },
                {
                    "sent": "How does their behavior change in the future?",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the way we will do here is we won't do an experiment, but we'll do a study where we will try to get this causal relationship between what happens.",
                    "label": 0
                },
                {
                    "sent": "What happens after you receive a certain type of feedback and the problem is that we don't see.",
                    "label": 0
                },
                {
                    "sent": "We kind of don't see the counterfactual right?",
                    "label": 0
                },
                {
                    "sent": "We don't see what would happen if you would receive positive feedback and what would happen if you receive a negative feedback.",
                    "label": 0
                },
                {
                    "sent": "We only see one, right.",
                    "label": 0
                },
                {
                    "sent": "You create a post and we cannot take that post.",
                    "label": 0
                },
                {
                    "sent": "Split it into two and have two parallel worlds.",
                    "label": 0
                },
                {
                    "sent": "Where in one you would receive positive and in one you would receive negative feedback.",
                    "label": 0
                },
                {
                    "sent": "So the way we will do this is that we will think of nature doing this experiment for us.",
                    "label": 0
                },
                {
                    "sent": "So we will take different people who who look very similar to each other.",
                    "label": 0
                },
                {
                    "sent": "They will post on similar topics.",
                    "label": 1
                },
                {
                    "sent": "They use the similar number of words they post with similar frequency and we will match these people and then we will.",
                    "label": 0
                },
                {
                    "sent": "We will match them on their behavior before they they write this post.",
                    "label": 0
                },
                {
                    "sent": "That either gets positively or negatively evaluated, right?",
                    "label": 1
                },
                {
                    "sent": "So will take different pairs of people wear before this this event happening, they are indistinguishable to us.",
                    "label": 0
                },
                {
                    "sent": "They look the same, so that's the idea, right?",
                    "label": 0
                },
                {
                    "sent": "The idea is we'll take these people who look indistinguishable to us, but then for one reason or another, somebody will get this positive evaluated post.",
                    "label": 0
                },
                {
                    "sent": "Another person will get a negatively evaluated post, and then the question is what happens here and will be looking at what happens in the three posts after this evaluation happens.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now the idea is that we find pairs of people that kind of look the same to us.",
                    "label": 0
                },
                {
                    "sent": "So how do we define whether they look the same to us the way we will do that is that we will match pairs of people based on the following characteristics.",
                    "label": 0
                },
                {
                    "sent": "So historical text quality we will try to evaluate how good pose do they write?",
                    "label": 0
                },
                {
                    "sent": "How many posts have they posted?",
                    "label": 0
                },
                {
                    "sent": "How long are those posts and also how many upvotes or downvotes have they received from the community, right?",
                    "label": 0
                },
                {
                    "sent": "So I want to take pairs of people that kind of look and behave exactly the same.",
                    "label": 0
                },
                {
                    "sent": "That would be, that would be the idea and the way we evaluate text quality is that we will determine it by training a machine learning classifier based on some ground truth labels provided to us by human by human evaluators.",
                    "label": 1
                },
                {
                    "sent": "OK, so that's the that's the methodology.",
                    "label": 0
                },
                {
                    "sent": "So we have no pairs of people like going back where they ride the same style.",
                    "label": 0
                },
                {
                    "sent": "Here the same frequency, they're indistinguishable.",
                    "label": 0
                },
                {
                    "sent": "Then they pose this post.",
                    "label": 0
                },
                {
                    "sent": "Some one of the one of the people in the pair.",
                    "label": 0
                },
                {
                    "sent": "Gets it negatively evaluated.",
                    "label": 0
                },
                {
                    "sent": "The other person gets it positively evaluated, and then we'll ask what happens afterwards.",
                    "label": 0
                },
                {
                    "sent": "What happens here OK?",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here is now the way to read this is that I have here I'm showing you proportion the uploads and this is proportion of uploads before and proportion of uploads after this pose that got either positively evaluated or negatively evaluated.",
                    "label": 0
                },
                {
                    "sent": "And what you find is that after positive evaluation the posts of the positively evaluated person they get still the same number of uploads, while the post of the negatively evaluated person they actually their future.",
                    "label": 0
                },
                {
                    "sent": "Posts are more negatively evaluated than what they were before.",
                    "label": 0
                },
                {
                    "sent": "OK, and you can now ask why does this happen?",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And there could be 2 reasons why this could happen.",
                    "label": 0
                },
                {
                    "sent": "So one thing would be that this person is just writing even more supposed to in the future.",
                    "label": 0
                },
                {
                    "sent": "So many other people come and give it negative votes, right?",
                    "label": 0
                },
                {
                    "sent": "So people download cause of the post content.",
                    "label": 1
                },
                {
                    "sent": "Another reason for downloading would be that people are just saying regardless of what this person right they say we don't like you.",
                    "label": 1
                },
                {
                    "sent": "Please go away.",
                    "label": 0
                },
                {
                    "sent": "We don't trust you an give negative votes and we would like to distinguish between these two kind of competing explanation.",
                    "label": 1
                },
                {
                    "sent": "One that people are writing bad posts.",
                    "label": 0
                },
                {
                    "sent": "And the other one is that community dislikes the person and regardless of what the person writes, they will give this negative votes.",
                    "label": 0
                },
                {
                    "sent": "That's the.",
                    "label": 0
                },
                {
                    "sent": "That's the idea.",
                    "label": 0
                },
                {
                    "sent": "OK, and the way you can tease this these two out is that you can take a post and say given the text of the post, how many uploads would I expect?",
                    "label": 0
                },
                {
                    "sent": "And then you see what happened in real life and the discrepancy between the real number of uploads they got in the predicted number of uploads tells you how much community dislikes the person.",
                    "label": 0
                },
                {
                    "sent": "Right, if that difference is big, then it means that they gave you more than what you deserve based on the text of your post and if the difference between predicted and the real is small, then it was based on the Community, reacted to the post the person wrote.",
                    "label": 0
                },
                {
                    "sent": "OK, what do we learn?",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We learn that the text quality drops significantly after the positive evaluation, but does not change after sorry drop significantly after the negative evaluation, but does not change after the positive evaluation.",
                    "label": 1
                },
                {
                    "sent": "That's that's the first thing, so people tend to write worse posts.",
                    "label": 0
                },
                {
                    "sent": "Actually, after they are negatively evaluated.",
                    "label": 0
                },
                {
                    "sent": "How about community bias?",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right how people perceive this person.",
                    "label": 1
                },
                {
                    "sent": "Do they dislike them or not?",
                    "label": 0
                },
                {
                    "sent": "And the way we, the way we try to answer this here is to ask, you know, there's the Community perception of a user change after the evaluation.",
                    "label": 1
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right and the way we're trying to do this is we have up and downloads.",
                    "label": 0
                },
                {
                    "sent": "We have the text quality and we have the what we call the Community bias and what I wanted to explain before is what we do is we get the actual evaluation.",
                    "label": 1
                },
                {
                    "sent": "The actual fraction of positive and negative votes based on the text text.",
                    "label": 0
                },
                {
                    "sent": "We can predict how many of positive or negative votes we would expect, so the discrepancy between these two is the bias that comes from the community, right?",
                    "label": 0
                },
                {
                    "sent": "It's like how many votes came that we cannot explain by the text of the posts.",
                    "label": 0
                },
                {
                    "sent": "That's the that's the idea.",
                    "label": 0
                },
                {
                    "sent": "Now we can ask what happens we?",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With the community bias so we can, we can compare Community bias before and after the evaluation.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here is what we find.",
                    "label": 0
                },
                {
                    "sent": "We find that posts made after a negative evaluation were perceived worse than those made after a positive evaluation.",
                    "label": 1
                },
                {
                    "sent": "For example, on CNN, on average, pose get evaluated 48% worse than they would be just based on the text quality.",
                    "label": 0
                },
                {
                    "sent": "So community very quickly learns who are who.",
                    "label": 0
                },
                {
                    "sent": "Are the people that contribute bad content, and from then on they just receive negative evaluations or a big part of their minus votes is just who they are, but not what they contributed community has.",
                    "label": 0
                },
                {
                    "sent": "Memory in this this means community has memory, exactly the.",
                    "label": 0
                },
                {
                    "sent": "The negative votes keep coming.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so why did we did we learn?",
                    "label": 0
                },
                {
                    "sent": "So here is kind of graphics.",
                    "label": 0
                },
                {
                    "sent": "YX is more positive.",
                    "label": 0
                },
                {
                    "sent": "This is before and this is after an becausw we did the matching we know that the two users have positive history.",
                    "label": 0
                },
                {
                    "sent": "So sorry have similar histories so they both kind of right about the same level and they also receive about the same number of uploads and downloads the the the polls that gets positively or negatively evaluated.",
                    "label": 0
                },
                {
                    "sent": "The two are also textually very similar.",
                    "label": 0
                },
                {
                    "sent": "So what happens is now one of them receives a positive evaluation and the other person receives the negative evaluation and the question is what happens after and what we can establish is the following.",
                    "label": 0
                },
                {
                    "sent": "We can establish that the positively evaluated person does not change the text quality.",
                    "label": 0
                },
                {
                    "sent": "The negatively evaluated person drops the quality significantly and also the difference between the quality of the good post good person and a bad person is.",
                    "label": 0
                },
                {
                    "sent": "Is significant?",
                    "label": 0
                },
                {
                    "sent": "What is even more interesting is that the final effect, the final number of downloads they receive or uploads, is that positively evaluated person.",
                    "label": 0
                },
                {
                    "sent": "There is no positive memory in the community.",
                    "label": 0
                },
                {
                    "sent": "They don't get.",
                    "label": 0
                },
                {
                    "sent": "This difference is not statistically significant, meaning that the the fraction of uploads are positively evaluated.",
                    "label": 0
                },
                {
                    "sent": "Person receives is no higher than what the text quality would say, but the negatively evaluated person gets punished so.",
                    "label": 0
                },
                {
                    "sent": "Their number, their negative votes are even worse.",
                    "label": 0
                },
                {
                    "sent": "While the text quality would say so.",
                    "label": 1
                },
                {
                    "sent": "Basically negatively evaluated people right, worse and get worse perception from the community.",
                    "label": 0
                },
                {
                    "sent": "OK, so negative effect twice.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good so maybe right.",
                    "label": 0
                },
                {
                    "sent": "OK, maybe people, right.",
                    "label": 0
                },
                {
                    "sent": "They've right worse things afterwards, but maybe they learn to go away right?",
                    "label": 0
                },
                {
                    "sent": "So you know what could happen is that this voting would affect posting frequency, meaning that people who receive negative votes.",
                    "label": 1
                },
                {
                    "sent": "They learn the community doesn't like them and they go away.",
                    "label": 0
                },
                {
                    "sent": "OK, So what we will do is.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We will ask, you know, the user supposed to more or less after this positive or negative evaluation happens, and if you look at this.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here is what you find.",
                    "label": 0
                },
                {
                    "sent": "You find that any kind of evaluation, positive or negative, leads people posting more.",
                    "label": 0
                },
                {
                    "sent": "This is number of times that they are posting more frequently than what they were doing before.",
                    "label": 1
                },
                {
                    "sent": "So even if you receive positive evaluations, you are about two times more likely to post right.",
                    "label": 0
                },
                {
                    "sent": "But negatively evaluated people are even more likely to post, so they don't go away.",
                    "label": 0
                },
                {
                    "sent": "They actually come back more often.",
                    "label": 0
                },
                {
                    "sent": "OK, and of course, so this is now kind of the second back.",
                    "label": 0
                },
                {
                    "sent": "Bad thing that's happening.",
                    "label": 0
                },
                {
                    "sent": "It's not only people, right, worse?",
                    "label": 0
                },
                {
                    "sent": "But actually come back more often to write, worse, OK, and then the last question.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We will look at is to ask you know, maybe let's look at how the voting behavior of the author of the Post is affected, right?",
                    "label": 0
                },
                {
                    "sent": "So the question is thus feedback that disposed as the author receives that kind of lead to backlash of negative behavior throughout the community and the way.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You can do this is the following.",
                    "label": 0
                },
                {
                    "sent": "You ask how many uploads did the author of the Post give before the evaluation and after the evaluation and what you again find is that people who get positively evaluated their fraction of positive votes doesn't really change.",
                    "label": 0
                },
                {
                    "sent": "These are positive votes given to others while the people who get negatively evaluated their proportion of positive votes given to others drops OK, so users who receive negative feedback.",
                    "label": 1
                },
                {
                    "sent": "Are more likely to download other users in the community.",
                    "label": 1
                },
                {
                    "sent": "OK, so just to say.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Arise what did we learn?",
                    "label": 0
                },
                {
                    "sent": "We learn that negatively evaluated users, right?",
                    "label": 0
                },
                {
                    "sent": "Worse, actually worse.",
                    "label": 0
                },
                {
                    "sent": "They write more, they evaluate other or worse, and they are evaluated worse by the community as well.",
                    "label": 1
                },
                {
                    "sent": "While positively evaluated, users don't really do any better.",
                    "label": 0
                },
                {
                    "sent": "OK, so then you can.",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Start asking right?",
                    "label": 0
                },
                {
                    "sent": "Is there kind of a downward spiral in this community?",
                    "label": 1
                },
                {
                    "sent": "So if I tell you if you get a download you will kind of give 2 downvotes to others, so it seems it would get out of hand.",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So it almost seems like trolling could be contagious.",
                    "label": 0
                },
                {
                    "sent": "Where you know maybe only one person is in bad mood, but then others get in bad mood and so.",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so forth.",
                    "label": 0
                },
                {
                    "sent": "So the question is, is there any evidence that things are things are getting out of hand and I'll actually show you now some evidence.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here is one piece of evidence from CNN, so this is 6 actually.",
                    "label": 0
                },
                {
                    "sent": "Yeah, this is six months of data where on the Y axis I'm showing proportion of up of down votes on the articles on CNN as a function of time.",
                    "label": 0
                },
                {
                    "sent": "And you see how this goes in half a year from let's say 19% to more than 22%.",
                    "label": 0
                },
                {
                    "sent": "So it increased the fraction of downloads per article on on average artikkel increased by 3%.",
                    "label": 0
                },
                {
                    "sent": "The other thing you see that the total number of negative votes more than doubled from .8 million to 1.7 million, right?",
                    "label": 0
                },
                {
                    "sent": "So proportion of negative votes is increasing overtime in these communities.",
                    "label": 0
                },
                {
                    "sent": "And it's not only in C.",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But you see it everywhere, right?",
                    "label": 0
                },
                {
                    "sent": "So you see that kind of negativity in is increasing as a function of time, so.",
                    "label": 0
                },
                {
                    "sent": "It's not right.",
                    "label": 0
                },
                {
                    "sent": "It seems things are like this negative spirals of bad behavior are really taking place on CNN, computer games, politics and this is the Korean pop music, right?",
                    "label": 0
                },
                {
                    "sent": "And you see how it goes up.",
                    "label": 0
                },
                {
                    "sent": "OK, so now the last question.",
                    "label": 0
                },
                {
                    "sent": "I want to quickly ask.",
                    "label": 0
                }
            ]
        },
        "clip_82": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You know, can I go and identify antisocial behavior quickly and prevent these downward spirals before they happen, right?",
                    "label": 0
                },
                {
                    "sent": "So the damage is not just posting a bad post, but the person coming back and kind of spreading that bad behavior so.",
                    "label": 0
                }
            ]
        },
        "clip_83": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just quickly to do this, the prediction task is I want to detect whether the user will be banned from the Community in the future.",
                    "label": 0
                },
                {
                    "sent": "I can look at their posting posting what are the words, what is their behavior, how the community treats them and also how moderators treat that person and we will do this for 20,000 CNN users where half of them are blocked in the future and half of them are not and we will look at their first.",
                    "label": 0
                },
                {
                    "sent": "In posts of a person.",
                    "label": 0
                }
            ]
        },
        "clip_84": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is the success metric.",
                    "label": 0
                },
                {
                    "sent": "One is best .5 is random guessing OK, so whatever is better than .5 is good.",
                    "label": 0
                },
                {
                    "sent": "Closer to one, it is the better it is.",
                    "label": 0
                },
                {
                    "sent": "If we could perfectly identify who will be blocked from the community in the future, we would get a score of 1 S using just the words we can do around let's say 70% accuracy.",
                    "label": 1
                },
                {
                    "sent": "If you want to think of it that way.",
                    "label": 0
                },
                {
                    "sent": "If we look just under dilution rate of their posts, it's about 74% right?",
                    "label": 0
                },
                {
                    "sent": "So this is for example, how?",
                    "label": 0
                },
                {
                    "sent": "Accurate humans are because they are deleting the posts of this person.",
                    "label": 0
                }
            ]
        },
        "clip_85": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you just look at the properties of the of the of the.",
                    "label": 0
                },
                {
                    "sent": "Of the of the post in which where it's posted and so on, you are actually not doing so well.",
                    "label": 0
                },
                {
                    "sent": "You are doing 62%.",
                    "label": 0
                }
            ]
        },
        "clip_86": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you start adding in activity of the person, how the feedback from the community and also the feedback from the moderate are's you can push this up to around 84% right?",
                    "label": 0
                },
                {
                    "sent": "So you can do actually quite well in detecting who these people are that that at some point in time you will say hey, it's been enough, you cannot come back to this community.",
                    "label": 0
                },
                {
                    "sent": "You are blocked from the community.",
                    "label": 0
                }
            ]
        },
        "clip_87": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And just maybe one last thing I will show is if you look at the first N posts from the person versus how well you are doing for people who post different number of posts right?",
                    "label": 0
                },
                {
                    "sent": "So I was showing you.",
                    "label": 0
                },
                {
                    "sent": "This one for 10 an I and for example you see if somebody will.",
                    "label": 0
                },
                {
                    "sent": "If you look at what can you do at after 10 posts you can detect it with.",
                    "label": 0
                },
                {
                    "sent": "We had 84 but for example for people who will write many many posts in the community.",
                    "label": 0
                },
                {
                    "sent": "So these are the yellow guys you don't detect them so well.",
                    "label": 0
                },
                {
                    "sent": "While the guys who will be banned very quickly you can detect them quite well very early after.",
                    "label": 0
                },
                {
                    "sent": "Let's say this would be after five posts for people that will.",
                    "label": 0
                },
                {
                    "sent": "Bband after 10 to writing 10 to 20 posts and what is also interesting is that.",
                    "label": 0
                }
            ]
        },
        "clip_88": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These models are very general, So what you can do is you can train these models on a given community, but then you evaluate them or diploid them on a different community, right?",
                    "label": 0
                },
                {
                    "sent": "And of course this is still properly cross validated, but if you build a model for CNN then you do really well on CNN, but you can take this.",
                    "label": 0
                },
                {
                    "sent": "Let's say, same same model.",
                    "label": 0
                },
                {
                    "sent": "Apply it on IGN, for example, or you apply it on Breit Bart, right?",
                    "label": 0
                },
                {
                    "sent": "So now you say if I take the Breit Bart model and I apply it on right mark.",
                    "label": 0
                },
                {
                    "sent": "This is what I get.",
                    "label": 0
                },
                {
                    "sent": "But if I get take a CNN model and apply it to bribe art, this is what I get, right?",
                    "label": 0
                },
                {
                    "sent": "And I get a drop of only 4%.",
                    "label": 0
                },
                {
                    "sent": "So basically this models generalize well across different different communities.",
                    "label": 0
                },
                {
                    "sent": "OK, so the CNN model works as well on Breit Bart.",
                    "label": 0
                },
                {
                    "sent": "As the breitbarth model and brag and you can see.",
                    "label": 0
                },
                {
                    "sent": "Similarly, in other cases, these IGN is a bit different, but otherwise generalizations are quite good OK?",
                    "label": 0
                }
            ]
        },
        "clip_89": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now let me quickly conclude because time is running out right, so few few ideas to conclude first thing Web is a social place.",
                    "label": 0
                },
                {
                    "sent": "An people are less inhibited online online than they are in real kind of person to person interactions.",
                    "label": 0
                },
                {
                    "sent": "It is important to understand interaction mechanisms and behavioral patterns and kind of this.",
                    "label": 0
                },
                {
                    "sent": "Researchers trying to go.",
                    "label": 0
                },
                {
                    "sent": "You know, how do we build create kurate better more, welcoming, healthier online communities so?",
                    "label": 0
                }
            ]
        },
        "clip_90": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It was a large scale longitudinal study of antisocial behavior in discussion forums, and it was a combination of data analysis and human experiments.",
                    "label": 0
                },
                {
                    "sent": "The first part kind of showed that trolls are no special people, but by just simple manipulations of the mood and the context we can, we can increase the probability of trolling of every person and then the second.",
                    "label": 0
                }
            ]
        },
        "clip_91": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Part of the talk was about basically that bad behavior is contagious and can spread right.",
                    "label": 0
                },
                {
                    "sent": "So we saw how voting negative feedback can have this kind of more pronounced effects in terms of people writing worse and more being evaluated worse by the community and also then spreading this bad behavior to others by giving them bad evaluations while positively evaluated users, you know don't do any better at all, OK?",
                    "label": 0
                }
            ]
        },
        "clip_92": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the last thing we did was look at this prediction task where basically the first 10 posts are more than enough to be able to detect who who is a bad person who's a bad user that you will have to block from the community in the future.",
                    "label": 0
                },
                {
                    "sent": "And the interesting thing was that these models seem to generalize quite well.",
                    "label": 0
                }
            ]
        },
        "clip_93": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what are some open questions?",
                    "label": 0
                },
                {
                    "sent": "It's interesting to think about these social feedback loops, right?",
                    "label": 0
                },
                {
                    "sent": "And kind of one question is are, are trolls really socially created in a sense that these are people who come to the community they receive lots of bad feedback and then kind of data in they turn hostile and kind of the community is creating them.",
                    "label": 0
                },
                {
                    "sent": "It's interesting to think about different reputation models rather than voting that would help kind of surface good content and push back the bad one.",
                    "label": 0
                },
                {
                    "sent": "Understanding the role of moderators would be interesting, right?",
                    "label": 0
                },
                {
                    "sent": "Are moderating moderators really helping the community?",
                    "label": 0
                },
                {
                    "sent": "Moderating understanding, doing some linguistic analysis.",
                    "label": 0
                },
                {
                    "sent": "This is what we are doing now in terms of understanding what kind of language people use and how.",
                    "label": 0
                },
                {
                    "sent": "Using different language trolling could be.",
                    "label": 0
                },
                {
                    "sent": "A modulated and then also write communities.",
                    "label": 0
                },
                {
                    "sent": "What would happen?",
                    "label": 0
                },
                {
                    "sent": "For example, if you only have a like button right?",
                    "label": 0
                },
                {
                    "sent": "In some sense you cannot dislike.",
                    "label": 0
                },
                {
                    "sent": "You can only upvote.",
                    "label": 0
                },
                {
                    "sent": "Would would bad behavior in this community is be less pronounced because there would be no downloading.",
                    "label": 0
                },
                {
                    "sent": "But really, if I kind of conclude, conclude my talk with one take.",
                    "label": 0
                }
            ]
        },
        "clip_94": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or message then it's this one, right?",
                    "label": 0
                },
                {
                    "sent": "Like the important thing is, don't feed the trolls.",
                    "label": 0
                },
                {
                    "sent": "Just let them be and they'll go away.",
                    "label": 0
                },
                {
                    "sent": "Any kind of feedback just leads to more bad behavior online.",
                    "label": 0
                },
                {
                    "sent": "So with this I'm done.",
                    "label": 0
                },
                {
                    "sent": "Very happy to take questions.",
                    "label": 0
                }
            ]
        },
        "clip_95": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here are the three papers I discussed, thank you.",
                    "label": 0
                }
            ]
        }
    }
}