{
    "id": "3hegbwzkoqz23qxa4vlvieaqkmctvuu4",
    "title": "A Comparative Analysis of Cascade Measures for Novelty and Diversity",
    "info": {
        "author": [
            "Nick Craswell, Microsoft Research"
        ],
        "published": "Aug. 9, 2011",
        "recorded": "February 2011",
        "category": [
            "Top->Computer Science->Web Search"
        ]
    },
    "url": "http://videolectures.net/wsdm2011_craswell_cac/",
    "segmentation": [
        [
            "This talk is was meant to be presented by Charlie Clarke, but these are actually his slides, so I'll try and do my best job of presenting.",
            "He had to cancel the trip at the last minute.",
            "You know, for reasons we won't talk about here, so.",
            "Just while people are settling in also, we had some talks this morning on using the word cascade, so I thought I'd just.",
            "Point out what we mean by cascade here, so it's a it's a different thing.",
            "It's basically a model of how users view of results page, which is something that actually that I and my coauthors describe or proposed, that the first Wisdom conference and basically the users start at the top of the page and they go cascade down the page and they disappear as they find things that they like, and so that's what I mean by cascade here.",
            "So it's an explanation for why.",
            "Users are less likely to click lower down the page 'cause they already found something up higher.",
            "Also, Charlie and Annezin have a paper at www.that gets does further analysis on the questions in this paper.",
            "So this is part one of two papers on that topic."
        ],
        [
            "OK, so this is a talk about measuring relevance of search engine results.",
            "In three main ways of doing this, which is, you know, editorial judgments, sort of track style or N DCG style measurement?",
            "There's implicit methods, so so you can track clicks.",
            "You can do things like interleaving experiment and so on, and then there's also user studies where we track users, so these are some of the types of ways that people measure relevance an in this talk we're just concerned with labeled based valuation, and we're assuming ranked lists as well, so we've got within kind of.",
            "You know, checkstyle environment or in TCG style?"
        ],
        [
            "Environment.",
            "And our concerns are not diversity in novelty, so.",
            "A way of describing the difference.",
            "OK, so diversity is that different users want different things from typing a query.",
            "So we had, you know examples of this already today where I our mind meeting for information retrieval or my infrared and also will go into some further examples where it becomes more faceted.",
            "But then there's also this concept of novelty which is kind of a property of a list, which is that if you keep showing me the same thing in a list, I'm going to get bored and so and.",
            "These are these are actually they go together quite nicely here because we you, because there's diminishing returns on showing relevant things.",
            "On one topic we can actually, you know, show diversity, reason to show diverse results, and you know the reason we're doing this is because because traditional MVC style measurement kind of ignore these issues.",
            "So we're really describing a class of approach for going beyond that, and I sort of.",
            "Playground for doing this."
        ],
        [
            "It's been there that rec webtrac so this is coordinated by Charlie Clark myself and Ian Soboroff, and these are experiments that have been coming into their third year where we're evaluating over a billion page collection where doing diversity aware evaluation I guess.",
            "And.",
            "And so, because we were doing this kind of experiment, we actually needed to understand all of the different proposals, or at least all the different proposals for evaluating diversity that fell within our within our framework and our framework is that we actually have.",
            "Relevance judgments with respect to explicit subtopics.",
            "So, for each query, we identify ahead of time a set of different things.",
            "This query could mean to get to cover the diversity aspect, and then each judgment is of a document with respect to a subtopic.",
            "Sorry, and so you would actually judge each document multiple times, once per subtopic."
        ],
        [
            "So here's an example of a query from the web track that actually I don't need to use the pointer here.",
            "'cause Charlie slides have these things, so we actually just give the query iron for example to participants in track, and so all they know is that the query is iron and we're going to test your diversity, and so that's all they know at this time.",
            "But actually behind the scenes we've figured out what the different meanings that we care about for this.",
            "Query I so we have.",
            "Iron as a nutrient and just general information about arnesta nutrient.",
            "What foods contain iron?",
            "Where can I buy an iron supplements?",
            "Find information about the element iron deficiencies and find I want to buy an iron I wanted.",
            "I want to do some mining right?",
            "So these are different different possible meanings of the term of the query I should say.",
            "We call this ambiguous because, you know, I want to eat iron supplements, and I want to use an iron.",
            "These are different meanings of the word iron."
        ],
        [
            "We also have faceted topics, so the query here is Neil Young and we're saying that there are different aspects of Neil Young like finding albums or biographical information, and these are actually all about the same entity Neil Young, so it's not ambiguous as to the entity, but it's still we want to reward a system that can find diverse aspects of information on Neil Young and also.",
            "Yeah, that that."
        ],
        [
            "That's that's the main part of it.",
            "Charlie actually chose some Bing search results to show some examples of diverse results list.",
            "He just ran this apparently and got, you know, three different.",
            "Are three different results three different meanings, regardless of what we think of the quality of these, you know the top three actually were diverse in this query, and we can also see more stuff on the left here that we don't cover at the top, but we're just concerned with."
        ],
        [
            "In the diversity of the list.",
            "OK, so past work specifically within our framework are things like subtopic recall, so subtopic recall says this query means five different things and in my top ten I had four out of five or had one out of five or none.",
            "It's how many of the subtopics you managed to cover.",
            "And then more recently, there were intent aware versions of up different metrics proposed which you just basically says we're going to take a mixture or an expected value of of traditional metric, but across the different meanings of the query.",
            "And then in particular, we're interested here in Cascade based measures and will go into.",
            "Why and in a minute?",
            "But basically there have also been some cascade based measures proposed more recently and.",
            "And they have good properties with respect to diversity evaluation and other measures have been proposed to, including, you know, some.",
            "From MSR Cambridge for example, as well as well as these."
        ],
        [
            "I.",
            "So this is a high level view of the track 2009 web track in terms of diversity.",
            "These are all different runs that people submitted to track, so each dot is is actually an attempt to answer the queries as best as possible, and we're showing the precision like basically how likely it is that a given document is relevant on one axis and the subtopic recall on the other axis so.",
            "If you cover a lot of topics, but you also return a lot of relevant stuff, then you might be down here and you know if you if you just focus on one topic but you everything is relevant, then you'd be up here.",
            "So here's the range of different systems.",
            "And one thing that's difficult about this is that if you're if you're not.",
            "Relevant, it's hard to be diverse, so you it's hard to say.",
            "I've returned many different meanings of this.",
            "If you didn't manage to return many things that are on topic at all, so this kind of area of the plot is less interesting than than this kind of area.",
            "Which of the systems that are doing well and we can actually see that there's differences in these guys are doing better on just flat out, returning relevant documents, and then these guys you know doing better on diversity and.",
            "Possibly at the expense of returning relevant things.",
            "Also, this top point here is actually a scrape with a commercial search engine, so if we get rid of that guy, you know there's actually some stuff going on here in terms of the tradeoffs between diversity and relevance.",
            "You know, even in our first year of experiments.",
            "So what we're going to do from now on is we're actually going to having argued that these guys aren't that interesting.",
            "We're just going to focus on on these guys for the rest of the experiments."
        ],
        [
            "OK, so.",
            "The intent to wear the how we do intend to wear measurement is we just have a set of different.",
            "Meanings of the query and we're going to have some measure that we're going to do for each meaning, and we're going to have some kind of weighted.",
            "You know combination of those, so that's just the definition of an intent aware measure is that we know that there are different intents and we're just going to have some weighted combination of those.",
            "Yes, so this could be N DCG.",
            "I mean average precision or one of the cascade measures, and yeah."
        ],
        [
            "So we're going to have a weighted average.",
            "Um so.",
            "The.",
            "But there's a basic problem here with using traditional measures like mean average precision.",
            "So this is one of the key points.",
            "The reasons why we're interested in Cascade based measures.",
            "There's a.",
            "There's a problem which is.",
            "Let's say we have one intent that's more likely than the others, like let's say for I I really most people do mean infrared, an meaning information retrieval is actually quite rare if you just have this mixture that we talked about here or this at this average, that's weighted much towards.",
            "Certain meaning then the right thing to do is to just ignore the minority.",
            "So what you should do is just return all you know documents about infrared and nothing about information retrieval, because every time you have the choice of returning something, that 80% of the people want versus something that 20% of the people want.",
            "Let's say you should always return something for the majority, so this is just basically the argument for like we care about cascade measures and part of what we're doing in this paper is, you know.",
            "I."
        ],
        [
            "You know, showing that this matter is and also putting it into into a framework.",
            "So for the cascade measures, this is the general way we describe all of the different cascade intent.",
            "Aware Cascade based measures.",
            "So this is basically the the framework we're going to place all the different measures that have been proposed.",
            "And so we've got again, this weighted average of subtopics.",
            "We've got a gain for each result.",
            "We've got a discount, and we've got a normalization.",
            "So this is basically we're just saying that all of these different approaches can be described in this way."
        ],
        [
            "Um, under the cascade assumption.",
            "The you know how much I care about a result.",
            "Has something to do with how much I didn't care about the results above me, so this is the formula from the previous paper that I described an in our case with binary judgments, it simplifies down to this where this Alpha thing is kind of the chances that you will find the current document to satisfy you.",
            "So basically you know how good this guy is compared to how bad the guys above me where you know depending on how many of the guys above me were actually good, this is basically under binary judgments of simplification of the.",
            "Uh, of?",
            "Of these"
        ],
        [
            "Different measures and so now the difference between the measures is just to do with discount.",
            "Actually, once you've done.",
            "Done things in the framework that I described, then we are now down to differences in discount and so if we look at Alpha N DCG as proposed by Charlie, it has this discount.",
            "If you use ER then it has that discount so it's 1 / K one over log K plus one or one over this one and this is the one actually is based on the work of Moffett and Zobel.",
            "So, um.",
            "So there's also the question of normalization, right so?",
            "That was this one here.",
            "So The thing is, when we're averaging across."
        ],
        [
            "Across multiple queries, we want to actually.",
            "Not give extra weight to queries that have more subtopics and this can be a problem.",
            "You know various of the metrics and so people have studied this normalization issue.",
            "We think normalization is important and what we're introducing here is just a collection independent normalization.",
            "So we're saying actually I think Charlie might have proposed this.",
            "At the IR theory conference, but the point is that where we're saying that a collection independent normalization can actually make sense, what that means is that instead of saying let's you normally normalize by an ideal ranking, and I deal in a collection dependent sense means that you've actually gotten NP hard problem of finding the perfect ranking with respect to whatever metric you're currently using, and there's all kinds of problems there.",
            "And instead we're just going to assume.",
            "In a collection independent normalization is that there are an unlimited supply of documents that are relevant to all subtopics in the collection, so this is just a way of getting rid of that effect where queries with more subtopics can get."
        ],
        [
            "Can get more weight.",
            "OK, so within our framework we have this Alpha parameter which is actually.",
            "You know how?",
            "Unfortunately, the bottom has been cut off here, but this is Alpha along this axis and always showing here is a sensitivity to the Alpha parameter, so it's saying if we take Alpha N DCG the metric and we vary the parameter Alpha.",
            "If we have Alpha Pi, then we agree with subtopic recalls, so we're very diversity centric, so this subtopic recall agreement is this way, and.",
            "If we can, but you know, agreement with the precision based system ordering is reduced so so basically there's we're just showing that yes, the system works under Alpha N DCG."
        ],
        [
            "Under ER, which is was proposed by Chappelle.",
            "You also have this.",
            "This kind of thing."
        ],
        [
            "And under.",
            "And TBP?",
            "So so, so always showing here is that you know that we've got.",
            "Single parameter we can look at across all three.",
            "Three of the previously proposed meth."
        ],
        [
            "Is the nature of some sort of tradeoff between caring about diversity and just caring about?"
        ],
        [
            "Flat out relevance."
        ],
        [
            "OK, so."
        ],
        [
            "I.",
            "So we're just showing here empirically.",
            "The thing that I described before, which is that there is a big difference between intent aware metric on this axis and sorry cascade metric that's intended where versus a non cascade metric that's that's intended, where so we can see that there is that you really do get different answers by having a cascade metric metric measure, and because we believe that it does make sense to have diminishing returns that as you return more, you shouldn't just.",
            "Favor the 80% of people who wanted infrared.",
            "You want to have diminishing returns on that, so it makes sense to eventually return some information retrieval.",
            "And if and if you don't fix it like that, then you've basically got a mess here in terms of the agreement between the different metrics."
        ],
        [
            "And but then, once you get onto.",
            "You know the the cascade based metrics.",
            "They agree this we're measuring here the kendalls Tau system ordering.",
            "So just saying you know, if we order along this axis versus if we order along that axis, so we you know what's this?",
            "How does the system ordering differ?",
            "And the doesn't differ?"
        ],
        [
            "Which basically or you can just look at this straight line here.",
            "Similarly RVP Alpha N DCG, so Charlies metric agreeing with muffins or bells intended water version of that."
        ],
        [
            "Again, a good good agreement.",
            "And finally, you know we're looking at the.",
            "The different forms of normalization that you can carry out.",
            "So we're basically saying, do we want to do this NP hard thing of finding the the ideal ranking with respect to the current collection or do we want to just assume that there's lots of good stuff out there in our experiment?",
            "It doesn't matter what you do, it doesn't matter whether you you know which forms of normalization you use.",
            "Therefore we'd use the simpler one."
        ],
        [
            "This is just a quick look at discriminative power, so it basically just saying can we tell that can be reliably tell the difference between pairs of systems following the method by Sekai here in bootstrapping for example and also with with paired T tests and I think the these numbers are lower than we expected and the number for mean average precision is higher than the number for the intent aware methods.",
            "But actually that just reflects.",
            "That in the intent aware evaluation we evaluated 20, whereas for average precision you know it's usually evaluate with everything you've got, so there's just more information in the average precision based method you know.",
            "Sakai says that it's.",
            "It's it's it's not sufficient to have good discriminative power.",
            "You've also got to be measuring the right thing so you know we stick with our diversity aware measures even though they're less able to discriminate between pairs of systems in our.",
            "In our experiments.",
            "And it kind of suggests that we need more queries.",
            "We could also go deeper into the ranking beyond 20, but because we're doing web style diversity where evaluation even going as far as 20, seems fairly fairly deep, and with these cascade models you get kind of less information as you go down the ranking due to the diminishing returns anyway.",
            "So it sounds like we need maybe more queries if we want to achieve the same level of discriminative power."
        ],
        [
            "So basically what we've done here is taken multiple proposals for how to measure diversity that use subtopic judgments and just put them together and said look, really, we can.",
            "We can describe the differences here very simply in terms of, for example, discount.",
            "We we strongly believe that you know the diminishing returns thing makes sense and we and we've shown that that does matter.",
            "It does change the outcome of the experiment quite a lot.",
            "The you know, we've got a parameter that provides a tradeoff between just caring about relevance versus caring about diversity.",
            "We were not convinced, at least in our experiments, we didn't need to do the NP hard thing of actually calculating the ideal ranking with respect to the current labels.",
            "We could just assume that there's this infinite supply of perfectly relevant stuff, and that normalization is sufficient to get the right answer.",
            "And you know, we although map has better discriminative power as we found in the end, it's actually.",
            "It you know, we think that what we're measuring in the web track is actually more interesting with respect to what users actually care about.",
            "So yeah, that's that's it.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This talk is was meant to be presented by Charlie Clarke, but these are actually his slides, so I'll try and do my best job of presenting.",
                    "label": 0
                },
                {
                    "sent": "He had to cancel the trip at the last minute.",
                    "label": 0
                },
                {
                    "sent": "You know, for reasons we won't talk about here, so.",
                    "label": 0
                },
                {
                    "sent": "Just while people are settling in also, we had some talks this morning on using the word cascade, so I thought I'd just.",
                    "label": 0
                },
                {
                    "sent": "Point out what we mean by cascade here, so it's a it's a different thing.",
                    "label": 0
                },
                {
                    "sent": "It's basically a model of how users view of results page, which is something that actually that I and my coauthors describe or proposed, that the first Wisdom conference and basically the users start at the top of the page and they go cascade down the page and they disappear as they find things that they like, and so that's what I mean by cascade here.",
                    "label": 0
                },
                {
                    "sent": "So it's an explanation for why.",
                    "label": 0
                },
                {
                    "sent": "Users are less likely to click lower down the page 'cause they already found something up higher.",
                    "label": 0
                },
                {
                    "sent": "Also, Charlie and Annezin have a paper at www.that gets does further analysis on the questions in this paper.",
                    "label": 0
                },
                {
                    "sent": "So this is part one of two papers on that topic.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so this is a talk about measuring relevance of search engine results.",
                    "label": 0
                },
                {
                    "sent": "In three main ways of doing this, which is, you know, editorial judgments, sort of track style or N DCG style measurement?",
                    "label": 1
                },
                {
                    "sent": "There's implicit methods, so so you can track clicks.",
                    "label": 0
                },
                {
                    "sent": "You can do things like interleaving experiment and so on, and then there's also user studies where we track users, so these are some of the types of ways that people measure relevance an in this talk we're just concerned with labeled based valuation, and we're assuming ranked lists as well, so we've got within kind of.",
                    "label": 1
                },
                {
                    "sent": "You know, checkstyle environment or in TCG style?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Environment.",
                    "label": 0
                },
                {
                    "sent": "And our concerns are not diversity in novelty, so.",
                    "label": 0
                },
                {
                    "sent": "A way of describing the difference.",
                    "label": 0
                },
                {
                    "sent": "OK, so diversity is that different users want different things from typing a query.",
                    "label": 0
                },
                {
                    "sent": "So we had, you know examples of this already today where I our mind meeting for information retrieval or my infrared and also will go into some further examples where it becomes more faceted.",
                    "label": 0
                },
                {
                    "sent": "But then there's also this concept of novelty which is kind of a property of a list, which is that if you keep showing me the same thing in a list, I'm going to get bored and so and.",
                    "label": 0
                },
                {
                    "sent": "These are these are actually they go together quite nicely here because we you, because there's diminishing returns on showing relevant things.",
                    "label": 0
                },
                {
                    "sent": "On one topic we can actually, you know, show diversity, reason to show diverse results, and you know the reason we're doing this is because because traditional MVC style measurement kind of ignore these issues.",
                    "label": 0
                },
                {
                    "sent": "So we're really describing a class of approach for going beyond that, and I sort of.",
                    "label": 0
                },
                {
                    "sent": "Playground for doing this.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's been there that rec webtrac so this is coordinated by Charlie Clark myself and Ian Soboroff, and these are experiments that have been coming into their third year where we're evaluating over a billion page collection where doing diversity aware evaluation I guess.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "And so, because we were doing this kind of experiment, we actually needed to understand all of the different proposals, or at least all the different proposals for evaluating diversity that fell within our within our framework and our framework is that we actually have.",
                    "label": 0
                },
                {
                    "sent": "Relevance judgments with respect to explicit subtopics.",
                    "label": 1
                },
                {
                    "sent": "So, for each query, we identify ahead of time a set of different things.",
                    "label": 0
                },
                {
                    "sent": "This query could mean to get to cover the diversity aspect, and then each judgment is of a document with respect to a subtopic.",
                    "label": 0
                },
                {
                    "sent": "Sorry, and so you would actually judge each document multiple times, once per subtopic.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here's an example of a query from the web track that actually I don't need to use the pointer here.",
                    "label": 0
                },
                {
                    "sent": "'cause Charlie slides have these things, so we actually just give the query iron for example to participants in track, and so all they know is that the query is iron and we're going to test your diversity, and so that's all they know at this time.",
                    "label": 0
                },
                {
                    "sent": "But actually behind the scenes we've figured out what the different meanings that we care about for this.",
                    "label": 0
                },
                {
                    "sent": "Query I so we have.",
                    "label": 0
                },
                {
                    "sent": "Iron as a nutrient and just general information about arnesta nutrient.",
                    "label": 1
                },
                {
                    "sent": "What foods contain iron?",
                    "label": 0
                },
                {
                    "sent": "Where can I buy an iron supplements?",
                    "label": 0
                },
                {
                    "sent": "Find information about the element iron deficiencies and find I want to buy an iron I wanted.",
                    "label": 1
                },
                {
                    "sent": "I want to do some mining right?",
                    "label": 0
                },
                {
                    "sent": "So these are different different possible meanings of the term of the query I should say.",
                    "label": 0
                },
                {
                    "sent": "We call this ambiguous because, you know, I want to eat iron supplements, and I want to use an iron.",
                    "label": 0
                },
                {
                    "sent": "These are different meanings of the word iron.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We also have faceted topics, so the query here is Neil Young and we're saying that there are different aspects of Neil Young like finding albums or biographical information, and these are actually all about the same entity Neil Young, so it's not ambiguous as to the entity, but it's still we want to reward a system that can find diverse aspects of information on Neil Young and also.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that that.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's that's the main part of it.",
                    "label": 0
                },
                {
                    "sent": "Charlie actually chose some Bing search results to show some examples of diverse results list.",
                    "label": 0
                },
                {
                    "sent": "He just ran this apparently and got, you know, three different.",
                    "label": 0
                },
                {
                    "sent": "Are three different results three different meanings, regardless of what we think of the quality of these, you know the top three actually were diverse in this query, and we can also see more stuff on the left here that we don't cover at the top, but we're just concerned with.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In the diversity of the list.",
                    "label": 0
                },
                {
                    "sent": "OK, so past work specifically within our framework are things like subtopic recall, so subtopic recall says this query means five different things and in my top ten I had four out of five or had one out of five or none.",
                    "label": 0
                },
                {
                    "sent": "It's how many of the subtopics you managed to cover.",
                    "label": 0
                },
                {
                    "sent": "And then more recently, there were intent aware versions of up different metrics proposed which you just basically says we're going to take a mixture or an expected value of of traditional metric, but across the different meanings of the query.",
                    "label": 1
                },
                {
                    "sent": "And then in particular, we're interested here in Cascade based measures and will go into.",
                    "label": 0
                },
                {
                    "sent": "Why and in a minute?",
                    "label": 0
                },
                {
                    "sent": "But basically there have also been some cascade based measures proposed more recently and.",
                    "label": 0
                },
                {
                    "sent": "And they have good properties with respect to diversity evaluation and other measures have been proposed to, including, you know, some.",
                    "label": 0
                },
                {
                    "sent": "From MSR Cambridge for example, as well as well as these.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "So this is a high level view of the track 2009 web track in terms of diversity.",
                    "label": 0
                },
                {
                    "sent": "These are all different runs that people submitted to track, so each dot is is actually an attempt to answer the queries as best as possible, and we're showing the precision like basically how likely it is that a given document is relevant on one axis and the subtopic recall on the other axis so.",
                    "label": 0
                },
                {
                    "sent": "If you cover a lot of topics, but you also return a lot of relevant stuff, then you might be down here and you know if you if you just focus on one topic but you everything is relevant, then you'd be up here.",
                    "label": 0
                },
                {
                    "sent": "So here's the range of different systems.",
                    "label": 0
                },
                {
                    "sent": "And one thing that's difficult about this is that if you're if you're not.",
                    "label": 0
                },
                {
                    "sent": "Relevant, it's hard to be diverse, so you it's hard to say.",
                    "label": 0
                },
                {
                    "sent": "I've returned many different meanings of this.",
                    "label": 0
                },
                {
                    "sent": "If you didn't manage to return many things that are on topic at all, so this kind of area of the plot is less interesting than than this kind of area.",
                    "label": 0
                },
                {
                    "sent": "Which of the systems that are doing well and we can actually see that there's differences in these guys are doing better on just flat out, returning relevant documents, and then these guys you know doing better on diversity and.",
                    "label": 0
                },
                {
                    "sent": "Possibly at the expense of returning relevant things.",
                    "label": 0
                },
                {
                    "sent": "Also, this top point here is actually a scrape with a commercial search engine, so if we get rid of that guy, you know there's actually some stuff going on here in terms of the tradeoffs between diversity and relevance.",
                    "label": 0
                },
                {
                    "sent": "You know, even in our first year of experiments.",
                    "label": 0
                },
                {
                    "sent": "So what we're going to do from now on is we're actually going to having argued that these guys aren't that interesting.",
                    "label": 0
                },
                {
                    "sent": "We're just going to focus on on these guys for the rest of the experiments.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "The intent to wear the how we do intend to wear measurement is we just have a set of different.",
                    "label": 0
                },
                {
                    "sent": "Meanings of the query and we're going to have some measure that we're going to do for each meaning, and we're going to have some kind of weighted.",
                    "label": 0
                },
                {
                    "sent": "You know combination of those, so that's just the definition of an intent aware measure is that we know that there are different intents and we're just going to have some weighted combination of those.",
                    "label": 0
                },
                {
                    "sent": "Yes, so this could be N DCG.",
                    "label": 0
                },
                {
                    "sent": "I mean average precision or one of the cascade measures, and yeah.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we're going to have a weighted average.",
                    "label": 0
                },
                {
                    "sent": "Um so.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "But there's a basic problem here with using traditional measures like mean average precision.",
                    "label": 0
                },
                {
                    "sent": "So this is one of the key points.",
                    "label": 0
                },
                {
                    "sent": "The reasons why we're interested in Cascade based measures.",
                    "label": 0
                },
                {
                    "sent": "There's a.",
                    "label": 0
                },
                {
                    "sent": "There's a problem which is.",
                    "label": 0
                },
                {
                    "sent": "Let's say we have one intent that's more likely than the others, like let's say for I I really most people do mean infrared, an meaning information retrieval is actually quite rare if you just have this mixture that we talked about here or this at this average, that's weighted much towards.",
                    "label": 0
                },
                {
                    "sent": "Certain meaning then the right thing to do is to just ignore the minority.",
                    "label": 0
                },
                {
                    "sent": "So what you should do is just return all you know documents about infrared and nothing about information retrieval, because every time you have the choice of returning something, that 80% of the people want versus something that 20% of the people want.",
                    "label": 0
                },
                {
                    "sent": "Let's say you should always return something for the majority, so this is just basically the argument for like we care about cascade measures and part of what we're doing in this paper is, you know.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You know, showing that this matter is and also putting it into into a framework.",
                    "label": 0
                },
                {
                    "sent": "So for the cascade measures, this is the general way we describe all of the different cascade intent.",
                    "label": 1
                },
                {
                    "sent": "Aware Cascade based measures.",
                    "label": 0
                },
                {
                    "sent": "So this is basically the the framework we're going to place all the different measures that have been proposed.",
                    "label": 0
                },
                {
                    "sent": "And so we've got again, this weighted average of subtopics.",
                    "label": 1
                },
                {
                    "sent": "We've got a gain for each result.",
                    "label": 0
                },
                {
                    "sent": "We've got a discount, and we've got a normalization.",
                    "label": 0
                },
                {
                    "sent": "So this is basically we're just saying that all of these different approaches can be described in this way.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um, under the cascade assumption.",
                    "label": 0
                },
                {
                    "sent": "The you know how much I care about a result.",
                    "label": 0
                },
                {
                    "sent": "Has something to do with how much I didn't care about the results above me, so this is the formula from the previous paper that I described an in our case with binary judgments, it simplifies down to this where this Alpha thing is kind of the chances that you will find the current document to satisfy you.",
                    "label": 0
                },
                {
                    "sent": "So basically you know how good this guy is compared to how bad the guys above me where you know depending on how many of the guys above me were actually good, this is basically under binary judgments of simplification of the.",
                    "label": 0
                },
                {
                    "sent": "Uh, of?",
                    "label": 0
                },
                {
                    "sent": "Of these",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Different measures and so now the difference between the measures is just to do with discount.",
                    "label": 0
                },
                {
                    "sent": "Actually, once you've done.",
                    "label": 0
                },
                {
                    "sent": "Done things in the framework that I described, then we are now down to differences in discount and so if we look at Alpha N DCG as proposed by Charlie, it has this discount.",
                    "label": 0
                },
                {
                    "sent": "If you use ER then it has that discount so it's 1 / K one over log K plus one or one over this one and this is the one actually is based on the work of Moffett and Zobel.",
                    "label": 0
                },
                {
                    "sent": "So, um.",
                    "label": 0
                },
                {
                    "sent": "So there's also the question of normalization, right so?",
                    "label": 0
                },
                {
                    "sent": "That was this one here.",
                    "label": 0
                },
                {
                    "sent": "So The thing is, when we're averaging across.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Across multiple queries, we want to actually.",
                    "label": 0
                },
                {
                    "sent": "Not give extra weight to queries that have more subtopics and this can be a problem.",
                    "label": 0
                },
                {
                    "sent": "You know various of the metrics and so people have studied this normalization issue.",
                    "label": 0
                },
                {
                    "sent": "We think normalization is important and what we're introducing here is just a collection independent normalization.",
                    "label": 0
                },
                {
                    "sent": "So we're saying actually I think Charlie might have proposed this.",
                    "label": 0
                },
                {
                    "sent": "At the IR theory conference, but the point is that where we're saying that a collection independent normalization can actually make sense, what that means is that instead of saying let's you normally normalize by an ideal ranking, and I deal in a collection dependent sense means that you've actually gotten NP hard problem of finding the perfect ranking with respect to whatever metric you're currently using, and there's all kinds of problems there.",
                    "label": 1
                },
                {
                    "sent": "And instead we're just going to assume.",
                    "label": 0
                },
                {
                    "sent": "In a collection independent normalization is that there are an unlimited supply of documents that are relevant to all subtopics in the collection, so this is just a way of getting rid of that effect where queries with more subtopics can get.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Can get more weight.",
                    "label": 0
                },
                {
                    "sent": "OK, so within our framework we have this Alpha parameter which is actually.",
                    "label": 0
                },
                {
                    "sent": "You know how?",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, the bottom has been cut off here, but this is Alpha along this axis and always showing here is a sensitivity to the Alpha parameter, so it's saying if we take Alpha N DCG the metric and we vary the parameter Alpha.",
                    "label": 0
                },
                {
                    "sent": "If we have Alpha Pi, then we agree with subtopic recalls, so we're very diversity centric, so this subtopic recall agreement is this way, and.",
                    "label": 0
                },
                {
                    "sent": "If we can, but you know, agreement with the precision based system ordering is reduced so so basically there's we're just showing that yes, the system works under Alpha N DCG.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Under ER, which is was proposed by Chappelle.",
                    "label": 0
                },
                {
                    "sent": "You also have this.",
                    "label": 0
                },
                {
                    "sent": "This kind of thing.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And under.",
                    "label": 0
                },
                {
                    "sent": "And TBP?",
                    "label": 0
                },
                {
                    "sent": "So so, so always showing here is that you know that we've got.",
                    "label": 0
                },
                {
                    "sent": "Single parameter we can look at across all three.",
                    "label": 0
                },
                {
                    "sent": "Three of the previously proposed meth.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is the nature of some sort of tradeoff between caring about diversity and just caring about?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Flat out relevance.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "So we're just showing here empirically.",
                    "label": 0
                },
                {
                    "sent": "The thing that I described before, which is that there is a big difference between intent aware metric on this axis and sorry cascade metric that's intended where versus a non cascade metric that's that's intended, where so we can see that there is that you really do get different answers by having a cascade metric metric measure, and because we believe that it does make sense to have diminishing returns that as you return more, you shouldn't just.",
                    "label": 0
                },
                {
                    "sent": "Favor the 80% of people who wanted infrared.",
                    "label": 0
                },
                {
                    "sent": "You want to have diminishing returns on that, so it makes sense to eventually return some information retrieval.",
                    "label": 0
                },
                {
                    "sent": "And if and if you don't fix it like that, then you've basically got a mess here in terms of the agreement between the different metrics.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And but then, once you get onto.",
                    "label": 0
                },
                {
                    "sent": "You know the the cascade based metrics.",
                    "label": 0
                },
                {
                    "sent": "They agree this we're measuring here the kendalls Tau system ordering.",
                    "label": 0
                },
                {
                    "sent": "So just saying you know, if we order along this axis versus if we order along that axis, so we you know what's this?",
                    "label": 0
                },
                {
                    "sent": "How does the system ordering differ?",
                    "label": 0
                },
                {
                    "sent": "And the doesn't differ?",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which basically or you can just look at this straight line here.",
                    "label": 0
                },
                {
                    "sent": "Similarly RVP Alpha N DCG, so Charlies metric agreeing with muffins or bells intended water version of that.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Again, a good good agreement.",
                    "label": 0
                },
                {
                    "sent": "And finally, you know we're looking at the.",
                    "label": 0
                },
                {
                    "sent": "The different forms of normalization that you can carry out.",
                    "label": 1
                },
                {
                    "sent": "So we're basically saying, do we want to do this NP hard thing of finding the the ideal ranking with respect to the current collection or do we want to just assume that there's lots of good stuff out there in our experiment?",
                    "label": 0
                },
                {
                    "sent": "It doesn't matter what you do, it doesn't matter whether you you know which forms of normalization you use.",
                    "label": 0
                },
                {
                    "sent": "Therefore we'd use the simpler one.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is just a quick look at discriminative power, so it basically just saying can we tell that can be reliably tell the difference between pairs of systems following the method by Sekai here in bootstrapping for example and also with with paired T tests and I think the these numbers are lower than we expected and the number for mean average precision is higher than the number for the intent aware methods.",
                    "label": 0
                },
                {
                    "sent": "But actually that just reflects.",
                    "label": 0
                },
                {
                    "sent": "That in the intent aware evaluation we evaluated 20, whereas for average precision you know it's usually evaluate with everything you've got, so there's just more information in the average precision based method you know.",
                    "label": 0
                },
                {
                    "sent": "Sakai says that it's.",
                    "label": 0
                },
                {
                    "sent": "It's it's it's not sufficient to have good discriminative power.",
                    "label": 0
                },
                {
                    "sent": "You've also got to be measuring the right thing so you know we stick with our diversity aware measures even though they're less able to discriminate between pairs of systems in our.",
                    "label": 0
                },
                {
                    "sent": "In our experiments.",
                    "label": 0
                },
                {
                    "sent": "And it kind of suggests that we need more queries.",
                    "label": 0
                },
                {
                    "sent": "We could also go deeper into the ranking beyond 20, but because we're doing web style diversity where evaluation even going as far as 20, seems fairly fairly deep, and with these cascade models you get kind of less information as you go down the ranking due to the diminishing returns anyway.",
                    "label": 0
                },
                {
                    "sent": "So it sounds like we need maybe more queries if we want to achieve the same level of discriminative power.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So basically what we've done here is taken multiple proposals for how to measure diversity that use subtopic judgments and just put them together and said look, really, we can.",
                    "label": 0
                },
                {
                    "sent": "We can describe the differences here very simply in terms of, for example, discount.",
                    "label": 0
                },
                {
                    "sent": "We we strongly believe that you know the diminishing returns thing makes sense and we and we've shown that that does matter.",
                    "label": 0
                },
                {
                    "sent": "It does change the outcome of the experiment quite a lot.",
                    "label": 0
                },
                {
                    "sent": "The you know, we've got a parameter that provides a tradeoff between just caring about relevance versus caring about diversity.",
                    "label": 1
                },
                {
                    "sent": "We were not convinced, at least in our experiments, we didn't need to do the NP hard thing of actually calculating the ideal ranking with respect to the current labels.",
                    "label": 0
                },
                {
                    "sent": "We could just assume that there's this infinite supply of perfectly relevant stuff, and that normalization is sufficient to get the right answer.",
                    "label": 1
                },
                {
                    "sent": "And you know, we although map has better discriminative power as we found in the end, it's actually.",
                    "label": 0
                },
                {
                    "sent": "It you know, we think that what we're measuring in the web track is actually more interesting with respect to what users actually care about.",
                    "label": 0
                },
                {
                    "sent": "So yeah, that's that's it.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}