{
    "id": "3ivmbv7jdjuwd2tb5pajslt26mhyotts",
    "title": "A Context-Based Semantics for SPARQL Property Paths over the Web",
    "info": {
        "author": [
            "Olaf Hartig, David R. Cheriton School of Computer Science, University of Waterloo"
        ],
        "published": "July 15, 2015",
        "recorded": "June 2015",
        "category": [
            "Top->Computer Science->Big Data",
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/eswc2015_hartig_sparql_paths/",
    "segmentation": [
        [
            "Hello everybody, I'm Olive and what I'm going to present is joint work with my colleague choose Epiro who's sitting over there.",
            "And I want to."
        ],
        [
            "Start with a little puzzle for you guys.",
            "Assume I ask you to give me the URL of every web document that mentions its own URL somewhere in its text.",
            "And of course we can write a computer program to do this.",
            "OK. To make this task a little easier for you, I have this nice button that allows me to pause the web while your program is running.",
            "So when I push this button.",
            "Um?",
            "Nobody changes the web, so nobody is adding documents.",
            "Nobody is deleting documents.",
            "Nobody is changing the content of documents.",
            "So what would be the main idea of the program that you write?",
            "Such that the program returns all these URLs, so I'm going to push the button now to give you a little time for.",
            "Giving me an answer today."
        ],
        [
            "And now I want to talk about our paper.",
            "Which is.",
            "Here's a little disclaimer.",
            "This paper is not about reasoning.",
            "We're here in the reasoning session.",
            "I don't know exactly why our paper was assigned to that session.",
            "The title of the paper is a context based semantics for Spark Property Path over the web.",
            "So what are these property path?"
        ],
        [
            "And that's a new feature that has been introduced in Sparkle 1.1 and it's important feature because it extends the power of sparkle to navigational functionalities.",
            "So with Sparkle property path patterns, you are able to express navigational queries.",
            "And in fact, as of Sparker 1.1.",
            "The atomic element of any Sparky query is not just a triple pattern anymore, it can also be something else, which is called a property path pattern, which is again a triple in which the subject or the object, both of which can be variables, IIS literals or blank nodes and a predicate at the predicate position.",
            "In these triples we have property path expressions."
        ],
        [
            "Um?",
            "Property part expressions essentially are regular expressions over the alphabet of all IIS.",
            "So here's the grammar on reduced version of the grammar of this.",
            "Property path expressions.",
            "You see, we have IIS as the base case, so whenever we have an I I hear you see that simply just a triple pattern.",
            "OK, or we have more expressiveness.",
            "We can have the inverse of a subpath expression.",
            "We can have a concatenation of two sub path expressions.",
            "We can have an alternative of two subparts expressions we can never can have recursive concatenations and there are a couple of more features that I did not just did not put on put on this like this is basically the core.",
            "And you see, it's similar to regular expression.",
            "Now what can we do with this?"
        ],
        [
            "Here's an example.",
            "That's a property path pattern in which we have the UI in a subject we have available in the object.",
            "And here we have a property path expression.",
            "That is a concatenation of a UI for nose and an alternative of either form 8 or the inverse of 4th maker.",
            "So what this is essentially asking for is all the things that somebody made.",
            "And this somebody is known by Bob.",
            "OK now let's assume this is our data that we want to evaluate the pattern over.",
            "We have three triples.",
            "Alice made document one Bob knows Alice and Object A has been made by.",
            "Alice.",
            "OK, now we see that we have one path within this data.",
            "That's going from those.",
            "Why are made to document a that matches all expression and based on this path we can generate one solution laughing.",
            "That's a solution for this query which binds variable X to document A and we have another path which goes from nose to inversely via maker to object A and therefore we can create another solution mapping.",
            "Now."
        ],
        [
            "Too far to define this query semantics formally.",
            "The Sparkle Standard introduces an evaluation function that's defined for all possible property path patterns.",
            "Like our people.",
            "Over any possible RDF graph like our G. I'm at this function defines the expected result for these pairs of pattern graphs.",
            "So in our case, by the definition we find exactly this set of solution mappings to be the expected result for the evaluation of screen.",
            "Now notice that this definition of this function assumes that these patterns are evaluated over single RDF graphs.",
            "Now what happen?"
        ],
        [
            "If.",
            "Our data is this."
        ],
        [
            "Tributed over several documents.",
            "I."
        ],
        [
            "What happens if these documents are distributed over the web?",
            "In other words, what happens if we want to evaluate these queries over linked data on the web?",
            "And basically for this we need an evaluation function which is not defined in this Parker standard, which defines the expected result of any property path pattern over some notion of a web of linked data.",
            "And and obviously a web of linked data is not just a single RDF graph, right?",
            "So that's one of the questions that we want to answer in our paper.",
            "What is the possible definition of such an evaluation function?",
            "And Additionally we want to study?",
            "Assuming we have a definition of what the expected result is, we want to study whether such an expected result can actually be computed in practice and we evaluate these patterns over the web of linked data over the real web and here."
        ],
        [
            "The contributions of our paper.",
            "First of all, we provide a formal definition.",
            "Of what we call a context based query semantics.",
            "That allow us to use property path patterns as queries over linked data on the web, and we have an extension of this definition that extends to sparkle patterns through full sparker patterns that have these property path patterns as their atomic elements.",
            "Next, in the paper, we introduce a web safeness property for such queries, which essentially refers to the fundamental feasibility of being able to.",
            "Compute or execute these queries and practice over the World Wide Web.",
            "And then we introduce a decidable syntactic property.",
            "Of such queries that allows us to identify the queries that are web safe.",
            "And now in the rest of this talk, I want to give you an intuition of this context based semantics and I also want to give you a brief idea of this website for this property, but I don't want to go into any of the technical details you find them in the paper."
        ],
        [
            "OK, so for this context based semantics.",
            "As I said, we want to define an evaluation function that evaluates property path patterns or web airport link data.",
            "So in the paper we have a data model that formally captures this notion of a web of linked data, which is the input to our evaluation function here.",
            "And then I give you a few examples of for the different types of property path patterns for different types of property, expression, property, path expressions.",
            "What the expected results are.",
            "So here we have the simple example.",
            "That's just the triple pattern, so the property path expressions just and I I.",
            "And in the subject position we have in your eye.",
            "And now remember this is, we call this a context based semantics.",
            "The idea here is that for any step of a path expression that we want to match.",
            "We match this step only in specific context documents.",
            "So in the simple case of.",
            "And a pattern like this, the context document is identified, just is the document that we retrieved by looking up the UI in the subject position.",
            "So that would be the context document.",
            "If you look up this year, I will come to this document and now in the document we try to match the first step or this single step of the path expression.",
            "So here we have two triples in our data set or in our document.",
            "And in the object we have two your eyes.",
            "So based on this.",
            "Semantics defines that we have two solution mappings for evaluating this pattern over this data over this web that we have now, let's have a."
        ],
        [
            "At a slightly more complex example, here we have a concatenation.",
            "Off to your eyes.",
            "Again, the first step is finding finding sub paths that match like the left part.",
            "For this, the context documents are still is still the documentary retrieved by looking up your IU and now for the next step for finding subpaths that match this next step, we go to context documents that we retrieved by looking up the UI's coming out or as a result of the first step, which in this case again are these to your eyes.",
            "So the context documents for the 2nd for matching the second part of this path.",
            "Um?",
            "Let's assume that these two because these two is what we retrieved by looking after you guys.",
            "That's assumption.",
            "And now if in these documents we have these matching triples, then basically this is the expected result.",
            "OK. Now."
        ],
        [
            "One more example.",
            "Again, that's a simple triple pattern, but notice that now we have a variable in this subject position, OK?",
            "Here's the definition of what the expected result for this is according to our semantics.",
            "The expected result is a set of solution mappings that bind variable X to a UI.",
            "Such that.",
            "In the document that we retrieved by looking up this UI, we have a triple.",
            "That has the UI in the subject and then P&A.",
            "OK.",
            "So essentially, the context documents for this for it for evaluating this suffix or this expression are all the documents in the web that we query.",
            "And so again, this query is basically asking for all the UI's whose document is mentioning the UI.",
            "Does this sound familiar?",
            "There was like the example in the beginning, right?",
            "And in the beginning I told you that, well, you can write a program to answer this, but this program is not going to be practical.",
            "And it's the same with these query, so you can write a program to answer this query, But this program is not going to be practical.",
            "This program is not going to.",
            "Give you a complete result in a reasonable amount of time.",
            "OK, so in the paper we introduce the notion of web safeness.",
            "So we we say queries are web safe.",
            "If they do not have this nasty property.",
            "This nested property of having to enumerate all possible your eyes in order to give a complete result for the query.",
            "So this Q here is not web safe.",
            "OK."
        ],
        [
            "And then this is the main result that we have in the paper.",
            "We show a syntactic property to identify the queries that are web safe, and this syntactic property is simply.",
            "That a specific subset or set of the revels in the query pattern.",
            "Is equivalent to all the variables in the triple pattern in the query pattern, and we define this.",
            "Specific set we call it conditionally bounded variables, which is defined in the context of some set of variables.",
            "And I do not want to give you the full definition here.",
            "I only want to say that the intuition of this set of variables is that.",
            "Assuming.",
            "So we if we assume we have bindings for all the variables in this set X.",
            "Then we can compute bindings for all the variables that this set returns.",
            "Or that this function returns without enumerating all ur eyes.",
            "OK. That's the intuition behind this definition of this set.",
            "And if we can do this for an empty input set of variables.",
            "And still all the variables of the pattern.",
            "Are in in the result of this function.",
            "Then we say this curious website.",
            "OK, so again in the paper you find all the details you find the proof for this result.",
            "There's one open problem in the work.",
            "Notice that this condition that we give is sufficient only in the theory we have.",
            "Only we see we say only if we do not say if and only if.",
            "And it's an open problem whether there exists an alternative condition that is sufficient as well as necessary and also decidable.",
            "OK.",
            "So."
        ],
        [
            "To conclude, I just want to go again over our contributions.",
            "We have this formal definition of a context based semantics for using property path patterns as queries over link data on the web.",
            "We introduce a website for this property and we entered or NB show syntactic property for deciding whether a query, whether queries web safe.",
            "OK, now that is all I wanted to say.",
            "Now I'm happy to take questions."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hello everybody, I'm Olive and what I'm going to present is joint work with my colleague choose Epiro who's sitting over there.",
                    "label": 0
                },
                {
                    "sent": "And I want to.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Start with a little puzzle for you guys.",
                    "label": 0
                },
                {
                    "sent": "Assume I ask you to give me the URL of every web document that mentions its own URL somewhere in its text.",
                    "label": 1
                },
                {
                    "sent": "And of course we can write a computer program to do this.",
                    "label": 0
                },
                {
                    "sent": "OK. To make this task a little easier for you, I have this nice button that allows me to pause the web while your program is running.",
                    "label": 0
                },
                {
                    "sent": "So when I push this button.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Nobody changes the web, so nobody is adding documents.",
                    "label": 0
                },
                {
                    "sent": "Nobody is deleting documents.",
                    "label": 0
                },
                {
                    "sent": "Nobody is changing the content of documents.",
                    "label": 0
                },
                {
                    "sent": "So what would be the main idea of the program that you write?",
                    "label": 0
                },
                {
                    "sent": "Such that the program returns all these URLs, so I'm going to push the button now to give you a little time for.",
                    "label": 0
                },
                {
                    "sent": "Giving me an answer today.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And now I want to talk about our paper.",
                    "label": 0
                },
                {
                    "sent": "Which is.",
                    "label": 0
                },
                {
                    "sent": "Here's a little disclaimer.",
                    "label": 0
                },
                {
                    "sent": "This paper is not about reasoning.",
                    "label": 1
                },
                {
                    "sent": "We're here in the reasoning session.",
                    "label": 0
                },
                {
                    "sent": "I don't know exactly why our paper was assigned to that session.",
                    "label": 1
                },
                {
                    "sent": "The title of the paper is a context based semantics for Spark Property Path over the web.",
                    "label": 0
                },
                {
                    "sent": "So what are these property path?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And that's a new feature that has been introduced in Sparkle 1.1 and it's important feature because it extends the power of sparkle to navigational functionalities.",
                    "label": 0
                },
                {
                    "sent": "So with Sparkle property path patterns, you are able to express navigational queries.",
                    "label": 1
                },
                {
                    "sent": "And in fact, as of Sparker 1.1.",
                    "label": 0
                },
                {
                    "sent": "The atomic element of any Sparky query is not just a triple pattern anymore, it can also be something else, which is called a property path pattern, which is again a triple in which the subject or the object, both of which can be variables, IIS literals or blank nodes and a predicate at the predicate position.",
                    "label": 0
                },
                {
                    "sent": "In these triples we have property path expressions.",
                    "label": 1
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Property part expressions essentially are regular expressions over the alphabet of all IIS.",
                    "label": 0
                },
                {
                    "sent": "So here's the grammar on reduced version of the grammar of this.",
                    "label": 0
                },
                {
                    "sent": "Property path expressions.",
                    "label": 0
                },
                {
                    "sent": "You see, we have IIS as the base case, so whenever we have an I I hear you see that simply just a triple pattern.",
                    "label": 0
                },
                {
                    "sent": "OK, or we have more expressiveness.",
                    "label": 0
                },
                {
                    "sent": "We can have the inverse of a subpath expression.",
                    "label": 0
                },
                {
                    "sent": "We can have a concatenation of two sub path expressions.",
                    "label": 0
                },
                {
                    "sent": "We can have an alternative of two subparts expressions we can never can have recursive concatenations and there are a couple of more features that I did not just did not put on put on this like this is basically the core.",
                    "label": 0
                },
                {
                    "sent": "And you see, it's similar to regular expression.",
                    "label": 0
                },
                {
                    "sent": "Now what can we do with this?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here's an example.",
                    "label": 0
                },
                {
                    "sent": "That's a property path pattern in which we have the UI in a subject we have available in the object.",
                    "label": 0
                },
                {
                    "sent": "And here we have a property path expression.",
                    "label": 0
                },
                {
                    "sent": "That is a concatenation of a UI for nose and an alternative of either form 8 or the inverse of 4th maker.",
                    "label": 0
                },
                {
                    "sent": "So what this is essentially asking for is all the things that somebody made.",
                    "label": 0
                },
                {
                    "sent": "And this somebody is known by Bob.",
                    "label": 0
                },
                {
                    "sent": "OK now let's assume this is our data that we want to evaluate the pattern over.",
                    "label": 0
                },
                {
                    "sent": "We have three triples.",
                    "label": 0
                },
                {
                    "sent": "Alice made document one Bob knows Alice and Object A has been made by.",
                    "label": 0
                },
                {
                    "sent": "Alice.",
                    "label": 0
                },
                {
                    "sent": "OK, now we see that we have one path within this data.",
                    "label": 0
                },
                {
                    "sent": "That's going from those.",
                    "label": 0
                },
                {
                    "sent": "Why are made to document a that matches all expression and based on this path we can generate one solution laughing.",
                    "label": 0
                },
                {
                    "sent": "That's a solution for this query which binds variable X to document A and we have another path which goes from nose to inversely via maker to object A and therefore we can create another solution mapping.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Too far to define this query semantics formally.",
                    "label": 0
                },
                {
                    "sent": "The Sparkle Standard introduces an evaluation function that's defined for all possible property path patterns.",
                    "label": 0
                },
                {
                    "sent": "Like our people.",
                    "label": 0
                },
                {
                    "sent": "Over any possible RDF graph like our G. I'm at this function defines the expected result for these pairs of pattern graphs.",
                    "label": 0
                },
                {
                    "sent": "So in our case, by the definition we find exactly this set of solution mappings to be the expected result for the evaluation of screen.",
                    "label": 0
                },
                {
                    "sent": "Now notice that this definition of this function assumes that these patterns are evaluated over single RDF graphs.",
                    "label": 0
                },
                {
                    "sent": "Now what happen?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If.",
                    "label": 0
                },
                {
                    "sent": "Our data is this.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tributed over several documents.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What happens if these documents are distributed over the web?",
                    "label": 0
                },
                {
                    "sent": "In other words, what happens if we want to evaluate these queries over linked data on the web?",
                    "label": 0
                },
                {
                    "sent": "And basically for this we need an evaluation function which is not defined in this Parker standard, which defines the expected result of any property path pattern over some notion of a web of linked data.",
                    "label": 0
                },
                {
                    "sent": "And and obviously a web of linked data is not just a single RDF graph, right?",
                    "label": 0
                },
                {
                    "sent": "So that's one of the questions that we want to answer in our paper.",
                    "label": 0
                },
                {
                    "sent": "What is the possible definition of such an evaluation function?",
                    "label": 1
                },
                {
                    "sent": "And Additionally we want to study?",
                    "label": 0
                },
                {
                    "sent": "Assuming we have a definition of what the expected result is, we want to study whether such an expected result can actually be computed in practice and we evaluate these patterns over the web of linked data over the real web and here.",
                    "label": 1
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The contributions of our paper.",
                    "label": 0
                },
                {
                    "sent": "First of all, we provide a formal definition.",
                    "label": 0
                },
                {
                    "sent": "Of what we call a context based query semantics.",
                    "label": 1
                },
                {
                    "sent": "That allow us to use property path patterns as queries over linked data on the web, and we have an extension of this definition that extends to sparkle patterns through full sparker patterns that have these property path patterns as their atomic elements.",
                    "label": 1
                },
                {
                    "sent": "Next, in the paper, we introduce a web safeness property for such queries, which essentially refers to the fundamental feasibility of being able to.",
                    "label": 0
                },
                {
                    "sent": "Compute or execute these queries and practice over the World Wide Web.",
                    "label": 1
                },
                {
                    "sent": "And then we introduce a decidable syntactic property.",
                    "label": 0
                },
                {
                    "sent": "Of such queries that allows us to identify the queries that are web safe.",
                    "label": 1
                },
                {
                    "sent": "And now in the rest of this talk, I want to give you an intuition of this context based semantics and I also want to give you a brief idea of this website for this property, but I don't want to go into any of the technical details you find them in the paper.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so for this context based semantics.",
                    "label": 0
                },
                {
                    "sent": "As I said, we want to define an evaluation function that evaluates property path patterns or web airport link data.",
                    "label": 0
                },
                {
                    "sent": "So in the paper we have a data model that formally captures this notion of a web of linked data, which is the input to our evaluation function here.",
                    "label": 0
                },
                {
                    "sent": "And then I give you a few examples of for the different types of property path patterns for different types of property, expression, property, path expressions.",
                    "label": 0
                },
                {
                    "sent": "What the expected results are.",
                    "label": 0
                },
                {
                    "sent": "So here we have the simple example.",
                    "label": 0
                },
                {
                    "sent": "That's just the triple pattern, so the property path expressions just and I I.",
                    "label": 0
                },
                {
                    "sent": "And in the subject position we have in your eye.",
                    "label": 0
                },
                {
                    "sent": "And now remember this is, we call this a context based semantics.",
                    "label": 0
                },
                {
                    "sent": "The idea here is that for any step of a path expression that we want to match.",
                    "label": 0
                },
                {
                    "sent": "We match this step only in specific context documents.",
                    "label": 0
                },
                {
                    "sent": "So in the simple case of.",
                    "label": 0
                },
                {
                    "sent": "And a pattern like this, the context document is identified, just is the document that we retrieved by looking up the UI in the subject position.",
                    "label": 0
                },
                {
                    "sent": "So that would be the context document.",
                    "label": 0
                },
                {
                    "sent": "If you look up this year, I will come to this document and now in the document we try to match the first step or this single step of the path expression.",
                    "label": 0
                },
                {
                    "sent": "So here we have two triples in our data set or in our document.",
                    "label": 0
                },
                {
                    "sent": "And in the object we have two your eyes.",
                    "label": 0
                },
                {
                    "sent": "So based on this.",
                    "label": 0
                },
                {
                    "sent": "Semantics defines that we have two solution mappings for evaluating this pattern over this data over this web that we have now, let's have a.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At a slightly more complex example, here we have a concatenation.",
                    "label": 0
                },
                {
                    "sent": "Off to your eyes.",
                    "label": 0
                },
                {
                    "sent": "Again, the first step is finding finding sub paths that match like the left part.",
                    "label": 0
                },
                {
                    "sent": "For this, the context documents are still is still the documentary retrieved by looking up your IU and now for the next step for finding subpaths that match this next step, we go to context documents that we retrieved by looking up the UI's coming out or as a result of the first step, which in this case again are these to your eyes.",
                    "label": 0
                },
                {
                    "sent": "So the context documents for the 2nd for matching the second part of this path.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Let's assume that these two because these two is what we retrieved by looking after you guys.",
                    "label": 0
                },
                {
                    "sent": "That's assumption.",
                    "label": 0
                },
                {
                    "sent": "And now if in these documents we have these matching triples, then basically this is the expected result.",
                    "label": 0
                },
                {
                    "sent": "OK. Now.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One more example.",
                    "label": 0
                },
                {
                    "sent": "Again, that's a simple triple pattern, but notice that now we have a variable in this subject position, OK?",
                    "label": 0
                },
                {
                    "sent": "Here's the definition of what the expected result for this is according to our semantics.",
                    "label": 0
                },
                {
                    "sent": "The expected result is a set of solution mappings that bind variable X to a UI.",
                    "label": 0
                },
                {
                    "sent": "Such that.",
                    "label": 0
                },
                {
                    "sent": "In the document that we retrieved by looking up this UI, we have a triple.",
                    "label": 0
                },
                {
                    "sent": "That has the UI in the subject and then P&A.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So essentially, the context documents for this for it for evaluating this suffix or this expression are all the documents in the web that we query.",
                    "label": 0
                },
                {
                    "sent": "And so again, this query is basically asking for all the UI's whose document is mentioning the UI.",
                    "label": 0
                },
                {
                    "sent": "Does this sound familiar?",
                    "label": 0
                },
                {
                    "sent": "There was like the example in the beginning, right?",
                    "label": 0
                },
                {
                    "sent": "And in the beginning I told you that, well, you can write a program to answer this, but this program is not going to be practical.",
                    "label": 0
                },
                {
                    "sent": "And it's the same with these query, so you can write a program to answer this query, But this program is not going to be practical.",
                    "label": 0
                },
                {
                    "sent": "This program is not going to.",
                    "label": 0
                },
                {
                    "sent": "Give you a complete result in a reasonable amount of time.",
                    "label": 0
                },
                {
                    "sent": "OK, so in the paper we introduce the notion of web safeness.",
                    "label": 0
                },
                {
                    "sent": "So we we say queries are web safe.",
                    "label": 0
                },
                {
                    "sent": "If they do not have this nasty property.",
                    "label": 0
                },
                {
                    "sent": "This nested property of having to enumerate all possible your eyes in order to give a complete result for the query.",
                    "label": 0
                },
                {
                    "sent": "So this Q here is not web safe.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then this is the main result that we have in the paper.",
                    "label": 0
                },
                {
                    "sent": "We show a syntactic property to identify the queries that are web safe, and this syntactic property is simply.",
                    "label": 0
                },
                {
                    "sent": "That a specific subset or set of the revels in the query pattern.",
                    "label": 0
                },
                {
                    "sent": "Is equivalent to all the variables in the triple pattern in the query pattern, and we define this.",
                    "label": 0
                },
                {
                    "sent": "Specific set we call it conditionally bounded variables, which is defined in the context of some set of variables.",
                    "label": 1
                },
                {
                    "sent": "And I do not want to give you the full definition here.",
                    "label": 0
                },
                {
                    "sent": "I only want to say that the intuition of this set of variables is that.",
                    "label": 0
                },
                {
                    "sent": "Assuming.",
                    "label": 0
                },
                {
                    "sent": "So we if we assume we have bindings for all the variables in this set X.",
                    "label": 0
                },
                {
                    "sent": "Then we can compute bindings for all the variables that this set returns.",
                    "label": 0
                },
                {
                    "sent": "Or that this function returns without enumerating all ur eyes.",
                    "label": 0
                },
                {
                    "sent": "OK. That's the intuition behind this definition of this set.",
                    "label": 0
                },
                {
                    "sent": "And if we can do this for an empty input set of variables.",
                    "label": 1
                },
                {
                    "sent": "And still all the variables of the pattern.",
                    "label": 0
                },
                {
                    "sent": "Are in in the result of this function.",
                    "label": 0
                },
                {
                    "sent": "Then we say this curious website.",
                    "label": 0
                },
                {
                    "sent": "OK, so again in the paper you find all the details you find the proof for this result.",
                    "label": 0
                },
                {
                    "sent": "There's one open problem in the work.",
                    "label": 1
                },
                {
                    "sent": "Notice that this condition that we give is sufficient only in the theory we have.",
                    "label": 0
                },
                {
                    "sent": "Only we see we say only if we do not say if and only if.",
                    "label": 0
                },
                {
                    "sent": "And it's an open problem whether there exists an alternative condition that is sufficient as well as necessary and also decidable.",
                    "label": 1
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To conclude, I just want to go again over our contributions.",
                    "label": 0
                },
                {
                    "sent": "We have this formal definition of a context based semantics for using property path patterns as queries over link data on the web.",
                    "label": 1
                },
                {
                    "sent": "We introduce a website for this property and we entered or NB show syntactic property for deciding whether a query, whether queries web safe.",
                    "label": 0
                },
                {
                    "sent": "OK, now that is all I wanted to say.",
                    "label": 0
                },
                {
                    "sent": "Now I'm happy to take questions.",
                    "label": 0
                }
            ]
        }
    }
}