{
    "id": "3j5xto5loadrasbcypzslav3mh5yal62",
    "title": "Strengths and Weaknesses of EU-Russia/CIS cooperation in S&T: Two Visions Deriving from ISTCExperience",
    "info": {
        "author": [
            "Jean-Pierre Contzen, Institute of Cell Biology and Genetic Engineering, National Academy of Science of Ukraine"
        ],
        "published": "April 3, 2008",
        "recorded": "March 2008",
        "category": [
            "Top->Science->Scientific Research"
        ]
    },
    "url": "http://videolectures.net/tict08_contzen_swr/",
    "segmentation": [
        [
            "Well dear colleagues, ladies and gentlemen.",
            "Well, it's first a pleasure for me to to be again in Ljubljana.",
            "Where in fact I I was there for a time a regular visitor when I was the Co Chairman of the EC Yougoslavia grand, commissioned on Science and Technology, and before that my first contact with the Institute Nuclear Institute, Joseph Steven was in 9060.",
            "So it shows that I'm not very young where I was working on research reactor and at that time.",
            "Slobodan Nachison, which was in fact ordering the trigger reactors that has been installed here, and I remember discussing with Professor Milanor Austrade who was one of the director problem of safety of these reactors, so I'm glad to be back at this place, so the subject of my presentation is strengths and weaknesses of EU Russia cooperation in science and technology.",
            "I apologize for the Representative of Ukraine and also CIS countries that I have not included in my presentation.",
            "But first I'm more familiar with the Russian scene and be as I'm using a lot of science and technology indicators.",
            "These signs had technology indicators, unified science and technology indicators are missing for these countries in Russia is.",
            "You can find the data.",
            "In COECD data, but for the other country it's missing and maybe this is something where there is a gap to be."
        ],
        [
            "To be filled.",
            "Now my question is, beyond a strong common historical and cultural background, does the normal rationale for International Corporation apply to the relation between European Union and Russia?",
            "And I think the answer requires a comparative analysis of the strengths and weaknesses of their respective ascent."
        ],
        [
            "The system now I would like first to give the sort of rough image of the Russian SMT system as I perceive it and perceived by the colleagues.",
            "The current system is he here to a superb scientific system, yielding excellent technologies in a certain number of areas corresponding to the national priorities of the Soviet Union.",
            "It's in phase of recovery from the catastrophic 90s and as shown, is resilience to these difficult years.",
            "I think other system would have collapsed.",
            "the Russian system is shown a lot of resilient.",
            "For decades it was funded and deman driven through governmental plants and the figure given by Vacaville Owski this morning are confirming it, and still the notion of market and pricing still largely."
        ],
        [
            "Absent.",
            "It has maintained a strength in basic science.",
            "It's someone weaker in applied or translation science.",
            "In technology.",
            "It's an uneven level.",
            "It's clear that University are still lagging in research.",
            "There is a relatively modest industry funded as a science and technology.",
            "I will show you some figure explaining the weakness in industrial innovation, but it can also be explained.",
            "Susie absence so far of a significant internal market.",
            "It's not yet fully integrated in the international networking, so they are still efforts to be made and they are abundant human resources.",
            "But the question is about the future generation.",
            "I am the president of a small scientific foundation in Saint Peters Burg and getting enough PhD student to work in science and engineering.",
            "It's quite hard, so the problem is what about the few?"
        ],
        [
            "Your generation.",
            "Now, beyond the perception of those in direct contact with the Russian system, what do the science and technology indicator tell about this system?",
            "And there I've taken the OECD but also the European Commission key figures for 2007 and European pattern of."
        ],
        [
            "And I go immediately to the."
        ],
        [
            "West Indicator, which is a gross expenditure on R&D in billion US dollar at per parity purchasing power 2005 and also the average annual growth.",
            "The EU 27 represent 231 billion dollars and the growth in 10 years was 3%.",
            "OECD countries represent 772 billion dollars.",
            "With the growth of 3.5%.",
            "The Russian Federation represents 16.7 billion dollars with better growth of 6% during the 10 years and Italy 17.7 percent, 17.7 billion dollars.",
            "With the growth of 2.5%.",
            "For Slovenia, the data I found was about 0.55, so 550 million dollars and between 2000 and 2005, CUEC key figures are giving a reduction of minus 3%, but this is clearly contradictor by so figures is given this morning and I sing Commissioner potocnik as a work of work to ask his services to reconcile some national data.",
            "With what is published in the Economy, See Commission report."
        ],
        [
            "Now in R&D intensity is at the growth expanded urinary DS percent of GDP.",
            "EU 27 is one point 8884 or CD 2.2.",
            "So Russian Federation 1.1, Italy 1.1 and Sylvania 1.22 according to compare 20 figure.",
            "But it became 158 in 2006.",
            "So the message for those who wish to measure.",
            "The importance of the Russian R&D system is nearly the same in terms of potential as the Italian system and for insert for Slovenia.",
            "You know very well the Italian system, so Russia is nearly the same as."
        ],
        [
            "Italy.",
            "And if you look to the R&D, an industrial rose and if you consider that Slovenia is moved, in fact, Slovenia now is located around the average of the EU 27, while Russia would be right now somewhere here.",
            "So there is, you see, is there a difference between Slovenia and and Russia?",
            "Italy?",
            "You see, which is the other reference point?",
            "Is here."
        ],
        [
            "Now in terms of source of funding in performing sector, Russian Federation is quite different from most EU countries, and notably Sylvania in Russia, and his came also, for instance Ebola and only 30% of the gross expenditure on the is financed by business enterprise versus 60% in Slovenia, which is slightly above EU average of 54.5.",
            "In Russia, according to OECD bout 65% of the total are in these performed by business, which is surprising and icing is because a lot of research institution now have the status of Ohio.",
            "But it still you see very much public while in Slovenia it's clear that auto industry is a large performer of."
        ],
        [
            "RND if you look here you find Slovenia there which is let's say in the same category of countries like Belgium and Switzerland where in fact support of research performed by industry is above the general average of the EU 27."
        ],
        [
            "Now, in terms of researchers in the total workforce, Russia can be considered as overstaffed according to World Standard, but the current attrition of the RND workforce will bring it back to the general trend experience elsewhere.",
            "Now, Slovenia with about 6.5 researchers per thousand employment.",
            "And there are Indian's entity of 1.50, is slightly in excess.",
            "Of the EU average and slightly above this general trend, which I."
        ],
        [
            "And show here so you see the sort of general trend taking most of the country is here with the EU 27 there you see that the Russian Federation is there so it means either it has too many people or it's underfunded.",
            "The other explanation could be that if you're there was an abettor funding you see, then it would move and now Slovenia with the latest data I got is somewhere here.",
            "So again.",
            "Near you."
        ],
        [
            "You are 27.",
            "No, in terms of strength of the tertiary education, which is very important for Zen feeding the S&T system.",
            "Russia leads with 55% of the total population age 25 to 64 having a tertiary degree, a University degree well above the OECD average of 28% and while Slovenia Place itself."
        ],
        [
            "18% here you see the very large.",
            "It's only Israel, Estonia, which are nearly the same.",
            "If you take the OECD average, you see it's well under the Russian Federation, and Slovenia is here."
        ],
        [
            "Now.",
            "Of course, in terms of output of any science and technology system, pattern filings constitute an important Ella."
        ],
        [
            "And here I prefer to take."
        ],
        [
            "The second example, which I got from the European Patent Office, is a number of patent filings by residents per $1,000,000 spent in RND.",
            "So in average for the world, if you put $1,000,000 in R&D you get 0.81 patterns, but it rains from South Korea with four 60.",
            "Japan 349 Mirror is 315, Russian Federation, 146 Ukraine 140 two well above Germany Zero 92 China Zero 78 USA Zero 71 and then you go to.",
            "The low side and the Portugal 007 I used with Ministere Gago several time to show that something had to be done.",
            "But you see the strengths in fact of the errors Russia and you."
        ],
        [
            "Brain in terms, but these are national patterns and the weakness of this country is for registering international patterns, notably set world called the triadic patterns.",
            "So where you file in Japan in the USN in the European Union and their Russia is only 5% of the world total, was US's U 27 chairs 28% of the total?",
            "And also you see, these international patterns are generally with foreign pull inventors and Russia is the highest share.",
            "64% of foreign ownership of domain Sing Invention filed international.",
            "So if Russia wishes to evolve, they have to pattern more internationally, but also to do it more with their own domestic."
        ],
        [
            "Resources.",
            "And here you you see this tragic button per million population.",
            "You see UUF here Japan, which is well above the average OECD is there and you see is a Russian Federation zarwell.",
            "Slovenia is not too badly because they ever sort of same performance as Spain or Hungary or Chinese."
        ],
        [
            "Typing.",
            "Pattern with foreign car invasion.",
            "You see Luxembourg, but that's a special case because there only our NDS with Goodyear, Mexico and Russian Federations are with a lot of foreign."
        ],
        [
            "Ownership.",
            "Now another point, and this is bringing back to my point of the weakness of research in University.",
            "In Russia.",
            "In Russia, very few patents are owned by University.",
            "Less than 2% to be opposed to nearly 10%."
        ],
        [
            "If not, which is one of the highest and you say?",
            "Of course you have Singapore, Israel, Ireland.",
            "But then you see you have to go down here to find."
        ],
        [
            "The Russian Federation.",
            "Now what about Slovenia, as shown by the next graph?",
            "Slovenia is birth for performing fairly well for EPO patent."
        ],
        [
            "Application not very far from the Irish performance which is considered there as the European Tiger."
        ],
        [
            "Now one problem for Russia is the internationalization of students.",
            "Russian University are still attracting foreign students for time sake of time.",
            "As tipped the next graph.",
            "But see it's still attracting foreign student.",
            "But the number of Russian students enrolled in University of OECD countries quite low, even if it increased significantly recently, less than 17,000 from Russia.",
            "Over total of 900,000 in 2002.",
            "In comparison, China send 152 thousand students in I802000.",
            "Russia is now about 50,000."
        ],
        [
            "In 2007 no.",
            "Russia has done so far very well in its participation in the framework program and."
        ],
        [
            "A I got this diagram from the participation in FP 6 and you see is at the peak.",
            "Here is a Russian Federation, see others there is China and you see Ukraine is not behaving too badly.",
            "Also, here of course it's still a very, very few people because the total number of participants per country you see is about 400, but.",
            "Let's say that from a qualitative point of view, it's clear that Russia links with the FP program is quite good."
        ],
        [
            "So what are the lessons for EU Russia Corporation?",
            "I think that the statistical data that I've shown confirms this intuitive feeling about Russian science and technology strengths and weakness.",
            "There are some question marks about the importers of business R&D and about the validity of patterns as an indicator of the innovation potential.",
            "Basically, cooperation could rely on to current sign.",
            "Strengths of Russia, basic science, big science, Fusion space, high energy physics.",
            "These will be discussed here tomorrow, but let's say in high energy physics and Fusion also you see Russia."
        ],
        [
            "Quite can see our technological niches, materials, nuclear technology, biotechnology, but remembering that they rely essentially on public financing and public execution.",
            "And this may be a problem for enterprises from Europe using a more refined approach Corporation.",
            "Might be beneficial on emerging industrial product and I think the recent development of small and medium sized enterprises in Russia could constitute a favorable factor in this respect.",
            "And this is also my message to ice DC.",
            "Looked at the emergent of SM ES and not only you see around Moscow St Petersburg.",
            "I was last year you seen Jeetu VAC Chuvash Republic in checkbox Aryan in Tata Stan in Kazan and you see an emergent.",
            "Small and medium sized enterprises and."
        ],
        [
            "I think this is a favorable aspect.",
            "OK, I think that to facilitate cooperation, Russia should surmount some basic witnesses links still to a too much inward looking approach.",
            "Of course it language week networking and surpassed.",
            "There is still a lack of active presence in international meeting an there is a different approach to Corporation, not a breeze.",
            "Are reluctant to share financial burden and this is a problem that left we left to be solved for them."
        ],
        [
            "Future.",
            "There also discrepancies, Internet intellectual property rights policy I said discrepancies, political ispra obstacles such as visas and information disclosure issue, but the visa is not one way.",
            "It's both way getting a Russian scientist to a conference in CU to get a Schengen visa is also quite difficult.",
            "Differences in science and technology structure there is still this week implication of industry and Amiga.",
            "Involvement of the younger generation."
        ],
        [
            "So I think there are obstacles to be surmounted, but in conclusion, I think that in spite of these obstacle Russia remains for the European Union and attractive partner for science and technology cooperation.",
            "Real opportunities exist for creating win win Sybil's situation.",
            "Beyond the better mutual understanding based on her hands personal contact, what is mostly needed is a manifestation of a clear political will on both sides for removing the most wirsing."
        ],
        [
            "Obstacles Pussy bizarre schiefen yummy yummy."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well dear colleagues, ladies and gentlemen.",
                    "label": 0
                },
                {
                    "sent": "Well, it's first a pleasure for me to to be again in Ljubljana.",
                    "label": 0
                },
                {
                    "sent": "Where in fact I I was there for a time a regular visitor when I was the Co Chairman of the EC Yougoslavia grand, commissioned on Science and Technology, and before that my first contact with the Institute Nuclear Institute, Joseph Steven was in 9060.",
                    "label": 0
                },
                {
                    "sent": "So it shows that I'm not very young where I was working on research reactor and at that time.",
                    "label": 0
                },
                {
                    "sent": "Slobodan Nachison, which was in fact ordering the trigger reactors that has been installed here, and I remember discussing with Professor Milanor Austrade who was one of the director problem of safety of these reactors, so I'm glad to be back at this place, so the subject of my presentation is strengths and weaknesses of EU Russia cooperation in science and technology.",
                    "label": 1
                },
                {
                    "sent": "I apologize for the Representative of Ukraine and also CIS countries that I have not included in my presentation.",
                    "label": 0
                },
                {
                    "sent": "But first I'm more familiar with the Russian scene and be as I'm using a lot of science and technology indicators.",
                    "label": 0
                },
                {
                    "sent": "These signs had technology indicators, unified science and technology indicators are missing for these countries in Russia is.",
                    "label": 0
                },
                {
                    "sent": "You can find the data.",
                    "label": 0
                },
                {
                    "sent": "In COECD data, but for the other country it's missing and maybe this is something where there is a gap to be.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To be filled.",
                    "label": 0
                },
                {
                    "sent": "Now my question is, beyond a strong common historical and cultural background, does the normal rationale for International Corporation apply to the relation between European Union and Russia?",
                    "label": 1
                },
                {
                    "sent": "And I think the answer requires a comparative analysis of the strengths and weaknesses of their respective ascent.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The system now I would like first to give the sort of rough image of the Russian SMT system as I perceive it and perceived by the colleagues.",
                    "label": 0
                },
                {
                    "sent": "The current system is he here to a superb scientific system, yielding excellent technologies in a certain number of areas corresponding to the national priorities of the Soviet Union.",
                    "label": 1
                },
                {
                    "sent": "It's in phase of recovery from the catastrophic 90s and as shown, is resilience to these difficult years.",
                    "label": 0
                },
                {
                    "sent": "I think other system would have collapsed.",
                    "label": 1
                },
                {
                    "sent": "the Russian system is shown a lot of resilient.",
                    "label": 0
                },
                {
                    "sent": "For decades it was funded and deman driven through governmental plants and the figure given by Vacaville Owski this morning are confirming it, and still the notion of market and pricing still largely.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Absent.",
                    "label": 0
                },
                {
                    "sent": "It has maintained a strength in basic science.",
                    "label": 1
                },
                {
                    "sent": "It's someone weaker in applied or translation science.",
                    "label": 0
                },
                {
                    "sent": "In technology.",
                    "label": 0
                },
                {
                    "sent": "It's an uneven level.",
                    "label": 1
                },
                {
                    "sent": "It's clear that University are still lagging in research.",
                    "label": 1
                },
                {
                    "sent": "There is a relatively modest industry funded as a science and technology.",
                    "label": 1
                },
                {
                    "sent": "I will show you some figure explaining the weakness in industrial innovation, but it can also be explained.",
                    "label": 0
                },
                {
                    "sent": "Susie absence so far of a significant internal market.",
                    "label": 1
                },
                {
                    "sent": "It's not yet fully integrated in the international networking, so they are still efforts to be made and they are abundant human resources.",
                    "label": 1
                },
                {
                    "sent": "But the question is about the future generation.",
                    "label": 0
                },
                {
                    "sent": "I am the president of a small scientific foundation in Saint Peters Burg and getting enough PhD student to work in science and engineering.",
                    "label": 0
                },
                {
                    "sent": "It's quite hard, so the problem is what about the few?",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Your generation.",
                    "label": 0
                },
                {
                    "sent": "Now, beyond the perception of those in direct contact with the Russian system, what do the science and technology indicator tell about this system?",
                    "label": 1
                },
                {
                    "sent": "And there I've taken the OECD but also the European Commission key figures for 2007 and European pattern of.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I go immediately to the.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "West Indicator, which is a gross expenditure on R&D in billion US dollar at per parity purchasing power 2005 and also the average annual growth.",
                    "label": 1
                },
                {
                    "sent": "The EU 27 represent 231 billion dollars and the growth in 10 years was 3%.",
                    "label": 0
                },
                {
                    "sent": "OECD countries represent 772 billion dollars.",
                    "label": 0
                },
                {
                    "sent": "With the growth of 3.5%.",
                    "label": 0
                },
                {
                    "sent": "The Russian Federation represents 16.7 billion dollars with better growth of 6% during the 10 years and Italy 17.7 percent, 17.7 billion dollars.",
                    "label": 0
                },
                {
                    "sent": "With the growth of 2.5%.",
                    "label": 0
                },
                {
                    "sent": "For Slovenia, the data I found was about 0.55, so 550 million dollars and between 2000 and 2005, CUEC key figures are giving a reduction of minus 3%, but this is clearly contradictor by so figures is given this morning and I sing Commissioner potocnik as a work of work to ask his services to reconcile some national data.",
                    "label": 0
                },
                {
                    "sent": "With what is published in the Economy, See Commission report.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now in R&D intensity is at the growth expanded urinary DS percent of GDP.",
                    "label": 1
                },
                {
                    "sent": "EU 27 is one point 8884 or CD 2.2.",
                    "label": 0
                },
                {
                    "sent": "So Russian Federation 1.1, Italy 1.1 and Sylvania 1.22 according to compare 20 figure.",
                    "label": 0
                },
                {
                    "sent": "But it became 158 in 2006.",
                    "label": 0
                },
                {
                    "sent": "So the message for those who wish to measure.",
                    "label": 0
                },
                {
                    "sent": "The importance of the Russian R&D system is nearly the same in terms of potential as the Italian system and for insert for Slovenia.",
                    "label": 0
                },
                {
                    "sent": "You know very well the Italian system, so Russia is nearly the same as.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Italy.",
                    "label": 0
                },
                {
                    "sent": "And if you look to the R&D, an industrial rose and if you consider that Slovenia is moved, in fact, Slovenia now is located around the average of the EU 27, while Russia would be right now somewhere here.",
                    "label": 0
                },
                {
                    "sent": "So there is, you see, is there a difference between Slovenia and and Russia?",
                    "label": 0
                },
                {
                    "sent": "Italy?",
                    "label": 0
                },
                {
                    "sent": "You see, which is the other reference point?",
                    "label": 0
                },
                {
                    "sent": "Is here.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now in terms of source of funding in performing sector, Russian Federation is quite different from most EU countries, and notably Sylvania in Russia, and his came also, for instance Ebola and only 30% of the gross expenditure on the is financed by business enterprise versus 60% in Slovenia, which is slightly above EU average of 54.5.",
                    "label": 1
                },
                {
                    "sent": "In Russia, according to OECD bout 65% of the total are in these performed by business, which is surprising and icing is because a lot of research institution now have the status of Ohio.",
                    "label": 0
                },
                {
                    "sent": "But it still you see very much public while in Slovenia it's clear that auto industry is a large performer of.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "RND if you look here you find Slovenia there which is let's say in the same category of countries like Belgium and Switzerland where in fact support of research performed by industry is above the general average of the EU 27.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now, in terms of researchers in the total workforce, Russia can be considered as overstaffed according to World Standard, but the current attrition of the RND workforce will bring it back to the general trend experience elsewhere.",
                    "label": 1
                },
                {
                    "sent": "Now, Slovenia with about 6.5 researchers per thousand employment.",
                    "label": 0
                },
                {
                    "sent": "And there are Indian's entity of 1.50, is slightly in excess.",
                    "label": 1
                },
                {
                    "sent": "Of the EU average and slightly above this general trend, which I.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And show here so you see the sort of general trend taking most of the country is here with the EU 27 there you see that the Russian Federation is there so it means either it has too many people or it's underfunded.",
                    "label": 0
                },
                {
                    "sent": "The other explanation could be that if you're there was an abettor funding you see, then it would move and now Slovenia with the latest data I got is somewhere here.",
                    "label": 0
                },
                {
                    "sent": "So again.",
                    "label": 0
                },
                {
                    "sent": "Near you.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You are 27.",
                    "label": 0
                },
                {
                    "sent": "No, in terms of strength of the tertiary education, which is very important for Zen feeding the S&T system.",
                    "label": 0
                },
                {
                    "sent": "Russia leads with 55% of the total population age 25 to 64 having a tertiary degree, a University degree well above the OECD average of 28% and while Slovenia Place itself.",
                    "label": 1
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "18% here you see the very large.",
                    "label": 0
                },
                {
                    "sent": "It's only Israel, Estonia, which are nearly the same.",
                    "label": 0
                },
                {
                    "sent": "If you take the OECD average, you see it's well under the Russian Federation, and Slovenia is here.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "Of course, in terms of output of any science and technology system, pattern filings constitute an important Ella.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here I prefer to take.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The second example, which I got from the European Patent Office, is a number of patent filings by residents per $1,000,000 spent in RND.",
                    "label": 1
                },
                {
                    "sent": "So in average for the world, if you put $1,000,000 in R&D you get 0.81 patterns, but it rains from South Korea with four 60.",
                    "label": 1
                },
                {
                    "sent": "Japan 349 Mirror is 315, Russian Federation, 146 Ukraine 140 two well above Germany Zero 92 China Zero 78 USA Zero 71 and then you go to.",
                    "label": 0
                },
                {
                    "sent": "The low side and the Portugal 007 I used with Ministere Gago several time to show that something had to be done.",
                    "label": 0
                },
                {
                    "sent": "But you see the strengths in fact of the errors Russia and you.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Brain in terms, but these are national patterns and the weakness of this country is for registering international patterns, notably set world called the triadic patterns.",
                    "label": 1
                },
                {
                    "sent": "So where you file in Japan in the USN in the European Union and their Russia is only 5% of the world total, was US's U 27 chairs 28% of the total?",
                    "label": 1
                },
                {
                    "sent": "And also you see, these international patterns are generally with foreign pull inventors and Russia is the highest share.",
                    "label": 1
                },
                {
                    "sent": "64% of foreign ownership of domain Sing Invention filed international.",
                    "label": 0
                },
                {
                    "sent": "So if Russia wishes to evolve, they have to pattern more internationally, but also to do it more with their own domestic.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Resources.",
                    "label": 0
                },
                {
                    "sent": "And here you you see this tragic button per million population.",
                    "label": 0
                },
                {
                    "sent": "You see UUF here Japan, which is well above the average OECD is there and you see is a Russian Federation zarwell.",
                    "label": 0
                },
                {
                    "sent": "Slovenia is not too badly because they ever sort of same performance as Spain or Hungary or Chinese.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Typing.",
                    "label": 0
                },
                {
                    "sent": "Pattern with foreign car invasion.",
                    "label": 0
                },
                {
                    "sent": "You see Luxembourg, but that's a special case because there only our NDS with Goodyear, Mexico and Russian Federations are with a lot of foreign.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ownership.",
                    "label": 0
                },
                {
                    "sent": "Now another point, and this is bringing back to my point of the weakness of research in University.",
                    "label": 0
                },
                {
                    "sent": "In Russia.",
                    "label": 0
                },
                {
                    "sent": "In Russia, very few patents are owned by University.",
                    "label": 1
                },
                {
                    "sent": "Less than 2% to be opposed to nearly 10%.",
                    "label": 1
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If not, which is one of the highest and you say?",
                    "label": 0
                },
                {
                    "sent": "Of course you have Singapore, Israel, Ireland.",
                    "label": 0
                },
                {
                    "sent": "But then you see you have to go down here to find.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The Russian Federation.",
                    "label": 0
                },
                {
                    "sent": "Now what about Slovenia, as shown by the next graph?",
                    "label": 1
                },
                {
                    "sent": "Slovenia is birth for performing fairly well for EPO patent.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Application not very far from the Irish performance which is considered there as the European Tiger.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now one problem for Russia is the internationalization of students.",
                    "label": 0
                },
                {
                    "sent": "Russian University are still attracting foreign students for time sake of time.",
                    "label": 0
                },
                {
                    "sent": "As tipped the next graph.",
                    "label": 0
                },
                {
                    "sent": "But see it's still attracting foreign student.",
                    "label": 0
                },
                {
                    "sent": "But the number of Russian students enrolled in University of OECD countries quite low, even if it increased significantly recently, less than 17,000 from Russia.",
                    "label": 1
                },
                {
                    "sent": "Over total of 900,000 in 2002.",
                    "label": 0
                },
                {
                    "sent": "In comparison, China send 152 thousand students in I802000.",
                    "label": 0
                },
                {
                    "sent": "Russia is now about 50,000.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In 2007 no.",
                    "label": 0
                },
                {
                    "sent": "Russia has done so far very well in its participation in the framework program and.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A I got this diagram from the participation in FP 6 and you see is at the peak.",
                    "label": 0
                },
                {
                    "sent": "Here is a Russian Federation, see others there is China and you see Ukraine is not behaving too badly.",
                    "label": 0
                },
                {
                    "sent": "Also, here of course it's still a very, very few people because the total number of participants per country you see is about 400, but.",
                    "label": 0
                },
                {
                    "sent": "Let's say that from a qualitative point of view, it's clear that Russia links with the FP program is quite good.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what are the lessons for EU Russia Corporation?",
                    "label": 0
                },
                {
                    "sent": "I think that the statistical data that I've shown confirms this intuitive feeling about Russian science and technology strengths and weakness.",
                    "label": 0
                },
                {
                    "sent": "There are some question marks about the importers of business R&D and about the validity of patterns as an indicator of the innovation potential.",
                    "label": 1
                },
                {
                    "sent": "Basically, cooperation could rely on to current sign.",
                    "label": 1
                },
                {
                    "sent": "Strengths of Russia, basic science, big science, Fusion space, high energy physics.",
                    "label": 0
                },
                {
                    "sent": "These will be discussed here tomorrow, but let's say in high energy physics and Fusion also you see Russia.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Quite can see our technological niches, materials, nuclear technology, biotechnology, but remembering that they rely essentially on public financing and public execution.",
                    "label": 1
                },
                {
                    "sent": "And this may be a problem for enterprises from Europe using a more refined approach Corporation.",
                    "label": 0
                },
                {
                    "sent": "Might be beneficial on emerging industrial product and I think the recent development of small and medium sized enterprises in Russia could constitute a favorable factor in this respect.",
                    "label": 1
                },
                {
                    "sent": "And this is also my message to ice DC.",
                    "label": 0
                },
                {
                    "sent": "Looked at the emergent of SM ES and not only you see around Moscow St Petersburg.",
                    "label": 0
                },
                {
                    "sent": "I was last year you seen Jeetu VAC Chuvash Republic in checkbox Aryan in Tata Stan in Kazan and you see an emergent.",
                    "label": 0
                },
                {
                    "sent": "Small and medium sized enterprises and.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I think this is a favorable aspect.",
                    "label": 0
                },
                {
                    "sent": "OK, I think that to facilitate cooperation, Russia should surmount some basic witnesses links still to a too much inward looking approach.",
                    "label": 1
                },
                {
                    "sent": "Of course it language week networking and surpassed.",
                    "label": 1
                },
                {
                    "sent": "There is still a lack of active presence in international meeting an there is a different approach to Corporation, not a breeze.",
                    "label": 0
                },
                {
                    "sent": "Are reluctant to share financial burden and this is a problem that left we left to be solved for them.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Future.",
                    "label": 0
                },
                {
                    "sent": "There also discrepancies, Internet intellectual property rights policy I said discrepancies, political ispra obstacles such as visas and information disclosure issue, but the visa is not one way.",
                    "label": 1
                },
                {
                    "sent": "It's both way getting a Russian scientist to a conference in CU to get a Schengen visa is also quite difficult.",
                    "label": 0
                },
                {
                    "sent": "Differences in science and technology structure there is still this week implication of industry and Amiga.",
                    "label": 1
                },
                {
                    "sent": "Involvement of the younger generation.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I think there are obstacles to be surmounted, but in conclusion, I think that in spite of these obstacle Russia remains for the European Union and attractive partner for science and technology cooperation.",
                    "label": 1
                },
                {
                    "sent": "Real opportunities exist for creating win win Sybil's situation.",
                    "label": 1
                },
                {
                    "sent": "Beyond the better mutual understanding based on her hands personal contact, what is mostly needed is a manifestation of a clear political will on both sides for removing the most wirsing.",
                    "label": 1
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Obstacles Pussy bizarre schiefen yummy yummy.",
                    "label": 0
                }
            ]
        }
    }
}