{
    "id": "3jomcy6kymw2yw5b4bsgajrgik4djzov",
    "title": "Minimal agent based model for the origin and self-organization of financial markets",
    "info": {
        "author": [
            "Luciano Pietronero, Sapienza University of Rome"
        ],
        "published": "Oct. 17, 2008",
        "recorded": "September 2008",
        "category": [
            "Top->Science->Complexity Science"
        ]
    },
    "url": "http://videolectures.net/eccs08_pietronero_mabmftoaso/",
    "segmentation": [
        [
            "Well, good afternoon I would like to thank again the organizers because I also spoke at the pleasure to speak also yesterday and so I would like to thank again the organizer for this series of events and today I will give you a little more technical talk, basically starting from the end of my yesterday general overview and this will be on a model of economics.",
            "And the the idea the two words I would like you to remember after this talk are the word, the minimal and the word self organization and the minimal is very important because they have been very many agent models.",
            "However, each has a lot of parameters and it has been rather difficult to draw conclusions, even though some many of them bringing us interesting information.",
            "But it has been harder to do systematic.",
            "Studies and firm conclusions.",
            "So the ambition is that if you reduce the model, keeping hopefully, the important elements, then you can make some progress and self organization.",
            "Because in the urgent modest only very few cases I think only the minority game.",
            "Once there is the question of self organization.",
            "But this is a very fundamental question which I would like to include into the stylized facts.",
            "Because if you have a model with 10 parameters which can vary in a very large phase.",
            "Case and the market is able to use only for, you know, one millionth of the phase space area.",
            "Somehow you had to question why and I was surprised to see that this is not really dressed then, so I focused especially on these two ideas.",
            "Make it as simple as possible and introduce.",
            "Also the idea said for."
        ],
        [
            "Transition.",
            "OK, this was a generic comment.",
            "I will skip.",
            "OK, well how much we can do in economics.",
            "Agree it is not like physics but maybe."
        ],
        [
            "He is something we can do, and certainly the agent base, then model."
        ],
        [
            "Send that the stylized facts represent the closest situation.",
            "The classic theory of economics is based on the following ideas that you have a situation of equilibrium.",
            "That price change correspond to news, so there is a sort of cause effect.",
            "The news modified the opinion of people and they offer and demand and then the price of course."
        ],
        [
            "It doesn't work at all because the great catastrophic events had no sort of specific calls, so they seem to happen without specific reason, not only but in a more simple technical type of analysis.",
            "Even if you look at every day price distribution.",
            "This contains micro earthquakes which are somehow the small version of the large ones which are also outside the Gaussian.",
            "So to say picture.",
            "So at those case.",
            "There is no relation between cause and effect.",
            "What can this be?"
        ],
        [
            "Video 2.",
            "Well, there have been many studies and they will also go a longer this idea that there is no cause effect relation because you go into a situation of intrinsic instability and the intrinsic instability refers to a characteristic situation of the system that doesn't need a large event to collapse.",
            "So people have identified and I will also conclude that the earning effect is very important.",
            "So if people have no idea about the price of a certain object or stock.",
            "And they are not nervous and don't look at each other.",
            "This is a situation of intrinsic instability and now we would like to put these words into some mathematics.",
            "So."
        ],
        [
            "This is the ambition.",
            "This type of stylized fix I'm going to consider is, of course that you have to have admin rights on the basis that trivial basis is the random walk, But the interesting part is what is beyond beyond the random walk you have the fat table at the clustering, etc.",
            "But I would like to propose a manga stylized facts to understand also the nonstationarity and the self organization.",
            "As I mentioned a few minutes ago.",
            "Nonstationarity is also an element that is often forgotten because.",
            "Clearly we like to think that the agents, like the spin, is that disregard physics or the number of steps of a random walk or something like that.",
            "So we like to have N fixed and then send it to Infinity and this is not what happens in the market in a market and is highly variable and even the question what is N is a very interesting question because N is the number of people, the number of stocks exchanged, the number of effectively independent institution which play at all.",
            "But certainly I don't think one can.",
            "Avoid the question of the intrinsic variability of what is happening in the market."
        ],
        [
            "From this perspective, OK, it is very easy to."
        ],
        [
            "To analyze stylized."
        ],
        [
            "Back so you don't.",
            "I mean this has been mentioned already.",
            "I mean, the basic idea is that you have strong deviation from Gaussian behavior.",
            "You have volatility clustering.",
            "No correlation in the price with design, and a few other properties I found very interesting the paper of Ram account of course with respect to this, there is a question, you know how universal is this stuff?",
            "This has been touched then there are various perspectives.",
            "I'm not as sure as Gene Stanley that everything is a critical exponent with the precise value.",
            "It looks to me the situation may be substantially different.",
            "That's the direction I'm going to go.",
            "If you read the careful analysis by Ramakant and also the following paper from 2000, you see that the question of universality and so on is really an open."
        ],
        [
            "1.",
            "Now what having districts in mind?",
            "I read many papers and in my opinion what attracted me my attention was the famous books marchese paper off 99 and 2000 because I think this paper has some important elements, namely the market is there are two elements in element or stabilization which is the fundamentalist an element of disability station which is the Chartist fundamentalist try to define.",
            "A sort of basic economic value of a stock, and so they play to go back to the stock from below or from above.",
            "So they're an element of stabilization.",
            "The chartist.",
            "They they follow the trend.",
            "So if there is a bubble they buy and they hope the people more more people will buy and so on.",
            "And so they try to distract or vice versa.",
            "If there is a crash.",
            "So the competition between stability and instability looks to me like an interesting element which can also bring.",
            "I mean, if possible comparison with real markets, which is not possible with the other more abstract modernism.",
            "So the other things which appears very important is the herding phenomenon.",
            "The imitation if people tend to look at other people, especially if they don't trust the absolute value of something.",
            "And of course the price behavior influences the behavior of people.",
            "So I thought these four elements are the basis is sort of like an easy model, namely if you maybe the market is more complex, of course, but if you don't have these four elements, I think you are really killing some fundamental effect.",
            "So in my opinion, this was.",
            "Very important, the problem however, is that."
        ],
        [
            "If you read the looks magazine paper, there are a number of mysteries.",
            "The first mystery was already spotted in 1999 by agent that looks and Dietrich staffer, who is right here, and the idea was let us see because you see, the problem looks more cases that the stylized facts only occur for a finite number of agents, namely 500, with the parameters they use now.",
            "One idea was well, 500 is already representative of their symptomatic behavior.",
            "Namely, is like an Infinity.",
            "If you have a distribution of 500 elements, this resembles a Gaussian.",
            "But what these three gentlemen found the immediately after the introduction of the model is that if you go to a larger number, these are our data.",
            "But I mean they looked only this direction.",
            "If you go to larger number, for example 5000 using the stylized facts disappear.",
            "These are the return distribution.",
            "I think you are familiar by now.",
            "We also check for small numbers and formal numbers.",
            "You see that.",
            "Price becomes schizophrenic, so this shows that the stylized facts in the looks marchese class of models.",
            "Because this we will see is a general property.",
            "They do not correspond to some type of critical phenomena because they occur at the final number of agents and they disappear in One Direction or another direction.",
            "If you take a larger smaller number.",
            "So this I really got curious about this.",
            "There are other things."
        ],
        [
            "So that that we tested with tested the robustness of the model with respect to parameters and as you see, the mother is essentially unstable, so the critical region or quasi critic or what you want to call is not really stable, so the parameters influence the model tremendously.",
            "So the other question is why the system goes the self organization, why the system goes into this narrow space of parameters.",
            "Also another problem is that if you look how a bubble is made, these model as.",
            "Optimist and pessimist in the chart is so in the destabilizes they are divided into two groups and what happens is that in a bubble you have, in a realistic, very fast or Cilicia between optimist and pessimist, which is not really what happens.",
            "So this was also an element of problem.",
            "So in summary, even though the model as important elements, in my opinion, the elements are certainly valid, But the question was despite was discussed in a lot.",
            "But there was not much progress in this.",
            "Is that these questions have remained open.",
            "For the past 10 years, so the first idea was."
        ],
        [
            "That gratify a little bit the situation, and my attempt to us to make the money simpler.",
            "So the idea was to reduce these parameters and make it simpler.",
            "Now I tell you only the main idea of these."
        ],
        [
            "For example, what we do is we avoid the optimist and pessimist.",
            "We have only fundamentalist or Chartists, and the charters have just one parameter which is a parameter of disability station in positive or negative direction.",
            "This is a technical point, but it reduces the number of strategies, the number of type of agent from 322 which may not appear appear 30%.",
            "But if you look at the rate equations for the herding, the rates are reduced from 6 to 2.",
            "Because if you have only two, you have 1 + 1.",
            "If you have three, you have that one can go into two and each can go into two.",
            "Now a situation with two rate rate parameters is something you can treat analytically to certain extent, while situation with six parameters is quite a mess.",
            "So I think this is technically a point which change the situation into something tractable and also the simulation become much more controllable in many ways, as we're going to see in a few."
        ],
        [
            "Minutes so the basic idea of the stabilization is an idea.",
            "Is a model introduced by the Takayasu and we also developed a little bit in the past two years.",
            "The idea is that in Agent looks at the moving average, which would be the blue line if the moving average.",
            "If the price is higher than the moving average.",
            "If it is a trend following which is the case, we consider it would go up trend adverse will go down.",
            "We forget that rendered verse, which is basically like the fundamentalist.",
            "So we only consider the trend followers.",
            "So basically the only parameter is how much you are repelled.",
            "By the moving average, so P of T -- P M of the the moving average and this is trend following up or down.",
            "So you don't have to define optimist and pessimist.",
            "You have just trend followers."
        ],
        [
            "In either direction."
        ],
        [
            "This is the technical thing."
        ],
        [
            "In the end, the model reduces to these three equations, so you had two rates on the probability of going from chapters to fundamentals and fundamentals to Chartis, and then the equation also written as a dynamical system.",
            "So there are a number of further simplification with respect to the Looksmart Casey, but basically this is a dynamical system stochastic dynamical system, relatively simple, and as far as we're going to see that this contains all the physics of the original model and one can go.",
            "A lot for Arthur."
        ],
        [
            "I looked into asking you questions.",
            "So the important point is output change opinion.",
            "This was also recently looked at by Alpha Rana look so we only look how people change opinion from fundamentals to Chartist.",
            "This is essentially the Kerman model of Ant behavior and what happens is that there are essentially two parameters, But the idea is that if you have you have two stables, two quasi stable states which oscillate, you know you can become from fundamentalist.",
            "Again go to Chartist.",
            "Of course, the more people you have in terms of total number, the more difficult will be that they all change their mind.",
            "So in practice this means that if you have 100 people and to change their mind, the probability that they do is much larger than if you have a million people.",
            "So this you can see the different equations and this is the key of the finite size problem because what happens is that you can compute here almost analytical or the properties of this model.",
            "And what happens is that the probability of transition is strongly reduced that once again becomes large."
        ],
        [
            "So in practice, if you look at the transitions and we use parameters which resembles the Luke Marchese parameter, so that the interesting thing happens for 500, what happens is that you see 450 you get very strong oscillation and realistic oscillation between fundamentalist and Chartist.",
            "For 5000 you get over millions of time steps.",
            "You get only one or simulation.",
            "One real solution to the Chartists and for 500 you get an interesting intermittent behavior.",
            "So this study clarifies completely.",
            "What is the origin of the finite size effect?",
            "It is a real finite size effect connected with this stochastic dynamics, with the multiplicative dynamics related established by the total number.",
            "So from here it is clear that this is the type of phenomenon which happens in this class of models, and this is in no way a critical phenomenon, even though it is the interesting thing we like, of course why you can say this also leads to one characteristic length.",
            "One characteristic length is not realistic because.",
            "Agents are there with different strategies.",
            "Of course one could compliment this model with the sum of agents with different strategies, but that would not change the fact that you have a finite size effects at different case, so it wouldn't become a genuine critical exponent, but the superposition of finite size effects.",
            "So the big question is, are the data really a genuine critical exponent or something like this?",
            "And certainly this type of models which appear in the eyes of many.",
            "Author very reasonable.",
            "These models do not lead to critical behavior in the sense we in statistical physics never trust.",
            "They lead to something interesting which resembles very much."
        ],
        [
            "Phenomenology of the market.",
            "Once you somehow control everything about the model, you can make it very, very simple.",
            "You can make it 1 Agent Stochastic model which is essentially contains all the information of the original model.",
            "Because now we understand piece by piece.",
            "So essentially the agent can change his or her mind.",
            "You know this is the fundamental price.",
            "So to say.",
            "Of course it's taken constant.",
            "You can make a random walk if you want more nicer picture, but this is a conceptual description.",
            "So one agent can be fundamentalist, then prices.",
            "Here it can be Chartist price change depending on the direction and it has a certain probability to oscillate.",
            "So you see a single agent.",
            "Once you understand everything, you can tune the parameters which are about half, then the original model.",
            "So that is it."
        ],
        [
            "So to reproduce, pretty decent stylized facts.",
            "Of course, now that you control the model, you can tune the parameter that the same happens with 100 with 200 with one million and a few, so you can perfectly control at which finite number the interesting phenomenology occurs."
        ],
        [
            "And that's"
        ],
        [
            "Modeless what you get.",
            "Now you want to argue that times case is not just one time scale, so this is an example in which the volatility clustering you see the case as quasi power law.",
            "So if this is straight, this would be a power law.",
            "Once we consider superposition of agents with different time strategies, this is to show that even though the simplest model would never have an exponential decay, it is very simple to have a superposition as there is there are people who bet on minutes.",
            "On week sit on Mom's so this is the direction one may want to go to make the mother moralistic.",
            "But for the moment that we stick to try to understand that they are."
        ],
        [
            "Essential mathematics this you can always do after so one important thing to understand the bubbles and the fluctuations of the price in the Chartis behavior.",
            "One important thing is what is the action on the market this week later I will also change the number of active people.",
            "Now they active.",
            "People can decide depending on the signal they have to invest more or less.",
            "So this is an intermediate change of volitive.",
            "Total volume now you see what happens is that when people."
        ],
        [
            "We'll let this be short this yeah.",
            "So suppose you are an agent and you see a market in the like with the price due to this red or due to this green you have your own strategy, either fundamental research artists and this market looks interesting to you because you get some signal positive, negative, whatever.",
            "But if you see a market which is more or less flat, you basically don't get much interest.",
            "Of course there are people who like the flat market, but this certainly they're not this that make the fact days.",
            "So yeah, we are focusing on the fluctuations of the market, not that some people would like things not to move at all.",
            "There may be, but if you like, so to say, the action of the market and certainly all the Chartist do it, then what happens is that a market which looks like these two in the above figure attracts you to invest more or later I wish even attracts more people.",
            "So this increases somehow the action in the market which increase."
        ],
        [
            "Is the price fluctuation and so in this model we reproduce in a macroscopic sense?",
            "What is the gotcha mechanism?",
            "Because the garage mechanism is simply a phenomenological relation that the variance at time T + 1 depends on the values of time T and on the price fluctuation.",
            "Now we exactly understand this relation in terms of the agents, I mean microscopically.",
            "So basically the model does what the phenomenologically is a gas phenomenon.",
            "But now we can ask it and why you don't have correlation in the price."
        ],
        [
            "And then."
        ],
        [
            "And you don't take your issue in the price is that the change of price with design is it depends on the action, but also many other parameters like the precise structure of Chartist and fundamentalist.",
            "The what is the moving average, the PF etc.",
            "And all these elements are incoherent among them, so the variance is only a multiplicative feedback of the action of the market, while the direction of the price depends on these other parameters.",
            "So one gets a pretty reasonable interpretation.",
            "I don't claim this is really new, but the model shoot this in a very transparent way and you can even quantify how much things that."
        ],
        [
            "The decorrelated and so on.",
            "Now if we want to address the question of self organization, we have to make this oscillation business slightly more realistic.",
            "For the moment Chartist and fundamentalist are perfectly symmetric, so at long time that would be the same time spent in the Chartist state as much in the fundamentalists.",
            "This would imply that markets are full of bubbles.",
            "You know every day or every month or so, which is a bit excessive, even though these things appear.",
            "So the idea is that on the long range fundamentalist dominate the markets and the bubbles are occasional fluctuation.",
            "This implies that in our model we have to even a symmetric situation in which fundamentalist are a little bit more stable than Chartist."
        ],
        [
            "This you can modify."
        ],
        [
            "I innocent."
        ],
        [
            "Away and you get typical things like this, so the fundamentalist are more stable and location and you get the flex to issue in the Chartist.",
            "Now what happens?",
            "Suppose you have you have a situation with fundamentals with a lot of fundamentals.",
            "They get stabilized among themselves and the price is very flat.",
            "On the other hand, if they can oscillate so the number of people is less that their solution is more likely you get a final, appreciable probability to go to the Chartist.",
            "And you get the more interesting market for investors.",
            "So now we."
        ],
        [
            "Can see that there possibly."
        ],
        [
            "We did that.",
            "This type of volatility we hear you have very large N, namely 5000.",
            "Then you have the very small N 50 is the red and here you have the 500.",
            "This is tuned always so that 500 is the good number.",
            "You could have used another one and the 500 you see volatility versus time looks.",
            "Today I very similar to area stock for example.",
            "So what happens if you are an agent and you see a market like this?",
            "It doesn't look very much opportunities and maybe you got to another market which looks more interesting.",
            "On the other hand, so a situation like the green one will decrease the number 5000 to a smaller number, and so on until it gets up.",
            "Say interesting for investors.",
            "On the other hand, if the number is very small, you get this huge fast fluctuations which present opportunities of arbitrage, and then this is attracts the market.",
            "The fluctuations get modified, not necessarily reduced, because you see.",
            "The peaks of the black are even higher than the average red, and so from above or from below.",
            "If you put the threshold in the agent section, so people would like some action, and if there is no action, they tend to go out.",
            "That's the only thing you put you get."
        ],
        [
            "Some type."
        ],
        [
            "Self organizing."
        ],
        [
            "Ocean of."
        ],
        [
            "This type that if you start with the large number of agents you see they go away because of these thresholds and they converge to the characteristic number.",
            "And if you start with the small number they go up etc.",
            "Now this idea together with the interpretation of the Hardy mechanism is a real finite size effects brings this short story of the agent models in a totally different perspective because now what would be because?",
            "People realized that there was this final 10 and this couldn't be right because clearly markets are completely different number of agents.",
            "No matter how you define the effective number of agents.",
            "So the problem is we should try to find the model where you get the critical behavior when N goes to Infinity and then you can say OK all markets have large number of agent and therefore Infinity is good as well, approximated by if I wandered by 5000 by 5 million as we usually reason.",
            "With the Gaussian stuff, now we I'm offering you another interpretation, namely the question of the finer size together with the self organization separation can be done better than this.",
            "I mean, the behavior is certainly more complex than just attrition, but as soon as we introduced the strong variability the possibility of variability of the total number.",
            "This becomes an interesting nonstationarity variable which can.",
            "Easily adjust the system to the critical situation so the idea would be the following.",
            "You have characteristic parameters for each market which can be completely different.",
            "The total capitalization of IBM is very different than some small pizza company, but you know these parameters are completely different.",
            "The agents adjust to these parameters in such a way that they are in the critical state.",
            "Because this is the state which is marginally stable for.",
            "Trading, namely, if it is 2, if it is too flat, it repairs the agents.",
            "If it is 2 fluctuate ING it attracts the agents because there is arbitrage possibility.",
            "Now you see this change the fact that you need universality because each market adjusts to a different level.",
            "Now how much this can be tested in the data is certainly something very important, and for the rest of the few minutes I still we talk.",
            "I show you why this."
        ],
        [
            "That is, here you are with the number of very spicey."
        ],
        [
            "We get results you see, because for example, now we can ask it what gives what India.",
            "We can dissect the model as in a surgery table and put it on.",
            "The chart is only fundamentalist.",
            "Do some analytical limit and so on.",
            "So I make some comments which show our flexible is and the in principle one can use it to ask a new question.",
            "For example, yeah, we're we eliminate the price effect in the transition probability.",
            "The transition probability as a herding term, and the price term.",
            "Of course, if you see that the price goes up or so as a Chartist, you are very much influenced.",
            "Well, you see, if you eliminate the price, things don't change much.",
            "So the key point to make this stylized facts are is not the price, but is the hardening.",
            "That's the first thing."
        ],
        [
            "We live in this class of model.",
            "The dynamics is linear.",
            "There is no price.",
            "Of course they would say the fat face are not that fat, but the essential properties of the stylized facts remain only with the herd."
        ],
        [
            "Term.",
            "OK, then you put the price and theologian easy with respect to time orizon use it a ether agility with respect to time orizon means that you have agents which actor with different time steps and so this decorrelate's the earning effect.",
            "So in some sense if you want to increase now the volatility clustering you should increase the parameter with respect to the case in which they all do the same thing.",
            "So there is an effect of the correlation once.",
            "You adopted."
        ],
        [
            "French artists with different times, of course.",
            "The fact they become larger."
        ],
        [
            "Then OK, this is the self organization for values, NUM."
        ],
        [
            "But this is not so important, let me."
        ],
        [
            "Show you something OK?",
            "Well, you see you can study the diffusion properties for the two limiting cases, which is something you cannot do with the standard model and what you have is that if you have only fundamentalists, you get that the variance converge to a finite variance, so you don't really have a random walk.",
            "Of course you could ever random walk for the fundamental price, but this is another story.",
            "We use a constant fundamental price.",
            "Well, if you have only Chartist they.",
            "Producer is sort of diffusive behavior if you have the mixer case, you get that the diffusion is larger than the fundamental is still on, But this finally somehow anchored to the fundamental price.",
            "This is in this scheme, of course, if the fundamental price changed, then this also gets."
        ],
        [
            "The random walk.",
            "Then the idea is how much what you see there in the stylized facts is a superposition of two independent phenomenon.",
            "Since now we can study what the fundamentals do and what the charges do.",
            "So the idea is that you cannot argue like this because if you have the superposition are two phenomena that independent phenomena are that these are the fundamentals for auto correct auto covariance and this would be the Chartist.",
            "But the full model gives this.",
            "Gives strong autocorrelation, while neither one gives out of a relation, so interesting stuff is the population dynamics is important and you cannot do the incoherent sum of the two population, so these are all things that you learn in a very specific way and which."
        ],
        [
            "Review of rather specific clue on what is happening.",
            "You see, this is the probability density function.",
            "For returns mean what is called the Fat Ace for different times case as you see, you never get to the Gaussian and this we can understand given the previous discussion that you never get to the Gaussian in order to."
        ],
        [
            "After the ocean you have to include the fact that the PF the fundamental price also as a fluctuation like a random Walker and then the Gaussian you converge is the Gaussian of the fundamental price.",
            "As I'm out fluctuation.",
            "So in this respect the model originally doesn't have the convergence introduction, which is something observed but with reasonably natural assumption that the fundamental prices also fluctuation.",
            "This can be achieved."
        ],
        [
            "A final comment that is up to now.",
            "I have only discussed the linear dynamics.",
            "The real dynamics is multiplicative, so is a log dynamics.",
            "Now the two are considered similar and if you want to get analytical results, the linear is extremely more convenient, but the real one is multiplicative, so we made some tests or what happens if you use a multiplicative dynamic.",
            "So in general your simulation is less stable because you everything gets multiplicative so.",
            "Parameters are more delicate, however, and analytical results become essentially impossible.",
            "Why they are in this version of the model, they are relatively easy in the in the linear dynamics.",
            "Then there are additional subset difference which are only interested if you really do it.",
            "So I would not mess."
        ],
        [
            "And it here.",
            "But basically the."
        ],
        [
            "Stage for the multiplicative dynamic."
        ],
        [
            "Except become larger and very much sensitive to parameter.",
            "So for example, these are the Fed pays for the multiplicative dynamics, with the two slightly different set of parameters.",
            "Of course we have taken them to amplify the difference, but you see if you change a little bit the parameters for tail can be almost very small with respect to a Gaussian or extremely large.",
            "This is an interesting question which may actually be realistic phenomenon of markets."
        ],
        [
            "And this is also out.",
            "The effects are very much bigger in the logarithmic than in the linear this."
        ],
        [
            "Of course it is to be expected."
        ],
        [
            "So in summary."
        ],
        [
            "That's OK."
        ],
        [
            "These are other techniques."
        ],
        [
            "Pointset not."
        ],
        [
            "Also, this definition or app is more or less it in a similar way, with the multiplicative dynamics."
        ],
        [
            "I don't mention, so let me summarize.",
            "So first with respect to the self organization, which is something almost never discussed, that there are two possibilities.",
            "One, the more I would say traditional vision is this final 10 is a problem.",
            "One should get rid of and then go to a model in which this doesn't happen.",
            "It doesn't happen in the sense that the model leads to critical behavior for then that goes to Infinity.",
            "Up to now this path.",
            "I don't think has been very successful in models of this type.",
            "When N goes to Infinity, the interesting phenomenology disappears.",
            "So what and also self organization with respect to the other parameters of the model is not being discussed the match.",
            "The present interpretation takes seriously finite size, but together with the self organization there is a sort of self organized intermittency instead of criticality to this.",
            "The final size fluctuations, so this would solve in a way this parcel of the final ten and also the question of the self organization.",
            "Of course you can do more sophisticated self organization, but that would be the story if you take this second vision, which is the one which comes straight out of our studies.",
            "Finite size effects in real this means that you cannot really expect universality and the power laws.",
            "Are somehow the superposition of different times case, but they are ternative is that you take different times case which are coupled in a very interesting way, but which would be beyond this class of models and they produce a genuine power law in the critical sense.",
            "But this would be completely beyond this kind of elements that goes away from the looks malkasian similar model through the present type of story."
        ],
        [
            "So OK, the model can be.",
            "Yeah, they they very important element is earning so it would be interesting to test for herding in data and what we plan to try is given a time series of the price to reconstruct the population of fundamentalist and Chartist by working the model backward.",
            "This is something which could have an applied interest.",
            "And then of course one can.",
            "Make the money more realistic in various directions like these are different times case, but I would be cautious and personally I try to make things more complex.",
            "One element by one, because if you die if you put all the possible realistic elements together then you end up with a situation like before that it is essentially impossible to get rid of the complexity of the many para."
        ],
        [
            "With this well, I think with this I conclude.",
            "Thank you for your attention.",
            "Yes, this is indirectly in the things which I did not show so.",
            "Indirectly, this relates to the following problem.",
            "If you take for example auto covariance real data if they got over covariance for the model loose of the price of the price fluctuation or the square or the NTH power you see there is a in order.",
            "See here for example, that there is an order.",
            "Can you put the light down so there is an order of the size of photo covariance in which the exponent one is larger than the exponent two?",
            "So while if you use for example the linear, this is for the logarithmic model for the linear model you have the opposite, so the exponent one is smaller than exponent two.",
            "This type of things are related to multi.",
            "To what this called multi fractality, namely the power of the correlations, have a complex behavior, so we didn't try the multifactor spectrum as tradition, but I would say what is called multi fractality is contained in this type of ordering of different powers so but one can do that explicitly in the multifractal language and thank you.",
            "Probably we should do it.",
            "So it's something one can certainly look at."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, good afternoon I would like to thank again the organizers because I also spoke at the pleasure to speak also yesterday and so I would like to thank again the organizer for this series of events and today I will give you a little more technical talk, basically starting from the end of my yesterday general overview and this will be on a model of economics.",
                    "label": 0
                },
                {
                    "sent": "And the the idea the two words I would like you to remember after this talk are the word, the minimal and the word self organization and the minimal is very important because they have been very many agent models.",
                    "label": 0
                },
                {
                    "sent": "However, each has a lot of parameters and it has been rather difficult to draw conclusions, even though some many of them bringing us interesting information.",
                    "label": 0
                },
                {
                    "sent": "But it has been harder to do systematic.",
                    "label": 0
                },
                {
                    "sent": "Studies and firm conclusions.",
                    "label": 0
                },
                {
                    "sent": "So the ambition is that if you reduce the model, keeping hopefully, the important elements, then you can make some progress and self organization.",
                    "label": 0
                },
                {
                    "sent": "Because in the urgent modest only very few cases I think only the minority game.",
                    "label": 0
                },
                {
                    "sent": "Once there is the question of self organization.",
                    "label": 0
                },
                {
                    "sent": "But this is a very fundamental question which I would like to include into the stylized facts.",
                    "label": 0
                },
                {
                    "sent": "Because if you have a model with 10 parameters which can vary in a very large phase.",
                    "label": 0
                },
                {
                    "sent": "Case and the market is able to use only for, you know, one millionth of the phase space area.",
                    "label": 0
                },
                {
                    "sent": "Somehow you had to question why and I was surprised to see that this is not really dressed then, so I focused especially on these two ideas.",
                    "label": 0
                },
                {
                    "sent": "Make it as simple as possible and introduce.",
                    "label": 0
                },
                {
                    "sent": "Also the idea said for.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Transition.",
                    "label": 0
                },
                {
                    "sent": "OK, this was a generic comment.",
                    "label": 0
                },
                {
                    "sent": "I will skip.",
                    "label": 0
                },
                {
                    "sent": "OK, well how much we can do in economics.",
                    "label": 0
                },
                {
                    "sent": "Agree it is not like physics but maybe.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "He is something we can do, and certainly the agent base, then model.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Send that the stylized facts represent the closest situation.",
                    "label": 0
                },
                {
                    "sent": "The classic theory of economics is based on the following ideas that you have a situation of equilibrium.",
                    "label": 1
                },
                {
                    "sent": "That price change correspond to news, so there is a sort of cause effect.",
                    "label": 1
                },
                {
                    "sent": "The news modified the opinion of people and they offer and demand and then the price of course.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It doesn't work at all because the great catastrophic events had no sort of specific calls, so they seem to happen without specific reason, not only but in a more simple technical type of analysis.",
                    "label": 0
                },
                {
                    "sent": "Even if you look at every day price distribution.",
                    "label": 0
                },
                {
                    "sent": "This contains micro earthquakes which are somehow the small version of the large ones which are also outside the Gaussian.",
                    "label": 0
                },
                {
                    "sent": "So to say picture.",
                    "label": 0
                },
                {
                    "sent": "So at those case.",
                    "label": 0
                },
                {
                    "sent": "There is no relation between cause and effect.",
                    "label": 0
                },
                {
                    "sent": "What can this be?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Video 2.",
                    "label": 0
                },
                {
                    "sent": "Well, there have been many studies and they will also go a longer this idea that there is no cause effect relation because you go into a situation of intrinsic instability and the intrinsic instability refers to a characteristic situation of the system that doesn't need a large event to collapse.",
                    "label": 0
                },
                {
                    "sent": "So people have identified and I will also conclude that the earning effect is very important.",
                    "label": 0
                },
                {
                    "sent": "So if people have no idea about the price of a certain object or stock.",
                    "label": 0
                },
                {
                    "sent": "And they are not nervous and don't look at each other.",
                    "label": 0
                },
                {
                    "sent": "This is a situation of intrinsic instability and now we would like to put these words into some mathematics.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is the ambition.",
                    "label": 0
                },
                {
                    "sent": "This type of stylized fix I'm going to consider is, of course that you have to have admin rights on the basis that trivial basis is the random walk, But the interesting part is what is beyond beyond the random walk you have the fat table at the clustering, etc.",
                    "label": 1
                },
                {
                    "sent": "But I would like to propose a manga stylized facts to understand also the nonstationarity and the self organization.",
                    "label": 0
                },
                {
                    "sent": "As I mentioned a few minutes ago.",
                    "label": 0
                },
                {
                    "sent": "Nonstationarity is also an element that is often forgotten because.",
                    "label": 0
                },
                {
                    "sent": "Clearly we like to think that the agents, like the spin, is that disregard physics or the number of steps of a random walk or something like that.",
                    "label": 0
                },
                {
                    "sent": "So we like to have N fixed and then send it to Infinity and this is not what happens in the market in a market and is highly variable and even the question what is N is a very interesting question because N is the number of people, the number of stocks exchanged, the number of effectively independent institution which play at all.",
                    "label": 0
                },
                {
                    "sent": "But certainly I don't think one can.",
                    "label": 0
                },
                {
                    "sent": "Avoid the question of the intrinsic variability of what is happening in the market.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From this perspective, OK, it is very easy to.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To analyze stylized.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Back so you don't.",
                    "label": 0
                },
                {
                    "sent": "I mean this has been mentioned already.",
                    "label": 0
                },
                {
                    "sent": "I mean, the basic idea is that you have strong deviation from Gaussian behavior.",
                    "label": 0
                },
                {
                    "sent": "You have volatility clustering.",
                    "label": 0
                },
                {
                    "sent": "No correlation in the price with design, and a few other properties I found very interesting the paper of Ram account of course with respect to this, there is a question, you know how universal is this stuff?",
                    "label": 0
                },
                {
                    "sent": "This has been touched then there are various perspectives.",
                    "label": 0
                },
                {
                    "sent": "I'm not as sure as Gene Stanley that everything is a critical exponent with the precise value.",
                    "label": 0
                },
                {
                    "sent": "It looks to me the situation may be substantially different.",
                    "label": 0
                },
                {
                    "sent": "That's the direction I'm going to go.",
                    "label": 0
                },
                {
                    "sent": "If you read the careful analysis by Ramakant and also the following paper from 2000, you see that the question of universality and so on is really an open.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "1.",
                    "label": 0
                },
                {
                    "sent": "Now what having districts in mind?",
                    "label": 0
                },
                {
                    "sent": "I read many papers and in my opinion what attracted me my attention was the famous books marchese paper off 99 and 2000 because I think this paper has some important elements, namely the market is there are two elements in element or stabilization which is the fundamentalist an element of disability station which is the Chartist fundamentalist try to define.",
                    "label": 0
                },
                {
                    "sent": "A sort of basic economic value of a stock, and so they play to go back to the stock from below or from above.",
                    "label": 0
                },
                {
                    "sent": "So they're an element of stabilization.",
                    "label": 0
                },
                {
                    "sent": "The chartist.",
                    "label": 0
                },
                {
                    "sent": "They they follow the trend.",
                    "label": 1
                },
                {
                    "sent": "So if there is a bubble they buy and they hope the people more more people will buy and so on.",
                    "label": 1
                },
                {
                    "sent": "And so they try to distract or vice versa.",
                    "label": 0
                },
                {
                    "sent": "If there is a crash.",
                    "label": 0
                },
                {
                    "sent": "So the competition between stability and instability looks to me like an interesting element which can also bring.",
                    "label": 0
                },
                {
                    "sent": "I mean, if possible comparison with real markets, which is not possible with the other more abstract modernism.",
                    "label": 0
                },
                {
                    "sent": "So the other things which appears very important is the herding phenomenon.",
                    "label": 0
                },
                {
                    "sent": "The imitation if people tend to look at other people, especially if they don't trust the absolute value of something.",
                    "label": 1
                },
                {
                    "sent": "And of course the price behavior influences the behavior of people.",
                    "label": 1
                },
                {
                    "sent": "So I thought these four elements are the basis is sort of like an easy model, namely if you maybe the market is more complex, of course, but if you don't have these four elements, I think you are really killing some fundamental effect.",
                    "label": 0
                },
                {
                    "sent": "So in my opinion, this was.",
                    "label": 0
                },
                {
                    "sent": "Very important, the problem however, is that.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you read the looks magazine paper, there are a number of mysteries.",
                    "label": 0
                },
                {
                    "sent": "The first mystery was already spotted in 1999 by agent that looks and Dietrich staffer, who is right here, and the idea was let us see because you see, the problem looks more cases that the stylized facts only occur for a finite number of agents, namely 500, with the parameters they use now.",
                    "label": 0
                },
                {
                    "sent": "One idea was well, 500 is already representative of their symptomatic behavior.",
                    "label": 0
                },
                {
                    "sent": "Namely, is like an Infinity.",
                    "label": 0
                },
                {
                    "sent": "If you have a distribution of 500 elements, this resembles a Gaussian.",
                    "label": 0
                },
                {
                    "sent": "But what these three gentlemen found the immediately after the introduction of the model is that if you go to a larger number, these are our data.",
                    "label": 0
                },
                {
                    "sent": "But I mean they looked only this direction.",
                    "label": 0
                },
                {
                    "sent": "If you go to larger number, for example 5000 using the stylized facts disappear.",
                    "label": 0
                },
                {
                    "sent": "These are the return distribution.",
                    "label": 0
                },
                {
                    "sent": "I think you are familiar by now.",
                    "label": 0
                },
                {
                    "sent": "We also check for small numbers and formal numbers.",
                    "label": 0
                },
                {
                    "sent": "You see that.",
                    "label": 0
                },
                {
                    "sent": "Price becomes schizophrenic, so this shows that the stylized facts in the looks marchese class of models.",
                    "label": 0
                },
                {
                    "sent": "Because this we will see is a general property.",
                    "label": 0
                },
                {
                    "sent": "They do not correspond to some type of critical phenomena because they occur at the final number of agents and they disappear in One Direction or another direction.",
                    "label": 0
                },
                {
                    "sent": "If you take a larger smaller number.",
                    "label": 0
                },
                {
                    "sent": "So this I really got curious about this.",
                    "label": 0
                },
                {
                    "sent": "There are other things.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that that we tested with tested the robustness of the model with respect to parameters and as you see, the mother is essentially unstable, so the critical region or quasi critic or what you want to call is not really stable, so the parameters influence the model tremendously.",
                    "label": 1
                },
                {
                    "sent": "So the other question is why the system goes the self organization, why the system goes into this narrow space of parameters.",
                    "label": 0
                },
                {
                    "sent": "Also another problem is that if you look how a bubble is made, these model as.",
                    "label": 0
                },
                {
                    "sent": "Optimist and pessimist in the chart is so in the destabilizes they are divided into two groups and what happens is that in a bubble you have, in a realistic, very fast or Cilicia between optimist and pessimist, which is not really what happens.",
                    "label": 0
                },
                {
                    "sent": "So this was also an element of problem.",
                    "label": 0
                },
                {
                    "sent": "So in summary, even though the model as important elements, in my opinion, the elements are certainly valid, But the question was despite was discussed in a lot.",
                    "label": 0
                },
                {
                    "sent": "But there was not much progress in this.",
                    "label": 1
                },
                {
                    "sent": "Is that these questions have remained open.",
                    "label": 1
                },
                {
                    "sent": "For the past 10 years, so the first idea was.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That gratify a little bit the situation, and my attempt to us to make the money simpler.",
                    "label": 0
                },
                {
                    "sent": "So the idea was to reduce these parameters and make it simpler.",
                    "label": 0
                },
                {
                    "sent": "Now I tell you only the main idea of these.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For example, what we do is we avoid the optimist and pessimist.",
                    "label": 0
                },
                {
                    "sent": "We have only fundamentalist or Chartists, and the charters have just one parameter which is a parameter of disability station in positive or negative direction.",
                    "label": 0
                },
                {
                    "sent": "This is a technical point, but it reduces the number of strategies, the number of type of agent from 322 which may not appear appear 30%.",
                    "label": 0
                },
                {
                    "sent": "But if you look at the rate equations for the herding, the rates are reduced from 6 to 2.",
                    "label": 0
                },
                {
                    "sent": "Because if you have only two, you have 1 + 1.",
                    "label": 0
                },
                {
                    "sent": "If you have three, you have that one can go into two and each can go into two.",
                    "label": 0
                },
                {
                    "sent": "Now a situation with two rate rate parameters is something you can treat analytically to certain extent, while situation with six parameters is quite a mess.",
                    "label": 0
                },
                {
                    "sent": "So I think this is technically a point which change the situation into something tractable and also the simulation become much more controllable in many ways, as we're going to see in a few.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Minutes so the basic idea of the stabilization is an idea.",
                    "label": 0
                },
                {
                    "sent": "Is a model introduced by the Takayasu and we also developed a little bit in the past two years.",
                    "label": 0
                },
                {
                    "sent": "The idea is that in Agent looks at the moving average, which would be the blue line if the moving average.",
                    "label": 0
                },
                {
                    "sent": "If the price is higher than the moving average.",
                    "label": 0
                },
                {
                    "sent": "If it is a trend following which is the case, we consider it would go up trend adverse will go down.",
                    "label": 0
                },
                {
                    "sent": "We forget that rendered verse, which is basically like the fundamentalist.",
                    "label": 0
                },
                {
                    "sent": "So we only consider the trend followers.",
                    "label": 0
                },
                {
                    "sent": "So basically the only parameter is how much you are repelled.",
                    "label": 0
                },
                {
                    "sent": "By the moving average, so P of T -- P M of the the moving average and this is trend following up or down.",
                    "label": 0
                },
                {
                    "sent": "So you don't have to define optimist and pessimist.",
                    "label": 0
                },
                {
                    "sent": "You have just trend followers.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In either direction.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the technical thing.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the end, the model reduces to these three equations, so you had two rates on the probability of going from chapters to fundamentals and fundamentals to Chartis, and then the equation also written as a dynamical system.",
                    "label": 0
                },
                {
                    "sent": "So there are a number of further simplification with respect to the Looksmart Casey, but basically this is a dynamical system stochastic dynamical system, relatively simple, and as far as we're going to see that this contains all the physics of the original model and one can go.",
                    "label": 0
                },
                {
                    "sent": "A lot for Arthur.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I looked into asking you questions.",
                    "label": 0
                },
                {
                    "sent": "So the important point is output change opinion.",
                    "label": 0
                },
                {
                    "sent": "This was also recently looked at by Alpha Rana look so we only look how people change opinion from fundamentals to Chartist.",
                    "label": 0
                },
                {
                    "sent": "This is essentially the Kerman model of Ant behavior and what happens is that there are essentially two parameters, But the idea is that if you have you have two stables, two quasi stable states which oscillate, you know you can become from fundamentalist.",
                    "label": 0
                },
                {
                    "sent": "Again go to Chartist.",
                    "label": 0
                },
                {
                    "sent": "Of course, the more people you have in terms of total number, the more difficult will be that they all change their mind.",
                    "label": 0
                },
                {
                    "sent": "So in practice this means that if you have 100 people and to change their mind, the probability that they do is much larger than if you have a million people.",
                    "label": 0
                },
                {
                    "sent": "So this you can see the different equations and this is the key of the finite size problem because what happens is that you can compute here almost analytical or the properties of this model.",
                    "label": 1
                },
                {
                    "sent": "And what happens is that the probability of transition is strongly reduced that once again becomes large.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in practice, if you look at the transitions and we use parameters which resembles the Luke Marchese parameter, so that the interesting thing happens for 500, what happens is that you see 450 you get very strong oscillation and realistic oscillation between fundamentalist and Chartist.",
                    "label": 0
                },
                {
                    "sent": "For 5000 you get over millions of time steps.",
                    "label": 0
                },
                {
                    "sent": "You get only one or simulation.",
                    "label": 0
                },
                {
                    "sent": "One real solution to the Chartists and for 500 you get an interesting intermittent behavior.",
                    "label": 0
                },
                {
                    "sent": "So this study clarifies completely.",
                    "label": 0
                },
                {
                    "sent": "What is the origin of the finite size effect?",
                    "label": 1
                },
                {
                    "sent": "It is a real finite size effect connected with this stochastic dynamics, with the multiplicative dynamics related established by the total number.",
                    "label": 0
                },
                {
                    "sent": "So from here it is clear that this is the type of phenomenon which happens in this class of models, and this is in no way a critical phenomenon, even though it is the interesting thing we like, of course why you can say this also leads to one characteristic length.",
                    "label": 0
                },
                {
                    "sent": "One characteristic length is not realistic because.",
                    "label": 0
                },
                {
                    "sent": "Agents are there with different strategies.",
                    "label": 0
                },
                {
                    "sent": "Of course one could compliment this model with the sum of agents with different strategies, but that would not change the fact that you have a finite size effects at different case, so it wouldn't become a genuine critical exponent, but the superposition of finite size effects.",
                    "label": 0
                },
                {
                    "sent": "So the big question is, are the data really a genuine critical exponent or something like this?",
                    "label": 0
                },
                {
                    "sent": "And certainly this type of models which appear in the eyes of many.",
                    "label": 0
                },
                {
                    "sent": "Author very reasonable.",
                    "label": 0
                },
                {
                    "sent": "These models do not lead to critical behavior in the sense we in statistical physics never trust.",
                    "label": 0
                },
                {
                    "sent": "They lead to something interesting which resembles very much.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Phenomenology of the market.",
                    "label": 0
                },
                {
                    "sent": "Once you somehow control everything about the model, you can make it very, very simple.",
                    "label": 0
                },
                {
                    "sent": "You can make it 1 Agent Stochastic model which is essentially contains all the information of the original model.",
                    "label": 0
                },
                {
                    "sent": "Because now we understand piece by piece.",
                    "label": 0
                },
                {
                    "sent": "So essentially the agent can change his or her mind.",
                    "label": 0
                },
                {
                    "sent": "You know this is the fundamental price.",
                    "label": 0
                },
                {
                    "sent": "So to say.",
                    "label": 0
                },
                {
                    "sent": "Of course it's taken constant.",
                    "label": 0
                },
                {
                    "sent": "You can make a random walk if you want more nicer picture, but this is a conceptual description.",
                    "label": 0
                },
                {
                    "sent": "So one agent can be fundamentalist, then prices.",
                    "label": 1
                },
                {
                    "sent": "Here it can be Chartist price change depending on the direction and it has a certain probability to oscillate.",
                    "label": 0
                },
                {
                    "sent": "So you see a single agent.",
                    "label": 1
                },
                {
                    "sent": "Once you understand everything, you can tune the parameters which are about half, then the original model.",
                    "label": 0
                },
                {
                    "sent": "So that is it.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to reproduce, pretty decent stylized facts.",
                    "label": 0
                },
                {
                    "sent": "Of course, now that you control the model, you can tune the parameter that the same happens with 100 with 200 with one million and a few, so you can perfectly control at which finite number the interesting phenomenology occurs.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that's",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Modeless what you get.",
                    "label": 0
                },
                {
                    "sent": "Now you want to argue that times case is not just one time scale, so this is an example in which the volatility clustering you see the case as quasi power law.",
                    "label": 0
                },
                {
                    "sent": "So if this is straight, this would be a power law.",
                    "label": 0
                },
                {
                    "sent": "Once we consider superposition of agents with different time strategies, this is to show that even though the simplest model would never have an exponential decay, it is very simple to have a superposition as there is there are people who bet on minutes.",
                    "label": 0
                },
                {
                    "sent": "On week sit on Mom's so this is the direction one may want to go to make the mother moralistic.",
                    "label": 0
                },
                {
                    "sent": "But for the moment that we stick to try to understand that they are.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Essential mathematics this you can always do after so one important thing to understand the bubbles and the fluctuations of the price in the Chartis behavior.",
                    "label": 1
                },
                {
                    "sent": "One important thing is what is the action on the market this week later I will also change the number of active people.",
                    "label": 1
                },
                {
                    "sent": "Now they active.",
                    "label": 0
                },
                {
                    "sent": "People can decide depending on the signal they have to invest more or less.",
                    "label": 0
                },
                {
                    "sent": "So this is an intermediate change of volitive.",
                    "label": 0
                },
                {
                    "sent": "Total volume now you see what happens is that when people.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We'll let this be short this yeah.",
                    "label": 0
                },
                {
                    "sent": "So suppose you are an agent and you see a market in the like with the price due to this red or due to this green you have your own strategy, either fundamental research artists and this market looks interesting to you because you get some signal positive, negative, whatever.",
                    "label": 0
                },
                {
                    "sent": "But if you see a market which is more or less flat, you basically don't get much interest.",
                    "label": 0
                },
                {
                    "sent": "Of course there are people who like the flat market, but this certainly they're not this that make the fact days.",
                    "label": 0
                },
                {
                    "sent": "So yeah, we are focusing on the fluctuations of the market, not that some people would like things not to move at all.",
                    "label": 0
                },
                {
                    "sent": "There may be, but if you like, so to say, the action of the market and certainly all the Chartist do it, then what happens is that a market which looks like these two in the above figure attracts you to invest more or later I wish even attracts more people.",
                    "label": 0
                },
                {
                    "sent": "So this increases somehow the action in the market which increase.",
                    "label": 1
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is the price fluctuation and so in this model we reproduce in a macroscopic sense?",
                    "label": 0
                },
                {
                    "sent": "What is the gotcha mechanism?",
                    "label": 0
                },
                {
                    "sent": "Because the garage mechanism is simply a phenomenological relation that the variance at time T + 1 depends on the values of time T and on the price fluctuation.",
                    "label": 0
                },
                {
                    "sent": "Now we exactly understand this relation in terms of the agents, I mean microscopically.",
                    "label": 0
                },
                {
                    "sent": "So basically the model does what the phenomenologically is a gas phenomenon.",
                    "label": 0
                },
                {
                    "sent": "But now we can ask it and why you don't have correlation in the price.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And you don't take your issue in the price is that the change of price with design is it depends on the action, but also many other parameters like the precise structure of Chartist and fundamentalist.",
                    "label": 0
                },
                {
                    "sent": "The what is the moving average, the PF etc.",
                    "label": 0
                },
                {
                    "sent": "And all these elements are incoherent among them, so the variance is only a multiplicative feedback of the action of the market, while the direction of the price depends on these other parameters.",
                    "label": 1
                },
                {
                    "sent": "So one gets a pretty reasonable interpretation.",
                    "label": 0
                },
                {
                    "sent": "I don't claim this is really new, but the model shoot this in a very transparent way and you can even quantify how much things that.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The decorrelated and so on.",
                    "label": 0
                },
                {
                    "sent": "Now if we want to address the question of self organization, we have to make this oscillation business slightly more realistic.",
                    "label": 0
                },
                {
                    "sent": "For the moment Chartist and fundamentalist are perfectly symmetric, so at long time that would be the same time spent in the Chartist state as much in the fundamentalists.",
                    "label": 0
                },
                {
                    "sent": "This would imply that markets are full of bubbles.",
                    "label": 0
                },
                {
                    "sent": "You know every day or every month or so, which is a bit excessive, even though these things appear.",
                    "label": 0
                },
                {
                    "sent": "So the idea is that on the long range fundamentalist dominate the markets and the bubbles are occasional fluctuation.",
                    "label": 0
                },
                {
                    "sent": "This implies that in our model we have to even a symmetric situation in which fundamentalist are a little bit more stable than Chartist.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This you can modify.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I innocent.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Away and you get typical things like this, so the fundamentalist are more stable and location and you get the flex to issue in the Chartist.",
                    "label": 0
                },
                {
                    "sent": "Now what happens?",
                    "label": 0
                },
                {
                    "sent": "Suppose you have you have a situation with fundamentals with a lot of fundamentals.",
                    "label": 0
                },
                {
                    "sent": "They get stabilized among themselves and the price is very flat.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, if they can oscillate so the number of people is less that their solution is more likely you get a final, appreciable probability to go to the Chartist.",
                    "label": 0
                },
                {
                    "sent": "And you get the more interesting market for investors.",
                    "label": 0
                },
                {
                    "sent": "So now we.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Can see that there possibly.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We did that.",
                    "label": 0
                },
                {
                    "sent": "This type of volatility we hear you have very large N, namely 5000.",
                    "label": 0
                },
                {
                    "sent": "Then you have the very small N 50 is the red and here you have the 500.",
                    "label": 0
                },
                {
                    "sent": "This is tuned always so that 500 is the good number.",
                    "label": 0
                },
                {
                    "sent": "You could have used another one and the 500 you see volatility versus time looks.",
                    "label": 0
                },
                {
                    "sent": "Today I very similar to area stock for example.",
                    "label": 0
                },
                {
                    "sent": "So what happens if you are an agent and you see a market like this?",
                    "label": 0
                },
                {
                    "sent": "It doesn't look very much opportunities and maybe you got to another market which looks more interesting.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, so a situation like the green one will decrease the number 5000 to a smaller number, and so on until it gets up.",
                    "label": 0
                },
                {
                    "sent": "Say interesting for investors.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, if the number is very small, you get this huge fast fluctuations which present opportunities of arbitrage, and then this is attracts the market.",
                    "label": 0
                },
                {
                    "sent": "The fluctuations get modified, not necessarily reduced, because you see.",
                    "label": 0
                },
                {
                    "sent": "The peaks of the black are even higher than the average red, and so from above or from below.",
                    "label": 0
                },
                {
                    "sent": "If you put the threshold in the agent section, so people would like some action, and if there is no action, they tend to go out.",
                    "label": 0
                },
                {
                    "sent": "That's the only thing you put you get.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some type.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Self organizing.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ocean of.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This type that if you start with the large number of agents you see they go away because of these thresholds and they converge to the characteristic number.",
                    "label": 1
                },
                {
                    "sent": "And if you start with the small number they go up etc.",
                    "label": 0
                },
                {
                    "sent": "Now this idea together with the interpretation of the Hardy mechanism is a real finite size effects brings this short story of the agent models in a totally different perspective because now what would be because?",
                    "label": 0
                },
                {
                    "sent": "People realized that there was this final 10 and this couldn't be right because clearly markets are completely different number of agents.",
                    "label": 0
                },
                {
                    "sent": "No matter how you define the effective number of agents.",
                    "label": 0
                },
                {
                    "sent": "So the problem is we should try to find the model where you get the critical behavior when N goes to Infinity and then you can say OK all markets have large number of agent and therefore Infinity is good as well, approximated by if I wandered by 5000 by 5 million as we usually reason.",
                    "label": 0
                },
                {
                    "sent": "With the Gaussian stuff, now we I'm offering you another interpretation, namely the question of the finer size together with the self organization separation can be done better than this.",
                    "label": 0
                },
                {
                    "sent": "I mean, the behavior is certainly more complex than just attrition, but as soon as we introduced the strong variability the possibility of variability of the total number.",
                    "label": 0
                },
                {
                    "sent": "This becomes an interesting nonstationarity variable which can.",
                    "label": 1
                },
                {
                    "sent": "Easily adjust the system to the critical situation so the idea would be the following.",
                    "label": 0
                },
                {
                    "sent": "You have characteristic parameters for each market which can be completely different.",
                    "label": 0
                },
                {
                    "sent": "The total capitalization of IBM is very different than some small pizza company, but you know these parameters are completely different.",
                    "label": 0
                },
                {
                    "sent": "The agents adjust to these parameters in such a way that they are in the critical state.",
                    "label": 0
                },
                {
                    "sent": "Because this is the state which is marginally stable for.",
                    "label": 0
                },
                {
                    "sent": "Trading, namely, if it is 2, if it is too flat, it repairs the agents.",
                    "label": 0
                },
                {
                    "sent": "If it is 2 fluctuate ING it attracts the agents because there is arbitrage possibility.",
                    "label": 0
                },
                {
                    "sent": "Now you see this change the fact that you need universality because each market adjusts to a different level.",
                    "label": 0
                },
                {
                    "sent": "Now how much this can be tested in the data is certainly something very important, and for the rest of the few minutes I still we talk.",
                    "label": 0
                },
                {
                    "sent": "I show you why this.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That is, here you are with the number of very spicey.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We get results you see, because for example, now we can ask it what gives what India.",
                    "label": 1
                },
                {
                    "sent": "We can dissect the model as in a surgery table and put it on.",
                    "label": 0
                },
                {
                    "sent": "The chart is only fundamentalist.",
                    "label": 0
                },
                {
                    "sent": "Do some analytical limit and so on.",
                    "label": 0
                },
                {
                    "sent": "So I make some comments which show our flexible is and the in principle one can use it to ask a new question.",
                    "label": 1
                },
                {
                    "sent": "For example, yeah, we're we eliminate the price effect in the transition probability.",
                    "label": 0
                },
                {
                    "sent": "The transition probability as a herding term, and the price term.",
                    "label": 0
                },
                {
                    "sent": "Of course, if you see that the price goes up or so as a Chartist, you are very much influenced.",
                    "label": 0
                },
                {
                    "sent": "Well, you see, if you eliminate the price, things don't change much.",
                    "label": 0
                },
                {
                    "sent": "So the key point to make this stylized facts are is not the price, but is the hardening.",
                    "label": 0
                },
                {
                    "sent": "That's the first thing.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We live in this class of model.",
                    "label": 0
                },
                {
                    "sent": "The dynamics is linear.",
                    "label": 0
                },
                {
                    "sent": "There is no price.",
                    "label": 0
                },
                {
                    "sent": "Of course they would say the fat face are not that fat, but the essential properties of the stylized facts remain only with the herd.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Term.",
                    "label": 0
                },
                {
                    "sent": "OK, then you put the price and theologian easy with respect to time orizon use it a ether agility with respect to time orizon means that you have agents which actor with different time steps and so this decorrelate's the earning effect.",
                    "label": 0
                },
                {
                    "sent": "So in some sense if you want to increase now the volatility clustering you should increase the parameter with respect to the case in which they all do the same thing.",
                    "label": 1
                },
                {
                    "sent": "So there is an effect of the correlation once.",
                    "label": 0
                },
                {
                    "sent": "You adopted.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "French artists with different times, of course.",
                    "label": 0
                },
                {
                    "sent": "The fact they become larger.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then OK, this is the self organization for values, NUM.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But this is not so important, let me.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Show you something OK?",
                    "label": 0
                },
                {
                    "sent": "Well, you see you can study the diffusion properties for the two limiting cases, which is something you cannot do with the standard model and what you have is that if you have only fundamentalists, you get that the variance converge to a finite variance, so you don't really have a random walk.",
                    "label": 1
                },
                {
                    "sent": "Of course you could ever random walk for the fundamental price, but this is another story.",
                    "label": 0
                },
                {
                    "sent": "We use a constant fundamental price.",
                    "label": 0
                },
                {
                    "sent": "Well, if you have only Chartist they.",
                    "label": 0
                },
                {
                    "sent": "Producer is sort of diffusive behavior if you have the mixer case, you get that the diffusion is larger than the fundamental is still on, But this finally somehow anchored to the fundamental price.",
                    "label": 0
                },
                {
                    "sent": "This is in this scheme, of course, if the fundamental price changed, then this also gets.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The random walk.",
                    "label": 0
                },
                {
                    "sent": "Then the idea is how much what you see there in the stylized facts is a superposition of two independent phenomenon.",
                    "label": 1
                },
                {
                    "sent": "Since now we can study what the fundamentals do and what the charges do.",
                    "label": 0
                },
                {
                    "sent": "So the idea is that you cannot argue like this because if you have the superposition are two phenomena that independent phenomena are that these are the fundamentals for auto correct auto covariance and this would be the Chartist.",
                    "label": 0
                },
                {
                    "sent": "But the full model gives this.",
                    "label": 0
                },
                {
                    "sent": "Gives strong autocorrelation, while neither one gives out of a relation, so interesting stuff is the population dynamics is important and you cannot do the incoherent sum of the two population, so these are all things that you learn in a very specific way and which.",
                    "label": 1
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Review of rather specific clue on what is happening.",
                    "label": 0
                },
                {
                    "sent": "You see, this is the probability density function.",
                    "label": 0
                },
                {
                    "sent": "For returns mean what is called the Fat Ace for different times case as you see, you never get to the Gaussian and this we can understand given the previous discussion that you never get to the Gaussian in order to.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "After the ocean you have to include the fact that the PF the fundamental price also as a fluctuation like a random Walker and then the Gaussian you converge is the Gaussian of the fundamental price.",
                    "label": 0
                },
                {
                    "sent": "As I'm out fluctuation.",
                    "label": 0
                },
                {
                    "sent": "So in this respect the model originally doesn't have the convergence introduction, which is something observed but with reasonably natural assumption that the fundamental prices also fluctuation.",
                    "label": 0
                },
                {
                    "sent": "This can be achieved.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A final comment that is up to now.",
                    "label": 0
                },
                {
                    "sent": "I have only discussed the linear dynamics.",
                    "label": 0
                },
                {
                    "sent": "The real dynamics is multiplicative, so is a log dynamics.",
                    "label": 1
                },
                {
                    "sent": "Now the two are considered similar and if you want to get analytical results, the linear is extremely more convenient, but the real one is multiplicative, so we made some tests or what happens if you use a multiplicative dynamic.",
                    "label": 0
                },
                {
                    "sent": "So in general your simulation is less stable because you everything gets multiplicative so.",
                    "label": 0
                },
                {
                    "sent": "Parameters are more delicate, however, and analytical results become essentially impossible.",
                    "label": 1
                },
                {
                    "sent": "Why they are in this version of the model, they are relatively easy in the in the linear dynamics.",
                    "label": 0
                },
                {
                    "sent": "Then there are additional subset difference which are only interested if you really do it.",
                    "label": 0
                },
                {
                    "sent": "So I would not mess.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it here.",
                    "label": 0
                },
                {
                    "sent": "But basically the.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Stage for the multiplicative dynamic.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Except become larger and very much sensitive to parameter.",
                    "label": 1
                },
                {
                    "sent": "So for example, these are the Fed pays for the multiplicative dynamics, with the two slightly different set of parameters.",
                    "label": 1
                },
                {
                    "sent": "Of course we have taken them to amplify the difference, but you see if you change a little bit the parameters for tail can be almost very small with respect to a Gaussian or extremely large.",
                    "label": 0
                },
                {
                    "sent": "This is an interesting question which may actually be realistic phenomenon of markets.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is also out.",
                    "label": 0
                },
                {
                    "sent": "The effects are very much bigger in the logarithmic than in the linear this.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course it is to be expected.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in summary.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's OK.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These are other techniques.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Pointset not.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also, this definition or app is more or less it in a similar way, with the multiplicative dynamics.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I don't mention, so let me summarize.",
                    "label": 0
                },
                {
                    "sent": "So first with respect to the self organization, which is something almost never discussed, that there are two possibilities.",
                    "label": 0
                },
                {
                    "sent": "One, the more I would say traditional vision is this final 10 is a problem.",
                    "label": 0
                },
                {
                    "sent": "One should get rid of and then go to a model in which this doesn't happen.",
                    "label": 0
                },
                {
                    "sent": "It doesn't happen in the sense that the model leads to critical behavior for then that goes to Infinity.",
                    "label": 0
                },
                {
                    "sent": "Up to now this path.",
                    "label": 0
                },
                {
                    "sent": "I don't think has been very successful in models of this type.",
                    "label": 0
                },
                {
                    "sent": "When N goes to Infinity, the interesting phenomenology disappears.",
                    "label": 0
                },
                {
                    "sent": "So what and also self organization with respect to the other parameters of the model is not being discussed the match.",
                    "label": 1
                },
                {
                    "sent": "The present interpretation takes seriously finite size, but together with the self organization there is a sort of self organized intermittency instead of criticality to this.",
                    "label": 0
                },
                {
                    "sent": "The final size fluctuations, so this would solve in a way this parcel of the final ten and also the question of the self organization.",
                    "label": 0
                },
                {
                    "sent": "Of course you can do more sophisticated self organization, but that would be the story if you take this second vision, which is the one which comes straight out of our studies.",
                    "label": 1
                },
                {
                    "sent": "Finite size effects in real this means that you cannot really expect universality and the power laws.",
                    "label": 0
                },
                {
                    "sent": "Are somehow the superposition of different times case, but they are ternative is that you take different times case which are coupled in a very interesting way, but which would be beyond this class of models and they produce a genuine power law in the critical sense.",
                    "label": 0
                },
                {
                    "sent": "But this would be completely beyond this kind of elements that goes away from the looks malkasian similar model through the present type of story.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So OK, the model can be.",
                    "label": 1
                },
                {
                    "sent": "Yeah, they they very important element is earning so it would be interesting to test for herding in data and what we plan to try is given a time series of the price to reconstruct the population of fundamentalist and Chartist by working the model backward.",
                    "label": 0
                },
                {
                    "sent": "This is something which could have an applied interest.",
                    "label": 0
                },
                {
                    "sent": "And then of course one can.",
                    "label": 1
                },
                {
                    "sent": "Make the money more realistic in various directions like these are different times case, but I would be cautious and personally I try to make things more complex.",
                    "label": 0
                },
                {
                    "sent": "One element by one, because if you die if you put all the possible realistic elements together then you end up with a situation like before that it is essentially impossible to get rid of the complexity of the many para.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With this well, I think with this I conclude.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your attention.",
                    "label": 0
                },
                {
                    "sent": "Yes, this is indirectly in the things which I did not show so.",
                    "label": 0
                },
                {
                    "sent": "Indirectly, this relates to the following problem.",
                    "label": 0
                },
                {
                    "sent": "If you take for example auto covariance real data if they got over covariance for the model loose of the price of the price fluctuation or the square or the NTH power you see there is a in order.",
                    "label": 0
                },
                {
                    "sent": "See here for example, that there is an order.",
                    "label": 0
                },
                {
                    "sent": "Can you put the light down so there is an order of the size of photo covariance in which the exponent one is larger than the exponent two?",
                    "label": 0
                },
                {
                    "sent": "So while if you use for example the linear, this is for the logarithmic model for the linear model you have the opposite, so the exponent one is smaller than exponent two.",
                    "label": 0
                },
                {
                    "sent": "This type of things are related to multi.",
                    "label": 0
                },
                {
                    "sent": "To what this called multi fractality, namely the power of the correlations, have a complex behavior, so we didn't try the multifactor spectrum as tradition, but I would say what is called multi fractality is contained in this type of ordering of different powers so but one can do that explicitly in the multifractal language and thank you.",
                    "label": 0
                },
                {
                    "sent": "Probably we should do it.",
                    "label": 0
                },
                {
                    "sent": "So it's something one can certainly look at.",
                    "label": 0
                }
            ]
        }
    }
}