{
    "id": "3op7cvyakwkp4d5exfb3gqxxflehw4u7",
    "title": "Biologically-aware Latent Dirichlet Allocation (BaLDA) for the Classification of Expression Microarray",
    "info": {
        "author": [
            "Manuele Bicego, University of Verona"
        ],
        "published": "Oct. 14, 2010",
        "recorded": "September 2010",
        "category": [
            "Top->Computer Science->Machine Learning->Bayesian Learning->Dirichlet Processes"
        ]
    },
    "url": "http://videolectures.net/prib2010_bicego_blda/",
    "segmentation": [
        [
            "I'm from the University of Verona, which is a joint work we did with the Alessandra Perina pet robot Owen Victoria Marino."
        ],
        [
            "And what I'm going to present here is Amita further classification of microarray expression data.",
            "So this is the summary of my presentation will first introduce very briefly the problem of expression microarray.",
            "Then I will give you some details and background about topic models and how these models can be applied in the macro scenario.",
            "Then we present our proposed approach giving some preliminary results and some."
        ],
        [
            "So very briefly, makarets at technology able to signal simultaneously analyzes thousands of gene and in particular we are working with expression microarrays which measured expression level of the jeans."
        ],
        [
            "And this is the kind of format of data we have and then we have different samples which are analyzed and then related different subjects or different growth condition.",
            "And then we are analyzing the expression level of different genes and what we have at the end.",
            "Is this metrics which is the expression metrics every entry of this metric represents how much gene is expressed in a particular sample."
        ],
        [
            "And we can do many things so with butter recognition tools in this case.",
            "In particular here, what we're doing is a classification of samples and what I'm going to present here is an approach which is based on topic models and."
        ],
        [
            "So to do that, let me first introduce the topic.",
            "Models are and they are probabilistic tools which are widely applied and using the text analysis, sorry.",
            "In the text analysis and computer vision communities, and the idea is that they can model a data set in terms of Eden topics or processes, and these processes are really highly interpretable, which is very nice for them by informatics."
        ],
        [
            "And let me just give you an intuition.",
            "Our topic model work.",
            "So let me do it from the text analysis point of view, because it is very straightforward to understand.",
            "So the idea is that in topic models we are dealing with documents and words and the document is seen as an unordered collection of words.",
            "So document is characterized by a vector of counting which counts the number of words."
        ],
        [
            "And of course, the situation is that a single word can have different meanings depending on the context."
        ],
        [
            "And so this this problem is solved with the topic models saying that words can be disambiguated by looking at the context.",
            "So the idea is that in the topic models we are going to introduce intermediate level intermediate representation which is based on the concept of topic and topic is what we're talking about and the idea is that such topics are extracted by looking at occurrence of words."
        ],
        [
            "Documents.",
            "So summarizing, then we have every document is characterized by the presence of one or more topics, and these topics may induce the president somewhat."
        ],
        [
            "OK, now we can set an analogy between the document.",
            "The linguistic scenario in the microwave scenario, that is that we can observe that a document is characterized by the different presence of the words at the same time as sample is characterized by the different expression level of the genes.",
            "So what we can do, we can set these analogies or word may be considered as a gene and the document may be considered as assembled, and so the count of the world in awarding a document may be single source.",
            "That expression level of a genius."
        ],
        [
            "Using this, we can apply topic models to the microwave scenario, so this is what we can do.",
            "We have the expression level and we can see it as a counting metrics of the topic models.",
            "Of course we should do some preprocessing or this metric in order to have a real account."
        ],
        [
            "Metrics.",
            "The main feature of this topic models is that very interpretable because that topic may be easily associated to a biological process which may be active.",
            "Running some samples and which may involve on expression of only some jeans and actually for this reason these models have been already used in the macro context, in particular for class and had the clustering and very recently watched for a classification."
        ],
        [
            "And the problem of the topic models so far is that each gene expression is in dependently generated giving its corresponding topic.",
            "Which means in some sense that genes are independent which is of course not true in biology and what we are going to do here is propose another topic model which can integrate in the model relations between genes.",
            "So this is the idea and these relations may be extracted from different sources of information."
        ],
        [
            "So this is the name of our approach and let me just give you some intuition.",
            "But the name LDA part is a lot and initial allocation, which is a particular topic model which has been already used in the macro scenario.",
            "And the BA is a biological aware.",
            "So the idea is that we can take into account upload information, possibly biological information.",
            "In the construction of the model."
        ],
        [
            "So which is in the form of the updated information we are using is a subdivision of jeans in groups, so a clustering of genes.",
            "So the idea is that this can be non relationship between genes or this subdivision of jeans in groups.",
            "Maybe also instructed by on the basis of different appeared information like spatial proximity of sequence similar."
        ],
        [
            "So they let me just present the ideas from a mathematical point of view very briefly, so I should introduce the graphical model and notation.",
            "So graphical model is a graph where we have nodes and nodes are the different entities which are involved in the problem and the arts represented probabilistic dependencies.",
            "So we have two kinds of nodes.",
            "In the first added the White one the visible nodes.",
            "So there are nodes we can measure.",
            "We can have a.",
            "And, uh, yeah we can observe in some sense.",
            "So like the expression level of a gene and then there are the hidden nodes which are related to variables which we cannot observe."
        ],
        [
            "OK, so this is a very simplified.",
            "Graphical model of the LDA.",
            "So in this case, in this case we have the topic which is which may be considered as the biological process, and then we have the expression level.",
            "So the expression level depends on the topic of a gene.",
            "The problem is that the.",
            "There is no relation with other Jess, so we cannot take into consideration the relation between geez.",
            "So what we're doing here is starting from this.",
            "We are adding adding a clustering model like this where we have a clustering which is computing on external information about the gene and so we can know to which group gene belong to.",
            "And so now we have this arrow here which which means that the topic so the biological processes influenced by the group the gene belongs to.",
            "So this is the main contribution we did.",
            "Of course, this is a very simplified."
        ],
        [
            "The version which is the final full model where we have parameters and so on, and I'm not going to the details because it's very long, but in the paper you can find everything about different versions of this model parameters, the learning, the inference and also the interpretability.",
            "What you can do is to come at the poster session and ask us directly if you have time."
        ],
        [
            "OK, So what we did was also limited evaluation.",
            "We explain later why it is preliminary and the idea is that we can use.",
            "Can we use this model for classification?",
            "So we should characterize a sample using this model and the idea is that we can characterize every sample with the mixture of topics.",
            "So the level of presence of the different topics in that sample.",
            "And this is a feature vector which is very.",
            "Which can be classified using SVM.",
            "For example, any standard classifiers.",
            "What we did was using SVM and KNN and we employ different camels.",
            "The idea is that more than using the standard linear Canary employee information theoretic canvas, which are kernels that can take into account the probabilistic nature of the signature, then we compute the cross validation classification."
        ],
        [
            "Sis.",
            "And we made two tests, so the 1st on the prostate cancer data set and the second brain tumor data set.",
            "Comparing our model with the LDA standard LDA.",
            "OK, I appreciate information we are using is again this pression level.",
            "So in this sense the results are preliminary because we're not exploiting the full potentiality's of the model.",
            "But we are clustering the special level of a gene over the whole sample.",
            "So in this sense it is preliminary."
        ],
        [
            "Still.",
            "We can have quite good results because here we have the standard LDA with three topics with 12 topics.",
            "And here we have our Model 3 topics and four clusters.",
            "Here we have the results with SVM using the linear camel and the best information theoretic, and there are more results in the paper and here we have the results with the canine and what we can see is that there is a quite nice improvement when using our model and the same is for.",
            "The second data set in this case is the best one is with KNN, but there is not a significant statistical significant improvement."
        ],
        [
            "OK, let me conclude here what we what I tried to present is a novel topic model for the classification of microarray special data and the idea is that this model is able to take to take into account known relations between genes and the preliminary results.",
            "We have found a really promising of course what we're doing now is to really exploit the power of this method by using different upload information like special proximity sequence similarities or others."
        ],
        [
            "OK, that's all.",
            "Thanks for your attention.",
            "Drive to correctly so LDA methods have required required by the complex sampling procedure.",
            "What do you mean with quite complex sampling procedure?",
            "Exactly, yeah, this is the starting.",
            "Yes, that processes.",
            "To get these results but also.",
            "Well, what we're doing here is just.",
            "Sorry."
        ],
        [
            "Yeah, of course.",
            "The problem here is that we have somehow very few samples and huge amount of features, so this problem may occur of course, but first thing the simple thing is just to filter out some jeans.",
            "So by variance for example, this is also what they've done and the second cost consideration is that."
        ],
        [
            "Wait, OK, so this is.",
            "The LDA as a start from accounting metrics.",
            "But here this is the Latin process decomposition which is an extension of LDA which says able to deal directly with micro with continuous signal.",
            "OK, so we don't have the user or the user large problems, they can have in the original version.",
            "So what we're going to do here is to extend this model.",
            "I didn't give this version of the of the model because you know in 10 minutes is very difficult.",
            "Percent everything, but if you're interested, just come to the poster session or.",
            "Do PCA or this features and then run it through this.",
            "Yeah yeah yeah.",
            "So in the paper we have some comparative results and also in this paper.",
            "Opss, sorry.",
            "All the things work better."
        ],
        [
            "Also here we try to use a standard topic models and we made a lot of comparison with for example, just simply PCA on other things.",
            "So the results we obtain are really competitive with respect to this kind of dimensionality reduction techniques.",
            "Of course the problem here is to choose the number of topics which is the.",
            "Dimension of the resulting space, but you can do sister probabilistic models.",
            "You can do cross validate like lewd or standard Model selection.",
            "Like by using information correctly, but.",
            "What?",
            "Yeah, but the main feature of these models is that they are very.",
            "They can provide you an intermediate representation which is very interpretable.",
            "So this is one thing that our partner, our medical patterns like a lot because they can look at the representation.",
            "They can say OK, this is very nice.",
            "So these genes are involved in this process and this topic can be related to the color of the grape for example.",
            "So this is the main reason for using this kind of model.",
            "So what we're trying to do now is to go over the problems.",
            "This model F for modeling the microarray data in order to maintain this interpreter interpret ability.",
            "Next time speaker, thanks."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm from the University of Verona, which is a joint work we did with the Alessandra Perina pet robot Owen Victoria Marino.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And what I'm going to present here is Amita further classification of microarray expression data.",
                    "label": 0
                },
                {
                    "sent": "So this is the summary of my presentation will first introduce very briefly the problem of expression microarray.",
                    "label": 0
                },
                {
                    "sent": "Then I will give you some details and background about topic models and how these models can be applied in the macro scenario.",
                    "label": 0
                },
                {
                    "sent": "Then we present our proposed approach giving some preliminary results and some.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So very briefly, makarets at technology able to signal simultaneously analyzes thousands of gene and in particular we are working with expression microarrays which measured expression level of the jeans.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is the kind of format of data we have and then we have different samples which are analyzed and then related different subjects or different growth condition.",
                    "label": 1
                },
                {
                    "sent": "And then we are analyzing the expression level of different genes and what we have at the end.",
                    "label": 0
                },
                {
                    "sent": "Is this metrics which is the expression metrics every entry of this metric represents how much gene is expressed in a particular sample.",
                    "label": 1
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we can do many things so with butter recognition tools in this case.",
                    "label": 0
                },
                {
                    "sent": "In particular here, what we're doing is a classification of samples and what I'm going to present here is an approach which is based on topic models and.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to do that, let me first introduce the topic.",
                    "label": 0
                },
                {
                    "sent": "Models are and they are probabilistic tools which are widely applied and using the text analysis, sorry.",
                    "label": 0
                },
                {
                    "sent": "In the text analysis and computer vision communities, and the idea is that they can model a data set in terms of Eden topics or processes, and these processes are really highly interpretable, which is very nice for them by informatics.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And let me just give you an intuition.",
                    "label": 0
                },
                {
                    "sent": "Our topic model work.",
                    "label": 0
                },
                {
                    "sent": "So let me do it from the text analysis point of view, because it is very straightforward to understand.",
                    "label": 1
                },
                {
                    "sent": "So the idea is that in topic models we are dealing with documents and words and the document is seen as an unordered collection of words.",
                    "label": 1
                },
                {
                    "sent": "So document is characterized by a vector of counting which counts the number of words.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of course, the situation is that a single word can have different meanings depending on the context.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so this this problem is solved with the topic models saying that words can be disambiguated by looking at the context.",
                    "label": 0
                },
                {
                    "sent": "So the idea is that in the topic models we are going to introduce intermediate level intermediate representation which is based on the concept of topic and topic is what we're talking about and the idea is that such topics are extracted by looking at occurrence of words.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Documents.",
                    "label": 0
                },
                {
                    "sent": "So summarizing, then we have every document is characterized by the presence of one or more topics, and these topics may induce the president somewhat.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, now we can set an analogy between the document.",
                    "label": 1
                },
                {
                    "sent": "The linguistic scenario in the microwave scenario, that is that we can observe that a document is characterized by the different presence of the words at the same time as sample is characterized by the different expression level of the genes.",
                    "label": 1
                },
                {
                    "sent": "So what we can do, we can set these analogies or word may be considered as a gene and the document may be considered as assembled, and so the count of the world in awarding a document may be single source.",
                    "label": 0
                },
                {
                    "sent": "That expression level of a genius.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Using this, we can apply topic models to the microwave scenario, so this is what we can do.",
                    "label": 0
                },
                {
                    "sent": "We have the expression level and we can see it as a counting metrics of the topic models.",
                    "label": 1
                },
                {
                    "sent": "Of course we should do some preprocessing or this metric in order to have a real account.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Metrics.",
                    "label": 0
                },
                {
                    "sent": "The main feature of this topic models is that very interpretable because that topic may be easily associated to a biological process which may be active.",
                    "label": 1
                },
                {
                    "sent": "Running some samples and which may involve on expression of only some jeans and actually for this reason these models have been already used in the macro context, in particular for class and had the clustering and very recently watched for a classification.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the problem of the topic models so far is that each gene expression is in dependently generated giving its corresponding topic.",
                    "label": 1
                },
                {
                    "sent": "Which means in some sense that genes are independent which is of course not true in biology and what we are going to do here is propose another topic model which can integrate in the model relations between genes.",
                    "label": 1
                },
                {
                    "sent": "So this is the idea and these relations may be extracted from different sources of information.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is the name of our approach and let me just give you some intuition.",
                    "label": 0
                },
                {
                    "sent": "But the name LDA part is a lot and initial allocation, which is a particular topic model which has been already used in the macro scenario.",
                    "label": 1
                },
                {
                    "sent": "And the BA is a biological aware.",
                    "label": 0
                },
                {
                    "sent": "So the idea is that we can take into account upload information, possibly biological information.",
                    "label": 1
                },
                {
                    "sent": "In the construction of the model.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So which is in the form of the updated information we are using is a subdivision of jeans in groups, so a clustering of genes.",
                    "label": 1
                },
                {
                    "sent": "So the idea is that this can be non relationship between genes or this subdivision of jeans in groups.",
                    "label": 1
                },
                {
                    "sent": "Maybe also instructed by on the basis of different appeared information like spatial proximity of sequence similar.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So they let me just present the ideas from a mathematical point of view very briefly, so I should introduce the graphical model and notation.",
                    "label": 0
                },
                {
                    "sent": "So graphical model is a graph where we have nodes and nodes are the different entities which are involved in the problem and the arts represented probabilistic dependencies.",
                    "label": 1
                },
                {
                    "sent": "So we have two kinds of nodes.",
                    "label": 0
                },
                {
                    "sent": "In the first added the White one the visible nodes.",
                    "label": 0
                },
                {
                    "sent": "So there are nodes we can measure.",
                    "label": 0
                },
                {
                    "sent": "We can have a.",
                    "label": 0
                },
                {
                    "sent": "And, uh, yeah we can observe in some sense.",
                    "label": 0
                },
                {
                    "sent": "So like the expression level of a gene and then there are the hidden nodes which are related to variables which we cannot observe.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so this is a very simplified.",
                    "label": 0
                },
                {
                    "sent": "Graphical model of the LDA.",
                    "label": 1
                },
                {
                    "sent": "So in this case, in this case we have the topic which is which may be considered as the biological process, and then we have the expression level.",
                    "label": 1
                },
                {
                    "sent": "So the expression level depends on the topic of a gene.",
                    "label": 1
                },
                {
                    "sent": "The problem is that the.",
                    "label": 0
                },
                {
                    "sent": "There is no relation with other Jess, so we cannot take into consideration the relation between geez.",
                    "label": 0
                },
                {
                    "sent": "So what we're doing here is starting from this.",
                    "label": 0
                },
                {
                    "sent": "We are adding adding a clustering model like this where we have a clustering which is computing on external information about the gene and so we can know to which group gene belong to.",
                    "label": 0
                },
                {
                    "sent": "And so now we have this arrow here which which means that the topic so the biological processes influenced by the group the gene belongs to.",
                    "label": 1
                },
                {
                    "sent": "So this is the main contribution we did.",
                    "label": 0
                },
                {
                    "sent": "Of course, this is a very simplified.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The version which is the final full model where we have parameters and so on, and I'm not going to the details because it's very long, but in the paper you can find everything about different versions of this model parameters, the learning, the inference and also the interpretability.",
                    "label": 0
                },
                {
                    "sent": "What you can do is to come at the poster session and ask us directly if you have time.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, So what we did was also limited evaluation.",
                    "label": 0
                },
                {
                    "sent": "We explain later why it is preliminary and the idea is that we can use.",
                    "label": 0
                },
                {
                    "sent": "Can we use this model for classification?",
                    "label": 0
                },
                {
                    "sent": "So we should characterize a sample using this model and the idea is that we can characterize every sample with the mixture of topics.",
                    "label": 1
                },
                {
                    "sent": "So the level of presence of the different topics in that sample.",
                    "label": 0
                },
                {
                    "sent": "And this is a feature vector which is very.",
                    "label": 0
                },
                {
                    "sent": "Which can be classified using SVM.",
                    "label": 0
                },
                {
                    "sent": "For example, any standard classifiers.",
                    "label": 1
                },
                {
                    "sent": "What we did was using SVM and KNN and we employ different camels.",
                    "label": 0
                },
                {
                    "sent": "The idea is that more than using the standard linear Canary employee information theoretic canvas, which are kernels that can take into account the probabilistic nature of the signature, then we compute the cross validation classification.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sis.",
                    "label": 0
                },
                {
                    "sent": "And we made two tests, so the 1st on the prostate cancer data set and the second brain tumor data set.",
                    "label": 1
                },
                {
                    "sent": "Comparing our model with the LDA standard LDA.",
                    "label": 0
                },
                {
                    "sent": "OK, I appreciate information we are using is again this pression level.",
                    "label": 0
                },
                {
                    "sent": "So in this sense the results are preliminary because we're not exploiting the full potentiality's of the model.",
                    "label": 0
                },
                {
                    "sent": "But we are clustering the special level of a gene over the whole sample.",
                    "label": 0
                },
                {
                    "sent": "So in this sense it is preliminary.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Still.",
                    "label": 0
                },
                {
                    "sent": "We can have quite good results because here we have the standard LDA with three topics with 12 topics.",
                    "label": 0
                },
                {
                    "sent": "And here we have our Model 3 topics and four clusters.",
                    "label": 0
                },
                {
                    "sent": "Here we have the results with SVM using the linear camel and the best information theoretic, and there are more results in the paper and here we have the results with the canine and what we can see is that there is a quite nice improvement when using our model and the same is for.",
                    "label": 0
                },
                {
                    "sent": "The second data set in this case is the best one is with KNN, but there is not a significant statistical significant improvement.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, let me conclude here what we what I tried to present is a novel topic model for the classification of microarray special data and the idea is that this model is able to take to take into account known relations between genes and the preliminary results.",
                    "label": 0
                },
                {
                    "sent": "We have found a really promising of course what we're doing now is to really exploit the power of this method by using different upload information like special proximity sequence similarities or others.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, that's all.",
                    "label": 0
                },
                {
                    "sent": "Thanks for your attention.",
                    "label": 0
                },
                {
                    "sent": "Drive to correctly so LDA methods have required required by the complex sampling procedure.",
                    "label": 0
                },
                {
                    "sent": "What do you mean with quite complex sampling procedure?",
                    "label": 0
                },
                {
                    "sent": "Exactly, yeah, this is the starting.",
                    "label": 0
                },
                {
                    "sent": "Yes, that processes.",
                    "label": 0
                },
                {
                    "sent": "To get these results but also.",
                    "label": 0
                },
                {
                    "sent": "Well, what we're doing here is just.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, of course.",
                    "label": 0
                },
                {
                    "sent": "The problem here is that we have somehow very few samples and huge amount of features, so this problem may occur of course, but first thing the simple thing is just to filter out some jeans.",
                    "label": 0
                },
                {
                    "sent": "So by variance for example, this is also what they've done and the second cost consideration is that.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Wait, OK, so this is.",
                    "label": 0
                },
                {
                    "sent": "The LDA as a start from accounting metrics.",
                    "label": 0
                },
                {
                    "sent": "But here this is the Latin process decomposition which is an extension of LDA which says able to deal directly with micro with continuous signal.",
                    "label": 0
                },
                {
                    "sent": "OK, so we don't have the user or the user large problems, they can have in the original version.",
                    "label": 0
                },
                {
                    "sent": "So what we're going to do here is to extend this model.",
                    "label": 0
                },
                {
                    "sent": "I didn't give this version of the of the model because you know in 10 minutes is very difficult.",
                    "label": 0
                },
                {
                    "sent": "Percent everything, but if you're interested, just come to the poster session or.",
                    "label": 1
                },
                {
                    "sent": "Do PCA or this features and then run it through this.",
                    "label": 0
                },
                {
                    "sent": "Yeah yeah yeah.",
                    "label": 1
                },
                {
                    "sent": "So in the paper we have some comparative results and also in this paper.",
                    "label": 0
                },
                {
                    "sent": "Opss, sorry.",
                    "label": 0
                },
                {
                    "sent": "All the things work better.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also here we try to use a standard topic models and we made a lot of comparison with for example, just simply PCA on other things.",
                    "label": 1
                },
                {
                    "sent": "So the results we obtain are really competitive with respect to this kind of dimensionality reduction techniques.",
                    "label": 0
                },
                {
                    "sent": "Of course the problem here is to choose the number of topics which is the.",
                    "label": 0
                },
                {
                    "sent": "Dimension of the resulting space, but you can do sister probabilistic models.",
                    "label": 0
                },
                {
                    "sent": "You can do cross validate like lewd or standard Model selection.",
                    "label": 0
                },
                {
                    "sent": "Like by using information correctly, but.",
                    "label": 0
                },
                {
                    "sent": "What?",
                    "label": 1
                },
                {
                    "sent": "Yeah, but the main feature of these models is that they are very.",
                    "label": 0
                },
                {
                    "sent": "They can provide you an intermediate representation which is very interpretable.",
                    "label": 0
                },
                {
                    "sent": "So this is one thing that our partner, our medical patterns like a lot because they can look at the representation.",
                    "label": 0
                },
                {
                    "sent": "They can say OK, this is very nice.",
                    "label": 0
                },
                {
                    "sent": "So these genes are involved in this process and this topic can be related to the color of the grape for example.",
                    "label": 0
                },
                {
                    "sent": "So this is the main reason for using this kind of model.",
                    "label": 1
                },
                {
                    "sent": "So what we're trying to do now is to go over the problems.",
                    "label": 0
                },
                {
                    "sent": "This model F for modeling the microarray data in order to maintain this interpreter interpret ability.",
                    "label": 0
                },
                {
                    "sent": "Next time speaker, thanks.",
                    "label": 0
                }
            ]
        }
    }
}