{
    "id": "3q6yehgvfu7xjgxopmdebbcp5ox7sxh7",
    "title": "NeuralDynamics - A neuro-dynamic framework for cognitive robotics: Autonomous generation of scene representations and behavioral sequences using online learning",
    "info": {
        "author": [
            "Gregor Schöner, Institut für Neuroinformatik, Ruhr University Bochum"
        ],
        "published": "March 14, 2012",
        "recorded": "February 2012",
        "category": [
            "Top->Science->Scientific Projects",
            "Top->Science->Cognitive Science"
        ]
    },
    "url": "http://videolectures.net/cogsys2012_schoener_neurodynamic/",
    "segmentation": [
        [
            "It's my pleasure to present briefly the Neural Dynamics project.",
            "There's a web page where you can read up on all of that you it's very.",
            "It's really our acronym DOT EU, the long title of the project is a neurodynamic framework for cognitive robotics, autonomous generation of scene representations, and behavioral sequences using online learning.",
            "I'm reading that title because that's really the program statement of our project."
        ],
        [
            "And I give you a brief summary here.",
            "So if you lose me, that's really the take home message.",
            "Our goal is to look at the problems of scene representation, object representation on the one hand, perceptually, and to look at behavioral sequence generation behavioral in on the action side as two core problems of cognitive robotics, and to seek solutions to these problems based on analysis with human cognition and development of some quick mission.",
            "And our basic hypothesis is that a particular language of neural dynamics, in particular through the form of dynamic field theory, that I'll briefly say what that is, provides the Lang and appropriate language to seek such solutions together with principles of learning.",
            "That sort of just the sort of."
        ],
        [
            "The second is summary, So what is seen representation you're all familiar with that.",
            "Of course, if you if you just look at any environment, you immediately grasp what that environment is like, an orienting the environment.",
            "Are this this ease with which we do that can be tested in the laboratory?",
            "For instance in work by Andrew Hollingworth, with whom we collaborate.",
            "He presents people with scenes like these and ask them to pay attention to particular objects.",
            "For instance this.",
            "What is that this tikander I forgot the English term for this.",
            "Rolling pin carlington actually know that word.",
            "And then you look at that for about 10 seconds.",
            "Do that in 50 scenes, 10 objects persin every object, seen ones for 10 seconds, and then ask people a month later if it was in fact this object.",
            "Or for instance, here is a change of object.",
            "Or ask if the pose of the object was changed and people perform in the upper 90% correct?",
            "So so very fast building of long-term memory for seals, strongly contrasting with the under the well known.",
            "Of learning, arbitrary wordless that most classical study of long term memory was lost.",
            "So this just says demonstration that we really do this extremely well."
        ],
        [
            "The other aspect of what we do, of course extremely well is could generate meaningful sequences, goal oriented habit, routine kind of sequences like coffee, cake making coffee or or imitating someone's actually so from one single trial you can learn a new skill in some sense, how to use the new coffee machine at the at the office.",
            "So the goal."
        ],
        [
            "Of this project, the vision would be to have cognitive robots that can do that, that is, can Orient actions as objects generate a goal oriented sequences and interact with users, and do that in a way where they learn from experience when that's all I could think that many of his share our particular."
        ],
        [
            "Emphasis is to say there are these two bottleneck problems that we humans solve so well.",
            "One is this season object representation problem that entailed some of the classical problems of artificial perception, segmentation of the visual array into meaningful patches, visual exploration, keeping track of objects, environments, or keeping building a scene representation.",
            "Learning objects from small numbers of views ideally mean from a single view and then recognizing objects under changed pose or other kind of sensory conditions."
        ],
        [
            "And then sequence generation or generation of meaningful behavior as the second.",
            "Key bottleneck so the ability to autonomously initiate acts not in it step through away, but in time continuous way that's linked to censor information that involves turning motor acts when they have been accomplished again in a way that would be continuously linked to sensory information.",
            "Organized sequences to comply with constraints, inherent logical constraints about the logic of objects.",
            "Instance, open your gripper before your grasp, but also to achieve.",
            "Goals of cause and then to autonomously learn trance as the environment changes."
        ],
        [
            "So our particular emphasis is to do that with.",
            "Methods from the area of Neurodynamics we use in particular dynamical fields.",
            "You see Fields in simulation here.",
            "They are essentially spatially continuous neural networks.",
            "Many of you might know this clip in the classical work on the mathematics of these fields and we believe they capture the possibility to link process is like natural low level sensor information, so not highly pre processed, not symbolic sub symbolic kind of information.",
            "They do that through the continuity of their spatial.",
            "Of their of the dimensions they represent.",
            "What here is on the axis?",
            "Some dimension you want to estimate or act on.",
            "They do that also by building a tractor.",
            "Solutions for the peak, like the Blue one on the bottom right is a is an attractor state and therefore can be linked to low level sensor information.",
            "In our human cognition work we've shown that in fields like that, instabilities in which these peaked or non peak solutions might disappear and or merge into new states can bring about elementary.",
            "Forms of cognition extension decision making perceptual motor working memory and many, many other things.",
            "Categorisation, for instance, learning is natural in this setting.",
            "Although there is a lot of work to be done on actually integrating learning as a process in time and that's part of our objectives and it's also proven in the human condition are meant to be a language in which one can define large architectures that were systems scale and so that's something we want to exploit for system integration.",
            "And because there is a lot of work on human cognition in this language, we believe it facilitates transfer of ideas from human cognition toward cognitive robotics."
        ],
        [
            "Is a weird small project we have more for partners.",
            "I represented the whole University in Germany.",
            "We have lab from Sweden, the cognition interaction, black headed pythons ekers here the vision lab at University of Algarve contributes especially to the perceptual modules Ansible fist ahead of that group and the CIA intelligence Artificial Intelligence Lab contributes and actually two members of that lab under the leadership of yoga switchover are also here at the meeting.",
            "Actually all partners are present at the meeting."
        ],
        [
            "I wanted to show you a few highlights.",
            "It's also a new project with only eleven months be going.",
            "If you highlight that also shows the inner structure of the project.",
            "So our first work packages on dynamic scene representations of the first task is to derive just and we're looking at local just and the Algarve Group and see both has already come up with a. I think that's largely feedforward.",
            "Has some recurrency, and that specializes in finding fast in the fast nearly grounded local.",
            "Just for instance, finding here contour lines that are partially included based on primitives that are programmed into some of these neural layers."
        ],
        [
            "And the second task in that area is to build an autonomous dynamics in representation that something we do here for home, where system that autonomously scans as seen exposes seen in this case actually recognizes this objects.",
            "I'll mention that in the moment, but builds these items into a sort of an attentional field and then built up a working memory of that the items, once they've been recognized, the there's a third dimension that's essentially the label dimension.",
            "It keeps track of these items.",
            "And as we then interact on the scene, there is continuous updating of that representation where you just use this.",
            "The spatial location to then.",
            "Keep associated any feature information, in this case, label information with that new location we have a post about that.",
            "1st of this Steven Signal here at the meeting."
        ],
        [
            "The second related work package deals with dynamic object representations.",
            "The Object recognition system that you just saw in action is actually a novel development consent following his driven ahead on that, it's a system inspired by Alfons dynamic mapping ideas, where we are similar changes.",
            "Lee recognizing an object and also estimating it supposed effect, can stack multiple post parameters.",
            "For instance translation as well as rotation an.",
            "In scale and as a result, these systems will recognize an object in new poses, but also then keep track of changes in poses."
        ],
        [
            "Was shown in that simulation.",
            "A second approach is to look at key point Maps have a moral high dimension feedforward architecture that runs in both strong forward and you already has made good progress on that and actually our ultimate goal will be to fuse these two lines that mention.",
            "Forgot to mention that in representation we've set up already a good collaboration with the Agar for people who have actually participate in our works with London Fields, and we're aiming to fuse.",
            "These two approaches, so they use the high dimensional information in the feedforward path and combine that with these fields that are lower dimensional and that can make decisions."
        ],
        [
            "The third area is organized in sequential behavior.",
            "We're basing our work on initial initial project by doing this and inspires him at the meeting in which we implemented several water in a system like that.",
            "So teaching a system in arbitration order and then being able to play out that circle order under variable timing constraints so that an action is the switch to next action occurs when the previous actions is terminated in that amount of time.",
            "Not very, we are just now starting to combine that with the stuff to group.",
            "I have a little video here, a little yeah video.",
            "If I get that right?",
            "Yeah, it's this one here where Boris during his also here at the meeting has started to build.",
            "I wonder if I don't see the just a second here like this little.",
            "Somewhere sorry.",
            "This only happens here.",
            "Yeah, it's a so this is a first effort to scale this up to have hierarchical sequence generation like that where sub sequences can.",
            "It doesn't run well, it's just a simulation that that is our first step of implementing an expansion of the system tordon hierarchies of different channels of sequences.",
            "Yeah, and the second line that we've started is to look more generally at the organization.",
            "This would be not arbitrary serial order, but rule based sequencing where into the structure of the system, particularly kind of logical factions.",
            "Build.",
            "For instance, a grasp sequence that has some rules about performing or opening a group before reaching, and the particular ideas that do their enemies that as you get some sense information about a probation here there was this provision of shifting.",
            "The object into the reach space of the other arm.",
            "The system will autonomously reorganize based on these rules that are implemented in the dynamics of that system.",
            "And."
        ],
        [
            "The 4th area is a lot of aspects of learning in all these different domains and we've started with our friends from Lugano who are here to look at how some of these things can be learned.",
            "We have a simulation here.",
            "First thing they did, in which they use an natural evolution to train sequence zero order in a setting where they used an insistence to encode the serial order essentially aimed at learning.",
            "What we call the condition of satisfaction.",
            "For some reason this is not scaled correctly and the learning these conditions that enable to switch from one action to the next just as a signal comes in that you're finished.",
            "So when the robot has the objectivity large on its retina, it will recognize that it's done and that can go on to the next sequence is also just beginning.",
            "Answer."
        ],
        [
            "Another aspect that we have started on is to have automatic automatic ways of how to choose the parameters of these architectures.",
            "These architectures that go through instabilities you want to fix the dynamic regime.",
            "Make sure that you're in the Ryder tractor beam at the right moment in time that we can become somewhat complex, so one procedure is to determine the parameters of such systems by defining a fitness function that encodes the dynamic regimes.",
            "For instance, here we had defined different kind of dynamic.",
            "Dreams of selection regime, where one peak would be selected at all times.",
            "A working memory regime where people would just be sustained.",
            "This is an example of a sustained peak that would stay around after input has been removed.",
            "We code that into fitness function and then within a few iterations confined parameter sets that guarantee that when that kind of dynamic vision or goal will be to build that up to be able to autonomously tune larger architectures, organic fields to be correct, dynamic versions.",
            "There are three more learning projects in this area and they will be can be addressed as the first rough draft of these systems that we can then build learning on.",
            "Are designed."
        ],
        [
            "The 5th to work packages.",
            "Read the practical work package of implementing things and driving things we have already made progress on almost on our bottleneck problem of providing a joint software framework.",
            "We've just published a Open Access and library that implements dining fields of you want to venture out into using dynamic fields in the robotic setting is on this website.",
            "There are a source code, a system in which you can graphically assembled enemy compute models and simulate them.",
            "We call that Cedar.",
            "She stands for Cognitive inbody dynamic architectures.",
            "We actually also have a map."
        ],
        [
            "App version of a lot of that, but not of course, is as extensive as fast, and that's what we are using in our outreach activity.",
            "We've had one summer school in last last fall in Portugal in which we teach students were supported by the EU Cognition Network, the number 2 Network the PSS are often one that will start its kickoff meeting tomorrow.",
            "That means we will have a hands-on exercises where people after some lectures are able to build little dining feud, robotic architectures themselves, and on the web page that I'm linking here too.",
            "You will find code if you go under lectures and will find lecture slides, but also exercises codes that in MATLAB that enables you to very quickly try out dynamical field architectures.",
            "An interactive simulation."
        ],
        [
            "So we're only beginning here a few photos of the participants.",
            "I didn't find any photos of our girlfriends, I just showed the beautiful landscape in Algarve.",
            "Had a very old passport photo.",
            "I don't want to show we're just starting.",
            "We have exciting collaborations between the different partners.",
            "Happens.",
            "It's really what we were hoping is happening, so we'll hear more from us.",
            "We will be scaling up.",
            "That's from a recent discussion.",
            "We already were already visiting systems that.",
            "We are way beyond what we had in the past.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's my pleasure to present briefly the Neural Dynamics project.",
                    "label": 0
                },
                {
                    "sent": "There's a web page where you can read up on all of that you it's very.",
                    "label": 0
                },
                {
                    "sent": "It's really our acronym DOT EU, the long title of the project is a neurodynamic framework for cognitive robotics, autonomous generation of scene representations, and behavioral sequences using online learning.",
                    "label": 1
                },
                {
                    "sent": "I'm reading that title because that's really the program statement of our project.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I give you a brief summary here.",
                    "label": 0
                },
                {
                    "sent": "So if you lose me, that's really the take home message.",
                    "label": 0
                },
                {
                    "sent": "Our goal is to look at the problems of scene representation, object representation on the one hand, perceptually, and to look at behavioral sequence generation behavioral in on the action side as two core problems of cognitive robotics, and to seek solutions to these problems based on analysis with human cognition and development of some quick mission.",
                    "label": 1
                },
                {
                    "sent": "And our basic hypothesis is that a particular language of neural dynamics, in particular through the form of dynamic field theory, that I'll briefly say what that is, provides the Lang and appropriate language to seek such solutions together with principles of learning.",
                    "label": 1
                },
                {
                    "sent": "That sort of just the sort of.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The second is summary, So what is seen representation you're all familiar with that.",
                    "label": 0
                },
                {
                    "sent": "Of course, if you if you just look at any environment, you immediately grasp what that environment is like, an orienting the environment.",
                    "label": 0
                },
                {
                    "sent": "Are this this ease with which we do that can be tested in the laboratory?",
                    "label": 0
                },
                {
                    "sent": "For instance in work by Andrew Hollingworth, with whom we collaborate.",
                    "label": 0
                },
                {
                    "sent": "He presents people with scenes like these and ask them to pay attention to particular objects.",
                    "label": 0
                },
                {
                    "sent": "For instance this.",
                    "label": 0
                },
                {
                    "sent": "What is that this tikander I forgot the English term for this.",
                    "label": 0
                },
                {
                    "sent": "Rolling pin carlington actually know that word.",
                    "label": 0
                },
                {
                    "sent": "And then you look at that for about 10 seconds.",
                    "label": 0
                },
                {
                    "sent": "Do that in 50 scenes, 10 objects persin every object, seen ones for 10 seconds, and then ask people a month later if it was in fact this object.",
                    "label": 0
                },
                {
                    "sent": "Or for instance, here is a change of object.",
                    "label": 0
                },
                {
                    "sent": "Or ask if the pose of the object was changed and people perform in the upper 90% correct?",
                    "label": 0
                },
                {
                    "sent": "So so very fast building of long-term memory for seals, strongly contrasting with the under the well known.",
                    "label": 0
                },
                {
                    "sent": "Of learning, arbitrary wordless that most classical study of long term memory was lost.",
                    "label": 0
                },
                {
                    "sent": "So this just says demonstration that we really do this extremely well.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The other aspect of what we do, of course extremely well is could generate meaningful sequences, goal oriented habit, routine kind of sequences like coffee, cake making coffee or or imitating someone's actually so from one single trial you can learn a new skill in some sense, how to use the new coffee machine at the at the office.",
                    "label": 0
                },
                {
                    "sent": "So the goal.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of this project, the vision would be to have cognitive robots that can do that, that is, can Orient actions as objects generate a goal oriented sequences and interact with users, and do that in a way where they learn from experience when that's all I could think that many of his share our particular.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Emphasis is to say there are these two bottleneck problems that we humans solve so well.",
                    "label": 0
                },
                {
                    "sent": "One is this season object representation problem that entailed some of the classical problems of artificial perception, segmentation of the visual array into meaningful patches, visual exploration, keeping track of objects, environments, or keeping building a scene representation.",
                    "label": 1
                },
                {
                    "sent": "Learning objects from small numbers of views ideally mean from a single view and then recognizing objects under changed pose or other kind of sensory conditions.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then sequence generation or generation of meaningful behavior as the second.",
                    "label": 0
                },
                {
                    "sent": "Key bottleneck so the ability to autonomously initiate acts not in it step through away, but in time continuous way that's linked to censor information that involves turning motor acts when they have been accomplished again in a way that would be continuously linked to sensory information.",
                    "label": 1
                },
                {
                    "sent": "Organized sequences to comply with constraints, inherent logical constraints about the logic of objects.",
                    "label": 1
                },
                {
                    "sent": "Instance, open your gripper before your grasp, but also to achieve.",
                    "label": 0
                },
                {
                    "sent": "Goals of cause and then to autonomously learn trance as the environment changes.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So our particular emphasis is to do that with.",
                    "label": 0
                },
                {
                    "sent": "Methods from the area of Neurodynamics we use in particular dynamical fields.",
                    "label": 1
                },
                {
                    "sent": "You see Fields in simulation here.",
                    "label": 0
                },
                {
                    "sent": "They are essentially spatially continuous neural networks.",
                    "label": 0
                },
                {
                    "sent": "Many of you might know this clip in the classical work on the mathematics of these fields and we believe they capture the possibility to link process is like natural low level sensor information, so not highly pre processed, not symbolic sub symbolic kind of information.",
                    "label": 0
                },
                {
                    "sent": "They do that through the continuity of their spatial.",
                    "label": 0
                },
                {
                    "sent": "Of their of the dimensions they represent.",
                    "label": 0
                },
                {
                    "sent": "What here is on the axis?",
                    "label": 0
                },
                {
                    "sent": "Some dimension you want to estimate or act on.",
                    "label": 0
                },
                {
                    "sent": "They do that also by building a tractor.",
                    "label": 0
                },
                {
                    "sent": "Solutions for the peak, like the Blue one on the bottom right is a is an attractor state and therefore can be linked to low level sensor information.",
                    "label": 0
                },
                {
                    "sent": "In our human cognition work we've shown that in fields like that, instabilities in which these peaked or non peak solutions might disappear and or merge into new states can bring about elementary.",
                    "label": 0
                },
                {
                    "sent": "Forms of cognition extension decision making perceptual motor working memory and many, many other things.",
                    "label": 1
                },
                {
                    "sent": "Categorisation, for instance, learning is natural in this setting.",
                    "label": 0
                },
                {
                    "sent": "Although there is a lot of work to be done on actually integrating learning as a process in time and that's part of our objectives and it's also proven in the human condition are meant to be a language in which one can define large architectures that were systems scale and so that's something we want to exploit for system integration.",
                    "label": 1
                },
                {
                    "sent": "And because there is a lot of work on human cognition in this language, we believe it facilitates transfer of ideas from human cognition toward cognitive robotics.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is a weird small project we have more for partners.",
                    "label": 0
                },
                {
                    "sent": "I represented the whole University in Germany.",
                    "label": 0
                },
                {
                    "sent": "We have lab from Sweden, the cognition interaction, black headed pythons ekers here the vision lab at University of Algarve contributes especially to the perceptual modules Ansible fist ahead of that group and the CIA intelligence Artificial Intelligence Lab contributes and actually two members of that lab under the leadership of yoga switchover are also here at the meeting.",
                    "label": 0
                },
                {
                    "sent": "Actually all partners are present at the meeting.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I wanted to show you a few highlights.",
                    "label": 0
                },
                {
                    "sent": "It's also a new project with only eleven months be going.",
                    "label": 0
                },
                {
                    "sent": "If you highlight that also shows the inner structure of the project.",
                    "label": 1
                },
                {
                    "sent": "So our first work packages on dynamic scene representations of the first task is to derive just and we're looking at local just and the Algarve Group and see both has already come up with a. I think that's largely feedforward.",
                    "label": 1
                },
                {
                    "sent": "Has some recurrency, and that specializes in finding fast in the fast nearly grounded local.",
                    "label": 0
                },
                {
                    "sent": "Just for instance, finding here contour lines that are partially included based on primitives that are programmed into some of these neural layers.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the second task in that area is to build an autonomous dynamics in representation that something we do here for home, where system that autonomously scans as seen exposes seen in this case actually recognizes this objects.",
                    "label": 0
                },
                {
                    "sent": "I'll mention that in the moment, but builds these items into a sort of an attentional field and then built up a working memory of that the items, once they've been recognized, the there's a third dimension that's essentially the label dimension.",
                    "label": 0
                },
                {
                    "sent": "It keeps track of these items.",
                    "label": 0
                },
                {
                    "sent": "And as we then interact on the scene, there is continuous updating of that representation where you just use this.",
                    "label": 0
                },
                {
                    "sent": "The spatial location to then.",
                    "label": 0
                },
                {
                    "sent": "Keep associated any feature information, in this case, label information with that new location we have a post about that.",
                    "label": 0
                },
                {
                    "sent": "1st of this Steven Signal here at the meeting.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The second related work package deals with dynamic object representations.",
                    "label": 0
                },
                {
                    "sent": "The Object recognition system that you just saw in action is actually a novel development consent following his driven ahead on that, it's a system inspired by Alfons dynamic mapping ideas, where we are similar changes.",
                    "label": 0
                },
                {
                    "sent": "Lee recognizing an object and also estimating it supposed effect, can stack multiple post parameters.",
                    "label": 0
                },
                {
                    "sent": "For instance translation as well as rotation an.",
                    "label": 0
                },
                {
                    "sent": "In scale and as a result, these systems will recognize an object in new poses, but also then keep track of changes in poses.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Was shown in that simulation.",
                    "label": 0
                },
                {
                    "sent": "A second approach is to look at key point Maps have a moral high dimension feedforward architecture that runs in both strong forward and you already has made good progress on that and actually our ultimate goal will be to fuse these two lines that mention.",
                    "label": 0
                },
                {
                    "sent": "Forgot to mention that in representation we've set up already a good collaboration with the Agar for people who have actually participate in our works with London Fields, and we're aiming to fuse.",
                    "label": 0
                },
                {
                    "sent": "These two approaches, so they use the high dimensional information in the feedforward path and combine that with these fields that are lower dimensional and that can make decisions.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The third area is organized in sequential behavior.",
                    "label": 0
                },
                {
                    "sent": "We're basing our work on initial initial project by doing this and inspires him at the meeting in which we implemented several water in a system like that.",
                    "label": 0
                },
                {
                    "sent": "So teaching a system in arbitration order and then being able to play out that circle order under variable timing constraints so that an action is the switch to next action occurs when the previous actions is terminated in that amount of time.",
                    "label": 0
                },
                {
                    "sent": "Not very, we are just now starting to combine that with the stuff to group.",
                    "label": 0
                },
                {
                    "sent": "I have a little video here, a little yeah video.",
                    "label": 0
                },
                {
                    "sent": "If I get that right?",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's this one here where Boris during his also here at the meeting has started to build.",
                    "label": 0
                },
                {
                    "sent": "I wonder if I don't see the just a second here like this little.",
                    "label": 0
                },
                {
                    "sent": "Somewhere sorry.",
                    "label": 0
                },
                {
                    "sent": "This only happens here.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's a so this is a first effort to scale this up to have hierarchical sequence generation like that where sub sequences can.",
                    "label": 0
                },
                {
                    "sent": "It doesn't run well, it's just a simulation that that is our first step of implementing an expansion of the system tordon hierarchies of different channels of sequences.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and the second line that we've started is to look more generally at the organization.",
                    "label": 0
                },
                {
                    "sent": "This would be not arbitrary serial order, but rule based sequencing where into the structure of the system, particularly kind of logical factions.",
                    "label": 0
                },
                {
                    "sent": "Build.",
                    "label": 0
                },
                {
                    "sent": "For instance, a grasp sequence that has some rules about performing or opening a group before reaching, and the particular ideas that do their enemies that as you get some sense information about a probation here there was this provision of shifting.",
                    "label": 0
                },
                {
                    "sent": "The object into the reach space of the other arm.",
                    "label": 0
                },
                {
                    "sent": "The system will autonomously reorganize based on these rules that are implemented in the dynamics of that system.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The 4th area is a lot of aspects of learning in all these different domains and we've started with our friends from Lugano who are here to look at how some of these things can be learned.",
                    "label": 0
                },
                {
                    "sent": "We have a simulation here.",
                    "label": 0
                },
                {
                    "sent": "First thing they did, in which they use an natural evolution to train sequence zero order in a setting where they used an insistence to encode the serial order essentially aimed at learning.",
                    "label": 0
                },
                {
                    "sent": "What we call the condition of satisfaction.",
                    "label": 1
                },
                {
                    "sent": "For some reason this is not scaled correctly and the learning these conditions that enable to switch from one action to the next just as a signal comes in that you're finished.",
                    "label": 0
                },
                {
                    "sent": "So when the robot has the objectivity large on its retina, it will recognize that it's done and that can go on to the next sequence is also just beginning.",
                    "label": 0
                },
                {
                    "sent": "Answer.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another aspect that we have started on is to have automatic automatic ways of how to choose the parameters of these architectures.",
                    "label": 0
                },
                {
                    "sent": "These architectures that go through instabilities you want to fix the dynamic regime.",
                    "label": 0
                },
                {
                    "sent": "Make sure that you're in the Ryder tractor beam at the right moment in time that we can become somewhat complex, so one procedure is to determine the parameters of such systems by defining a fitness function that encodes the dynamic regimes.",
                    "label": 0
                },
                {
                    "sent": "For instance, here we had defined different kind of dynamic.",
                    "label": 0
                },
                {
                    "sent": "Dreams of selection regime, where one peak would be selected at all times.",
                    "label": 0
                },
                {
                    "sent": "A working memory regime where people would just be sustained.",
                    "label": 0
                },
                {
                    "sent": "This is an example of a sustained peak that would stay around after input has been removed.",
                    "label": 0
                },
                {
                    "sent": "We code that into fitness function and then within a few iterations confined parameter sets that guarantee that when that kind of dynamic vision or goal will be to build that up to be able to autonomously tune larger architectures, organic fields to be correct, dynamic versions.",
                    "label": 0
                },
                {
                    "sent": "There are three more learning projects in this area and they will be can be addressed as the first rough draft of these systems that we can then build learning on.",
                    "label": 0
                },
                {
                    "sent": "Are designed.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The 5th to work packages.",
                    "label": 0
                },
                {
                    "sent": "Read the practical work package of implementing things and driving things we have already made progress on almost on our bottleneck problem of providing a joint software framework.",
                    "label": 0
                },
                {
                    "sent": "We've just published a Open Access and library that implements dining fields of you want to venture out into using dynamic fields in the robotic setting is on this website.",
                    "label": 0
                },
                {
                    "sent": "There are a source code, a system in which you can graphically assembled enemy compute models and simulate them.",
                    "label": 1
                },
                {
                    "sent": "We call that Cedar.",
                    "label": 0
                },
                {
                    "sent": "She stands for Cognitive inbody dynamic architectures.",
                    "label": 1
                },
                {
                    "sent": "We actually also have a map.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "App version of a lot of that, but not of course, is as extensive as fast, and that's what we are using in our outreach activity.",
                    "label": 0
                },
                {
                    "sent": "We've had one summer school in last last fall in Portugal in which we teach students were supported by the EU Cognition Network, the number 2 Network the PSS are often one that will start its kickoff meeting tomorrow.",
                    "label": 1
                },
                {
                    "sent": "That means we will have a hands-on exercises where people after some lectures are able to build little dining feud, robotic architectures themselves, and on the web page that I'm linking here too.",
                    "label": 0
                },
                {
                    "sent": "You will find code if you go under lectures and will find lecture slides, but also exercises codes that in MATLAB that enables you to very quickly try out dynamical field architectures.",
                    "label": 0
                },
                {
                    "sent": "An interactive simulation.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we're only beginning here a few photos of the participants.",
                    "label": 0
                },
                {
                    "sent": "I didn't find any photos of our girlfriends, I just showed the beautiful landscape in Algarve.",
                    "label": 0
                },
                {
                    "sent": "Had a very old passport photo.",
                    "label": 0
                },
                {
                    "sent": "I don't want to show we're just starting.",
                    "label": 0
                },
                {
                    "sent": "We have exciting collaborations between the different partners.",
                    "label": 0
                },
                {
                    "sent": "Happens.",
                    "label": 0
                },
                {
                    "sent": "It's really what we were hoping is happening, so we'll hear more from us.",
                    "label": 0
                },
                {
                    "sent": "We will be scaling up.",
                    "label": 0
                },
                {
                    "sent": "That's from a recent discussion.",
                    "label": 0
                },
                {
                    "sent": "We already were already visiting systems that.",
                    "label": 0
                },
                {
                    "sent": "We are way beyond what we had in the past.",
                    "label": 1
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}