{
    "id": "3r3awy6oc5nw7oh7olknqg5mo7rvfd5v",
    "title": "Supporting Springer Nature Editors by means of Semantic Technologies",
    "info": {
        "author": [
            "Aliaksandr Birukou, Springer International Publishing AG",
            "Francesco Osborne, Knowledge Media Institute (KMI), Open University (OU)"
        ],
        "published": "Nov. 28, 2017",
        "recorded": "November 2017",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2017_osborne_birokou_technologies/",
    "segmentation": [
        [
            "We were going to do this talking too because it's actually nice example of collaboration between researchers so represented by Kimmy who developed semantic technologies and applications of those technologies in real life.",
            "So industry, Springer, nature and."
        ],
        [
            "And we have been collaborating since 2015, and essentially this cooperation focuses are on two tools.",
            "One is a smart topic minor.",
            "It's a solution for automatic classification of proceedings and books, journals and so on.",
            "We're going to talk about this first, and then it's a new tool which is.",
            "Kind of recommendation system for recommending books, journals, and conference proceedings relevant to a conference.",
            "So for the second, like if you exit stalls and turn a little bit left, you will see a Springer book.",
            "Tables there with books and journals.",
            "So now those kind of selection is done manually and we are trying to understand here whether we can help editors to do this kind of selection semi automatically and whether it can be maybe do better than just manually."
        ],
        [
            "So first of all, let's start with classification task.",
            "In a nutshell, you know like probably with you as researchers, paper writing for conference ends.",
            "When you send camera ready.",
            "But then there are also editors who do hard work of putting it all together and finding all guys who didn't submit Copyright formal sources and so on.",
            "And then it comes to Springer where we start production and urine production.",
            "At certain point we get this book and we need to tell what this book is about, why we need to tell it becausw this goes to springerlink like here.",
            "So you see keywords in the bottom.",
            "It also goes to Amazon Google Scholar.",
            "Like all possible library systems you can imagine and you better be good in telling what this book is about because otherwise people might never find it."
        ],
        [
            "So this is the architecture that we set up for stronger natural basically is composed by.",
            "Type out the first time we put on one as the mouth Topic API that taking inputs allowed amount of scholarly meta data describing for example, Springer book.",
            "So we're talking about the title, the keyword, the abstinence on an extract, significant piece of text.",
            "Then it map this text to a very large scale ontology of computer science, extracting a taxonomy of topic.",
            "Then this taxonomy of topic is pulled down so that is.",
            "Human friendly and finally is mapped to Springer nature marketing codes that are codes that are used for identified a project or they they product on digital libraries.",
            "So basically this pipeline supports two different application.",
            "The first is the topic minor that is the application to this user right now.",
            "But the Springer Nature editorial team to categorize Procede in the field of computer science and the second one is this recommended system that takes in input a conference and suggest you.",
            "The relevant Journal articles and and other proceedings.",
            "So the main and knowledge base behind our system is this large ontology of computer."
        ],
        [
            "Science that we call CSO is composed by 15,000 topics that are research topic and 70,000 semantic relationship and it was created automatically by applying an album that is called Clink 2 and that was present at the same conference a couple of years ago.",
            "So if you are interested about the technical aspect, you can check the paper.",
            "The main reason is that human character classification tend to not be very granular and tend to be obsolete very quickly because of course building such a big ontology is a very costly process.",
            "So the advantage of this system is that we can update it again and again by simply purchasing new data."
        ],
        [
            "I want especially to show you these two application so both applications are online now.",
            "Both applications are available in a demo version, so you can actually check them, play with them and give them.",
            "Give us some feedback.",
            "So this is the first applique."
        ],
        [
            "And this is the small topic minor, so an editor such as Springer editors take proceeding at this loading.",
            "Now the preceding the application is distracting the term, mapping them to the ontology, and now we will show us a taxonomy or the most cogent or search topic in.",
            "In this case this is ISWC 2016 and you see that the application is all showing also too as the most important keywords and the most important Springer natural marketing codes.",
            "And the nice thing is that the editor can do.",
            "Beauty over operation on this data, such as you can remove some class that does not consider you know, important enough or you can introduce new class.",
            "In this case is also introducing DB pedia.",
            "Or you can ask why the system in further certain class.",
            "So now is understanding why semantic web is there is because of this distribution of topics in different chapters so is not anymore a magic book but is a system that they really did it or can play with can change the internal taxonomy.",
            "Can understand why the system is suggesting something.",
            "And it can produce also a number of analytics Aleppo to help edit understanding a bit more of the purchase.",
            "The other thing that he can do is changing the granularity of the representation so you saw the the first taxonomy was a very plain and simple taxonomy of semantic web, but if you're an expert in semantic web, maybe you want to know that I SWC is not just about this whole concept of semantic web, but there is for example a good number of paper about natural language processing.",
            "And thanks to this superior granularity we can also zoom on this occurrence."
        ],
        [
            "This is the other system.",
            "Again you can check it.",
            "You can play with it, it's online and you can use it and this system is about from a conference thing, which are the other relevant material.",
            "So we use this same semantic representation to represent the different book or in computer science by Springer Nature.",
            "And then we use this recommender system that for example you see that is saying to us that is that you see an echo are very similar to SWC, so if you are interested in one conference you may also be interested in other conference or related books.",
            "And you can also get feedbacks to the system and cluster together automatically.",
            "Conference from difference here.",
            "And the other thing that you can do is that it can filter out the result or so.",
            "For example, you can change results according to the different here of your interest or in this case we're just zooming on book.",
            "So which are the recent Springer book that are more relevant to the people that is interesting in interested in ideas that you see in this case?",
            "And of course everything is linked to Springer site, so in this case you consider for example we have the book open.",
            "Open data in education.",
            "This is about using semantic web technology for learning and the algorithm also allow you to understand why is suggested as this that this book is relevant ways that you see.",
            "This is the graph about isw.",
            "See this is the graph about open that an education that is basically a sub graph plus some concept in a learning and we can also superimpose the two graphs.",
            "So in this case we are showing in green the power that are the same in where the part about the conference and blew the part about the book.",
            "So with just one glance you can say OK, this is basically."
        ],
        [
            "Now the call Constable semantic web.",
            "That's why it's similar, but it applies it in a different topic.",
            "That is learning education."
        ],
        [
            "OK and of course, like you know, this kind of things are not used by us just because we want to use semantic technologies and so on.",
            "We need to see some business value in those so it helps us to reduce time needed for classify proceedings roughly by 50%.",
            "And it also helps if you are in a hurry and so on to produce 8090% which do the job very quickly.",
            "Without going into details which Francesco showing.",
            "Also you know like previously we had just a couple of people classifying all the 800 conference proceedings per year and you might.",
            "Imagine in for the first like 50.",
            "It might be a very exciting task, but then it gets rather boring.",
            "But now we can distribute the work and involve assistant editors who can get familiar with the tool and use it to classify proceedings know much worse than we do, and the use of controlled vocabulary.",
            "Helps Becausw, then you can rely on certain keywords.",
            "You can even think about some prayer, saved queries and so on.",
            "So far we have applied this in test mode for roughly like 50% of out."
        ],
        [
            "Put in computer science proceedings and from next year if you want to apply it for like close to 100% and this would mean 800 proceedings per year."
        ],
        [
            "We also want to integrate it with our link to open Data portal about conferences.",
            "If you're not familiar with that, we have a demo today at D 22 at 6:30 and we also want to analyze our internal classification because it hasn't been updated for quite some time, so we want to use this tool in order to suggest new topics.",
            "And before Pastor Francesco for the last word, I also want to say that this technology was presented at Holtzbrinck Artificial Intelligence Day earlier this year and also.",
            "We participated in a panel on Frankfurt Book Fair 2 years two weeks ago about artificial intelligence in publishing.",
            "So just a couple of other points of view to work that you may be interested in.",
            "But first of all, we are evaluating this Mac book recommended.",
            "It is a recommender, so we're collecting data for data.",
            "We also would like to allow the scope of our data.",
            "At the moment we are focusing on computer science, but it would be nice to use also other other fields such as digital humanities of life science.",
            "Finally, we want to open up the computer science.",
            "This large scale ontology of computer science.",
            "So we are preparing weekly like Portal to allow the search community not just to download ontology, but also to announce it in different way by using crowdsourcing.",
            "So we update a certain point.",
            "It will become a defacto standard of the community with which regarded the representation of research topic in our field."
        ],
        [
            "Just a final word that we this technology.",
            "They show you very quickly doing this talk.",
            "I can showing you much more relaxed way doing the demo.",
            "So if you're interested come visit Demo 35.",
            "Thank you.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We were going to do this talking too because it's actually nice example of collaboration between researchers so represented by Kimmy who developed semantic technologies and applications of those technologies in real life.",
                    "label": 0
                },
                {
                    "sent": "So industry, Springer, nature and.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we have been collaborating since 2015, and essentially this cooperation focuses are on two tools.",
                    "label": 1
                },
                {
                    "sent": "One is a smart topic minor.",
                    "label": 0
                },
                {
                    "sent": "It's a solution for automatic classification of proceedings and books, journals and so on.",
                    "label": 0
                },
                {
                    "sent": "We're going to talk about this first, and then it's a new tool which is.",
                    "label": 0
                },
                {
                    "sent": "Kind of recommendation system for recommending books, journals, and conference proceedings relevant to a conference.",
                    "label": 0
                },
                {
                    "sent": "So for the second, like if you exit stalls and turn a little bit left, you will see a Springer book.",
                    "label": 0
                },
                {
                    "sent": "Tables there with books and journals.",
                    "label": 0
                },
                {
                    "sent": "So now those kind of selection is done manually and we are trying to understand here whether we can help editors to do this kind of selection semi automatically and whether it can be maybe do better than just manually.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So first of all, let's start with classification task.",
                    "label": 0
                },
                {
                    "sent": "In a nutshell, you know like probably with you as researchers, paper writing for conference ends.",
                    "label": 0
                },
                {
                    "sent": "When you send camera ready.",
                    "label": 0
                },
                {
                    "sent": "But then there are also editors who do hard work of putting it all together and finding all guys who didn't submit Copyright formal sources and so on.",
                    "label": 0
                },
                {
                    "sent": "And then it comes to Springer where we start production and urine production.",
                    "label": 0
                },
                {
                    "sent": "At certain point we get this book and we need to tell what this book is about, why we need to tell it becausw this goes to springerlink like here.",
                    "label": 0
                },
                {
                    "sent": "So you see keywords in the bottom.",
                    "label": 0
                },
                {
                    "sent": "It also goes to Amazon Google Scholar.",
                    "label": 0
                },
                {
                    "sent": "Like all possible library systems you can imagine and you better be good in telling what this book is about because otherwise people might never find it.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is the architecture that we set up for stronger natural basically is composed by.",
                    "label": 0
                },
                {
                    "sent": "Type out the first time we put on one as the mouth Topic API that taking inputs allowed amount of scholarly meta data describing for example, Springer book.",
                    "label": 0
                },
                {
                    "sent": "So we're talking about the title, the keyword, the abstinence on an extract, significant piece of text.",
                    "label": 0
                },
                {
                    "sent": "Then it map this text to a very large scale ontology of computer science, extracting a taxonomy of topic.",
                    "label": 0
                },
                {
                    "sent": "Then this taxonomy of topic is pulled down so that is.",
                    "label": 0
                },
                {
                    "sent": "Human friendly and finally is mapped to Springer nature marketing codes that are codes that are used for identified a project or they they product on digital libraries.",
                    "label": 0
                },
                {
                    "sent": "So basically this pipeline supports two different application.",
                    "label": 0
                },
                {
                    "sent": "The first is the topic minor that is the application to this user right now.",
                    "label": 0
                },
                {
                    "sent": "But the Springer Nature editorial team to categorize Procede in the field of computer science and the second one is this recommended system that takes in input a conference and suggest you.",
                    "label": 0
                },
                {
                    "sent": "The relevant Journal articles and and other proceedings.",
                    "label": 0
                },
                {
                    "sent": "So the main and knowledge base behind our system is this large ontology of computer.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Science that we call CSO is composed by 15,000 topics that are research topic and 70,000 semantic relationship and it was created automatically by applying an album that is called Clink 2 and that was present at the same conference a couple of years ago.",
                    "label": 0
                },
                {
                    "sent": "So if you are interested about the technical aspect, you can check the paper.",
                    "label": 0
                },
                {
                    "sent": "The main reason is that human character classification tend to not be very granular and tend to be obsolete very quickly because of course building such a big ontology is a very costly process.",
                    "label": 0
                },
                {
                    "sent": "So the advantage of this system is that we can update it again and again by simply purchasing new data.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I want especially to show you these two application so both applications are online now.",
                    "label": 0
                },
                {
                    "sent": "Both applications are available in a demo version, so you can actually check them, play with them and give them.",
                    "label": 0
                },
                {
                    "sent": "Give us some feedback.",
                    "label": 0
                },
                {
                    "sent": "So this is the first applique.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is the small topic minor, so an editor such as Springer editors take proceeding at this loading.",
                    "label": 0
                },
                {
                    "sent": "Now the preceding the application is distracting the term, mapping them to the ontology, and now we will show us a taxonomy or the most cogent or search topic in.",
                    "label": 0
                },
                {
                    "sent": "In this case this is ISWC 2016 and you see that the application is all showing also too as the most important keywords and the most important Springer natural marketing codes.",
                    "label": 0
                },
                {
                    "sent": "And the nice thing is that the editor can do.",
                    "label": 0
                },
                {
                    "sent": "Beauty over operation on this data, such as you can remove some class that does not consider you know, important enough or you can introduce new class.",
                    "label": 0
                },
                {
                    "sent": "In this case is also introducing DB pedia.",
                    "label": 0
                },
                {
                    "sent": "Or you can ask why the system in further certain class.",
                    "label": 0
                },
                {
                    "sent": "So now is understanding why semantic web is there is because of this distribution of topics in different chapters so is not anymore a magic book but is a system that they really did it or can play with can change the internal taxonomy.",
                    "label": 0
                },
                {
                    "sent": "Can understand why the system is suggesting something.",
                    "label": 0
                },
                {
                    "sent": "And it can produce also a number of analytics Aleppo to help edit understanding a bit more of the purchase.",
                    "label": 0
                },
                {
                    "sent": "The other thing that he can do is changing the granularity of the representation so you saw the the first taxonomy was a very plain and simple taxonomy of semantic web, but if you're an expert in semantic web, maybe you want to know that I SWC is not just about this whole concept of semantic web, but there is for example a good number of paper about natural language processing.",
                    "label": 0
                },
                {
                    "sent": "And thanks to this superior granularity we can also zoom on this occurrence.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the other system.",
                    "label": 0
                },
                {
                    "sent": "Again you can check it.",
                    "label": 0
                },
                {
                    "sent": "You can play with it, it's online and you can use it and this system is about from a conference thing, which are the other relevant material.",
                    "label": 0
                },
                {
                    "sent": "So we use this same semantic representation to represent the different book or in computer science by Springer Nature.",
                    "label": 0
                },
                {
                    "sent": "And then we use this recommender system that for example you see that is saying to us that is that you see an echo are very similar to SWC, so if you are interested in one conference you may also be interested in other conference or related books.",
                    "label": 0
                },
                {
                    "sent": "And you can also get feedbacks to the system and cluster together automatically.",
                    "label": 0
                },
                {
                    "sent": "Conference from difference here.",
                    "label": 0
                },
                {
                    "sent": "And the other thing that you can do is that it can filter out the result or so.",
                    "label": 0
                },
                {
                    "sent": "For example, you can change results according to the different here of your interest or in this case we're just zooming on book.",
                    "label": 0
                },
                {
                    "sent": "So which are the recent Springer book that are more relevant to the people that is interesting in interested in ideas that you see in this case?",
                    "label": 0
                },
                {
                    "sent": "And of course everything is linked to Springer site, so in this case you consider for example we have the book open.",
                    "label": 0
                },
                {
                    "sent": "Open data in education.",
                    "label": 0
                },
                {
                    "sent": "This is about using semantic web technology for learning and the algorithm also allow you to understand why is suggested as this that this book is relevant ways that you see.",
                    "label": 0
                },
                {
                    "sent": "This is the graph about isw.",
                    "label": 0
                },
                {
                    "sent": "See this is the graph about open that an education that is basically a sub graph plus some concept in a learning and we can also superimpose the two graphs.",
                    "label": 0
                },
                {
                    "sent": "So in this case we are showing in green the power that are the same in where the part about the conference and blew the part about the book.",
                    "label": 0
                },
                {
                    "sent": "So with just one glance you can say OK, this is basically.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now the call Constable semantic web.",
                    "label": 0
                },
                {
                    "sent": "That's why it's similar, but it applies it in a different topic.",
                    "label": 0
                },
                {
                    "sent": "That is learning education.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK and of course, like you know, this kind of things are not used by us just because we want to use semantic technologies and so on.",
                    "label": 0
                },
                {
                    "sent": "We need to see some business value in those so it helps us to reduce time needed for classify proceedings roughly by 50%.",
                    "label": 0
                },
                {
                    "sent": "And it also helps if you are in a hurry and so on to produce 8090% which do the job very quickly.",
                    "label": 0
                },
                {
                    "sent": "Without going into details which Francesco showing.",
                    "label": 0
                },
                {
                    "sent": "Also you know like previously we had just a couple of people classifying all the 800 conference proceedings per year and you might.",
                    "label": 0
                },
                {
                    "sent": "Imagine in for the first like 50.",
                    "label": 0
                },
                {
                    "sent": "It might be a very exciting task, but then it gets rather boring.",
                    "label": 0
                },
                {
                    "sent": "But now we can distribute the work and involve assistant editors who can get familiar with the tool and use it to classify proceedings know much worse than we do, and the use of controlled vocabulary.",
                    "label": 0
                },
                {
                    "sent": "Helps Becausw, then you can rely on certain keywords.",
                    "label": 0
                },
                {
                    "sent": "You can even think about some prayer, saved queries and so on.",
                    "label": 0
                },
                {
                    "sent": "So far we have applied this in test mode for roughly like 50% of out.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Put in computer science proceedings and from next year if you want to apply it for like close to 100% and this would mean 800 proceedings per year.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We also want to integrate it with our link to open Data portal about conferences.",
                    "label": 0
                },
                {
                    "sent": "If you're not familiar with that, we have a demo today at D 22 at 6:30 and we also want to analyze our internal classification because it hasn't been updated for quite some time, so we want to use this tool in order to suggest new topics.",
                    "label": 0
                },
                {
                    "sent": "And before Pastor Francesco for the last word, I also want to say that this technology was presented at Holtzbrinck Artificial Intelligence Day earlier this year and also.",
                    "label": 0
                },
                {
                    "sent": "We participated in a panel on Frankfurt Book Fair 2 years two weeks ago about artificial intelligence in publishing.",
                    "label": 0
                },
                {
                    "sent": "So just a couple of other points of view to work that you may be interested in.",
                    "label": 0
                },
                {
                    "sent": "But first of all, we are evaluating this Mac book recommended.",
                    "label": 0
                },
                {
                    "sent": "It is a recommender, so we're collecting data for data.",
                    "label": 0
                },
                {
                    "sent": "We also would like to allow the scope of our data.",
                    "label": 0
                },
                {
                    "sent": "At the moment we are focusing on computer science, but it would be nice to use also other other fields such as digital humanities of life science.",
                    "label": 0
                },
                {
                    "sent": "Finally, we want to open up the computer science.",
                    "label": 0
                },
                {
                    "sent": "This large scale ontology of computer science.",
                    "label": 0
                },
                {
                    "sent": "So we are preparing weekly like Portal to allow the search community not just to download ontology, but also to announce it in different way by using crowdsourcing.",
                    "label": 0
                },
                {
                    "sent": "So we update a certain point.",
                    "label": 0
                },
                {
                    "sent": "It will become a defacto standard of the community with which regarded the representation of research topic in our field.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just a final word that we this technology.",
                    "label": 0
                },
                {
                    "sent": "They show you very quickly doing this talk.",
                    "label": 0
                },
                {
                    "sent": "I can showing you much more relaxed way doing the demo.",
                    "label": 0
                },
                {
                    "sent": "So if you're interested come visit Demo 35.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}