{
    "id": "3rl4n3w6uf3rsrf4p7lvl6wajxdhpfaq",
    "title": "And What Does Google Say? – Web Search Results under Scrutiny: From Traditional to Web-Based Lexicography",
    "info": {
        "author": [
            "Mojca Šorli, University of Ljubljana"
        ],
        "published": "July 27, 2018",
        "recorded": "July 2018",
        "category": [
            "Top->Humanities->Linguistics->Lexicography",
            "Top->Social Sciences->Society",
            "Top->Computer Science"
        ]
    },
    "url": "http://videolectures.net/euralex2018_sorli_web_search/",
    "segmentation": [
        [
            "I decided to do a rather basic piece of research on.",
            "Hopefully you won't find it too basic.",
            "And explore what the user gets when.",
            "In this case, myself, when typing in a simple word or a phrase into the Google search engine.",
            "When looking for linguistic information."
        ],
        [
            "In and on on English."
        ],
        [
            "So I sort of organize my questions into two sets.",
            "I hope they will make sense by the end of this presentation.",
            "So said one, what do we get when looking for linguistic information on Google?",
            "What does Google predominantly suggest and what kind of resources and linguistic information dominate?",
            "Among the suggested most results, said two.",
            "What models of meeting description are that are adopted by the topmost resources?",
            "And how much emphasis is placed on usage and evaluative meanings, in particular by these resources?",
            "And how does this relate to the type of resource, if if it'll.",
            "So what's the motivation well?"
        ],
        [
            "In essence.",
            "We may be inclined.",
            "It's the fact that we may be inclined to generalize, especially in popular talk about users, search preferences along the lines of.",
            "General users tend to consult Google or the web.",
            "Maybe rather than traditional authority, authoritative resources.",
            "But what does that actually mean?",
            "What are we looking at when consulting Google?",
            "And focusing on lexicographic content, what are the directions that particularly the GNU language resources, either professionally edited or collaborative artmaking in their approach to meaning description?",
            "Especially in terms of the length and complexity of description, usage, valuative function and so on."
        ],
        [
            "So in the first part of my analysis, I examined each first page opposite of Google searches on the selected single words and phrases that you can see on the screen.",
            "The selection was random, was partly random.",
            "I performed 2 manual searches.",
            "Individually.",
            "Within more less month months time.",
            "So I say partly random because of course I wanted to include different parts of speech and also single words as well as phrases.",
            "So the."
        ],
        [
            "This is where I started.",
            "Um?",
            "Another element, the selection was not random with regard to is another element which will become more relevant in the second part of my talk when I addressed pragmatic aspects of meaning and usage in giving information on usage.",
            "So allowing for the fact that search engine of course."
        ],
        [
            "Might have adjusted the results to my user profile.",
            "Um?",
            "No definitive."
        ],
        [
            "Claims of course can be made with regard to some general rankings, ranking of the topmost resources, but this was not even the aim.",
            "Nevertheless, we can.",
            "There is a group of resources that regularly recur in the top, say 15.",
            "This is the.",
            "This is the upper part of the list.",
            "You can see the lower.",
            "Anne.",
            "But here it's more mostly random and more random and mostly, but not necessarily linguistic sites.",
            "So you can see you can see."
        ],
        [
            "Of them here in this chart, of course it's not easiest child to read in detail, but it will give you a general impression on where the weight of of the suggested resources.",
            "Lies."
        ],
        [
            "These are the results for the second search a month later.",
            "So basically the the order is slightly changed.",
            "Some sources have moved down a place or two, some have moved up.",
            "Buy a place or two, but generally the core of the sources.",
            "The suggested links is is the same.",
            "Each search normally returned on average 9 or 10, maybe eight hits.",
            "And I assigned each listing value the lowest listing on the page.",
            "The lowest value in the highest listing.",
            "The highest value but maximum one value each.",
            "So if there were two links, I would just take one into account."
        ],
        [
            "And the chart.",
            "Of course, there are many possibilities for further exploring the relationship between the type of query and the results obtained.",
            "In the course of this study, the suggestions are that nominal searches will generally produce more links to encyclopaedic, of course resources.",
            "Verbal searches will tend to produce a larger variety of resources, but these are just my observations.",
            "They will need would need more detailed.",
            "More subtle analysis, but my intention here was to give a very broad and preliminary.",
            "Presentation of the results for the selected items."
        ],
        [
            "So I will take the normal phrase.",
            "The crux of the matter is an example to start with.",
            "We can see the search yielded 9 results.",
            "9 suggestions on the first page.",
            "Um?"
        ],
        [
            "Namely.",
            "Dictionary.com, thefreedictionary.com, theenglish.stackexchange.com, Macmillan, dictionaryvocabulary.com, idiomsforyou.com, dictionary.cambridge.orgpowerthesaurus.org, and oxforddictionaries.com.",
            "So let's have a look at some of the features of the topmost hits for the."
        ],
        [
            "Crux of the matter.",
            "These range from on the one end.",
            "To the most conversational, so to say.",
            "Sources typical of language forums where people discuss sometimes at length the use of language, such as the English stockexchange.com is an under."
        ],
        [
            "Side I just want to point out an observation by the user which brings in a discussion on evaluative meanings.",
            "For those of you who can't see, perhaps.",
            "The crux of the matter does not hint at or imply anything negative, and the situation you are trying to portray is a positive versus negative tradeoff.",
            "So as an answer to the question of the user, the other user.",
            "Um?",
            "I will come back to this some point later on.",
            "The other end."
        ],
        [
            "Is represented by semi or fully automated entries, so it seems this particular one.",
            "Quite compact, quite a compact definition and no, no other information on usage.",
            "And another one."
        ],
        [
            "Power thesaurus.com, which is a crowdsourced.",
            "Dictionary of synonyms.",
            "So these three sources on the Stock Exchange stackexchange.com.",
            "Idioms for you and power the hours of course are non traditional language resources characterized by.",
            "User generated content automation and crowdsourcing.",
            "Now we can maybe turn to those.",
            "June.",
            "The prohibited professionally edited resources.",
            "Um?",
            "Before I would just like to."
        ],
        [
            "Point out of course, as we know, there are traditionally two basic approaches to meaning description.",
            "You can see a brief summary on the screen, but in practice we see a variety of approaches of course adopted by various resources.",
            "And although pragmatic aspects of meaning are generally easier to describe with in full sentence definition.",
            "We know that these have not been universally adopted.",
            "So at this point I'm going to shift.",
            "Focus to the second of the second set of questions that have to do with meaning, description and particularly description of evaluative meanings and.",
            "Giving information on usage so I will brief briefly characterize the following resource in terms of resources in terms of."
        ],
        [
            "Of that.",
            "So, starting with dictionary.com, which consistently comes up very high on the list.",
            "You can see.",
            "The borrows from.",
            "It takes from insights.",
            "Authoritative sources, in this case.",
            "Anyway, they do have their own dictionary database, but in this case they're using other sources, typically Random House unabridged, dictionary, or the American heritage.",
            "Dictionary similarly."
        ],
        [
            "Thefreedictionary.com the listed entries are drawn from external sources.",
            "I'm.",
            "So both both of these are GNU platforms, but offering basically traditional contents or content from other traditional dictionaries and another."
        ],
        [
            "American based dictionary, but one with a longstanding tradition.",
            "Which they choose to emphasize from since 1828.",
            "Which which lists three distinct meanings for the word crux which was not accessible in the phrasal form.",
            "By the way, the crux of the matter.",
            "And then further down the page examples and many additional.",
            "Of course, Standard Standard dictionary features.",
            "Such as.",
            "Links a number of examples and an editorial note.",
            "Did you know that a podcast, even from April 2011, when the word was the word of the day?",
            "So you can.",
            "Also, it has a link to."
        ],
        [
            "Perhaps more user friendly.",
            "An explanation only lists this one, only lists one meaning.",
            "Indicating also the structure and listing a couple of examples."
        ],
        [
            "But anyway, you can see in the the underlined part.",
            "It elaborates on the circumstances of.",
            "Meaning, and you might.",
            "You might want to remember that for later on.",
            "Um?",
            "So.",
            "The above dictionaries did not actually do much in the way of describing how the this phrase is actually used.",
            "Um?",
            "Particularly with respect to its evaluative aspects, this is something that collaborative resources are often more sensitive, sensitive to, and this perhaps is something to to learn from them.",
            "The Oxford dictionaries."
        ],
        [
            "Entry is quite compact as you see it has one meaning.",
            "It also has a substance which unfortunately you cannot see here.",
            "The good thing is that it provides a whole lot of examples, corpus examples.",
            "And a careful examination of these examples actually shows that.",
            "The phrase is used in this particular case.",
            "The crux of the issue is actually more prominent.",
            "But also the crux of the matter is actually used, typically used.",
            "In Association with some negative circumstances in some negative context."
        ],
        [
            "OK, Collins dictionaries.",
            "As a rule, actually the definition they list the definition from the Kobelt Advanced English Dictionary first.",
            "As we know, COBOL definitions are particularly focused on language use, often with additional contextual information.",
            "Even here, although this is not very evident in this particular case, it adds a little bit at the end which.",
            "Again, add something that other sources do not do not have.",
            "Most importantly, of course, this information is derived is corpus derived sometimes by inference so.",
            "The Co bill definitions are then followed by the more standard Collins English Dictionary definitions, which I will not be showing here.",
            "Um?",
            "Another one that Cambridge."
        ],
        [
            "Dictionary basically follows Co bills in that it integrates the most frequent caller kits into the definition itself.",
            "But it does not make that additional step to try and clarify the circumstances of meaning a little bit more leaves it to the examples to do that."
        ],
        [
            "Macmillan Dictionary has an excellent searching power.",
            "Also finds phrasal searches such as on the verge of a plethora of take, a decision which most other sources actually have problems with.",
            "McMillan, of course, devotes much attention to pragmatic components and evaluative meanings.",
            "However, it seems not at the expense of brevity and conciseness of definitions, and not not in this particular case.",
            "Um?",
            "So.",
            "Generally there hasn't been much information on.",
            "On the actual usage and evaluative meanings, potential evaluative meanings of the phrase.",
            "The crux of the matter."
        ],
        [
            "So I will spend.",
            "A minute or two now on vocabulary.com, which also of course is part of the list list which takes a much braver approach.",
            "Also, much more along the lines of what I have called.",
            "Pragmatically, pragmatically aware lexical and description more so than other websites.",
            "Modern web sites.",
            "It seems to build on and I quote friendly explanations that the user will actually remember.",
            "And clever usage tips.",
            "So it's probably related to the fact that they place a lot of importance on its learning programs.",
            "So it does this by using inven."
        ],
        [
            "Native Description Language, which is typically more conversational in nature and goes, goes beyond what we have been used to seeing in.",
            "Traditional dictionaries in terms of description it not only elaborates on the context of situation, but goes along way too.",
            "Enhancing the memorability of.",
            "The definitions, in fact, you typically proceeds from a specific real life situation to a generalization rather than the other way around.",
            "And um, notably, descriptions are often humorous, and also Interestingly woven into a kind of story kind of narrative.",
            "Which, Needless to say, goes against the traditional guidelines of four definition writing.",
            "So apart from kobylt."
        ],
        [
            "I'm.",
            "Vocabulary.com is the the one that has perhaps pushed the frontiers of.",
            "Of meaning description a little bit further and at this point I would like to to mention or remind us it was of course John Sinclair and his colleagues among string Patrick Hanks, who in the late 1980s pioneered empirical analysis that provided.",
            "The base."
        ],
        [
            "It is for a more user friendly definition and we can see the vocabulary.com actually uses full sentence definition alot.",
            "Very much very much from innocent of the kobylt of those of the Co build, so the definition is usually followed by.",
            "A paragraph on etymology, sometimes an extended explanation.",
            "Containing references to real world experience, no doubt based on statistical.",
            "Analysis So you have the most frequent color cuts.",
            "Mostly integrated into the.",
            "Description itself, and this is then followed by a set of rather standard lexicographic definitions, synonyms, usage examples, and so on.",
            "Just to conclude, I will."
        ],
        [
            "Briefly, briefly focus on the last group, which is collaborative projects.",
            "So of these apart from Wiktionary and Wikipedia Urban Dictionary of course comes up as one of the top most.",
            "I gave zero hits for the crux of the matter, so I'm showing the examples.",
            "The first 2 examples for plethora."
        ],
        [
            "A plethora of here.",
            "Typically collaborative collaborative lexicography includes data on circumstances of meaning, giving greater prominence to the evaluative function of words in social interaction as guided by social convention.",
            "Urban Dictionary is an example of it favouring again, a conversational form of language description.",
            "Of course, we all know we all know the downsides of collaborative projects is also visible here on the screen.",
            "I will not go into that.",
            "Now it can contain unrestrained, intolerant, sometimes even hateful speech.",
            "For lack of time.",
            "I have to.",
            "I will not show examples from dictionary and Wikipedia here.",
            "They were not particularly interesting in terms of what I'm focusing on here."
        ],
        [
            "And I do have to show at least one example from the Longman Dictionary Online, which of course is excellent in.",
            "Providing information on pragmatics.",
            "You can see here it is using a label.",
            "Um?"
        ],
        [
            "And just one more time to go back to the kobylt.",
            "The aim to provide more information on evaluative.",
            "Aspects of language is evident in the kobold definitions as well as in color.",
            "Collaborative projects the likes of Urban Dictionary."
        ],
        [
            "So just to go."
        ],
        [
            "Cluj based on my rankings for the 11 examined units.",
            "It would be possible to group the topmost resources listed by Google roughly into three groups.",
            "Three categories traditional digital of course, dictionaries, language forums and chat rooms and collaborative projects.",
            "Obviously Google in itself is not a linguistic resource an, but we perceive it as."
        ],
        [
            "Such because is now it is now starting point for inquiries and data searches of all forms.",
            "It undeniably has an enormous influence on how we view and search for data, but there is no conclusive data even from Google itself.",
            "I think that confirming that traditional web based of course dictionaries are are actually out.",
            "On the contrary, it's pointed out.",
            "And as we have seen, we will most likely be directed by Google to established works, sometimes with long publishing traditions.",
            "And of course on the other hand to product of collaborative lexicography.",
            "So just maybe to end this this set with a quote by John Sinclair Dictionary as a device through which the user will observe the living language language through the dictionary, the next target of progressive lexicography.",
            "Whether this objective has been achieved, I will leave the I will leave it to you to answer this question for yourselves, and quickly."
        ],
        [
            "Conclusions in relation to the second set.",
            "We at least touched upon aspects of lexicographic description shared by collaborative lexicography and some old and new directions in professional lexicography.",
            "So although most traditional resources insist on brief and concise definitions, there are some that depart from this model to provide more information on pragmatic aspects of language.",
            "We have seen examples of that, so lexicographers can learn a lot about users needs and expectations from alternative approaches to language, language, description, but professionally edited resources still seem to deliver on more counts.",
            "And to maybe conclude from a slightly political note, considering this conference is taking place in Slovenia.",
            "I think that there is ample data and.",
            "This might go against the conclusions of this morning's plenary speaker a little bit.",
            "We've had more than one reports on research into dictionary use at this very conference.",
            "Confirm that dictionaries in the traditional sense is still among the most popular language tools beaten, monolingual or bilingual users situations.",
            "So I believe the development of lexicographic content, not just its digital environment, is well deserving of funding public and private.",
            "It needs to go hand in hand with the development of other segments of language infrastructure."
        ],
        [
            "And I thank you for your patience.",
            "If you don't mind going back to the end of the first set of questions and two asking whether this objective has been achieved.",
            "What have been your conclusions about that?",
            "The only question that I wanted this I wanted really to leave too to others to answer, but in my view this transition.",
            "I mean this would.",
            "This would require the transition from word based to basically takes based dictionaries.",
            "This is how I understand this quote.",
            "By John John Sinclair, and, um, I really don't think.",
            "Also, based on the examples that I showed today, that this has in any way been been achieved.",
            "So I think there's a.",
            "There's plenty of room to develop that aspect of dictionary making, and this I found a lead from vocabulary.com really interesting in that respect that they are really trying to do something differently.",
            "Maybe just the beginning.",
            "Another one more minute.",
            "So.",
            "Since I would just like to make a comment on your comment, which I also thought of and also in relation to Patrick Hanks talk, who began with dictionaries are dead.",
            "Some of you might know that I've been talking about the Post dictionary thing for some time, but my own impression is that dictionaries are more alive than ever before, simply differently.",
            "And actually the use of that.",
            "And this is a nonscientific statement is actually at its peak.",
            "Now, of course we don't know what will happen with that.",
            "Thank you very much for your time."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I decided to do a rather basic piece of research on.",
                    "label": 0
                },
                {
                    "sent": "Hopefully you won't find it too basic.",
                    "label": 0
                },
                {
                    "sent": "And explore what the user gets when.",
                    "label": 0
                },
                {
                    "sent": "In this case, myself, when typing in a simple word or a phrase into the Google search engine.",
                    "label": 0
                },
                {
                    "sent": "When looking for linguistic information.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In and on on English.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I sort of organize my questions into two sets.",
                    "label": 0
                },
                {
                    "sent": "I hope they will make sense by the end of this presentation.",
                    "label": 0
                },
                {
                    "sent": "So said one, what do we get when looking for linguistic information on Google?",
                    "label": 1
                },
                {
                    "sent": "What does Google predominantly suggest and what kind of resources and linguistic information dominate?",
                    "label": 1
                },
                {
                    "sent": "Among the suggested most results, said two.",
                    "label": 1
                },
                {
                    "sent": "What models of meeting description are that are adopted by the topmost resources?",
                    "label": 0
                },
                {
                    "sent": "And how much emphasis is placed on usage and evaluative meanings, in particular by these resources?",
                    "label": 1
                },
                {
                    "sent": "And how does this relate to the type of resource, if if it'll.",
                    "label": 0
                },
                {
                    "sent": "So what's the motivation well?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In essence.",
                    "label": 0
                },
                {
                    "sent": "We may be inclined.",
                    "label": 0
                },
                {
                    "sent": "It's the fact that we may be inclined to generalize, especially in popular talk about users, search preferences along the lines of.",
                    "label": 0
                },
                {
                    "sent": "General users tend to consult Google or the web.",
                    "label": 0
                },
                {
                    "sent": "Maybe rather than traditional authority, authoritative resources.",
                    "label": 0
                },
                {
                    "sent": "But what does that actually mean?",
                    "label": 0
                },
                {
                    "sent": "What are we looking at when consulting Google?",
                    "label": 1
                },
                {
                    "sent": "And focusing on lexicographic content, what are the directions that particularly the GNU language resources, either professionally edited or collaborative artmaking in their approach to meaning description?",
                    "label": 1
                },
                {
                    "sent": "Especially in terms of the length and complexity of description, usage, valuative function and so on.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in the first part of my analysis, I examined each first page opposite of Google searches on the selected single words and phrases that you can see on the screen.",
                    "label": 1
                },
                {
                    "sent": "The selection was random, was partly random.",
                    "label": 0
                },
                {
                    "sent": "I performed 2 manual searches.",
                    "label": 0
                },
                {
                    "sent": "Individually.",
                    "label": 0
                },
                {
                    "sent": "Within more less month months time.",
                    "label": 0
                },
                {
                    "sent": "So I say partly random because of course I wanted to include different parts of speech and also single words as well as phrases.",
                    "label": 1
                },
                {
                    "sent": "So the.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is where I started.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Another element, the selection was not random with regard to is another element which will become more relevant in the second part of my talk when I addressed pragmatic aspects of meaning and usage in giving information on usage.",
                    "label": 0
                },
                {
                    "sent": "So allowing for the fact that search engine of course.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Might have adjusted the results to my user profile.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "No definitive.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Claims of course can be made with regard to some general rankings, ranking of the topmost resources, but this was not even the aim.",
                    "label": 0
                },
                {
                    "sent": "Nevertheless, we can.",
                    "label": 0
                },
                {
                    "sent": "There is a group of resources that regularly recur in the top, say 15.",
                    "label": 0
                },
                {
                    "sent": "This is the.",
                    "label": 0
                },
                {
                    "sent": "This is the upper part of the list.",
                    "label": 0
                },
                {
                    "sent": "You can see the lower.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "But here it's more mostly random and more random and mostly, but not necessarily linguistic sites.",
                    "label": 0
                },
                {
                    "sent": "So you can see you can see.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of them here in this chart, of course it's not easiest child to read in detail, but it will give you a general impression on where the weight of of the suggested resources.",
                    "label": 0
                },
                {
                    "sent": "Lies.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These are the results for the second search a month later.",
                    "label": 0
                },
                {
                    "sent": "So basically the the order is slightly changed.",
                    "label": 0
                },
                {
                    "sent": "Some sources have moved down a place or two, some have moved up.",
                    "label": 0
                },
                {
                    "sent": "Buy a place or two, but generally the core of the sources.",
                    "label": 0
                },
                {
                    "sent": "The suggested links is is the same.",
                    "label": 0
                },
                {
                    "sent": "Each search normally returned on average 9 or 10, maybe eight hits.",
                    "label": 0
                },
                {
                    "sent": "And I assigned each listing value the lowest listing on the page.",
                    "label": 0
                },
                {
                    "sent": "The lowest value in the highest listing.",
                    "label": 0
                },
                {
                    "sent": "The highest value but maximum one value each.",
                    "label": 0
                },
                {
                    "sent": "So if there were two links, I would just take one into account.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the chart.",
                    "label": 0
                },
                {
                    "sent": "Of course, there are many possibilities for further exploring the relationship between the type of query and the results obtained.",
                    "label": 0
                },
                {
                    "sent": "In the course of this study, the suggestions are that nominal searches will generally produce more links to encyclopaedic, of course resources.",
                    "label": 0
                },
                {
                    "sent": "Verbal searches will tend to produce a larger variety of resources, but these are just my observations.",
                    "label": 0
                },
                {
                    "sent": "They will need would need more detailed.",
                    "label": 0
                },
                {
                    "sent": "More subtle analysis, but my intention here was to give a very broad and preliminary.",
                    "label": 0
                },
                {
                    "sent": "Presentation of the results for the selected items.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I will take the normal phrase.",
                    "label": 0
                },
                {
                    "sent": "The crux of the matter is an example to start with.",
                    "label": 1
                },
                {
                    "sent": "We can see the search yielded 9 results.",
                    "label": 0
                },
                {
                    "sent": "9 suggestions on the first page.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Namely.",
                    "label": 0
                },
                {
                    "sent": "Dictionary.com, thefreedictionary.com, theenglish.stackexchange.com, Macmillan, dictionaryvocabulary.com, idiomsforyou.com, dictionary.cambridge.orgpowerthesaurus.org, and oxforddictionaries.com.",
                    "label": 0
                },
                {
                    "sent": "So let's have a look at some of the features of the topmost hits for the.",
                    "label": 1
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Crux of the matter.",
                    "label": 0
                },
                {
                    "sent": "These range from on the one end.",
                    "label": 0
                },
                {
                    "sent": "To the most conversational, so to say.",
                    "label": 0
                },
                {
                    "sent": "Sources typical of language forums where people discuss sometimes at length the use of language, such as the English stockexchange.com is an under.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Side I just want to point out an observation by the user which brings in a discussion on evaluative meanings.",
                    "label": 0
                },
                {
                    "sent": "For those of you who can't see, perhaps.",
                    "label": 0
                },
                {
                    "sent": "The crux of the matter does not hint at or imply anything negative, and the situation you are trying to portray is a positive versus negative tradeoff.",
                    "label": 0
                },
                {
                    "sent": "So as an answer to the question of the user, the other user.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "I will come back to this some point later on.",
                    "label": 0
                },
                {
                    "sent": "The other end.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is represented by semi or fully automated entries, so it seems this particular one.",
                    "label": 0
                },
                {
                    "sent": "Quite compact, quite a compact definition and no, no other information on usage.",
                    "label": 0
                },
                {
                    "sent": "And another one.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Power thesaurus.com, which is a crowdsourced.",
                    "label": 0
                },
                {
                    "sent": "Dictionary of synonyms.",
                    "label": 0
                },
                {
                    "sent": "So these three sources on the Stock Exchange stackexchange.com.",
                    "label": 0
                },
                {
                    "sent": "Idioms for you and power the hours of course are non traditional language resources characterized by.",
                    "label": 0
                },
                {
                    "sent": "User generated content automation and crowdsourcing.",
                    "label": 0
                },
                {
                    "sent": "Now we can maybe turn to those.",
                    "label": 0
                },
                {
                    "sent": "June.",
                    "label": 0
                },
                {
                    "sent": "The prohibited professionally edited resources.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Before I would just like to.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Point out of course, as we know, there are traditionally two basic approaches to meaning description.",
                    "label": 1
                },
                {
                    "sent": "You can see a brief summary on the screen, but in practice we see a variety of approaches of course adopted by various resources.",
                    "label": 0
                },
                {
                    "sent": "And although pragmatic aspects of meaning are generally easier to describe with in full sentence definition.",
                    "label": 0
                },
                {
                    "sent": "We know that these have not been universally adopted.",
                    "label": 0
                },
                {
                    "sent": "So at this point I'm going to shift.",
                    "label": 0
                },
                {
                    "sent": "Focus to the second of the second set of questions that have to do with meaning, description and particularly description of evaluative meanings and.",
                    "label": 0
                },
                {
                    "sent": "Giving information on usage so I will brief briefly characterize the following resource in terms of resources in terms of.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of that.",
                    "label": 0
                },
                {
                    "sent": "So, starting with dictionary.com, which consistently comes up very high on the list.",
                    "label": 0
                },
                {
                    "sent": "You can see.",
                    "label": 0
                },
                {
                    "sent": "The borrows from.",
                    "label": 0
                },
                {
                    "sent": "It takes from insights.",
                    "label": 0
                },
                {
                    "sent": "Authoritative sources, in this case.",
                    "label": 0
                },
                {
                    "sent": "Anyway, they do have their own dictionary database, but in this case they're using other sources, typically Random House unabridged, dictionary, or the American heritage.",
                    "label": 0
                },
                {
                    "sent": "Dictionary similarly.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thefreedictionary.com the listed entries are drawn from external sources.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "So both both of these are GNU platforms, but offering basically traditional contents or content from other traditional dictionaries and another.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "American based dictionary, but one with a longstanding tradition.",
                    "label": 0
                },
                {
                    "sent": "Which they choose to emphasize from since 1828.",
                    "label": 0
                },
                {
                    "sent": "Which which lists three distinct meanings for the word crux which was not accessible in the phrasal form.",
                    "label": 0
                },
                {
                    "sent": "By the way, the crux of the matter.",
                    "label": 0
                },
                {
                    "sent": "And then further down the page examples and many additional.",
                    "label": 0
                },
                {
                    "sent": "Of course, Standard Standard dictionary features.",
                    "label": 0
                },
                {
                    "sent": "Such as.",
                    "label": 0
                },
                {
                    "sent": "Links a number of examples and an editorial note.",
                    "label": 0
                },
                {
                    "sent": "Did you know that a podcast, even from April 2011, when the word was the word of the day?",
                    "label": 0
                },
                {
                    "sent": "So you can.",
                    "label": 0
                },
                {
                    "sent": "Also, it has a link to.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Perhaps more user friendly.",
                    "label": 0
                },
                {
                    "sent": "An explanation only lists this one, only lists one meaning.",
                    "label": 0
                },
                {
                    "sent": "Indicating also the structure and listing a couple of examples.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But anyway, you can see in the the underlined part.",
                    "label": 0
                },
                {
                    "sent": "It elaborates on the circumstances of.",
                    "label": 0
                },
                {
                    "sent": "Meaning, and you might.",
                    "label": 0
                },
                {
                    "sent": "You might want to remember that for later on.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The above dictionaries did not actually do much in the way of describing how the this phrase is actually used.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Particularly with respect to its evaluative aspects, this is something that collaborative resources are often more sensitive, sensitive to, and this perhaps is something to to learn from them.",
                    "label": 0
                },
                {
                    "sent": "The Oxford dictionaries.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Entry is quite compact as you see it has one meaning.",
                    "label": 0
                },
                {
                    "sent": "It also has a substance which unfortunately you cannot see here.",
                    "label": 0
                },
                {
                    "sent": "The good thing is that it provides a whole lot of examples, corpus examples.",
                    "label": 0
                },
                {
                    "sent": "And a careful examination of these examples actually shows that.",
                    "label": 0
                },
                {
                    "sent": "The phrase is used in this particular case.",
                    "label": 0
                },
                {
                    "sent": "The crux of the issue is actually more prominent.",
                    "label": 0
                },
                {
                    "sent": "But also the crux of the matter is actually used, typically used.",
                    "label": 0
                },
                {
                    "sent": "In Association with some negative circumstances in some negative context.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, Collins dictionaries.",
                    "label": 0
                },
                {
                    "sent": "As a rule, actually the definition they list the definition from the Kobelt Advanced English Dictionary first.",
                    "label": 0
                },
                {
                    "sent": "As we know, COBOL definitions are particularly focused on language use, often with additional contextual information.",
                    "label": 0
                },
                {
                    "sent": "Even here, although this is not very evident in this particular case, it adds a little bit at the end which.",
                    "label": 0
                },
                {
                    "sent": "Again, add something that other sources do not do not have.",
                    "label": 0
                },
                {
                    "sent": "Most importantly, of course, this information is derived is corpus derived sometimes by inference so.",
                    "label": 0
                },
                {
                    "sent": "The Co bill definitions are then followed by the more standard Collins English Dictionary definitions, which I will not be showing here.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Another one that Cambridge.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Dictionary basically follows Co bills in that it integrates the most frequent caller kits into the definition itself.",
                    "label": 0
                },
                {
                    "sent": "But it does not make that additional step to try and clarify the circumstances of meaning a little bit more leaves it to the examples to do that.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Macmillan Dictionary has an excellent searching power.",
                    "label": 0
                },
                {
                    "sent": "Also finds phrasal searches such as on the verge of a plethora of take, a decision which most other sources actually have problems with.",
                    "label": 0
                },
                {
                    "sent": "McMillan, of course, devotes much attention to pragmatic components and evaluative meanings.",
                    "label": 0
                },
                {
                    "sent": "However, it seems not at the expense of brevity and conciseness of definitions, and not not in this particular case.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Generally there hasn't been much information on.",
                    "label": 0
                },
                {
                    "sent": "On the actual usage and evaluative meanings, potential evaluative meanings of the phrase.",
                    "label": 0
                },
                {
                    "sent": "The crux of the matter.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I will spend.",
                    "label": 0
                },
                {
                    "sent": "A minute or two now on vocabulary.com, which also of course is part of the list list which takes a much braver approach.",
                    "label": 0
                },
                {
                    "sent": "Also, much more along the lines of what I have called.",
                    "label": 0
                },
                {
                    "sent": "Pragmatically, pragmatically aware lexical and description more so than other websites.",
                    "label": 0
                },
                {
                    "sent": "Modern web sites.",
                    "label": 0
                },
                {
                    "sent": "It seems to build on and I quote friendly explanations that the user will actually remember.",
                    "label": 0
                },
                {
                    "sent": "And clever usage tips.",
                    "label": 0
                },
                {
                    "sent": "So it's probably related to the fact that they place a lot of importance on its learning programs.",
                    "label": 0
                },
                {
                    "sent": "So it does this by using inven.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Native Description Language, which is typically more conversational in nature and goes, goes beyond what we have been used to seeing in.",
                    "label": 0
                },
                {
                    "sent": "Traditional dictionaries in terms of description it not only elaborates on the context of situation, but goes along way too.",
                    "label": 0
                },
                {
                    "sent": "Enhancing the memorability of.",
                    "label": 0
                },
                {
                    "sent": "The definitions, in fact, you typically proceeds from a specific real life situation to a generalization rather than the other way around.",
                    "label": 0
                },
                {
                    "sent": "And um, notably, descriptions are often humorous, and also Interestingly woven into a kind of story kind of narrative.",
                    "label": 0
                },
                {
                    "sent": "Which, Needless to say, goes against the traditional guidelines of four definition writing.",
                    "label": 0
                },
                {
                    "sent": "So apart from kobylt.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "Vocabulary.com is the the one that has perhaps pushed the frontiers of.",
                    "label": 0
                },
                {
                    "sent": "Of meaning description a little bit further and at this point I would like to to mention or remind us it was of course John Sinclair and his colleagues among string Patrick Hanks, who in the late 1980s pioneered empirical analysis that provided.",
                    "label": 0
                },
                {
                    "sent": "The base.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is for a more user friendly definition and we can see the vocabulary.com actually uses full sentence definition alot.",
                    "label": 0
                },
                {
                    "sent": "Very much very much from innocent of the kobylt of those of the Co build, so the definition is usually followed by.",
                    "label": 0
                },
                {
                    "sent": "A paragraph on etymology, sometimes an extended explanation.",
                    "label": 0
                },
                {
                    "sent": "Containing references to real world experience, no doubt based on statistical.",
                    "label": 0
                },
                {
                    "sent": "Analysis So you have the most frequent color cuts.",
                    "label": 0
                },
                {
                    "sent": "Mostly integrated into the.",
                    "label": 0
                },
                {
                    "sent": "Description itself, and this is then followed by a set of rather standard lexicographic definitions, synonyms, usage examples, and so on.",
                    "label": 0
                },
                {
                    "sent": "Just to conclude, I will.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Briefly, briefly focus on the last group, which is collaborative projects.",
                    "label": 0
                },
                {
                    "sent": "So of these apart from Wiktionary and Wikipedia Urban Dictionary of course comes up as one of the top most.",
                    "label": 0
                },
                {
                    "sent": "I gave zero hits for the crux of the matter, so I'm showing the examples.",
                    "label": 0
                },
                {
                    "sent": "The first 2 examples for plethora.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A plethora of here.",
                    "label": 0
                },
                {
                    "sent": "Typically collaborative collaborative lexicography includes data on circumstances of meaning, giving greater prominence to the evaluative function of words in social interaction as guided by social convention.",
                    "label": 0
                },
                {
                    "sent": "Urban Dictionary is an example of it favouring again, a conversational form of language description.",
                    "label": 0
                },
                {
                    "sent": "Of course, we all know we all know the downsides of collaborative projects is also visible here on the screen.",
                    "label": 0
                },
                {
                    "sent": "I will not go into that.",
                    "label": 0
                },
                {
                    "sent": "Now it can contain unrestrained, intolerant, sometimes even hateful speech.",
                    "label": 0
                },
                {
                    "sent": "For lack of time.",
                    "label": 0
                },
                {
                    "sent": "I have to.",
                    "label": 0
                },
                {
                    "sent": "I will not show examples from dictionary and Wikipedia here.",
                    "label": 0
                },
                {
                    "sent": "They were not particularly interesting in terms of what I'm focusing on here.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I do have to show at least one example from the Longman Dictionary Online, which of course is excellent in.",
                    "label": 0
                },
                {
                    "sent": "Providing information on pragmatics.",
                    "label": 0
                },
                {
                    "sent": "You can see here it is using a label.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And just one more time to go back to the kobylt.",
                    "label": 0
                },
                {
                    "sent": "The aim to provide more information on evaluative.",
                    "label": 0
                },
                {
                    "sent": "Aspects of language is evident in the kobold definitions as well as in color.",
                    "label": 0
                },
                {
                    "sent": "Collaborative projects the likes of Urban Dictionary.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So just to go.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Cluj based on my rankings for the 11 examined units.",
                    "label": 0
                },
                {
                    "sent": "It would be possible to group the topmost resources listed by Google roughly into three groups.",
                    "label": 1
                },
                {
                    "sent": "Three categories traditional digital of course, dictionaries, language forums and chat rooms and collaborative projects.",
                    "label": 0
                },
                {
                    "sent": "Obviously Google in itself is not a linguistic resource an, but we perceive it as.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Such because is now it is now starting point for inquiries and data searches of all forms.",
                    "label": 0
                },
                {
                    "sent": "It undeniably has an enormous influence on how we view and search for data, but there is no conclusive data even from Google itself.",
                    "label": 0
                },
                {
                    "sent": "I think that confirming that traditional web based of course dictionaries are are actually out.",
                    "label": 0
                },
                {
                    "sent": "On the contrary, it's pointed out.",
                    "label": 0
                },
                {
                    "sent": "And as we have seen, we will most likely be directed by Google to established works, sometimes with long publishing traditions.",
                    "label": 0
                },
                {
                    "sent": "And of course on the other hand to product of collaborative lexicography.",
                    "label": 0
                },
                {
                    "sent": "So just maybe to end this this set with a quote by John Sinclair Dictionary as a device through which the user will observe the living language language through the dictionary, the next target of progressive lexicography.",
                    "label": 0
                },
                {
                    "sent": "Whether this objective has been achieved, I will leave the I will leave it to you to answer this question for yourselves, and quickly.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Conclusions in relation to the second set.",
                    "label": 0
                },
                {
                    "sent": "We at least touched upon aspects of lexicographic description shared by collaborative lexicography and some old and new directions in professional lexicography.",
                    "label": 0
                },
                {
                    "sent": "So although most traditional resources insist on brief and concise definitions, there are some that depart from this model to provide more information on pragmatic aspects of language.",
                    "label": 1
                },
                {
                    "sent": "We have seen examples of that, so lexicographers can learn a lot about users needs and expectations from alternative approaches to language, language, description, but professionally edited resources still seem to deliver on more counts.",
                    "label": 0
                },
                {
                    "sent": "And to maybe conclude from a slightly political note, considering this conference is taking place in Slovenia.",
                    "label": 0
                },
                {
                    "sent": "I think that there is ample data and.",
                    "label": 0
                },
                {
                    "sent": "This might go against the conclusions of this morning's plenary speaker a little bit.",
                    "label": 1
                },
                {
                    "sent": "We've had more than one reports on research into dictionary use at this very conference.",
                    "label": 0
                },
                {
                    "sent": "Confirm that dictionaries in the traditional sense is still among the most popular language tools beaten, monolingual or bilingual users situations.",
                    "label": 0
                },
                {
                    "sent": "So I believe the development of lexicographic content, not just its digital environment, is well deserving of funding public and private.",
                    "label": 0
                },
                {
                    "sent": "It needs to go hand in hand with the development of other segments of language infrastructure.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I thank you for your patience.",
                    "label": 1
                },
                {
                    "sent": "If you don't mind going back to the end of the first set of questions and two asking whether this objective has been achieved.",
                    "label": 0
                },
                {
                    "sent": "What have been your conclusions about that?",
                    "label": 0
                },
                {
                    "sent": "The only question that I wanted this I wanted really to leave too to others to answer, but in my view this transition.",
                    "label": 0
                },
                {
                    "sent": "I mean this would.",
                    "label": 0
                },
                {
                    "sent": "This would require the transition from word based to basically takes based dictionaries.",
                    "label": 0
                },
                {
                    "sent": "This is how I understand this quote.",
                    "label": 0
                },
                {
                    "sent": "By John John Sinclair, and, um, I really don't think.",
                    "label": 0
                },
                {
                    "sent": "Also, based on the examples that I showed today, that this has in any way been been achieved.",
                    "label": 0
                },
                {
                    "sent": "So I think there's a.",
                    "label": 0
                },
                {
                    "sent": "There's plenty of room to develop that aspect of dictionary making, and this I found a lead from vocabulary.com really interesting in that respect that they are really trying to do something differently.",
                    "label": 0
                },
                {
                    "sent": "Maybe just the beginning.",
                    "label": 0
                },
                {
                    "sent": "Another one more minute.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Since I would just like to make a comment on your comment, which I also thought of and also in relation to Patrick Hanks talk, who began with dictionaries are dead.",
                    "label": 0
                },
                {
                    "sent": "Some of you might know that I've been talking about the Post dictionary thing for some time, but my own impression is that dictionaries are more alive than ever before, simply differently.",
                    "label": 0
                },
                {
                    "sent": "And actually the use of that.",
                    "label": 0
                },
                {
                    "sent": "And this is a nonscientific statement is actually at its peak.",
                    "label": 0
                },
                {
                    "sent": "Now, of course we don't know what will happen with that.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much for your time.",
                    "label": 0
                }
            ]
        }
    }
}