{
    "id": "3ultsu7qrmlne43aiyh7quacdwqy3ve4",
    "title": "Compiling a monolingual dictionary for native speakers",
    "info": {
        "author": [
            "Patrick Hanks, Research Institute in Information and Language Processing (RIILP), University of Wolverhampton"
        ],
        "published": "Feb. 16, 2009",
        "recorded": "February 2009",
        "category": [
            "Top->Humanities->Languages"
        ]
    },
    "url": "http://videolectures.net/slovarji09_hanks_camdf/",
    "segmentation": [
        [
            "Thank you very much Simon, for the honor of the invitation.",
            "And I'm delighted to be here, and I will try to tell you something about the English experience in creating monolingual dictionaries aimed primarily at native speakers rather than foreign learners.",
            "I'm only sad that my brilliant colleague, former colleague, and friend Ramesh Krishnamurthy can't be here, so I'm a sort of substitute for Doctor Krishnamurthy.",
            "A lexical database.",
            "Is a resource for the creation of many important linguistic artifacts, dictionaries, coursebooks, computer programs for natural language processing.",
            "Among them, a great monolingual dictionary has a different function.",
            "It brings together speakers of a language.",
            "It has essentially integrative function.",
            "Making explicit the basis of words and meanings and usage which all users of the language rely on and now try to use this thing and see if I can move on.",
            "That's not the right one.",
            "Which of these do I want?",
            "Movie."
        ],
        [
            "If you just use the space, OK, so I will talk about.",
            "If I move over a bit, you could probably see the slide some, not me, which would be sorry.",
            "You'll have to move your camera, I'm sorry.",
            "But now I can see what I'm saying to you.",
            "Um?",
            "I want to start by talking about first language dictionaries.",
            "And native speakers as dictionary users briefly say a little bit about words and word histories.",
            "Say a little bit about research, getting the words in.",
            "I want to talk about dictionary structure macrostructure and microstructure.",
            "The future of.",
            "First language Dictionaries is a topic so vast and exciting in the age since the development of corpus resources.",
            "That it really I can't really do it justice and a single talk.",
            "It was the topic that I think Doctor Krishnamurthy was going to focus on.",
            "And it will have to wait for another occasion to go in any detail into what a dictionary will be like in the age of the Internet, they will be very different from the sort of books that I've compiled in my lifetime.",
            "He said tantalisingly."
        ],
        [
            "I want to make a distinction.",
            "Between two major kinds of monolingual dictionary for native speakers, the most important distinction is on the methodology of presentation of the data between historical principles of the kind found in the Great Multi volume Oxford English Dictionary currently being revised.",
            "At Oxford University Press and available online so that the research, when complete, is available piecemeal as the project goes along.",
            "In the old days, you had to wait 50 years before you got some of the research.",
            "Now you get it within a few months.",
            "That is a dictionary on historical principles.",
            "It places the first, it places the etymology of the word first.",
            "It places the oldest meaning of the word after the etymology and.",
            "So it will tell you that a camera.",
            "A camera is a small vaulted room.",
            "the Treasury of the papal curia.",
            "A bit later on it will tell you that it's a darkened room with a hole in the ceiling for reflecting images on a light table and somewhere very near the end of the entry.",
            "They mentioned photographs.",
            "Dictionaries on synchronic principles basically reverse the order and attempt to tell you that a camera is an apparatus for taking photographs, but then also tell you where that sense came from in America rather surprisingly.",
            "Installed dictionaries on historical principles have.",
            "I'll still most popular even among one volume.",
            "Dictionary is America's favorite dictionary.",
            "If sales are anything to go by, the Merriam Webster Collegiate, now in its 11th edition.",
            "Is a dictionary on historical principles, though I very much doubt whether any of or many of the users are aware of the distinction.",
            "They probably think that a camera really means a small room and somehow an apparatus for taking photographs is some kind of.",
            "Informal.",
            "Unacceptable late development.",
            "Who knows what users think.",
            "Dictionaries on synchronic principles include the Collins English Dictionary, which I edited in the 1970s.",
            "Although in the Stalinist world of Dictionary publishing, when I joined Oxford University Press, I became an unperson and my name was taken off the title page.",
            "Chambers English Dictionary was Chambers 20th century dictionary throughout the 20th century was a dictionary on historical principles for good marketing reasons.",
            "Chambers in 1993 abandoned historical principles and decided to compete head to head with Collins after I joined Oxford University Press.",
            "My principle achievement there I think was to edit the new Oxford Dictionary of English, the only dictionary.",
            "Native speakers to be based on corpus evidence.",
            "In his second edition, the publishers changed the title.",
            "It is now so node became a node or not.",
            "He became a naughty.",
            "It's the Oxford Dictionary of English.",
            "It is unrelated.",
            "In lexicographical terms, to the Great Historical Dictionary, from the same publishing house, it is a corpus based dictionary.",
            "But of course we shared research with larger colleagues at the other end of the corridor."
        ],
        [
            "I've said all that, so I won't say it again, but there are for those who need it.",
            "They will be on the slides and I will lead a cop.",
            "Leave a copy of the slides with Simon for you to."
        ],
        [
            "Peruse at your leisure.",
            "It's important to emphasize that his circle, the distinction between historical principles and synchronic principles, is really important.",
            "Becausw word meaning is very unstable if it exists at all.",
            "Some lexicographers, bilingual lexicographers Sue Atkins, for example, deny the existence of word meaning.",
            "And you can see why.",
            "If you think of the word fire, what does it mean?",
            "Is it?",
            "How is it something burning out there in the field?",
            "Is it something burning in your house?",
            "Is it under control or out of a crowd control?",
            "Is it something to do with guns?",
            "Is it something to do with losing your job?",
            "Is it something to do with making pottery fire in isolation?",
            "Means all of those things and much more as well a term in isolation.",
            "Has only meaning potential, not meaning what you get in a monolingual dictionary is a list of meaning potentials, not of meanings, strictly speaking.",
            "You need context to put the meaning to know which meaning is activated when a word is used in order to know what the normal context of words are, you need corpora.",
            "Introspection doesn't work, introspection distorts.",
            "We've learned the hard way through 50 years of generative linguistics that introspection distorts data.",
            "While I've been talking, you may have been reading some of the word changes in Word, meaning that have taken place in English from a few randomly selected.",
            "Words Huawei is Huawei is the word magazine in English.",
            "Evidently Cognative French magazine.",
            "Although they have very different meanings in English, it's a periord periodical publication or something to do with guns.",
            "In France, it's where you go shopping.",
            "Both go back to Arabic storehouse.",
            "The arrangement and presentation of information such as this.",
            "Is a critical.",
            "And difficult.",
            "Undertaking why does size mean big list dimension magnitude a very fundamental English word?",
            "You would imagine that size has always been part of English, but it hasn't.",
            "He takes me in medieval development, rather surprising medieval development due to the cheating habits of medieval bakers.",
            "If you didn't like.",
            "The loaf that you got from your Baker if you thought it was too small, and if the Baker consistently gave small measures.",
            "He might be taken to the assizes, a court of law.",
            "Anna's and a size loaf was a loaf that.",
            "Was of a pro dimensions approved by the court and from that narrow basis the word broadened outwards to mean the dimension or magnitude of anything.",
            "My point is that has a regular pattern of land linguistic development.",
            "Today's exploitation.",
            "Of.",
            "A word or a sense or even a part of a word like size which was originally as sizes, may become today's norm.",
            "To."
        ],
        [
            "Rose, norm.",
            "I'm going to speed up a bit.",
            "His time is running out."
        ],
        [
            "So the first duty over lexicographer.",
            "Of a lexicographer for native speakers.",
            "Is to get the words in.",
            "In 1857, Richard Chenevix Trench, one of the founders of the Oxford English Dictionary, described lexicographers as the inventory clerks of the language.",
            "That's exactly right.",
            "I want a little sign around my neck saying, proud to be an inventory clerk.",
            "It's hard, it's difficult.",
            "The Oxford Reading program, 150 years involving a sizable percentage of the clergymen of England.",
            "Some aristocrats and at least one criminal lunatic.",
            "Spent 150 years.",
            "The story of the Criminal Lunatic is is well told in a book by Simon Winchester.",
            "Dr Minor was a.",
            "Perfectly sane man, except that he had an unfortunate habit of cutting people up.",
            "He had been trained as a surgeon during the American Civil War, but he sort of lost.",
            "He couldn't couldn't lose the habit so, but so they locked locked him up in an asylum for the criminally insane where he worked on citations for the Oxford English Dictionary for the rest of his life.",
            "So.",
            "So before corpora.",
            "You had.",
            "Hundreds of people, volunteers contributing citations on which the new dictionary could be based.",
            "That in itself was of course, although wonderful enterprise and better than introspection.",
            "Nevertheless, that was a distorting activity because as.",
            "Murray himself complained Murray was the first editor of the Oxford English Dictionary, as he himself complained.",
            "We have 50 citations for the word abuse, and now then, if you ever use the word abuse and but I don't, in fact, this the only time I've ever heard it was in this context.",
            "50 citations for the word abuse and from various periods of English literature, but only 5.",
            "For abuse and abuse.",
            "Citation readers collect unusual citations.",
            "It would be a very, very strange citation reader who wrote down all the citations for the word of, but that's what a computer can do with.",
            "A large corpus it can show you how words like take and give and go and up and down are used, as well as words like triskaidekaphobia."
        ],
        [
            "Lexicography, however, I want to say is a creative one.",
            "Dictionary builds on top of another dictionary.",
            "Dictionary writers are sometimes accused of plagiarizing each other.",
            "But if you think about it, every dictionary definition is a small hypothesis, and you wouldn't publish our hypothesis in any of the Sciences without consulting the work of your predecessors is reasonable to look at other.",
            "Dictionaries what is not reasonable of course, is mindless copying.",
            "That's a danger, especially when it's late in the evening and you're behind schedule and you just want to get another another entry written.",
            "Searching Corpus Theater has a low yield for new words.",
            "It's not the way to get new words.",
            "It's not the only way to get new words.",
            "Lexicographers also need to trawl the Internet.",
            "And to read and watch TV, I'm going to say something about that in a minute.",
            "The problems with trolling the Internet is that many so called new words are in fact multi word expressions.",
            "And it's very difficult to pick them out from the rubbish or from the words you've already got, or to see the greenhouse effect.",
            "Thinking back 20 years to when it was a new word, greenhouse effect and greenhouse gas are not really anything to do with green houses."
        ],
        [
            "Well.",
            "I want to ask I never talk about the users because I started by saying that a dictionary has a socially integrating function.",
            "Let's look for a moment of users.",
            "There are no good studies that I know of of dictionary use.",
            "Among native speakers.",
            "There are some good studies of bilingual and foreign learners dictionaries.",
            "I'm going to tell you."
        ],
        [
            "A little bit about the feedback from the marketing Department, both at Collins in the 1970s and 80s and at Oxford in the 1990s.",
            "In English.",
            "Disappointingly for the lexicographer who works so hard on the definitions and grammar.",
            "People use dictionaries for spelling.",
            "I don't know Slovenian.",
            "You'll be able to tell me whether Spelling is a problem.",
            "Maybe it's less of a problem than in English.",
            "On the other hand, maybe for morphology is more of a problem in Slovenian than in English.",
            "People look to a dictionary for guidance on correct usage and word choice.",
            "Should I say uninterested or disinterested?",
            "Is there a difference?",
            "You hear people nowadays, to my intense annoyance, I may say personally, but I have to be objective.",
            "As a lexicographer, you hear people saying, I totally refute that.",
            "No, you can't refute something that's not what the word meaning is.",
            "You can't refute a statement by declaration declaration.",
            "You can deny it by declaration, but refuting is not just a strong form of denying it is.",
            "It implies in my language.",
            "Effective effective argumentation today in support of the denial.",
            "So I totally refute that his is just politician speak for I don't want to acknowledge that is true.",
            "Should you say, bored with or bored of more and more people?",
            "Say I'm bored of that.",
            "I didn't say it is it right or wrong in English there's been for at least 300 years.",
            "There's been lively debate, especially among people who believe that English is really Latin in disguise.",
            "About whether you can split an infinitive, can you say to boldly go where no man has been before?",
            "People wonder.",
            "Instant cultural reference information.",
            "What's the scientific name for Thrush?",
            "Where's your scapular?",
            "Is it just shoulder blade or your backbone or your collarbone?",
            "What's the capital of Chile?",
            "Huawei is a magical called a magical."
        ],
        [
            "What does Nook shot in mean?",
            "We find Shakespeare talking about England's Anouk shot in Ireland.",
            "What does it mean?",
            "What is accreditor people might ask?",
            "Is a Penguin a predator?",
            "Well, they catch fish too.",
            "What are chinos?",
            "What's a gnome?",
            "What's a jewel?",
            "Why is it called a jewel?",
            "He's are an English word.",
            "People use their dictionary for Scrabble.",
            "Don't don't underestimate it.",
            "And for crossword puzzles, actually is a word.",
            "It's A kind of volcanic lava.",
            "It's a word of Hawaiian origin.",
            "People want an authorative inventory of their language, even if they don't look inside it.",
            "They want it there on the bookshelf, just in case they ever might want to look at it.",
            "But if they do look at it, they want to.",
            "They want fun words.",
            "So here are some various criminal words cutpurse used by Shakespeare, and most trooper.",
            "Most troopers were criminal.",
            "Will criminal Raiders upon the borders between England and Scotland in the 17th and.",
            "16th and 17th century.",
            "What sayeg?",
            "What's a snakehead?",
            "What's a totsy?",
            "What's a rude boy?",
            "What's a grifter?",
            "These are all different kinds of criminals in different parts of the English speaking world and above all, the marketing Department will tell you we want new words because then the journalists will write about dictionary.",
            "This may seem trivial to serious minded people, but you have to do it in a dictionary for native speakers and the hard work of getting the framework right on the basis of the corpus evidence.",
            "Is largely uncelebrated it's necessary, but um."
        ],
        [
            "Celebrated.",
            "The corpus shows how each word is used.",
            "We now know that pre corpus dictionaries were curious.",
            "Disti edited one I did 2 actually before corporate, so I have all those ilava convert.",
            "Because last in about 1983 when I first started working with John Sinclair.",
            "I found we had evidence on which to base the generalizations that as lexicographers we were making, whether we make good generalizations or not is a different question.",
            "We tried the corpus at least shows you how each word is used.",
            "It provides an essential source of information for collocations and syntagmatic's which need to be studied statistically.",
            "Framework a solid, solid empirical foundation for a dictionary, but you can't stop there as a monolingual lexicographer.",
            "Other kinds of information must be slotted in.",
            "People want to know about etymologies and word histories.",
            "They want guidance on correct usage.",
            "They want scientific and technical information, including information about sports.",
            "So you want consistency of sets you want if you're going to put in cricketing terms, you don't just want some that happen to have.",
            "Pops up in a corpus or a collection citation collection.",
            "You need to study the terminology of cricket and decide how far you're going to go in the in the detailed.",
            "Explanation of that most arcane of human activities.",
            "So when a lexicographer.",
            "Reads a newspaper or watches TV.",
            "The lexicographer is not really interested in what's being said, not in the message.",
            "It's how it's being said.",
            "What are the words being used that are interesting?"
        ],
        [
            "Very briefly.",
            "It needs to be said that people expect the inventory of words in a Native Speaker dictionary to be complete.",
            "They want all the words in the language, and they're not ordinary.",
            "People are not content with the reply, but hang on a minute.",
            "The language is dynamic, new words are being formed all the time.",
            "They want all the meanings of each word.",
            "They're not content with the reply, but hang on a minute word.",
            "Mean is imprecise and fluid, not fixed.",
            "These are among the many problems that her Native speaker dictionary faces in.",
            "Dealing with the.",
            "With the activity that a respectable lexicographer can decently engaging and the expectations of the public, which are based on folk beliefs about the nature of language, food, beliefs which actually, in my humble opinion.",
            "Founded on 2400 years of confusion between.",
            "Natural language is a phenomenon and mathematics.",
            "Mathematical logic is one thing, it offers certainties.",
            "Ascential design feature of a natural language is that it offers uncertainty.",
            "The possibility to say something new to use words differently.",
            "So a corpus will show.",
            "Both how words are used normally and regularly, and some of the amazing irregularities which which creative speakers engage in.",
            "Guess which the dictionary maker has to.",
            "Report the dictionary maker has to try to be as boring as possible.",
            "Don't choose the exciting, inventive, creative example.",
            "Choose the central typical normal example.",
            "That's what people need.",
            "And remember, the dictionaries are for people, not for linguists."
        ],
        [
            "I think I've said that alright."
        ],
        [
            "In the right way, yeah.",
            "I OK new words Blogger.",
            "Publishers, Every Dictionary dictionary publisher publishes with each new addition little tiny booklet of new words to excite the journalists.",
            "This is this was from the Macmillan English Dictionary, a dictionary for foreign learners.",
            "But the publishers of Macmillan well understood the virtues of publicity, so they included blogosphere Chav, an air kiss.",
            "A career gap are somebody who's taken out time out a Chelsea tractor is one of those sort of tanks like American vehicles that people drive around, especially people who live in Chelsea somewhat rich district of London chiclet.",
            "Chick lit is literature for young women to read on the beach.",
            "A civil partnership is usually a homosexual marriage.",
            "A designer baby, well, it's amazing what you can do with genetics.",
            "These days, hissy fit.",
            "I had such a hissy fit, so it's it's a very camp word.",
            "Meaning a fit of bad temper, intelligent design."
        ],
        [
            "And we won't go there.",
            "Among the glorious mistakes of dictionaries, here's one cited by David Crystal.",
            "Be alert, be aware, awake.",
            "The word dorbz got into American dictionaries for awhile or into one American dictionaries with the definition dentists density.",
            "On closer examination, it turned out the door was actually copied from another dictionary where D stop or D big D or little D. Was defined as an abbreviation for density.",
            "Loops.",
            "In one of my own dictionaries.",
            "Intercourse is distilled, defined as communication or dealings between individuals or groups.",
            "In the 19th century, Harriet Martineau, respectable lady journalist from Birmingham.",
            "Wrote.",
            "But nowadays she spent most of her afternoons in affectionate intercourse with her friends.",
            "You can't say that anymore.",
            "But the new Oxford Dictionary of English sadly has got.",
            "The sense is in the wrong order.",
            "It should not really be just a cross reference, you don't."
        ],
        [
            "You get the point.",
            "I don't need to go on.",
            "You have to decide how to hard go in technical fields.",
            "Should you put in Strobl, Asstr, obolus tribulation or googly or a chav?",
            "Native speakers who don't know these words rightly expect to find them in a dictionary.",
            "On the other hand, a dictionary is not a term bank.",
            "The terminology of the terminology of the Sciences in particular, but also technological activities is so vast.",
            "Thank heavens for projects like Euro, Dick Autumn, which store.",
            "Terminology of an extremely abstruse variety with stipulated definitions.",
            "Get a."
        ],
        [
            "Um?",
            "I've already.",
            "Now I want to turn to definitions before I stop.",
            "Sinclair said the text is a unique deployment of meaningful units.",
            "The particular meaning is not adequately accounted for by any organized concatenation of the fixed meanings of each unit.",
            "In other words, some aspects of textual meaning arise from the combination of choices elsewhere.",
            "He says he refers to the semi prefabricated phrases where you've got the infuriating possibility of substituting.",
            "One phrase for another Rosamund Moon has a wonderful example of.",
            "Shaking in your shoes, meaning the same as quivering in your boots, and there are several other variations on the same idiom.",
            "There's no stability.",
            "There has to be some kind of movement like that which is shaking or shivering or quivering, and there has to be some kind of footwear.",
            "So there's a.",
            "There's an underlying generalization, but not a fixed, so fixed phrases aren't fixed.",
            "I think that's the message I take from Rosamund Moon's books."
        ],
        [
            "Writing definitions of technical terms is a particular problem for monolingual lexicographers.",
            "In order to understand and explain a term, and I think definitions should explain not merely define.",
            "You need to be a user of those terms.",
            "Anybody who's ever played cricket knows how ludicrous American definite dictionary definitions of cricketing terms are.",
            "No doubt the Americans feel the same about British definitions of baseball terms or American football, which they call football or hockey, which we call ice hockey.",
            "You need to be a user, but users of the terms are particularly bad at defining them and explaining them.",
            "So you need an interplay between the technical advisor, the scientist or the Sportsman.",
            "And the lexicographer who has the acquired skill of explaining."
        ],
        [
            "I'm.",
            "Nude coats.",
            "With this some word in some some words there is a clash between the scientific and technical community and people ordinary people when they say wait a minute or his eyes met charlottes for a minute or for a second.",
            "Sorry wait a second or his eyes met Charlottes for a second.",
            "Ordinary people do not mean.",
            "Something defined in terms of the natural periodicity of the radiation of a cesium 133 Atom.",
            "Which is the internationally agreed system?",
            "Antonissen out definition agreed by a committee in Paris?"
        ],
        [
            "I don't think this is very good definition.",
            "It becausw it tries to define rather than explain what a arachnid do doing there.",
            "What I'm saying mented what fused head and thorax well but but this is a.",
            "This is about the best we could do by way of a compromise between scientific accuracy and saying in childish language's pilot, spiders are creepy crawlers with a legs.",
            "An eight legged predatory arachnid with an UN segmented body.",
            "But you can read it for yourselves.",
            "Order around Ronnie class arachnida.",
            "Some people want that information and they go to the dictionary for it."
        ],
        [
            "This slide I'm sorry to say it hasn't come out very well.",
            "It's an attempt to pick up from Adam Kilgarriff wonderful program.",
            "Well, Adam, Pavel Rickley and other colleagues of mine.",
            "Former colleagues of mine at the Masarik University in Bruno.",
            "Developed a word sketch engine which shows.",
            "The significant call occurs according to one statistical measure, mutual information, as she pointwise mutual information.",
            "Of any word in the English language, and arranges them according to their syntagmatic or.",
            "Colleague Ational relations so.",
            "What do you do to spiders?",
            "You catch them.",
            "I'm sorry it doesn't come, but you can see the bits in black.",
            "You, you catch spiders.",
            "You watch spiders.",
            "Apparently you eat spiders.",
            "I suppose you have to be a bird to do that.",
            "And you find spiders OK significantly.",
            "What does spiders do?",
            "They scuttle, they crawl, they spin.",
            "You know what they spin.",
            "They spin webs, they climb, they buy it.",
            "That's a surprise.",
            "They feed on something, they wait.",
            "They live somewhere they run and so on.",
            "They are modified by they.",
            "Oh, they are modified by expressions like trapdoor spiders, bird eating, spiders, good heavens.",
            "Tarantula Spider a jumping spider.",
            "As compared with a sedentary spider, this is pure statistics.",
            "The computer has no idea what a spider is, it just knows which words collocate with it.",
            "And the last one is very important becausw.",
            "You can't see it down here, but it says and or.",
            "It's rather like going to Amazon people who bought this book also bought people who talk about spiders also talk about scorpions, cockroaches, beetles, insects, flies.",
            "This is not an evaluative judgment.",
            "This is simply words found in the same text within a five word window, either side of spider."
        ],
        [
            "So you can build a basis for a new kind of dictionary in entries.",
            "It will tell you that there are many species of spiders, funnel webs, web building.",
            "We've seen all that, some speed of species of spiders hunt prey.",
            "Spiders bite, some species are poisonous.",
            "They spin webs strong silk, they look that's waiting, especially spider ish word for.",
            "Waiting.",
            "They have 8 legs.",
            "Their legs are thin and hairy.",
            "They have eight eyes.",
            "Have I got that right?",
            "I thought it was six anyway.",
            "All of the this corpus based profile is based on the statistical collocations in various corpora.",
            "But it can be built up into an explanatory dictionary entry of a kind quite different from any member of the order Iraqna die."
        ],
        [
            "At the same time, lexicographers should be brief and I should be brief 'cause we're running out of time, so I'll move on Occam's razor.",
            "Occam's Razor says.",
            "Do not multiply entities unnecessarily.",
            "Well, wonderful advice to lexicographers."
        ],
        [
            "I've already said that so I can move."
        ],
        [
            "Born with beyond the stage where there should be invented examples.",
            "We, but in choosing examples, authenticity alone is not enough.",
            "Examples need to be chosen for their naturalness, their normalness, and every young lexicographer that I've ever trained has had the problem.",
            "Not everyone but most of 'em have the problem of seeing, oh, there's an interesting citation who look.",
            "You can even use this word like that and they choose boundary cases to exemplify the boundaries of word meaning and word use.",
            "Human beings are, I think.",
            "Biologically structured to ask to ask immediately questions about boundary cases.",
            "The job of the lexicographer is to describe the central and typical cases before moving on.",
            "If time and space allows to boundary cases."
        ],
        [
            "You need to get on with it.",
            "Agonizing is often counterproductive.",
            "Often the 1st first form of words that somebody writes down as the best.",
            "They then agonize and gradually make the entry less and less satisfactory and less and less comprehensible trying to cover all eventualities.",
            "So you need to set up a system in your dictionary project where compilers where the compiler is free to do his or her honest best and move on and the system says somebody else will check the cheat.",
            "The editor in chief perhaps will check and ensure that obvious errors and accidental infelicities are corrected.",
            "Lexicography, lexicography is a team game.",
            "The team should have a structure lexicographers read and check each other's work."
        ],
        [
            "Well, I'm almost out of time, but.",
            "The question arises in what medium will your monolingual dictionary be published?",
            "I asked the question, I have no.",
            "Answer.",
            "Um?",
            "And what will be the message?",
            "I do have some suggestions here we should summarize as lexicographers typify, and show interfaces with other sources of information, especially if if we are working online.",
            "We should as the great John Wilkins Amanta whom Leibnitz was deeply indebted, observed in 1668.",
            "Wilkins was in amongst Wilkins in Wilkins, amongst other things, invented Roget's Thesaurus 200 years before Roger.",
            "Just as the preliminary to inventing a new language which knew universal language.",
            "He's a man of extraordinary energy.",
            "Umberto Eco says.",
            "In the search for the perfect language that Wilkins was also reaching was also reaching for the modern concept of hypertext.",
            "So not only did he invent Rogets Thesaurus, but he also pointed out that dogs bark, Wolves howl, Lions roar.",
            "He didn't actually say cats Meow, but I put that in.",
            "There is my contribution to Wilkins is great work.",
            "The message might be in multimedia format that belongs under medium.",
            "So."
        ],
        [
            "Lexicographers are not linguists in my opinion.",
            "In fact, linguistics.",
            "I wrote this.",
            "I wrote this slide some time ago.",
            "I think it's less true now.",
            "Then it was linguistics used to be fatal for good lexicography, and this is because linguists C language on that axis.",
            "Some lexicographers see it on that axis, and there's the best lexicographers I've ever trained.",
            "Have not been linguists there people.",
            "Some of them have had qualifications in literature.",
            "You would need to have read the literature of your language if you're going to be a lexicographer, but also botanists.",
            "Very good you see the point.",
            "They make fine distinctions and they know they know how to tell one plant from another is not far from plans to words."
        ],
        [
            "And finally.",
            "We need to make a distinction between evidence and interpretation.",
            "So a corpus shows word usage.",
            "Other researchers use.",
            "It is needed for terminology, unusual words, names, word histories, attitudes to correctness, but that's all evidence.",
            "Collecting the evidence is important.",
            "Then comes the business of interpreting the evidence and what I've been trying to say here is definitions should explain, not merely define.",
            "That is, that the public expect Authorative authoritative pronouncements.",
            "The fatal trap for a lexicographer and goodness knows, I've seen friends and colleagues fall into.",
            "It is believing that because you're the editor of an Oxford dictionary, you must be somehow important.",
            "No, you're a person of no importance at all.",
            "You should just transmit what's going on in society, social attitudes to language, as well as meanings.",
            "So authoritative pronouncements pronouncements must be based on evidence.",
            "Public attitudes should be reported, not swept under the carpet.",
            "I'm.",
            "But they must be reported and evaluated.",
            "The task is to report all central normal uses and meanings, because if you try to cover all the possibilities of use of any content word in the language, there is a danger that the language will defeat you.",
            "Just because word, meaning and uses infinitely flexible what you're reaching for is the central norm that.",
            "Speakers of your language rely on when they speak to each other, not the wild eccentricities of imaginative writers and linguists.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you very much Simon, for the honor of the invitation.",
                    "label": 0
                },
                {
                    "sent": "And I'm delighted to be here, and I will try to tell you something about the English experience in creating monolingual dictionaries aimed primarily at native speakers rather than foreign learners.",
                    "label": 1
                },
                {
                    "sent": "I'm only sad that my brilliant colleague, former colleague, and friend Ramesh Krishnamurthy can't be here, so I'm a sort of substitute for Doctor Krishnamurthy.",
                    "label": 0
                },
                {
                    "sent": "A lexical database.",
                    "label": 0
                },
                {
                    "sent": "Is a resource for the creation of many important linguistic artifacts, dictionaries, coursebooks, computer programs for natural language processing.",
                    "label": 0
                },
                {
                    "sent": "Among them, a great monolingual dictionary has a different function.",
                    "label": 1
                },
                {
                    "sent": "It brings together speakers of a language.",
                    "label": 0
                },
                {
                    "sent": "It has essentially integrative function.",
                    "label": 0
                },
                {
                    "sent": "Making explicit the basis of words and meanings and usage which all users of the language rely on and now try to use this thing and see if I can move on.",
                    "label": 0
                },
                {
                    "sent": "That's not the right one.",
                    "label": 0
                },
                {
                    "sent": "Which of these do I want?",
                    "label": 0
                },
                {
                    "sent": "Movie.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If you just use the space, OK, so I will talk about.",
                    "label": 1
                },
                {
                    "sent": "If I move over a bit, you could probably see the slide some, not me, which would be sorry.",
                    "label": 0
                },
                {
                    "sent": "You'll have to move your camera, I'm sorry.",
                    "label": 0
                },
                {
                    "sent": "But now I can see what I'm saying to you.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "I want to start by talking about first language dictionaries.",
                    "label": 0
                },
                {
                    "sent": "And native speakers as dictionary users briefly say a little bit about words and word histories.",
                    "label": 0
                },
                {
                    "sent": "Say a little bit about research, getting the words in.",
                    "label": 1
                },
                {
                    "sent": "I want to talk about dictionary structure macrostructure and microstructure.",
                    "label": 0
                },
                {
                    "sent": "The future of.",
                    "label": 0
                },
                {
                    "sent": "First language Dictionaries is a topic so vast and exciting in the age since the development of corpus resources.",
                    "label": 0
                },
                {
                    "sent": "That it really I can't really do it justice and a single talk.",
                    "label": 0
                },
                {
                    "sent": "It was the topic that I think Doctor Krishnamurthy was going to focus on.",
                    "label": 0
                },
                {
                    "sent": "And it will have to wait for another occasion to go in any detail into what a dictionary will be like in the age of the Internet, they will be very different from the sort of books that I've compiled in my lifetime.",
                    "label": 0
                },
                {
                    "sent": "He said tantalisingly.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I want to make a distinction.",
                    "label": 0
                },
                {
                    "sent": "Between two major kinds of monolingual dictionary for native speakers, the most important distinction is on the methodology of presentation of the data between historical principles of the kind found in the Great Multi volume Oxford English Dictionary currently being revised.",
                    "label": 1
                },
                {
                    "sent": "At Oxford University Press and available online so that the research, when complete, is available piecemeal as the project goes along.",
                    "label": 0
                },
                {
                    "sent": "In the old days, you had to wait 50 years before you got some of the research.",
                    "label": 0
                },
                {
                    "sent": "Now you get it within a few months.",
                    "label": 0
                },
                {
                    "sent": "That is a dictionary on historical principles.",
                    "label": 0
                },
                {
                    "sent": "It places the first, it places the etymology of the word first.",
                    "label": 0
                },
                {
                    "sent": "It places the oldest meaning of the word after the etymology and.",
                    "label": 0
                },
                {
                    "sent": "So it will tell you that a camera.",
                    "label": 0
                },
                {
                    "sent": "A camera is a small vaulted room.",
                    "label": 0
                },
                {
                    "sent": "the Treasury of the papal curia.",
                    "label": 0
                },
                {
                    "sent": "A bit later on it will tell you that it's a darkened room with a hole in the ceiling for reflecting images on a light table and somewhere very near the end of the entry.",
                    "label": 0
                },
                {
                    "sent": "They mentioned photographs.",
                    "label": 0
                },
                {
                    "sent": "Dictionaries on synchronic principles basically reverse the order and attempt to tell you that a camera is an apparatus for taking photographs, but then also tell you where that sense came from in America rather surprisingly.",
                    "label": 0
                },
                {
                    "sent": "Installed dictionaries on historical principles have.",
                    "label": 0
                },
                {
                    "sent": "I'll still most popular even among one volume.",
                    "label": 0
                },
                {
                    "sent": "Dictionary is America's favorite dictionary.",
                    "label": 0
                },
                {
                    "sent": "If sales are anything to go by, the Merriam Webster Collegiate, now in its 11th edition.",
                    "label": 0
                },
                {
                    "sent": "Is a dictionary on historical principles, though I very much doubt whether any of or many of the users are aware of the distinction.",
                    "label": 0
                },
                {
                    "sent": "They probably think that a camera really means a small room and somehow an apparatus for taking photographs is some kind of.",
                    "label": 0
                },
                {
                    "sent": "Informal.",
                    "label": 0
                },
                {
                    "sent": "Unacceptable late development.",
                    "label": 0
                },
                {
                    "sent": "Who knows what users think.",
                    "label": 0
                },
                {
                    "sent": "Dictionaries on synchronic principles include the Collins English Dictionary, which I edited in the 1970s.",
                    "label": 0
                },
                {
                    "sent": "Although in the Stalinist world of Dictionary publishing, when I joined Oxford University Press, I became an unperson and my name was taken off the title page.",
                    "label": 0
                },
                {
                    "sent": "Chambers English Dictionary was Chambers 20th century dictionary throughout the 20th century was a dictionary on historical principles for good marketing reasons.",
                    "label": 0
                },
                {
                    "sent": "Chambers in 1993 abandoned historical principles and decided to compete head to head with Collins after I joined Oxford University Press.",
                    "label": 0
                },
                {
                    "sent": "My principle achievement there I think was to edit the new Oxford Dictionary of English, the only dictionary.",
                    "label": 0
                },
                {
                    "sent": "Native speakers to be based on corpus evidence.",
                    "label": 0
                },
                {
                    "sent": "In his second edition, the publishers changed the title.",
                    "label": 0
                },
                {
                    "sent": "It is now so node became a node or not.",
                    "label": 0
                },
                {
                    "sent": "He became a naughty.",
                    "label": 0
                },
                {
                    "sent": "It's the Oxford Dictionary of English.",
                    "label": 0
                },
                {
                    "sent": "It is unrelated.",
                    "label": 0
                },
                {
                    "sent": "In lexicographical terms, to the Great Historical Dictionary, from the same publishing house, it is a corpus based dictionary.",
                    "label": 0
                },
                {
                    "sent": "But of course we shared research with larger colleagues at the other end of the corridor.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I've said all that, so I won't say it again, but there are for those who need it.",
                    "label": 0
                },
                {
                    "sent": "They will be on the slides and I will lead a cop.",
                    "label": 0
                },
                {
                    "sent": "Leave a copy of the slides with Simon for you to.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Peruse at your leisure.",
                    "label": 0
                },
                {
                    "sent": "It's important to emphasize that his circle, the distinction between historical principles and synchronic principles, is really important.",
                    "label": 0
                },
                {
                    "sent": "Becausw word meaning is very unstable if it exists at all.",
                    "label": 0
                },
                {
                    "sent": "Some lexicographers, bilingual lexicographers Sue Atkins, for example, deny the existence of word meaning.",
                    "label": 1
                },
                {
                    "sent": "And you can see why.",
                    "label": 0
                },
                {
                    "sent": "If you think of the word fire, what does it mean?",
                    "label": 0
                },
                {
                    "sent": "Is it?",
                    "label": 0
                },
                {
                    "sent": "How is it something burning out there in the field?",
                    "label": 0
                },
                {
                    "sent": "Is it something burning in your house?",
                    "label": 0
                },
                {
                    "sent": "Is it under control or out of a crowd control?",
                    "label": 0
                },
                {
                    "sent": "Is it something to do with guns?",
                    "label": 0
                },
                {
                    "sent": "Is it something to do with losing your job?",
                    "label": 0
                },
                {
                    "sent": "Is it something to do with making pottery fire in isolation?",
                    "label": 0
                },
                {
                    "sent": "Means all of those things and much more as well a term in isolation.",
                    "label": 0
                },
                {
                    "sent": "Has only meaning potential, not meaning what you get in a monolingual dictionary is a list of meaning potentials, not of meanings, strictly speaking.",
                    "label": 0
                },
                {
                    "sent": "You need context to put the meaning to know which meaning is activated when a word is used in order to know what the normal context of words are, you need corpora.",
                    "label": 0
                },
                {
                    "sent": "Introspection doesn't work, introspection distorts.",
                    "label": 0
                },
                {
                    "sent": "We've learned the hard way through 50 years of generative linguistics that introspection distorts data.",
                    "label": 0
                },
                {
                    "sent": "While I've been talking, you may have been reading some of the word changes in Word, meaning that have taken place in English from a few randomly selected.",
                    "label": 0
                },
                {
                    "sent": "Words Huawei is Huawei is the word magazine in English.",
                    "label": 0
                },
                {
                    "sent": "Evidently Cognative French magazine.",
                    "label": 0
                },
                {
                    "sent": "Although they have very different meanings in English, it's a periord periodical publication or something to do with guns.",
                    "label": 0
                },
                {
                    "sent": "In France, it's where you go shopping.",
                    "label": 1
                },
                {
                    "sent": "Both go back to Arabic storehouse.",
                    "label": 0
                },
                {
                    "sent": "The arrangement and presentation of information such as this.",
                    "label": 0
                },
                {
                    "sent": "Is a critical.",
                    "label": 0
                },
                {
                    "sent": "And difficult.",
                    "label": 0
                },
                {
                    "sent": "Undertaking why does size mean big list dimension magnitude a very fundamental English word?",
                    "label": 0
                },
                {
                    "sent": "You would imagine that size has always been part of English, but it hasn't.",
                    "label": 0
                },
                {
                    "sent": "He takes me in medieval development, rather surprising medieval development due to the cheating habits of medieval bakers.",
                    "label": 0
                },
                {
                    "sent": "If you didn't like.",
                    "label": 0
                },
                {
                    "sent": "The loaf that you got from your Baker if you thought it was too small, and if the Baker consistently gave small measures.",
                    "label": 0
                },
                {
                    "sent": "He might be taken to the assizes, a court of law.",
                    "label": 0
                },
                {
                    "sent": "Anna's and a size loaf was a loaf that.",
                    "label": 1
                },
                {
                    "sent": "Was of a pro dimensions approved by the court and from that narrow basis the word broadened outwards to mean the dimension or magnitude of anything.",
                    "label": 0
                },
                {
                    "sent": "My point is that has a regular pattern of land linguistic development.",
                    "label": 0
                },
                {
                    "sent": "Today's exploitation.",
                    "label": 0
                },
                {
                    "sent": "Of.",
                    "label": 0
                },
                {
                    "sent": "A word or a sense or even a part of a word like size which was originally as sizes, may become today's norm.",
                    "label": 0
                },
                {
                    "sent": "To.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Rose, norm.",
                    "label": 0
                },
                {
                    "sent": "I'm going to speed up a bit.",
                    "label": 0
                },
                {
                    "sent": "His time is running out.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the first duty over lexicographer.",
                    "label": 0
                },
                {
                    "sent": "Of a lexicographer for native speakers.",
                    "label": 0
                },
                {
                    "sent": "Is to get the words in.",
                    "label": 0
                },
                {
                    "sent": "In 1857, Richard Chenevix Trench, one of the founders of the Oxford English Dictionary, described lexicographers as the inventory clerks of the language.",
                    "label": 0
                },
                {
                    "sent": "That's exactly right.",
                    "label": 0
                },
                {
                    "sent": "I want a little sign around my neck saying, proud to be an inventory clerk.",
                    "label": 0
                },
                {
                    "sent": "It's hard, it's difficult.",
                    "label": 0
                },
                {
                    "sent": "The Oxford Reading program, 150 years involving a sizable percentage of the clergymen of England.",
                    "label": 1
                },
                {
                    "sent": "Some aristocrats and at least one criminal lunatic.",
                    "label": 0
                },
                {
                    "sent": "Spent 150 years.",
                    "label": 0
                },
                {
                    "sent": "The story of the Criminal Lunatic is is well told in a book by Simon Winchester.",
                    "label": 0
                },
                {
                    "sent": "Dr Minor was a.",
                    "label": 0
                },
                {
                    "sent": "Perfectly sane man, except that he had an unfortunate habit of cutting people up.",
                    "label": 0
                },
                {
                    "sent": "He had been trained as a surgeon during the American Civil War, but he sort of lost.",
                    "label": 0
                },
                {
                    "sent": "He couldn't couldn't lose the habit so, but so they locked locked him up in an asylum for the criminally insane where he worked on citations for the Oxford English Dictionary for the rest of his life.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So before corpora.",
                    "label": 0
                },
                {
                    "sent": "You had.",
                    "label": 0
                },
                {
                    "sent": "Hundreds of people, volunteers contributing citations on which the new dictionary could be based.",
                    "label": 0
                },
                {
                    "sent": "That in itself was of course, although wonderful enterprise and better than introspection.",
                    "label": 0
                },
                {
                    "sent": "Nevertheless, that was a distorting activity because as.",
                    "label": 0
                },
                {
                    "sent": "Murray himself complained Murray was the first editor of the Oxford English Dictionary, as he himself complained.",
                    "label": 0
                },
                {
                    "sent": "We have 50 citations for the word abuse, and now then, if you ever use the word abuse and but I don't, in fact, this the only time I've ever heard it was in this context.",
                    "label": 0
                },
                {
                    "sent": "50 citations for the word abuse and from various periods of English literature, but only 5.",
                    "label": 0
                },
                {
                    "sent": "For abuse and abuse.",
                    "label": 0
                },
                {
                    "sent": "Citation readers collect unusual citations.",
                    "label": 0
                },
                {
                    "sent": "It would be a very, very strange citation reader who wrote down all the citations for the word of, but that's what a computer can do with.",
                    "label": 0
                },
                {
                    "sent": "A large corpus it can show you how words like take and give and go and up and down are used, as well as words like triskaidekaphobia.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Lexicography, however, I want to say is a creative one.",
                    "label": 0
                },
                {
                    "sent": "Dictionary builds on top of another dictionary.",
                    "label": 0
                },
                {
                    "sent": "Dictionary writers are sometimes accused of plagiarizing each other.",
                    "label": 0
                },
                {
                    "sent": "But if you think about it, every dictionary definition is a small hypothesis, and you wouldn't publish our hypothesis in any of the Sciences without consulting the work of your predecessors is reasonable to look at other.",
                    "label": 0
                },
                {
                    "sent": "Dictionaries what is not reasonable of course, is mindless copying.",
                    "label": 0
                },
                {
                    "sent": "That's a danger, especially when it's late in the evening and you're behind schedule and you just want to get another another entry written.",
                    "label": 0
                },
                {
                    "sent": "Searching Corpus Theater has a low yield for new words.",
                    "label": 1
                },
                {
                    "sent": "It's not the way to get new words.",
                    "label": 0
                },
                {
                    "sent": "It's not the only way to get new words.",
                    "label": 1
                },
                {
                    "sent": "Lexicographers also need to trawl the Internet.",
                    "label": 0
                },
                {
                    "sent": "And to read and watch TV, I'm going to say something about that in a minute.",
                    "label": 1
                },
                {
                    "sent": "The problems with trolling the Internet is that many so called new words are in fact multi word expressions.",
                    "label": 0
                },
                {
                    "sent": "And it's very difficult to pick them out from the rubbish or from the words you've already got, or to see the greenhouse effect.",
                    "label": 0
                },
                {
                    "sent": "Thinking back 20 years to when it was a new word, greenhouse effect and greenhouse gas are not really anything to do with green houses.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "I want to ask I never talk about the users because I started by saying that a dictionary has a socially integrating function.",
                    "label": 0
                },
                {
                    "sent": "Let's look for a moment of users.",
                    "label": 0
                },
                {
                    "sent": "There are no good studies that I know of of dictionary use.",
                    "label": 1
                },
                {
                    "sent": "Among native speakers.",
                    "label": 0
                },
                {
                    "sent": "There are some good studies of bilingual and foreign learners dictionaries.",
                    "label": 1
                },
                {
                    "sent": "I'm going to tell you.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A little bit about the feedback from the marketing Department, both at Collins in the 1970s and 80s and at Oxford in the 1990s.",
                    "label": 0
                },
                {
                    "sent": "In English.",
                    "label": 0
                },
                {
                    "sent": "Disappointingly for the lexicographer who works so hard on the definitions and grammar.",
                    "label": 0
                },
                {
                    "sent": "People use dictionaries for spelling.",
                    "label": 1
                },
                {
                    "sent": "I don't know Slovenian.",
                    "label": 0
                },
                {
                    "sent": "You'll be able to tell me whether Spelling is a problem.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's less of a problem than in English.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, maybe for morphology is more of a problem in Slovenian than in English.",
                    "label": 0
                },
                {
                    "sent": "People look to a dictionary for guidance on correct usage and word choice.",
                    "label": 1
                },
                {
                    "sent": "Should I say uninterested or disinterested?",
                    "label": 0
                },
                {
                    "sent": "Is there a difference?",
                    "label": 0
                },
                {
                    "sent": "You hear people nowadays, to my intense annoyance, I may say personally, but I have to be objective.",
                    "label": 0
                },
                {
                    "sent": "As a lexicographer, you hear people saying, I totally refute that.",
                    "label": 0
                },
                {
                    "sent": "No, you can't refute something that's not what the word meaning is.",
                    "label": 0
                },
                {
                    "sent": "You can't refute a statement by declaration declaration.",
                    "label": 0
                },
                {
                    "sent": "You can deny it by declaration, but refuting is not just a strong form of denying it is.",
                    "label": 0
                },
                {
                    "sent": "It implies in my language.",
                    "label": 0
                },
                {
                    "sent": "Effective effective argumentation today in support of the denial.",
                    "label": 0
                },
                {
                    "sent": "So I totally refute that his is just politician speak for I don't want to acknowledge that is true.",
                    "label": 1
                },
                {
                    "sent": "Should you say, bored with or bored of more and more people?",
                    "label": 0
                },
                {
                    "sent": "Say I'm bored of that.",
                    "label": 0
                },
                {
                    "sent": "I didn't say it is it right or wrong in English there's been for at least 300 years.",
                    "label": 1
                },
                {
                    "sent": "There's been lively debate, especially among people who believe that English is really Latin in disguise.",
                    "label": 0
                },
                {
                    "sent": "About whether you can split an infinitive, can you say to boldly go where no man has been before?",
                    "label": 0
                },
                {
                    "sent": "People wonder.",
                    "label": 1
                },
                {
                    "sent": "Instant cultural reference information.",
                    "label": 1
                },
                {
                    "sent": "What's the scientific name for Thrush?",
                    "label": 1
                },
                {
                    "sent": "Where's your scapular?",
                    "label": 0
                },
                {
                    "sent": "Is it just shoulder blade or your backbone or your collarbone?",
                    "label": 1
                },
                {
                    "sent": "What's the capital of Chile?",
                    "label": 0
                },
                {
                    "sent": "Huawei is a magical called a magical.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What does Nook shot in mean?",
                    "label": 0
                },
                {
                    "sent": "We find Shakespeare talking about England's Anouk shot in Ireland.",
                    "label": 0
                },
                {
                    "sent": "What does it mean?",
                    "label": 0
                },
                {
                    "sent": "What is accreditor people might ask?",
                    "label": 0
                },
                {
                    "sent": "Is a Penguin a predator?",
                    "label": 1
                },
                {
                    "sent": "Well, they catch fish too.",
                    "label": 0
                },
                {
                    "sent": "What are chinos?",
                    "label": 0
                },
                {
                    "sent": "What's a gnome?",
                    "label": 0
                },
                {
                    "sent": "What's a jewel?",
                    "label": 0
                },
                {
                    "sent": "Why is it called a jewel?",
                    "label": 1
                },
                {
                    "sent": "He's are an English word.",
                    "label": 0
                },
                {
                    "sent": "People use their dictionary for Scrabble.",
                    "label": 0
                },
                {
                    "sent": "Don't don't underestimate it.",
                    "label": 0
                },
                {
                    "sent": "And for crossword puzzles, actually is a word.",
                    "label": 0
                },
                {
                    "sent": "It's A kind of volcanic lava.",
                    "label": 0
                },
                {
                    "sent": "It's a word of Hawaiian origin.",
                    "label": 0
                },
                {
                    "sent": "People want an authorative inventory of their language, even if they don't look inside it.",
                    "label": 1
                },
                {
                    "sent": "They want it there on the bookshelf, just in case they ever might want to look at it.",
                    "label": 0
                },
                {
                    "sent": "But if they do look at it, they want to.",
                    "label": 0
                },
                {
                    "sent": "They want fun words.",
                    "label": 0
                },
                {
                    "sent": "So here are some various criminal words cutpurse used by Shakespeare, and most trooper.",
                    "label": 0
                },
                {
                    "sent": "Most troopers were criminal.",
                    "label": 0
                },
                {
                    "sent": "Will criminal Raiders upon the borders between England and Scotland in the 17th and.",
                    "label": 0
                },
                {
                    "sent": "16th and 17th century.",
                    "label": 0
                },
                {
                    "sent": "What sayeg?",
                    "label": 0
                },
                {
                    "sent": "What's a snakehead?",
                    "label": 0
                },
                {
                    "sent": "What's a totsy?",
                    "label": 0
                },
                {
                    "sent": "What's a rude boy?",
                    "label": 0
                },
                {
                    "sent": "What's a grifter?",
                    "label": 0
                },
                {
                    "sent": "These are all different kinds of criminals in different parts of the English speaking world and above all, the marketing Department will tell you we want new words because then the journalists will write about dictionary.",
                    "label": 0
                },
                {
                    "sent": "This may seem trivial to serious minded people, but you have to do it in a dictionary for native speakers and the hard work of getting the framework right on the basis of the corpus evidence.",
                    "label": 0
                },
                {
                    "sent": "Is largely uncelebrated it's necessary, but um.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Celebrated.",
                    "label": 0
                },
                {
                    "sent": "The corpus shows how each word is used.",
                    "label": 1
                },
                {
                    "sent": "We now know that pre corpus dictionaries were curious.",
                    "label": 0
                },
                {
                    "sent": "Disti edited one I did 2 actually before corporate, so I have all those ilava convert.",
                    "label": 0
                },
                {
                    "sent": "Because last in about 1983 when I first started working with John Sinclair.",
                    "label": 0
                },
                {
                    "sent": "I found we had evidence on which to base the generalizations that as lexicographers we were making, whether we make good generalizations or not is a different question.",
                    "label": 0
                },
                {
                    "sent": "We tried the corpus at least shows you how each word is used.",
                    "label": 1
                },
                {
                    "sent": "It provides an essential source of information for collocations and syntagmatic's which need to be studied statistically.",
                    "label": 1
                },
                {
                    "sent": "Framework a solid, solid empirical foundation for a dictionary, but you can't stop there as a monolingual lexicographer.",
                    "label": 0
                },
                {
                    "sent": "Other kinds of information must be slotted in.",
                    "label": 0
                },
                {
                    "sent": "People want to know about etymologies and word histories.",
                    "label": 0
                },
                {
                    "sent": "They want guidance on correct usage.",
                    "label": 0
                },
                {
                    "sent": "They want scientific and technical information, including information about sports.",
                    "label": 0
                },
                {
                    "sent": "So you want consistency of sets you want if you're going to put in cricketing terms, you don't just want some that happen to have.",
                    "label": 0
                },
                {
                    "sent": "Pops up in a corpus or a collection citation collection.",
                    "label": 0
                },
                {
                    "sent": "You need to study the terminology of cricket and decide how far you're going to go in the in the detailed.",
                    "label": 0
                },
                {
                    "sent": "Explanation of that most arcane of human activities.",
                    "label": 0
                },
                {
                    "sent": "So when a lexicographer.",
                    "label": 0
                },
                {
                    "sent": "Reads a newspaper or watches TV.",
                    "label": 0
                },
                {
                    "sent": "The lexicographer is not really interested in what's being said, not in the message.",
                    "label": 0
                },
                {
                    "sent": "It's how it's being said.",
                    "label": 0
                },
                {
                    "sent": "What are the words being used that are interesting?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Very briefly.",
                    "label": 0
                },
                {
                    "sent": "It needs to be said that people expect the inventory of words in a Native Speaker dictionary to be complete.",
                    "label": 0
                },
                {
                    "sent": "They want all the words in the language, and they're not ordinary.",
                    "label": 1
                },
                {
                    "sent": "People are not content with the reply, but hang on a minute.",
                    "label": 0
                },
                {
                    "sent": "The language is dynamic, new words are being formed all the time.",
                    "label": 0
                },
                {
                    "sent": "They want all the meanings of each word.",
                    "label": 1
                },
                {
                    "sent": "They're not content with the reply, but hang on a minute word.",
                    "label": 0
                },
                {
                    "sent": "Mean is imprecise and fluid, not fixed.",
                    "label": 1
                },
                {
                    "sent": "These are among the many problems that her Native speaker dictionary faces in.",
                    "label": 0
                },
                {
                    "sent": "Dealing with the.",
                    "label": 0
                },
                {
                    "sent": "With the activity that a respectable lexicographer can decently engaging and the expectations of the public, which are based on folk beliefs about the nature of language, food, beliefs which actually, in my humble opinion.",
                    "label": 0
                },
                {
                    "sent": "Founded on 2400 years of confusion between.",
                    "label": 0
                },
                {
                    "sent": "Natural language is a phenomenon and mathematics.",
                    "label": 0
                },
                {
                    "sent": "Mathematical logic is one thing, it offers certainties.",
                    "label": 0
                },
                {
                    "sent": "Ascential design feature of a natural language is that it offers uncertainty.",
                    "label": 0
                },
                {
                    "sent": "The possibility to say something new to use words differently.",
                    "label": 0
                },
                {
                    "sent": "So a corpus will show.",
                    "label": 0
                },
                {
                    "sent": "Both how words are used normally and regularly, and some of the amazing irregularities which which creative speakers engage in.",
                    "label": 0
                },
                {
                    "sent": "Guess which the dictionary maker has to.",
                    "label": 0
                },
                {
                    "sent": "Report the dictionary maker has to try to be as boring as possible.",
                    "label": 0
                },
                {
                    "sent": "Don't choose the exciting, inventive, creative example.",
                    "label": 0
                },
                {
                    "sent": "Choose the central typical normal example.",
                    "label": 0
                },
                {
                    "sent": "That's what people need.",
                    "label": 0
                },
                {
                    "sent": "And remember, the dictionaries are for people, not for linguists.",
                    "label": 1
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I think I've said that alright.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In the right way, yeah.",
                    "label": 0
                },
                {
                    "sent": "I OK new words Blogger.",
                    "label": 0
                },
                {
                    "sent": "Publishers, Every Dictionary dictionary publisher publishes with each new addition little tiny booklet of new words to excite the journalists.",
                    "label": 0
                },
                {
                    "sent": "This is this was from the Macmillan English Dictionary, a dictionary for foreign learners.",
                    "label": 1
                },
                {
                    "sent": "But the publishers of Macmillan well understood the virtues of publicity, so they included blogosphere Chav, an air kiss.",
                    "label": 0
                },
                {
                    "sent": "A career gap are somebody who's taken out time out a Chelsea tractor is one of those sort of tanks like American vehicles that people drive around, especially people who live in Chelsea somewhat rich district of London chiclet.",
                    "label": 0
                },
                {
                    "sent": "Chick lit is literature for young women to read on the beach.",
                    "label": 1
                },
                {
                    "sent": "A civil partnership is usually a homosexual marriage.",
                    "label": 0
                },
                {
                    "sent": "A designer baby, well, it's amazing what you can do with genetics.",
                    "label": 0
                },
                {
                    "sent": "These days, hissy fit.",
                    "label": 0
                },
                {
                    "sent": "I had such a hissy fit, so it's it's a very camp word.",
                    "label": 0
                },
                {
                    "sent": "Meaning a fit of bad temper, intelligent design.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we won't go there.",
                    "label": 0
                },
                {
                    "sent": "Among the glorious mistakes of dictionaries, here's one cited by David Crystal.",
                    "label": 0
                },
                {
                    "sent": "Be alert, be aware, awake.",
                    "label": 0
                },
                {
                    "sent": "The word dorbz got into American dictionaries for awhile or into one American dictionaries with the definition dentists density.",
                    "label": 0
                },
                {
                    "sent": "On closer examination, it turned out the door was actually copied from another dictionary where D stop or D big D or little D. Was defined as an abbreviation for density.",
                    "label": 1
                },
                {
                    "sent": "Loops.",
                    "label": 0
                },
                {
                    "sent": "In one of my own dictionaries.",
                    "label": 0
                },
                {
                    "sent": "Intercourse is distilled, defined as communication or dealings between individuals or groups.",
                    "label": 1
                },
                {
                    "sent": "In the 19th century, Harriet Martineau, respectable lady journalist from Birmingham.",
                    "label": 0
                },
                {
                    "sent": "Wrote.",
                    "label": 0
                },
                {
                    "sent": "But nowadays she spent most of her afternoons in affectionate intercourse with her friends.",
                    "label": 0
                },
                {
                    "sent": "You can't say that anymore.",
                    "label": 0
                },
                {
                    "sent": "But the new Oxford Dictionary of English sadly has got.",
                    "label": 0
                },
                {
                    "sent": "The sense is in the wrong order.",
                    "label": 0
                },
                {
                    "sent": "It should not really be just a cross reference, you don't.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You get the point.",
                    "label": 0
                },
                {
                    "sent": "I don't need to go on.",
                    "label": 0
                },
                {
                    "sent": "You have to decide how to hard go in technical fields.",
                    "label": 0
                },
                {
                    "sent": "Should you put in Strobl, Asstr, obolus tribulation or googly or a chav?",
                    "label": 0
                },
                {
                    "sent": "Native speakers who don't know these words rightly expect to find them in a dictionary.",
                    "label": 1
                },
                {
                    "sent": "On the other hand, a dictionary is not a term bank.",
                    "label": 0
                },
                {
                    "sent": "The terminology of the terminology of the Sciences in particular, but also technological activities is so vast.",
                    "label": 0
                },
                {
                    "sent": "Thank heavens for projects like Euro, Dick Autumn, which store.",
                    "label": 0
                },
                {
                    "sent": "Terminology of an extremely abstruse variety with stipulated definitions.",
                    "label": 0
                },
                {
                    "sent": "Get a.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "I've already.",
                    "label": 0
                },
                {
                    "sent": "Now I want to turn to definitions before I stop.",
                    "label": 0
                },
                {
                    "sent": "Sinclair said the text is a unique deployment of meaningful units.",
                    "label": 1
                },
                {
                    "sent": "The particular meaning is not adequately accounted for by any organized concatenation of the fixed meanings of each unit.",
                    "label": 1
                },
                {
                    "sent": "In other words, some aspects of textual meaning arise from the combination of choices elsewhere.",
                    "label": 0
                },
                {
                    "sent": "He says he refers to the semi prefabricated phrases where you've got the infuriating possibility of substituting.",
                    "label": 0
                },
                {
                    "sent": "One phrase for another Rosamund Moon has a wonderful example of.",
                    "label": 0
                },
                {
                    "sent": "Shaking in your shoes, meaning the same as quivering in your boots, and there are several other variations on the same idiom.",
                    "label": 0
                },
                {
                    "sent": "There's no stability.",
                    "label": 0
                },
                {
                    "sent": "There has to be some kind of movement like that which is shaking or shivering or quivering, and there has to be some kind of footwear.",
                    "label": 0
                },
                {
                    "sent": "So there's a.",
                    "label": 0
                },
                {
                    "sent": "There's an underlying generalization, but not a fixed, so fixed phrases aren't fixed.",
                    "label": 0
                },
                {
                    "sent": "I think that's the message I take from Rosamund Moon's books.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Writing definitions of technical terms is a particular problem for monolingual lexicographers.",
                    "label": 1
                },
                {
                    "sent": "In order to understand and explain a term, and I think definitions should explain not merely define.",
                    "label": 0
                },
                {
                    "sent": "You need to be a user of those terms.",
                    "label": 0
                },
                {
                    "sent": "Anybody who's ever played cricket knows how ludicrous American definite dictionary definitions of cricketing terms are.",
                    "label": 0
                },
                {
                    "sent": "No doubt the Americans feel the same about British definitions of baseball terms or American football, which they call football or hockey, which we call ice hockey.",
                    "label": 0
                },
                {
                    "sent": "You need to be a user, but users of the terms are particularly bad at defining them and explaining them.",
                    "label": 0
                },
                {
                    "sent": "So you need an interplay between the technical advisor, the scientist or the Sportsman.",
                    "label": 1
                },
                {
                    "sent": "And the lexicographer who has the acquired skill of explaining.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "Nude coats.",
                    "label": 0
                },
                {
                    "sent": "With this some word in some some words there is a clash between the scientific and technical community and people ordinary people when they say wait a minute or his eyes met charlottes for a minute or for a second.",
                    "label": 0
                },
                {
                    "sent": "Sorry wait a second or his eyes met Charlottes for a second.",
                    "label": 1
                },
                {
                    "sent": "Ordinary people do not mean.",
                    "label": 0
                },
                {
                    "sent": "Something defined in terms of the natural periodicity of the radiation of a cesium 133 Atom.",
                    "label": 1
                },
                {
                    "sent": "Which is the internationally agreed system?",
                    "label": 0
                },
                {
                    "sent": "Antonissen out definition agreed by a committee in Paris?",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I don't think this is very good definition.",
                    "label": 0
                },
                {
                    "sent": "It becausw it tries to define rather than explain what a arachnid do doing there.",
                    "label": 0
                },
                {
                    "sent": "What I'm saying mented what fused head and thorax well but but this is a.",
                    "label": 1
                },
                {
                    "sent": "This is about the best we could do by way of a compromise between scientific accuracy and saying in childish language's pilot, spiders are creepy crawlers with a legs.",
                    "label": 0
                },
                {
                    "sent": "An eight legged predatory arachnid with an UN segmented body.",
                    "label": 1
                },
                {
                    "sent": "But you can read it for yourselves.",
                    "label": 0
                },
                {
                    "sent": "Order around Ronnie class arachnida.",
                    "label": 0
                },
                {
                    "sent": "Some people want that information and they go to the dictionary for it.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This slide I'm sorry to say it hasn't come out very well.",
                    "label": 0
                },
                {
                    "sent": "It's an attempt to pick up from Adam Kilgarriff wonderful program.",
                    "label": 0
                },
                {
                    "sent": "Well, Adam, Pavel Rickley and other colleagues of mine.",
                    "label": 0
                },
                {
                    "sent": "Former colleagues of mine at the Masarik University in Bruno.",
                    "label": 0
                },
                {
                    "sent": "Developed a word sketch engine which shows.",
                    "label": 0
                },
                {
                    "sent": "The significant call occurs according to one statistical measure, mutual information, as she pointwise mutual information.",
                    "label": 0
                },
                {
                    "sent": "Of any word in the English language, and arranges them according to their syntagmatic or.",
                    "label": 0
                },
                {
                    "sent": "Colleague Ational relations so.",
                    "label": 0
                },
                {
                    "sent": "What do you do to spiders?",
                    "label": 0
                },
                {
                    "sent": "You catch them.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry it doesn't come, but you can see the bits in black.",
                    "label": 0
                },
                {
                    "sent": "You, you catch spiders.",
                    "label": 0
                },
                {
                    "sent": "You watch spiders.",
                    "label": 0
                },
                {
                    "sent": "Apparently you eat spiders.",
                    "label": 0
                },
                {
                    "sent": "I suppose you have to be a bird to do that.",
                    "label": 0
                },
                {
                    "sent": "And you find spiders OK significantly.",
                    "label": 0
                },
                {
                    "sent": "What does spiders do?",
                    "label": 0
                },
                {
                    "sent": "They scuttle, they crawl, they spin.",
                    "label": 0
                },
                {
                    "sent": "You know what they spin.",
                    "label": 0
                },
                {
                    "sent": "They spin webs, they climb, they buy it.",
                    "label": 0
                },
                {
                    "sent": "That's a surprise.",
                    "label": 0
                },
                {
                    "sent": "They feed on something, they wait.",
                    "label": 0
                },
                {
                    "sent": "They live somewhere they run and so on.",
                    "label": 0
                },
                {
                    "sent": "They are modified by they.",
                    "label": 0
                },
                {
                    "sent": "Oh, they are modified by expressions like trapdoor spiders, bird eating, spiders, good heavens.",
                    "label": 0
                },
                {
                    "sent": "Tarantula Spider a jumping spider.",
                    "label": 0
                },
                {
                    "sent": "As compared with a sedentary spider, this is pure statistics.",
                    "label": 0
                },
                {
                    "sent": "The computer has no idea what a spider is, it just knows which words collocate with it.",
                    "label": 0
                },
                {
                    "sent": "And the last one is very important becausw.",
                    "label": 0
                },
                {
                    "sent": "You can't see it down here, but it says and or.",
                    "label": 0
                },
                {
                    "sent": "It's rather like going to Amazon people who bought this book also bought people who talk about spiders also talk about scorpions, cockroaches, beetles, insects, flies.",
                    "label": 0
                },
                {
                    "sent": "This is not an evaluative judgment.",
                    "label": 0
                },
                {
                    "sent": "This is simply words found in the same text within a five word window, either side of spider.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So you can build a basis for a new kind of dictionary in entries.",
                    "label": 0
                },
                {
                    "sent": "It will tell you that there are many species of spiders, funnel webs, web building.",
                    "label": 1
                },
                {
                    "sent": "We've seen all that, some speed of species of spiders hunt prey.",
                    "label": 1
                },
                {
                    "sent": "Spiders bite, some species are poisonous.",
                    "label": 0
                },
                {
                    "sent": "They spin webs strong silk, they look that's waiting, especially spider ish word for.",
                    "label": 0
                },
                {
                    "sent": "Waiting.",
                    "label": 1
                },
                {
                    "sent": "They have 8 legs.",
                    "label": 0
                },
                {
                    "sent": "Their legs are thin and hairy.",
                    "label": 0
                },
                {
                    "sent": "They have eight eyes.",
                    "label": 0
                },
                {
                    "sent": "Have I got that right?",
                    "label": 0
                },
                {
                    "sent": "I thought it was six anyway.",
                    "label": 0
                },
                {
                    "sent": "All of the this corpus based profile is based on the statistical collocations in various corpora.",
                    "label": 0
                },
                {
                    "sent": "But it can be built up into an explanatory dictionary entry of a kind quite different from any member of the order Iraqna die.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "At the same time, lexicographers should be brief and I should be brief 'cause we're running out of time, so I'll move on Occam's razor.",
                    "label": 1
                },
                {
                    "sent": "Occam's Razor says.",
                    "label": 0
                },
                {
                    "sent": "Do not multiply entities unnecessarily.",
                    "label": 0
                },
                {
                    "sent": "Well, wonderful advice to lexicographers.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I've already said that so I can move.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Born with beyond the stage where there should be invented examples.",
                    "label": 1
                },
                {
                    "sent": "We, but in choosing examples, authenticity alone is not enough.",
                    "label": 0
                },
                {
                    "sent": "Examples need to be chosen for their naturalness, their normalness, and every young lexicographer that I've ever trained has had the problem.",
                    "label": 1
                },
                {
                    "sent": "Not everyone but most of 'em have the problem of seeing, oh, there's an interesting citation who look.",
                    "label": 0
                },
                {
                    "sent": "You can even use this word like that and they choose boundary cases to exemplify the boundaries of word meaning and word use.",
                    "label": 0
                },
                {
                    "sent": "Human beings are, I think.",
                    "label": 0
                },
                {
                    "sent": "Biologically structured to ask to ask immediately questions about boundary cases.",
                    "label": 0
                },
                {
                    "sent": "The job of the lexicographer is to describe the central and typical cases before moving on.",
                    "label": 0
                },
                {
                    "sent": "If time and space allows to boundary cases.",
                    "label": 1
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You need to get on with it.",
                    "label": 1
                },
                {
                    "sent": "Agonizing is often counterproductive.",
                    "label": 0
                },
                {
                    "sent": "Often the 1st first form of words that somebody writes down as the best.",
                    "label": 0
                },
                {
                    "sent": "They then agonize and gradually make the entry less and less satisfactory and less and less comprehensible trying to cover all eventualities.",
                    "label": 0
                },
                {
                    "sent": "So you need to set up a system in your dictionary project where compilers where the compiler is free to do his or her honest best and move on and the system says somebody else will check the cheat.",
                    "label": 1
                },
                {
                    "sent": "The editor in chief perhaps will check and ensure that obvious errors and accidental infelicities are corrected.",
                    "label": 0
                },
                {
                    "sent": "Lexicography, lexicography is a team game.",
                    "label": 0
                },
                {
                    "sent": "The team should have a structure lexicographers read and check each other's work.",
                    "label": 1
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, I'm almost out of time, but.",
                    "label": 0
                },
                {
                    "sent": "The question arises in what medium will your monolingual dictionary be published?",
                    "label": 0
                },
                {
                    "sent": "I asked the question, I have no.",
                    "label": 0
                },
                {
                    "sent": "Answer.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And what will be the message?",
                    "label": 0
                },
                {
                    "sent": "I do have some suggestions here we should summarize as lexicographers typify, and show interfaces with other sources of information, especially if if we are working online.",
                    "label": 0
                },
                {
                    "sent": "We should as the great John Wilkins Amanta whom Leibnitz was deeply indebted, observed in 1668.",
                    "label": 0
                },
                {
                    "sent": "Wilkins was in amongst Wilkins in Wilkins, amongst other things, invented Roget's Thesaurus 200 years before Roger.",
                    "label": 0
                },
                {
                    "sent": "Just as the preliminary to inventing a new language which knew universal language.",
                    "label": 0
                },
                {
                    "sent": "He's a man of extraordinary energy.",
                    "label": 0
                },
                {
                    "sent": "Umberto Eco says.",
                    "label": 0
                },
                {
                    "sent": "In the search for the perfect language that Wilkins was also reaching was also reaching for the modern concept of hypertext.",
                    "label": 0
                },
                {
                    "sent": "So not only did he invent Rogets Thesaurus, but he also pointed out that dogs bark, Wolves howl, Lions roar.",
                    "label": 1
                },
                {
                    "sent": "He didn't actually say cats Meow, but I put that in.",
                    "label": 0
                },
                {
                    "sent": "There is my contribution to Wilkins is great work.",
                    "label": 0
                },
                {
                    "sent": "The message might be in multimedia format that belongs under medium.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Lexicographers are not linguists in my opinion.",
                    "label": 1
                },
                {
                    "sent": "In fact, linguistics.",
                    "label": 0
                },
                {
                    "sent": "I wrote this.",
                    "label": 0
                },
                {
                    "sent": "I wrote this slide some time ago.",
                    "label": 0
                },
                {
                    "sent": "I think it's less true now.",
                    "label": 1
                },
                {
                    "sent": "Then it was linguistics used to be fatal for good lexicography, and this is because linguists C language on that axis.",
                    "label": 0
                },
                {
                    "sent": "Some lexicographers see it on that axis, and there's the best lexicographers I've ever trained.",
                    "label": 0
                },
                {
                    "sent": "Have not been linguists there people.",
                    "label": 1
                },
                {
                    "sent": "Some of them have had qualifications in literature.",
                    "label": 0
                },
                {
                    "sent": "You would need to have read the literature of your language if you're going to be a lexicographer, but also botanists.",
                    "label": 0
                },
                {
                    "sent": "Very good you see the point.",
                    "label": 0
                },
                {
                    "sent": "They make fine distinctions and they know they know how to tell one plant from another is not far from plans to words.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And finally.",
                    "label": 0
                },
                {
                    "sent": "We need to make a distinction between evidence and interpretation.",
                    "label": 0
                },
                {
                    "sent": "So a corpus shows word usage.",
                    "label": 1
                },
                {
                    "sent": "Other researchers use.",
                    "label": 0
                },
                {
                    "sent": "It is needed for terminology, unusual words, names, word histories, attitudes to correctness, but that's all evidence.",
                    "label": 1
                },
                {
                    "sent": "Collecting the evidence is important.",
                    "label": 0
                },
                {
                    "sent": "Then comes the business of interpreting the evidence and what I've been trying to say here is definitions should explain, not merely define.",
                    "label": 0
                },
                {
                    "sent": "That is, that the public expect Authorative authoritative pronouncements.",
                    "label": 0
                },
                {
                    "sent": "The fatal trap for a lexicographer and goodness knows, I've seen friends and colleagues fall into.",
                    "label": 0
                },
                {
                    "sent": "It is believing that because you're the editor of an Oxford dictionary, you must be somehow important.",
                    "label": 1
                },
                {
                    "sent": "No, you're a person of no importance at all.",
                    "label": 0
                },
                {
                    "sent": "You should just transmit what's going on in society, social attitudes to language, as well as meanings.",
                    "label": 1
                },
                {
                    "sent": "So authoritative pronouncements pronouncements must be based on evidence.",
                    "label": 0
                },
                {
                    "sent": "Public attitudes should be reported, not swept under the carpet.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "But they must be reported and evaluated.",
                    "label": 0
                },
                {
                    "sent": "The task is to report all central normal uses and meanings, because if you try to cover all the possibilities of use of any content word in the language, there is a danger that the language will defeat you.",
                    "label": 1
                },
                {
                    "sent": "Just because word, meaning and uses infinitely flexible what you're reaching for is the central norm that.",
                    "label": 0
                },
                {
                    "sent": "Speakers of your language rely on when they speak to each other, not the wild eccentricities of imaginative writers and linguists.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}