{
    "id": "3yuf4jzsfpgeidcrudw2y6ozw4zs6o4p",
    "title": "Cognition-Guided Surgery - A New Paradigm",
    "info": {
        "author": [
            "Beat Müller, Heidelberg University Hospital"
        ],
        "published": "July 31, 2016",
        "recorded": "July 2016",
        "category": [
            "Top->Computer Science",
            "Top->Technology"
        ]
    },
    "url": "http://videolectures.net/interACT2016_mueller_guided_surgery/",
    "segmentation": [
        [
            "I'm very honored to be here in this prestigious community to talk talk about a search as well.",
            "I've already heard I'm attending surgeon.",
            "And director of minimally invasive surgery at University of Heidelberg.",
            "And I have to talk about.",
            "Quite specific topic which is untypical for surgeons not becausw.",
            "They do not act cognition guided.",
            "But becausw, they most often don't trust computers when they have to make decisions.",
            "And this is what's meant here that we take the computer to help us.",
            "To do better cognition guided surgery, we believe in this paradigm.",
            "In this new paradigm.",
            "Anne.",
            "But why?"
        ],
        [
            "Because others already made very good experience with this paradigm.",
            "As you all know, in the automobile industry, this paradigm has already.",
            "Com.",
            "Present.",
            "We all have cars at home with the intelligent equipment and soon you can buy this Mercedes which is driving autonomously.",
            "But"
        ],
        [
            "What about surgery for luck?",
            "It doesn't look like this in hours today.",
            "If we are lucky it it looks."
        ],
        [
            "Like this we have several screens.",
            "We have robots.",
            "We have quite good medical technology."
        ],
        [
            "Such as sealing devices which can cut and help us to perform surgery quicker, safer.",
            "And without bleeding, so you can also become searching if you can see blood today thanks to medical technology."
        ],
        [
            "We also do have robots to be honest, not real robots.",
            "We have Tele manipulators which do this which do what the search is telling them to do."
        ],
        [
            "Which would help the search to be more precise by endowrist instruments and downscaling functions and trim or filters.",
            "So we think that we become more precise, more safe in surgery.",
            "Thanks to this device."
        ],
        [
            "And we do have intra operative imaging we can perform CT scans in UR which tell us something about the inside of the patient and which helps us in a sense to navigate interpretively I will show you a case."
        ],
        [
            "Here a 60, two or three years old patient with hepatocellular carcinoma.",
            "You can see it here in the liver which has to be respected.",
            "And if you do navigate it laparoscopically, livery, surgery, liver surgery, then?"
        ],
        [
            "It looks like this in our war.",
            "Because of all this stuff inside, you are all these instruments.",
            "All these devices you can't hardly see the surgeon anymore.",
            "So because this system is not really interact to each other, we have to do a lot of.",
            "Tricks that we can perform.",
            "Navigated liver surgery.",
            "Here you can see the tumor.",
            "We took an Inter operative CT scan and now we bring the picture from the interpretive situation together with the preoperative situation which were surface registration and then we can do an interactive fluoroscopy which shows us the instrument of the surgeon and by this we can do navigate tree section of this tumor which you can see here.",
            "So this is far away from what you know by car driving far away from navigation.",
            "In your car.",
            "So this was our motivation to come there.",
            "Because we know it from the car we would like to have it in the OR because we believe that we can be more safe in the treatment of our patient."
        ],
        [
            "Here's a summary of what we have today.",
            "We have good instruments.",
            "We have good imaging.",
            "We have robots in a sense.",
            "We have also a kind of navigation.",
            "If you have the space in our to do this and we have some integrations with the modern integrated operation, operation rooms, operating rooms, but we do not have cognition guidance.",
            "So we do not have computers who bring all the knowledge we have medical knowledge and knowledge about the patients together and help us with our decisions to do better decisions."
        ],
        [
            "In the treatment.",
            "Why is this important?",
            "Becausw surgeons today.",
            "All physicians today have to know a lot factual knowledge.",
            "More than years ago and every years we have thousands of publications which increase this knowledge and we have to know a lot about the patient much more than years ago because we are able to do new image images and we are able to do new blue blood tests and gain order informations about patients.",
            "Medicine has become much more complex than few years before.",
            "And in this."
        ],
        [
            "Situation.",
            "We would be happy to have a think a computer based integrated system, a system which bring all the systems.",
            "I have shown you in there or together.",
            "But also a system which is able to perceive information about the patient about the interpretive situation to interpret it.",
            "Based on a lowered knowledge based and to perform perform a context sensitive sensitive action, so the action we need in this.",
            "Moment."
        ],
        [
            "This system would be able to bring all these things that have shown you together to integrate them that we do not need that much space.",
            "As I have shown you."
        ],
        [
            "And if we are able to represent the information we have in medicine, the way that the computer can understand it.",
            "Then"
        ],
        [
            "We can do the recognition of the patient in this situation.",
            "Can interpret this specific situation based on this knowledge based and then have a concrete action.",
            "I will show you an example."
        ],
        [
            "Liver surgery another example in elivar surgery.",
            "All of us who are performing liver surgery already made the experience that we operated on a patient with the liver cancer.",
            "The operation went very well and the patient was Death 2 weeks later.",
            "Why?",
            "You cannot survive.",
            "When you not, you do not have enough.",
            "Liver pain, but sometimes we do not know how much liver part came out.",
            "You need to survive.",
            "And if we respect the two more and we take out too much liver, Parker parent, you will die and we didn't know it before we wanted to help the patient.",
            "But you brought it to death.",
            "Why is this true?",
            "Becausw not every liver part came as the same as the other.",
            "It there is fatty liver parenchyma or cirrhotic liver pain, and you need more.",
            "You cannot take out the half of the liver.",
            "To heal you from the tumor.",
            "Without you bring to death.",
            "So if we had a system who knows how much River Park, in this specific patient can be removed.",
            "Be cause.",
            "It has all the information from studies.",
            "All the information about the patients images, histopathologic information about the patients surgical data.",
            "About the operation strategies.",
            "And can compare the specific patient with this information.",
            "Then maybe the system can advise us what to do.",
            "And this is the specific action.",
            "In this situation.",
            "It can advise us to perform surgery to respect you more back.",
            "It can also advise us.",
            "To do not operate the patient to some to do something else, because the system maybe knows it better.",
            "That this kind of surgery is too much for the patient.",
            "But for this we need to know all what we know the world.",
            "And we need to base our decision on what is known about this surgery or about all the experience we had.",
            "We know that one single person can remember about 7 experiences when he it is he is taking decisions.",
            "Such a system system can base decision on thousands of information and this is the potential of such a system."
        ],
        [
            "I show you 1X among other example, which we have already developed with our colleagues at the cause.",
            "We're Institute of Technology.",
            "Here you can see a Gallbladder.",
            "And he had a cystic duct at this system.",
            "Is that intelligent that he it recognizes the interpretive situation and it can see that here is decision Sister?",
            "And it knows that this system cannot be used until this duct is located because it recognizes this danger.",
            "It indicates the risk structure, so this is one form of cognition.",
            "Guided assistance of such a system in the Inter operative situation."
        ],
        [
            "And another example is intelligent camera guidance robot.",
            "Let me show.",
            "It's too much out, So what you can see here is my colleague, Doctor Wagner, who is operating here in a Phantom.",
            "But you also can see here that here is a camera guidance robot who is showing him what he wants to see.",
            "And he it is.",
            "System is not only following the instruments or he is not, I tracked.",
            "This system has learned to guide the camera.",
            "According to his desire.",
            "Over several steps, and we know that by every time is performing camera guidance, it becomes better, so this is a learning cognition, guided camera guide and robot."
        ],
        [
            "If you go in this direction, maybe we will come to the vision of Satava.",
            "He had this idea already in the year 2006 was a member of the US Army and he had the idea.",
            "If we go with com cognition guided surgery, we don't need the search and anymore close to the patient which is made might be important in a war.",
            "So you can see here robots and computer based systems are performing the right therapy to the patient.",
            "Without danger for Searcher, such as outside.",
            "In a war area, so this was his idea and in the lead in in in a sense we are going for this idea but outside of war times.",
            "It's quite impressing, but.",
            "Beside all what I've told you."
        ],
        [
            "Must not forget in the end.",
            "The patient is the most important person in the game.",
            "And maybe this is also the reason.",
            "Why are why we are not that far as they are in the automobile industry.",
            "Thank you very much for your attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm very honored to be here in this prestigious community to talk talk about a search as well.",
                    "label": 0
                },
                {
                    "sent": "I've already heard I'm attending surgeon.",
                    "label": 0
                },
                {
                    "sent": "And director of minimally invasive surgery at University of Heidelberg.",
                    "label": 0
                },
                {
                    "sent": "And I have to talk about.",
                    "label": 0
                },
                {
                    "sent": "Quite specific topic which is untypical for surgeons not becausw.",
                    "label": 0
                },
                {
                    "sent": "They do not act cognition guided.",
                    "label": 0
                },
                {
                    "sent": "But becausw, they most often don't trust computers when they have to make decisions.",
                    "label": 0
                },
                {
                    "sent": "And this is what's meant here that we take the computer to help us.",
                    "label": 0
                },
                {
                    "sent": "To do better cognition guided surgery, we believe in this paradigm.",
                    "label": 0
                },
                {
                    "sent": "In this new paradigm.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "But why?",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Because others already made very good experience with this paradigm.",
                    "label": 0
                },
                {
                    "sent": "As you all know, in the automobile industry, this paradigm has already.",
                    "label": 0
                },
                {
                    "sent": "Com.",
                    "label": 0
                },
                {
                    "sent": "Present.",
                    "label": 0
                },
                {
                    "sent": "We all have cars at home with the intelligent equipment and soon you can buy this Mercedes which is driving autonomously.",
                    "label": 0
                },
                {
                    "sent": "But",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What about surgery for luck?",
                    "label": 0
                },
                {
                    "sent": "It doesn't look like this in hours today.",
                    "label": 0
                },
                {
                    "sent": "If we are lucky it it looks.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Like this we have several screens.",
                    "label": 0
                },
                {
                    "sent": "We have robots.",
                    "label": 0
                },
                {
                    "sent": "We have quite good medical technology.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Such as sealing devices which can cut and help us to perform surgery quicker, safer.",
                    "label": 0
                },
                {
                    "sent": "And without bleeding, so you can also become searching if you can see blood today thanks to medical technology.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We also do have robots to be honest, not real robots.",
                    "label": 0
                },
                {
                    "sent": "We have Tele manipulators which do this which do what the search is telling them to do.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which would help the search to be more precise by endowrist instruments and downscaling functions and trim or filters.",
                    "label": 0
                },
                {
                    "sent": "So we think that we become more precise, more safe in surgery.",
                    "label": 0
                },
                {
                    "sent": "Thanks to this device.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we do have intra operative imaging we can perform CT scans in UR which tell us something about the inside of the patient and which helps us in a sense to navigate interpretively I will show you a case.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here a 60, two or three years old patient with hepatocellular carcinoma.",
                    "label": 1
                },
                {
                    "sent": "You can see it here in the liver which has to be respected.",
                    "label": 0
                },
                {
                    "sent": "And if you do navigate it laparoscopically, livery, surgery, liver surgery, then?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It looks like this in our war.",
                    "label": 0
                },
                {
                    "sent": "Because of all this stuff inside, you are all these instruments.",
                    "label": 0
                },
                {
                    "sent": "All these devices you can't hardly see the surgeon anymore.",
                    "label": 0
                },
                {
                    "sent": "So because this system is not really interact to each other, we have to do a lot of.",
                    "label": 0
                },
                {
                    "sent": "Tricks that we can perform.",
                    "label": 0
                },
                {
                    "sent": "Navigated liver surgery.",
                    "label": 0
                },
                {
                    "sent": "Here you can see the tumor.",
                    "label": 0
                },
                {
                    "sent": "We took an Inter operative CT scan and now we bring the picture from the interpretive situation together with the preoperative situation which were surface registration and then we can do an interactive fluoroscopy which shows us the instrument of the surgeon and by this we can do navigate tree section of this tumor which you can see here.",
                    "label": 0
                },
                {
                    "sent": "So this is far away from what you know by car driving far away from navigation.",
                    "label": 0
                },
                {
                    "sent": "In your car.",
                    "label": 0
                },
                {
                    "sent": "So this was our motivation to come there.",
                    "label": 0
                },
                {
                    "sent": "Because we know it from the car we would like to have it in the OR because we believe that we can be more safe in the treatment of our patient.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here's a summary of what we have today.",
                    "label": 0
                },
                {
                    "sent": "We have good instruments.",
                    "label": 0
                },
                {
                    "sent": "We have good imaging.",
                    "label": 0
                },
                {
                    "sent": "We have robots in a sense.",
                    "label": 0
                },
                {
                    "sent": "We have also a kind of navigation.",
                    "label": 0
                },
                {
                    "sent": "If you have the space in our to do this and we have some integrations with the modern integrated operation, operation rooms, operating rooms, but we do not have cognition guidance.",
                    "label": 0
                },
                {
                    "sent": "So we do not have computers who bring all the knowledge we have medical knowledge and knowledge about the patients together and help us with our decisions to do better decisions.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the treatment.",
                    "label": 0
                },
                {
                    "sent": "Why is this important?",
                    "label": 0
                },
                {
                    "sent": "Becausw surgeons today.",
                    "label": 0
                },
                {
                    "sent": "All physicians today have to know a lot factual knowledge.",
                    "label": 0
                },
                {
                    "sent": "More than years ago and every years we have thousands of publications which increase this knowledge and we have to know a lot about the patient much more than years ago because we are able to do new image images and we are able to do new blue blood tests and gain order informations about patients.",
                    "label": 0
                },
                {
                    "sent": "Medicine has become much more complex than few years before.",
                    "label": 0
                },
                {
                    "sent": "And in this.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Situation.",
                    "label": 0
                },
                {
                    "sent": "We would be happy to have a think a computer based integrated system, a system which bring all the systems.",
                    "label": 0
                },
                {
                    "sent": "I have shown you in there or together.",
                    "label": 0
                },
                {
                    "sent": "But also a system which is able to perceive information about the patient about the interpretive situation to interpret it.",
                    "label": 0
                },
                {
                    "sent": "Based on a lowered knowledge based and to perform perform a context sensitive sensitive action, so the action we need in this.",
                    "label": 1
                },
                {
                    "sent": "Moment.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This system would be able to bring all these things that have shown you together to integrate them that we do not need that much space.",
                    "label": 0
                },
                {
                    "sent": "As I have shown you.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And if we are able to represent the information we have in medicine, the way that the computer can understand it.",
                    "label": 0
                },
                {
                    "sent": "Then",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can do the recognition of the patient in this situation.",
                    "label": 0
                },
                {
                    "sent": "Can interpret this specific situation based on this knowledge based and then have a concrete action.",
                    "label": 0
                },
                {
                    "sent": "I will show you an example.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Liver surgery another example in elivar surgery.",
                    "label": 1
                },
                {
                    "sent": "All of us who are performing liver surgery already made the experience that we operated on a patient with the liver cancer.",
                    "label": 0
                },
                {
                    "sent": "The operation went very well and the patient was Death 2 weeks later.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "You cannot survive.",
                    "label": 0
                },
                {
                    "sent": "When you not, you do not have enough.",
                    "label": 0
                },
                {
                    "sent": "Liver pain, but sometimes we do not know how much liver part came out.",
                    "label": 0
                },
                {
                    "sent": "You need to survive.",
                    "label": 0
                },
                {
                    "sent": "And if we respect the two more and we take out too much liver, Parker parent, you will die and we didn't know it before we wanted to help the patient.",
                    "label": 0
                },
                {
                    "sent": "But you brought it to death.",
                    "label": 0
                },
                {
                    "sent": "Why is this true?",
                    "label": 0
                },
                {
                    "sent": "Becausw not every liver part came as the same as the other.",
                    "label": 0
                },
                {
                    "sent": "It there is fatty liver parenchyma or cirrhotic liver pain, and you need more.",
                    "label": 0
                },
                {
                    "sent": "You cannot take out the half of the liver.",
                    "label": 0
                },
                {
                    "sent": "To heal you from the tumor.",
                    "label": 0
                },
                {
                    "sent": "Without you bring to death.",
                    "label": 0
                },
                {
                    "sent": "So if we had a system who knows how much River Park, in this specific patient can be removed.",
                    "label": 0
                },
                {
                    "sent": "Be cause.",
                    "label": 0
                },
                {
                    "sent": "It has all the information from studies.",
                    "label": 0
                },
                {
                    "sent": "All the information about the patients images, histopathologic information about the patients surgical data.",
                    "label": 0
                },
                {
                    "sent": "About the operation strategies.",
                    "label": 0
                },
                {
                    "sent": "And can compare the specific patient with this information.",
                    "label": 0
                },
                {
                    "sent": "Then maybe the system can advise us what to do.",
                    "label": 0
                },
                {
                    "sent": "And this is the specific action.",
                    "label": 0
                },
                {
                    "sent": "In this situation.",
                    "label": 0
                },
                {
                    "sent": "It can advise us to perform surgery to respect you more back.",
                    "label": 0
                },
                {
                    "sent": "It can also advise us.",
                    "label": 0
                },
                {
                    "sent": "To do not operate the patient to some to do something else, because the system maybe knows it better.",
                    "label": 0
                },
                {
                    "sent": "That this kind of surgery is too much for the patient.",
                    "label": 0
                },
                {
                    "sent": "But for this we need to know all what we know the world.",
                    "label": 0
                },
                {
                    "sent": "And we need to base our decision on what is known about this surgery or about all the experience we had.",
                    "label": 0
                },
                {
                    "sent": "We know that one single person can remember about 7 experiences when he it is he is taking decisions.",
                    "label": 0
                },
                {
                    "sent": "Such a system system can base decision on thousands of information and this is the potential of such a system.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I show you 1X among other example, which we have already developed with our colleagues at the cause.",
                    "label": 0
                },
                {
                    "sent": "We're Institute of Technology.",
                    "label": 0
                },
                {
                    "sent": "Here you can see a Gallbladder.",
                    "label": 0
                },
                {
                    "sent": "And he had a cystic duct at this system.",
                    "label": 0
                },
                {
                    "sent": "Is that intelligent that he it recognizes the interpretive situation and it can see that here is decision Sister?",
                    "label": 0
                },
                {
                    "sent": "And it knows that this system cannot be used until this duct is located because it recognizes this danger.",
                    "label": 0
                },
                {
                    "sent": "It indicates the risk structure, so this is one form of cognition.",
                    "label": 0
                },
                {
                    "sent": "Guided assistance of such a system in the Inter operative situation.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And another example is intelligent camera guidance robot.",
                    "label": 0
                },
                {
                    "sent": "Let me show.",
                    "label": 0
                },
                {
                    "sent": "It's too much out, So what you can see here is my colleague, Doctor Wagner, who is operating here in a Phantom.",
                    "label": 0
                },
                {
                    "sent": "But you also can see here that here is a camera guidance robot who is showing him what he wants to see.",
                    "label": 0
                },
                {
                    "sent": "And he it is.",
                    "label": 0
                },
                {
                    "sent": "System is not only following the instruments or he is not, I tracked.",
                    "label": 0
                },
                {
                    "sent": "This system has learned to guide the camera.",
                    "label": 0
                },
                {
                    "sent": "According to his desire.",
                    "label": 0
                },
                {
                    "sent": "Over several steps, and we know that by every time is performing camera guidance, it becomes better, so this is a learning cognition, guided camera guide and robot.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you go in this direction, maybe we will come to the vision of Satava.",
                    "label": 0
                },
                {
                    "sent": "He had this idea already in the year 2006 was a member of the US Army and he had the idea.",
                    "label": 0
                },
                {
                    "sent": "If we go with com cognition guided surgery, we don't need the search and anymore close to the patient which is made might be important in a war.",
                    "label": 0
                },
                {
                    "sent": "So you can see here robots and computer based systems are performing the right therapy to the patient.",
                    "label": 0
                },
                {
                    "sent": "Without danger for Searcher, such as outside.",
                    "label": 0
                },
                {
                    "sent": "In a war area, so this was his idea and in the lead in in in a sense we are going for this idea but outside of war times.",
                    "label": 0
                },
                {
                    "sent": "It's quite impressing, but.",
                    "label": 0
                },
                {
                    "sent": "Beside all what I've told you.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Must not forget in the end.",
                    "label": 1
                },
                {
                    "sent": "The patient is the most important person in the game.",
                    "label": 0
                },
                {
                    "sent": "And maybe this is also the reason.",
                    "label": 0
                },
                {
                    "sent": "Why are why we are not that far as they are in the automobile industry.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much for your attention.",
                    "label": 0
                }
            ]
        }
    }
}