{
    "id": "3zztwcobzf2vqttqcjid4gqdooxbtkfh",
    "title": "MultimediaN (Dutch Initiative) - Part 1",
    "info": {
        "author": [
            "Martin Kersten, Centrum Wiskunde & Informatica (CWI)"
        ],
        "published": "Nov. 21, 2007",
        "recorded": "October 2007",
        "category": [
            "Top->Computer Science->Information Retrieval->Multimedia Retrieval"
        ]
    },
    "url": "http://videolectures.net/nim07_kersten_m/",
    "segmentation": [
        [
            "From the Netherlands, I might take us to your own fuss and we also are pleased to announce that we have taken long or representative for the Ministry of Education and Research.",
            "Those according to see, is sitting over there in the corridor, so I think there are enough representatives here for Netherlands to introduce multimedia.",
            "Of course you're all tired after such a lunch.",
            "So I think the best way to start is to relax a little bit and I'll first show a little video.",
            "More and more.",
            "Is offered to us through web sites, but there is a big chance they miss out on a lot of context like the connection between objects, stories about their creators, the history of their Genesis and more.",
            "Yet this kind of information is very much available simply in digital form in lots of digital databases.",
            "Search engine by multimedia connects these digital databases and provides a context in our cultural heritage.",
            "Unlike the billions of static websites, is 1 supports an easy and never ending tour through the world of cultural heritage, this site demonstrates the true semantic web search experience based on ethical.",
            "Knowledge.",
            "Take it to your in person dining and just in time to enjoy.",
            "By using semantic web technology, the partners at this cultural worktable find solutions to interconnect information sources in a smart way and build a new infrastructure.",
            "Scientists working on effective projects are developing new numbers that can contribute to better infrastructure for digital collection methods.",
            "So.",
            "Everybody is asleep or awake again.",
            "I think it was the nice dishes for for this meeting.",
            "You're going to percent in multimedia."
        ],
        [
            "The median is in the.",
            "Ongoing project.",
            "It's actually Orient or projects in the middle of its lifetime.",
            "This project started already in 2002 with preparatory actions.",
            "Building a program started officially in 2004.",
            "Continue to 2009 and what will come after it.",
            "We don't know yet.",
            "So what I'm going to report here in this half hour is not what we plan to do with what we have done so far and what are the perspectives on the future."
        ],
        [
            "We see them.",
            "The construction.",
            "This fund, founded by seven partners mostly from the Academia.",
            "It's currently involves over 120 people full time.",
            "We're spending about 30 million euros from the Netherlands government.",
            "And we have 39 affiliated business partners and most of them don't get any penny of subsidy.",
            "They are there to pick up the results as we produce them in the project.",
            "And you want Bill later to talk?",
            "Tell how we did it.",
            "How we convince companies to join our quest to improve technology.",
            "I will focus."
        ],
        [
            "Will technology itself.",
            "Multimedium from the Outset's was set up as an strongly guided national project.",
            "We went around and we selected the key research groups in lens, move them together under one umbrella.",
            "Implemented some strong and directive management in order to make some progress in multimedia technology.",
            "And to succeed here.",
            "We were keen to pick all the people necessary to make an impact with."
        ],
        [
            "Things that we took people who were experts.",
            "Enroll multimedia data analysis video, speech, you name it.",
            "Often scientists who are working on a particular small collection of images to these sites and to analyze them for some interesting features.",
            "These scientists alone are not enough.",
            "We immediately."
        ],
        [
            "Each.",
            "Recruited people who are experts in conveying information on the screen.",
            "Human computer interaction experts were drawn on the team.",
            "Both the scientists on the multimedia technology and human Computer Interaction Group is insufficient because, as we've seen this morning, scale will kill you in the end."
        ],
        [
            "So we also include database experts.",
            "Database experts who had a proven track record in unlocking the potentials of multimedia information retrieval on databases and could handle the scaling issues which comes about.",
            "And last but not least."
        ],
        [
            "We included people.",
            "From knowledge engineering, people hold you with linguistics, ontologies tessari.",
            "And together they were drawn into a project with the ultimate goal to D. Google the information search problem.",
            "It's good to remember that each of these four groups were necessary to make any impact whatsoever.",
            "And it was the project's aim to fuse them to drive them.",
            "And to challenge them to build what we could call the Golden Demos.",
            "No research or research group was allowed to work in isolation.",
            "The end result should have been something should be shown working.",
            "And perhaps even packaged by little PR video.",
            "And you saw one of the PR videos just."
        ],
        [
            "Minutes ago so in this coming 10 minutes I will show you.",
            "A few of the search engine experiments going on in the project and I will finalize with another video and some challenge.",
            "The first one was the Semantic Web browser."
        ],
        [
            "The video you just saw.",
            "That was scripted by researchers.",
            "Built by and or constructed by professional filmer and it was spending research money on film industry which was not an activity I normally do.",
            "If I have money.",
            "I've spent on research and not on a move."
        ],
        [
            "However.",
            "This video was the final result of a three year activity to build a new search engine technology based on semantic web issues.",
            "It went so far that the website which is behind this service video won the W. 3C Semantic Web Challenge last year.",
            "What makes this browser so interesting?",
            "And I can demonstrate it?"
        ],
        [
            "This is the browser which you can find yourself and many of you have here.",
            "The laptop in your hand so you can type in equal to multimedia dot.",
            "It come to win in what looks a traditional search engine.",
            "But if you're going to add there some keywords and I have put here in the top football Board of keyboards because so I get information in quite different forms.",
            "I get not a long list of hits.",
            "No, I get objects organized by structure by content.",
            "So over the top file we have works by Picasso as mentioned in the title.",
            "The second one works.",
            "Matching material is kind of strange.",
            "Oops.",
            "Should have brought myself a mouse because all also seems to be some sort of material from which these little.",
            "Fetish issues have been constructed and if you browse further on in the page.",
            "Yes, you find to of course works of Picasso himself, so this is already one big difference.",
            "This is not a long list of pages which are ranked by some ranking scheme.",
            "Now here is the result being organized an clustered by semantic issue.",
            "This is much more informative than 60 lines of.",
            "Please click on the next page at the bottom.",
            "You also find a time scale.",
            "Which enumerates according to the database.",
            "What were the coworkers off?",
            "Because when that time and I can click immediately on one of these issues to see what word appears or competitors of Picasso doing.",
            "I'll just grab an arbitrary one, did I?",
            "OK, sorry I assumed in probably on George Brock I should have gotten issue picture here.",
            "This preprocessor you should try out the cause in the world of browsing on the web is really state of the art in novel.",
            "It organizes the data by by his semantics.",
            "For this they had to collect a number of cultural.",
            "Databases.",
            "Gets to take Sauries, integrate them and put them in a general framework, and this framework is now sufficiently powerful that we can expand through the Netherlands.",
            "This kind of technology.",
            "Oops."
        ],
        [
            "The second example.",
            "Is on the borderline of search in linguistics.",
            "If you go into the web, you can identify words of interested.",
            "This is an example of the mode search engine where you are going after or occurrences of specific words in blocks, journals, videos."
        ],
        [
            "Anything you can find.",
            "And you can do some statistics, for example here we see the statistic of the word excited being tracked in pages Anna new cost over a long period, and it was a lot of excitement at a particular area.",
            "There the 7th, 16th of July.",
            "It turns out that any news was broadcast.",
            "Everybody was excited because new Harry Potter was coming about.",
            "So what we see here all kind of searching, searching the mode of the Internet by looking for the occurrence of terms and concepts and exploit that information."
        ],
        [
            "You can also add the same with all kinds of funny concepts like Katrina.",
            "Katrina and looking at how people are talking about it.",
            "So maybe no Celtic.",
            "Or maybe crazy pissed off awake.",
            "You can count the number of occurrences of these search these little seconds on the web and you can get a feeling of the mode.",
            "How is the community reacting to Katrina?",
            "And as you can see in the end?",
            "People could vote.",
            "Yes, we have seen the story now so we better stop.",
            "Producing more information on Katrina.",
            "This is the angle of research which goes way beyond what we normally do in a Google setting."
        ],
        [
            "Third one.",
            "Already for quite some time we have been playing around with large collections of video and do a content based analysis for keyword and concepts.",
            "We have now reached the point that we can handle hundreds of video hours, analyzed them with some cluster computers, derived concepts and make them accessible through good three day visualization techniques."
        ],
        [
            "I have here 2 screenshot images.",
            "On one hand, you can cluster images by some properties or any other approaches that we have built in browser where the videos are being projected on a globe.",
            "Where you can turn the globe on the world Central Line 2 for example, trace the scenes in the video and the vertical bar.",
            "We detect.",
            "Closely related scenes in other videos.",
            "For time I will not show this video, but if you want afterwards during coffee break, I can show you what's happening there.",
            "So the third example.",
            "So we had not a semantic web.",
            "We had simple IR based on linguistic analysis.",
            "And we had an example of how to deal with the masses of video itself."
        ],
        [
            "The 4th one.",
            "Is somewhere an answer to the last talk of this morning.",
            "On fast.",
            "How are we going to scale up?",
            "Video or multimedia indexing to world scale?",
            "Should we invest in an enormous computer center somewhere?",
            "Should we grab all the videos and analyze themselves?",
            "Well, the multimedia and we are exploring a different round which is known as three people 364 and I will show you the example of the video itself because it's a good registration.",
            "How we are able to convince our scientists also to act as researchers as presenters in."
        ],
        [
            "Sales video.",
            "This is the intro of course of all the other videos we made.",
            "The media is Dutch.",
            "Which universities, research institutes and those companies work on multimedia analysis?",
            "For instance, having a computer detects automatically recalls in a soccer match.",
            "Well, for humans this is easy.",
            "For computers it is a hard task.",
            "The goal of St People is to roll out the advanced techniques for multimedia analysis.",
            "Developing building medium into everybody living room.",
            "Yes into your living room as well.",
            "So what you see now, except for boxes and progress reports appearing below your television set, actually computers connected to the Internet.",
            "So you see fireworks with the new version of Microsoft Windows Feedback called Media Center.",
            "Media Center is windows optimized for the TV screen.",
            "It gives access to all your digital photos, music, video and hard disk record elevation.",
            "Using a TV remote control.",
            "So three people is about bringing multimedia analysis into your living room, but if this so, using peer to peer, the ideas all those media centers in all those living rooms connected to the Internet and cooperate things there are to do alone are easy when done together.",
            "Together all those Media Center fielders living rooms provides enormous computing power.",
            "Now I started by saying that many of the video analysis techniques are hard for computers.",
            "This means they are computation intensive.",
            "It takes current computers more than 10 hours to analyze a single hour of television program.",
            "So that leaves 3 default is to let many people interested in the same television program cooperate.",
            "Together they can perform these advanced multimedia analysis tasks quickly.",
            "Researchers at the Technical University winter actually felt quite reliable.",
            "Speech recognition methods that software is integrated into St people.",
            "So what happens is the following.",
            "When you push the record button on the remote of your media centre St. Eval for next to the peer to peer network to find other peer or recording that same program.",
            "So as soon as the television program starts, all interested media centers divide the speech recognition work.",
            "Therefore the results are available in real time.",
            "My pharmacist agency sheet cake.",
            "Don't have translate that I presume.",
            "So how to find the bulk of scripting episode?",
            "My daughter wants to see Steve allows me to search by keyword in the recognized speech of the recorded bubble TV shows and that's how far.",
            "Now you see the system in action.",
            "Open source by.",
            "See the way I and technically infers defend speech.",
            "Indexing is just a first multimedia and application is filtered by St Evolve.",
            "In the future we would like to add more things like summarizing soccer matches, news headlines and much more.",
            "Energized three devo.",
            "He said this to the database system called one Enemy X query, developmentally delayed.",
            "I University of Filter had information retrieval functionality to it and all this is made available as open source free download.",
            "So it's a long term investment of multimedia in this Alpha source software product that makes people possible and we think it made in any order.",
            "This is not an agenda.",
            "This system was demonstrated in JLN June June this year to our referee board.",
            "So indeed, the Media Center was there analyzing real time life video.",
            "And distributed.",
            "Of course it's creates quite some interesting questions.",
            "Because who's the owner of the major data?",
            "Well me and my neighbor.",
            "We defined to work.",
            "And we've changed the meta data.",
            "How we going to graph method?",
            "That is an interesting question.",
            "Perhaps here to discuss.",
            "So there are four examples of multimedia technology in the area of search engines which we have been playing around for the last two years and we will continue in the next 2 years.",
            "St T4 as we currently see it will be probably rolled out somewhere middle of next year.",
            "And the rollout is not by means of science problems for you're facing, but we have some experience in putting some open software in the market and we know that it requires quite some energy to packaged correctly for my mother of 80 to use as well.",
            "Desperate time goes."
        ],
        [
            "Which brings me to the final issue of this meeting.",
            "This meeting was being set with a challenge for what's the future of search search engine scratch Grand Challenge?",
            "Well, I would say.",
            "The Grand Challenge is not the WWW.",
            "But as to what, when and where?"
        ],
        [
            "We have to solve.",
            "Just think for a minute about these little questions.",
            "Let's focus on the last one.",
            "What did Mozart 8 while writing the shovel flat?",
            "Anybody knows the answer?",
            "Probably not.",
            "But this information can be found on the web.",
            "This information can be found with not.",
            "If you type it in this worst in sentence, you will just get garbage out of your search engine.",
            "But why and how are people going to solve this other question?",
            "There are only three ingredients for that.",
            "As human beings we have to align concepts, locations and time.",
            "By knowing that Mozart was musician, lifting Salsberg and insults words and some for this written in a certain.",
            "We can go to lists on the web which enumerate when the hamburger was invented.",
            "When a potato came to Europe when we had our first breath.",
            "So by correlating through concept time and location, we can solve this answer.",
            "None of the search engines currently do it.",
            "Technically, we still at the first stage getting from lexical objects to concepts.",
            "Google is moving into the location so we can at least map our information on the globe.",
            "Time is under develop.",
            "Even the WCC has no standard for annotating time yet.",
            "And I think here lies the real challenge for us as a community, or at least in the European scene that we can clearly identify a grand challenge.",
            "It's not only technology, it's solving this problem.",
            "So what's the cross challenge?",
            "And I would put it here in the open to think about."
        ],
        [
            "The following.",
            "Should we go for a 3D Internet?",
            "And explain my mother of 80.",
            "What is the hell is a 3D Internet?",
            "Or Gaia?",
            "Or will I come home and say, Mom, give me a Cup of coffee?",
            "Because in Europe we're not going for the moon.",
            "We're not going for Marsh, but we will go for the digital time machine.",
            "Because in the digital time in the digital world, we control first backwards, forwards sideways.",
            "So perhaps with the help of computer.",
            "We can try to build this system and we need all the technology we've seen so far.",
            "So my suggestion for you've been committee is here.",
            "If you really want to make a grand chance searching this area rather than in a technically phrased ambition."
        ],
        [
            "With this I want to finish the intro and I would like to give the floor to a yarn for Sarah business Director who can tell you a few of the secrets how we made multimedia on the success."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From the Netherlands, I might take us to your own fuss and we also are pleased to announce that we have taken long or representative for the Ministry of Education and Research.",
                    "label": 0
                },
                {
                    "sent": "Those according to see, is sitting over there in the corridor, so I think there are enough representatives here for Netherlands to introduce multimedia.",
                    "label": 0
                },
                {
                    "sent": "Of course you're all tired after such a lunch.",
                    "label": 0
                },
                {
                    "sent": "So I think the best way to start is to relax a little bit and I'll first show a little video.",
                    "label": 0
                },
                {
                    "sent": "More and more.",
                    "label": 0
                },
                {
                    "sent": "Is offered to us through web sites, but there is a big chance they miss out on a lot of context like the connection between objects, stories about their creators, the history of their Genesis and more.",
                    "label": 0
                },
                {
                    "sent": "Yet this kind of information is very much available simply in digital form in lots of digital databases.",
                    "label": 0
                },
                {
                    "sent": "Search engine by multimedia connects these digital databases and provides a context in our cultural heritage.",
                    "label": 0
                },
                {
                    "sent": "Unlike the billions of static websites, is 1 supports an easy and never ending tour through the world of cultural heritage, this site demonstrates the true semantic web search experience based on ethical.",
                    "label": 0
                },
                {
                    "sent": "Knowledge.",
                    "label": 0
                },
                {
                    "sent": "Take it to your in person dining and just in time to enjoy.",
                    "label": 0
                },
                {
                    "sent": "By using semantic web technology, the partners at this cultural worktable find solutions to interconnect information sources in a smart way and build a new infrastructure.",
                    "label": 0
                },
                {
                    "sent": "Scientists working on effective projects are developing new numbers that can contribute to better infrastructure for digital collection methods.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Everybody is asleep or awake again.",
                    "label": 0
                },
                {
                    "sent": "I think it was the nice dishes for for this meeting.",
                    "label": 0
                },
                {
                    "sent": "You're going to percent in multimedia.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The median is in the.",
                    "label": 0
                },
                {
                    "sent": "Ongoing project.",
                    "label": 0
                },
                {
                    "sent": "It's actually Orient or projects in the middle of its lifetime.",
                    "label": 0
                },
                {
                    "sent": "This project started already in 2002 with preparatory actions.",
                    "label": 0
                },
                {
                    "sent": "Building a program started officially in 2004.",
                    "label": 0
                },
                {
                    "sent": "Continue to 2009 and what will come after it.",
                    "label": 0
                },
                {
                    "sent": "We don't know yet.",
                    "label": 0
                },
                {
                    "sent": "So what I'm going to report here in this half hour is not what we plan to do with what we have done so far and what are the perspectives on the future.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We see them.",
                    "label": 0
                },
                {
                    "sent": "The construction.",
                    "label": 0
                },
                {
                    "sent": "This fund, founded by seven partners mostly from the Academia.",
                    "label": 0
                },
                {
                    "sent": "It's currently involves over 120 people full time.",
                    "label": 1
                },
                {
                    "sent": "We're spending about 30 million euros from the Netherlands government.",
                    "label": 0
                },
                {
                    "sent": "And we have 39 affiliated business partners and most of them don't get any penny of subsidy.",
                    "label": 1
                },
                {
                    "sent": "They are there to pick up the results as we produce them in the project.",
                    "label": 0
                },
                {
                    "sent": "And you want Bill later to talk?",
                    "label": 0
                },
                {
                    "sent": "Tell how we did it.",
                    "label": 0
                },
                {
                    "sent": "How we convince companies to join our quest to improve technology.",
                    "label": 0
                },
                {
                    "sent": "I will focus.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Will technology itself.",
                    "label": 0
                },
                {
                    "sent": "Multimedium from the Outset's was set up as an strongly guided national project.",
                    "label": 0
                },
                {
                    "sent": "We went around and we selected the key research groups in lens, move them together under one umbrella.",
                    "label": 0
                },
                {
                    "sent": "Implemented some strong and directive management in order to make some progress in multimedia technology.",
                    "label": 0
                },
                {
                    "sent": "And to succeed here.",
                    "label": 0
                },
                {
                    "sent": "We were keen to pick all the people necessary to make an impact with.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Things that we took people who were experts.",
                    "label": 0
                },
                {
                    "sent": "Enroll multimedia data analysis video, speech, you name it.",
                    "label": 0
                },
                {
                    "sent": "Often scientists who are working on a particular small collection of images to these sites and to analyze them for some interesting features.",
                    "label": 0
                },
                {
                    "sent": "These scientists alone are not enough.",
                    "label": 0
                },
                {
                    "sent": "We immediately.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Each.",
                    "label": 0
                },
                {
                    "sent": "Recruited people who are experts in conveying information on the screen.",
                    "label": 0
                },
                {
                    "sent": "Human computer interaction experts were drawn on the team.",
                    "label": 0
                },
                {
                    "sent": "Both the scientists on the multimedia technology and human Computer Interaction Group is insufficient because, as we've seen this morning, scale will kill you in the end.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we also include database experts.",
                    "label": 0
                },
                {
                    "sent": "Database experts who had a proven track record in unlocking the potentials of multimedia information retrieval on databases and could handle the scaling issues which comes about.",
                    "label": 0
                },
                {
                    "sent": "And last but not least.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We included people.",
                    "label": 0
                },
                {
                    "sent": "From knowledge engineering, people hold you with linguistics, ontologies tessari.",
                    "label": 0
                },
                {
                    "sent": "And together they were drawn into a project with the ultimate goal to D. Google the information search problem.",
                    "label": 0
                },
                {
                    "sent": "It's good to remember that each of these four groups were necessary to make any impact whatsoever.",
                    "label": 0
                },
                {
                    "sent": "And it was the project's aim to fuse them to drive them.",
                    "label": 0
                },
                {
                    "sent": "And to challenge them to build what we could call the Golden Demos.",
                    "label": 0
                },
                {
                    "sent": "No research or research group was allowed to work in isolation.",
                    "label": 0
                },
                {
                    "sent": "The end result should have been something should be shown working.",
                    "label": 0
                },
                {
                    "sent": "And perhaps even packaged by little PR video.",
                    "label": 0
                },
                {
                    "sent": "And you saw one of the PR videos just.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Minutes ago so in this coming 10 minutes I will show you.",
                    "label": 0
                },
                {
                    "sent": "A few of the search engine experiments going on in the project and I will finalize with another video and some challenge.",
                    "label": 0
                },
                {
                    "sent": "The first one was the Semantic Web browser.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The video you just saw.",
                    "label": 0
                },
                {
                    "sent": "That was scripted by researchers.",
                    "label": 0
                },
                {
                    "sent": "Built by and or constructed by professional filmer and it was spending research money on film industry which was not an activity I normally do.",
                    "label": 0
                },
                {
                    "sent": "If I have money.",
                    "label": 0
                },
                {
                    "sent": "I've spent on research and not on a move.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "However.",
                    "label": 0
                },
                {
                    "sent": "This video was the final result of a three year activity to build a new search engine technology based on semantic web issues.",
                    "label": 0
                },
                {
                    "sent": "It went so far that the website which is behind this service video won the W. 3C Semantic Web Challenge last year.",
                    "label": 1
                },
                {
                    "sent": "What makes this browser so interesting?",
                    "label": 0
                },
                {
                    "sent": "And I can demonstrate it?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the browser which you can find yourself and many of you have here.",
                    "label": 0
                },
                {
                    "sent": "The laptop in your hand so you can type in equal to multimedia dot.",
                    "label": 0
                },
                {
                    "sent": "It come to win in what looks a traditional search engine.",
                    "label": 0
                },
                {
                    "sent": "But if you're going to add there some keywords and I have put here in the top football Board of keyboards because so I get information in quite different forms.",
                    "label": 0
                },
                {
                    "sent": "I get not a long list of hits.",
                    "label": 0
                },
                {
                    "sent": "No, I get objects organized by structure by content.",
                    "label": 0
                },
                {
                    "sent": "So over the top file we have works by Picasso as mentioned in the title.",
                    "label": 0
                },
                {
                    "sent": "The second one works.",
                    "label": 0
                },
                {
                    "sent": "Matching material is kind of strange.",
                    "label": 0
                },
                {
                    "sent": "Oops.",
                    "label": 0
                },
                {
                    "sent": "Should have brought myself a mouse because all also seems to be some sort of material from which these little.",
                    "label": 0
                },
                {
                    "sent": "Fetish issues have been constructed and if you browse further on in the page.",
                    "label": 0
                },
                {
                    "sent": "Yes, you find to of course works of Picasso himself, so this is already one big difference.",
                    "label": 0
                },
                {
                    "sent": "This is not a long list of pages which are ranked by some ranking scheme.",
                    "label": 0
                },
                {
                    "sent": "Now here is the result being organized an clustered by semantic issue.",
                    "label": 0
                },
                {
                    "sent": "This is much more informative than 60 lines of.",
                    "label": 0
                },
                {
                    "sent": "Please click on the next page at the bottom.",
                    "label": 0
                },
                {
                    "sent": "You also find a time scale.",
                    "label": 0
                },
                {
                    "sent": "Which enumerates according to the database.",
                    "label": 0
                },
                {
                    "sent": "What were the coworkers off?",
                    "label": 0
                },
                {
                    "sent": "Because when that time and I can click immediately on one of these issues to see what word appears or competitors of Picasso doing.",
                    "label": 0
                },
                {
                    "sent": "I'll just grab an arbitrary one, did I?",
                    "label": 0
                },
                {
                    "sent": "OK, sorry I assumed in probably on George Brock I should have gotten issue picture here.",
                    "label": 0
                },
                {
                    "sent": "This preprocessor you should try out the cause in the world of browsing on the web is really state of the art in novel.",
                    "label": 0
                },
                {
                    "sent": "It organizes the data by by his semantics.",
                    "label": 0
                },
                {
                    "sent": "For this they had to collect a number of cultural.",
                    "label": 0
                },
                {
                    "sent": "Databases.",
                    "label": 0
                },
                {
                    "sent": "Gets to take Sauries, integrate them and put them in a general framework, and this framework is now sufficiently powerful that we can expand through the Netherlands.",
                    "label": 0
                },
                {
                    "sent": "This kind of technology.",
                    "label": 0
                },
                {
                    "sent": "Oops.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The second example.",
                    "label": 0
                },
                {
                    "sent": "Is on the borderline of search in linguistics.",
                    "label": 0
                },
                {
                    "sent": "If you go into the web, you can identify words of interested.",
                    "label": 0
                },
                {
                    "sent": "This is an example of the mode search engine where you are going after or occurrences of specific words in blocks, journals, videos.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anything you can find.",
                    "label": 0
                },
                {
                    "sent": "And you can do some statistics, for example here we see the statistic of the word excited being tracked in pages Anna new cost over a long period, and it was a lot of excitement at a particular area.",
                    "label": 0
                },
                {
                    "sent": "There the 7th, 16th of July.",
                    "label": 0
                },
                {
                    "sent": "It turns out that any news was broadcast.",
                    "label": 0
                },
                {
                    "sent": "Everybody was excited because new Harry Potter was coming about.",
                    "label": 0
                },
                {
                    "sent": "So what we see here all kind of searching, searching the mode of the Internet by looking for the occurrence of terms and concepts and exploit that information.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can also add the same with all kinds of funny concepts like Katrina.",
                    "label": 0
                },
                {
                    "sent": "Katrina and looking at how people are talking about it.",
                    "label": 0
                },
                {
                    "sent": "So maybe no Celtic.",
                    "label": 0
                },
                {
                    "sent": "Or maybe crazy pissed off awake.",
                    "label": 0
                },
                {
                    "sent": "You can count the number of occurrences of these search these little seconds on the web and you can get a feeling of the mode.",
                    "label": 0
                },
                {
                    "sent": "How is the community reacting to Katrina?",
                    "label": 0
                },
                {
                    "sent": "And as you can see in the end?",
                    "label": 0
                },
                {
                    "sent": "People could vote.",
                    "label": 0
                },
                {
                    "sent": "Yes, we have seen the story now so we better stop.",
                    "label": 0
                },
                {
                    "sent": "Producing more information on Katrina.",
                    "label": 0
                },
                {
                    "sent": "This is the angle of research which goes way beyond what we normally do in a Google setting.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Third one.",
                    "label": 0
                },
                {
                    "sent": "Already for quite some time we have been playing around with large collections of video and do a content based analysis for keyword and concepts.",
                    "label": 0
                },
                {
                    "sent": "We have now reached the point that we can handle hundreds of video hours, analyzed them with some cluster computers, derived concepts and make them accessible through good three day visualization techniques.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I have here 2 screenshot images.",
                    "label": 0
                },
                {
                    "sent": "On one hand, you can cluster images by some properties or any other approaches that we have built in browser where the videos are being projected on a globe.",
                    "label": 0
                },
                {
                    "sent": "Where you can turn the globe on the world Central Line 2 for example, trace the scenes in the video and the vertical bar.",
                    "label": 0
                },
                {
                    "sent": "We detect.",
                    "label": 0
                },
                {
                    "sent": "Closely related scenes in other videos.",
                    "label": 0
                },
                {
                    "sent": "For time I will not show this video, but if you want afterwards during coffee break, I can show you what's happening there.",
                    "label": 0
                },
                {
                    "sent": "So the third example.",
                    "label": 0
                },
                {
                    "sent": "So we had not a semantic web.",
                    "label": 0
                },
                {
                    "sent": "We had simple IR based on linguistic analysis.",
                    "label": 0
                },
                {
                    "sent": "And we had an example of how to deal with the masses of video itself.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The 4th one.",
                    "label": 0
                },
                {
                    "sent": "Is somewhere an answer to the last talk of this morning.",
                    "label": 1
                },
                {
                    "sent": "On fast.",
                    "label": 0
                },
                {
                    "sent": "How are we going to scale up?",
                    "label": 0
                },
                {
                    "sent": "Video or multimedia indexing to world scale?",
                    "label": 0
                },
                {
                    "sent": "Should we invest in an enormous computer center somewhere?",
                    "label": 0
                },
                {
                    "sent": "Should we grab all the videos and analyze themselves?",
                    "label": 0
                },
                {
                    "sent": "Well, the multimedia and we are exploring a different round which is known as three people 364 and I will show you the example of the video itself because it's a good registration.",
                    "label": 0
                },
                {
                    "sent": "How we are able to convince our scientists also to act as researchers as presenters in.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sales video.",
                    "label": 0
                },
                {
                    "sent": "This is the intro of course of all the other videos we made.",
                    "label": 0
                },
                {
                    "sent": "The media is Dutch.",
                    "label": 0
                },
                {
                    "sent": "Which universities, research institutes and those companies work on multimedia analysis?",
                    "label": 0
                },
                {
                    "sent": "For instance, having a computer detects automatically recalls in a soccer match.",
                    "label": 0
                },
                {
                    "sent": "Well, for humans this is easy.",
                    "label": 0
                },
                {
                    "sent": "For computers it is a hard task.",
                    "label": 0
                },
                {
                    "sent": "The goal of St People is to roll out the advanced techniques for multimedia analysis.",
                    "label": 0
                },
                {
                    "sent": "Developing building medium into everybody living room.",
                    "label": 0
                },
                {
                    "sent": "Yes into your living room as well.",
                    "label": 0
                },
                {
                    "sent": "So what you see now, except for boxes and progress reports appearing below your television set, actually computers connected to the Internet.",
                    "label": 0
                },
                {
                    "sent": "So you see fireworks with the new version of Microsoft Windows Feedback called Media Center.",
                    "label": 0
                },
                {
                    "sent": "Media Center is windows optimized for the TV screen.",
                    "label": 0
                },
                {
                    "sent": "It gives access to all your digital photos, music, video and hard disk record elevation.",
                    "label": 0
                },
                {
                    "sent": "Using a TV remote control.",
                    "label": 0
                },
                {
                    "sent": "So three people is about bringing multimedia analysis into your living room, but if this so, using peer to peer, the ideas all those media centers in all those living rooms connected to the Internet and cooperate things there are to do alone are easy when done together.",
                    "label": 0
                },
                {
                    "sent": "Together all those Media Center fielders living rooms provides enormous computing power.",
                    "label": 0
                },
                {
                    "sent": "Now I started by saying that many of the video analysis techniques are hard for computers.",
                    "label": 0
                },
                {
                    "sent": "This means they are computation intensive.",
                    "label": 0
                },
                {
                    "sent": "It takes current computers more than 10 hours to analyze a single hour of television program.",
                    "label": 0
                },
                {
                    "sent": "So that leaves 3 default is to let many people interested in the same television program cooperate.",
                    "label": 0
                },
                {
                    "sent": "Together they can perform these advanced multimedia analysis tasks quickly.",
                    "label": 0
                },
                {
                    "sent": "Researchers at the Technical University winter actually felt quite reliable.",
                    "label": 0
                },
                {
                    "sent": "Speech recognition methods that software is integrated into St people.",
                    "label": 0
                },
                {
                    "sent": "So what happens is the following.",
                    "label": 0
                },
                {
                    "sent": "When you push the record button on the remote of your media centre St. Eval for next to the peer to peer network to find other peer or recording that same program.",
                    "label": 0
                },
                {
                    "sent": "So as soon as the television program starts, all interested media centers divide the speech recognition work.",
                    "label": 0
                },
                {
                    "sent": "Therefore the results are available in real time.",
                    "label": 0
                },
                {
                    "sent": "My pharmacist agency sheet cake.",
                    "label": 0
                },
                {
                    "sent": "Don't have translate that I presume.",
                    "label": 0
                },
                {
                    "sent": "So how to find the bulk of scripting episode?",
                    "label": 0
                },
                {
                    "sent": "My daughter wants to see Steve allows me to search by keyword in the recognized speech of the recorded bubble TV shows and that's how far.",
                    "label": 0
                },
                {
                    "sent": "Now you see the system in action.",
                    "label": 0
                },
                {
                    "sent": "Open source by.",
                    "label": 0
                },
                {
                    "sent": "See the way I and technically infers defend speech.",
                    "label": 0
                },
                {
                    "sent": "Indexing is just a first multimedia and application is filtered by St Evolve.",
                    "label": 0
                },
                {
                    "sent": "In the future we would like to add more things like summarizing soccer matches, news headlines and much more.",
                    "label": 0
                },
                {
                    "sent": "Energized three devo.",
                    "label": 0
                },
                {
                    "sent": "He said this to the database system called one Enemy X query, developmentally delayed.",
                    "label": 0
                },
                {
                    "sent": "I University of Filter had information retrieval functionality to it and all this is made available as open source free download.",
                    "label": 0
                },
                {
                    "sent": "So it's a long term investment of multimedia in this Alpha source software product that makes people possible and we think it made in any order.",
                    "label": 0
                },
                {
                    "sent": "This is not an agenda.",
                    "label": 0
                },
                {
                    "sent": "This system was demonstrated in JLN June June this year to our referee board.",
                    "label": 0
                },
                {
                    "sent": "So indeed, the Media Center was there analyzing real time life video.",
                    "label": 0
                },
                {
                    "sent": "And distributed.",
                    "label": 0
                },
                {
                    "sent": "Of course it's creates quite some interesting questions.",
                    "label": 0
                },
                {
                    "sent": "Because who's the owner of the major data?",
                    "label": 0
                },
                {
                    "sent": "Well me and my neighbor.",
                    "label": 0
                },
                {
                    "sent": "We defined to work.",
                    "label": 0
                },
                {
                    "sent": "And we've changed the meta data.",
                    "label": 0
                },
                {
                    "sent": "How we going to graph method?",
                    "label": 0
                },
                {
                    "sent": "That is an interesting question.",
                    "label": 0
                },
                {
                    "sent": "Perhaps here to discuss.",
                    "label": 0
                },
                {
                    "sent": "So there are four examples of multimedia technology in the area of search engines which we have been playing around for the last two years and we will continue in the next 2 years.",
                    "label": 0
                },
                {
                    "sent": "St T4 as we currently see it will be probably rolled out somewhere middle of next year.",
                    "label": 0
                },
                {
                    "sent": "And the rollout is not by means of science problems for you're facing, but we have some experience in putting some open software in the market and we know that it requires quite some energy to packaged correctly for my mother of 80 to use as well.",
                    "label": 0
                },
                {
                    "sent": "Desperate time goes.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Which brings me to the final issue of this meeting.",
                    "label": 0
                },
                {
                    "sent": "This meeting was being set with a challenge for what's the future of search search engine scratch Grand Challenge?",
                    "label": 0
                },
                {
                    "sent": "Well, I would say.",
                    "label": 0
                },
                {
                    "sent": "The Grand Challenge is not the WWW.",
                    "label": 1
                },
                {
                    "sent": "But as to what, when and where?",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have to solve.",
                    "label": 0
                },
                {
                    "sent": "Just think for a minute about these little questions.",
                    "label": 0
                },
                {
                    "sent": "Let's focus on the last one.",
                    "label": 0
                },
                {
                    "sent": "What did Mozart 8 while writing the shovel flat?",
                    "label": 1
                },
                {
                    "sent": "Anybody knows the answer?",
                    "label": 0
                },
                {
                    "sent": "Probably not.",
                    "label": 0
                },
                {
                    "sent": "But this information can be found on the web.",
                    "label": 0
                },
                {
                    "sent": "This information can be found with not.",
                    "label": 0
                },
                {
                    "sent": "If you type it in this worst in sentence, you will just get garbage out of your search engine.",
                    "label": 0
                },
                {
                    "sent": "But why and how are people going to solve this other question?",
                    "label": 0
                },
                {
                    "sent": "There are only three ingredients for that.",
                    "label": 1
                },
                {
                    "sent": "As human beings we have to align concepts, locations and time.",
                    "label": 0
                },
                {
                    "sent": "By knowing that Mozart was musician, lifting Salsberg and insults words and some for this written in a certain.",
                    "label": 0
                },
                {
                    "sent": "We can go to lists on the web which enumerate when the hamburger was invented.",
                    "label": 0
                },
                {
                    "sent": "When a potato came to Europe when we had our first breath.",
                    "label": 0
                },
                {
                    "sent": "So by correlating through concept time and location, we can solve this answer.",
                    "label": 0
                },
                {
                    "sent": "None of the search engines currently do it.",
                    "label": 0
                },
                {
                    "sent": "Technically, we still at the first stage getting from lexical objects to concepts.",
                    "label": 0
                },
                {
                    "sent": "Google is moving into the location so we can at least map our information on the globe.",
                    "label": 0
                },
                {
                    "sent": "Time is under develop.",
                    "label": 0
                },
                {
                    "sent": "Even the WCC has no standard for annotating time yet.",
                    "label": 0
                },
                {
                    "sent": "And I think here lies the real challenge for us as a community, or at least in the European scene that we can clearly identify a grand challenge.",
                    "label": 0
                },
                {
                    "sent": "It's not only technology, it's solving this problem.",
                    "label": 0
                },
                {
                    "sent": "So what's the cross challenge?",
                    "label": 0
                },
                {
                    "sent": "And I would put it here in the open to think about.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The following.",
                    "label": 0
                },
                {
                    "sent": "Should we go for a 3D Internet?",
                    "label": 0
                },
                {
                    "sent": "And explain my mother of 80.",
                    "label": 0
                },
                {
                    "sent": "What is the hell is a 3D Internet?",
                    "label": 0
                },
                {
                    "sent": "Or Gaia?",
                    "label": 0
                },
                {
                    "sent": "Or will I come home and say, Mom, give me a Cup of coffee?",
                    "label": 0
                },
                {
                    "sent": "Because in Europe we're not going for the moon.",
                    "label": 0
                },
                {
                    "sent": "We're not going for Marsh, but we will go for the digital time machine.",
                    "label": 1
                },
                {
                    "sent": "Because in the digital time in the digital world, we control first backwards, forwards sideways.",
                    "label": 0
                },
                {
                    "sent": "So perhaps with the help of computer.",
                    "label": 0
                },
                {
                    "sent": "We can try to build this system and we need all the technology we've seen so far.",
                    "label": 0
                },
                {
                    "sent": "So my suggestion for you've been committee is here.",
                    "label": 0
                },
                {
                    "sent": "If you really want to make a grand chance searching this area rather than in a technically phrased ambition.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With this I want to finish the intro and I would like to give the floor to a yarn for Sarah business Director who can tell you a few of the secrets how we made multimedia on the success.",
                    "label": 0
                }
            ]
        }
    }
}