{
    "id": "47goacdzryq5w4xaaj7kehw7joj2y6yn",
    "title": "Employing The Complete Face in AVSR to Recover from Facial Occlusions",
    "info": {
        "author": [
            "Ben Hall, Department of Computer Science, University College London"
        ],
        "published": "Nov. 11, 2011",
        "recorded": "October 2011",
        "category": [
            "Top->Computer Science->Image Analysis"
        ]
    },
    "url": "http://videolectures.net/wapa2011_hall_occlusions/",
    "segmentation": [
        [
            "OK, my talks on Ascential."
        ],
        [
            "You automatic speech recognition and I don't know what people know, but this is basically where you turn spoken words of one form or another into text on a page and."
        ],
        [
            "For most of the field, the audio only part.",
            "It's pretty mature, had quite long history of last 50 years ending up with sort of hidden Markov models being the deciding factor at the moment, and performance seems to sort of roughly plateaued, and it's being commercialized successfully really well actually.",
            "If anyone seems three or even Android voice search, they're both really good examples of it, or payment and research, and you can do all said what color the leaves in New Hampshire in full.",
            "And it did it all.",
            "It does it server side, so it's likely cheats.",
            "But it's still really impressive technology.",
            "Information."
        ],
        [
            "Put up about how speeches made itself is that there's a series of articulators, dinosaurian these constrictor control in ways, and that produces different sounds.",
            "Summer obviously fairly far down you have like the larynx.",
            "And yeah, Arriola Ridge that can't be seen by people, but a lot of the articulators can the lips and the teeth, especially an so building off that observation."
        ],
        [
            "And that.",
            "Passenger in 84.",
            "OK with this idea of including visual information into speech and this was good.",
            "This improve maybe in his case over 5 decibel improvement maybe 10 in Word recognition rates.",
            "That was really good."
        ],
        [
            "Yeah, this is the sort of method that he basically pioneered has become the regular sort of way that people do these things.",
            "That sort of vision processing stage.",
            "This is usually with a regional extraction point.",
            "And then this is then fused with audio data later on, 'cause audio is still a lot better than visual for performing this and then you get result out."
        ],
        [
            "There's two prototypes of visual.",
            "Algorithms that consider this or lip based models, and this is where the algorithm itself tries to track the movement of the lips as the face moves and maybe other odd little bit.",
            "Maybe the the shape of the nose and the chin as well, who think they do others?"
        ],
        [
            "Another kind is a sort of just appearance based.",
            "This is slightly wrong, but this week.",
            "Generic visual transformation.",
            "In this case, a discrete cosine transform, and this just essentially packs all the information into a few vectors and people try and use that small number to then feed that into hidden Markov model of some form to get good results, and both have got pluses and minuses."
        ],
        [
            "But this is too broad fields both of these, though, used ropes developed by passenger when he first did the algorithm and one is the framing of the mouth and you can see why does that a lot of information is around that area, and then so you can see what's happening, but it makes sense what he's done.",
            "The problem with this is there's a very intense visual focus on the."
        ],
        [
            "It's a mouth, so if these become."
        ],
        [
            "It is a tale that just the whole system dies.",
            "It just doesn't function and it's bad."
        ],
        [
            "This is also doesn't even ring to take into account implementation issues where any real world implementation of these nowadays is going to be on stuff like webcams, fixed focus CCDS, and there's just no active zoom on those, and so if there is.",
            "Distance between or occlusion or something.",
            "They just don't really cope very well with them."
        ],
        [
            "There's also sort of a distance here to how humans understand speech.",
            "That's it.",
            "You can tell just from looking at people when they speak, that there's motions in the rest of their face.",
            "There is just being disregarded by this, this cropping."
        ],
        [
            "More scientifically, the German Sergeant demonstrated the visual speech can be seen at distances where you just can't make out the lips and teeth just from a physical point of view."
        ],
        [
            "But then Preminger just absolutely now this and he just digitally included parts of the face and then said to people what are they saying and people still, you know, there is big improvements for the rest of the face, and so there's definitely stuff going on in the face that people just aren't on consid."
        ],
        [
            "Ring.",
            "So what we're looking at this that?",
            "Please work by Bushara came up and this was where he was using.",
            "Occlusion sorry he was using.",
            "He was doing facial mimicry and this was using an included face on the left hand side here and he was taking the motions from the rest of it and then using that with just a blank blank copy of the face to then drive motions in the face.",
            "And so you had.",
            "This was the original on the right hand side and this is what he put in and he just put in an averaged face and he got a halfway result between the two.",
            "Annoyingly, I don't have video that I thought I would, but will have a video later and like 7."
        ],
        [
            "So."
        ],
        [
            "So that was where the video would have been, so looking at that.",
            "Bashir's work and the way humans seem to do better than.",
            "Computers at this we sorry the visual part, we looked at the of the methods that people are using in sort of Physiology and psychology when they consider how humans understand visual motion and most of this work has come from something that causes ratio conditioning problem and that's basically this form here where if we can just consider the expanded out intensity of any particular point in the vision field.",
            "So level one method is just as a consider the changes in the intensity of the changes in distance and changes in time.",
            "Try to add these together in some way and see what happens and this obviously has problems for things where something doesn't change, like the next quarter doesn't change, you get a zero and then you get Infinity and bad things happen.",
            "Just really makes sense, but people liked it 'cause it's all other problems but."
        ],
        [
            "But if we consider these components.",
            "Separately.",
            "We have you can sorry.",
            "You can start to consider it.",
            "What happens if you start merging components and so this was here.",
            "You can see the change in time.",
            "Changing distance are then merged with the least squares time method and this is the equation here and this requires this condition to satisfy this and then formula is this one here.",
            "This has been derived from sort of both psychological experiments where people saw that there's a.",
            "Normal type response for 1st order, but then you get a second order normal response for 2nd order filters and it's the combination of these services.",
            "Humanly possible."
        ],
        [
            "Probably the best we can do so.",
            "More importantly, it gives us this really interesting video show."
        ],
        [
            "So this is a super slow down version, but.",
            "You can see this definitely like here.",
            "You can see motions in the bottom of the mouth.",
            "Yeah, just a whole face movement.",
            "Typically in the middle frame, which is the velocity component.",
            "And there's sort of another showing of how his whole face movements when people do things."
        ],
        [
            "You're going back to this earlier diagram.",
            "We see that the visual new visual algorithms or fits in around these top two blocks here, and the instead of focusing on intense part of a small part of the face that we look look at the whole thing and push that into the visual algorithm.",
            "Sort of removing this ROI box a little bit.",
            "We still do do face tracking and such."
        ],
        [
            "On the other hand, so basically we feed in something that looks like this it into the system."
        ],
        [
            "The way everything else is pretty sound here, the waveform is turned into merge.",
            "Frequency exception coefficients.",
            "We also map their anger information, which was the right hand frame in the video and the velocity information.",
            "Sorry, speed information into a single velocity frame and then from that we use PCA on the single one of those we run a two stage hidden Markov model infused those at the end with.",
            "At the moment we just assuming that every frame is included, but don't like that."
        ],
        [
            "The second.",
            "To test it, we just use the DCT.",
            "That's because that's a nice easy algorithm to implement the summer.",
            "Lip tracking ones are little GBS for minutes or implementation point of view.",
            "But one thing that we did require was a new database and this is because the."
        ],
        [
            "Previous ones just didn't do what we needed.",
            "We needed sort of a single speaker full face with simple words and it just sort of a prototype stage just to see if it was actually viable.",
            "And this is what we did."
        ],
        [
            "It.",
            "So if it's later on, this just is showing what happens if there you just consider the audio alone sort 10s off, where if you include the visual, you know there's a sort of swing.",
            "Here's maybe like 10 decibels or so into points.",
            "We"
        ],
        [
            "Then different salts.",
            "So there's four lines at the bottom left.",
            "One is DCT, so that is still beating us in.",
            "It's for mouse centric one.",
            "We then did the included face, which is some improvement over the audio, and we also considered the case of the complete face.",
            "That's where there is visual information still present in multi channel gradient model.",
            "Yeah, did the.",
            "Quite right."
        ],
        [
            "Yeah, that's conclusions.",
            "OK, so yeah, there was possible to check some information from face.",
            "It was not quite as good as DCT was provided in DTS optimal conditions, but GT doesn't function a tool in a certain area where the mouth is included."
        ],
        [
            "And we're sort of looking to expand the database.",
            "Actually, that's been sidekicks Patterson, slightly old man, and the feature selection in this model was very basic.",
            "It was just picking up different PCA components and there's a lot of ICA such that we can do on there.",
            "We know there's definitely room for improvement.",
            "We just haven't got around to doing it."
        ],
        [
            "Yeah, I think I'm actually finished.",
            "Sorry it's very fast.",
            "Oh sorry, the question was that haha.",
            "The in this database there's only a single speaker, and how would that be expected to?",
            "So how would the algorithm you spected to perform as more speakers were added to their base?",
            "In general it goes down.",
            "That's the gist.",
            "Yeah, you have.",
            "If you test, say on A5 speaker database.",
            "If you do independent ones.",
            "So you just pick randomly, but if they are still in your training sample, the results would go down a little bit.",
            "Probably something like 10% but where people start seeing real drop off.",
            "Is if they train on 6 people and then have a 7th totally novel speaker that's not in the database at all.",
            "They think the another reason for using this algorithm was that it it we've used it previously as well for doing facial mapping between different people, so that the motions I make on my face can be projected onto Tom and that's got some interesting things where you can have, I can say something and it can make it look like Thomas saying it looks good.",
            "It's not perfect, but it's pretty good, so we think every match will be pretty pretty good on the sort of speaker.",
            "Independent cases.",
            "It's like that, but with its ongoing work.",
            "So the question was, does the speaker have to face the camera directly?",
            "And so for this?",
            "Ideally yes, but once you've got the sort of the multi channel gradient model data, interesting start happening actually out of that that if you do issues of PCA you get the major components of the facial movement, but if you start playing ICA to it, you get stuff like the pitch in your of the head, and so there's definitely some like things that haven't really been changed.",
            "Their tool from like.",
            "When people talk and intonation goes up, their face often goes up in response to that and that sort of second or third one, but it might be quite interesting at some stage actually to try and blend this into the algorithm in.",
            "If you see this thing you know you could maybe sort of normalize it out and get better results.",
            "Everyone.",
            "Third time the question was first commercialized applications of speech recognition software that they often if you take Dragon Home, it says let's talk into the computer for an hour and it sort of customize it based on your own personal voice and what was the visual equivalent of that and suspect is actually just about the same.",
            "It's speaking to the camera for a little bit and will train on house because there definitely is this paper where people they get people to speak into a camera and they don't actually do speech recognition.",
            "So by security on what they say, it's on the difference between their face and the visual and the speech, and so different people.",
            "You could imagine.",
            "I know someone who are pretty heavyset man or something would have very slow movements within their face, where some woman might have very short sharp angular movements.",
            "And even though they sounded the same the same, that's quite interesting.",
            "It's off topic, but quite interesting is that Google's Android search?",
            "Is it really interesting they had, but they had a lot of data.",
            "They were running Google Voice and they were just doing, you know they've got.",
            "Obscene amounts of data basically from Google Voice, but it's not really sure how Apple I've got so much voice data 'cause 3 works really well and they don't seem to have quite the scale that Google do, so it's not really sure what they're actually doing there, but I don't know if you do try.",
            "Sorry, it's really.",
            "Club.",
            "Times on the graphs it didn't show where what the visual performs on its own.",
            "Thus, there probably is not going to include it against ECT, but no one.",
            "No one expects visual algorithms to be able to accurately distinguish between those, for example, Bay pay are visually identical and there's just no way of telling them apart just from visual information.",
            "So it's I. Yeah, I probably should have included that, but it's I thought I'd be slightly longer."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, my talks on Ascential.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You automatic speech recognition and I don't know what people know, but this is basically where you turn spoken words of one form or another into text on a page and.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For most of the field, the audio only part.",
                    "label": 0
                },
                {
                    "sent": "It's pretty mature, had quite long history of last 50 years ending up with sort of hidden Markov models being the deciding factor at the moment, and performance seems to sort of roughly plateaued, and it's being commercialized successfully really well actually.",
                    "label": 0
                },
                {
                    "sent": "If anyone seems three or even Android voice search, they're both really good examples of it, or payment and research, and you can do all said what color the leaves in New Hampshire in full.",
                    "label": 1
                },
                {
                    "sent": "And it did it all.",
                    "label": 0
                },
                {
                    "sent": "It does it server side, so it's likely cheats.",
                    "label": 0
                },
                {
                    "sent": "But it's still really impressive technology.",
                    "label": 0
                },
                {
                    "sent": "Information.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Put up about how speeches made itself is that there's a series of articulators, dinosaurian these constrictor control in ways, and that produces different sounds.",
                    "label": 0
                },
                {
                    "sent": "Summer obviously fairly far down you have like the larynx.",
                    "label": 0
                },
                {
                    "sent": "And yeah, Arriola Ridge that can't be seen by people, but a lot of the articulators can the lips and the teeth, especially an so building off that observation.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And that.",
                    "label": 0
                },
                {
                    "sent": "Passenger in 84.",
                    "label": 0
                },
                {
                    "sent": "OK with this idea of including visual information into speech and this was good.",
                    "label": 1
                },
                {
                    "sent": "This improve maybe in his case over 5 decibel improvement maybe 10 in Word recognition rates.",
                    "label": 0
                },
                {
                    "sent": "That was really good.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, this is the sort of method that he basically pioneered has become the regular sort of way that people do these things.",
                    "label": 0
                },
                {
                    "sent": "That sort of vision processing stage.",
                    "label": 1
                },
                {
                    "sent": "This is usually with a regional extraction point.",
                    "label": 0
                },
                {
                    "sent": "And then this is then fused with audio data later on, 'cause audio is still a lot better than visual for performing this and then you get result out.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's two prototypes of visual.",
                    "label": 0
                },
                {
                    "sent": "Algorithms that consider this or lip based models, and this is where the algorithm itself tries to track the movement of the lips as the face moves and maybe other odd little bit.",
                    "label": 0
                },
                {
                    "sent": "Maybe the the shape of the nose and the chin as well, who think they do others?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another kind is a sort of just appearance based.",
                    "label": 1
                },
                {
                    "sent": "This is slightly wrong, but this week.",
                    "label": 0
                },
                {
                    "sent": "Generic visual transformation.",
                    "label": 0
                },
                {
                    "sent": "In this case, a discrete cosine transform, and this just essentially packs all the information into a few vectors and people try and use that small number to then feed that into hidden Markov model of some form to get good results, and both have got pluses and minuses.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But this is too broad fields both of these, though, used ropes developed by passenger when he first did the algorithm and one is the framing of the mouth and you can see why does that a lot of information is around that area, and then so you can see what's happening, but it makes sense what he's done.",
                    "label": 0
                },
                {
                    "sent": "The problem with this is there's a very intense visual focus on the.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's a mouth, so if these become.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is a tale that just the whole system dies.",
                    "label": 0
                },
                {
                    "sent": "It just doesn't function and it's bad.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is also doesn't even ring to take into account implementation issues where any real world implementation of these nowadays is going to be on stuff like webcams, fixed focus CCDS, and there's just no active zoom on those, and so if there is.",
                    "label": 1
                },
                {
                    "sent": "Distance between or occlusion or something.",
                    "label": 0
                },
                {
                    "sent": "They just don't really cope very well with them.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's also sort of a distance here to how humans understand speech.",
                    "label": 0
                },
                {
                    "sent": "That's it.",
                    "label": 0
                },
                {
                    "sent": "You can tell just from looking at people when they speak, that there's motions in the rest of their face.",
                    "label": 0
                },
                {
                    "sent": "There is just being disregarded by this, this cropping.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "More scientifically, the German Sergeant demonstrated the visual speech can be seen at distances where you just can't make out the lips and teeth just from a physical point of view.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But then Preminger just absolutely now this and he just digitally included parts of the face and then said to people what are they saying and people still, you know, there is big improvements for the rest of the face, and so there's definitely stuff going on in the face that people just aren't on consid.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ring.",
                    "label": 0
                },
                {
                    "sent": "So what we're looking at this that?",
                    "label": 0
                },
                {
                    "sent": "Please work by Bushara came up and this was where he was using.",
                    "label": 0
                },
                {
                    "sent": "Occlusion sorry he was using.",
                    "label": 0
                },
                {
                    "sent": "He was doing facial mimicry and this was using an included face on the left hand side here and he was taking the motions from the rest of it and then using that with just a blank blank copy of the face to then drive motions in the face.",
                    "label": 0
                },
                {
                    "sent": "And so you had.",
                    "label": 0
                },
                {
                    "sent": "This was the original on the right hand side and this is what he put in and he just put in an averaged face and he got a halfway result between the two.",
                    "label": 0
                },
                {
                    "sent": "Annoyingly, I don't have video that I thought I would, but will have a video later and like 7.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that was where the video would have been, so looking at that.",
                    "label": 0
                },
                {
                    "sent": "Bashir's work and the way humans seem to do better than.",
                    "label": 0
                },
                {
                    "sent": "Computers at this we sorry the visual part, we looked at the of the methods that people are using in sort of Physiology and psychology when they consider how humans understand visual motion and most of this work has come from something that causes ratio conditioning problem and that's basically this form here where if we can just consider the expanded out intensity of any particular point in the vision field.",
                    "label": 0
                },
                {
                    "sent": "So level one method is just as a consider the changes in the intensity of the changes in distance and changes in time.",
                    "label": 0
                },
                {
                    "sent": "Try to add these together in some way and see what happens and this obviously has problems for things where something doesn't change, like the next quarter doesn't change, you get a zero and then you get Infinity and bad things happen.",
                    "label": 0
                },
                {
                    "sent": "Just really makes sense, but people liked it 'cause it's all other problems but.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But if we consider these components.",
                    "label": 0
                },
                {
                    "sent": "Separately.",
                    "label": 0
                },
                {
                    "sent": "We have you can sorry.",
                    "label": 0
                },
                {
                    "sent": "You can start to consider it.",
                    "label": 0
                },
                {
                    "sent": "What happens if you start merging components and so this was here.",
                    "label": 0
                },
                {
                    "sent": "You can see the change in time.",
                    "label": 0
                },
                {
                    "sent": "Changing distance are then merged with the least squares time method and this is the equation here and this requires this condition to satisfy this and then formula is this one here.",
                    "label": 0
                },
                {
                    "sent": "This has been derived from sort of both psychological experiments where people saw that there's a.",
                    "label": 0
                },
                {
                    "sent": "Normal type response for 1st order, but then you get a second order normal response for 2nd order filters and it's the combination of these services.",
                    "label": 0
                },
                {
                    "sent": "Humanly possible.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Probably the best we can do so.",
                    "label": 0
                },
                {
                    "sent": "More importantly, it gives us this really interesting video show.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is a super slow down version, but.",
                    "label": 0
                },
                {
                    "sent": "You can see this definitely like here.",
                    "label": 0
                },
                {
                    "sent": "You can see motions in the bottom of the mouth.",
                    "label": 0
                },
                {
                    "sent": "Yeah, just a whole face movement.",
                    "label": 0
                },
                {
                    "sent": "Typically in the middle frame, which is the velocity component.",
                    "label": 0
                },
                {
                    "sent": "And there's sort of another showing of how his whole face movements when people do things.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You're going back to this earlier diagram.",
                    "label": 0
                },
                {
                    "sent": "We see that the visual new visual algorithms or fits in around these top two blocks here, and the instead of focusing on intense part of a small part of the face that we look look at the whole thing and push that into the visual algorithm.",
                    "label": 0
                },
                {
                    "sent": "Sort of removing this ROI box a little bit.",
                    "label": 0
                },
                {
                    "sent": "We still do do face tracking and such.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the other hand, so basically we feed in something that looks like this it into the system.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The way everything else is pretty sound here, the waveform is turned into merge.",
                    "label": 1
                },
                {
                    "sent": "Frequency exception coefficients.",
                    "label": 0
                },
                {
                    "sent": "We also map their anger information, which was the right hand frame in the video and the velocity information.",
                    "label": 0
                },
                {
                    "sent": "Sorry, speed information into a single velocity frame and then from that we use PCA on the single one of those we run a two stage hidden Markov model infused those at the end with.",
                    "label": 0
                },
                {
                    "sent": "At the moment we just assuming that every frame is included, but don't like that.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The second.",
                    "label": 0
                },
                {
                    "sent": "To test it, we just use the DCT.",
                    "label": 0
                },
                {
                    "sent": "That's because that's a nice easy algorithm to implement the summer.",
                    "label": 0
                },
                {
                    "sent": "Lip tracking ones are little GBS for minutes or implementation point of view.",
                    "label": 0
                },
                {
                    "sent": "But one thing that we did require was a new database and this is because the.",
                    "label": 1
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Previous ones just didn't do what we needed.",
                    "label": 1
                },
                {
                    "sent": "We needed sort of a single speaker full face with simple words and it just sort of a prototype stage just to see if it was actually viable.",
                    "label": 1
                },
                {
                    "sent": "And this is what we did.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It.",
                    "label": 0
                },
                {
                    "sent": "So if it's later on, this just is showing what happens if there you just consider the audio alone sort 10s off, where if you include the visual, you know there's a sort of swing.",
                    "label": 0
                },
                {
                    "sent": "Here's maybe like 10 decibels or so into points.",
                    "label": 0
                },
                {
                    "sent": "We",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then different salts.",
                    "label": 0
                },
                {
                    "sent": "So there's four lines at the bottom left.",
                    "label": 0
                },
                {
                    "sent": "One is DCT, so that is still beating us in.",
                    "label": 0
                },
                {
                    "sent": "It's for mouse centric one.",
                    "label": 0
                },
                {
                    "sent": "We then did the included face, which is some improvement over the audio, and we also considered the case of the complete face.",
                    "label": 0
                },
                {
                    "sent": "That's where there is visual information still present in multi channel gradient model.",
                    "label": 0
                },
                {
                    "sent": "Yeah, did the.",
                    "label": 0
                },
                {
                    "sent": "Quite right.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, that's conclusions.",
                    "label": 0
                },
                {
                    "sent": "OK, so yeah, there was possible to check some information from face.",
                    "label": 1
                },
                {
                    "sent": "It was not quite as good as DCT was provided in DTS optimal conditions, but GT doesn't function a tool in a certain area where the mouth is included.",
                    "label": 1
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we're sort of looking to expand the database.",
                    "label": 0
                },
                {
                    "sent": "Actually, that's been sidekicks Patterson, slightly old man, and the feature selection in this model was very basic.",
                    "label": 1
                },
                {
                    "sent": "It was just picking up different PCA components and there's a lot of ICA such that we can do on there.",
                    "label": 0
                },
                {
                    "sent": "We know there's definitely room for improvement.",
                    "label": 0
                },
                {
                    "sent": "We just haven't got around to doing it.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, I think I'm actually finished.",
                    "label": 0
                },
                {
                    "sent": "Sorry it's very fast.",
                    "label": 0
                },
                {
                    "sent": "Oh sorry, the question was that haha.",
                    "label": 0
                },
                {
                    "sent": "The in this database there's only a single speaker, and how would that be expected to?",
                    "label": 0
                },
                {
                    "sent": "So how would the algorithm you spected to perform as more speakers were added to their base?",
                    "label": 0
                },
                {
                    "sent": "In general it goes down.",
                    "label": 0
                },
                {
                    "sent": "That's the gist.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you have.",
                    "label": 0
                },
                {
                    "sent": "If you test, say on A5 speaker database.",
                    "label": 0
                },
                {
                    "sent": "If you do independent ones.",
                    "label": 0
                },
                {
                    "sent": "So you just pick randomly, but if they are still in your training sample, the results would go down a little bit.",
                    "label": 0
                },
                {
                    "sent": "Probably something like 10% but where people start seeing real drop off.",
                    "label": 0
                },
                {
                    "sent": "Is if they train on 6 people and then have a 7th totally novel speaker that's not in the database at all.",
                    "label": 0
                },
                {
                    "sent": "They think the another reason for using this algorithm was that it it we've used it previously as well for doing facial mapping between different people, so that the motions I make on my face can be projected onto Tom and that's got some interesting things where you can have, I can say something and it can make it look like Thomas saying it looks good.",
                    "label": 0
                },
                {
                    "sent": "It's not perfect, but it's pretty good, so we think every match will be pretty pretty good on the sort of speaker.",
                    "label": 0
                },
                {
                    "sent": "Independent cases.",
                    "label": 0
                },
                {
                    "sent": "It's like that, but with its ongoing work.",
                    "label": 0
                },
                {
                    "sent": "So the question was, does the speaker have to face the camera directly?",
                    "label": 0
                },
                {
                    "sent": "And so for this?",
                    "label": 0
                },
                {
                    "sent": "Ideally yes, but once you've got the sort of the multi channel gradient model data, interesting start happening actually out of that that if you do issues of PCA you get the major components of the facial movement, but if you start playing ICA to it, you get stuff like the pitch in your of the head, and so there's definitely some like things that haven't really been changed.",
                    "label": 0
                },
                {
                    "sent": "Their tool from like.",
                    "label": 0
                },
                {
                    "sent": "When people talk and intonation goes up, their face often goes up in response to that and that sort of second or third one, but it might be quite interesting at some stage actually to try and blend this into the algorithm in.",
                    "label": 0
                },
                {
                    "sent": "If you see this thing you know you could maybe sort of normalize it out and get better results.",
                    "label": 0
                },
                {
                    "sent": "Everyone.",
                    "label": 0
                },
                {
                    "sent": "Third time the question was first commercialized applications of speech recognition software that they often if you take Dragon Home, it says let's talk into the computer for an hour and it sort of customize it based on your own personal voice and what was the visual equivalent of that and suspect is actually just about the same.",
                    "label": 0
                },
                {
                    "sent": "It's speaking to the camera for a little bit and will train on house because there definitely is this paper where people they get people to speak into a camera and they don't actually do speech recognition.",
                    "label": 0
                },
                {
                    "sent": "So by security on what they say, it's on the difference between their face and the visual and the speech, and so different people.",
                    "label": 0
                },
                {
                    "sent": "You could imagine.",
                    "label": 0
                },
                {
                    "sent": "I know someone who are pretty heavyset man or something would have very slow movements within their face, where some woman might have very short sharp angular movements.",
                    "label": 0
                },
                {
                    "sent": "And even though they sounded the same the same, that's quite interesting.",
                    "label": 0
                },
                {
                    "sent": "It's off topic, but quite interesting is that Google's Android search?",
                    "label": 0
                },
                {
                    "sent": "Is it really interesting they had, but they had a lot of data.",
                    "label": 0
                },
                {
                    "sent": "They were running Google Voice and they were just doing, you know they've got.",
                    "label": 0
                },
                {
                    "sent": "Obscene amounts of data basically from Google Voice, but it's not really sure how Apple I've got so much voice data 'cause 3 works really well and they don't seem to have quite the scale that Google do, so it's not really sure what they're actually doing there, but I don't know if you do try.",
                    "label": 0
                },
                {
                    "sent": "Sorry, it's really.",
                    "label": 0
                },
                {
                    "sent": "Club.",
                    "label": 0
                },
                {
                    "sent": "Times on the graphs it didn't show where what the visual performs on its own.",
                    "label": 0
                },
                {
                    "sent": "Thus, there probably is not going to include it against ECT, but no one.",
                    "label": 0
                },
                {
                    "sent": "No one expects visual algorithms to be able to accurately distinguish between those, for example, Bay pay are visually identical and there's just no way of telling them apart just from visual information.",
                    "label": 0
                },
                {
                    "sent": "So it's I. Yeah, I probably should have included that, but it's I thought I'd be slightly longer.",
                    "label": 0
                }
            ]
        }
    }
}