{
    "id": "4cl4m7dwqy4xvy6groshsmkgp25caj4h",
    "title": "Who to Follow and Why: Link Prediction with Explanations",
    "info": {
        "author": [
            "Nicola Barbieri, Yahoo! Research Barcelona"
        ],
        "published": "Oct. 7, 2014",
        "recorded": "August 2014",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Knowledge Extraction"
        ]
    },
    "url": "http://videolectures.net/kdd2014_barbieri_link_prediction/",
    "segmentation": [
        [
            "Each one is the task of estimating the likelihood of interaction with the Member of the network, and it is nicely stated by now well in client.",
            "So even a snapshot of our network we want to inspect, which are the next links that are more likely to occur in the future.",
            "Inferential techniques have plenty of application from biological network to economists, but perhaps the most successful application is in the recommendation of users to follow in online social network.",
            "And these are these are being witnessed by huge investment in the development of user recommended system and nowadays we have, as you may know, very accurate and very scalable technique for recommending you the people to follow.",
            "But they all fall fall short in providing explanation, and if you share my same experience as a user, you may wonder sometimes why a guy is recommended to you.",
            "And this is typical recommendation and why other area in the recommendations in the recommendation sector have moving towards providing explanation.",
            "For example, for when suggesting people to chase a product, this is largely unexplored for social recommender system."
        ],
        [
            "So consider with me this setting we have our user login in our system and we know his profile and we know that he has good friend in Barcelona.",
            "It does research on web mining and likes Blues music."
        ],
        [
            "And probably it will get will get recommendation in this form.",
            "As you can see is a shining user interface, but not.",
            "No information is provided.",
            "What we want to do is to move."
        ],
        [
            "Step forward, we want to provide him with the reason why you should follow the recommended people.",
            "And for example you should follow Nicholas Becausw.",
            "They share some friends and he's a funny guy in Barcelona and you could follow Francesco because it shares content about your labs and win money and you said because it shapes content is authoritie.",
            "Authoritie is an authority about Blues, Blues, music.",
            "So how do we do that?"
        ],
        [
            "The mental block of our system is a theory well known accept, well known and accepted in sociology that goes under the name of common entity.",
            "A common bond theory.",
            "It's very simple.",
            "It says that social relationships are usually explained by two factors.",
            "Identity based and bone basid, so identity based links up and when we share interest so we share in, we share a topic of interest together.",
            "And Bone base attachment happens when we when we share personal relationship.",
            "For example, we stick together with the same friends or we belong to the same family."
        ],
        [
            "And coming back to the example, the first case is clearly a bond based link, whereas the latter two are identity based links and they are motivated by the authority of the recommending the P person for the for the user is having the recommendation."
        ],
        [
            "Based on this observation, just very simple, we will define a lot in factor model for modeling social topical relationship.",
            "What we consider as input is directed graph where nodes are users and the Lincoln Code the following information.",
            "So a link goes from you to rule if you follow through and we also assume that for each user we have a bug official adopted by the user.",
            "This can be hashtag on Twitter tag some figure as we will see in awhile or product shared and we assume there is some kind of emulation process.",
            "For example you see a bit.",
            "You see an ash tag and you start adopting it."
        ],
        [
            "And the following the common bond and eventually tear accompanied entity theory.",
            "In this example, we can devise three communities, the blue, the blue one is clearly high as a high density and is clearly like reciprocal.",
            "So our assumption is that bond based communities tend to have high density and reciprocal links, while the other two communities.",
            "If you look well, the form around two nodes, the nodes four and the Note 7 cause.",
            "They are authoritive user authoritative user, so in our assumption is that identity based communities tend to exhibit A clear directionality in the link."
        ],
        [
            "We propose to explain and the structure of the network that means the links and the adoption of the feature with unique model based on the Latin factors and we model the degree of involvement of each user in this certain factors with three components, is authority is a suspect ability that you can read US interests and social attitude and."
        ],
        [
            "Components are model and as multinomial distribution over the user set.",
            "For example, in the blue blue Community you can see that they all share a social attitude, while the green community.",
            "The Note 4 and then five have high probability of incoming links, so they are considering authority while they not show up as high probability of outgoing links.",
            "So can we consider general interested in the topics shared in the community too?",
            "And to complete the."
        ],
        [
            "Teacher we need also to go on the official level.",
            "I want assumption is that the identity based community there are the topical one tend to have low entropy on the set of features, and for example, if you consider the.",
            "Orange community you will see that the most widely used feature is big and you have low entropy, while if you go on the blue community you have Max and so uniform probability of adopting adopting each feature."
        ],
        [
            "Based on all this intuition, we can define the Latin factor, a generative model.",
            "And our idea is that we want to model.",
            "The observed social link and the adoption of feature bands, reducing Latin factors or communities, and in particular an this Latin Factors act on the source and destination of the links and on the user identity on the user and entity on the feature.",
            "When you want to model feature user base.",
            "So for each link observed link we want to model the likelihood that exists a Community K for which.",
            "You assign probability to be a source and we assign probabilities to be a destination.",
            "And overall the overall model is governed by this components.",
            "First we have a multinomial distribution of a lot.",
            "In fact or communities.",
            "So basically we're all a Dyson will be collected communities for each observer, the link, and for each observer feature adoption.",
            "And then we regulate the involvement of user with the authoritie authoritie distribution over the user set a general interest distribution and the social attitude distribution.",
            "And you can see that the authority distribution acts place at all on the user is receiving the link, so it's incoming link, while the general interest acts on the user establishing the link and the social attitude plays on them both so that the probability.",
            "Over link from you to view is equal to the probability of you to.",
            "Then we have a link labelling component that says as the proportion of topical and social link within each community and a topical role that tell us how user act in this community.",
            "If they are by emulation or if they act by their own interest.",
            "And to complete the picture to complete the future space, we have a multinomial distribution of over the feature set.",
            "And let's let's run the generative model together.",
            "So we want to generate a link fast with Lala is saying we pick a Latin community, say K, then for the link we have to decide if it's social of topical.",
            "If it's social, the endpoint both the endpoints of the connection are generated by the social component and you can see that the probability will be received and symmetric if it's topical instead the.",
            "Probably the source of the node.",
            "Establishing the link will be generated by the interest component, while the identity of the user re signing the link will be generated by the authority component.",
            "And this is a full generative bias and generative model, and the use of conjugate priors makes the inference more easier.",
            "So we can devise a collapsed with sampling procedure, and you can find details.",
            "So within the pair button implement it very easily."
        ],
        [
            "At Link prediction or runtime, it's a three step process.",
            "First thing we need to come up with a set of recommendation.",
            "Second step is to understand the nature of the sender relationship between the pastor recommend and and the current user and the test step is generating explanation.",
            "So the probability of observing a link can be computed like a mixture of social and topical affinity.",
            "To be clear, at prediction time we take into account both of these components and the same things happen.",
            "For example, for the adoption of feature when we consider the overall topical involvement of the user in the considered a community and then after computing the likelihood of each link for the current user, we can sort them in descending order and for example, selecting the top K. Now we move."
        ],
        [
            "For the next phase, we want to understand the nature of the relationship between the recommended user and the current one.",
            "So essentially we ask the model to classify the links as social and topical and the link is social.",
            "If there is at least a social community in which both the user are part of our highly active.",
            "While it's consider a stock is considered topical if they are part of a community, if their partner.",
            "If one is an authoritative and one is acceptable in a common community and these are Bernoulli probability, what we do?",
            "We compute them and we take the monks.",
            "So assume that the connection the model says that.",
            "Connection is social.",
            "The most.",
            "The most immediate way of generating explanation is to pick up a common common common set of friends in the active in the community to explain the link, while if it's topical, the recommendation should be provided as a set of features that characterize the authoritative authority and interest of the current user.",
            "For evaluating."
        ],
        [
            "The model we rely on.",
            "Flickr and Twitter data and on Twitter the feature dash tag while on Trigger are the tags and the Flickr data.",
            "That is nice because it gives us a kind of ground truth for labelling.",
            "So on the Flickr system a user can say if each connection is a friend or a family and we consider them as social.",
            "If says no, we don't see them at topical and."
        ],
        [
            "The first step is to evaluate the model.",
            "Works only in prediction and on Twitter we run a Monte Carlo 5 cross validation and figure.",
            "Since we have the timestamp we go for a chronological speed and we compete with standard baseline competitors and the joint factorization of the incidence matrix and the visual metrics which you can take as an ancestor of all the Latin factors that you model that you can develop on this data."
        ],
        [
            "As you can see, we missed you there.",
            "The accuracy with the area under the curve, so the higher the better and we outperform all the competitors for any for any number of topics now."
        ],
        [
            "The next step is to understand if the model works in LINQ labelling, so it's again a binary classification task and the baseline simple baseline in the squash is given by counting the number of common friends and normalizing it by the number of common friends and the common feature.",
            "And again we achieved pretty good accuracy.",
            "Finally, what we have to do is to understand very simple things.",
            "If the model makes sense.",
            "So."
        ],
        [
            "For doing that we compute for example the probability that officially see the social auto pickle and in the first in the boat in the top part you can see that there are featured on the left there are barely wear birthday, wedding and party.",
            "There are market there are labeled as social and I think we agree and the other feature on the other side, the one that are topical are related to photographic techniques.",
            "And again since we have communities and we have the social coefficient of our communities and the key works.",
            "We can check them together and for example the first topic is a Labrador for social and the top keywords are Christmas birthday or made.",
            "So it's clearly social and the last topic if you can read it's topical and it's about Game of Thrones.",
            "So what we did let's."
        ],
        [
            "About what we did in this work, we propose a joint factorization of social connection and feature Association to come up with a way of providing recommendation and also explain them.",
            "The model is both accurate link prediction and Enlink labelling and then for future works we plan to run some user study to understand the user perception our user respond to this explanation, perhaps in generating explanation.",
            "We have also to announce the diversity of the explanation and also since the model is our Latin factor, models provide us some kind of Community structure.",
            "We plan to explore this area and we have some preliminary positive results already in the paper and the similar characterization similar model.",
            "Can be done with other techniques like math, factorization technique."
        ],
        [
            "This concludes my talk.",
            "Thank you for your attention and I'll take questions now."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Each one is the task of estimating the likelihood of interaction with the Member of the network, and it is nicely stated by now well in client.",
                    "label": 0
                },
                {
                    "sent": "So even a snapshot of our network we want to inspect, which are the next links that are more likely to occur in the future.",
                    "label": 1
                },
                {
                    "sent": "Inferential techniques have plenty of application from biological network to economists, but perhaps the most successful application is in the recommendation of users to follow in online social network.",
                    "label": 0
                },
                {
                    "sent": "And these are these are being witnessed by huge investment in the development of user recommended system and nowadays we have, as you may know, very accurate and very scalable technique for recommending you the people to follow.",
                    "label": 0
                },
                {
                    "sent": "But they all fall fall short in providing explanation, and if you share my same experience as a user, you may wonder sometimes why a guy is recommended to you.",
                    "label": 0
                },
                {
                    "sent": "And this is typical recommendation and why other area in the recommendations in the recommendation sector have moving towards providing explanation.",
                    "label": 0
                },
                {
                    "sent": "For example, for when suggesting people to chase a product, this is largely unexplored for social recommender system.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So consider with me this setting we have our user login in our system and we know his profile and we know that he has good friend in Barcelona.",
                    "label": 0
                },
                {
                    "sent": "It does research on web mining and likes Blues music.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And probably it will get will get recommendation in this form.",
                    "label": 0
                },
                {
                    "sent": "As you can see is a shining user interface, but not.",
                    "label": 0
                },
                {
                    "sent": "No information is provided.",
                    "label": 0
                },
                {
                    "sent": "What we want to do is to move.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Step forward, we want to provide him with the reason why you should follow the recommended people.",
                    "label": 0
                },
                {
                    "sent": "And for example you should follow Nicholas Becausw.",
                    "label": 0
                },
                {
                    "sent": "They share some friends and he's a funny guy in Barcelona and you could follow Francesco because it shares content about your labs and win money and you said because it shapes content is authoritie.",
                    "label": 0
                },
                {
                    "sent": "Authoritie is an authority about Blues, Blues, music.",
                    "label": 1
                },
                {
                    "sent": "So how do we do that?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The mental block of our system is a theory well known accept, well known and accepted in sociology that goes under the name of common entity.",
                    "label": 0
                },
                {
                    "sent": "A common bond theory.",
                    "label": 0
                },
                {
                    "sent": "It's very simple.",
                    "label": 0
                },
                {
                    "sent": "It says that social relationships are usually explained by two factors.",
                    "label": 0
                },
                {
                    "sent": "Identity based and bone basid, so identity based links up and when we share interest so we share in, we share a topic of interest together.",
                    "label": 0
                },
                {
                    "sent": "And Bone base attachment happens when we when we share personal relationship.",
                    "label": 0
                },
                {
                    "sent": "For example, we stick together with the same friends or we belong to the same family.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And coming back to the example, the first case is clearly a bond based link, whereas the latter two are identity based links and they are motivated by the authority of the recommending the P person for the for the user is having the recommendation.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Based on this observation, just very simple, we will define a lot in factor model for modeling social topical relationship.",
                    "label": 0
                },
                {
                    "sent": "What we consider as input is directed graph where nodes are users and the Lincoln Code the following information.",
                    "label": 0
                },
                {
                    "sent": "So a link goes from you to rule if you follow through and we also assume that for each user we have a bug official adopted by the user.",
                    "label": 0
                },
                {
                    "sent": "This can be hashtag on Twitter tag some figure as we will see in awhile or product shared and we assume there is some kind of emulation process.",
                    "label": 0
                },
                {
                    "sent": "For example you see a bit.",
                    "label": 0
                },
                {
                    "sent": "You see an ash tag and you start adopting it.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the following the common bond and eventually tear accompanied entity theory.",
                    "label": 0
                },
                {
                    "sent": "In this example, we can devise three communities, the blue, the blue one is clearly high as a high density and is clearly like reciprocal.",
                    "label": 0
                },
                {
                    "sent": "So our assumption is that bond based communities tend to have high density and reciprocal links, while the other two communities.",
                    "label": 1
                },
                {
                    "sent": "If you look well, the form around two nodes, the nodes four and the Note 7 cause.",
                    "label": 1
                },
                {
                    "sent": "They are authoritive user authoritative user, so in our assumption is that identity based communities tend to exhibit A clear directionality in the link.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We propose to explain and the structure of the network that means the links and the adoption of the feature with unique model based on the Latin factors and we model the degree of involvement of each user in this certain factors with three components, is authority is a suspect ability that you can read US interests and social attitude and.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Components are model and as multinomial distribution over the user set.",
                    "label": 0
                },
                {
                    "sent": "For example, in the blue blue Community you can see that they all share a social attitude, while the green community.",
                    "label": 0
                },
                {
                    "sent": "The Note 4 and then five have high probability of incoming links, so they are considering authority while they not show up as high probability of outgoing links.",
                    "label": 0
                },
                {
                    "sent": "So can we consider general interested in the topics shared in the community too?",
                    "label": 0
                },
                {
                    "sent": "And to complete the.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Teacher we need also to go on the official level.",
                    "label": 0
                },
                {
                    "sent": "I want assumption is that the identity based community there are the topical one tend to have low entropy on the set of features, and for example, if you consider the.",
                    "label": 1
                },
                {
                    "sent": "Orange community you will see that the most widely used feature is big and you have low entropy, while if you go on the blue community you have Max and so uniform probability of adopting adopting each feature.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Based on all this intuition, we can define the Latin factor, a generative model.",
                    "label": 0
                },
                {
                    "sent": "And our idea is that we want to model.",
                    "label": 0
                },
                {
                    "sent": "The observed social link and the adoption of feature bands, reducing Latin factors or communities, and in particular an this Latin Factors act on the source and destination of the links and on the user identity on the user and entity on the feature.",
                    "label": 0
                },
                {
                    "sent": "When you want to model feature user base.",
                    "label": 0
                },
                {
                    "sent": "So for each link observed link we want to model the likelihood that exists a Community K for which.",
                    "label": 1
                },
                {
                    "sent": "You assign probability to be a source and we assign probabilities to be a destination.",
                    "label": 0
                },
                {
                    "sent": "And overall the overall model is governed by this components.",
                    "label": 1
                },
                {
                    "sent": "First we have a multinomial distribution of a lot.",
                    "label": 1
                },
                {
                    "sent": "In fact or communities.",
                    "label": 0
                },
                {
                    "sent": "So basically we're all a Dyson will be collected communities for each observer, the link, and for each observer feature adoption.",
                    "label": 1
                },
                {
                    "sent": "And then we regulate the involvement of user with the authoritie authoritie distribution over the user set a general interest distribution and the social attitude distribution.",
                    "label": 0
                },
                {
                    "sent": "And you can see that the authority distribution acts place at all on the user is receiving the link, so it's incoming link, while the general interest acts on the user establishing the link and the social attitude plays on them both so that the probability.",
                    "label": 0
                },
                {
                    "sent": "Over link from you to view is equal to the probability of you to.",
                    "label": 0
                },
                {
                    "sent": "Then we have a link labelling component that says as the proportion of topical and social link within each community and a topical role that tell us how user act in this community.",
                    "label": 0
                },
                {
                    "sent": "If they are by emulation or if they act by their own interest.",
                    "label": 1
                },
                {
                    "sent": "And to complete the picture to complete the future space, we have a multinomial distribution of over the feature set.",
                    "label": 0
                },
                {
                    "sent": "And let's let's run the generative model together.",
                    "label": 1
                },
                {
                    "sent": "So we want to generate a link fast with Lala is saying we pick a Latin community, say K, then for the link we have to decide if it's social of topical.",
                    "label": 0
                },
                {
                    "sent": "If it's social, the endpoint both the endpoints of the connection are generated by the social component and you can see that the probability will be received and symmetric if it's topical instead the.",
                    "label": 0
                },
                {
                    "sent": "Probably the source of the node.",
                    "label": 0
                },
                {
                    "sent": "Establishing the link will be generated by the interest component, while the identity of the user re signing the link will be generated by the authority component.",
                    "label": 0
                },
                {
                    "sent": "And this is a full generative bias and generative model, and the use of conjugate priors makes the inference more easier.",
                    "label": 0
                },
                {
                    "sent": "So we can devise a collapsed with sampling procedure, and you can find details.",
                    "label": 0
                },
                {
                    "sent": "So within the pair button implement it very easily.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At Link prediction or runtime, it's a three step process.",
                    "label": 0
                },
                {
                    "sent": "First thing we need to come up with a set of recommendation.",
                    "label": 0
                },
                {
                    "sent": "Second step is to understand the nature of the sender relationship between the pastor recommend and and the current user and the test step is generating explanation.",
                    "label": 0
                },
                {
                    "sent": "So the probability of observing a link can be computed like a mixture of social and topical affinity.",
                    "label": 0
                },
                {
                    "sent": "To be clear, at prediction time we take into account both of these components and the same things happen.",
                    "label": 0
                },
                {
                    "sent": "For example, for the adoption of feature when we consider the overall topical involvement of the user in the considered a community and then after computing the likelihood of each link for the current user, we can sort them in descending order and for example, selecting the top K. Now we move.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For the next phase, we want to understand the nature of the relationship between the recommended user and the current one.",
                    "label": 0
                },
                {
                    "sent": "So essentially we ask the model to classify the links as social and topical and the link is social.",
                    "label": 0
                },
                {
                    "sent": "If there is at least a social community in which both the user are part of our highly active.",
                    "label": 1
                },
                {
                    "sent": "While it's consider a stock is considered topical if they are part of a community, if their partner.",
                    "label": 0
                },
                {
                    "sent": "If one is an authoritative and one is acceptable in a common community and these are Bernoulli probability, what we do?",
                    "label": 0
                },
                {
                    "sent": "We compute them and we take the monks.",
                    "label": 0
                },
                {
                    "sent": "So assume that the connection the model says that.",
                    "label": 0
                },
                {
                    "sent": "Connection is social.",
                    "label": 0
                },
                {
                    "sent": "The most.",
                    "label": 0
                },
                {
                    "sent": "The most immediate way of generating explanation is to pick up a common common common set of friends in the active in the community to explain the link, while if it's topical, the recommendation should be provided as a set of features that characterize the authoritative authority and interest of the current user.",
                    "label": 1
                },
                {
                    "sent": "For evaluating.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The model we rely on.",
                    "label": 0
                },
                {
                    "sent": "Flickr and Twitter data and on Twitter the feature dash tag while on Trigger are the tags and the Flickr data.",
                    "label": 0
                },
                {
                    "sent": "That is nice because it gives us a kind of ground truth for labelling.",
                    "label": 0
                },
                {
                    "sent": "So on the Flickr system a user can say if each connection is a friend or a family and we consider them as social.",
                    "label": 0
                },
                {
                    "sent": "If says no, we don't see them at topical and.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The first step is to evaluate the model.",
                    "label": 0
                },
                {
                    "sent": "Works only in prediction and on Twitter we run a Monte Carlo 5 cross validation and figure.",
                    "label": 1
                },
                {
                    "sent": "Since we have the timestamp we go for a chronological speed and we compete with standard baseline competitors and the joint factorization of the incidence matrix and the visual metrics which you can take as an ancestor of all the Latin factors that you model that you can develop on this data.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As you can see, we missed you there.",
                    "label": 0
                },
                {
                    "sent": "The accuracy with the area under the curve, so the higher the better and we outperform all the competitors for any for any number of topics now.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The next step is to understand if the model works in LINQ labelling, so it's again a binary classification task and the baseline simple baseline in the squash is given by counting the number of common friends and normalizing it by the number of common friends and the common feature.",
                    "label": 0
                },
                {
                    "sent": "And again we achieved pretty good accuracy.",
                    "label": 0
                },
                {
                    "sent": "Finally, what we have to do is to understand very simple things.",
                    "label": 0
                },
                {
                    "sent": "If the model makes sense.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For doing that we compute for example the probability that officially see the social auto pickle and in the first in the boat in the top part you can see that there are featured on the left there are barely wear birthday, wedding and party.",
                    "label": 0
                },
                {
                    "sent": "There are market there are labeled as social and I think we agree and the other feature on the other side, the one that are topical are related to photographic techniques.",
                    "label": 0
                },
                {
                    "sent": "And again since we have communities and we have the social coefficient of our communities and the key works.",
                    "label": 0
                },
                {
                    "sent": "We can check them together and for example the first topic is a Labrador for social and the top keywords are Christmas birthday or made.",
                    "label": 0
                },
                {
                    "sent": "So it's clearly social and the last topic if you can read it's topical and it's about Game of Thrones.",
                    "label": 0
                },
                {
                    "sent": "So what we did let's.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "About what we did in this work, we propose a joint factorization of social connection and feature Association to come up with a way of providing recommendation and also explain them.",
                    "label": 1
                },
                {
                    "sent": "The model is both accurate link prediction and Enlink labelling and then for future works we plan to run some user study to understand the user perception our user respond to this explanation, perhaps in generating explanation.",
                    "label": 1
                },
                {
                    "sent": "We have also to announce the diversity of the explanation and also since the model is our Latin factor, models provide us some kind of Community structure.",
                    "label": 0
                },
                {
                    "sent": "We plan to explore this area and we have some preliminary positive results already in the paper and the similar characterization similar model.",
                    "label": 0
                },
                {
                    "sent": "Can be done with other techniques like math, factorization technique.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This concludes my talk.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your attention and I'll take questions now.",
                    "label": 0
                }
            ]
        }
    }
}