{
    "id": "4eauw4ugcigvvuw6ktrl6skxdhvi7woa",
    "title": "A Media Mixer for online learning: Making learning materials more valuable for their owner and more useful for their consumer",
    "info": {
        "author": [
            "Lyndon Nixon, Department of New Media Technology, MODUL University Vienna"
        ],
        "published": "June 23, 2014",
        "recorded": "April 2014",
        "category": [
            "Top->Social Sciences->Education",
            "Top->Social Sciences->Society->Public Policy"
        ]
    },
    "url": "http://videolectures.net/ocwc2014_nixon_mediamixer/",
    "segmentation": [
        [
            "My name is Linda Nixon, and from the module University in Vienna, Austria and I'm going to give you a short presentation with the Media Mixer project.",
            "This is another European Union 7th Framework programme.",
            "Funded Project is a support action and its main goal is promoting a certain set of innovative technologies for handling multimedia towards the industry.",
            "And of course the relevance for here is because one of our use case partners is videolectures.net which is based as many of you will surely know.",
            "It's based here in the Beyond in Slovenia, so we had a lot of experience on bringing these technologies to the domain of E learning, so this is what I want to briefly cover in this talk, and we also have another talk."
        ],
        [
            "We have another talk in the leader session and actually use case, so this will be a little bit more focused on the project on the technologies and the reasons for it.",
            "And if you're interested in the use case itself more and more to see the demonstrator, we have another talk in the session after lunch on this, so I'm going to do what is Media Mixer is going to give you a little background terms of trends, so why media mixer exists?",
            "In a sense, the trends we see in why we think these technologies are the reaction to it.",
            "I'll briefly introduce to you the use case video lectures.",
            "Mashup hopefully give you a little bit of interest in coming to our second talk later today and also just want me to pick and also maybe offer you if in case you also deal with audio, video, image material in the context of online learning."
        ],
        [
            "So media mixer."
        ],
        [
            "Is first and first of all that group of organizations so you know the research projects have their consortia.",
            "So we have a lot of partners coming from research and industry organizations that are very focused on multimedia research.",
            "So we have the Institutes of Steven who's the partner brings in the videolectures.net use case.",
            "And of course."
        ],
        [
            "It's all about lots and lots of money having been spent by the European Union on lots of research projects.",
            "An area which is called Semantic Multimedia now today is another tutorial and semantic multimedia, so you'll forgive me that I won't go into the technical details, but you benefited annotation for example.",
            "So the idea of describing non textual assets in a way that computers can process.",
            "So it's a very important part of this analysis of media assets is another aspect which enables you to.",
            "Create those annotations and of course media retrieval.",
            "These projects, as I say these are all European Union funded projects that have worked in this area with the partners you show on the previous slide.",
            "So this is all the expertise that they have coming from the research side.",
            "But the issue is that a lot of the technology has not yet crossed the gap into real world industry usage, so part of media mixer is about trying to encourage industry uptake."
        ],
        [
            "So this is a very basic diagram of the media mixer workflow, so you see here on the left hand side you have the analysis tools.",
            "So basically you want to create a little bit called fragments media fragments.",
            "So basically if you think video lectures, which is actually a very good use case for us, there often one hour 2 hour, they're quite long and people might only be interested in a part of that video lecture.",
            "So there really is interested in one segment, or indeed what we call fragment of the lecture.",
            "But he can't really easily get to it, because of course you know you go to the web page with the lectures on you have the two hours and you're searching through it.",
            "So the first thing we look at is how to split this video material into fragments.",
            "Meaningful fragments of fragments at each related to a specific topic or concept.",
            "We annotate them.",
            "Of course, we also do deal with rights management within the within the project.",
            "I won't be talking too much about this today, but we also take into account the fact that you need to often protect.",
            "In the online media.",
            "You store all this information and of course you can now build new types of applications.",
            "On top of this which reuse acquire, search the media descriptions."
        ],
        [
            "So why, I mean is is this really needed?",
            "Because we feel that it is needed."
        ],
        [
            "We see, for example, focusing on video as the main use case, which of course already incorporates audio or reincorporates image.",
            "I mean videos moving image so video online.",
            "The scaler video is growing massively is very interesting in mobile.",
            "And again, mobile is very relevant for the whole fragmente idea because on a mobile device you may not want to be accessing a 2 hour stream.",
            "You really just want to maybe access shorter fragments of the video material so you see a lot of statistics there so.",
            "The main message here is basically that video creation on the web and video consumption is growing at an amazing scale."
        ],
        [
            "Also, using the Internet form education online learning is growing as well.",
            "This is not.",
            "This is nothing new.",
            "I'm sure for you so you look at things that Open University materials on iTunes U 16,000,000 downloads in just four years.",
            "This whole idea of classroom flipping, you know, you watch the lectures at home, so they recorded it online.",
            "You want some at home and then you spend time in class on the exercise.",
            "So there's a shift towards online learning."
        ],
        [
            "And also online video based learning.",
            "Again, I'm sure nothing too too far for you, but we can mention of course, videolectures.net is one of the examples of an online portal to specialized in capturing and then redistributing videos of lectures given at various events or at universities with around.",
            "I'm sure it's probably more than this already, but when I wrote this slide at least I had 25,000 academic videos as the number.",
            "I didn't do."
        ],
        [
            "Anything OK?",
            "So maybe just one comment.",
            "I mean the media mix is very much focused on the industry area and sometimes also media owners very interested about how to share in monitor eyes their content.",
            "So there's a lot of video content online nowadays.",
            "There's an interest in how to effectively re distribute or resell it.",
            "OK, so when I want to talk about, I mean, I told him monitorization.",
            "I know there's not always relevant in this community, but sharing in and of itself, which is basically making it available for free.",
            "But still there's a value it may not be volumes.",
            "We paying some euros or whatever for the content.",
            "This value, for example in reputation.",
            "So University that more widely distributes course materials online, gets reused more by other.",
            "Educational establishments raises the reputation of the University, so whether it's actually monetizing in terms of generating a revenue stream or in just in terms of let's say, non monetary value, there is a there is value basically in having not only having this content online, which is very much so, I would say the main focus also these online video platforms right now.",
            "So we called the content it online great but if you want a real value from this content you still have to tackle the other side of the equation which is how to get it redistributed and reused.",
            "And so this is where media mixer comes."
        ],
        [
            "Then, as we think there is real value in making it easier and more effective to redistribute, reuse online media.",
            "So this is a few examples from other domains.",
            "I mean stock footage is an interesting one.",
            "So basically the fact that, for example, TV producers or film producers, they don't want to go and shoot their own footage the whole time they want to just purchase the footage that somebody else has taken, reuse it and it's growing at a very strong rate.",
            "Another example is."
        ],
        [
            "The images, so get the images basically started by resetting very expensive media content so things like Bundesliga photos to the online sports reports but is now shifted towards what's often called the long tail.",
            "So basically also.",
            "Semi professional photographers can put their video photos up on the site and basically give them permission for resale and the rates are usually very much lower starting it.",
            "Just maybe.",
            "Let me see this is that starting at 25 euros and then people who have blogs or websites or whatever they want to use an image, but they want to make sure that they're doing it legally.",
            "They'll pay out a small amount to get licensed image.",
            "They're happy photographers also help because they get us a bit of the revenue is also remixing."
        ],
        [
            "So another example here, which is a song called the Harlem Shake, which came out last year and well, actually was released several years ago.",
            "As a free track by DJ in New York didn't really pick up on anything but last year some people dressed up in city costumes made a silly dance to the music and it went viral.",
            "Now a lot of if any of you use YouTube to watch music videos, you'll know this very well.",
            "These music owners.",
            "They shut it down, they say not allowing that this is redistricted for free online, but some people say well, no, let it.",
            "We allow it, but we want to have a part of the revenue which is generated by this being used on YouTube.",
            "So like Harlem Shake for example.",
            "They reckon it made the figures on official but people reckon they made several $1,000,000 at least off.",
            "Basically people creating spinoff videos using the audio and then the.",
            "Copyright owner basically saying I take the share of the revenue that is all."
        ],
        [
            "This has to do with E learning.",
            "So first I just want to say that we see these trends not only putting media content online, but a trend towards facilitating its reuser its resale.",
            "Will this fit in with the learning?",
            "Will it look at Mooks so mooks again?",
            "As I'm sure you're very aware, very popular.",
            "Very fixed cost structures, so generally you signed up for a course and there's a non adaptable set of materials that you have for this.",
            "It's behind a registration barrier, even if it's free or fee based and there's some different approaches to weather the licensing, so they're all called open, right?",
            "So one of those is open but was open mean, so here we're open courseware can be lauded, of course, because it very much strongly promotes the true openness in terms of license that allows you to reuse and adapt the materials well.",
            "Although well known books actually do not allow this."
        ],
        [
            "So just one idea before I come to our use case.",
            "So we've been reusing MC material.",
            "Very interested to hear actually.",
            "If people know about cases where this is already happening, so this would be the idea that a learning offer could actually be a remix of content coming from different sources.",
            "So not just one fixed course, but people actually creating their own remixes of the material, which I believe they are permitted to do with open coursework material.",
            "So maybe you can save costs, because rather than recording your own.",
            "Course which has a certain differing structure.",
            "You simply find part of that structure and other materials and then put it together.",
            "You can tailor the learning course to each learner.",
            "And of course you can contain multiple multiple value from a single learning unit because there's no longer solely the part of 1 course in one curriculum, but maybe part of many different types of courses which are available online.",
            "So we have here for Mike Oldfield from the keep learning.",
            "Block you had nice article on this.",
            "The reuse of production is key to positive MC Impact.",
            "So from the media mixer is a project as you can put gas in their focus on that on mixing media and the idea that we believe that actually been able to facility people to remix media which is available for them to remix can be beneficial.",
            "So I want to give an example now with video lectures."
        ],
        [
            "OK, actually I should.",
            "So the thing was so we talked about remixing the material so you can imagine people have all this video material with focuses on video.",
            "You can have large amounts of video material.",
            "And you want to remix it?",
            "So why is why don't we just do that?",
            "Why don't we just start?",
            "Well, the main issue one of the main issues first of all is that it's not that easy to do their remixing right now, because you're probably going to be searching manually through all this material to find the parts that you need, right?",
            "So a lot of text here, I don't wanna be reading all of it, but the main question is here is how easy.",
            "How easy is it to find?",
            "Again the digital media we produce and store, so we consider the lecture side with 25,000 videos.",
            "And now we want a few.",
            "Parts of lectures which are mentioning a certain topic.",
            "How easy is it really to find those parts?",
            "Indicating that case, for example, they're using any title and description, so text search of media generally looks for matches on text associated to media on its metadata.",
            "So you're indexing these videos in terms of things that their titles and their descriptions, but the descriptive text doesn't contain everything that's within the within the lecture itself, so I just think it's here in the in this text.",
            "This is where, for example, the previous talk comes in very relevant, because if you have a transcript of the video, then computers can also process the textual content and help you more richly annotate the entire lecture from beginning to end based on his transcript.",
            "And this is a lot more in depth than just having just using the textual description for search in a media repository."
        ],
        [
            "So I get another question.",
            "How easy is it to offer the annotated media across organizational boundaries so visible for reuse?",
            "A lot of organizations are already have, of course, media for elearning, so managed videos.",
            "They can also be all the different associated materials that they produce for courses, but how?",
            "Reusable all those materials and often organizations are not even thinking about reuse, so they're just stored on their own in servers internally.",
            "There's no, there's no way that anyone else can actually find these materials, even you put them online, you might be relying busy on Google Search, for example.",
            "No search engine optimization as a means for people to re find your content.",
            "So in terms of having a better annotation of these materials and having systems that can search across materials using those annotations, you would actually be able to facility better reuse across organizational.",
            "Bounderies"
        ],
        [
            "So quick summary of the technologies, so again it will not get technical here.",
            "I just want to give you a few buzzwords so metadata is very important in the world of media.",
            "So let's say you have lots of video, let's say from your organization you put it online and you want people to be able to use it.",
            "So probably you need to have some metadata exposed about this media as well.",
            "'cause it helps computer systems provide a better search and retrieval across the content.",
            "Now, computers actually only tend to recognize what's called low level features, so things like color and shape in video.",
            "But as humans we don't query in terms of those features we create in terms of high level concepts or events, so we're using we're searching for Nikola Tesla for example.",
            "So.",
            "Which is often called the semantic gap, right?",
            "So if somebody is showing a picture of Nikola Tesla on a frame of a video, the computer itself cannot immediately without, let's say, additional help know that that's Nikola Tesla in the picture.",
            "So a lot of research and development goes into how to teach computers to recognize concepts or event."
        ],
        [
            "Within media, so if you're Google, of course you can just use the huge amount of video you have and you can teach yourself to recognize concepts so they're very proud to announce that they can now recognize cats in YouTube videos.",
            "So this is.",
            "This is somehow funny, but also raise significant because you have to consider a computer recognizing a cat is not actually so easy, right?",
            "So the human brain does a much better job of This is why neural networks are actually systems that are built to sort of emulate how the human brain functions.",
            "That's why they get it.",
            "So make cats appear at different angles and sizes and shapes and colors and whatever.",
            "So actually the computer system can identify cats within video is actually an achievement.",
            "We might not be as far as that."
        ],
        [
            "In our world, but for example, one of our media mixer partners has been working on video lecture material and doing what they call concept detection so they can define certain types of concept that occurs.",
            "So you know the typical things are thing.",
            "Our lecturer, whiteboard audience, desk shirt, so they have a concept detector for white shirt.",
            "If you're interested in other white shirts that appear on on video lectures, we have a demo on this, so this is for example a set of video shots.",
            "Retrieve for the concept lecture an bored.",
            "Here's one of the fragments playing back and you see also."
        ],
        [
            "They show you the concept detection results.",
            "You can see that it identified with almost 100% certainty things like Blackboard lecture, classroom, Mailperson, Ampitheatre.",
            "So at this sort of very generic concept level, there's already quite a lot of mature research.",
            "Being able to automatically detect these types of concepts within video.",
            "But The thing is, of course.",
            "People are not generally searching for give me video lectures with lecture notes.",
            "It's fair, so concept detection is a very nice piece of work that can also help help a computer system to handle media assets.",
            "But if you want to get to the level of the typical search terms across the learning materials, this is still not precise enough."
        ],
        [
            "So what you really need is textual metadata.",
            "Traditionally, this has been generated more or less manually, so if you've worked with Mediaset systems, you'll know this when you upload a video to the system, then you generally get it like a form and it says you input the title input, the description, maybe some tags, whatever.",
            "Do you like experts who are actually taking care of the manual entry of this?",
            "Would you get a lot of metadata being produced automatically now?",
            "Increasingly and again, this is where stuff like the previous talk or the Trans Lectures project as well come in.",
            "So if you can get a transcript of the video lecture, then you have a huge amount of text which contains a lot of very relevant concepts.",
            "So the difference of the lecture is talking about in there and then you can actually use this for a better."
        ],
        [
            "Nation, so there's a thing called named entity recognition.",
            "There's a number of online services for this, and what it does is actually extract entities out of natural language text.",
            "So you need this extra level because natural language text is still ambiguous, and again, you can see this, you already have very nice search across transcripts as well.",
            "I mean, you might have seen it already on YouTube, they have this using automated transcripts and you can search within them, but again, there's ambiguity related, So what this set of technologies tries to do this so called any R services is trying to reduce ambiguity.",
            "By identifying.",
            "Substrings and linking them to actually distinct unique entities.",
            "So they tried to map, so you might have given example, you might have different strings like President George Bush, George Bush, GW Bush, George Bush, junior so on and in any our system.",
            "Assuming of course it works perfectly.",
            "All of these different substrings would be labeled by the service to the single single same unique entity which identifies the President George W Bush.",
            "So this move towards global unique identification.",
            "There's there's a lot of interesting web based approaches to this.",
            "One of them just give you the discord linked data and we use linked data a lot within media mixer.",
            "And LinkedIn is a solution towards this global unique identification of concepts because otherwise you still have the same ambiguities that happened with natural language text."
        ],
        [
            "So just a summary on the metadata side, so method is very important if you happen to be working a lot with media assets, for example E Learning videos.",
            "So the more metadata, the better retrieval you can support or the better reuse.",
            "You can create it more and more manually, but it's more costly of course.",
            "Or you can go to more automated creation, but you will software less accuracy, so there's always the question of what's important for you.",
            "Google also is not completely accurate in its search results, but nobody cares, right?",
            "So they get what they looking for.",
            "Mostly all the same.",
            "So you might you might want to move away from trying to manually annotate everything, because we consider a system where you have hours and hours of video lectures being uploaded every every day.",
            "You're not going to achieve cost effectiveness by having somebody manually annotating everything, so you want to do automated transcription, for example, then entity recognition dump all these into a metadata report."
        ],
        [
            "Story and then use that so we have these different technologies and media mixer which I'm not presenting today, but if anyone's interested you can of course just talk to us about it.",
            "So first of utilities for the fragmentation of the video.",
            "So first of all, as I said, people are often uninterested in the two hours, so interested in 5 minutes which talks about the topic they're looking to learn about, so we have different approaches to split these video lectures up into fragments."
        ],
        [
            "And then to annotate them.",
            "And as I say this, what we annotate, actually with our unique, the identified entities, and these are part of a knowledge model, so we actually get additional information about them that we would know that George W Bush is actually an instance of AUS president.",
            "So we could actually associate him with Barack Obama because we know that he's also US President.",
            "So there's all these knowledge models as well, which also online basically for free, that we can link into.",
            "When we do this."
        ],
        [
            "So as I say.",
            "You would generate this metadata and you can have this in a separate store alongside your repository for national media assets.",
            "When you let people create by by the topics over the entities, so again, the media mixer we've moved away from this pure search as toy textual search.",
            "So things we just index or the text that you've got and then match against the text.",
            "Because you have this, the usual issues about ambiguities of natural language, so we actually map everything into a higher level set of entities and then match on the entities.",
            "So to get the effect of retrieval, you need this good query for formulation.",
            "So as I say, we are mapping everything to controlled vocabularies, so we normalize or map the free text to the vocabulary terms.",
            "Do you have different approaches?",
            "Also for better search.",
            "So to intuitively iteratively improve search, you can do things like having no system the machine learning so that the computer system learns overtime that people who search on this term went to these lectures.",
            "So this is more relevant, suggest queries so things like just auto fill in people type.",
            "They already get suggestions what they might be searching for.",
            "Our drill down search so give them a set of search results and then give them options.",
            "Did you mean George W Bush, junior or senior?",
            "And they say actually I'm in senior and then they get another set of results.",
            "So maybe over a few cycles they get a drill down to the most relevant material for."
        ],
        [
            "M. And in our case the result set isn't a set of videos, it's a set of video fragments, so they don't just get a set of two hour lectures and then have to still find within that lecture where was the part they actually were looking for that.",
            "But talking to the topic they're interested in.",
            "So if a demo here, I mean you're free to look at it Media Mixer dot useless Jukebox and basically this just creates a playlist of the different video fragments and place them back one after each other so you get like a like a mashup of.",
            "Lectures mentioning a certain topic.",
            "So."
        ],
        [
            "An example with the video lectures site."
        ],
        [
            "So we have a talk, biological or bioinformatics talk.",
            "So we create the video fragments so you can see here.",
            "I mean, I'm not sure how long the talk was, I see I just give you give you the first column.",
            "I'm sorry, but the switching I think this is just my adapter but.",
            "So we used the slide synchronization timelines of elections already knows, has an XML file.",
            "When the slides switch.",
            "So this is a very nice way to split the lecture up into, let's say distinct topical parts.",
            "So so basically here we have the fragments, so we know that the fragment only the basic unit of life.",
            "The cell starts at 5 minutes, 12 inches at 5 minutes 46.",
            "We have transcripts here to see if the EU project Trans Lectures, which were Parson also spit across the fragments.",
            "So we know that we know which.",
            "Text was spoken by the lecturer during that video fragment."
        ],
        [
            "And we annotate.",
            "So again, we as I said, we are extracting topics from the textual metadata.",
            "So for example, during this slide on the Three Kingdoms of Live, the lecture as mentioned, the various kingdoms agreeing arkeia.",
            "Just annotate using this.",
            "The textual string Arcadia.",
            "We use a global unique identifier which is being being drawn from vocal Bickel DB Pedia.",
            "DB Pedia is very nice.",
            "It's basically a structured metadata version of Wikipedia so it takes all the information from Wikipedia and convert into a format which can be machine processable.",
            "So with behind the URL.",
            "For the DB Pedia concept of Arcadia, there's a lot of metadata about what are Kia is."
        ],
        [
            "So here for example.",
            "A search on LCD, plasma and LCD plasma.",
            "Again, we map this again to the entity in DB Pedia and the DVD NTSC plasma has metadata which says for example, it's a type of Archaea.",
            "So we now know that the search in the city plasma is relevant to the video fragment, which is annotated with the term arkeia.",
            "So this person has not searched for the for K at all, but they will still get the video fragment returned to them in the results."
        ],
        [
            "So we can do video play fragmente playback.",
            "This is also being being implemented so for the web people here his team of five I'm mostly most of the recent browsers are now supporting natively media fragments, so meaning that media privacy means being able to say play me 10 seconds of video.",
            "Right?",
            "Yeah, if you have the URL of the video you just go to URL and you get the whole video.",
            "But now there's actually a way to say give me those 10 seconds.",
            "And we have it in a in a separate form, but of course you could actually packaged together into one linear stream, and this is an idea.",
            "For example things like mobile or or even smart TV, where you could just maybe sit back and say, play me back all the fragments about this topic.",
            "And I'll happily sit and watch watch that."
        ],
        [
            "OK, so.",
            "I run through that reasonably quickly.",
            "I hope it was possible to follow the main message here.",
            "Is that compared to the current state of the art for online video especially.",
            "Also the elearning video platforms where we see that you access videos as atomic objects so you access the entire video and it's often very difficult to find within the video the parts you might be more interested in in terms of researching a certain topic and you'll see more of that in this.",
            "After launching the video lectures talk because we'll actually compare the current video lectures platform with our prototype implementation video lectures mashup through this fragmentation of media, annotation of media and then semantic retrieval of media.",
            "So these are different technologies that the media mixer partners have done a lot of development on and are now actually promoting actively towards industry.",
            "So we're also interested in anyone who's working here with audio, image, video material.",
            "It's interesting technology, so we're here to support you in understanding what disabilities can do and how to implement them in your systems.",
            "You'll see that with video lectures macshop after lunch.",
            "So I just want to point."
        ],
        [
            "Due to a few resources now in media Mixer before I close, so we have a community portal.",
            "Basically here we collect together all the materials.",
            "We have all the information we have with the technologies, so it's Community dot media mixer dot EU.",
            "And we have the we have the use cases we have links to demonstrators, tutorials, presentations, software specifications."
        ],
        [
            "We've also had been holding webinars, so it's medium mixer.edu/live.",
            "I think the webinars are very nice if you want to have a very quick introduction to everything, so it's not always that easy to you know to go through other peoples slides to download documents and start reading them, but with the web and now you can sit back and the technical webinars or up to one hour, but the use case weapons are quite short, so I think the very last one was on the learning use case.",
            "This is also at this web page and I think it's it's around 15 or 17 minutes so.",
            "It's very brief.",
            "It's very informative.",
            "If you just want to get a quick insight, further insight into the into we're doing in media Mixer.",
            "All those videos are online hosted at videolectures.net."
        ],
        [
            "And with that, I think I've spoken enough out to leave some time for any questions you may have, so I'd like to thank you for your attention and just to mention also we have a table here.",
            "So just to the right of the registration desk next to the Slovenian Post banner.",
            "And my colleague Tonya will be around there during the breaks, so you can also come and find us there and please come back again after lunch to the view lectures mashup talk in the think of the research track."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My name is Linda Nixon, and from the module University in Vienna, Austria and I'm going to give you a short presentation with the Media Mixer project.",
                    "label": 0
                },
                {
                    "sent": "This is another European Union 7th Framework programme.",
                    "label": 0
                },
                {
                    "sent": "Funded Project is a support action and its main goal is promoting a certain set of innovative technologies for handling multimedia towards the industry.",
                    "label": 0
                },
                {
                    "sent": "And of course the relevance for here is because one of our use case partners is videolectures.net which is based as many of you will surely know.",
                    "label": 0
                },
                {
                    "sent": "It's based here in the Beyond in Slovenia, so we had a lot of experience on bringing these technologies to the domain of E learning, so this is what I want to briefly cover in this talk, and we also have another talk.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have another talk in the leader session and actually use case, so this will be a little bit more focused on the project on the technologies and the reasons for it.",
                    "label": 0
                },
                {
                    "sent": "And if you're interested in the use case itself more and more to see the demonstrator, we have another talk in the session after lunch on this, so I'm going to do what is Media Mixer is going to give you a little background terms of trends, so why media mixer exists?",
                    "label": 0
                },
                {
                    "sent": "In a sense, the trends we see in why we think these technologies are the reaction to it.",
                    "label": 0
                },
                {
                    "sent": "I'll briefly introduce to you the use case video lectures.",
                    "label": 0
                },
                {
                    "sent": "Mashup hopefully give you a little bit of interest in coming to our second talk later today and also just want me to pick and also maybe offer you if in case you also deal with audio, video, image material in the context of online learning.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So media mixer.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is first and first of all that group of organizations so you know the research projects have their consortia.",
                    "label": 0
                },
                {
                    "sent": "So we have a lot of partners coming from research and industry organizations that are very focused on multimedia research.",
                    "label": 1
                },
                {
                    "sent": "So we have the Institutes of Steven who's the partner brings in the videolectures.net use case.",
                    "label": 0
                },
                {
                    "sent": "And of course.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's all about lots and lots of money having been spent by the European Union on lots of research projects.",
                    "label": 0
                },
                {
                    "sent": "An area which is called Semantic Multimedia now today is another tutorial and semantic multimedia, so you'll forgive me that I won't go into the technical details, but you benefited annotation for example.",
                    "label": 0
                },
                {
                    "sent": "So the idea of describing non textual assets in a way that computers can process.",
                    "label": 0
                },
                {
                    "sent": "So it's a very important part of this analysis of media assets is another aspect which enables you to.",
                    "label": 1
                },
                {
                    "sent": "Create those annotations and of course media retrieval.",
                    "label": 0
                },
                {
                    "sent": "These projects, as I say these are all European Union funded projects that have worked in this area with the partners you show on the previous slide.",
                    "label": 0
                },
                {
                    "sent": "So this is all the expertise that they have coming from the research side.",
                    "label": 0
                },
                {
                    "sent": "But the issue is that a lot of the technology has not yet crossed the gap into real world industry usage, so part of media mixer is about trying to encourage industry uptake.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is a very basic diagram of the media mixer workflow, so you see here on the left hand side you have the analysis tools.",
                    "label": 0
                },
                {
                    "sent": "So basically you want to create a little bit called fragments media fragments.",
                    "label": 0
                },
                {
                    "sent": "So basically if you think video lectures, which is actually a very good use case for us, there often one hour 2 hour, they're quite long and people might only be interested in a part of that video lecture.",
                    "label": 0
                },
                {
                    "sent": "So there really is interested in one segment, or indeed what we call fragment of the lecture.",
                    "label": 0
                },
                {
                    "sent": "But he can't really easily get to it, because of course you know you go to the web page with the lectures on you have the two hours and you're searching through it.",
                    "label": 0
                },
                {
                    "sent": "So the first thing we look at is how to split this video material into fragments.",
                    "label": 0
                },
                {
                    "sent": "Meaningful fragments of fragments at each related to a specific topic or concept.",
                    "label": 0
                },
                {
                    "sent": "We annotate them.",
                    "label": 0
                },
                {
                    "sent": "Of course, we also do deal with rights management within the within the project.",
                    "label": 0
                },
                {
                    "sent": "I won't be talking too much about this today, but we also take into account the fact that you need to often protect.",
                    "label": 0
                },
                {
                    "sent": "In the online media.",
                    "label": 0
                },
                {
                    "sent": "You store all this information and of course you can now build new types of applications.",
                    "label": 0
                },
                {
                    "sent": "On top of this which reuse acquire, search the media descriptions.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So why, I mean is is this really needed?",
                    "label": 0
                },
                {
                    "sent": "Because we feel that it is needed.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We see, for example, focusing on video as the main use case, which of course already incorporates audio or reincorporates image.",
                    "label": 0
                },
                {
                    "sent": "I mean videos moving image so video online.",
                    "label": 0
                },
                {
                    "sent": "The scaler video is growing massively is very interesting in mobile.",
                    "label": 1
                },
                {
                    "sent": "And again, mobile is very relevant for the whole fragmente idea because on a mobile device you may not want to be accessing a 2 hour stream.",
                    "label": 0
                },
                {
                    "sent": "You really just want to maybe access shorter fragments of the video material so you see a lot of statistics there so.",
                    "label": 0
                },
                {
                    "sent": "The main message here is basically that video creation on the web and video consumption is growing at an amazing scale.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also, using the Internet form education online learning is growing as well.",
                    "label": 1
                },
                {
                    "sent": "This is not.",
                    "label": 0
                },
                {
                    "sent": "This is nothing new.",
                    "label": 0
                },
                {
                    "sent": "I'm sure for you so you look at things that Open University materials on iTunes U 16,000,000 downloads in just four years.",
                    "label": 0
                },
                {
                    "sent": "This whole idea of classroom flipping, you know, you watch the lectures at home, so they recorded it online.",
                    "label": 0
                },
                {
                    "sent": "You want some at home and then you spend time in class on the exercise.",
                    "label": 1
                },
                {
                    "sent": "So there's a shift towards online learning.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And also online video based learning.",
                    "label": 1
                },
                {
                    "sent": "Again, I'm sure nothing too too far for you, but we can mention of course, videolectures.net is one of the examples of an online portal to specialized in capturing and then redistributing videos of lectures given at various events or at universities with around.",
                    "label": 0
                },
                {
                    "sent": "I'm sure it's probably more than this already, but when I wrote this slide at least I had 25,000 academic videos as the number.",
                    "label": 0
                },
                {
                    "sent": "I didn't do.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Anything OK?",
                    "label": 0
                },
                {
                    "sent": "So maybe just one comment.",
                    "label": 0
                },
                {
                    "sent": "I mean the media mix is very much focused on the industry area and sometimes also media owners very interested about how to share in monitor eyes their content.",
                    "label": 0
                },
                {
                    "sent": "So there's a lot of video content online nowadays.",
                    "label": 0
                },
                {
                    "sent": "There's an interest in how to effectively re distribute or resell it.",
                    "label": 1
                },
                {
                    "sent": "OK, so when I want to talk about, I mean, I told him monitorization.",
                    "label": 0
                },
                {
                    "sent": "I know there's not always relevant in this community, but sharing in and of itself, which is basically making it available for free.",
                    "label": 0
                },
                {
                    "sent": "But still there's a value it may not be volumes.",
                    "label": 0
                },
                {
                    "sent": "We paying some euros or whatever for the content.",
                    "label": 0
                },
                {
                    "sent": "This value, for example in reputation.",
                    "label": 0
                },
                {
                    "sent": "So University that more widely distributes course materials online, gets reused more by other.",
                    "label": 0
                },
                {
                    "sent": "Educational establishments raises the reputation of the University, so whether it's actually monetizing in terms of generating a revenue stream or in just in terms of let's say, non monetary value, there is a there is value basically in having not only having this content online, which is very much so, I would say the main focus also these online video platforms right now.",
                    "label": 0
                },
                {
                    "sent": "So we called the content it online great but if you want a real value from this content you still have to tackle the other side of the equation which is how to get it redistributed and reused.",
                    "label": 0
                },
                {
                    "sent": "And so this is where media mixer comes.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then, as we think there is real value in making it easier and more effective to redistribute, reuse online media.",
                    "label": 0
                },
                {
                    "sent": "So this is a few examples from other domains.",
                    "label": 0
                },
                {
                    "sent": "I mean stock footage is an interesting one.",
                    "label": 0
                },
                {
                    "sent": "So basically the fact that, for example, TV producers or film producers, they don't want to go and shoot their own footage the whole time they want to just purchase the footage that somebody else has taken, reuse it and it's growing at a very strong rate.",
                    "label": 0
                },
                {
                    "sent": "Another example is.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The images, so get the images basically started by resetting very expensive media content so things like Bundesliga photos to the online sports reports but is now shifted towards what's often called the long tail.",
                    "label": 0
                },
                {
                    "sent": "So basically also.",
                    "label": 0
                },
                {
                    "sent": "Semi professional photographers can put their video photos up on the site and basically give them permission for resale and the rates are usually very much lower starting it.",
                    "label": 0
                },
                {
                    "sent": "Just maybe.",
                    "label": 0
                },
                {
                    "sent": "Let me see this is that starting at 25 euros and then people who have blogs or websites or whatever they want to use an image, but they want to make sure that they're doing it legally.",
                    "label": 0
                },
                {
                    "sent": "They'll pay out a small amount to get licensed image.",
                    "label": 0
                },
                {
                    "sent": "They're happy photographers also help because they get us a bit of the revenue is also remixing.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So another example here, which is a song called the Harlem Shake, which came out last year and well, actually was released several years ago.",
                    "label": 0
                },
                {
                    "sent": "As a free track by DJ in New York didn't really pick up on anything but last year some people dressed up in city costumes made a silly dance to the music and it went viral.",
                    "label": 1
                },
                {
                    "sent": "Now a lot of if any of you use YouTube to watch music videos, you'll know this very well.",
                    "label": 0
                },
                {
                    "sent": "These music owners.",
                    "label": 0
                },
                {
                    "sent": "They shut it down, they say not allowing that this is redistricted for free online, but some people say well, no, let it.",
                    "label": 0
                },
                {
                    "sent": "We allow it, but we want to have a part of the revenue which is generated by this being used on YouTube.",
                    "label": 1
                },
                {
                    "sent": "So like Harlem Shake for example.",
                    "label": 0
                },
                {
                    "sent": "They reckon it made the figures on official but people reckon they made several $1,000,000 at least off.",
                    "label": 0
                },
                {
                    "sent": "Basically people creating spinoff videos using the audio and then the.",
                    "label": 0
                },
                {
                    "sent": "Copyright owner basically saying I take the share of the revenue that is all.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This has to do with E learning.",
                    "label": 0
                },
                {
                    "sent": "So first I just want to say that we see these trends not only putting media content online, but a trend towards facilitating its reuser its resale.",
                    "label": 0
                },
                {
                    "sent": "Will this fit in with the learning?",
                    "label": 0
                },
                {
                    "sent": "Will it look at Mooks so mooks again?",
                    "label": 0
                },
                {
                    "sent": "As I'm sure you're very aware, very popular.",
                    "label": 0
                },
                {
                    "sent": "Very fixed cost structures, so generally you signed up for a course and there's a non adaptable set of materials that you have for this.",
                    "label": 0
                },
                {
                    "sent": "It's behind a registration barrier, even if it's free or fee based and there's some different approaches to weather the licensing, so they're all called open, right?",
                    "label": 1
                },
                {
                    "sent": "So one of those is open but was open mean, so here we're open courseware can be lauded, of course, because it very much strongly promotes the true openness in terms of license that allows you to reuse and adapt the materials well.",
                    "label": 0
                },
                {
                    "sent": "Although well known books actually do not allow this.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So just one idea before I come to our use case.",
                    "label": 0
                },
                {
                    "sent": "So we've been reusing MC material.",
                    "label": 0
                },
                {
                    "sent": "Very interested to hear actually.",
                    "label": 0
                },
                {
                    "sent": "If people know about cases where this is already happening, so this would be the idea that a learning offer could actually be a remix of content coming from different sources.",
                    "label": 1
                },
                {
                    "sent": "So not just one fixed course, but people actually creating their own remixes of the material, which I believe they are permitted to do with open coursework material.",
                    "label": 0
                },
                {
                    "sent": "So maybe you can save costs, because rather than recording your own.",
                    "label": 0
                },
                {
                    "sent": "Course which has a certain differing structure.",
                    "label": 0
                },
                {
                    "sent": "You simply find part of that structure and other materials and then put it together.",
                    "label": 1
                },
                {
                    "sent": "You can tailor the learning course to each learner.",
                    "label": 0
                },
                {
                    "sent": "And of course you can contain multiple multiple value from a single learning unit because there's no longer solely the part of 1 course in one curriculum, but maybe part of many different types of courses which are available online.",
                    "label": 1
                },
                {
                    "sent": "So we have here for Mike Oldfield from the keep learning.",
                    "label": 0
                },
                {
                    "sent": "Block you had nice article on this.",
                    "label": 0
                },
                {
                    "sent": "The reuse of production is key to positive MC Impact.",
                    "label": 0
                },
                {
                    "sent": "So from the media mixer is a project as you can put gas in their focus on that on mixing media and the idea that we believe that actually been able to facility people to remix media which is available for them to remix can be beneficial.",
                    "label": 0
                },
                {
                    "sent": "So I want to give an example now with video lectures.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, actually I should.",
                    "label": 0
                },
                {
                    "sent": "So the thing was so we talked about remixing the material so you can imagine people have all this video material with focuses on video.",
                    "label": 0
                },
                {
                    "sent": "You can have large amounts of video material.",
                    "label": 0
                },
                {
                    "sent": "And you want to remix it?",
                    "label": 0
                },
                {
                    "sent": "So why is why don't we just do that?",
                    "label": 0
                },
                {
                    "sent": "Why don't we just start?",
                    "label": 0
                },
                {
                    "sent": "Well, the main issue one of the main issues first of all is that it's not that easy to do their remixing right now, because you're probably going to be searching manually through all this material to find the parts that you need, right?",
                    "label": 0
                },
                {
                    "sent": "So a lot of text here, I don't wanna be reading all of it, but the main question is here is how easy.",
                    "label": 0
                },
                {
                    "sent": "How easy is it to find?",
                    "label": 1
                },
                {
                    "sent": "Again the digital media we produce and store, so we consider the lecture side with 25,000 videos.",
                    "label": 1
                },
                {
                    "sent": "And now we want a few.",
                    "label": 0
                },
                {
                    "sent": "Parts of lectures which are mentioning a certain topic.",
                    "label": 0
                },
                {
                    "sent": "How easy is it really to find those parts?",
                    "label": 0
                },
                {
                    "sent": "Indicating that case, for example, they're using any title and description, so text search of media generally looks for matches on text associated to media on its metadata.",
                    "label": 1
                },
                {
                    "sent": "So you're indexing these videos in terms of things that their titles and their descriptions, but the descriptive text doesn't contain everything that's within the within the lecture itself, so I just think it's here in the in this text.",
                    "label": 0
                },
                {
                    "sent": "This is where, for example, the previous talk comes in very relevant, because if you have a transcript of the video, then computers can also process the textual content and help you more richly annotate the entire lecture from beginning to end based on his transcript.",
                    "label": 0
                },
                {
                    "sent": "And this is a lot more in depth than just having just using the textual description for search in a media repository.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I get another question.",
                    "label": 0
                },
                {
                    "sent": "How easy is it to offer the annotated media across organizational boundaries so visible for reuse?",
                    "label": 1
                },
                {
                    "sent": "A lot of organizations are already have, of course, media for elearning, so managed videos.",
                    "label": 0
                },
                {
                    "sent": "They can also be all the different associated materials that they produce for courses, but how?",
                    "label": 0
                },
                {
                    "sent": "Reusable all those materials and often organizations are not even thinking about reuse, so they're just stored on their own in servers internally.",
                    "label": 0
                },
                {
                    "sent": "There's no, there's no way that anyone else can actually find these materials, even you put them online, you might be relying busy on Google Search, for example.",
                    "label": 0
                },
                {
                    "sent": "No search engine optimization as a means for people to re find your content.",
                    "label": 0
                },
                {
                    "sent": "So in terms of having a better annotation of these materials and having systems that can search across materials using those annotations, you would actually be able to facility better reuse across organizational.",
                    "label": 0
                },
                {
                    "sent": "Bounderies",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So quick summary of the technologies, so again it will not get technical here.",
                    "label": 0
                },
                {
                    "sent": "I just want to give you a few buzzwords so metadata is very important in the world of media.",
                    "label": 0
                },
                {
                    "sent": "So let's say you have lots of video, let's say from your organization you put it online and you want people to be able to use it.",
                    "label": 0
                },
                {
                    "sent": "So probably you need to have some metadata exposed about this media as well.",
                    "label": 0
                },
                {
                    "sent": "'cause it helps computer systems provide a better search and retrieval across the content.",
                    "label": 0
                },
                {
                    "sent": "Now, computers actually only tend to recognize what's called low level features, so things like color and shape in video.",
                    "label": 1
                },
                {
                    "sent": "But as humans we don't query in terms of those features we create in terms of high level concepts or events, so we're using we're searching for Nikola Tesla for example.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Which is often called the semantic gap, right?",
                    "label": 0
                },
                {
                    "sent": "So if somebody is showing a picture of Nikola Tesla on a frame of a video, the computer itself cannot immediately without, let's say, additional help know that that's Nikola Tesla in the picture.",
                    "label": 0
                },
                {
                    "sent": "So a lot of research and development goes into how to teach computers to recognize concepts or event.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Within media, so if you're Google, of course you can just use the huge amount of video you have and you can teach yourself to recognize concepts so they're very proud to announce that they can now recognize cats in YouTube videos.",
                    "label": 0
                },
                {
                    "sent": "So this is.",
                    "label": 0
                },
                {
                    "sent": "This is somehow funny, but also raise significant because you have to consider a computer recognizing a cat is not actually so easy, right?",
                    "label": 0
                },
                {
                    "sent": "So the human brain does a much better job of This is why neural networks are actually systems that are built to sort of emulate how the human brain functions.",
                    "label": 0
                },
                {
                    "sent": "That's why they get it.",
                    "label": 0
                },
                {
                    "sent": "So make cats appear at different angles and sizes and shapes and colors and whatever.",
                    "label": 0
                },
                {
                    "sent": "So actually the computer system can identify cats within video is actually an achievement.",
                    "label": 0
                },
                {
                    "sent": "We might not be as far as that.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In our world, but for example, one of our media mixer partners has been working on video lecture material and doing what they call concept detection so they can define certain types of concept that occurs.",
                    "label": 0
                },
                {
                    "sent": "So you know the typical things are thing.",
                    "label": 0
                },
                {
                    "sent": "Our lecturer, whiteboard audience, desk shirt, so they have a concept detector for white shirt.",
                    "label": 0
                },
                {
                    "sent": "If you're interested in other white shirts that appear on on video lectures, we have a demo on this, so this is for example a set of video shots.",
                    "label": 0
                },
                {
                    "sent": "Retrieve for the concept lecture an bored.",
                    "label": 0
                },
                {
                    "sent": "Here's one of the fragments playing back and you see also.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "They show you the concept detection results.",
                    "label": 0
                },
                {
                    "sent": "You can see that it identified with almost 100% certainty things like Blackboard lecture, classroom, Mailperson, Ampitheatre.",
                    "label": 0
                },
                {
                    "sent": "So at this sort of very generic concept level, there's already quite a lot of mature research.",
                    "label": 0
                },
                {
                    "sent": "Being able to automatically detect these types of concepts within video.",
                    "label": 0
                },
                {
                    "sent": "But The thing is, of course.",
                    "label": 0
                },
                {
                    "sent": "People are not generally searching for give me video lectures with lecture notes.",
                    "label": 0
                },
                {
                    "sent": "It's fair, so concept detection is a very nice piece of work that can also help help a computer system to handle media assets.",
                    "label": 0
                },
                {
                    "sent": "But if you want to get to the level of the typical search terms across the learning materials, this is still not precise enough.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what you really need is textual metadata.",
                    "label": 1
                },
                {
                    "sent": "Traditionally, this has been generated more or less manually, so if you've worked with Mediaset systems, you'll know this when you upload a video to the system, then you generally get it like a form and it says you input the title input, the description, maybe some tags, whatever.",
                    "label": 1
                },
                {
                    "sent": "Do you like experts who are actually taking care of the manual entry of this?",
                    "label": 1
                },
                {
                    "sent": "Would you get a lot of metadata being produced automatically now?",
                    "label": 0
                },
                {
                    "sent": "Increasingly and again, this is where stuff like the previous talk or the Trans Lectures project as well come in.",
                    "label": 0
                },
                {
                    "sent": "So if you can get a transcript of the video lecture, then you have a huge amount of text which contains a lot of very relevant concepts.",
                    "label": 0
                },
                {
                    "sent": "So the difference of the lecture is talking about in there and then you can actually use this for a better.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Nation, so there's a thing called named entity recognition.",
                    "label": 1
                },
                {
                    "sent": "There's a number of online services for this, and what it does is actually extract entities out of natural language text.",
                    "label": 1
                },
                {
                    "sent": "So you need this extra level because natural language text is still ambiguous, and again, you can see this, you already have very nice search across transcripts as well.",
                    "label": 0
                },
                {
                    "sent": "I mean, you might have seen it already on YouTube, they have this using automated transcripts and you can search within them, but again, there's ambiguity related, So what this set of technologies tries to do this so called any R services is trying to reduce ambiguity.",
                    "label": 0
                },
                {
                    "sent": "By identifying.",
                    "label": 0
                },
                {
                    "sent": "Substrings and linking them to actually distinct unique entities.",
                    "label": 0
                },
                {
                    "sent": "So they tried to map, so you might have given example, you might have different strings like President George Bush, George Bush, GW Bush, George Bush, junior so on and in any our system.",
                    "label": 0
                },
                {
                    "sent": "Assuming of course it works perfectly.",
                    "label": 0
                },
                {
                    "sent": "All of these different substrings would be labeled by the service to the single single same unique entity which identifies the President George W Bush.",
                    "label": 1
                },
                {
                    "sent": "So this move towards global unique identification.",
                    "label": 0
                },
                {
                    "sent": "There's there's a lot of interesting web based approaches to this.",
                    "label": 0
                },
                {
                    "sent": "One of them just give you the discord linked data and we use linked data a lot within media mixer.",
                    "label": 0
                },
                {
                    "sent": "And LinkedIn is a solution towards this global unique identification of concepts because otherwise you still have the same ambiguities that happened with natural language text.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So just a summary on the metadata side, so method is very important if you happen to be working a lot with media assets, for example E Learning videos.",
                    "label": 0
                },
                {
                    "sent": "So the more metadata, the better retrieval you can support or the better reuse.",
                    "label": 1
                },
                {
                    "sent": "You can create it more and more manually, but it's more costly of course.",
                    "label": 0
                },
                {
                    "sent": "Or you can go to more automated creation, but you will software less accuracy, so there's always the question of what's important for you.",
                    "label": 1
                },
                {
                    "sent": "Google also is not completely accurate in its search results, but nobody cares, right?",
                    "label": 0
                },
                {
                    "sent": "So they get what they looking for.",
                    "label": 0
                },
                {
                    "sent": "Mostly all the same.",
                    "label": 0
                },
                {
                    "sent": "So you might you might want to move away from trying to manually annotate everything, because we consider a system where you have hours and hours of video lectures being uploaded every every day.",
                    "label": 0
                },
                {
                    "sent": "You're not going to achieve cost effectiveness by having somebody manually annotating everything, so you want to do automated transcription, for example, then entity recognition dump all these into a metadata report.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Story and then use that so we have these different technologies and media mixer which I'm not presenting today, but if anyone's interested you can of course just talk to us about it.",
                    "label": 0
                },
                {
                    "sent": "So first of utilities for the fragmentation of the video.",
                    "label": 1
                },
                {
                    "sent": "So first of all, as I said, people are often uninterested in the two hours, so interested in 5 minutes which talks about the topic they're looking to learn about, so we have different approaches to split these video lectures up into fragments.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then to annotate them.",
                    "label": 0
                },
                {
                    "sent": "And as I say this, what we annotate, actually with our unique, the identified entities, and these are part of a knowledge model, so we actually get additional information about them that we would know that George W Bush is actually an instance of AUS president.",
                    "label": 0
                },
                {
                    "sent": "So we could actually associate him with Barack Obama because we know that he's also US President.",
                    "label": 0
                },
                {
                    "sent": "So there's all these knowledge models as well, which also online basically for free, that we can link into.",
                    "label": 0
                },
                {
                    "sent": "When we do this.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So as I say.",
                    "label": 0
                },
                {
                    "sent": "You would generate this metadata and you can have this in a separate store alongside your repository for national media assets.",
                    "label": 0
                },
                {
                    "sent": "When you let people create by by the topics over the entities, so again, the media mixer we've moved away from this pure search as toy textual search.",
                    "label": 0
                },
                {
                    "sent": "So things we just index or the text that you've got and then match against the text.",
                    "label": 0
                },
                {
                    "sent": "Because you have this, the usual issues about ambiguities of natural language, so we actually map everything into a higher level set of entities and then match on the entities.",
                    "label": 0
                },
                {
                    "sent": "So to get the effect of retrieval, you need this good query for formulation.",
                    "label": 0
                },
                {
                    "sent": "So as I say, we are mapping everything to controlled vocabularies, so we normalize or map the free text to the vocabulary terms.",
                    "label": 1
                },
                {
                    "sent": "Do you have different approaches?",
                    "label": 0
                },
                {
                    "sent": "Also for better search.",
                    "label": 0
                },
                {
                    "sent": "So to intuitively iteratively improve search, you can do things like having no system the machine learning so that the computer system learns overtime that people who search on this term went to these lectures.",
                    "label": 0
                },
                {
                    "sent": "So this is more relevant, suggest queries so things like just auto fill in people type.",
                    "label": 0
                },
                {
                    "sent": "They already get suggestions what they might be searching for.",
                    "label": 1
                },
                {
                    "sent": "Our drill down search so give them a set of search results and then give them options.",
                    "label": 0
                },
                {
                    "sent": "Did you mean George W Bush, junior or senior?",
                    "label": 0
                },
                {
                    "sent": "And they say actually I'm in senior and then they get another set of results.",
                    "label": 0
                },
                {
                    "sent": "So maybe over a few cycles they get a drill down to the most relevant material for.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "M. And in our case the result set isn't a set of videos, it's a set of video fragments, so they don't just get a set of two hour lectures and then have to still find within that lecture where was the part they actually were looking for that.",
                    "label": 0
                },
                {
                    "sent": "But talking to the topic they're interested in.",
                    "label": 1
                },
                {
                    "sent": "So if a demo here, I mean you're free to look at it Media Mixer dot useless Jukebox and basically this just creates a playlist of the different video fragments and place them back one after each other so you get like a like a mashup of.",
                    "label": 0
                },
                {
                    "sent": "Lectures mentioning a certain topic.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An example with the video lectures site.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we have a talk, biological or bioinformatics talk.",
                    "label": 0
                },
                {
                    "sent": "So we create the video fragments so you can see here.",
                    "label": 0
                },
                {
                    "sent": "I mean, I'm not sure how long the talk was, I see I just give you give you the first column.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry, but the switching I think this is just my adapter but.",
                    "label": 0
                },
                {
                    "sent": "So we used the slide synchronization timelines of elections already knows, has an XML file.",
                    "label": 1
                },
                {
                    "sent": "When the slides switch.",
                    "label": 0
                },
                {
                    "sent": "So this is a very nice way to split the lecture up into, let's say distinct topical parts.",
                    "label": 1
                },
                {
                    "sent": "So so basically here we have the fragments, so we know that the fragment only the basic unit of life.",
                    "label": 0
                },
                {
                    "sent": "The cell starts at 5 minutes, 12 inches at 5 minutes 46.",
                    "label": 0
                },
                {
                    "sent": "We have transcripts here to see if the EU project Trans Lectures, which were Parson also spit across the fragments.",
                    "label": 0
                },
                {
                    "sent": "So we know that we know which.",
                    "label": 0
                },
                {
                    "sent": "Text was spoken by the lecturer during that video fragment.",
                    "label": 1
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we annotate.",
                    "label": 0
                },
                {
                    "sent": "So again, we as I said, we are extracting topics from the textual metadata.",
                    "label": 1
                },
                {
                    "sent": "So for example, during this slide on the Three Kingdoms of Live, the lecture as mentioned, the various kingdoms agreeing arkeia.",
                    "label": 0
                },
                {
                    "sent": "Just annotate using this.",
                    "label": 0
                },
                {
                    "sent": "The textual string Arcadia.",
                    "label": 1
                },
                {
                    "sent": "We use a global unique identifier which is being being drawn from vocal Bickel DB Pedia.",
                    "label": 0
                },
                {
                    "sent": "DB Pedia is very nice.",
                    "label": 0
                },
                {
                    "sent": "It's basically a structured metadata version of Wikipedia so it takes all the information from Wikipedia and convert into a format which can be machine processable.",
                    "label": 0
                },
                {
                    "sent": "So with behind the URL.",
                    "label": 0
                },
                {
                    "sent": "For the DB Pedia concept of Arcadia, there's a lot of metadata about what are Kia is.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here for example.",
                    "label": 0
                },
                {
                    "sent": "A search on LCD, plasma and LCD plasma.",
                    "label": 0
                },
                {
                    "sent": "Again, we map this again to the entity in DB Pedia and the DVD NTSC plasma has metadata which says for example, it's a type of Archaea.",
                    "label": 0
                },
                {
                    "sent": "So we now know that the search in the city plasma is relevant to the video fragment, which is annotated with the term arkeia.",
                    "label": 0
                },
                {
                    "sent": "So this person has not searched for the for K at all, but they will still get the video fragment returned to them in the results.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we can do video play fragmente playback.",
                    "label": 0
                },
                {
                    "sent": "This is also being being implemented so for the web people here his team of five I'm mostly most of the recent browsers are now supporting natively media fragments, so meaning that media privacy means being able to say play me 10 seconds of video.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "Yeah, if you have the URL of the video you just go to URL and you get the whole video.",
                    "label": 0
                },
                {
                    "sent": "But now there's actually a way to say give me those 10 seconds.",
                    "label": 0
                },
                {
                    "sent": "And we have it in a in a separate form, but of course you could actually packaged together into one linear stream, and this is an idea.",
                    "label": 0
                },
                {
                    "sent": "For example things like mobile or or even smart TV, where you could just maybe sit back and say, play me back all the fragments about this topic.",
                    "label": 0
                },
                {
                    "sent": "And I'll happily sit and watch watch that.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "I run through that reasonably quickly.",
                    "label": 0
                },
                {
                    "sent": "I hope it was possible to follow the main message here.",
                    "label": 0
                },
                {
                    "sent": "Is that compared to the current state of the art for online video especially.",
                    "label": 0
                },
                {
                    "sent": "Also the elearning video platforms where we see that you access videos as atomic objects so you access the entire video and it's often very difficult to find within the video the parts you might be more interested in in terms of researching a certain topic and you'll see more of that in this.",
                    "label": 0
                },
                {
                    "sent": "After launching the video lectures talk because we'll actually compare the current video lectures platform with our prototype implementation video lectures mashup through this fragmentation of media, annotation of media and then semantic retrieval of media.",
                    "label": 0
                },
                {
                    "sent": "So these are different technologies that the media mixer partners have done a lot of development on and are now actually promoting actively towards industry.",
                    "label": 0
                },
                {
                    "sent": "So we're also interested in anyone who's working here with audio, image, video material.",
                    "label": 0
                },
                {
                    "sent": "It's interesting technology, so we're here to support you in understanding what disabilities can do and how to implement them in your systems.",
                    "label": 0
                },
                {
                    "sent": "You'll see that with video lectures macshop after lunch.",
                    "label": 0
                },
                {
                    "sent": "So I just want to point.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Due to a few resources now in media Mixer before I close, so we have a community portal.",
                    "label": 1
                },
                {
                    "sent": "Basically here we collect together all the materials.",
                    "label": 0
                },
                {
                    "sent": "We have all the information we have with the technologies, so it's Community dot media mixer dot EU.",
                    "label": 0
                },
                {
                    "sent": "And we have the we have the use cases we have links to demonstrators, tutorials, presentations, software specifications.",
                    "label": 1
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We've also had been holding webinars, so it's medium mixer.edu/live.",
                    "label": 0
                },
                {
                    "sent": "I think the webinars are very nice if you want to have a very quick introduction to everything, so it's not always that easy to you know to go through other peoples slides to download documents and start reading them, but with the web and now you can sit back and the technical webinars or up to one hour, but the use case weapons are quite short, so I think the very last one was on the learning use case.",
                    "label": 0
                },
                {
                    "sent": "This is also at this web page and I think it's it's around 15 or 17 minutes so.",
                    "label": 0
                },
                {
                    "sent": "It's very brief.",
                    "label": 0
                },
                {
                    "sent": "It's very informative.",
                    "label": 0
                },
                {
                    "sent": "If you just want to get a quick insight, further insight into the into we're doing in media Mixer.",
                    "label": 0
                },
                {
                    "sent": "All those videos are online hosted at videolectures.net.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And with that, I think I've spoken enough out to leave some time for any questions you may have, so I'd like to thank you for your attention and just to mention also we have a table here.",
                    "label": 1
                },
                {
                    "sent": "So just to the right of the registration desk next to the Slovenian Post banner.",
                    "label": 0
                },
                {
                    "sent": "And my colleague Tonya will be around there during the breaks, so you can also come and find us there and please come back again after lunch to the view lectures mashup talk in the think of the research track.",
                    "label": 0
                }
            ]
        }
    }
}