{
    "id": "4ft25hgnc23buddyrt2px5t7ngz6lkss",
    "title": "Introduction to the workshop",
    "info": {
        "author": [
            "Nada Lavrač, Department of Knowledge Technologies, Jožef Stefan Institute"
        ],
        "published": "March 14, 2007",
        "recorded": "February 2007",
        "category": [
            "Top->Events"
        ]
    },
    "url": "http://videolectures.net/wict07_lavrac_int/",
    "segmentation": [
        [
            "Just another lab rat.",
            "She is head of our Department for Knowledge Technologies.",
            "She was also my advisor through all my PhD study for my master thesis for my PhD are very supportive, so talking about women in science.",
            "I should say this is one of good suggestions I can give.",
            "If you can get.",
            "Women advising you because there is a very slight difference in, you know, recognizing possible problems you may have through your working.",
            "Always how you deal with situations.",
            "My in particular was you know, expecting that you get recognition from you know top just working without saying.",
            "Look how great and then expecting that someone is going to see that you really do good work and so on.",
            "So now please tell us something about the Department.",
            "Thank you for the kind introduction.",
            "So saying that Junior was supervised by me, that's kindly kind to say.",
            "It was very nice to supervise junior of course because.",
            "She was a very active student.",
            "As you can imagine producing very good, very scientific results as well as organizational efforts which were very much appreciated.",
            "We also coordinated jointly big European projects in the course of the 5th Framework and that was Junior's first project coordination.",
            "So this is one of the other projects she has coordinated since so very much.",
            "Welcome to the use of Steven Institute for most of you.",
            "This is the first time you are visiting Slovenia and Ljubljana.",
            "End users Steven Institute and Department of Knowledge Technologies is just one of the departments of the Institute.",
            "Just to introduce a little bit."
        ],
        [
            "Do you the Institute where this workshop is located so the Institute was founded in 1949, which means that we had the 50th anniversary quite a number of years ago, and it is actually the leading Slovenian National Research institution in natural Sciences and technology, and it has a quite a broad scope of its activities.",
            "Well, now you've suddenly signors of Steven himself."
        ],
        [
            "And you can see him over there and the different various different places at the Institute.",
            "Actually he was a famous."
        ],
        [
            "Physicist he lived in 1835 to 1893, mostly in Vienna.",
            "He was one of the most distinguished physicists of the 19th century, and they originated the law of total radiation from the black body.",
            "And that's where the name of our Institute comes from.",
            "The areas of research we are covering, our information and communication technologies, chemistry, biology, nanotechnology, recently very active physics, nuclear technology and safety and in 2004 we have started with our programs at the postgraduate level at the Masters and PhD level.",
            "So we have the International Postgraduate School where we are teaching in English, so we have these three programs in ICT, nanotechnologies and ECO technology.",
            "It is very much research oriented towards basic research as well as management Sciences all together in that user Steven Institute.",
            "It's about 700 researchers, students and support staff.",
            "About our Department."
        ],
        [
            "We are about 25 fully employed and about 15 to 20 students and external collaboration personnel.",
            "I'm heading this Department and we have very strong research in several areas of machine learning, decision support, knowledge management, ecological modeling, decision support systems, human language technologies, logic and cognitive science.",
            "So if I go a bit further.",
            "So we."
        ],
        [
            "Like to see our areas at the left hand side, which I have just listed and then we perform applications in ecological modeling.",
            "Applying AI in medicine in healthcare, agriculture, enterprise management and so on.",
            "So besides basic research we do applications and we are also very active in European projects."
        ],
        [
            "So currently in the six framework we had 16 European projects which were active and here you can see the.",
            "Through years how this started in 2004, do I have a pointer?",
            "Oh then everybody get scared.",
            "OK, so we are an old fashioned school so.",
            "In 2004 already at the first call, actually we were successful in five projects and immediately then, in middle of 2004 this project urine started as well, and which is ending basically right now, and so on.",
            "So in the recently in 2006 there were some IPS and straps which started and they will last until 2010 and currently we were very active in the preparation of 7th framework projects.",
            "And hope that this will be successful as well.",
            "Of course this European activity couldn't go on without the support of National Research money, and here this is well, it says program skupina.",
            "We have 6 full-time researchers paid nationally by National Big National Project.",
            "It's called the program on Knowledge Technologies and that's the basic source of money, with which we also Co financed the European projects.",
            "In addition to that, we have quite a number of smaller National Research projects.",
            "So."
        ],
        [
            "So if we look at the funding, we have about 1/3 from national money and about 2/3 from European money and a structure.",
            "Three IP stands, traps, networks of excellence in some specific support and coordination actions.",
            "Yeah, we."
        ],
        [
            "We were active in publishing books, research papers, workshop papers in organizing conferences and workshops so well, quite a number of not only edited books but also authored books were produced at our Department so."
        ],
        [
            "So just to give you a slight flavor of what we are doing, so our Department has its basis in the research on artificial intelligence which started in Slovenia more than 20 years ago.",
            "And then from this basic research in artificial intelligence one strong.",
            "Area of research was data mining and machine learning and with that we have the longest tradition, nearly the longest in Europe, about 20 years machine learning techniques where we are developing classification rule learning, subgroup discovery, relational data mining techniques and then applications in medicine, ecology and so on.",
            "So this is a slide presenting a system for subgroup discovery, which was impl."
        ],
        [
            "I meant it in the tool which has been developed at the Faculty of Computer Science and Informatics, but this particular development was made at our Department.",
            "It's about discovering interesting subgroups in the data with particular properties.",
            "We have very strong research in decision support and you know it is about choosing between different alternatives.",
            "There is a system called Taxi for which there is also a book and."
        ],
        [
            "System which helps supporting the decisions."
        ],
        [
            "In very many different ways and very many applications, about 50 applications have been done for the industry with that system."
        ],
        [
            "Of course you will be most interested in what the junior and mark are doing because you know them most well.",
            "They are involved in text mining and in the semantic web.",
            "So here you can see a slide about the system developed by Junior Marco and blush Fortuna.",
            "It is called onto again.",
            "So if you give the system a number of documents and hopefully this number is large, the system can automatically structure the documents according to their topics.",
            "So automatically the topics pop out by automatically looking at the most important keywords which appear in the documents, but you don't have to state the keywords the keywords are extracted automatically.",
            "Then they can represent this through what they called Doc."
        ],
        [
            "Women topless, putting the keywords the most important descriptors of the documents in an Atlas of documents and keywords which are somehow close together appear together.",
            "Or this can be visualized in a different."
        ],
        [
            "Play so you could see how many documents.",
            "Are in a particular area.",
            "The."
        ],
        [
            "I also did a system for automatic abstract construction from texts and a number of other things."
        ],
        [
            "One of the interesting research areas was also the analysis of European research projects.",
            "It started quite a number of years ago and now it is continued within the project IST world, so this initially it was called Project Intelligence.",
            "The idea was analyzing all the 5th framework projects in the area of information and computer technologies and now this IST.",
            "World aims at analyzing the projects.",
            "Of the six framework so you can see, for instance in this slide, which are the most active countries in European projects in the 5th Framework Program and now this goes on very actively, so I wouldn't bore you."
        ],
        [
            "Much with the details about our research you have come to Ljubljana yesterday.",
            "You had a meal close to the Libyan.",
            "It's a River, so this is Libby and it's a with snow which you haven't seen yesterday, but it is a welcome for you to visit us again and I hope you will have a very successful workshop.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just another lab rat.",
                    "label": 0
                },
                {
                    "sent": "She is head of our Department for Knowledge Technologies.",
                    "label": 0
                },
                {
                    "sent": "She was also my advisor through all my PhD study for my master thesis for my PhD are very supportive, so talking about women in science.",
                    "label": 0
                },
                {
                    "sent": "I should say this is one of good suggestions I can give.",
                    "label": 0
                },
                {
                    "sent": "If you can get.",
                    "label": 0
                },
                {
                    "sent": "Women advising you because there is a very slight difference in, you know, recognizing possible problems you may have through your working.",
                    "label": 0
                },
                {
                    "sent": "Always how you deal with situations.",
                    "label": 0
                },
                {
                    "sent": "My in particular was you know, expecting that you get recognition from you know top just working without saying.",
                    "label": 0
                },
                {
                    "sent": "Look how great and then expecting that someone is going to see that you really do good work and so on.",
                    "label": 0
                },
                {
                    "sent": "So now please tell us something about the Department.",
                    "label": 0
                },
                {
                    "sent": "Thank you for the kind introduction.",
                    "label": 0
                },
                {
                    "sent": "So saying that Junior was supervised by me, that's kindly kind to say.",
                    "label": 0
                },
                {
                    "sent": "It was very nice to supervise junior of course because.",
                    "label": 0
                },
                {
                    "sent": "She was a very active student.",
                    "label": 0
                },
                {
                    "sent": "As you can imagine producing very good, very scientific results as well as organizational efforts which were very much appreciated.",
                    "label": 0
                },
                {
                    "sent": "We also coordinated jointly big European projects in the course of the 5th Framework and that was Junior's first project coordination.",
                    "label": 0
                },
                {
                    "sent": "So this is one of the other projects she has coordinated since so very much.",
                    "label": 0
                },
                {
                    "sent": "Welcome to the use of Steven Institute for most of you.",
                    "label": 1
                },
                {
                    "sent": "This is the first time you are visiting Slovenia and Ljubljana.",
                    "label": 0
                },
                {
                    "sent": "End users Steven Institute and Department of Knowledge Technologies is just one of the departments of the Institute.",
                    "label": 0
                },
                {
                    "sent": "Just to introduce a little bit.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Do you the Institute where this workshop is located so the Institute was founded in 1949, which means that we had the 50th anniversary quite a number of years ago, and it is actually the leading Slovenian National Research institution in natural Sciences and technology, and it has a quite a broad scope of its activities.",
                    "label": 0
                },
                {
                    "sent": "Well, now you've suddenly signors of Steven himself.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you can see him over there and the different various different places at the Institute.",
                    "label": 0
                },
                {
                    "sent": "Actually he was a famous.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Physicist he lived in 1835 to 1893, mostly in Vienna.",
                    "label": 0
                },
                {
                    "sent": "He was one of the most distinguished physicists of the 19th century, and they originated the law of total radiation from the black body.",
                    "label": 0
                },
                {
                    "sent": "And that's where the name of our Institute comes from.",
                    "label": 0
                },
                {
                    "sent": "The areas of research we are covering, our information and communication technologies, chemistry, biology, nanotechnology, recently very active physics, nuclear technology and safety and in 2004 we have started with our programs at the postgraduate level at the Masters and PhD level.",
                    "label": 0
                },
                {
                    "sent": "So we have the International Postgraduate School where we are teaching in English, so we have these three programs in ICT, nanotechnologies and ECO technology.",
                    "label": 0
                },
                {
                    "sent": "It is very much research oriented towards basic research as well as management Sciences all together in that user Steven Institute.",
                    "label": 0
                },
                {
                    "sent": "It's about 700 researchers, students and support staff.",
                    "label": 0
                },
                {
                    "sent": "About our Department.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We are about 25 fully employed and about 15 to 20 students and external collaboration personnel.",
                    "label": 1
                },
                {
                    "sent": "I'm heading this Department and we have very strong research in several areas of machine learning, decision support, knowledge management, ecological modeling, decision support systems, human language technologies, logic and cognitive science.",
                    "label": 1
                },
                {
                    "sent": "So if I go a bit further.",
                    "label": 0
                },
                {
                    "sent": "So we.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Like to see our areas at the left hand side, which I have just listed and then we perform applications in ecological modeling.",
                    "label": 0
                },
                {
                    "sent": "Applying AI in medicine in healthcare, agriculture, enterprise management and so on.",
                    "label": 1
                },
                {
                    "sent": "So besides basic research we do applications and we are also very active in European projects.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So currently in the six framework we had 16 European projects which were active and here you can see the.",
                    "label": 0
                },
                {
                    "sent": "Through years how this started in 2004, do I have a pointer?",
                    "label": 0
                },
                {
                    "sent": "Oh then everybody get scared.",
                    "label": 0
                },
                {
                    "sent": "OK, so we are an old fashioned school so.",
                    "label": 0
                },
                {
                    "sent": "In 2004 already at the first call, actually we were successful in five projects and immediately then, in middle of 2004 this project urine started as well, and which is ending basically right now, and so on.",
                    "label": 0
                },
                {
                    "sent": "So in the recently in 2006 there were some IPS and straps which started and they will last until 2010 and currently we were very active in the preparation of 7th framework projects.",
                    "label": 0
                },
                {
                    "sent": "And hope that this will be successful as well.",
                    "label": 0
                },
                {
                    "sent": "Of course this European activity couldn't go on without the support of National Research money, and here this is well, it says program skupina.",
                    "label": 0
                },
                {
                    "sent": "We have 6 full-time researchers paid nationally by National Big National Project.",
                    "label": 0
                },
                {
                    "sent": "It's called the program on Knowledge Technologies and that's the basic source of money, with which we also Co financed the European projects.",
                    "label": 0
                },
                {
                    "sent": "In addition to that, we have quite a number of smaller National Research projects.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So if we look at the funding, we have about 1/3 from national money and about 2/3 from European money and a structure.",
                    "label": 0
                },
                {
                    "sent": "Three IP stands, traps, networks of excellence in some specific support and coordination actions.",
                    "label": 1
                },
                {
                    "sent": "Yeah, we.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We were active in publishing books, research papers, workshop papers in organizing conferences and workshops so well, quite a number of not only edited books but also authored books were produced at our Department so.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So just to give you a slight flavor of what we are doing, so our Department has its basis in the research on artificial intelligence which started in Slovenia more than 20 years ago.",
                    "label": 0
                },
                {
                    "sent": "And then from this basic research in artificial intelligence one strong.",
                    "label": 0
                },
                {
                    "sent": "Area of research was data mining and machine learning and with that we have the longest tradition, nearly the longest in Europe, about 20 years machine learning techniques where we are developing classification rule learning, subgroup discovery, relational data mining techniques and then applications in medicine, ecology and so on.",
                    "label": 1
                },
                {
                    "sent": "So this is a slide presenting a system for subgroup discovery, which was impl.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I meant it in the tool which has been developed at the Faculty of Computer Science and Informatics, but this particular development was made at our Department.",
                    "label": 0
                },
                {
                    "sent": "It's about discovering interesting subgroups in the data with particular properties.",
                    "label": 0
                },
                {
                    "sent": "We have very strong research in decision support and you know it is about choosing between different alternatives.",
                    "label": 0
                },
                {
                    "sent": "There is a system called Taxi for which there is also a book and.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "System which helps supporting the decisions.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In very many different ways and very many applications, about 50 applications have been done for the industry with that system.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of course you will be most interested in what the junior and mark are doing because you know them most well.",
                    "label": 0
                },
                {
                    "sent": "They are involved in text mining and in the semantic web.",
                    "label": 1
                },
                {
                    "sent": "So here you can see a slide about the system developed by Junior Marco and blush Fortuna.",
                    "label": 0
                },
                {
                    "sent": "It is called onto again.",
                    "label": 0
                },
                {
                    "sent": "So if you give the system a number of documents and hopefully this number is large, the system can automatically structure the documents according to their topics.",
                    "label": 0
                },
                {
                    "sent": "So automatically the topics pop out by automatically looking at the most important keywords which appear in the documents, but you don't have to state the keywords the keywords are extracted automatically.",
                    "label": 0
                },
                {
                    "sent": "Then they can represent this through what they called Doc.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Women topless, putting the keywords the most important descriptors of the documents in an Atlas of documents and keywords which are somehow close together appear together.",
                    "label": 0
                },
                {
                    "sent": "Or this can be visualized in a different.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Play so you could see how many documents.",
                    "label": 0
                },
                {
                    "sent": "Are in a particular area.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I also did a system for automatic abstract construction from texts and a number of other things.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One of the interesting research areas was also the analysis of European research projects.",
                    "label": 0
                },
                {
                    "sent": "It started quite a number of years ago and now it is continued within the project IST world, so this initially it was called Project Intelligence.",
                    "label": 1
                },
                {
                    "sent": "The idea was analyzing all the 5th framework projects in the area of information and computer technologies and now this IST.",
                    "label": 0
                },
                {
                    "sent": "World aims at analyzing the projects.",
                    "label": 0
                },
                {
                    "sent": "Of the six framework so you can see, for instance in this slide, which are the most active countries in European projects in the 5th Framework Program and now this goes on very actively, so I wouldn't bore you.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Much with the details about our research you have come to Ljubljana yesterday.",
                    "label": 0
                },
                {
                    "sent": "You had a meal close to the Libyan.",
                    "label": 0
                },
                {
                    "sent": "It's a River, so this is Libby and it's a with snow which you haven't seen yesterday, but it is a welcome for you to visit us again and I hope you will have a very successful workshop.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}