{
    "id": "4g6dxuzg373232ul7uf72ywxdkqm24kw",
    "title": "Breaking the Language Barrier",
    "info": {
        "author": [
            "Alex Waibel, Interactive Systems Labs (ISL), University of Karlsruhe"
        ],
        "published": "July 31, 2016",
        "recorded": "July 2016",
        "category": [
            "Top->Computer Science",
            "Top->Technology"
        ]
    },
    "url": "http://videolectures.net/interACT2016_waibel_language_barrier/",
    "segmentation": [
        [
            "Again, thank you for giving me a few minutes to explain or to review some of the things that we're working on.",
            "Much of it has already been said, so I don't.",
            "I will go through some of the slides quickly and some of the comments and slides.",
            "Some of you have already heard me talk about on numerous occasions, so there too I don't want to bore you with repetitions now that we have some here in the audience who haven't, and so we want to give you a quick.",
            "Demonstration of what it is and where we still see possibilities and potential and challenges for further work to be done, I'd like to also say that you know, even though kindly many people talked about Alex, this Alex that, but it's really not Alex.",
            "It's a really a big team of people and that without that team many of you are here.",
            "In fact, graduate students, PHD's, colleagues, etc.",
            "Something like this is not possible.",
            "We started dreaming about this.",
            "A dream of communication.",
            "Many many years ago, but again, you know it.",
            "It takes awhile to make it realize."
        ],
        [
            "Here's the dream.",
            "It's essentially a world in which everyone is connected.",
            "It's already there by by 2020, people say 80% of the world population will have smartphones in their pocket, and if you had told me that in as a graduate student or even as an undergraduate, that we'd all be wearing supercomputers in our pockets, I would have not believed it.",
            "And now it's actually here, and it's happening.",
            "You can reach everyone by telephone, but you cannot necessarily understand and.",
            "Speak to them."
        ],
        [
            "And this is where the dream comes.",
            "To make this more communicable, make it make make people more connected through language and speech.",
            "No one."
        ],
        [
            "Gnosis as well as Europe, Europe has these 23 languages plus many dialects, dialects and fascinating problem because again they are much harder to develop and so we started many years ago on an interpreting machine that would go both ways and to speak into it, have it translate into the other language and respond."
        ],
        [
            "Now for those of you were not in the field, it may be surprising that it would take 25 or more years to do this, and again for those who are in language, they know immediately why this is the case.",
            "For those of you who aren't, it's all about ambiguity.",
            "Language is ambiguous, and at any level of the problem you have a situation where something can mean multiple things, either at the acoustic level.",
            "If I say, give me a new display, it's not give me a new display.",
            "What time flies like an arrow, you can interpret at 6 different ways.",
            "The spirit is willing, the flesh is weak, you're not talking bout vodka and meat, but about more abstract notion.",
            "At funny when I like about German with its compounds, central oropa was translated as headquarter.",
            "Great grandpa because it is central.",
            "A Wentworth OPA so central is headquarter and sure is great grandpa.",
            "And if you separate this compound in inaccurately you get this kind of goofy translation.",
            "And of course, when we use automatic translators, we always experiences occasional goofy, totally crazy things and goes to the back to the point that counts mentioned that we do not understand these things.",
            "We still have a mechanical way of translating these things, and when things go wrong, they really go wrong badly because we lack an understanding of this.",
            "Pronouns are known problem in computational linguistics.",
            "If baby does not like the milk, boil it til you mean to boil the baby or.",
            "Boil them, we hope it's boiling the milk, of course, but you can tell just from the surface structure and hence you need to have mechanisms to deal with it.",
            "Now the way we do it."
        ],
        [
            "Is of course dealing with this.",
            "Ambiguity is by score statistics and neural activations, and this is can only be done by machine learning.",
            "This was not obvious in the 70s.",
            "People try to do these things or by rule based, and it wasn't really until the 80s where we then began in statistics and neural networks to begin working on models like that, much to the chagrin and discussion of many of our contact Contacts so."
        ],
        [
            "So since."
        ],
        [
            "Hands already joked about it.",
            "I can't resist, of course, showing that we already worked on these things in 87, particularly with the neural Nets, but they were tiny by comparison to what's being done now.",
            "And so now, after 20 years, everyone's back to neural networks.",
            "Amazing large neural networks that give incredible power boosts now nowadays simply because, but the same architectures, much larger and much more data and much more processing power into."
        ],
        [
            "Tingly also the same with neural empty.",
            "Everyone's talking about neural Mt is actually also in the 80s.",
            "There was early work on trying to do machine translation by neural networks.",
            "In fact, the person who did this is here in the room is he wearing who now works on Yogi?",
            "Back there who works on a dialogue systems chat bots now at Microsoft and he will be speaking later.",
            "But some of these slides come from early publications.",
            "He wrote where we tried to do recurrent neural networks.",
            "As you can see, as encoders and decoders for spoken language understanding that would then hopefully be used in machine translation.",
            "We never succeeded with it at the time because these networks were just so small and we didn't have the computing power to make them really fly for large translation tasks.",
            "So we diverted to statistics and here we are 25 years later, back to these neural network models and they come back with a vengeance and great performance.",
            "So enough said."
        ],
        [
            "But this we built an early prototypes of these translation machines.",
            "We had the chance to work with ATR, our friends from ATR here also Nakamura Sensei and colleagues gave us an opportunity to work together and build an early system where we had a video conferencing speech to speech translation telephone.",
            "It could only do 500 words and they took a while to process.",
            "But here it was.",
            "It was actually possible.",
            "You see, this was here at Carnegie Mellon.",
            "In cooperation with Germany and with Japan."
        ],
        [
            "Many other applications and become became possible.",
            "We think it for awhile with sign Rd sign translators that would take pictures of Rd signs in China in this case and then automatically insert the subtitles.",
            "This one curiously no entry for tourists over Chinese sign that I couldn't read when I took the picture.",
            "But again, with relatively simple hardware, again in the early 2000 and after that, or something like that was possible."
        ],
        [
            "1st for the forward 2009.",
            "Some of you recognize Lisa.",
            "We took pictures of."
        ],
        [
            "First speech translator on the phone with."
        ],
        [
            "IPhone bringing enough power onto a small hardware device."
        ],
        [
            "It finally became possible that you could do a 40,000 word vocabulary, run it on the phone, and carry on a dialogue with people in the street and that became of course accompany Jibbigo, which then was later acquired by Facebook."
        ],
        [
            "We had great fun with humanitarian projects and you'll hear some some of the results in projects later on where."
        ],
        [
            "Dialogues."
        ],
        [
            "Terms were then used speech translation systems in remote areas of the world for human humanitarian missions.",
            "Here for example, doctors with with patients in Thailand."
        ],
        [
            "Now what we're doing recently is deploying a simultaneous interpretation system for universities, particularly in Germany, when students come from foreign countries, they don't speak German necessarily or not very well, and so we offer this as a service in four lecture halls.",
            "Now it's been deployed so that students can open their laptop and you are free and welcome to do this right now here.",
            "So as I'm speaking to you, this lecture is being automatically.",
            "Record recorded, transcribed and translated and if you go to that website you can actually see the output of it.",
            "Now what does it do?",
            "We will actually demonstrate this for you.",
            "I don't know if we can switch it, but what you will see here is what a student typically sees on the laptop or on their personal device.",
            "You see, on the left side is the continuous transcript of what I am speaking in real-time.",
            "We worked very hard on reducing the latency of this decoding.",
            "So that the speech output comes not much later after I spoke the word.",
            "Typically it's one second or one word behind, and you see the output text coming out in English.",
            "And in this case we turned on Spanish translation.",
            "So you see the translation in Spanish on the right side.",
            "Notice that I never say periods or commas, so the system has to insert automatically punctuation.",
            "That doesn't always work correctly, and sometimes you get goofy results as a as a result, but.",
            "Nevertheless, it's inserting the periods the translation is being done, and still the translation is done with low latency so that the output sometimes arrives before I finished speaking my sentence.",
            "So the system, as in human interpretation, has to make guesses as to how the sentence will ultimately end so it can pick the right context in the right translation, in this case into Spanish.",
            "Now all of this in the situation of building systems that run for lecture halls is done in the cloud there.",
            "In that case, we don't necessarily have to have that in the pocket of people, but it can run in the clouds because people just bring their devices and they go to a website.",
            "So if we go to switch back to the slides, we can see what that looks like.",
            "We have then a server running in somewhere in the basement that does all the heavy lifting computationally, and the speech from the different lecture halls."
        ],
        [
            "Being broadcast brought to the to these machines and then automatically translated into the languages of the user's."
        ],
        [
            "Result students then open their laptop and they see the simultaneous transcript and translation of the lecture as it goes on, and this is actually something very nice for us in casual because in culture we could possibly not possibly afford the great effort that the Parliament, for example is doing for human interpretation, and so a machine, even though is not as good as as a human."
        ],
        [
            "Interpreter does at least provide translation or interpretation so that students can follow on along on the lecture."
        ],
        [
            "There's something cute things where we've tinkered with over the years that not only do you always have the I have 4 minutes or I'm 4 minutes overtime, OK?",
            "I'm so of course the question is always how do you deliver this?",
            "The dream is to make language barriers completely transparent.",
            "We want to live in a world where we can communicate openly as if nothing happened.",
            "We will hear later about the Skype translator.",
            "That's another use case.",
            "Pocket Translators signed translators.",
            "All of these ways of tools by which people can do that.",
            "But still, it's always the machine still interfering and being in the midst of it.",
            "So we did a great deal of thinking about how it might become.",
            "For example, even more.",
            "Transparent in the future, here's 1 funny thing that we did.",
            "For example, heads up display goggles so you put on these goggles and you see subtitles in the glasses so that you can read subtitles while you're looking at someone or for example, and targeted audio device, which we will demonstrate to you here, which we also worked on in the context of another European project.",
            "So suppose you prefer rather than looking at laptops to have someone whisper in your ears the automatic translation.",
            "Of your speech, then you could be using a device like that.",
            "This was an early prototype was developed in under in a project by Daimler Chrysler and this prototype was at some point also marketed and built by Sennheiser.",
            "So what you see here is output translations from speech and is it working?",
            "So some of you should be here.",
            "I don't hear anything that's coming out of the speaker, but if that speaker is pointed to you, you will actually hear the voice the whispering of the output speech of that person.",
            "Now, because it is so directional, so targeted to one individual person, or arrange in the room only the people there can hear it so we can do actually translation into multiple languages in different parts of the room.",
            "So you could be sitting over here in French and over there you get translation in Spanish and.",
            "And so on.",
            "It was F doesn't hear anything right now, but if you're pointing it to Joseph, suddenly you hear it.",
            "It's spooky.",
            "It's really likes hearing voices in your head suddenly, and we in earlier days we had great fun playing music to people on the street who they were get all shocked that suddenly they hear things coming out of the blue in their ears.",
            "So this is possible to do these things.",
            "And if you think of a world where this all becomes transparent, it becomes something that you that you don't think about it becomes.",
            "Second nature that you have this these as."
        ],
        [
            "And functions, then I think we might approach somewhere where we have achieved.",
            "Now that is not.",
            "These automatic tools are great way of assisting humans in.",
            "If there's nothing else available, the European Parliament and again very grateful that we have all got cause me deuces under Hannah Klimek and her colleagues all here who are actually working in the human Parliament doing this by human effort largely is.",
            "So much better still than what we can do, but here too we are working on various ways of supporting this and the last minute that I have."
        ],
        [
            "A flash on remaining problems.",
            "It's not straightforward.",
            "You have all these problems with composite are in German you have English words slipping into German lectures.",
            "Cloud Budgeter webcast, Sue Griff, webcaster down.",
            "Gallo did are inflected German inflected English words and."
        ],
        [
            "In the future, there are still many open issues.",
            "For example the drama of Electra, the Emotion of Electra is not well represented, not even the gender of the speaker is correctly translated.",
            "As we found out in Thailand, where you use different phrases depending on who you talk too.",
            "So there's really a need, still forgetting more contextualized or more contextually sensitive translation going so that translation can be done with with the speaker and listener in mind.",
            "In lectures, we find this because.",
            "When Electra talks about the particular point they want to emphasize, the output needs to reflect that.",
            "Last night though."
        ],
        [
            "And then I conclude, is this long tail of language.",
            "It was already mentioned by Jamie and various others that how to do low resource languages to ultimately get this dream out to 6007 thousand languages in the world.",
            "The cost of developing these systems has to come down has to go with lot less data, and so we're on the way of developing new, innovative ways of doing this with low cost with little data as well.",
            "So again.",
            "With that, the dream still keeps us busy.",
            "Multilingualism will hear more discussion later."
        ],
        [
            "From Babylonian confusion."
        ],
        [
            "The world understanding is ultimately the goal and interest we're pursuing here.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Again, thank you for giving me a few minutes to explain or to review some of the things that we're working on.",
                    "label": 0
                },
                {
                    "sent": "Much of it has already been said, so I don't.",
                    "label": 0
                },
                {
                    "sent": "I will go through some of the slides quickly and some of the comments and slides.",
                    "label": 0
                },
                {
                    "sent": "Some of you have already heard me talk about on numerous occasions, so there too I don't want to bore you with repetitions now that we have some here in the audience who haven't, and so we want to give you a quick.",
                    "label": 0
                },
                {
                    "sent": "Demonstration of what it is and where we still see possibilities and potential and challenges for further work to be done, I'd like to also say that you know, even though kindly many people talked about Alex, this Alex that, but it's really not Alex.",
                    "label": 0
                },
                {
                    "sent": "It's a really a big team of people and that without that team many of you are here.",
                    "label": 0
                },
                {
                    "sent": "In fact, graduate students, PHD's, colleagues, etc.",
                    "label": 0
                },
                {
                    "sent": "Something like this is not possible.",
                    "label": 0
                },
                {
                    "sent": "We started dreaming about this.",
                    "label": 0
                },
                {
                    "sent": "A dream of communication.",
                    "label": 0
                },
                {
                    "sent": "Many many years ago, but again, you know it.",
                    "label": 0
                },
                {
                    "sent": "It takes awhile to make it realize.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here's the dream.",
                    "label": 0
                },
                {
                    "sent": "It's essentially a world in which everyone is connected.",
                    "label": 0
                },
                {
                    "sent": "It's already there by by 2020, people say 80% of the world population will have smartphones in their pocket, and if you had told me that in as a graduate student or even as an undergraduate, that we'd all be wearing supercomputers in our pockets, I would have not believed it.",
                    "label": 0
                },
                {
                    "sent": "And now it's actually here, and it's happening.",
                    "label": 0
                },
                {
                    "sent": "You can reach everyone by telephone, but you cannot necessarily understand and.",
                    "label": 0
                },
                {
                    "sent": "Speak to them.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is where the dream comes.",
                    "label": 0
                },
                {
                    "sent": "To make this more communicable, make it make make people more connected through language and speech.",
                    "label": 0
                },
                {
                    "sent": "No one.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Gnosis as well as Europe, Europe has these 23 languages plus many dialects, dialects and fascinating problem because again they are much harder to develop and so we started many years ago on an interpreting machine that would go both ways and to speak into it, have it translate into the other language and respond.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now for those of you were not in the field, it may be surprising that it would take 25 or more years to do this, and again for those who are in language, they know immediately why this is the case.",
                    "label": 0
                },
                {
                    "sent": "For those of you who aren't, it's all about ambiguity.",
                    "label": 0
                },
                {
                    "sent": "Language is ambiguous, and at any level of the problem you have a situation where something can mean multiple things, either at the acoustic level.",
                    "label": 0
                },
                {
                    "sent": "If I say, give me a new display, it's not give me a new display.",
                    "label": 1
                },
                {
                    "sent": "What time flies like an arrow, you can interpret at 6 different ways.",
                    "label": 0
                },
                {
                    "sent": "The spirit is willing, the flesh is weak, you're not talking bout vodka and meat, but about more abstract notion.",
                    "label": 0
                },
                {
                    "sent": "At funny when I like about German with its compounds, central oropa was translated as headquarter.",
                    "label": 0
                },
                {
                    "sent": "Great grandpa because it is central.",
                    "label": 0
                },
                {
                    "sent": "A Wentworth OPA so central is headquarter and sure is great grandpa.",
                    "label": 0
                },
                {
                    "sent": "And if you separate this compound in inaccurately you get this kind of goofy translation.",
                    "label": 0
                },
                {
                    "sent": "And of course, when we use automatic translators, we always experiences occasional goofy, totally crazy things and goes to the back to the point that counts mentioned that we do not understand these things.",
                    "label": 0
                },
                {
                    "sent": "We still have a mechanical way of translating these things, and when things go wrong, they really go wrong badly because we lack an understanding of this.",
                    "label": 0
                },
                {
                    "sent": "Pronouns are known problem in computational linguistics.",
                    "label": 0
                },
                {
                    "sent": "If baby does not like the milk, boil it til you mean to boil the baby or.",
                    "label": 1
                },
                {
                    "sent": "Boil them, we hope it's boiling the milk, of course, but you can tell just from the surface structure and hence you need to have mechanisms to deal with it.",
                    "label": 0
                },
                {
                    "sent": "Now the way we do it.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is of course dealing with this.",
                    "label": 0
                },
                {
                    "sent": "Ambiguity is by score statistics and neural activations, and this is can only be done by machine learning.",
                    "label": 1
                },
                {
                    "sent": "This was not obvious in the 70s.",
                    "label": 0
                },
                {
                    "sent": "People try to do these things or by rule based, and it wasn't really until the 80s where we then began in statistics and neural networks to begin working on models like that, much to the chagrin and discussion of many of our contact Contacts so.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So since.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hands already joked about it.",
                    "label": 0
                },
                {
                    "sent": "I can't resist, of course, showing that we already worked on these things in 87, particularly with the neural Nets, but they were tiny by comparison to what's being done now.",
                    "label": 0
                },
                {
                    "sent": "And so now, after 20 years, everyone's back to neural networks.",
                    "label": 0
                },
                {
                    "sent": "Amazing large neural networks that give incredible power boosts now nowadays simply because, but the same architectures, much larger and much more data and much more processing power into.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tingly also the same with neural empty.",
                    "label": 0
                },
                {
                    "sent": "Everyone's talking about neural Mt is actually also in the 80s.",
                    "label": 0
                },
                {
                    "sent": "There was early work on trying to do machine translation by neural networks.",
                    "label": 0
                },
                {
                    "sent": "In fact, the person who did this is here in the room is he wearing who now works on Yogi?",
                    "label": 0
                },
                {
                    "sent": "Back there who works on a dialogue systems chat bots now at Microsoft and he will be speaking later.",
                    "label": 0
                },
                {
                    "sent": "But some of these slides come from early publications.",
                    "label": 0
                },
                {
                    "sent": "He wrote where we tried to do recurrent neural networks.",
                    "label": 0
                },
                {
                    "sent": "As you can see, as encoders and decoders for spoken language understanding that would then hopefully be used in machine translation.",
                    "label": 0
                },
                {
                    "sent": "We never succeeded with it at the time because these networks were just so small and we didn't have the computing power to make them really fly for large translation tasks.",
                    "label": 0
                },
                {
                    "sent": "So we diverted to statistics and here we are 25 years later, back to these neural network models and they come back with a vengeance and great performance.",
                    "label": 0
                },
                {
                    "sent": "So enough said.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But this we built an early prototypes of these translation machines.",
                    "label": 0
                },
                {
                    "sent": "We had the chance to work with ATR, our friends from ATR here also Nakamura Sensei and colleagues gave us an opportunity to work together and build an early system where we had a video conferencing speech to speech translation telephone.",
                    "label": 0
                },
                {
                    "sent": "It could only do 500 words and they took a while to process.",
                    "label": 0
                },
                {
                    "sent": "But here it was.",
                    "label": 0
                },
                {
                    "sent": "It was actually possible.",
                    "label": 0
                },
                {
                    "sent": "You see, this was here at Carnegie Mellon.",
                    "label": 0
                },
                {
                    "sent": "In cooperation with Germany and with Japan.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Many other applications and become became possible.",
                    "label": 0
                },
                {
                    "sent": "We think it for awhile with sign Rd sign translators that would take pictures of Rd signs in China in this case and then automatically insert the subtitles.",
                    "label": 0
                },
                {
                    "sent": "This one curiously no entry for tourists over Chinese sign that I couldn't read when I took the picture.",
                    "label": 0
                },
                {
                    "sent": "But again, with relatively simple hardware, again in the early 2000 and after that, or something like that was possible.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "1st for the forward 2009.",
                    "label": 0
                },
                {
                    "sent": "Some of you recognize Lisa.",
                    "label": 0
                },
                {
                    "sent": "We took pictures of.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "First speech translator on the phone with.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "IPhone bringing enough power onto a small hardware device.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It finally became possible that you could do a 40,000 word vocabulary, run it on the phone, and carry on a dialogue with people in the street and that became of course accompany Jibbigo, which then was later acquired by Facebook.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We had great fun with humanitarian projects and you'll hear some some of the results in projects later on where.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Dialogues.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Terms were then used speech translation systems in remote areas of the world for human humanitarian missions.",
                    "label": 0
                },
                {
                    "sent": "Here for example, doctors with with patients in Thailand.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now what we're doing recently is deploying a simultaneous interpretation system for universities, particularly in Germany, when students come from foreign countries, they don't speak German necessarily or not very well, and so we offer this as a service in four lecture halls.",
                    "label": 0
                },
                {
                    "sent": "Now it's been deployed so that students can open their laptop and you are free and welcome to do this right now here.",
                    "label": 0
                },
                {
                    "sent": "So as I'm speaking to you, this lecture is being automatically.",
                    "label": 0
                },
                {
                    "sent": "Record recorded, transcribed and translated and if you go to that website you can actually see the output of it.",
                    "label": 0
                },
                {
                    "sent": "Now what does it do?",
                    "label": 0
                },
                {
                    "sent": "We will actually demonstrate this for you.",
                    "label": 0
                },
                {
                    "sent": "I don't know if we can switch it, but what you will see here is what a student typically sees on the laptop or on their personal device.",
                    "label": 0
                },
                {
                    "sent": "You see, on the left side is the continuous transcript of what I am speaking in real-time.",
                    "label": 0
                },
                {
                    "sent": "We worked very hard on reducing the latency of this decoding.",
                    "label": 0
                },
                {
                    "sent": "So that the speech output comes not much later after I spoke the word.",
                    "label": 0
                },
                {
                    "sent": "Typically it's one second or one word behind, and you see the output text coming out in English.",
                    "label": 0
                },
                {
                    "sent": "And in this case we turned on Spanish translation.",
                    "label": 0
                },
                {
                    "sent": "So you see the translation in Spanish on the right side.",
                    "label": 0
                },
                {
                    "sent": "Notice that I never say periods or commas, so the system has to insert automatically punctuation.",
                    "label": 0
                },
                {
                    "sent": "That doesn't always work correctly, and sometimes you get goofy results as a as a result, but.",
                    "label": 0
                },
                {
                    "sent": "Nevertheless, it's inserting the periods the translation is being done, and still the translation is done with low latency so that the output sometimes arrives before I finished speaking my sentence.",
                    "label": 0
                },
                {
                    "sent": "So the system, as in human interpretation, has to make guesses as to how the sentence will ultimately end so it can pick the right context in the right translation, in this case into Spanish.",
                    "label": 0
                },
                {
                    "sent": "Now all of this in the situation of building systems that run for lecture halls is done in the cloud there.",
                    "label": 0
                },
                {
                    "sent": "In that case, we don't necessarily have to have that in the pocket of people, but it can run in the clouds because people just bring their devices and they go to a website.",
                    "label": 0
                },
                {
                    "sent": "So if we go to switch back to the slides, we can see what that looks like.",
                    "label": 0
                },
                {
                    "sent": "We have then a server running in somewhere in the basement that does all the heavy lifting computationally, and the speech from the different lecture halls.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Being broadcast brought to the to these machines and then automatically translated into the languages of the user's.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Result students then open their laptop and they see the simultaneous transcript and translation of the lecture as it goes on, and this is actually something very nice for us in casual because in culture we could possibly not possibly afford the great effort that the Parliament, for example is doing for human interpretation, and so a machine, even though is not as good as as a human.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Interpreter does at least provide translation or interpretation so that students can follow on along on the lecture.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's something cute things where we've tinkered with over the years that not only do you always have the I have 4 minutes or I'm 4 minutes overtime, OK?",
                    "label": 0
                },
                {
                    "sent": "I'm so of course the question is always how do you deliver this?",
                    "label": 0
                },
                {
                    "sent": "The dream is to make language barriers completely transparent.",
                    "label": 0
                },
                {
                    "sent": "We want to live in a world where we can communicate openly as if nothing happened.",
                    "label": 0
                },
                {
                    "sent": "We will hear later about the Skype translator.",
                    "label": 0
                },
                {
                    "sent": "That's another use case.",
                    "label": 0
                },
                {
                    "sent": "Pocket Translators signed translators.",
                    "label": 0
                },
                {
                    "sent": "All of these ways of tools by which people can do that.",
                    "label": 0
                },
                {
                    "sent": "But still, it's always the machine still interfering and being in the midst of it.",
                    "label": 0
                },
                {
                    "sent": "So we did a great deal of thinking about how it might become.",
                    "label": 0
                },
                {
                    "sent": "For example, even more.",
                    "label": 0
                },
                {
                    "sent": "Transparent in the future, here's 1 funny thing that we did.",
                    "label": 0
                },
                {
                    "sent": "For example, heads up display goggles so you put on these goggles and you see subtitles in the glasses so that you can read subtitles while you're looking at someone or for example, and targeted audio device, which we will demonstrate to you here, which we also worked on in the context of another European project.",
                    "label": 0
                },
                {
                    "sent": "So suppose you prefer rather than looking at laptops to have someone whisper in your ears the automatic translation.",
                    "label": 0
                },
                {
                    "sent": "Of your speech, then you could be using a device like that.",
                    "label": 0
                },
                {
                    "sent": "This was an early prototype was developed in under in a project by Daimler Chrysler and this prototype was at some point also marketed and built by Sennheiser.",
                    "label": 0
                },
                {
                    "sent": "So what you see here is output translations from speech and is it working?",
                    "label": 0
                },
                {
                    "sent": "So some of you should be here.",
                    "label": 0
                },
                {
                    "sent": "I don't hear anything that's coming out of the speaker, but if that speaker is pointed to you, you will actually hear the voice the whispering of the output speech of that person.",
                    "label": 0
                },
                {
                    "sent": "Now, because it is so directional, so targeted to one individual person, or arrange in the room only the people there can hear it so we can do actually translation into multiple languages in different parts of the room.",
                    "label": 0
                },
                {
                    "sent": "So you could be sitting over here in French and over there you get translation in Spanish and.",
                    "label": 0
                },
                {
                    "sent": "And so on.",
                    "label": 0
                },
                {
                    "sent": "It was F doesn't hear anything right now, but if you're pointing it to Joseph, suddenly you hear it.",
                    "label": 0
                },
                {
                    "sent": "It's spooky.",
                    "label": 0
                },
                {
                    "sent": "It's really likes hearing voices in your head suddenly, and we in earlier days we had great fun playing music to people on the street who they were get all shocked that suddenly they hear things coming out of the blue in their ears.",
                    "label": 0
                },
                {
                    "sent": "So this is possible to do these things.",
                    "label": 0
                },
                {
                    "sent": "And if you think of a world where this all becomes transparent, it becomes something that you that you don't think about it becomes.",
                    "label": 0
                },
                {
                    "sent": "Second nature that you have this these as.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And functions, then I think we might approach somewhere where we have achieved.",
                    "label": 0
                },
                {
                    "sent": "Now that is not.",
                    "label": 0
                },
                {
                    "sent": "These automatic tools are great way of assisting humans in.",
                    "label": 0
                },
                {
                    "sent": "If there's nothing else available, the European Parliament and again very grateful that we have all got cause me deuces under Hannah Klimek and her colleagues all here who are actually working in the human Parliament doing this by human effort largely is.",
                    "label": 0
                },
                {
                    "sent": "So much better still than what we can do, but here too we are working on various ways of supporting this and the last minute that I have.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A flash on remaining problems.",
                    "label": 0
                },
                {
                    "sent": "It's not straightforward.",
                    "label": 0
                },
                {
                    "sent": "You have all these problems with composite are in German you have English words slipping into German lectures.",
                    "label": 0
                },
                {
                    "sent": "Cloud Budgeter webcast, Sue Griff, webcaster down.",
                    "label": 0
                },
                {
                    "sent": "Gallo did are inflected German inflected English words and.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the future, there are still many open issues.",
                    "label": 0
                },
                {
                    "sent": "For example the drama of Electra, the Emotion of Electra is not well represented, not even the gender of the speaker is correctly translated.",
                    "label": 0
                },
                {
                    "sent": "As we found out in Thailand, where you use different phrases depending on who you talk too.",
                    "label": 0
                },
                {
                    "sent": "So there's really a need, still forgetting more contextualized or more contextually sensitive translation going so that translation can be done with with the speaker and listener in mind.",
                    "label": 0
                },
                {
                    "sent": "In lectures, we find this because.",
                    "label": 0
                },
                {
                    "sent": "When Electra talks about the particular point they want to emphasize, the output needs to reflect that.",
                    "label": 0
                },
                {
                    "sent": "Last night though.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then I conclude, is this long tail of language.",
                    "label": 1
                },
                {
                    "sent": "It was already mentioned by Jamie and various others that how to do low resource languages to ultimately get this dream out to 6007 thousand languages in the world.",
                    "label": 0
                },
                {
                    "sent": "The cost of developing these systems has to come down has to go with lot less data, and so we're on the way of developing new, innovative ways of doing this with low cost with little data as well.",
                    "label": 0
                },
                {
                    "sent": "So again.",
                    "label": 0
                },
                {
                    "sent": "With that, the dream still keeps us busy.",
                    "label": 0
                },
                {
                    "sent": "Multilingualism will hear more discussion later.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From Babylonian confusion.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The world understanding is ultimately the goal and interest we're pursuing here.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}