{
    "id": "4gok3faygagqbg6pobkmsom4z3kxq3dd",
    "title": "A Survey on Mouth Modeling and Analysis for Sign Language Recognition",
    "info": {
        "author": [
            "Epameinondas Antonakos, Intelligent Behaviour Understanding Group (iBUG), Department of Computing, Imperial College London"
        ],
        "published": "July 2, 2015",
        "recorded": "May 2015",
        "category": [
            "Top->Computer Science->Computer Vision",
            "Top->Computer Science->Computer Vision->Face & Gesture Analysis"
        ]
    },
    "url": "http://videolectures.net/fgconference2015_antonakos_sign_language/",
    "segmentation": [
        [
            "Hello, my name is Nelson Arcos and I will present you a survey on math, modeling and analysis for sign language recognition.",
            "A doctor or nurse, such as Rousseau's Doctor, Stephens are free, and myself were all members of the above group in Imperial College London.",
            "This is an outline of."
        ],
        [
            "Stock it actually consists of three parts.",
            "First, we're going to try to answer the question whether the mouth is actually linguistically significant for sign language, then we're going to review the existing methods that actually employ math modeling for automatic sign language recognition and finally going to discuss about the future work that challenges on the potentials of the problem.",
            "So."
        ],
        [
            "Starting with the first question, let me start."
        ],
        [
            "Actually, with us statistics about sign language, so about 5% of the worldwide population actually suffers from some hearing loss from hearing loss to some degree, 1% of the worldwide population actually use sign languages as their native languages, which this translates to about 70 million deaf people.",
            "Also, a sign languages are used from people who cannot physically speak, so people that suffer from mutism and note that there is not a unique sign language worldwide.",
            "Actually its counter has its own, so there are hundreds of different sign languages."
        ],
        [
            "So deaf people, the whole deaf community actually encounters many difficulties in the everyday life, like in education or in their workplaces or in everyday things like the use of the Internet.",
            "This mainly due to two reasons.",
            "The first one is that most deaf people are have limited reading and writing skills in the spoken language.",
            "Actually, the spoken language for them is totally a totally foreign language with fundamentally different grammatical structure, and the second reason is that the vast majority of the rest of the population is totally unable to use sign language.",
            "So this highlights the importance of automatic sign language recognition, which can greatly support the deaf community.",
            "However, all a SLR is still very far from being a mature technology with practical applications, and especially if we compare it with other fields like the text based interaction or speech recognition."
        ],
        [
            "So let me present briefly the structure of sign language.",
            "Sign languages are as rates on grammatically complex as a spoken languages.",
            "They actually have two kinds of articulators, the manual and then manual ones.",
            "The manual manual articulators they actually express phonemes which are the basically the basic semantic components of sign language and a include the save the poster, the motion, the location of the hunt.",
            "On the other way, on the other side the non manual articulators are used for the prosody.",
            "The lexical distinction, grammatical structure and adjectival or adverbial content, and they include the body and set poles.",
            "They include facial expressions through the eyes, the eyebrows and the lips, etc.",
            "And of course, mouth movements.",
            "Actually, recent research has shown that the mouth is one of the most involved facial parts of non mammals, so This is why we focus on this server on the mouth."
        ],
        [
            "The more functions, or if you prefer the mouthy lexical articulators, are separated into major categories.",
            "The mouse gestures and the mouse things North gestures are basically non verbal components which include the deformation of the shape of the lips, the movement of the tongue or the visibility of the visibility of the teeth.",
            "The more things on the other hand are silent articulators that correspond to a pronounced word or part of the world, and so actually they are visual C labs and know that in most sign languages.",
            "Whenever a word, these articulated, actually only the first part of the world, is on the 1st syllable of the word, is articulated."
        ],
        [
            "So in the research community, there is actually a big debate regarding whether the malfunctions are significantly important for for sign language or not, and there are some researchers that argue that a malfunction, especially the mouth things, are not linguistically significant.",
            "Actually, you can see two citations that actually supports this opinion.",
            "However, recent research has shown that a month actions contribute significantly to the semantic analysis of sign languages.",
            "Special."
        ],
        [
            "Likely the frequency of malfunctions is actually different for each sign language.",
            "It depends on the context and the grammatical category of the manual sign that they occur with.",
            "Also, malfunctions have a prosodic interpretation in most of the cases, and in other cases they have a lexical meaning.",
            "And note that there are actually cases that the mouth articulates some physical events, sensations, or emotions.",
            "For example, types of textures or types of sounds or noise, etc."
        ],
        [
            "So let me actually show you 2 examples that highlight the importance of malfunctions in sign language.",
            "The first one comes from the American Sign Language, and it's the sign late on the sign, not yet.",
            "As you can see both signs.",
            "They have the exact same manual articulation, so the signer has to just move his hands his palm downwards.",
            "The only way to distinguish between them is through the mouth action, so the sign late is combined without it doesn't have any more faction, but the sign, not yet is usually combined with the tongue touching the lower lip."
        ],
        [
            "A similar example comes from the German sign language for the words Brother and Sister, where again we have the exact same manual articulation but the sign.",
            "But in order to separate between them, the same brother is combined with a more throne and the word sister is combined with the most red."
        ],
        [
            "So, since we've seen that the mouth is actually important for sign language, we actually conducted conducted the review of the existing methods that actually employ math modeling for automatic sign language recognition."
        ],
        [
            "It's a list of the papers that we found.",
            "As you can see, the research that exists is quite limited and another interest."
        ],
        [
            "Thing is that if you check the publication here of all the papers, there are four papers that were published on 2014 three papers published in 2015.",
            "So 7 out of 12 papers are actually published on the last two years."
        ],
        [
            "We will try now to categorize the existing papers with respect to the methods of the use for math modeling and for landmark localization or tracking the features that are extracted from the mouth.",
            "That recognition or classification techniques that are that are employed at the linguistic phenomena that are tackled.",
            "And of course, the sign language that they are applied on.",
            "So regarding the methods that are used for math modeling."
        ],
        [
            "Landmark localization or tracking.",
            "As you can see, most of the methods actually use active appearance models.",
            "There are two methods that use that cannot be Lucas Tomasi, the tracker, the KLT tracker, and one method that employs the manual rotations and one method that actually tries to fit an elliptical structure on the face.",
            "We can actually further separate the methods that use AMS onto sub categories.",
            "The three first papers actually use a global am, so the same model actually describes the global facial structure, while the last the last work actually used local AM, so am strained on facial parts on specific facial regions like the month."
        ],
        [
            "Regarding the features that are extracted from the mouth, there are papers that use safe based features or features that are based on the geometric measures from the mouth, like the height and the width.",
            "There are papers that use appearance based features and of course papers that use both of them.",
            "On the last row, actually you can see.",
            "The first line is the first eigenvector of a PCA save model of the mouth and the second line is a PCA is the first eigenvector of the PCA appearance model of the mouth, which actually indicate like so some very important features.",
            "For example, the appearance vectors.",
            "The first eigenvector describes the that unk visibility."
        ],
        [
            "Let's move on to the recognition and classification techniques.",
            "Most of the existing works actually employee Hmm's and the rest of them use SVM, LDA or clustering.",
            "Actually, Hmm's are also very commonly used for modeling the manual articulators."
        ],
        [
            "Then all the existing work papers can be separated into categories based on the linguistic phenomenon that tried to tackle.",
            "There are papers that actually try to detect and recognize linguistic phenomena related to the mouth, like the negation.",
            "A questions, for example, WH questions, conditional relative clauses, assertions on the same boundaries.",
            "Actually, recently it has been shown that the mouth is an excellent indicator of the bounders assign the beginning at the end of a sign and the second category includes papers that actually try to detect and recognize more things."
        ],
        [
            "Finally, most of the papers are applied on the Americans on the German side languages, and there are only two papers that are applied on the British on the Greek one, and this is the you of course, to the existence of very large and annotated databases on American sign languages."
        ],
        [
            "So, given the limited work that exists on math modeling within the automatic sign language recognition a let us discuss the future work, the challenges on the potentials of the problem."
        ],
        [
            "Automatic analysis of Martin manuals is actually a very challenging problem.",
            "This is mainly because the data that exists suffer from things like the occlusion by the front, very frequent occlusion by hands.",
            "It tends more things I expressions and poses which actually make the landmark localization problem very difficult, and also that Trump is the visibility which is important.",
            "Sometimes it's not very clear be cause of the low resolution of the mouth region.",
            "So the problem can actually be separated into subproblems, which is the automatic understanding of math related expressions, which is of course related to the math testers and automatic understanding of mountains."
        ],
        [
            "The first one, automatic understanding of math expressions.",
            "We strongly believe that it can greatly benefit from the excessive research on automatic analysis of facial expressions, analysis of facial expressions actually involves involves 2 main lines of research.",
            "The message, judgment and design judgment.",
            "The first one, the message Esmont, aims to recognize the meaning that is convened with specific facial expression so very common task is actually the detection of the six basic emotions.",
            "The second one aims to recognize the atoms that actually cause the manifestation of a specific facial expressions.",
            "An example of such atoms are of course the individual facial muscles and I refer to the very well known facial action coding system."
        ],
        [
            "So the first one of those lines of research, the message judgment, is actually not suitable for a seller on this, because it can only deal with a very discrete set of predefined expressions, which is not able to cover the full range of possible expressions that can appear within sign language.",
            "Also note that there is not a universal set of predefined expressions within sign language.",
            "However the second one, the same judgment.",
            "We think that it's very relevant to a SLR, and this big cause, every possible facial expression can actually be described comprehensively with a combination of specific action action units.",
            "So a combination of facial muscles movement.",
            "However, within this field a the annotation of action unit is actually a very hard task, and it's very time consuming, and it requires trained annotators so very challenging problem.",
            "Here is the development of techniques that can be used for semi supervised annotation function units."
        ],
        [
            "Finally, the second subproblem of automatic analysis and modeling of mouth within a non manual articulators is the automatic understanding of more things which we think that can greatly benefit from visual speech recognition.",
            "Visual speech recognition aims to actually recognize the seams and everything is a generic facial limit that can be used to describe a particular sound.",
            "So it is kind of equivalent to the phone number for the spoken language within cell phones.",
            "However, do not have a one to one correspondence, which makes the problem very hard.",
            "The existing research mostly focuses on ways to represent a visual speech data using latent variables, and they visit recognition problem is not solved yet, and it's actually a very challenging problem even for humans, since they reported human error rate is about 50%."
        ],
        [
            "So to conclude, the development of automatic sign language recognition systems, we believe that it has the potential to support millions of deaf people and help the deaf community.",
            "But at the same time, it can help linguists to better understand sign language is.",
            "A seller has until now mainly concentrated on manual features.",
            "Recent research, though has shown that non manuals and especially the mouth play a very important role, so only recently very few papers appeared that attempt to make the Fusion of manual and manual cues.",
            "Finally, we strongly believe that math modeling for a SLR can greatly benefit from 2 fields with very extended research, which is the facial expression recognition on the visual speech recognition."
        ],
        [
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hello, my name is Nelson Arcos and I will present you a survey on math, modeling and analysis for sign language recognition.",
                    "label": 1
                },
                {
                    "sent": "A doctor or nurse, such as Rousseau's Doctor, Stephens are free, and myself were all members of the above group in Imperial College London.",
                    "label": 0
                },
                {
                    "sent": "This is an outline of.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Stock it actually consists of three parts.",
                    "label": 0
                },
                {
                    "sent": "First, we're going to try to answer the question whether the mouth is actually linguistically significant for sign language, then we're going to review the existing methods that actually employ math modeling for automatic sign language recognition and finally going to discuss about the future work that challenges on the potentials of the problem.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Starting with the first question, let me start.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Actually, with us statistics about sign language, so about 5% of the worldwide population actually suffers from some hearing loss from hearing loss to some degree, 1% of the worldwide population actually use sign languages as their native languages, which this translates to about 70 million deaf people.",
                    "label": 1
                },
                {
                    "sent": "Also, a sign languages are used from people who cannot physically speak, so people that suffer from mutism and note that there is not a unique sign language worldwide.",
                    "label": 1
                },
                {
                    "sent": "Actually its counter has its own, so there are hundreds of different sign languages.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So deaf people, the whole deaf community actually encounters many difficulties in the everyday life, like in education or in their workplaces or in everyday things like the use of the Internet.",
                    "label": 1
                },
                {
                    "sent": "This mainly due to two reasons.",
                    "label": 0
                },
                {
                    "sent": "The first one is that most deaf people are have limited reading and writing skills in the spoken language.",
                    "label": 0
                },
                {
                    "sent": "Actually, the spoken language for them is totally a totally foreign language with fundamentally different grammatical structure, and the second reason is that the vast majority of the rest of the population is totally unable to use sign language.",
                    "label": 1
                },
                {
                    "sent": "So this highlights the importance of automatic sign language recognition, which can greatly support the deaf community.",
                    "label": 0
                },
                {
                    "sent": "However, all a SLR is still very far from being a mature technology with practical applications, and especially if we compare it with other fields like the text based interaction or speech recognition.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me present briefly the structure of sign language.",
                    "label": 0
                },
                {
                    "sent": "Sign languages are as rates on grammatically complex as a spoken languages.",
                    "label": 1
                },
                {
                    "sent": "They actually have two kinds of articulators, the manual and then manual ones.",
                    "label": 0
                },
                {
                    "sent": "The manual manual articulators they actually express phonemes which are the basically the basic semantic components of sign language and a include the save the poster, the motion, the location of the hunt.",
                    "label": 0
                },
                {
                    "sent": "On the other way, on the other side the non manual articulators are used for the prosody.",
                    "label": 1
                },
                {
                    "sent": "The lexical distinction, grammatical structure and adjectival or adverbial content, and they include the body and set poles.",
                    "label": 0
                },
                {
                    "sent": "They include facial expressions through the eyes, the eyebrows and the lips, etc.",
                    "label": 0
                },
                {
                    "sent": "And of course, mouth movements.",
                    "label": 0
                },
                {
                    "sent": "Actually, recent research has shown that the mouth is one of the most involved facial parts of non mammals, so This is why we focus on this server on the mouth.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The more functions, or if you prefer the mouthy lexical articulators, are separated into major categories.",
                    "label": 1
                },
                {
                    "sent": "The mouse gestures and the mouse things North gestures are basically non verbal components which include the deformation of the shape of the lips, the movement of the tongue or the visibility of the visibility of the teeth.",
                    "label": 0
                },
                {
                    "sent": "The more things on the other hand are silent articulators that correspond to a pronounced word or part of the world, and so actually they are visual C labs and know that in most sign languages.",
                    "label": 1
                },
                {
                    "sent": "Whenever a word, these articulated, actually only the first part of the world, is on the 1st syllable of the word, is articulated.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in the research community, there is actually a big debate regarding whether the malfunctions are significantly important for for sign language or not, and there are some researchers that argue that a malfunction, especially the mouth things, are not linguistically significant.",
                    "label": 1
                },
                {
                    "sent": "Actually, you can see two citations that actually supports this opinion.",
                    "label": 0
                },
                {
                    "sent": "However, recent research has shown that a month actions contribute significantly to the semantic analysis of sign languages.",
                    "label": 1
                },
                {
                    "sent": "Special.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Likely the frequency of malfunctions is actually different for each sign language.",
                    "label": 1
                },
                {
                    "sent": "It depends on the context and the grammatical category of the manual sign that they occur with.",
                    "label": 1
                },
                {
                    "sent": "Also, malfunctions have a prosodic interpretation in most of the cases, and in other cases they have a lexical meaning.",
                    "label": 1
                },
                {
                    "sent": "And note that there are actually cases that the mouth articulates some physical events, sensations, or emotions.",
                    "label": 0
                },
                {
                    "sent": "For example, types of textures or types of sounds or noise, etc.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me actually show you 2 examples that highlight the importance of malfunctions in sign language.",
                    "label": 0
                },
                {
                    "sent": "The first one comes from the American Sign Language, and it's the sign late on the sign, not yet.",
                    "label": 0
                },
                {
                    "sent": "As you can see both signs.",
                    "label": 0
                },
                {
                    "sent": "They have the exact same manual articulation, so the signer has to just move his hands his palm downwards.",
                    "label": 0
                },
                {
                    "sent": "The only way to distinguish between them is through the mouth action, so the sign late is combined without it doesn't have any more faction, but the sign, not yet is usually combined with the tongue touching the lower lip.",
                    "label": 1
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A similar example comes from the German sign language for the words Brother and Sister, where again we have the exact same manual articulation but the sign.",
                    "label": 0
                },
                {
                    "sent": "But in order to separate between them, the same brother is combined with a more throne and the word sister is combined with the most red.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So, since we've seen that the mouth is actually important for sign language, we actually conducted conducted the review of the existing methods that actually employ math modeling for automatic sign language recognition.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's a list of the papers that we found.",
                    "label": 0
                },
                {
                    "sent": "As you can see, the research that exists is quite limited and another interest.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thing is that if you check the publication here of all the papers, there are four papers that were published on 2014 three papers published in 2015.",
                    "label": 0
                },
                {
                    "sent": "So 7 out of 12 papers are actually published on the last two years.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We will try now to categorize the existing papers with respect to the methods of the use for math modeling and for landmark localization or tracking the features that are extracted from the mouth.",
                    "label": 1
                },
                {
                    "sent": "That recognition or classification techniques that are that are employed at the linguistic phenomena that are tackled.",
                    "label": 0
                },
                {
                    "sent": "And of course, the sign language that they are applied on.",
                    "label": 0
                },
                {
                    "sent": "So regarding the methods that are used for math modeling.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Landmark localization or tracking.",
                    "label": 0
                },
                {
                    "sent": "As you can see, most of the methods actually use active appearance models.",
                    "label": 0
                },
                {
                    "sent": "There are two methods that use that cannot be Lucas Tomasi, the tracker, the KLT tracker, and one method that employs the manual rotations and one method that actually tries to fit an elliptical structure on the face.",
                    "label": 0
                },
                {
                    "sent": "We can actually further separate the methods that use AMS onto sub categories.",
                    "label": 0
                },
                {
                    "sent": "The three first papers actually use a global am, so the same model actually describes the global facial structure, while the last the last work actually used local AM, so am strained on facial parts on specific facial regions like the month.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Regarding the features that are extracted from the mouth, there are papers that use safe based features or features that are based on the geometric measures from the mouth, like the height and the width.",
                    "label": 0
                },
                {
                    "sent": "There are papers that use appearance based features and of course papers that use both of them.",
                    "label": 0
                },
                {
                    "sent": "On the last row, actually you can see.",
                    "label": 0
                },
                {
                    "sent": "The first line is the first eigenvector of a PCA save model of the mouth and the second line is a PCA is the first eigenvector of the PCA appearance model of the mouth, which actually indicate like so some very important features.",
                    "label": 0
                },
                {
                    "sent": "For example, the appearance vectors.",
                    "label": 0
                },
                {
                    "sent": "The first eigenvector describes the that unk visibility.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's move on to the recognition and classification techniques.",
                    "label": 0
                },
                {
                    "sent": "Most of the existing works actually employee Hmm's and the rest of them use SVM, LDA or clustering.",
                    "label": 0
                },
                {
                    "sent": "Actually, Hmm's are also very commonly used for modeling the manual articulators.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then all the existing work papers can be separated into categories based on the linguistic phenomenon that tried to tackle.",
                    "label": 0
                },
                {
                    "sent": "There are papers that actually try to detect and recognize linguistic phenomena related to the mouth, like the negation.",
                    "label": 0
                },
                {
                    "sent": "A questions, for example, WH questions, conditional relative clauses, assertions on the same boundaries.",
                    "label": 0
                },
                {
                    "sent": "Actually, recently it has been shown that the mouth is an excellent indicator of the bounders assign the beginning at the end of a sign and the second category includes papers that actually try to detect and recognize more things.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Finally, most of the papers are applied on the Americans on the German side languages, and there are only two papers that are applied on the British on the Greek one, and this is the you of course, to the existence of very large and annotated databases on American sign languages.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So, given the limited work that exists on math modeling within the automatic sign language recognition a let us discuss the future work, the challenges on the potentials of the problem.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Automatic analysis of Martin manuals is actually a very challenging problem.",
                    "label": 1
                },
                {
                    "sent": "This is mainly because the data that exists suffer from things like the occlusion by the front, very frequent occlusion by hands.",
                    "label": 0
                },
                {
                    "sent": "It tends more things I expressions and poses which actually make the landmark localization problem very difficult, and also that Trump is the visibility which is important.",
                    "label": 1
                },
                {
                    "sent": "Sometimes it's not very clear be cause of the low resolution of the mouth region.",
                    "label": 0
                },
                {
                    "sent": "So the problem can actually be separated into subproblems, which is the automatic understanding of math related expressions, which is of course related to the math testers and automatic understanding of mountains.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The first one, automatic understanding of math expressions.",
                    "label": 1
                },
                {
                    "sent": "We strongly believe that it can greatly benefit from the excessive research on automatic analysis of facial expressions, analysis of facial expressions actually involves involves 2 main lines of research.",
                    "label": 1
                },
                {
                    "sent": "The message, judgment and design judgment.",
                    "label": 0
                },
                {
                    "sent": "The first one, the message Esmont, aims to recognize the meaning that is convened with specific facial expression so very common task is actually the detection of the six basic emotions.",
                    "label": 0
                },
                {
                    "sent": "The second one aims to recognize the atoms that actually cause the manifestation of a specific facial expressions.",
                    "label": 0
                },
                {
                    "sent": "An example of such atoms are of course the individual facial muscles and I refer to the very well known facial action coding system.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the first one of those lines of research, the message judgment, is actually not suitable for a seller on this, because it can only deal with a very discrete set of predefined expressions, which is not able to cover the full range of possible expressions that can appear within sign language.",
                    "label": 1
                },
                {
                    "sent": "Also note that there is not a universal set of predefined expressions within sign language.",
                    "label": 0
                },
                {
                    "sent": "However the second one, the same judgment.",
                    "label": 1
                },
                {
                    "sent": "We think that it's very relevant to a SLR, and this big cause, every possible facial expression can actually be described comprehensively with a combination of specific action action units.",
                    "label": 0
                },
                {
                    "sent": "So a combination of facial muscles movement.",
                    "label": 0
                },
                {
                    "sent": "However, within this field a the annotation of action unit is actually a very hard task, and it's very time consuming, and it requires trained annotators so very challenging problem.",
                    "label": 0
                },
                {
                    "sent": "Here is the development of techniques that can be used for semi supervised annotation function units.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Finally, the second subproblem of automatic analysis and modeling of mouth within a non manual articulators is the automatic understanding of more things which we think that can greatly benefit from visual speech recognition.",
                    "label": 1
                },
                {
                    "sent": "Visual speech recognition aims to actually recognize the seams and everything is a generic facial limit that can be used to describe a particular sound.",
                    "label": 1
                },
                {
                    "sent": "So it is kind of equivalent to the phone number for the spoken language within cell phones.",
                    "label": 0
                },
                {
                    "sent": "However, do not have a one to one correspondence, which makes the problem very hard.",
                    "label": 1
                },
                {
                    "sent": "The existing research mostly focuses on ways to represent a visual speech data using latent variables, and they visit recognition problem is not solved yet, and it's actually a very challenging problem even for humans, since they reported human error rate is about 50%.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to conclude, the development of automatic sign language recognition systems, we believe that it has the potential to support millions of deaf people and help the deaf community.",
                    "label": 1
                },
                {
                    "sent": "But at the same time, it can help linguists to better understand sign language is.",
                    "label": 1
                },
                {
                    "sent": "A seller has until now mainly concentrated on manual features.",
                    "label": 0
                },
                {
                    "sent": "Recent research, though has shown that non manuals and especially the mouth play a very important role, so only recently very few papers appeared that attempt to make the Fusion of manual and manual cues.",
                    "label": 1
                },
                {
                    "sent": "Finally, we strongly believe that math modeling for a SLR can greatly benefit from 2 fields with very extended research, which is the facial expression recognition on the visual speech recognition.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}