{
    "id": "4jtpjy3q35jn33uckuticyx5ynehjztf",
    "title": "Efficiently Learning the Accuracy of Labeling Sources for Selective Sampling",
    "info": {
        "author": [
            "Pinar Donmez, Language Technologies Institute, Carnegie Mellon University"
        ],
        "published": "Sept. 14, 2009",
        "recorded": "June 2009",
        "category": [
            "Top->Computer Science->Machine Learning->Active Learning"
        ]
    },
    "url": "http://videolectures.net/kdd09_donmez_elalsss/",
    "segmentation": [
        [
            "Welcome everybody.",
            "My name is Bernard en masse, and the title of my talk is efficiently learning the accuracy of labeling sources for selective sampling, and this is a joint work with Jaime Carbonell and Jeff Schneider from Carnegie Mellon University.",
            "So let me first."
        ],
        [
            "Briefly explain the problem that we are addressing in this work with an illustrative example.",
            "Let's assume that for the simplicity we have a simple binary classification task where we have a small amount of labeled instances which are the colored circles in this figure and a large amount of unlabeled instances, and unlike traditional active learning frameworks, we assume that we have access to a bunch of a bunch of oracles or labelers annotators experts.",
            "However, you want to call them, and we also we further assume that these oracles are noisy.",
            "Meaning that they make labeling mistakes.",
            "So they they might have different accuracy rates, but these are unknown to the learning algorithm.",
            "So the question arises how?",
            "How can you decide which oracles to query for the instances that you have?",
            "If you have, you might have a limited budget that you may want your money wisely by selecting by selectively sampling the oracles.",
            "So this is the problem that we are addressing."
        ],
        [
            "In this paper.",
            "And so let me just.",
            "Recall our goal.",
            "Our goal is to find the labels with the highest with very high expected accuracy, and we borrowed the idea from internal estimation learning, which is originally proposed by killing for reinforcement learning and we proceed as as follows.",
            "The estimated reward for each labeler, and I will talk more about this on the next slide.",
            "But let's just assume that we have a reward for each label for now.",
            "And then we compute a confidence interval for for each label that we choose using this formula using the mean of the reverse under standard deviation that we have observed so far for that labeler, and then we select the labelers whose upper interval whose upper interval higher than some threshold.",
            "So this way we can focus on only on the exam only on the label is that we believe have high accuracy and.",
            "We can filter out the less reliable ones, and this will significantly reduce the labeling cost, and then for all the order for all the labels that we have selected, the Observare label that they output.",
            "And then we repeat this process for a fixed amount of iterations or or depending on how much.",
            "How much money did we have.",
            "We can spend.",
            "And the benefits of using a confidence interval like the formula shown in this slide, the benefit is that it automatically balances and exploration versus exploitation tradeoff, because the this interval can be high if the mean reward for that labor is high, which corresponds to exploitation, or it can be high due to the fact that it has large uncertainties in the reward estimates, and it is also.",
            "A beneficial to sample that label, or in this case, because it means that we haven't sampled that label are enough to have a reliable estimate.",
            "So this corresponds to exploration.",
            "Naturally, the algorithm takes care of this tradeoff."
        ],
        [
            "Between the two.",
            "So as I promised that that I will speak about the rewards for the labelers in this work, the reward for a labeler is unknown.",
            "So if we need to estimate it, and if you think about it, what is the reward that we can assign to a labeler?",
            "What is important to us is that whether that labor is going to give us the true label or not, so.",
            "Or should be related with the with the fact that whether the labeler outpost, the true label and True label is also unknown, so but we can, we can estimate it using majority voting if we assume that the oracles have accuracy is better than random guess, which we assumed in this paper, then it becomes reasonable to use the majority vote as an as an estimate for the true label.",
            "Then we propose the following reward function.",
            "So we we have selected the Oracle.",
            "We have selected the oracles that we want to query for the label.",
            "And then they also put some label and we take the majority vote.",
            "And then we look at the Oracles and their output, and we give a reward of 1 to each Oracle that agrees with the majority world.",
            "Assuming that the majority is the correct label and we give a reward of 0 otherwise.",
            "So this is like a binary reward function."
        ],
        [
            "So I'm going to illustrate how this method works with on with some simple illustrative example.",
            "So at the very beginning we assume that the Oracles have the same interval, so we sample all all of them at 4 for the for the initial iteration."
        ],
        [
            "And then overtime we will be estimating the confidence intervals and they will have different confidence intervals and the algorithm will keep selecting the Oracle's or whose upper interval are are above the threshold and for instance in this case it will be selecting four out of five oracles, ignoring the one that is below the threshold.",
            "And then if we."
        ],
        [
            "Keep doing that overtime.",
            "The Oracles will shrink because we will.",
            "We will have better estimates about the accuracy for those oracles, and the algorithm is going to become more biased towards the oracles that it thinks are the best ones, so it may end up selecting only one Oracle towards the end instead of selecting more oracles at the beginning.",
            "And I have an experimental result on this in a couple of couple of slides."
        ],
        [
            "So so far I I talked only about Oracle selection, so we we have talked about that the fact that we have a set of oracles and we know how to have to choose which oracles that we want to query.",
            "But there's also another component that we want to decide which instance to ask for the label, and we just follow a simple approach using uncertainties sampling.",
            "So we choose the instance to query for the label baselines uncertainties.",
            "So in this case we can select the instance that is closest to the decision boundary because it's the most uncertain that is the instance that we are most uncertain about the label, and then we query its label to the oracles that we have chosen and then take the majority vote and assign it to that instance as the true label.",
            "And then we iterate.",
            "So now I can discuss some experimental results that we run.",
            "This is a data set from the UCI.",
            "This is the mushroom data set, and we compared our method against two baselines.",
            "One is the random Oracle, so."
        ],
        [
            "Selection, So what it does is at each for each instance it selects one Oracle uniformly at random and then queries that Oracle and repeated labeling is an idea that we borrowed from last year's KDD paper, which repeated baseline samples all the oracles for each instance, but it is different than what is actually proposed in the paper because they were requiring they were acquiring additional labels for.",
            "Already existing examples in the training set, but we the baseline that we used in the in the paper as a as comparison is we query all the oracles for each new instances because we wanted to, we wanted to compare our method against naive selections, nice selections of oracles, and we see that the Y axis is the classification error and our algorithm is doing outperforming the other oracles.",
            "Depending on with respect to the number of Oracle queries that it makes, and we have similar results on other datasets are just don't have time to show them all.",
            "But you can come to my poster.",
            "So also we have an alloy."
        ],
        [
            "First, we made another analysis where we wanted to see how frequently the oracles are chosen by our method.",
            "So these color histograms shows the number of times each Oracle is selected on the Y axis and on the X axis it is the true accuracy of the oracles, and I also forgot to mention that these are real datasets, but we simulated the Oracle, so these are synthetic oracles.",
            "We simulated 10 oracles.",
            "This sampled accuracy is sampled accuracies randomly from the range .5 and one.",
            "And this shows that the blue color shows the first 10 iterations of our algorithms.",
            "So for the first 10 instances, the Oracles are sampled equally frequently, and for the next 40 examples we will see that there is a shift towards more shift towards higher accuracy oracles, and as we as we iterate more, we will see that the algorithm becomes more biased towards the towards the better.",
            "Or the best oracles which has highest accuracies.",
            "And this is exactly what we would like to see, because this shows us that the exploration step is pretty fast and effective, and the old algorithm can detect the good example good oracles early enough and then exploit them."
        ],
        [
            "Afterwards.",
            "We also wanted to see how robust the algorithm is against the distribution of Oracle accuracies.",
            "So in this data set we see.",
            "On the Y axis is the number of Oracle queries that we make an on the X axis we see the classification accuracy and the left hand side curve shows the situation where we have 10 oracles, but it's a very balanced set.",
            "We have 5 good oracles, good meaning that it has higher is accuracy higher than .8 and five bed oracles, meaning that the accuracy is lower than .7 and on the right hand side we have a very skewed Oracle distribution.",
            "We have only one good Oracle, but the remaining 9 oracles are bad.",
            "But still we see that our algorithm makes the least number of Oracle queries to reach a target accuracy, which is, which is a very promising result.",
            "So besides the simulation studies we have also run some experiments on the on some data that has."
        ],
        [
            "Annotators and we got this data set from a paper in Yemen ALP in 2008.",
            "So the authors created some simple language understanding tasks and they use Amazon's Mechanical Turk to hire annotators to to complete these tasks, and we run our method and the baselines on these datasets, and we compared the accuracy that we get with respect to the.",
            "Queries that we make to get to reach their accuracy and we see that in there are two tasks we adopted from from this paper and we see that our method reaches very desired accuracy level with moderately Oracle moderate number of Oracle queries, but for instance, repeated labeling needs much more much more labeling effort to reach a similar accuracy because it samples all oracles for each instance an it's just not very efficient."
        ],
        [
            "So to conclude.",
            "I can summarize that we have proposed a simple but effective algorithm that naturally balances the exploration versus exploitation tradeoff, and we also filter out the less reliable oracles early in the process, and this boost.",
            "This gives us the performance boost and we also should have shown that trying to estimate the Oracle accuracy is an effective method by which, rather than naively selecting oracles at random, or simply using the mall.",
            "And for future work we would like to go beyond oracles that have consistent label or quality.",
            "In this work, we assume that the Oracle accuracy is not changing overtime, but I can give you examples from real life that there might be situations where the oracles might be getting better overtime, or their accuracies might be decaying.",
            "For instance, in people are designing online games to collect data and like just people over the net, they label some images or doing other.",
            "Other kinds of games, and you can think of situations where the annotators or users are getting tired overtime that their accuracy might decay, or they might be becoming better players at the games, or they might be learning overtime that they their accuracy might be improving and we would like to investigate algorithms that takes that into account and also for this paper we assume that the.",
            "A probability of an Oracle making a mistake is not dependent on the question that you ask, but if there is also realistic to assume that there might be some hard, harder questions, that sort of introduces more noise and we would like to take that into account in the future as well.",
            "And in this work we also assumed implicitly that the oracles make uncorrelated errors, but in the future we would like to relax that assumption and to work with oracles.",
            "Which may correlated errors, and I think that this is a challenging and interesting problem that we would like to."
        ],
        [
            "In the future, so thanks for listening.",
            "And if you have questions, please ask.",
            "Question.",
            "Why do you assume the student distribution?",
            "Or maybe consider other distributions as well?",
            "Why do you ask you in your calculation of the confidence interval when you assume the student distribution?",
            "Did you consider no, we didn't consider this was the student distribution was used in the original interval estimation learning?",
            "That's why we didn't change it.",
            "When did you see it?",
            "And then I'm not gonna be able, or I might be missing something, and I think that they have introduced the booty.",
            "And then yeah.",
            "Actually, interval estimation learning can be used for multi unbanded problems as well.",
            "The benefits of interval estimation is that it naturally balances exploration versus exploitation tradeoff.",
            "You don't need to incorporate any other parameter or anything else to get that tradeoff, and it's also it's also easy to compute, and we can use the intervals and we can threshold to filter out the less reliable ones.",
            "Natural balance between explosions tradition.",
            "This is also good promise stuff, for example ended.",
            "Of the the minimal, correct?",
            "We can take it offline too, yeah?",
            "Back there.",
            "So I was just trying to think about how to improve.",
            "Helpful is if you need to.",
            "You can eat your estimate.",
            "How good and morally it be dependent on the features themselves, and then perhaps people are people who are the actual oracles are better in some domains, yeah.",
            "And the other thing is exactly.",
            "Figured you cradle things at once, when often if we doing supervised learning, it's.",
            "It's sort of better to figure out how to host games, create information from many points rather than right.",
            "Same thing over and over again, so maybe there's a.",
            "Or instead of growing up, he had a special that you everybody about, yes.",
            "Random.",
            "And then there is a technique for freeze medication in order to keep track of the problems intervals on the performance.",
            "So you mean you can use different strategies for different examples?",
            "Or am I misunderstanding it?",
            "Just mean.",
            "So you can create most one person.",
            "By selecting the best one.",
            "Randomizing above the threshold.",
            "Oh OK.",
            "I see it.",
            "Yeah yeah.",
            "But but then you lose.",
            "But then you lose the the majority.",
            "I mean majority vote is a. Yeah, yeah yeah because you.",
            "You can look at.",
            "You have a few billion predictor overtime, yes.",
            "Here is going to be district for some of the labels.",
            "Some of the best games.",
            "OK, yeah.",
            "Yeah, or you can.",
            "I think one other direction to improve is might be the fact that you, the ones for the oracles that are above the threshold.",
            "You can select one and then maybe you can select another one.",
            "And if they agree and if you have some kind of confidence score then you may stop asking the third one even though there are more that are above the threshold.",
            "But this is not something that we have worked on in this paper, but this is definitely something that we can.",
            "Investigate to improve further.",
            "Thanks.",
            "Speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Welcome everybody.",
                    "label": 0
                },
                {
                    "sent": "My name is Bernard en masse, and the title of my talk is efficiently learning the accuracy of labeling sources for selective sampling, and this is a joint work with Jaime Carbonell and Jeff Schneider from Carnegie Mellon University.",
                    "label": 1
                },
                {
                    "sent": "So let me first.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Briefly explain the problem that we are addressing in this work with an illustrative example.",
                    "label": 0
                },
                {
                    "sent": "Let's assume that for the simplicity we have a simple binary classification task where we have a small amount of labeled instances which are the colored circles in this figure and a large amount of unlabeled instances, and unlike traditional active learning frameworks, we assume that we have access to a bunch of a bunch of oracles or labelers annotators experts.",
                    "label": 0
                },
                {
                    "sent": "However, you want to call them, and we also we further assume that these oracles are noisy.",
                    "label": 0
                },
                {
                    "sent": "Meaning that they make labeling mistakes.",
                    "label": 0
                },
                {
                    "sent": "So they they might have different accuracy rates, but these are unknown to the learning algorithm.",
                    "label": 0
                },
                {
                    "sent": "So the question arises how?",
                    "label": 0
                },
                {
                    "sent": "How can you decide which oracles to query for the instances that you have?",
                    "label": 0
                },
                {
                    "sent": "If you have, you might have a limited budget that you may want your money wisely by selecting by selectively sampling the oracles.",
                    "label": 0
                },
                {
                    "sent": "So this is the problem that we are addressing.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In this paper.",
                    "label": 0
                },
                {
                    "sent": "And so let me just.",
                    "label": 0
                },
                {
                    "sent": "Recall our goal.",
                    "label": 0
                },
                {
                    "sent": "Our goal is to find the labels with the highest with very high expected accuracy, and we borrowed the idea from internal estimation learning, which is originally proposed by killing for reinforcement learning and we proceed as as follows.",
                    "label": 1
                },
                {
                    "sent": "The estimated reward for each labeler, and I will talk more about this on the next slide.",
                    "label": 0
                },
                {
                    "sent": "But let's just assume that we have a reward for each label for now.",
                    "label": 0
                },
                {
                    "sent": "And then we compute a confidence interval for for each label that we choose using this formula using the mean of the reverse under standard deviation that we have observed so far for that labeler, and then we select the labelers whose upper interval whose upper interval higher than some threshold.",
                    "label": 1
                },
                {
                    "sent": "So this way we can focus on only on the exam only on the label is that we believe have high accuracy and.",
                    "label": 0
                },
                {
                    "sent": "We can filter out the less reliable ones, and this will significantly reduce the labeling cost, and then for all the order for all the labels that we have selected, the Observare label that they output.",
                    "label": 0
                },
                {
                    "sent": "And then we repeat this process for a fixed amount of iterations or or depending on how much.",
                    "label": 0
                },
                {
                    "sent": "How much money did we have.",
                    "label": 0
                },
                {
                    "sent": "We can spend.",
                    "label": 0
                },
                {
                    "sent": "And the benefits of using a confidence interval like the formula shown in this slide, the benefit is that it automatically balances and exploration versus exploitation tradeoff, because the this interval can be high if the mean reward for that labor is high, which corresponds to exploitation, or it can be high due to the fact that it has large uncertainties in the reward estimates, and it is also.",
                    "label": 0
                },
                {
                    "sent": "A beneficial to sample that label, or in this case, because it means that we haven't sampled that label are enough to have a reliable estimate.",
                    "label": 0
                },
                {
                    "sent": "So this corresponds to exploration.",
                    "label": 0
                },
                {
                    "sent": "Naturally, the algorithm takes care of this tradeoff.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Between the two.",
                    "label": 0
                },
                {
                    "sent": "So as I promised that that I will speak about the rewards for the labelers in this work, the reward for a labeler is unknown.",
                    "label": 1
                },
                {
                    "sent": "So if we need to estimate it, and if you think about it, what is the reward that we can assign to a labeler?",
                    "label": 0
                },
                {
                    "sent": "What is important to us is that whether that labor is going to give us the true label or not, so.",
                    "label": 1
                },
                {
                    "sent": "Or should be related with the with the fact that whether the labeler outpost, the true label and True label is also unknown, so but we can, we can estimate it using majority voting if we assume that the oracles have accuracy is better than random guess, which we assumed in this paper, then it becomes reasonable to use the majority vote as an as an estimate for the true label.",
                    "label": 1
                },
                {
                    "sent": "Then we propose the following reward function.",
                    "label": 0
                },
                {
                    "sent": "So we we have selected the Oracle.",
                    "label": 0
                },
                {
                    "sent": "We have selected the oracles that we want to query for the label.",
                    "label": 1
                },
                {
                    "sent": "And then they also put some label and we take the majority vote.",
                    "label": 0
                },
                {
                    "sent": "And then we look at the Oracles and their output, and we give a reward of 1 to each Oracle that agrees with the majority world.",
                    "label": 0
                },
                {
                    "sent": "Assuming that the majority is the correct label and we give a reward of 0 otherwise.",
                    "label": 0
                },
                {
                    "sent": "So this is like a binary reward function.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'm going to illustrate how this method works with on with some simple illustrative example.",
                    "label": 0
                },
                {
                    "sent": "So at the very beginning we assume that the Oracles have the same interval, so we sample all all of them at 4 for the for the initial iteration.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then overtime we will be estimating the confidence intervals and they will have different confidence intervals and the algorithm will keep selecting the Oracle's or whose upper interval are are above the threshold and for instance in this case it will be selecting four out of five oracles, ignoring the one that is below the threshold.",
                    "label": 0
                },
                {
                    "sent": "And then if we.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Keep doing that overtime.",
                    "label": 0
                },
                {
                    "sent": "The Oracles will shrink because we will.",
                    "label": 0
                },
                {
                    "sent": "We will have better estimates about the accuracy for those oracles, and the algorithm is going to become more biased towards the oracles that it thinks are the best ones, so it may end up selecting only one Oracle towards the end instead of selecting more oracles at the beginning.",
                    "label": 0
                },
                {
                    "sent": "And I have an experimental result on this in a couple of couple of slides.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So so far I I talked only about Oracle selection, so we we have talked about that the fact that we have a set of oracles and we know how to have to choose which oracles that we want to query.",
                    "label": 0
                },
                {
                    "sent": "But there's also another component that we want to decide which instance to ask for the label, and we just follow a simple approach using uncertainties sampling.",
                    "label": 0
                },
                {
                    "sent": "So we choose the instance to query for the label baselines uncertainties.",
                    "label": 0
                },
                {
                    "sent": "So in this case we can select the instance that is closest to the decision boundary because it's the most uncertain that is the instance that we are most uncertain about the label, and then we query its label to the oracles that we have chosen and then take the majority vote and assign it to that instance as the true label.",
                    "label": 0
                },
                {
                    "sent": "And then we iterate.",
                    "label": 0
                },
                {
                    "sent": "So now I can discuss some experimental results that we run.",
                    "label": 0
                },
                {
                    "sent": "This is a data set from the UCI.",
                    "label": 0
                },
                {
                    "sent": "This is the mushroom data set, and we compared our method against two baselines.",
                    "label": 0
                },
                {
                    "sent": "One is the random Oracle, so.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Selection, So what it does is at each for each instance it selects one Oracle uniformly at random and then queries that Oracle and repeated labeling is an idea that we borrowed from last year's KDD paper, which repeated baseline samples all the oracles for each instance, but it is different than what is actually proposed in the paper because they were requiring they were acquiring additional labels for.",
                    "label": 0
                },
                {
                    "sent": "Already existing examples in the training set, but we the baseline that we used in the in the paper as a as comparison is we query all the oracles for each new instances because we wanted to, we wanted to compare our method against naive selections, nice selections of oracles, and we see that the Y axis is the classification error and our algorithm is doing outperforming the other oracles.",
                    "label": 0
                },
                {
                    "sent": "Depending on with respect to the number of Oracle queries that it makes, and we have similar results on other datasets are just don't have time to show them all.",
                    "label": 0
                },
                {
                    "sent": "But you can come to my poster.",
                    "label": 0
                },
                {
                    "sent": "So also we have an alloy.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First, we made another analysis where we wanted to see how frequently the oracles are chosen by our method.",
                    "label": 0
                },
                {
                    "sent": "So these color histograms shows the number of times each Oracle is selected on the Y axis and on the X axis it is the true accuracy of the oracles, and I also forgot to mention that these are real datasets, but we simulated the Oracle, so these are synthetic oracles.",
                    "label": 0
                },
                {
                    "sent": "We simulated 10 oracles.",
                    "label": 0
                },
                {
                    "sent": "This sampled accuracy is sampled accuracies randomly from the range .5 and one.",
                    "label": 0
                },
                {
                    "sent": "And this shows that the blue color shows the first 10 iterations of our algorithms.",
                    "label": 1
                },
                {
                    "sent": "So for the first 10 instances, the Oracles are sampled equally frequently, and for the next 40 examples we will see that there is a shift towards more shift towards higher accuracy oracles, and as we as we iterate more, we will see that the algorithm becomes more biased towards the towards the better.",
                    "label": 0
                },
                {
                    "sent": "Or the best oracles which has highest accuracies.",
                    "label": 0
                },
                {
                    "sent": "And this is exactly what we would like to see, because this shows us that the exploration step is pretty fast and effective, and the old algorithm can detect the good example good oracles early enough and then exploit them.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Afterwards.",
                    "label": 0
                },
                {
                    "sent": "We also wanted to see how robust the algorithm is against the distribution of Oracle accuracies.",
                    "label": 0
                },
                {
                    "sent": "So in this data set we see.",
                    "label": 0
                },
                {
                    "sent": "On the Y axis is the number of Oracle queries that we make an on the X axis we see the classification accuracy and the left hand side curve shows the situation where we have 10 oracles, but it's a very balanced set.",
                    "label": 0
                },
                {
                    "sent": "We have 5 good oracles, good meaning that it has higher is accuracy higher than .8 and five bed oracles, meaning that the accuracy is lower than .7 and on the right hand side we have a very skewed Oracle distribution.",
                    "label": 0
                },
                {
                    "sent": "We have only one good Oracle, but the remaining 9 oracles are bad.",
                    "label": 0
                },
                {
                    "sent": "But still we see that our algorithm makes the least number of Oracle queries to reach a target accuracy, which is, which is a very promising result.",
                    "label": 1
                },
                {
                    "sent": "So besides the simulation studies we have also run some experiments on the on some data that has.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Annotators and we got this data set from a paper in Yemen ALP in 2008.",
                    "label": 0
                },
                {
                    "sent": "So the authors created some simple language understanding tasks and they use Amazon's Mechanical Turk to hire annotators to to complete these tasks, and we run our method and the baselines on these datasets, and we compared the accuracy that we get with respect to the.",
                    "label": 0
                },
                {
                    "sent": "Queries that we make to get to reach their accuracy and we see that in there are two tasks we adopted from from this paper and we see that our method reaches very desired accuracy level with moderately Oracle moderate number of Oracle queries, but for instance, repeated labeling needs much more much more labeling effort to reach a similar accuracy because it samples all oracles for each instance an it's just not very efficient.",
                    "label": 1
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to conclude.",
                    "label": 0
                },
                {
                    "sent": "I can summarize that we have proposed a simple but effective algorithm that naturally balances the exploration versus exploitation tradeoff, and we also filter out the less reliable oracles early in the process, and this boost.",
                    "label": 0
                },
                {
                    "sent": "This gives us the performance boost and we also should have shown that trying to estimate the Oracle accuracy is an effective method by which, rather than naively selecting oracles at random, or simply using the mall.",
                    "label": 0
                },
                {
                    "sent": "And for future work we would like to go beyond oracles that have consistent label or quality.",
                    "label": 0
                },
                {
                    "sent": "In this work, we assume that the Oracle accuracy is not changing overtime, but I can give you examples from real life that there might be situations where the oracles might be getting better overtime, or their accuracies might be decaying.",
                    "label": 0
                },
                {
                    "sent": "For instance, in people are designing online games to collect data and like just people over the net, they label some images or doing other.",
                    "label": 0
                },
                {
                    "sent": "Other kinds of games, and you can think of situations where the annotators or users are getting tired overtime that their accuracy might decay, or they might be becoming better players at the games, or they might be learning overtime that they their accuracy might be improving and we would like to investigate algorithms that takes that into account and also for this paper we assume that the.",
                    "label": 0
                },
                {
                    "sent": "A probability of an Oracle making a mistake is not dependent on the question that you ask, but if there is also realistic to assume that there might be some hard, harder questions, that sort of introduces more noise and we would like to take that into account in the future as well.",
                    "label": 0
                },
                {
                    "sent": "And in this work we also assumed implicitly that the oracles make uncorrelated errors, but in the future we would like to relax that assumption and to work with oracles.",
                    "label": 0
                },
                {
                    "sent": "Which may correlated errors, and I think that this is a challenging and interesting problem that we would like to.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the future, so thanks for listening.",
                    "label": 0
                },
                {
                    "sent": "And if you have questions, please ask.",
                    "label": 0
                },
                {
                    "sent": "Question.",
                    "label": 0
                },
                {
                    "sent": "Why do you assume the student distribution?",
                    "label": 0
                },
                {
                    "sent": "Or maybe consider other distributions as well?",
                    "label": 0
                },
                {
                    "sent": "Why do you ask you in your calculation of the confidence interval when you assume the student distribution?",
                    "label": 0
                },
                {
                    "sent": "Did you consider no, we didn't consider this was the student distribution was used in the original interval estimation learning?",
                    "label": 0
                },
                {
                    "sent": "That's why we didn't change it.",
                    "label": 0
                },
                {
                    "sent": "When did you see it?",
                    "label": 0
                },
                {
                    "sent": "And then I'm not gonna be able, or I might be missing something, and I think that they have introduced the booty.",
                    "label": 0
                },
                {
                    "sent": "And then yeah.",
                    "label": 0
                },
                {
                    "sent": "Actually, interval estimation learning can be used for multi unbanded problems as well.",
                    "label": 0
                },
                {
                    "sent": "The benefits of interval estimation is that it naturally balances exploration versus exploitation tradeoff.",
                    "label": 0
                },
                {
                    "sent": "You don't need to incorporate any other parameter or anything else to get that tradeoff, and it's also it's also easy to compute, and we can use the intervals and we can threshold to filter out the less reliable ones.",
                    "label": 0
                },
                {
                    "sent": "Natural balance between explosions tradition.",
                    "label": 0
                },
                {
                    "sent": "This is also good promise stuff, for example ended.",
                    "label": 0
                },
                {
                    "sent": "Of the the minimal, correct?",
                    "label": 0
                },
                {
                    "sent": "We can take it offline too, yeah?",
                    "label": 0
                },
                {
                    "sent": "Back there.",
                    "label": 0
                },
                {
                    "sent": "So I was just trying to think about how to improve.",
                    "label": 0
                },
                {
                    "sent": "Helpful is if you need to.",
                    "label": 0
                },
                {
                    "sent": "You can eat your estimate.",
                    "label": 0
                },
                {
                    "sent": "How good and morally it be dependent on the features themselves, and then perhaps people are people who are the actual oracles are better in some domains, yeah.",
                    "label": 0
                },
                {
                    "sent": "And the other thing is exactly.",
                    "label": 0
                },
                {
                    "sent": "Figured you cradle things at once, when often if we doing supervised learning, it's.",
                    "label": 0
                },
                {
                    "sent": "It's sort of better to figure out how to host games, create information from many points rather than right.",
                    "label": 0
                },
                {
                    "sent": "Same thing over and over again, so maybe there's a.",
                    "label": 0
                },
                {
                    "sent": "Or instead of growing up, he had a special that you everybody about, yes.",
                    "label": 0
                },
                {
                    "sent": "Random.",
                    "label": 0
                },
                {
                    "sent": "And then there is a technique for freeze medication in order to keep track of the problems intervals on the performance.",
                    "label": 0
                },
                {
                    "sent": "So you mean you can use different strategies for different examples?",
                    "label": 0
                },
                {
                    "sent": "Or am I misunderstanding it?",
                    "label": 0
                },
                {
                    "sent": "Just mean.",
                    "label": 0
                },
                {
                    "sent": "So you can create most one person.",
                    "label": 0
                },
                {
                    "sent": "By selecting the best one.",
                    "label": 0
                },
                {
                    "sent": "Randomizing above the threshold.",
                    "label": 0
                },
                {
                    "sent": "Oh OK.",
                    "label": 0
                },
                {
                    "sent": "I see it.",
                    "label": 0
                },
                {
                    "sent": "Yeah yeah.",
                    "label": 0
                },
                {
                    "sent": "But but then you lose.",
                    "label": 0
                },
                {
                    "sent": "But then you lose the the majority.",
                    "label": 0
                },
                {
                    "sent": "I mean majority vote is a. Yeah, yeah yeah because you.",
                    "label": 0
                },
                {
                    "sent": "You can look at.",
                    "label": 0
                },
                {
                    "sent": "You have a few billion predictor overtime, yes.",
                    "label": 0
                },
                {
                    "sent": "Here is going to be district for some of the labels.",
                    "label": 0
                },
                {
                    "sent": "Some of the best games.",
                    "label": 0
                },
                {
                    "sent": "OK, yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah, or you can.",
                    "label": 0
                },
                {
                    "sent": "I think one other direction to improve is might be the fact that you, the ones for the oracles that are above the threshold.",
                    "label": 0
                },
                {
                    "sent": "You can select one and then maybe you can select another one.",
                    "label": 0
                },
                {
                    "sent": "And if they agree and if you have some kind of confidence score then you may stop asking the third one even though there are more that are above the threshold.",
                    "label": 0
                },
                {
                    "sent": "But this is not something that we have worked on in this paper, but this is definitely something that we can.",
                    "label": 0
                },
                {
                    "sent": "Investigate to improve further.",
                    "label": 0
                },
                {
                    "sent": "Thanks.",
                    "label": 0
                },
                {
                    "sent": "Speaker again.",
                    "label": 0
                }
            ]
        }
    }
}