{
    "id": "4me4llalbvxlf26gglsrl5pvpswg5mwr",
    "title": "Image Structure and Syntax for Recognition",
    "info": {
        "author": [
            "Narendra Ahuja, Department of Electrical and Computer Engineering, University of Illinois at Urbana-Champaign"
        ],
        "published": "Sept. 13, 2010",
        "recorded": "August 2010",
        "category": [
            "Top->Computer Science->Pattern Recognition"
        ]
    },
    "url": "http://videolectures.net/ssspr2010_ahuja_iss/",
    "segmentation": [
        [
            "Good morning to everybody and.",
            "It's a pleasure to be here.",
            "Thanks to Edwin and Ilkay for doing all the work for me to come and.",
            "And shared my thoughts with you.",
            "I'm looking forward to the program and listen to all of you have number of colleagues here who are always good to hear from and learn from.",
            "So I'm really looking forward to being here for this program.",
            "And of course, all the exciting local stuff that it'll get put together.",
            "So what I have?",
            "Chosen to do in the in the next 15 minutes.",
            "Is.",
            "To give you an overview of the.",
            "Work that we have been doing over the last approximately mostly about five years.",
            "Some of it goes back beyond the last five years, but but mostly five years.",
            "And would like to communicate to you some of the things that you may find obvious, but for me they are part of the story and some others that we also found interesting and not quite expected.",
            "But they're all unified by the."
        ],
        [
            "By the.",
            "Need and the objective of.",
            "Doing recognition.",
            "In a.",
            "Contacts where you are minimizing the.",
            "The training minimizing the.",
            "Artificial settings in which we often must do these things and for good reasons, of course.",
            "But how much can we get away from those and try to come as close to to learning and doing the recognition in less constrained situations?",
            "So let me.",
            "Well the theme is of course that we want to be using.",
            "Regions as the ways of as a way of bootstrapping our way out of complete ignorance at the beginning.",
            "In the beginning we don't know what the objects are, how to recognize them.",
            "So regions will be our driving force and I'll tell you why.",
            "Why are we use them?",
            "So let me start with the basic question.",
            "Off what is a representation of the image that would be ideal.",
            "To feed the process of recognition.",
            "Whether it's recognition or even beyond that in, for example, reasoning about things which depends upon what you use for recognition and so on and synthesis.",
            "So.",
            "To to get the process going.",
            "The question that we ask first is what is it that we are trying to learn about?",
            "And then recognizing reason and so on later.",
            "And that is object.",
            "So object for us here is something in the image that's really composed of.",
            "A number of its parts.",
            "As a layout of its parts and the layout itself can be described in many, many ways, but the important thing here is that we have a recursive definition and of course like I said, many of these things are are kind of obvious, but for completion I would like to go through them.",
            "The simplest object, of course, is the one where there are no more parts and all it is is a localized cluster of pixels.",
            "Set of pixels.",
            "And.",
            "Has only its own properties to be represented as opposed to further decomposition into parts so.",
            "So.",
            "We can have the wall as layout of different things, objects, doors, windows, which are themselves further decompositions of.",
            "Themselves and we described in terms of their own parts, and so on until we get to the atomic level.",
            "So the object then is a hierarchy where the large object is layout, small objects and other walls and doors and so on, and they're in terms they are in turn.",
            "Described by their own parts.",
            "What we are living out here today is.",
            "Complex objects such as crowded Street or an city street, so that has its own connotation.",
            "What's the city street?",
            "Whether it's in the evening or daytime?",
            "Crowded means what?",
            "So these are complex things that we will leave out of our mind during the next hour.",
            "You know something even more complicated.",
            "Of course, one can build these things on top of the simpler objects, recognizing similar objects.",
            "Modeling them, we can build these things.",
            "These concepts in terms of the concepts that are less that are simpler, namely the kinds of things that we're going to be considering today.",
            "So, but for simplicity, and of course it's not trivial to go from the simple objects to these, but I think that processes can be separated if you go through the region based representation.",
            "So we'll keep those out of our minds and stick to objects that are.",
            "Cohesive spatially compact shall we say when connected single component?",
            "So here it is.",
            "The reason why regions ought to be.",
            "The driving force.",
            "The driving primitives of a representation that is aimed at the task of recognition.",
            "The scene that we're talking about, and given the rest."
        ],
        [
            "Section that we have just placed on the object types.",
            "The scene is made up of.",
            "Of objects that are simple objects that are objects that are hierarchical in the sense that we just talked about.",
            "And when we do, the imaging imaging does not change that character of the scene, namely, all objects are spatially localized in 3D imaging does not.",
            "Over does not change that property and so images are also collection of local 2 dimensional masses cohesive.",
            "Sets of pixels and so images can be treated as layout of regions of objects that we just talked about.",
            "So we have the object similar objects, primitive objects and that translates into the image being image consisting of sub image set of some images.",
            "Each sub image represents apart which may in turn be an object complex object.",
            "Eventually the primitive subregions which are in most cases we can consider them as homogeneous collections of pixels pixels.",
            "Homogeneous color values and so on something very simple."
        ],
        [
            "Have their own shape and so on, but something very simple that feeds the recursion.",
            "No.",
            "This is a fundamental problem that we're all addressing people who are doing recognition, not necessarily always.",
            "Mentioning it this way, but.",
            "But the problem fundamental to this and the."
        ],
        [
            "The challenge to recognition is that we have too many things to recognize.",
            "Presumably we know about them.",
            "The problem is, even if we have the models, if you don't have models, it's even worse.",
            "But if you have the models, we still have to worry about where to verify.",
            "The presence of that object whose model we do here.",
            "Because an object can be in any location, which means a different subset of pixels.",
            "So essentially most of the work directly or indirectly, smartly or or not so smartly looks for the occurrences of the object.",
            "Got it with the given model all over the place.",
            "So one of the ways we can take it take overcome this problem is to use the standard solution of multiresolution, which tries to kill.",
            "More and more characteristics of the object complexity of the object by going to lower resolutions as a result of digital nature of the images.",
            "So smaller objects or images are easier to handle becausw the complexity is less and therefore the number of matching models will be smaller because models are converging into simpler things.",
            "The details are being lost.",
            "So as you go to smaller and smaller things.",
            "The possibilities of what they can be goes down, and so that is a kind of the fundamental.",
            "Way to overcome this problem of not knowing what what to consider as a match?"
        ],
        [
            "Now.",
            "If you take it, the simplest object as I just mentioned, that would be something, for example, very homogeneous in color.",
            "Have its own shape, an possibly layout of these simple objects would be.",
            "Would be unique characteristic of the of the object that we're dealing with and the."
        ],
        [
            "So in general, then the object would be will have will be layout of parts, each of which is characterized by intrinsic properties.",
            "If it's a simple object."
        ],
        [
            "Now this is where we switch from the nature of objects.",
            "To the.",
            "Power of regions.",
            "Namely.",
            "The if you.",
            "Bring back the property that images that the objects are recursive regions.",
            "Recursive embedding of regions with the layout included.",
            "Then you can take recourse to the multiscale segmentation of the image as the collection of primitives."
        ],
        [
            "That we can use to to start the matching process.",
            "While we can do that is the cause.",
            "The multiscale segmentation, which is based upon color.",
            "Is indeed something that we can expect as a good basis to start hypothesising object possibilities simply because object boundaries in real world.",
            "Very often, not always, and the not always part is really confined to accidental Ness of things.",
            "But for all practical purposes, all different objects, all meaningful objects have boundaries which manifest themselves in photometric discontinuities.",
            "And therefore we can.",
            "We can start with no knowledge of the object.",
            "Just start with the multiple segmentation and use these.",
            "The boundaries of the regions as potential locations where objects change from the space of 1 object changes.",
            "So that's the interobject boundary, so bye."
        ],
        [
            "And that we overcome the combinatorics.",
            "The other argument for regions as opposed to some other.",
            "Features that are been that have been popular.",
            "Namely, point features.",
            "An edge features edge fragments.",
            "If you have can't complete contours as opposed to edge fragments, then they're equivalent to regions.",
            "They're just dual representation.",
            "But if you look at point features or edge fragments from the argument of dimensionality, you don't.",
            "You're not dealing with things that are perfect carriers for the object information because they're low dimensional and from a purely information theoretic basis, the.",
            "Objects cannot possibly be represented efficiently because of the mismatch between the capacity of the what you represent your primitives, namely points and edges, and the objects which are two D regions.",
            "Because they are image in images of two D3D objects which are cohesive, so.",
            "One must one way or the other, end up with with regions because that are they are dimensionally matched with the objects."
        ],
        [
            "Here, of course we are dealing with just the 2D part of it and not the three."
        ],
        [
            "The part of it, which, again similar to the semantically complex objects, can also be.",
            "Elected on top of the two D things that we're talking about, but those are not the focus.",
            "Of what we discussed today.",
            "So the next thing I'll do now is go take you through a sequence of our results that we've obtained, but I will do so at the expense of not spending time on really vast amount of work that has gone into it.",
            "Lot of it by the people who are present in this room.",
            "In the interest of just maintaining the continuity of what we have done and give you what the pros and cons, the strengths and weaknesses of different aspects of what we have done is so that we can sort of take a lesson home as to what works or doesn't work.",
            "So again, that will come at the expense of.",
            "Completely skipping the literature review, which of course will be unending if you were to do it.",
            "So let me begin with the multiscale segmentation.",
            "Aspect and of course I'll just give you what we have done and I won't go into the details and focus on the connections between things to bring out what we think is important and what's not."
        ],
        [
            "Important.",
            "So first of all, the segmentation process itself is we very well know is not.",
            "The is a tough job, is a tough job.",
            "I mean if you look at the first book, The picture processing by computer, which my advisor.",
            "As in Rosenfeld, published in late 60s.",
            "Which actually drew me to his group.",
            "It it lists segmentation as one of the basic problems, and I don't think that we have.",
            "Segmentation algorithm today that you can.",
            "Close your eyes and use and not be worried about what it did.",
            "However, I think the thing that we have been doing since mid 90s and now we have a NTH iteration of the algorithm.",
            "I think it's almost ready and I said that couple of years ago also, but we found more things to do.",
            "But we have an algorithm that we consider to be fairly close to what you and I would do.",
            "Segmentation is not really low level.",
            "Segmentation is what we're talking about, of course, which means photometric discontinuities that you and I see in the given image.",
            "All of the entire hierarchy of hierarchy of segmentations.",
            "So those are the things that, as you can see, we've been doing since for about 15 years.",
            "But the idea is that you give an image to it and what comes out is all the regions without giving any human input.",
            "So there is no single parameter given to the system and the system just feeds off.",
            "The.",
            "Color distribution in the image and comes up."
        ],
        [
            "With.",
            "All kinds of different regions, whether we want to keep them or not is a different story that is up to the user to decide.",
            "What to pick, what to keep and what not to keep?",
            "And of course, that's also not.",
            "That's also made easy by."
        ],
        [
            "By representing it as a hierarchical structure, which it is so you take the original image and you.",
            "These are just illustrations of some.",
            "Some specific subsets of regions.",
            "In this case, the regions that have contrast higher than 10 contrast higher than 20.",
            "But the idea is that.",
            "Whatever the contrasts are unknown to us in the beginning because we're not starting with any prior knowledge.",
            "So you take the image and you decompose like a jigsaw.",
            "Puzzle the image into its predominant regions, which in turn are then subdivided into their own predominant regions.",
            "And what is it that changes from top to bottom can be different.",
            "It can be based upon contrast.",
            "Parameter, namely as you go down the tree, you have lower and lower contrast values, or you can arrange this as.",
            "Regions contained inside the parent region, so the children are contained inside the parent or the children are lower in contrast than payment or higher.",
            "In contrast, in parent, all of that can be done.",
            "That's just an organization of the entire set of regions that we have detected, each having its own contract."
        ],
        [
            "So what we are?"
        ],
        [
            "Able to do is convert an image into a tree like that.",
            "And it feeds off lots of other projects, which I will skip here.",
            "Good discussion, I'll skip here, but some very interesting things follow from having this kind of a relatively bottom up process.",
            "Giving us this collection.",
            "Now.",
            "What we have here is simply the regions.",
            "And then what's inside them?",
            "And then possibly some contrast relationship.",
            "But what is missing here is something extremely critical, as we'll see later, which is.",
            "That the representation is invariant.",
            "Two juggling of the regions.",
            "So if I were to take the nose, put it below the if I were to take, for example, this the this part and that part and that part and juggle it.",
            "Specially rearrange them, specially it will not affect the segment the tree representation because it's completely losing the relative spatial location information.",
            "So it's just a recursive embedding, so if you want to add that, then what we do is we add explicit links between them.",
            "Which is to say that.",
            "This.",
            "Region.",
            "Is.",
            "Specially in the neighborhood of that region.",
            "And that in turn is in the special neighborhood of that region.",
            "And, of course, special neighborhood here means 2D.",
            "So what this does is that.",
            "The mustache is next to in the special neighborhood of the nose.",
            "That part, the lips and all of this is surrounded by certain other regions.",
            "That's that information, of course, that itself is not a.",
            "Not an easy thing, So what we had to do was take some time off and.",
            "So before I'd say that the final thing is that what we have done is take taken the tree and added to it these links between siblings at different levels.",
            "So remember that these are all.",
            "Based upon the property I mentioned, containment or or contrast.",
            "So what we do is we just add sibling links between the neighbor links between siblings, which converts this into pseudo tree in the sense that there's still a tree.",
            "But we have added these lateral links which are kind of orthogonal information.",
            "Additional information which just specifies neighbors so it's more.",
            "You know, being precise it is now a hierarchy of graphs.",
            "Not much either."
        ],
        [
            "Solution tree not to get the neighborhood concept.",
            "You know what is next to what?",
            "What is which regions around a given region.",
            "That process, that that formalization is not.",
            "Has not been around as far as we could look, So what we did was we did the point.",
            "Voronoi diagrams.",
            "Where, given a point pattern you have over noisy neighborhood, which is simply the.",
            "Half space has set up spaces that separate two points.",
            "Equally so the bisectors between two points in plane.",
            "Are the are the units that form the neighborhood of a point, so you take those points on the boundary and create their own oil diagrams.",
            "So between this point and that point, there is a vernoy bisector, and if you go walk along this neighborhood, then all the other guys here have points on their neighborhoods.",
            "Each of each point, here paired with each point on the boundary there gives a bisector.",
            "So you have a whole sequence of bisectors, small short bisectors.",
            "That form.",
            "Occur polygonal curve that that separates this object from that object in some sense equally in the sense I just described.",
            "If you look at points now, this is not a Euclidian friendly definition directly, but it's digital friendly definition so you do have this curve.",
            "Now all these other guys are exposed to this region.",
            "Blue region here in the sense that some segment of this boundary.",
            "Is shared between this region and these six regions 12345612345 regions so this region shares segments with them and therefore they are more annoying neighbors very similar to what we will do for points where you will have points as neighbors.",
            "So now all the other guys who are outside all the other regions that are beyond this set are not neighbors, so we produce.",
            "We add these links to.",
            "The.",
            "To the tree.",
            "To generate that connected segmentation tree.",
            "So here what we also carry along is not only the information that these are neighbors, but also.",
            "The information as to how good a neighbor or bad enabled it is, and that's directly proportional to the amount of exposure neighbor has to it.",
            "So this region is exposed to it by an amount which is proportional to the shared.",
            "The length of the shared boundary.",
            "So the longer the boundary you share, the more the better neighbor you are.",
            "So you carry that along.",
            "Now this is an asymmetric property.",
            "This is not something you know.",
            "This may be a good neighbor bad neighbor to this, but this one may be a good neighbor to that.",
            "And of course in this case that's not the case.",
            "So because it depends upon your fractional parameter exposed to your fraction of the parameter exposed to a given neighborhood.",
            "OK, coming back.",
            "Then we have a region now described by its photometric properties.",
            "As we are referred to earlier, its geometric properties and the layout characteristics of these guys.",
            "So you have, for example, if you look at the red node here red region here it has some regions inside it.",
            "And those regions are for one thing, all contained inside the red region, but we can represent their distribution spatially.",
            "And their properties individually by those things so we can see each of these guys has its own photometric distribution, but of course that itself is a tree in general, but."
        ],
        [
            "But we have not only the intrinsic properties but also.",
            "How they are configured specially inside this and that can be captured in things like this.",
            "The angle between the child and parents principal axis.",
            "That's orientation information relative to the parents, so that makes it image orientation independent because you are trying yourself to the parent so its orientation independence is introduced that way.",
            "You can have a.",
            "Where the displacement of child centroids relative to the parent centroid, you can have a context vector which says how are my siblings relative to where I am.",
            "So you can take a vector like this which tells you the rough distribution.",
            "Direction of the distribution are at least the center of the distribution of the siblings, so you can have features like that to capture layout information.",
            "Now we're not talking about the completeness of it or lack there off.",
            "It's a bunch of features, you know the argument of what is minimal and what's what's minimal.",
            "And."
        ],
        [
            "Useful.",
            "So all of those issues here.",
            "So basically you you attach those properties with.",
            "With the.",
            "The individual regions, and now what we have is CST subgraphs or will just keep continue to keep.",
            "Will continue to call at subtrees, ignoring the fact that there is those red neighbors links.",
            "So now images.",
            "Any image now since it contains multiple objects it is going to be a set of.",
            "Subtrees because the image is represented by a tree, CST connected segmentation tree.",
            "Since it image consists of multiple objects, chances are that that tree would consists of the corresponding subtrees.",
            "And each object that what we call an object can now be composed of one or more subtrees.",
            "Because objects are not made up of color homogeneous.",
            "Apart, so an object may be consisting of dark and bright blue and red.",
            "So since this is photometric, the segmentation is photometric considerations based.",
            "We won't have an object showing up as a single node in the tree or single subtree.",
            "Therefore we have to collect a bunch of subtrees that will correspond to an object.",
            "Therefore, the an object would correspond to a collection of subtrees and we have to model that collection.",
            "So."
        ],
        [
            "Now in this process, the discovery process would be a process that would match.",
            "Suppose you're given a set of images and we want to know whether there is an object present across these images.",
            "You take each of these trees, image trees, and from that collection of image trees.",
            "If we look for matching subtrees across the set of trees, then that is an evidence that something is repeating in the images.",
            "It is an object.",
            "In some sense.",
            "It may be a part of a part of a part, but it's something that is repeating, which is what which is photometrically geometrically, anthropologically.",
            "The same or similar.",
            "So to find such matching subtrees is then the process of.",
            "Inferring that there is something repeating.",
            "And once we have the repeated sets of trees, subtrees weaken.",
            "The question now comes I have seen multiple occurrences of what looks to be the same thing.",
            "How do I capture it as an entity?",
            "Because I've declared them to be different manifestations, different appearances of the same exact thing because of my matching process, how do I?",
            "How do I capture it?",
            "And that's done by?"
        ],
        [
            "By capturing the variations through a set of probability density functions.",
            "That that described the variations in the subtrees across the various incarnations of it.",
            "And then the recognition process becomes probabilistic matching of the model, which is probabilistic with the.",
            "Content of a given image, which means a subtrees of the tree of the image, which means a collection of subtrees.",
            "So you take your probabilistic tree model of an object, which means a set of nodes, each having its own PDF, because that's how I illustrate this in a minute.",
            "But then the recognition processes matching the PDF set of PDF's of these nodes with this characteristic structure with a given tree and look for substring matches.",
            "So for example.",
            "If you had given.",
            "I tree and we want to match subtree of it to some subtree of a given model.",
            "Then we have the standard problem an of isomorphism, subtree isomorphism.",
            "So what we want to do is to match two regions if they look similar and their subtrees below them."
        ],
        [
            "Also similar.",
            "So that's.",
            "The standard problem of given two graphs.",
            "We want to find a mapping from nodes of 1 to the nodes of the other.",
            "Such that we minimize.",
            "Maximize the agreement between whatever we declared to be matched and the agreement between the matched candidates.",
            "The matched subtrees is in terms of.",
            "The node matches and the structure below the nodes, whether they match or not.",
            "So unary and pairwise potentials."
        ],
        [
            "And of course, this translates into.",
            "Simpler versions which are results of linearizations, so you can have the.",
            "Letter X represents vector X represent contain entries, each of which represents the candidate pair of matching nodes, and then we can go and do somewhat standard things, namely."
        ],
        [
            "Convert it into a integer quadratic problem and then in turn relax the integer constraint to then solve it for the best we can do in terms of preserving or matching the."
        ],
        [
            "Models.",
            "No properties and the model structure in the country.",
            "So what we?"
        ],
        [
            "End up with this what we end up with after this is the following.",
            "We have a set of images.",
            "Remember we started with and we now have a bunch of subtrees that we found were matching.",
            "OK, so for example, all the red ones, the red, the subtree that subtree in that subtree were found to be matched by the process we just talked about.",
            "On the other hand, the blue one.",
            "The blue ones represent a different set of matches, matching subtrees, and those are two different sets, each containing matching subtrees, and there can be many such sets.",
            "There can be the head, there can be the shirt that can be blessed.",
            "There can be the tables and so on.",
            "Whatever is there, and you know these don't have.",
            "I said these don't have to be semantically cohesive things for us, but they are something that is repeating.",
            "So we put them all into one giant bag.",
            "This red bag and there's a blue bag here, and this is where we have to answer the question of how do we capture them into a single representation?",
            "And that's where the collection of PDFs comes in.",
            "So the this, this, this and this must be represented by the same PDF that that that that must be represented by the same PDF.",
            "And of course we know the correspondences across these subtrees because they were matched.",
            "So we have essentially a collection of things which we know have matched.",
            "So there is that that that in that.",
            "Is known to be matched.",
            "The question is how do we come up with?"
        ],
        [
            "Single PDF for it.",
            "So we first of all register them and registration is not something new.",
            "The reason they got matches because their intrinsic properties and their structures matched and therefore we know the correspondences.",
            "You match them and then each you get generate boxes like this.",
            "So there is 1 box here and there are many such boxes and that's where each box gets represented by an underlying single PDF.",
            "So now you have a tree."
        ],
        [
            "Off PDF from here.",
            "So you associate.",
            "PDFs with each of them, and therefore you have a tree of PDFs and that is.",
            "Where we bring in the PDF choices, parameters and so on.",
            "So in our case.",
            "Then the tree is.",
            "It has an aspect of structure and.",
            "The the properties of each of the elements within the structure.",
            "So here is your."
        ],
        [
            "Tree, so we have a node above having so many children.",
            "Each node has its own properties, photometric properties, and it has certain distribution PDF that says how many children it is going to have.",
            "Number of children and the properties of the nodes.",
            "So then the.",
            "Joint probability density function of XY&N for a given situation given type of structure the these two are sufficient descriptors for a class of matching subtrees.",
            "Given that class, we have the PDF given by under the independence assumption of how many children a node has, and given the number of children and the node, what are the nodes it produces and how?"
        ],
        [
            "Each node look.",
            "In terms of colors, so those parameters of these three density functions then capture summarize the set of match subtrees that we found.",
            "So now once we have this.",
            "Once we have this now, we have.",
            "Essentially a model of the class of subtrees or set of subtrees that correspond to a class.",
            "And we do you do the estimation process.",
            "Of course we can use.",
            "The iterative estimation using one of the algorithms that are available, so we have belief propagation or or am or.",
            "So we just iterate, go back and forth between the structure and the parameters and ensure that there is an agreement between the choice of parameters we made.",
            "And of course we also choose the type of distributions exponential for the number of children, Gaussian for the color, and so on.",
            "And we have noticed that that what density function you choose at least empirically, actually only empirically, doesn't make much difference."
        ],
        [
            "So now as a result of having this model, what we have is a new image and known model.",
            "From training images we have a model which is a set of PDF's hierarchy of Periers.",
            "You take the tree of the image, you take the tree of PDF's, that is the model.",
            "And.",
            "Do the matching.",
            "Where matching means.",
            "Um?",
            "That you take each of these subtrees.",
            "And.",
            "Essentially correlate it with each of the sub trees in the.",
            "So take the subtrees here and take the subtrees there.",
            "Or take the entire model here and slide it against the tree of the image and see if there are matches where the matches matching process now means that the PDFs that govern the model declare individual corresponding instances in the image tree as a valid instance with 95% chance for example.",
            "So every corresponding node between this and that.",
            "Should have .95 probability of, for example matching and then we say that subtree within this image is an instance of this.",
            "So that's what leads to these discover these occurrences of.",
            "That model"
        ],
        [
            "As a result of this, now, if you have let's say these are training images, so 123456 not too many.",
            "But they are enough for us.",
            "Even two are enough for us.",
            "The reason is that.",
            "If you have something occurring in two images.",
            "That's an evidence in favor of something repeating, and therefore even though it repeats once, namely once in the original image, once in the second image.",
            "But it's more than more than one, and so that's an evidence in favor of the significance of whatever it is that repeats.",
            "So you take those repeating things, and then you generate the model."
        ],
        [
            "And then use it.",
            "So even with these six we generate a model.",
            "In this case, what we discover is 2 repeating things.",
            "One is the horse and the other is actually horse and combination of fest.",
            "Let's consider that an object in this case because it's repeating.",
            "It's again segmentation based thing, so we don't really have any understanding of it.",
            "So you take that model and you take those models and you rub it against the trees of these four images and what you come up with is those outputs.",
            "This is just a high resolution detail.",
            "But basically you are able to spot the objects from those six training images and you have two models that you have generated.",
            "Now here you can study the images closely.",
            "There is a jagged boundaries that is blurred boundaries, complex patterns.",
            "But because of the nature of our segmentation driven because."
        ],
        [
            "Segmentation, doing it, it seems to do."
        ],
        [
            "And these are just illustrations.",
            "It works out very large number of images.",
            "These are just illustrations here.",
            "No.",
            "If we have.",
            "Such models discovered.",
            "We one thing would be to take each of these model and and run it against all kinds of images and discover the presence of each category.",
            "In a given image.",
            "By trying the models that we have learned for all categories, the problem is that the real world has very large number of care."
        ],
        [
            "Degrees.",
            "However.",
            "It's it's it's.",
            "Somewhat obvious that we don't need this many independent categories.",
            "The reason is that real world is not composed of unrelated things.",
            "Two different categories are always, in our experience, related horses and camels share legs.",
            "Their legs may look different in different ways, but they share leads, so there is that organization of knowledge that is.",
            "That does not expect us to really consider every little category as an independent entity there is.",
            "There is a merger.",
            "There is overlap.",
            "There is this taxonomic character to this."
        ],
        [
            "Knowledge, for example, you have this one and that one, and then if you go down you have smaller and smaller parts, but those parts are increasingly shared as you go down.",
            "They are smaller, but increasingly shared, so there isn't a reverse tree here which were apart is shared by many.",
            "Many and the sharing degree goes down as parts become more complex.",
            "But this comes to a rescue in the in the sense that.",
            "That the categories are really shared versions, configurations of sub categories and sub categories are simple and therefore more robust to detect.",
            "And the best thing is that the complexity of doing large scale modeling and recognition now becomes less challenging because you have this kind of an interleaving and therefore the complexity becomes sub linear.",
            "It's it's.",
            "It doesn't increase linearly with the number of of the category.",
            "You don't have to try 30,000 different things.",
            "In fact, you can try.",
            "You can try.",
            "The.",
            "You can try these guys, which are simpler to do, but then they simultaneously satisfy many parents and then you can try them and then they satisfy many parents.",
            "So we that's that's how we overcome the complexity issue.",
            "So we generated a database."
        ],
        [
            "2.",
            "Dua.",
            "Try this thing out because most of the other databases are.",
            "Somewhat simpler, so we tried this and we discovered that from small number of images, the models that we generate actually go a long way in spotting whatever it is that you learned.",
            "In this case, all those guys are learned or discovered by matching those models that we generated.",
            "Many of them from that data set and segmentation is just a side advance."
        ],
        [
            "Site product we do recognition and segmentation together simply because.",
            "Because segmentation is inherent to the definition of the object.",
            "More examples."
        ],
        [
            "Now, one thing that we have done so far is that we have considered.",
            "All."
        ],
        [
            "Categories are equally likely to occur."
        ],
        [
            "And all categories are equally likely to tell us about what.",
            "Parent category might be present.",
            "So in the tree that we just talked about taxonomy tree.",
            "The.",
            "We just said as long as there's matched, declared it a match.",
            "And don't worry about the probabilities of how often we are likely to see these things.",
            "So what the next thing we're going to add is to."
        ],
        [
            "Is to take into account.",
            "The not only just a match quality, but what is it that we're matching?",
            "How likely it is to occur and how likely it is to tell us about other parent bigger categories?",
            "How likely are the legs going to tell us?",
            "How likely are this particular set of observations?",
            "How likely is this set of observations about legs?",
            "Um?",
            "How likely it is that it's the Lego foot Camel versus the leg of a dog?",
            "So we we take into account the priors, you know what the individual observations tell us and what the individual observations tell us about.",
            "Parent categories specially.",
            "For example, if you think of the unshared categories, like in camels, you will see these, which are uncommon when we compared in our data set.",
            "Camels have this unique signature.",
            "Cows had this.",
            "Deer had this, so they make sense, so once you see those then it's very likely that there there.",
            "So essentially then we need to have a Bayesian approach."
        ],
        [
            "By associating probabilities, priors and conditional probabilities with these things.",
            "So what we do is implement this.",
            "You simply make estimates of these from the from the time we are doing the training, and in addition to doing the models he also do the probabilities.",
            "And you can use this information in the."
        ],
        [
            "The process very trivially by, for example, a sense effectively scaling the axes in the feature space or whatever features we are observing.",
            "If their relevance is high to a particular category.",
            "So this is, let's say the recognition system for a particular category, you can.",
            "Bring in the prior probabilities and the conditional probabilities by by distorting the space in favor of of the.",
            "Right, right categories for right features which would separate otherwise mixed up features into different categories which are much easier to discriminate.",
            "To separate because you have taken the antlers and given it more important for deer and so on.",
            "And then of course, as I said, categorization, segmentation, and more importantly equally importantly.",
            "You also know why you recognizing a camera because you're recognizing it's let's you recognizing it's hump you recognizing.",
            "It's still an enquiry recognizing legs as horse LEXIS because there is this further limiting composition.",
            "So the fact that you have a subtree to back you up in your recognition also says that you have a whole explanation of why the recognition is taking place, namely the entire subtree is basis.",
            "Here's some more results, early results, which basically tell you that if you use point and edge like features, which are the features used for the other curves, not."
        ],
        [
            "Hours, then without much tuning you do gain quite a bit of.",
            "Advantage whether it's one data set or another, the performance on different datasets may be different, but there is a jump coming from the use of the right features, which of course all of us know."
        ],
        [
            "From Veteran nation base."
        ],
        [
            "6.",
            "There is a very big major problem in value segmentation and that is that.",
            "Segmentation of an image depends a lot on the idiosyncrasy's of the illumination.",
            "You know if you have a video video, look at successive frames of the same object.",
            "They change drastically, so one very serious thing that we need to worry about is the instability of segmentation from frame to frame, much less from one frame to 10 frames, hence.",
            "So the stability is a serious issue, so."
        ],
        [
            "What we did for that was we allow partial matching whenever boundaries are lost because of leakage in in the color across two regions.",
            "So the instability happens because part of the boundary might merge with the parent or the next region.",
            "You can overcome that by simple procedures like partial boundary matching and so on, so that's doable.",
            "Here are some results under instability.",
            "You have partial matching, not the entire matching, so the color coding tells you what matches what doesn't.",
            "So that's the."
        ],
        [
            "Some problem that it was very serious when we were working with with this and now I think we have a good control over this."
        ],
        [
            "But the degree of this see, I'm sure many of you experienced this that if you work with segmentation, this is something that has to be absolutely done.",
            "Otherwise you simply cannot survive.",
            "Now one final thing I would like to mention is that.",
            "If something is being considered as a basic driver of recognition systems as a basic recognition of the image.",
            "Hello sorry not recognizing representation of the image.",
            "Then it's worth testing it for other things, so if it's low level enough then it should be tested for other things.",
            "So what we did was we.",
            "Tried video segmentation on this which is matching but sort of slightly away from what we just did.",
            "These were those were isolated different images.",
            "These are video frames, video sequences with successive frames being very similar and so under unstable segmentation we have the results.",
            "This is actually an illustration of this segmentation, so one approach another approach, but basically the.",
            "Three different sequences.",
            "These are not as challenging as they should be, but these are just to illustrate.",
            "The ability to segment, but this is a bit more interesting in that here we have a different application of the same representation.",
            "Here we have a single image in which you have repeating objects."
        ],
        [
            "And in this case there are some occurrences of the object which are which are the.",
            "Complete, but in general they are not complete.",
            "What happened here?",
            "So what we do is we take a single image, we take its tree.",
            "And we consider different subtrees as potential recurring objects.",
            "So the tree has.",
            "So the tree has.",
            "Um?",
            "The whole industry has many sub trees and what we're looking for is the potential for repeating subtrees corresponding to these guys and in general none of them will be complete.",
            "So what we do is we take subtrees and run the process within the same tree and find all the recurring subtrees and they correspond to then texels.",
            "So for."
        ],
        [
            "Sample here we have those guys matching each other.",
            "So what we do is we take the matching well, just like before we stack them and we register them and we find the Union and their PDF that describes that Union.",
            "So we really generate a complete textual description from partial observations by having a PDF which takes care of all the registered set.",
            "So here is a result of applying that process.",
            "So this is a rather complex texture, lots of."
        ],
        [
            "And we are able to delineate.",
            "Each of the bees.",
            "Through its PDF."
        ],
        [
            "We have learned here is another one.",
            "Without doing something like this will be very hard to come up with this consistent segmentation of the of the objects.",
            "Here is another one.",
            "This one is used to segment multiple textures, not just recognize the Texas within a single homogeneous texture.",
            "So we do the same thing here.",
            "Input image you have different types of texels.",
            "You use the type of textures to segment."
        ],
        [
            "The regions that correspond to that are occupied by the different textures.",
            "Another one.",
            "Again, matching trees within the subject within the."
        ],
        [
            "Andre.",
            "And then we have some more examples of scene discrimination from region proper."
        ],
        [
            "Reason dynamic textures for dynamic textures more of those will be coming in future papers."
        ],
        [
            "So let me just summarize then.",
            "What we have is.",
            "These properties that we are these characteristics are these abilities that we are able to achieve from segmentation without really making any any assumptions about what's in the image or set of images.",
            "Then generate multiple categories.",
            "Represent them as a single taxonomy which relates to categories, and that taxonomy is also generated automatically by looking at many images.",
            "Then that is the result of unsupervised learning.",
            "Then you have the matching processes going on with appropriate priors.",
            "As a result, when you do the model matching with the unknown data, you get simultaneous recognition and segmentation, and what you might call a semantic explanation, namely when you find a match, you explain the match by the value, match it because the children were matched, children were matched because their children were matched and each of these children is has its own category name.",
            "So you can replace the children with the category names that you know, so it becomes somewhat of an explanation.",
            "And we truly don't have to feed in any numbers except you know where we have Gaussian model an exponential model and what is the image noise level?",
            "What is, let's say a sensor has noise for any so the sensor acquires images in which."
        ],
        [
            "Fluctuations of five grade levels is the result of sensor noise.",
            "So if you have some things like this, you can put into the system.",
            "But outside of that we don't put in any human parameters.",
            "And that's it."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good morning to everybody and.",
                    "label": 0
                },
                {
                    "sent": "It's a pleasure to be here.",
                    "label": 0
                },
                {
                    "sent": "Thanks to Edwin and Ilkay for doing all the work for me to come and.",
                    "label": 0
                },
                {
                    "sent": "And shared my thoughts with you.",
                    "label": 0
                },
                {
                    "sent": "I'm looking forward to the program and listen to all of you have number of colleagues here who are always good to hear from and learn from.",
                    "label": 0
                },
                {
                    "sent": "So I'm really looking forward to being here for this program.",
                    "label": 0
                },
                {
                    "sent": "And of course, all the exciting local stuff that it'll get put together.",
                    "label": 0
                },
                {
                    "sent": "So what I have?",
                    "label": 0
                },
                {
                    "sent": "Chosen to do in the in the next 15 minutes.",
                    "label": 0
                },
                {
                    "sent": "Is.",
                    "label": 0
                },
                {
                    "sent": "To give you an overview of the.",
                    "label": 0
                },
                {
                    "sent": "Work that we have been doing over the last approximately mostly about five years.",
                    "label": 0
                },
                {
                    "sent": "Some of it goes back beyond the last five years, but but mostly five years.",
                    "label": 0
                },
                {
                    "sent": "And would like to communicate to you some of the things that you may find obvious, but for me they are part of the story and some others that we also found interesting and not quite expected.",
                    "label": 0
                },
                {
                    "sent": "But they're all unified by the.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "By the.",
                    "label": 0
                },
                {
                    "sent": "Need and the objective of.",
                    "label": 0
                },
                {
                    "sent": "Doing recognition.",
                    "label": 0
                },
                {
                    "sent": "In a.",
                    "label": 0
                },
                {
                    "sent": "Contacts where you are minimizing the.",
                    "label": 0
                },
                {
                    "sent": "The training minimizing the.",
                    "label": 0
                },
                {
                    "sent": "Artificial settings in which we often must do these things and for good reasons, of course.",
                    "label": 0
                },
                {
                    "sent": "But how much can we get away from those and try to come as close to to learning and doing the recognition in less constrained situations?",
                    "label": 0
                },
                {
                    "sent": "So let me.",
                    "label": 0
                },
                {
                    "sent": "Well the theme is of course that we want to be using.",
                    "label": 0
                },
                {
                    "sent": "Regions as the ways of as a way of bootstrapping our way out of complete ignorance at the beginning.",
                    "label": 0
                },
                {
                    "sent": "In the beginning we don't know what the objects are, how to recognize them.",
                    "label": 0
                },
                {
                    "sent": "So regions will be our driving force and I'll tell you why.",
                    "label": 0
                },
                {
                    "sent": "Why are we use them?",
                    "label": 0
                },
                {
                    "sent": "So let me start with the basic question.",
                    "label": 1
                },
                {
                    "sent": "Off what is a representation of the image that would be ideal.",
                    "label": 1
                },
                {
                    "sent": "To feed the process of recognition.",
                    "label": 0
                },
                {
                    "sent": "Whether it's recognition or even beyond that in, for example, reasoning about things which depends upon what you use for recognition and so on and synthesis.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "To to get the process going.",
                    "label": 0
                },
                {
                    "sent": "The question that we ask first is what is it that we are trying to learn about?",
                    "label": 0
                },
                {
                    "sent": "And then recognizing reason and so on later.",
                    "label": 0
                },
                {
                    "sent": "And that is object.",
                    "label": 0
                },
                {
                    "sent": "So object for us here is something in the image that's really composed of.",
                    "label": 0
                },
                {
                    "sent": "A number of its parts.",
                    "label": 0
                },
                {
                    "sent": "As a layout of its parts and the layout itself can be described in many, many ways, but the important thing here is that we have a recursive definition and of course like I said, many of these things are are kind of obvious, but for completion I would like to go through them.",
                    "label": 0
                },
                {
                    "sent": "The simplest object, of course, is the one where there are no more parts and all it is is a localized cluster of pixels.",
                    "label": 0
                },
                {
                    "sent": "Set of pixels.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Has only its own properties to be represented as opposed to further decomposition into parts so.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We can have the wall as layout of different things, objects, doors, windows, which are themselves further decompositions of.",
                    "label": 0
                },
                {
                    "sent": "Themselves and we described in terms of their own parts, and so on until we get to the atomic level.",
                    "label": 0
                },
                {
                    "sent": "So the object then is a hierarchy where the large object is layout, small objects and other walls and doors and so on, and they're in terms they are in turn.",
                    "label": 1
                },
                {
                    "sent": "Described by their own parts.",
                    "label": 0
                },
                {
                    "sent": "What we are living out here today is.",
                    "label": 0
                },
                {
                    "sent": "Complex objects such as crowded Street or an city street, so that has its own connotation.",
                    "label": 0
                },
                {
                    "sent": "What's the city street?",
                    "label": 0
                },
                {
                    "sent": "Whether it's in the evening or daytime?",
                    "label": 0
                },
                {
                    "sent": "Crowded means what?",
                    "label": 0
                },
                {
                    "sent": "So these are complex things that we will leave out of our mind during the next hour.",
                    "label": 0
                },
                {
                    "sent": "You know something even more complicated.",
                    "label": 0
                },
                {
                    "sent": "Of course, one can build these things on top of the simpler objects, recognizing similar objects.",
                    "label": 0
                },
                {
                    "sent": "Modeling them, we can build these things.",
                    "label": 0
                },
                {
                    "sent": "These concepts in terms of the concepts that are less that are simpler, namely the kinds of things that we're going to be considering today.",
                    "label": 0
                },
                {
                    "sent": "So, but for simplicity, and of course it's not trivial to go from the simple objects to these, but I think that processes can be separated if you go through the region based representation.",
                    "label": 0
                },
                {
                    "sent": "So we'll keep those out of our minds and stick to objects that are.",
                    "label": 0
                },
                {
                    "sent": "Cohesive spatially compact shall we say when connected single component?",
                    "label": 0
                },
                {
                    "sent": "So here it is.",
                    "label": 0
                },
                {
                    "sent": "The reason why regions ought to be.",
                    "label": 0
                },
                {
                    "sent": "The driving force.",
                    "label": 0
                },
                {
                    "sent": "The driving primitives of a representation that is aimed at the task of recognition.",
                    "label": 0
                },
                {
                    "sent": "The scene that we're talking about, and given the rest.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Section that we have just placed on the object types.",
                    "label": 0
                },
                {
                    "sent": "The scene is made up of.",
                    "label": 0
                },
                {
                    "sent": "Of objects that are simple objects that are objects that are hierarchical in the sense that we just talked about.",
                    "label": 0
                },
                {
                    "sent": "And when we do, the imaging imaging does not change that character of the scene, namely, all objects are spatially localized in 3D imaging does not.",
                    "label": 0
                },
                {
                    "sent": "Over does not change that property and so images are also collection of local 2 dimensional masses cohesive.",
                    "label": 0
                },
                {
                    "sent": "Sets of pixels and so images can be treated as layout of regions of objects that we just talked about.",
                    "label": 1
                },
                {
                    "sent": "So we have the object similar objects, primitive objects and that translates into the image being image consisting of sub image set of some images.",
                    "label": 0
                },
                {
                    "sent": "Each sub image represents apart which may in turn be an object complex object.",
                    "label": 0
                },
                {
                    "sent": "Eventually the primitive subregions which are in most cases we can consider them as homogeneous collections of pixels pixels.",
                    "label": 0
                },
                {
                    "sent": "Homogeneous color values and so on something very simple.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Have their own shape and so on, but something very simple that feeds the recursion.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "This is a fundamental problem that we're all addressing people who are doing recognition, not necessarily always.",
                    "label": 0
                },
                {
                    "sent": "Mentioning it this way, but.",
                    "label": 0
                },
                {
                    "sent": "But the problem fundamental to this and the.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The challenge to recognition is that we have too many things to recognize.",
                    "label": 1
                },
                {
                    "sent": "Presumably we know about them.",
                    "label": 0
                },
                {
                    "sent": "The problem is, even if we have the models, if you don't have models, it's even worse.",
                    "label": 0
                },
                {
                    "sent": "But if you have the models, we still have to worry about where to verify.",
                    "label": 0
                },
                {
                    "sent": "The presence of that object whose model we do here.",
                    "label": 0
                },
                {
                    "sent": "Because an object can be in any location, which means a different subset of pixels.",
                    "label": 0
                },
                {
                    "sent": "So essentially most of the work directly or indirectly, smartly or or not so smartly looks for the occurrences of the object.",
                    "label": 0
                },
                {
                    "sent": "Got it with the given model all over the place.",
                    "label": 0
                },
                {
                    "sent": "So one of the ways we can take it take overcome this problem is to use the standard solution of multiresolution, which tries to kill.",
                    "label": 0
                },
                {
                    "sent": "More and more characteristics of the object complexity of the object by going to lower resolutions as a result of digital nature of the images.",
                    "label": 0
                },
                {
                    "sent": "So smaller objects or images are easier to handle becausw the complexity is less and therefore the number of matching models will be smaller because models are converging into simpler things.",
                    "label": 0
                },
                {
                    "sent": "The details are being lost.",
                    "label": 0
                },
                {
                    "sent": "So as you go to smaller and smaller things.",
                    "label": 0
                },
                {
                    "sent": "The possibilities of what they can be goes down, and so that is a kind of the fundamental.",
                    "label": 0
                },
                {
                    "sent": "Way to overcome this problem of not knowing what what to consider as a match?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "If you take it, the simplest object as I just mentioned, that would be something, for example, very homogeneous in color.",
                    "label": 0
                },
                {
                    "sent": "Have its own shape, an possibly layout of these simple objects would be.",
                    "label": 0
                },
                {
                    "sent": "Would be unique characteristic of the of the object that we're dealing with and the.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in general, then the object would be will have will be layout of parts, each of which is characterized by intrinsic properties.",
                    "label": 0
                },
                {
                    "sent": "If it's a simple object.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now this is where we switch from the nature of objects.",
                    "label": 0
                },
                {
                    "sent": "To the.",
                    "label": 0
                },
                {
                    "sent": "Power of regions.",
                    "label": 0
                },
                {
                    "sent": "Namely.",
                    "label": 0
                },
                {
                    "sent": "The if you.",
                    "label": 0
                },
                {
                    "sent": "Bring back the property that images that the objects are recursive regions.",
                    "label": 0
                },
                {
                    "sent": "Recursive embedding of regions with the layout included.",
                    "label": 0
                },
                {
                    "sent": "Then you can take recourse to the multiscale segmentation of the image as the collection of primitives.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That we can use to to start the matching process.",
                    "label": 0
                },
                {
                    "sent": "While we can do that is the cause.",
                    "label": 0
                },
                {
                    "sent": "The multiscale segmentation, which is based upon color.",
                    "label": 0
                },
                {
                    "sent": "Is indeed something that we can expect as a good basis to start hypothesising object possibilities simply because object boundaries in real world.",
                    "label": 1
                },
                {
                    "sent": "Very often, not always, and the not always part is really confined to accidental Ness of things.",
                    "label": 0
                },
                {
                    "sent": "But for all practical purposes, all different objects, all meaningful objects have boundaries which manifest themselves in photometric discontinuities.",
                    "label": 0
                },
                {
                    "sent": "And therefore we can.",
                    "label": 0
                },
                {
                    "sent": "We can start with no knowledge of the object.",
                    "label": 0
                },
                {
                    "sent": "Just start with the multiple segmentation and use these.",
                    "label": 0
                },
                {
                    "sent": "The boundaries of the regions as potential locations where objects change from the space of 1 object changes.",
                    "label": 0
                },
                {
                    "sent": "So that's the interobject boundary, so bye.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And that we overcome the combinatorics.",
                    "label": 0
                },
                {
                    "sent": "The other argument for regions as opposed to some other.",
                    "label": 0
                },
                {
                    "sent": "Features that are been that have been popular.",
                    "label": 0
                },
                {
                    "sent": "Namely, point features.",
                    "label": 0
                },
                {
                    "sent": "An edge features edge fragments.",
                    "label": 1
                },
                {
                    "sent": "If you have can't complete contours as opposed to edge fragments, then they're equivalent to regions.",
                    "label": 0
                },
                {
                    "sent": "They're just dual representation.",
                    "label": 0
                },
                {
                    "sent": "But if you look at point features or edge fragments from the argument of dimensionality, you don't.",
                    "label": 1
                },
                {
                    "sent": "You're not dealing with things that are perfect carriers for the object information because they're low dimensional and from a purely information theoretic basis, the.",
                    "label": 0
                },
                {
                    "sent": "Objects cannot possibly be represented efficiently because of the mismatch between the capacity of the what you represent your primitives, namely points and edges, and the objects which are two D regions.",
                    "label": 0
                },
                {
                    "sent": "Because they are image in images of two D3D objects which are cohesive, so.",
                    "label": 0
                },
                {
                    "sent": "One must one way or the other, end up with with regions because that are they are dimensionally matched with the objects.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here, of course we are dealing with just the 2D part of it and not the three.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The part of it, which, again similar to the semantically complex objects, can also be.",
                    "label": 0
                },
                {
                    "sent": "Elected on top of the two D things that we're talking about, but those are not the focus.",
                    "label": 0
                },
                {
                    "sent": "Of what we discussed today.",
                    "label": 0
                },
                {
                    "sent": "So the next thing I'll do now is go take you through a sequence of our results that we've obtained, but I will do so at the expense of not spending time on really vast amount of work that has gone into it.",
                    "label": 1
                },
                {
                    "sent": "Lot of it by the people who are present in this room.",
                    "label": 0
                },
                {
                    "sent": "In the interest of just maintaining the continuity of what we have done and give you what the pros and cons, the strengths and weaknesses of different aspects of what we have done is so that we can sort of take a lesson home as to what works or doesn't work.",
                    "label": 0
                },
                {
                    "sent": "So again, that will come at the expense of.",
                    "label": 0
                },
                {
                    "sent": "Completely skipping the literature review, which of course will be unending if you were to do it.",
                    "label": 0
                },
                {
                    "sent": "So let me begin with the multiscale segmentation.",
                    "label": 0
                },
                {
                    "sent": "Aspect and of course I'll just give you what we have done and I won't go into the details and focus on the connections between things to bring out what we think is important and what's not.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Important.",
                    "label": 0
                },
                {
                    "sent": "So first of all, the segmentation process itself is we very well know is not.",
                    "label": 0
                },
                {
                    "sent": "The is a tough job, is a tough job.",
                    "label": 0
                },
                {
                    "sent": "I mean if you look at the first book, The picture processing by computer, which my advisor.",
                    "label": 0
                },
                {
                    "sent": "As in Rosenfeld, published in late 60s.",
                    "label": 0
                },
                {
                    "sent": "Which actually drew me to his group.",
                    "label": 0
                },
                {
                    "sent": "It it lists segmentation as one of the basic problems, and I don't think that we have.",
                    "label": 0
                },
                {
                    "sent": "Segmentation algorithm today that you can.",
                    "label": 0
                },
                {
                    "sent": "Close your eyes and use and not be worried about what it did.",
                    "label": 0
                },
                {
                    "sent": "However, I think the thing that we have been doing since mid 90s and now we have a NTH iteration of the algorithm.",
                    "label": 0
                },
                {
                    "sent": "I think it's almost ready and I said that couple of years ago also, but we found more things to do.",
                    "label": 0
                },
                {
                    "sent": "But we have an algorithm that we consider to be fairly close to what you and I would do.",
                    "label": 0
                },
                {
                    "sent": "Segmentation is not really low level.",
                    "label": 0
                },
                {
                    "sent": "Segmentation is what we're talking about, of course, which means photometric discontinuities that you and I see in the given image.",
                    "label": 0
                },
                {
                    "sent": "All of the entire hierarchy of hierarchy of segmentations.",
                    "label": 0
                },
                {
                    "sent": "So those are the things that, as you can see, we've been doing since for about 15 years.",
                    "label": 0
                },
                {
                    "sent": "But the idea is that you give an image to it and what comes out is all the regions without giving any human input.",
                    "label": 0
                },
                {
                    "sent": "So there is no single parameter given to the system and the system just feeds off.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Color distribution in the image and comes up.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With.",
                    "label": 0
                },
                {
                    "sent": "All kinds of different regions, whether we want to keep them or not is a different story that is up to the user to decide.",
                    "label": 0
                },
                {
                    "sent": "What to pick, what to keep and what not to keep?",
                    "label": 0
                },
                {
                    "sent": "And of course, that's also not.",
                    "label": 0
                },
                {
                    "sent": "That's also made easy by.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "By representing it as a hierarchical structure, which it is so you take the original image and you.",
                    "label": 0
                },
                {
                    "sent": "These are just illustrations of some.",
                    "label": 0
                },
                {
                    "sent": "Some specific subsets of regions.",
                    "label": 0
                },
                {
                    "sent": "In this case, the regions that have contrast higher than 10 contrast higher than 20.",
                    "label": 0
                },
                {
                    "sent": "But the idea is that.",
                    "label": 0
                },
                {
                    "sent": "Whatever the contrasts are unknown to us in the beginning because we're not starting with any prior knowledge.",
                    "label": 0
                },
                {
                    "sent": "So you take the image and you decompose like a jigsaw.",
                    "label": 0
                },
                {
                    "sent": "Puzzle the image into its predominant regions, which in turn are then subdivided into their own predominant regions.",
                    "label": 0
                },
                {
                    "sent": "And what is it that changes from top to bottom can be different.",
                    "label": 0
                },
                {
                    "sent": "It can be based upon contrast.",
                    "label": 0
                },
                {
                    "sent": "Parameter, namely as you go down the tree, you have lower and lower contrast values, or you can arrange this as.",
                    "label": 0
                },
                {
                    "sent": "Regions contained inside the parent region, so the children are contained inside the parent or the children are lower in contrast than payment or higher.",
                    "label": 0
                },
                {
                    "sent": "In contrast, in parent, all of that can be done.",
                    "label": 0
                },
                {
                    "sent": "That's just an organization of the entire set of regions that we have detected, each having its own contract.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what we are?",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Able to do is convert an image into a tree like that.",
                    "label": 0
                },
                {
                    "sent": "And it feeds off lots of other projects, which I will skip here.",
                    "label": 0
                },
                {
                    "sent": "Good discussion, I'll skip here, but some very interesting things follow from having this kind of a relatively bottom up process.",
                    "label": 0
                },
                {
                    "sent": "Giving us this collection.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "What we have here is simply the regions.",
                    "label": 0
                },
                {
                    "sent": "And then what's inside them?",
                    "label": 0
                },
                {
                    "sent": "And then possibly some contrast relationship.",
                    "label": 0
                },
                {
                    "sent": "But what is missing here is something extremely critical, as we'll see later, which is.",
                    "label": 0
                },
                {
                    "sent": "That the representation is invariant.",
                    "label": 0
                },
                {
                    "sent": "Two juggling of the regions.",
                    "label": 0
                },
                {
                    "sent": "So if I were to take the nose, put it below the if I were to take, for example, this the this part and that part and that part and juggle it.",
                    "label": 0
                },
                {
                    "sent": "Specially rearrange them, specially it will not affect the segment the tree representation because it's completely losing the relative spatial location information.",
                    "label": 0
                },
                {
                    "sent": "So it's just a recursive embedding, so if you want to add that, then what we do is we add explicit links between them.",
                    "label": 0
                },
                {
                    "sent": "Which is to say that.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "Region.",
                    "label": 0
                },
                {
                    "sent": "Is.",
                    "label": 0
                },
                {
                    "sent": "Specially in the neighborhood of that region.",
                    "label": 0
                },
                {
                    "sent": "And that in turn is in the special neighborhood of that region.",
                    "label": 0
                },
                {
                    "sent": "And, of course, special neighborhood here means 2D.",
                    "label": 0
                },
                {
                    "sent": "So what this does is that.",
                    "label": 0
                },
                {
                    "sent": "The mustache is next to in the special neighborhood of the nose.",
                    "label": 0
                },
                {
                    "sent": "That part, the lips and all of this is surrounded by certain other regions.",
                    "label": 0
                },
                {
                    "sent": "That's that information, of course, that itself is not a.",
                    "label": 0
                },
                {
                    "sent": "Not an easy thing, So what we had to do was take some time off and.",
                    "label": 0
                },
                {
                    "sent": "So before I'd say that the final thing is that what we have done is take taken the tree and added to it these links between siblings at different levels.",
                    "label": 0
                },
                {
                    "sent": "So remember that these are all.",
                    "label": 0
                },
                {
                    "sent": "Based upon the property I mentioned, containment or or contrast.",
                    "label": 0
                },
                {
                    "sent": "So what we do is we just add sibling links between the neighbor links between siblings, which converts this into pseudo tree in the sense that there's still a tree.",
                    "label": 1
                },
                {
                    "sent": "But we have added these lateral links which are kind of orthogonal information.",
                    "label": 0
                },
                {
                    "sent": "Additional information which just specifies neighbors so it's more.",
                    "label": 1
                },
                {
                    "sent": "You know, being precise it is now a hierarchy of graphs.",
                    "label": 0
                },
                {
                    "sent": "Not much either.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Solution tree not to get the neighborhood concept.",
                    "label": 0
                },
                {
                    "sent": "You know what is next to what?",
                    "label": 0
                },
                {
                    "sent": "What is which regions around a given region.",
                    "label": 0
                },
                {
                    "sent": "That process, that that formalization is not.",
                    "label": 0
                },
                {
                    "sent": "Has not been around as far as we could look, So what we did was we did the point.",
                    "label": 0
                },
                {
                    "sent": "Voronoi diagrams.",
                    "label": 0
                },
                {
                    "sent": "Where, given a point pattern you have over noisy neighborhood, which is simply the.",
                    "label": 0
                },
                {
                    "sent": "Half space has set up spaces that separate two points.",
                    "label": 0
                },
                {
                    "sent": "Equally so the bisectors between two points in plane.",
                    "label": 0
                },
                {
                    "sent": "Are the are the units that form the neighborhood of a point, so you take those points on the boundary and create their own oil diagrams.",
                    "label": 1
                },
                {
                    "sent": "So between this point and that point, there is a vernoy bisector, and if you go walk along this neighborhood, then all the other guys here have points on their neighborhoods.",
                    "label": 0
                },
                {
                    "sent": "Each of each point, here paired with each point on the boundary there gives a bisector.",
                    "label": 0
                },
                {
                    "sent": "So you have a whole sequence of bisectors, small short bisectors.",
                    "label": 0
                },
                {
                    "sent": "That form.",
                    "label": 0
                },
                {
                    "sent": "Occur polygonal curve that that separates this object from that object in some sense equally in the sense I just described.",
                    "label": 0
                },
                {
                    "sent": "If you look at points now, this is not a Euclidian friendly definition directly, but it's digital friendly definition so you do have this curve.",
                    "label": 0
                },
                {
                    "sent": "Now all these other guys are exposed to this region.",
                    "label": 0
                },
                {
                    "sent": "Blue region here in the sense that some segment of this boundary.",
                    "label": 0
                },
                {
                    "sent": "Is shared between this region and these six regions 12345612345 regions so this region shares segments with them and therefore they are more annoying neighbors very similar to what we will do for points where you will have points as neighbors.",
                    "label": 0
                },
                {
                    "sent": "So now all the other guys who are outside all the other regions that are beyond this set are not neighbors, so we produce.",
                    "label": 0
                },
                {
                    "sent": "We add these links to.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "To the tree.",
                    "label": 0
                },
                {
                    "sent": "To generate that connected segmentation tree.",
                    "label": 0
                },
                {
                    "sent": "So here what we also carry along is not only the information that these are neighbors, but also.",
                    "label": 0
                },
                {
                    "sent": "The information as to how good a neighbor or bad enabled it is, and that's directly proportional to the amount of exposure neighbor has to it.",
                    "label": 0
                },
                {
                    "sent": "So this region is exposed to it by an amount which is proportional to the shared.",
                    "label": 0
                },
                {
                    "sent": "The length of the shared boundary.",
                    "label": 0
                },
                {
                    "sent": "So the longer the boundary you share, the more the better neighbor you are.",
                    "label": 0
                },
                {
                    "sent": "So you carry that along.",
                    "label": 0
                },
                {
                    "sent": "Now this is an asymmetric property.",
                    "label": 0
                },
                {
                    "sent": "This is not something you know.",
                    "label": 0
                },
                {
                    "sent": "This may be a good neighbor bad neighbor to this, but this one may be a good neighbor to that.",
                    "label": 0
                },
                {
                    "sent": "And of course in this case that's not the case.",
                    "label": 0
                },
                {
                    "sent": "So because it depends upon your fractional parameter exposed to your fraction of the parameter exposed to a given neighborhood.",
                    "label": 0
                },
                {
                    "sent": "OK, coming back.",
                    "label": 0
                },
                {
                    "sent": "Then we have a region now described by its photometric properties.",
                    "label": 1
                },
                {
                    "sent": "As we are referred to earlier, its geometric properties and the layout characteristics of these guys.",
                    "label": 0
                },
                {
                    "sent": "So you have, for example, if you look at the red node here red region here it has some regions inside it.",
                    "label": 0
                },
                {
                    "sent": "And those regions are for one thing, all contained inside the red region, but we can represent their distribution spatially.",
                    "label": 0
                },
                {
                    "sent": "And their properties individually by those things so we can see each of these guys has its own photometric distribution, but of course that itself is a tree in general, but.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But we have not only the intrinsic properties but also.",
                    "label": 0
                },
                {
                    "sent": "How they are configured specially inside this and that can be captured in things like this.",
                    "label": 0
                },
                {
                    "sent": "The angle between the child and parents principal axis.",
                    "label": 1
                },
                {
                    "sent": "That's orientation information relative to the parents, so that makes it image orientation independent because you are trying yourself to the parent so its orientation independence is introduced that way.",
                    "label": 0
                },
                {
                    "sent": "You can have a.",
                    "label": 1
                },
                {
                    "sent": "Where the displacement of child centroids relative to the parent centroid, you can have a context vector which says how are my siblings relative to where I am.",
                    "label": 0
                },
                {
                    "sent": "So you can take a vector like this which tells you the rough distribution.",
                    "label": 0
                },
                {
                    "sent": "Direction of the distribution are at least the center of the distribution of the siblings, so you can have features like that to capture layout information.",
                    "label": 0
                },
                {
                    "sent": "Now we're not talking about the completeness of it or lack there off.",
                    "label": 0
                },
                {
                    "sent": "It's a bunch of features, you know the argument of what is minimal and what's what's minimal.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Useful.",
                    "label": 0
                },
                {
                    "sent": "So all of those issues here.",
                    "label": 0
                },
                {
                    "sent": "So basically you you attach those properties with.",
                    "label": 0
                },
                {
                    "sent": "With the.",
                    "label": 0
                },
                {
                    "sent": "The individual regions, and now what we have is CST subgraphs or will just keep continue to keep.",
                    "label": 0
                },
                {
                    "sent": "Will continue to call at subtrees, ignoring the fact that there is those red neighbors links.",
                    "label": 0
                },
                {
                    "sent": "So now images.",
                    "label": 0
                },
                {
                    "sent": "Any image now since it contains multiple objects it is going to be a set of.",
                    "label": 0
                },
                {
                    "sent": "Subtrees because the image is represented by a tree, CST connected segmentation tree.",
                    "label": 1
                },
                {
                    "sent": "Since it image consists of multiple objects, chances are that that tree would consists of the corresponding subtrees.",
                    "label": 0
                },
                {
                    "sent": "And each object that what we call an object can now be composed of one or more subtrees.",
                    "label": 1
                },
                {
                    "sent": "Because objects are not made up of color homogeneous.",
                    "label": 0
                },
                {
                    "sent": "Apart, so an object may be consisting of dark and bright blue and red.",
                    "label": 0
                },
                {
                    "sent": "So since this is photometric, the segmentation is photometric considerations based.",
                    "label": 0
                },
                {
                    "sent": "We won't have an object showing up as a single node in the tree or single subtree.",
                    "label": 0
                },
                {
                    "sent": "Therefore we have to collect a bunch of subtrees that will correspond to an object.",
                    "label": 0
                },
                {
                    "sent": "Therefore, the an object would correspond to a collection of subtrees and we have to model that collection.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now in this process, the discovery process would be a process that would match.",
                    "label": 0
                },
                {
                    "sent": "Suppose you're given a set of images and we want to know whether there is an object present across these images.",
                    "label": 1
                },
                {
                    "sent": "You take each of these trees, image trees, and from that collection of image trees.",
                    "label": 0
                },
                {
                    "sent": "If we look for matching subtrees across the set of trees, then that is an evidence that something is repeating in the images.",
                    "label": 0
                },
                {
                    "sent": "It is an object.",
                    "label": 0
                },
                {
                    "sent": "In some sense.",
                    "label": 0
                },
                {
                    "sent": "It may be a part of a part of a part, but it's something that is repeating, which is what which is photometrically geometrically, anthropologically.",
                    "label": 0
                },
                {
                    "sent": "The same or similar.",
                    "label": 1
                },
                {
                    "sent": "So to find such matching subtrees is then the process of.",
                    "label": 0
                },
                {
                    "sent": "Inferring that there is something repeating.",
                    "label": 0
                },
                {
                    "sent": "And once we have the repeated sets of trees, subtrees weaken.",
                    "label": 0
                },
                {
                    "sent": "The question now comes I have seen multiple occurrences of what looks to be the same thing.",
                    "label": 0
                },
                {
                    "sent": "How do I capture it as an entity?",
                    "label": 0
                },
                {
                    "sent": "Because I've declared them to be different manifestations, different appearances of the same exact thing because of my matching process, how do I?",
                    "label": 0
                },
                {
                    "sent": "How do I capture it?",
                    "label": 0
                },
                {
                    "sent": "And that's done by?",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "By capturing the variations through a set of probability density functions.",
                    "label": 0
                },
                {
                    "sent": "That that described the variations in the subtrees across the various incarnations of it.",
                    "label": 0
                },
                {
                    "sent": "And then the recognition process becomes probabilistic matching of the model, which is probabilistic with the.",
                    "label": 0
                },
                {
                    "sent": "Content of a given image, which means a subtrees of the tree of the image, which means a collection of subtrees.",
                    "label": 0
                },
                {
                    "sent": "So you take your probabilistic tree model of an object, which means a set of nodes, each having its own PDF, because that's how I illustrate this in a minute.",
                    "label": 0
                },
                {
                    "sent": "But then the recognition processes matching the PDF set of PDF's of these nodes with this characteristic structure with a given tree and look for substring matches.",
                    "label": 0
                },
                {
                    "sent": "So for example.",
                    "label": 0
                },
                {
                    "sent": "If you had given.",
                    "label": 0
                },
                {
                    "sent": "I tree and we want to match subtree of it to some subtree of a given model.",
                    "label": 0
                },
                {
                    "sent": "Then we have the standard problem an of isomorphism, subtree isomorphism.",
                    "label": 1
                },
                {
                    "sent": "So what we want to do is to match two regions if they look similar and their subtrees below them.",
                    "label": 1
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also similar.",
                    "label": 0
                },
                {
                    "sent": "So that's.",
                    "label": 0
                },
                {
                    "sent": "The standard problem of given two graphs.",
                    "label": 1
                },
                {
                    "sent": "We want to find a mapping from nodes of 1 to the nodes of the other.",
                    "label": 0
                },
                {
                    "sent": "Such that we minimize.",
                    "label": 0
                },
                {
                    "sent": "Maximize the agreement between whatever we declared to be matched and the agreement between the matched candidates.",
                    "label": 0
                },
                {
                    "sent": "The matched subtrees is in terms of.",
                    "label": 0
                },
                {
                    "sent": "The node matches and the structure below the nodes, whether they match or not.",
                    "label": 0
                },
                {
                    "sent": "So unary and pairwise potentials.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of course, this translates into.",
                    "label": 0
                },
                {
                    "sent": "Simpler versions which are results of linearizations, so you can have the.",
                    "label": 0
                },
                {
                    "sent": "Letter X represents vector X represent contain entries, each of which represents the candidate pair of matching nodes, and then we can go and do somewhat standard things, namely.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Convert it into a integer quadratic problem and then in turn relax the integer constraint to then solve it for the best we can do in terms of preserving or matching the.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Models.",
                    "label": 0
                },
                {
                    "sent": "No properties and the model structure in the country.",
                    "label": 0
                },
                {
                    "sent": "So what we?",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "End up with this what we end up with after this is the following.",
                    "label": 0
                },
                {
                    "sent": "We have a set of images.",
                    "label": 0
                },
                {
                    "sent": "Remember we started with and we now have a bunch of subtrees that we found were matching.",
                    "label": 0
                },
                {
                    "sent": "OK, so for example, all the red ones, the red, the subtree that subtree in that subtree were found to be matched by the process we just talked about.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, the blue one.",
                    "label": 0
                },
                {
                    "sent": "The blue ones represent a different set of matches, matching subtrees, and those are two different sets, each containing matching subtrees, and there can be many such sets.",
                    "label": 0
                },
                {
                    "sent": "There can be the head, there can be the shirt that can be blessed.",
                    "label": 0
                },
                {
                    "sent": "There can be the tables and so on.",
                    "label": 0
                },
                {
                    "sent": "Whatever is there, and you know these don't have.",
                    "label": 0
                },
                {
                    "sent": "I said these don't have to be semantically cohesive things for us, but they are something that is repeating.",
                    "label": 0
                },
                {
                    "sent": "So we put them all into one giant bag.",
                    "label": 0
                },
                {
                    "sent": "This red bag and there's a blue bag here, and this is where we have to answer the question of how do we capture them into a single representation?",
                    "label": 0
                },
                {
                    "sent": "And that's where the collection of PDFs comes in.",
                    "label": 0
                },
                {
                    "sent": "So the this, this, this and this must be represented by the same PDF that that that that must be represented by the same PDF.",
                    "label": 0
                },
                {
                    "sent": "And of course we know the correspondences across these subtrees because they were matched.",
                    "label": 0
                },
                {
                    "sent": "So we have essentially a collection of things which we know have matched.",
                    "label": 0
                },
                {
                    "sent": "So there is that that that in that.",
                    "label": 0
                },
                {
                    "sent": "Is known to be matched.",
                    "label": 0
                },
                {
                    "sent": "The question is how do we come up with?",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Single PDF for it.",
                    "label": 0
                },
                {
                    "sent": "So we first of all register them and registration is not something new.",
                    "label": 0
                },
                {
                    "sent": "The reason they got matches because their intrinsic properties and their structures matched and therefore we know the correspondences.",
                    "label": 0
                },
                {
                    "sent": "You match them and then each you get generate boxes like this.",
                    "label": 0
                },
                {
                    "sent": "So there is 1 box here and there are many such boxes and that's where each box gets represented by an underlying single PDF.",
                    "label": 0
                },
                {
                    "sent": "So now you have a tree.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Off PDF from here.",
                    "label": 0
                },
                {
                    "sent": "So you associate.",
                    "label": 0
                },
                {
                    "sent": "PDFs with each of them, and therefore you have a tree of PDFs and that is.",
                    "label": 1
                },
                {
                    "sent": "Where we bring in the PDF choices, parameters and so on.",
                    "label": 0
                },
                {
                    "sent": "So in our case.",
                    "label": 0
                },
                {
                    "sent": "Then the tree is.",
                    "label": 0
                },
                {
                    "sent": "It has an aspect of structure and.",
                    "label": 0
                },
                {
                    "sent": "The the properties of each of the elements within the structure.",
                    "label": 0
                },
                {
                    "sent": "So here is your.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Tree, so we have a node above having so many children.",
                    "label": 0
                },
                {
                    "sent": "Each node has its own properties, photometric properties, and it has certain distribution PDF that says how many children it is going to have.",
                    "label": 0
                },
                {
                    "sent": "Number of children and the properties of the nodes.",
                    "label": 1
                },
                {
                    "sent": "So then the.",
                    "label": 0
                },
                {
                    "sent": "Joint probability density function of XY&N for a given situation given type of structure the these two are sufficient descriptors for a class of matching subtrees.",
                    "label": 0
                },
                {
                    "sent": "Given that class, we have the PDF given by under the independence assumption of how many children a node has, and given the number of children and the node, what are the nodes it produces and how?",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Each node look.",
                    "label": 0
                },
                {
                    "sent": "In terms of colors, so those parameters of these three density functions then capture summarize the set of match subtrees that we found.",
                    "label": 0
                },
                {
                    "sent": "So now once we have this.",
                    "label": 0
                },
                {
                    "sent": "Once we have this now, we have.",
                    "label": 0
                },
                {
                    "sent": "Essentially a model of the class of subtrees or set of subtrees that correspond to a class.",
                    "label": 0
                },
                {
                    "sent": "And we do you do the estimation process.",
                    "label": 0
                },
                {
                    "sent": "Of course we can use.",
                    "label": 0
                },
                {
                    "sent": "The iterative estimation using one of the algorithms that are available, so we have belief propagation or or am or.",
                    "label": 0
                },
                {
                    "sent": "So we just iterate, go back and forth between the structure and the parameters and ensure that there is an agreement between the choice of parameters we made.",
                    "label": 0
                },
                {
                    "sent": "And of course we also choose the type of distributions exponential for the number of children, Gaussian for the color, and so on.",
                    "label": 0
                },
                {
                    "sent": "And we have noticed that that what density function you choose at least empirically, actually only empirically, doesn't make much difference.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now as a result of having this model, what we have is a new image and known model.",
                    "label": 1
                },
                {
                    "sent": "From training images we have a model which is a set of PDF's hierarchy of Periers.",
                    "label": 1
                },
                {
                    "sent": "You take the tree of the image, you take the tree of PDF's, that is the model.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Do the matching.",
                    "label": 0
                },
                {
                    "sent": "Where matching means.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "That you take each of these subtrees.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Essentially correlate it with each of the sub trees in the.",
                    "label": 0
                },
                {
                    "sent": "So take the subtrees here and take the subtrees there.",
                    "label": 0
                },
                {
                    "sent": "Or take the entire model here and slide it against the tree of the image and see if there are matches where the matches matching process now means that the PDFs that govern the model declare individual corresponding instances in the image tree as a valid instance with 95% chance for example.",
                    "label": 1
                },
                {
                    "sent": "So every corresponding node between this and that.",
                    "label": 0
                },
                {
                    "sent": "Should have .95 probability of, for example matching and then we say that subtree within this image is an instance of this.",
                    "label": 0
                },
                {
                    "sent": "So that's what leads to these discover these occurrences of.",
                    "label": 0
                },
                {
                    "sent": "That model",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As a result of this, now, if you have let's say these are training images, so 123456 not too many.",
                    "label": 1
                },
                {
                    "sent": "But they are enough for us.",
                    "label": 0
                },
                {
                    "sent": "Even two are enough for us.",
                    "label": 0
                },
                {
                    "sent": "The reason is that.",
                    "label": 0
                },
                {
                    "sent": "If you have something occurring in two images.",
                    "label": 0
                },
                {
                    "sent": "That's an evidence in favor of something repeating, and therefore even though it repeats once, namely once in the original image, once in the second image.",
                    "label": 0
                },
                {
                    "sent": "But it's more than more than one, and so that's an evidence in favor of the significance of whatever it is that repeats.",
                    "label": 0
                },
                {
                    "sent": "So you take those repeating things, and then you generate the model.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then use it.",
                    "label": 0
                },
                {
                    "sent": "So even with these six we generate a model.",
                    "label": 0
                },
                {
                    "sent": "In this case, what we discover is 2 repeating things.",
                    "label": 0
                },
                {
                    "sent": "One is the horse and the other is actually horse and combination of fest.",
                    "label": 0
                },
                {
                    "sent": "Let's consider that an object in this case because it's repeating.",
                    "label": 0
                },
                {
                    "sent": "It's again segmentation based thing, so we don't really have any understanding of it.",
                    "label": 0
                },
                {
                    "sent": "So you take that model and you take those models and you rub it against the trees of these four images and what you come up with is those outputs.",
                    "label": 0
                },
                {
                    "sent": "This is just a high resolution detail.",
                    "label": 0
                },
                {
                    "sent": "But basically you are able to spot the objects from those six training images and you have two models that you have generated.",
                    "label": 0
                },
                {
                    "sent": "Now here you can study the images closely.",
                    "label": 0
                },
                {
                    "sent": "There is a jagged boundaries that is blurred boundaries, complex patterns.",
                    "label": 1
                },
                {
                    "sent": "But because of the nature of our segmentation driven because.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Segmentation, doing it, it seems to do.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And these are just illustrations.",
                    "label": 0
                },
                {
                    "sent": "It works out very large number of images.",
                    "label": 0
                },
                {
                    "sent": "These are just illustrations here.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "If we have.",
                    "label": 0
                },
                {
                    "sent": "Such models discovered.",
                    "label": 0
                },
                {
                    "sent": "We one thing would be to take each of these model and and run it against all kinds of images and discover the presence of each category.",
                    "label": 0
                },
                {
                    "sent": "In a given image.",
                    "label": 0
                },
                {
                    "sent": "By trying the models that we have learned for all categories, the problem is that the real world has very large number of care.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Degrees.",
                    "label": 0
                },
                {
                    "sent": "However.",
                    "label": 0
                },
                {
                    "sent": "It's it's it's.",
                    "label": 0
                },
                {
                    "sent": "Somewhat obvious that we don't need this many independent categories.",
                    "label": 0
                },
                {
                    "sent": "The reason is that real world is not composed of unrelated things.",
                    "label": 1
                },
                {
                    "sent": "Two different categories are always, in our experience, related horses and camels share legs.",
                    "label": 0
                },
                {
                    "sent": "Their legs may look different in different ways, but they share leads, so there is that organization of knowledge that is.",
                    "label": 0
                },
                {
                    "sent": "That does not expect us to really consider every little category as an independent entity there is.",
                    "label": 0
                },
                {
                    "sent": "There is a merger.",
                    "label": 0
                },
                {
                    "sent": "There is overlap.",
                    "label": 0
                },
                {
                    "sent": "There is this taxonomic character to this.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Knowledge, for example, you have this one and that one, and then if you go down you have smaller and smaller parts, but those parts are increasingly shared as you go down.",
                    "label": 1
                },
                {
                    "sent": "They are smaller, but increasingly shared, so there isn't a reverse tree here which were apart is shared by many.",
                    "label": 0
                },
                {
                    "sent": "Many and the sharing degree goes down as parts become more complex.",
                    "label": 0
                },
                {
                    "sent": "But this comes to a rescue in the in the sense that.",
                    "label": 0
                },
                {
                    "sent": "That the categories are really shared versions, configurations of sub categories and sub categories are simple and therefore more robust to detect.",
                    "label": 1
                },
                {
                    "sent": "And the best thing is that the complexity of doing large scale modeling and recognition now becomes less challenging because you have this kind of an interleaving and therefore the complexity becomes sub linear.",
                    "label": 0
                },
                {
                    "sent": "It's it's.",
                    "label": 0
                },
                {
                    "sent": "It doesn't increase linearly with the number of of the category.",
                    "label": 0
                },
                {
                    "sent": "You don't have to try 30,000 different things.",
                    "label": 0
                },
                {
                    "sent": "In fact, you can try.",
                    "label": 0
                },
                {
                    "sent": "You can try.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 1
                },
                {
                    "sent": "You can try these guys, which are simpler to do, but then they simultaneously satisfy many parents and then you can try them and then they satisfy many parents.",
                    "label": 0
                },
                {
                    "sent": "So we that's that's how we overcome the complexity issue.",
                    "label": 0
                },
                {
                    "sent": "So we generated a database.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "2.",
                    "label": 0
                },
                {
                    "sent": "Dua.",
                    "label": 0
                },
                {
                    "sent": "Try this thing out because most of the other databases are.",
                    "label": 0
                },
                {
                    "sent": "Somewhat simpler, so we tried this and we discovered that from small number of images, the models that we generate actually go a long way in spotting whatever it is that you learned.",
                    "label": 0
                },
                {
                    "sent": "In this case, all those guys are learned or discovered by matching those models that we generated.",
                    "label": 0
                },
                {
                    "sent": "Many of them from that data set and segmentation is just a side advance.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Site product we do recognition and segmentation together simply because.",
                    "label": 0
                },
                {
                    "sent": "Because segmentation is inherent to the definition of the object.",
                    "label": 0
                },
                {
                    "sent": "More examples.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, one thing that we have done so far is that we have considered.",
                    "label": 0
                },
                {
                    "sent": "All.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Categories are equally likely to occur.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And all categories are equally likely to tell us about what.",
                    "label": 0
                },
                {
                    "sent": "Parent category might be present.",
                    "label": 0
                },
                {
                    "sent": "So in the tree that we just talked about taxonomy tree.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "We just said as long as there's matched, declared it a match.",
                    "label": 0
                },
                {
                    "sent": "And don't worry about the probabilities of how often we are likely to see these things.",
                    "label": 0
                },
                {
                    "sent": "So what the next thing we're going to add is to.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is to take into account.",
                    "label": 0
                },
                {
                    "sent": "The not only just a match quality, but what is it that we're matching?",
                    "label": 0
                },
                {
                    "sent": "How likely it is to occur and how likely it is to tell us about other parent bigger categories?",
                    "label": 0
                },
                {
                    "sent": "How likely are the legs going to tell us?",
                    "label": 0
                },
                {
                    "sent": "How likely are this particular set of observations?",
                    "label": 0
                },
                {
                    "sent": "How likely is this set of observations about legs?",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "How likely it is that it's the Lego foot Camel versus the leg of a dog?",
                    "label": 0
                },
                {
                    "sent": "So we we take into account the priors, you know what the individual observations tell us and what the individual observations tell us about.",
                    "label": 0
                },
                {
                    "sent": "Parent categories specially.",
                    "label": 0
                },
                {
                    "sent": "For example, if you think of the unshared categories, like in camels, you will see these, which are uncommon when we compared in our data set.",
                    "label": 0
                },
                {
                    "sent": "Camels have this unique signature.",
                    "label": 0
                },
                {
                    "sent": "Cows had this.",
                    "label": 0
                },
                {
                    "sent": "Deer had this, so they make sense, so once you see those then it's very likely that there there.",
                    "label": 0
                },
                {
                    "sent": "So essentially then we need to have a Bayesian approach.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "By associating probabilities, priors and conditional probabilities with these things.",
                    "label": 0
                },
                {
                    "sent": "So what we do is implement this.",
                    "label": 0
                },
                {
                    "sent": "You simply make estimates of these from the from the time we are doing the training, and in addition to doing the models he also do the probabilities.",
                    "label": 0
                },
                {
                    "sent": "And you can use this information in the.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The process very trivially by, for example, a sense effectively scaling the axes in the feature space or whatever features we are observing.",
                    "label": 0
                },
                {
                    "sent": "If their relevance is high to a particular category.",
                    "label": 0
                },
                {
                    "sent": "So this is, let's say the recognition system for a particular category, you can.",
                    "label": 0
                },
                {
                    "sent": "Bring in the prior probabilities and the conditional probabilities by by distorting the space in favor of of the.",
                    "label": 0
                },
                {
                    "sent": "Right, right categories for right features which would separate otherwise mixed up features into different categories which are much easier to discriminate.",
                    "label": 0
                },
                {
                    "sent": "To separate because you have taken the antlers and given it more important for deer and so on.",
                    "label": 0
                },
                {
                    "sent": "And then of course, as I said, categorization, segmentation, and more importantly equally importantly.",
                    "label": 1
                },
                {
                    "sent": "You also know why you recognizing a camera because you're recognizing it's let's you recognizing it's hump you recognizing.",
                    "label": 0
                },
                {
                    "sent": "It's still an enquiry recognizing legs as horse LEXIS because there is this further limiting composition.",
                    "label": 0
                },
                {
                    "sent": "So the fact that you have a subtree to back you up in your recognition also says that you have a whole explanation of why the recognition is taking place, namely the entire subtree is basis.",
                    "label": 0
                },
                {
                    "sent": "Here's some more results, early results, which basically tell you that if you use point and edge like features, which are the features used for the other curves, not.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hours, then without much tuning you do gain quite a bit of.",
                    "label": 0
                },
                {
                    "sent": "Advantage whether it's one data set or another, the performance on different datasets may be different, but there is a jump coming from the use of the right features, which of course all of us know.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From Veteran nation base.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "6.",
                    "label": 0
                },
                {
                    "sent": "There is a very big major problem in value segmentation and that is that.",
                    "label": 1
                },
                {
                    "sent": "Segmentation of an image depends a lot on the idiosyncrasy's of the illumination.",
                    "label": 0
                },
                {
                    "sent": "You know if you have a video video, look at successive frames of the same object.",
                    "label": 0
                },
                {
                    "sent": "They change drastically, so one very serious thing that we need to worry about is the instability of segmentation from frame to frame, much less from one frame to 10 frames, hence.",
                    "label": 1
                },
                {
                    "sent": "So the stability is a serious issue, so.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What we did for that was we allow partial matching whenever boundaries are lost because of leakage in in the color across two regions.",
                    "label": 0
                },
                {
                    "sent": "So the instability happens because part of the boundary might merge with the parent or the next region.",
                    "label": 0
                },
                {
                    "sent": "You can overcome that by simple procedures like partial boundary matching and so on, so that's doable.",
                    "label": 0
                },
                {
                    "sent": "Here are some results under instability.",
                    "label": 0
                },
                {
                    "sent": "You have partial matching, not the entire matching, so the color coding tells you what matches what doesn't.",
                    "label": 0
                },
                {
                    "sent": "So that's the.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some problem that it was very serious when we were working with with this and now I think we have a good control over this.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But the degree of this see, I'm sure many of you experienced this that if you work with segmentation, this is something that has to be absolutely done.",
                    "label": 0
                },
                {
                    "sent": "Otherwise you simply cannot survive.",
                    "label": 0
                },
                {
                    "sent": "Now one final thing I would like to mention is that.",
                    "label": 0
                },
                {
                    "sent": "If something is being considered as a basic driver of recognition systems as a basic recognition of the image.",
                    "label": 0
                },
                {
                    "sent": "Hello sorry not recognizing representation of the image.",
                    "label": 0
                },
                {
                    "sent": "Then it's worth testing it for other things, so if it's low level enough then it should be tested for other things.",
                    "label": 0
                },
                {
                    "sent": "So what we did was we.",
                    "label": 0
                },
                {
                    "sent": "Tried video segmentation on this which is matching but sort of slightly away from what we just did.",
                    "label": 0
                },
                {
                    "sent": "These were those were isolated different images.",
                    "label": 0
                },
                {
                    "sent": "These are video frames, video sequences with successive frames being very similar and so under unstable segmentation we have the results.",
                    "label": 1
                },
                {
                    "sent": "This is actually an illustration of this segmentation, so one approach another approach, but basically the.",
                    "label": 0
                },
                {
                    "sent": "Three different sequences.",
                    "label": 0
                },
                {
                    "sent": "These are not as challenging as they should be, but these are just to illustrate.",
                    "label": 0
                },
                {
                    "sent": "The ability to segment, but this is a bit more interesting in that here we have a different application of the same representation.",
                    "label": 0
                },
                {
                    "sent": "Here we have a single image in which you have repeating objects.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in this case there are some occurrences of the object which are which are the.",
                    "label": 0
                },
                {
                    "sent": "Complete, but in general they are not complete.",
                    "label": 0
                },
                {
                    "sent": "What happened here?",
                    "label": 0
                },
                {
                    "sent": "So what we do is we take a single image, we take its tree.",
                    "label": 0
                },
                {
                    "sent": "And we consider different subtrees as potential recurring objects.",
                    "label": 0
                },
                {
                    "sent": "So the tree has.",
                    "label": 0
                },
                {
                    "sent": "So the tree has.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "The whole industry has many sub trees and what we're looking for is the potential for repeating subtrees corresponding to these guys and in general none of them will be complete.",
                    "label": 0
                },
                {
                    "sent": "So what we do is we take subtrees and run the process within the same tree and find all the recurring subtrees and they correspond to then texels.",
                    "label": 0
                },
                {
                    "sent": "So for.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sample here we have those guys matching each other.",
                    "label": 0
                },
                {
                    "sent": "So what we do is we take the matching well, just like before we stack them and we register them and we find the Union and their PDF that describes that Union.",
                    "label": 0
                },
                {
                    "sent": "So we really generate a complete textual description from partial observations by having a PDF which takes care of all the registered set.",
                    "label": 0
                },
                {
                    "sent": "So here is a result of applying that process.",
                    "label": 0
                },
                {
                    "sent": "So this is a rather complex texture, lots of.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we are able to delineate.",
                    "label": 0
                },
                {
                    "sent": "Each of the bees.",
                    "label": 0
                },
                {
                    "sent": "Through its PDF.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have learned here is another one.",
                    "label": 0
                },
                {
                    "sent": "Without doing something like this will be very hard to come up with this consistent segmentation of the of the objects.",
                    "label": 0
                },
                {
                    "sent": "Here is another one.",
                    "label": 0
                },
                {
                    "sent": "This one is used to segment multiple textures, not just recognize the Texas within a single homogeneous texture.",
                    "label": 0
                },
                {
                    "sent": "So we do the same thing here.",
                    "label": 0
                },
                {
                    "sent": "Input image you have different types of texels.",
                    "label": 0
                },
                {
                    "sent": "You use the type of textures to segment.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The regions that correspond to that are occupied by the different textures.",
                    "label": 0
                },
                {
                    "sent": "Another one.",
                    "label": 0
                },
                {
                    "sent": "Again, matching trees within the subject within the.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Andre.",
                    "label": 0
                },
                {
                    "sent": "And then we have some more examples of scene discrimination from region proper.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Reason dynamic textures for dynamic textures more of those will be coming in future papers.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me just summarize then.",
                    "label": 0
                },
                {
                    "sent": "What we have is.",
                    "label": 0
                },
                {
                    "sent": "These properties that we are these characteristics are these abilities that we are able to achieve from segmentation without really making any any assumptions about what's in the image or set of images.",
                    "label": 0
                },
                {
                    "sent": "Then generate multiple categories.",
                    "label": 0
                },
                {
                    "sent": "Represent them as a single taxonomy which relates to categories, and that taxonomy is also generated automatically by looking at many images.",
                    "label": 0
                },
                {
                    "sent": "Then that is the result of unsupervised learning.",
                    "label": 1
                },
                {
                    "sent": "Then you have the matching processes going on with appropriate priors.",
                    "label": 0
                },
                {
                    "sent": "As a result, when you do the model matching with the unknown data, you get simultaneous recognition and segmentation, and what you might call a semantic explanation, namely when you find a match, you explain the match by the value, match it because the children were matched, children were matched because their children were matched and each of these children is has its own category name.",
                    "label": 1
                },
                {
                    "sent": "So you can replace the children with the category names that you know, so it becomes somewhat of an explanation.",
                    "label": 0
                },
                {
                    "sent": "And we truly don't have to feed in any numbers except you know where we have Gaussian model an exponential model and what is the image noise level?",
                    "label": 0
                },
                {
                    "sent": "What is, let's say a sensor has noise for any so the sensor acquires images in which.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Fluctuations of five grade levels is the result of sensor noise.",
                    "label": 0
                },
                {
                    "sent": "So if you have some things like this, you can put into the system.",
                    "label": 0
                },
                {
                    "sent": "But outside of that we don't put in any human parameters.",
                    "label": 0
                },
                {
                    "sent": "And that's it.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": []
        }
    }
}