{
    "id": "4qujdh5ylenekb4jpqyj3petkmu2uvbf",
    "title": "Cell biomechanics as a marker of disease development: the case of calcific aortic valve disease",
    "info": {
        "author": [
            "Loredana Casalis, ELETTRA - Sincrotrone Trieste"
        ],
        "published": "July 9, 2018",
        "recorded": "May 2018",
        "category": [
            "Top->Chemistry",
            "Top->Biology",
            "Top->Physics"
        ]
    },
    "url": "http://videolectures.net/biophysics2018_casalis_valve_disease/",
    "segmentation": [
        [
            "So today I I will tell you something about new activities that we are carrying out in our lab, indeed."
        ],
        [
            "My lab is located in Trieste.",
            "There at the Synchrotron Radiation Facility, the Italian Synchrotron Radiation Facility and IS laboratory which.",
            "Wow."
        ],
        [
            "No.",
            "Sorry is Alberta tree in which we employ nanotechnology essentially mostly for nonmedical application.",
            "But we are also dealing with some biophysics at the nanoscale, like we set it up some model membrane system to mimic interaction approach in relevant for neurodegenerative disease.",
            "With this model systems.",
            "But as I said most of our activity are.",
            "Ann are devoted to generate some devices able to to measure biomarkers in diseases, and this specially in cancer.",
            "Then also we took advantage of being in a synchrotron to build up Noble material based on nanoscale fabrication, microscale fabrication bio compatible carbon based which can be used for prosthetic application in.",
            "Field says nurie injuries and cardiac valve disease."
        ],
        [
            "So is a laboratory which is specialized in atomic force microscopy and application of atomic force microscopy.",
            "In physiological environment, most of the we started with experience in imaging high resolution imaging cell cell imaging and biomolecular interaction at the single cell level.",
            "But also we are dealing with the nanotechnology tool which is called nano grafting based on AFM.",
            "In which we assemble a functional structure at the nanoscale in which we oriented specific macromolecules with control value of orientation, density and so on to be able to detect biomarker, inseli, Zeta and in blood.",
            "So this is our let's say main core activity and we produce several devices for especially for biomarkers in cancer.",
            "So we.",
            "I don't know why it's."
        ],
        [
            "OK, we conjugate protein mostly with the DNA tail and then we grafted with this nanolithography the complementary strand of the DNA tail to the surface and then these actors a bar code for the protein and also to drive the protein to the specific spot on the surface.",
            "Then in this way we produce functional spot and this function as powder can be used also.",
            "Two detector bio interaction and the detection is performed with the FM and we see the morphological changes and the height of the FM is also.",
            "Somehow responding to the number of the bio recognition event that occurs on the functional spot we did sell.",
            "Is it the studies and those show single cell or few cell secretome studies?",
            "And then?"
        ],
        [
            "We moved to study the extracellular domain over 2.",
            "Which is liberated and circulated in serum and which is a biomarker for her two positive her two positive cancer disease.",
            "We demonstrated that with a special binder which are the BHHS.",
            "So the the this small part of a camelid nanobody the variable part of the camelid nanobody we can set up a surface in which we regulate the density.",
            "Of the of the.",
            "Of the probe to optimal biobio recognition and.",
            "And we reach the in this way, value of the detection of these extracellular domain two in serum which are of the order of 1000 picomolar and which are compatible with the cut off value commonly used in cleaning to assess positive breast cancer.",
            "And I mean."
        ],
        [
            "And scene, so we use a barcoding assay.",
            "This is also very barcoding.",
            "The same based on a short sequences of DNA.",
            "We can easily produce multiplexing assay an monitor create different functional spot and monitor different protein at the same time, which is very useful for bear market attack."
        ],
        [
            "But then there is a lot of controversial.",
            "There are a lot of control controversial issues in the literature, because unfortunately these just to stay in the case of extracellular domain, over 2 circulating in the blood unfortunately doesn't correlate very well with the other parameter like meta static.",
            "Static prediction of the specific tumor, and this is because we don't take into account all the variability all the possible phenotypes that I mean there are cells that could debate the chemotherapy and produce metastasis, and we lose this kind of cells in a global analysis.",
            "So what we would like to do is to set the multiparametric analysis a single cell analysis.",
            "In order to classify single cells after the their phenotype, which could be optically the fine, there could be mechanically defined because in in accounts are in many disease cell interaction with the extracellular environment mechanical cell interaction with extracellular environment are really important and then combine some molecular biomarker detection with correlated by Michael.",
            "By molecular that molecular biomarker detection, with a different cell phenotype before we."
        ],
        [
            "Recently embarked in a study of the cell biomechanic"
        ],
        [
            "And the reason why I tell you some recent results obtained in the context of.",
            "About our tickle valve diseases.",
            "Because you know, funds are driving your research in certain direction and this is what happened to us so.",
            "Mechanobiology is related to the study about how do self perceived and mechanical steam loose and translate from the extracellular environment and translated through the cytoplasmic, converting it into a biocon biochemical into biochemical.",
            "Signal, and so the there are important molecules alike the Uncle Factory Apple, which is the yes associated protein which is normally staying in the in the cytosol.",
            "And when an can be mechanically activated and promoting its translocation into the new clothes and this translocation into the nucleus promo to some gene expression and production of specific.",
            "Floating, which then modify the extracellular matrix and continue to change dynamically.",
            "The mechanical interaction between the seller and the extracellular matrix, and so is very important to understand all these molecular factors which regulate regulate the said important phenomena like cell adhesion and self proliferation."
        ],
        [
            "To study cell mechanics, there are several methods, and stretching him sell in a microfluidic channel and the micro pillars so that I didn't report here, and the optical tweezers and also atomic force microscopy, optical tweezers, and atomic force microscopy are capable to assess force in the range of few Pico Newton.",
            "Indeed, optical tweezers are more sensitive.",
            "But I would say that AFM is more versatile because can combine different different.",
            "Different.",
            "Types of measurements on a single are on a single machine."
        ],
        [
            "So and I mean Pico Newton forces are the one that act in this mechanobiology McKenna Mechanosensing mechanis transduction process.",
            "So the Atomic force microscopy, as many of you know, is relies on.",
            "Which is terminated with with a sharp tip, and in order to study mechanobiology, instead of using the sharp tip, we decided to use a bead micro micro bead which is glued on the on the cantilever with which we can try to understand the mechanical features of the cells mediating.",
            "Over larger areas, and in particular over nuclei."
        ],
        [
            "So the Atomic force microscopy has a cantilever and has an optical detector which laser shine light on the back of the cantilever is reflected on the photodiode, and this in this way we measure the bending of the cantilever when is approaching a sample, and there are forcing acting between the two.",
            "So we use here AFM in the modality of the forces spectroscopy.",
            "So we take the cantilever from a distance and no force acting between the.",
            "Keep in the cell, then we go into the contact.",
            "This is the blue color curve and then we start pressing on to the cell until we promote some deformation.",
            "Indentation of the cell itself.",
            "Then we get back and we the cantilever is mounted on a motor on it is electric motor.",
            "So we take back the cantilever with the motor and we measured the red curve which is the which is different from from the forward curve.",
            "Because when you detach the two that are in close contact, you measure some addition forces of which are responsible for this peak here.",
            "But from the analysis of these two curves we can understand the indentation property, how much these people bid is entering inside the cell, and the more is entering the software is the cell and so is a is a way to measure the young modulus.",
            "Of this cell.",
            "So if you have a, if you have a rigid bid so when you get in touch at this point doesn't doesn't move, and what moves is only the relative distance between the far end of the cantilevered.",
            "Here the far end of the cantilever and the surface.",
            "But if you penetrate with the tip into the cantilever, you have to take into account of this penetration and correlate the forts that you measure from the deflection of the cantilever.",
            "With the dis distance corrected by the indentation distance and this is what we do.",
            "Bye bye.",
            "Buy in analyzing the force distance curve that is this one measured with the model the person model in which we simulated the tip and the sample as two elastic sphere that are indenting the Terra entering one into the other.",
            "Of course, the indentation is relative to hundreds of hundreds of nanometers, so is well smaller, much smaller than the dimension of the entire sell and buy from this simulation we get to the.",
            "Elastic modulus of our Samp."
        ],
        [
            "So let's go to the Pacific Arctic Disease and this is a disease in which the hour tick valve, which is formed by these two leaf letter that continuously open and close instead, so doesn't perform this operation well anymore because there are calcification that reduced elasticity of the valve.",
            "So if you go into the compositional detail of the valve in the regular session of the valve.",
            "We see that the extracellular matrix of the valve is very complex and this is the complexity is one that assured the mechanical operation of the valve itself.",
            "Between these different kind of matrix of the fibrosis ponchos event regularised, which has formed with collagen and elastin and so on.",
            "There are these valvular interstitial cells which are responsible at mostly fibroblast responsible to.",
            "A maintainer, this extracellular matrix generated is access allowed matrix when it's when it's damaged somehow and the in small percentage.",
            "I also formed by my fibroblast in smooth muscle cell when the something gets wrong in the cell because of inflammation, mechanical cues and so on.",
            "The percentage of my fibroblast are increases and these are my fibroblast.",
            "Produce some.",
            "Produce a increase the addition and produce collagen fibers which are not ordered anymore and then lately can differentiate into osteoblast IK like cell producer.",
            "This mineralisation which at the end destroy the valve.",
            "So in order to mimic the extracellular matrix but only in.",
            "A relation to the to the.",
            "So I forgot to say that a healthy cell as a healthy valve has an extracellular matrix which is softer.",
            "Of course then I calcific about."
        ],
        [
            "And in order to understand what is driving this calcification, we produce some substrate which are not mimicking the morphology of this Tazelaar matrix, but mimic the mechanical properties.",
            "And we use the same polyacrylamide of different stiffness, different polymerization level, jealous or non structured, all the same.",
            "And we characterize this child.",
            "In terms of substance, deep Nessa with AFM and we obtain some gella which are which have different stiffness which goes from the value 1020 kilopascal which are the values of a typical healthy valve to 6050.",
            "Sixty kilopascal which are the values of a calcific valve."
        ],
        [
            "Then we grew some cell.",
            "Big silent, the valvular interstitial cell taken from a human bulb, in collaboration with the Institute of Ideological Monzino from Milan, which is an Institute of devoted to this cardiac disease, and they provided this human cell human bulb cell, and with them we studied with confocal microscopy.",
            "What's happening to this cell and immuno staining or what's happening to this cell?",
            "One growth on the different.",
            "On the difference services.",
            "So we did some morphometric analysis and we studied.",
            "You can see easily that when the matrix is very soft the cell maintain the.",
            "The seller may compact while when the matrix becomes rigid and this is the limit of Glasser, which should be similar to the high stiffness jail we produce in terms of rigidity.",
            "You have the spreading of the cell, but not only that, we mark the nuclei with adopci and then with the with the with the red we marked the actin fibers with followed in and then with the.",
            "It's overlapping here with Alpha SMA.",
            "We mapped the formation of stress fibers and what we can see is that not only the.",
            "Not only the dimension, the spreading increases a lot, but there is also a lot of localization and colocalization of the fibers when inside the cell.",
            "That is the stress fibers when when the substrate increases in."
        ],
        [
            "Fitness and also we measured the stiffness of the silent is correlated very well with the spreading.",
            "So the higher the stiffness of the substrate that much higher is the stiffness of the cell as well.",
            "And also we mark to hear the.",
            "An sorry there is.",
            "There is some mistake because the green here is not the Alpha SMA but green.",
            "Here is the vehicle in which is used to mark the focal adhesion and we see that the mode of spreading the more the.",
            "The stress, fiber form and the more focal addition form consistent inconsistency with the increase of my fibroblastic population in the case of hardware substrate."
        ],
        [
            "Then we mark those.",
            "So this Yep.",
            "And at the end we see that when on glass and on hard gel substrate, the app is translocated into the nucleus, contributing to increase the number to produce a higher number.",
            "Higher addition, higher number of local addition points, and this is what happens on."
        ],
        [
            "I I'm lost on this is what happens on homogeneous sample.",
            "Then also we perform similar studies on tissues.",
            "So we took human Arctic lab bulb layflat with calcification and this is staining of the presence of hydroxy Opatija appetite and nodules which of Uncle sustaining this is an immunological slice.",
            "India this is an optical image to which are superimposed the value measured or stiffness measured over the FM and we correlate very well the stiffness of their family with the Calcific partner.",
            "So these two slices are audition slices OK and they correlate very well.",
            "The stiffness with the formation of Pacific Calcific nodules and is not reported here.",
            "But we see that Yahoo translocates into the nucleus in correspondence.",
            "To this point, but not to this point, said so.",
            "This means that biomechanical properties can be very useful.",
            "Also, to assess the distribution of disease area in tissues, imagine to go for some biopsy of the cancer over tumor we can from the tube or from the biopsy.",
            "Identify different areas according to their stiffness.",
            "And even though the areas are small characterized, them also in terms.",
            "All but the expressed by biomarkers and therefore having we hope a more complete multiparametric analysis of also cancer.",
            "This is."
        ],
        [
            "Then I 5 minutes I will go to the last part of my talk in which we continued in the direction of studying mechanobiology in a beaker of valvular interstitial cell.",
            "I, but this time we used instead of vagina.",
            "We used a matrix which was made of carbon nanotubes."
        ],
        [
            "We chilled, saw nanostructured and resembled better the structure of the extracellular matrix, so we grew in vacuum with chemical vapor deposition matrix or two dimensional matrix of carbon nanotubes.",
            "Starting from Iran, film precursor on Silicon oxide surface, and then which catalyzed the dissociation of a city Lane.",
            "And then a liberates carbon what we obtain.",
            "We obtain from these upon thermal treatment we can regulate the size of desire on clusters on the surface and from each cluster we have a carbon nanotube growing at the end.",
            "We have a matter."
        ],
        [
            "Which can be 100 microns from few microns or 200 microns in height, and which which can be regulated in terms of density and which has the higher on a hidden at the bottom of the interface with the with the with the sample.",
            "Therefore this part of there is in the upper part of.",
            "That is only carbon and these totally known.",
            "And they dangerous for the cells, so so we can use as a matter to Grosse Ille on top of them.",
            "This matrix, as some voids of the order of a few microns, also resembles the bio scaffolds.",
            "The estelar matrix bio scaffold natural."
        ],
        [
            "Scaffolder this is some characterization of the nature of the nanotubes that we form that are mostly graphitic nanotubes and then can be pattern.",
            "And also this is important if you want to grow some.",
            "Neuronal process."
        ],
        [
            "Is inside them.",
            "But the most important thing is that we managed to grow on few silica short very short matter of of the nanotubes, which are transparent and in this way allow the combination of morphological so can be used in a non inverted optical microscope are suitable to be studied with fluorescence microscopy and atomic force microscopy as well.",
            "So this matrix you see a few microns are in height and have a stiffness.",
            "So which is of the order of 20 kilopascal, which is very similar to the stiffness reported for healthy bulbs.",
            "So."
        ],
        [
            "In this case we work that is a 2030 kilopascal.",
            "In this case we didn't work with the human valvular interstitial cell.",
            "But with porcelain, valvular, interstitial cell, and."
        ],
        [
            "We perform similar similar immunostaining measurements, and we observed that on.",
            "We observe that these are cell grown on ground on class and these are cell grown on carbon nanotubes and we can see that on carbon nanotubes the cells are smaller and resemble more the fibroblast.",
            "In fact, if we count the number of cell of one kind or the other kind.",
            "We see that the percentage of my fibroblastic very little, and this is exactly what happens on healthy cell and so."
        ],
        [
            "A good candidate for this kind of studies and then now we studied the mechanical properties, the stiffness of the cell dividing the cell in the different population, and while we observe that stiffness of the myofibroblast are and smooth, muscle cell is not much different when is measured on on on.",
            "On glass and carbon nanotube, but there is a good difference.",
            "A big difference for fibroblast and this difference in fibroblast is likely related to the fact that the fibroblast are very tiny and elongated cells and they have them any point of interaction with the matrix and."
        ],
        [
            "Into the matrix is.",
            "And also here we see that there is a huge number of focal addition fall into on fibroblast grown on carbon nanotube because the matrix has a single point of contact and this might fibroblast interact more with this single point of contact and so this is a peculiar effect that deserves other kind of studies."
        ],
        [
            "Is interesting and it's interesting to see that here we took the this big cells and with those Matic shock we broke up the cell on the surface surface of glass and carbon nanotubes.",
            "These are these are AFM images and you see that on nanotubes.",
            "So there is a lot of roughness with respect to the glass and there is a close contact between the carbon nanotubes.",
            "With the membrane and the disk."
        ],
        [
            "SEM images and you see that the nanotubes single nanotube are piercing the membrane and so establishing somehow a closer contact which contributes also to the recruitment information of the focal addition.",
            "So these are results."
        ],
        [
            "Tire still an ongoing an need the factor analysis, but the idea is that adding this kind of information, which is the mechanical behavior of salon on different substrate, is very.",
            "Is very relevant to understand those so many molecular properties of disease that can be used and mechanobiology mechanical properties can be used as a biomarker itself of for the specific disease.",
            "I just conclude the thanking all the members of the non innovation lab of Electra and specially for this work Luiza lost every enough accuracy.",
            "Nutella rogotin that is skinny and.",
            "All the fundings and you for the attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So today I I will tell you something about new activities that we are carrying out in our lab, indeed.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My lab is located in Trieste.",
                    "label": 0
                },
                {
                    "sent": "There at the Synchrotron Radiation Facility, the Italian Synchrotron Radiation Facility and IS laboratory which.",
                    "label": 0
                },
                {
                    "sent": "Wow.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "Sorry is Alberta tree in which we employ nanotechnology essentially mostly for nonmedical application.",
                    "label": 0
                },
                {
                    "sent": "But we are also dealing with some biophysics at the nanoscale, like we set it up some model membrane system to mimic interaction approach in relevant for neurodegenerative disease.",
                    "label": 0
                },
                {
                    "sent": "With this model systems.",
                    "label": 0
                },
                {
                    "sent": "But as I said most of our activity are.",
                    "label": 0
                },
                {
                    "sent": "Ann are devoted to generate some devices able to to measure biomarkers in diseases, and this specially in cancer.",
                    "label": 0
                },
                {
                    "sent": "Then also we took advantage of being in a synchrotron to build up Noble material based on nanoscale fabrication, microscale fabrication bio compatible carbon based which can be used for prosthetic application in.",
                    "label": 0
                },
                {
                    "sent": "Field says nurie injuries and cardiac valve disease.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So is a laboratory which is specialized in atomic force microscopy and application of atomic force microscopy.",
                    "label": 1
                },
                {
                    "sent": "In physiological environment, most of the we started with experience in imaging high resolution imaging cell cell imaging and biomolecular interaction at the single cell level.",
                    "label": 0
                },
                {
                    "sent": "But also we are dealing with the nanotechnology tool which is called nano grafting based on AFM.",
                    "label": 0
                },
                {
                    "sent": "In which we assemble a functional structure at the nanoscale in which we oriented specific macromolecules with control value of orientation, density and so on to be able to detect biomarker, inseli, Zeta and in blood.",
                    "label": 0
                },
                {
                    "sent": "So this is our let's say main core activity and we produce several devices for especially for biomarkers in cancer.",
                    "label": 0
                },
                {
                    "sent": "So we.",
                    "label": 0
                },
                {
                    "sent": "I don't know why it's.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, we conjugate protein mostly with the DNA tail and then we grafted with this nanolithography the complementary strand of the DNA tail to the surface and then these actors a bar code for the protein and also to drive the protein to the specific spot on the surface.",
                    "label": 0
                },
                {
                    "sent": "Then in this way we produce functional spot and this function as powder can be used also.",
                    "label": 0
                },
                {
                    "sent": "Two detector bio interaction and the detection is performed with the FM and we see the morphological changes and the height of the FM is also.",
                    "label": 0
                },
                {
                    "sent": "Somehow responding to the number of the bio recognition event that occurs on the functional spot we did sell.",
                    "label": 0
                },
                {
                    "sent": "Is it the studies and those show single cell or few cell secretome studies?",
                    "label": 0
                },
                {
                    "sent": "And then?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We moved to study the extracellular domain over 2.",
                    "label": 0
                },
                {
                    "sent": "Which is liberated and circulated in serum and which is a biomarker for her two positive her two positive cancer disease.",
                    "label": 0
                },
                {
                    "sent": "We demonstrated that with a special binder which are the BHHS.",
                    "label": 0
                },
                {
                    "sent": "So the the this small part of a camelid nanobody the variable part of the camelid nanobody we can set up a surface in which we regulate the density.",
                    "label": 0
                },
                {
                    "sent": "Of the of the.",
                    "label": 0
                },
                {
                    "sent": "Of the probe to optimal biobio recognition and.",
                    "label": 0
                },
                {
                    "sent": "And we reach the in this way, value of the detection of these extracellular domain two in serum which are of the order of 1000 picomolar and which are compatible with the cut off value commonly used in cleaning to assess positive breast cancer.",
                    "label": 1
                },
                {
                    "sent": "And I mean.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And scene, so we use a barcoding assay.",
                    "label": 0
                },
                {
                    "sent": "This is also very barcoding.",
                    "label": 0
                },
                {
                    "sent": "The same based on a short sequences of DNA.",
                    "label": 0
                },
                {
                    "sent": "We can easily produce multiplexing assay an monitor create different functional spot and monitor different protein at the same time, which is very useful for bear market attack.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But then there is a lot of controversial.",
                    "label": 0
                },
                {
                    "sent": "There are a lot of control controversial issues in the literature, because unfortunately these just to stay in the case of extracellular domain, over 2 circulating in the blood unfortunately doesn't correlate very well with the other parameter like meta static.",
                    "label": 0
                },
                {
                    "sent": "Static prediction of the specific tumor, and this is because we don't take into account all the variability all the possible phenotypes that I mean there are cells that could debate the chemotherapy and produce metastasis, and we lose this kind of cells in a global analysis.",
                    "label": 0
                },
                {
                    "sent": "So what we would like to do is to set the multiparametric analysis a single cell analysis.",
                    "label": 0
                },
                {
                    "sent": "In order to classify single cells after the their phenotype, which could be optically the fine, there could be mechanically defined because in in accounts are in many disease cell interaction with the extracellular environment mechanical cell interaction with extracellular environment are really important and then combine some molecular biomarker detection with correlated by Michael.",
                    "label": 0
                },
                {
                    "sent": "By molecular that molecular biomarker detection, with a different cell phenotype before we.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Recently embarked in a study of the cell biomechanic",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the reason why I tell you some recent results obtained in the context of.",
                    "label": 0
                },
                {
                    "sent": "About our tickle valve diseases.",
                    "label": 0
                },
                {
                    "sent": "Because you know, funds are driving your research in certain direction and this is what happened to us so.",
                    "label": 0
                },
                {
                    "sent": "Mechanobiology is related to the study about how do self perceived and mechanical steam loose and translate from the extracellular environment and translated through the cytoplasmic, converting it into a biocon biochemical into biochemical.",
                    "label": 1
                },
                {
                    "sent": "Signal, and so the there are important molecules alike the Uncle Factory Apple, which is the yes associated protein which is normally staying in the in the cytosol.",
                    "label": 1
                },
                {
                    "sent": "And when an can be mechanically activated and promoting its translocation into the new clothes and this translocation into the nucleus promo to some gene expression and production of specific.",
                    "label": 0
                },
                {
                    "sent": "Floating, which then modify the extracellular matrix and continue to change dynamically.",
                    "label": 0
                },
                {
                    "sent": "The mechanical interaction between the seller and the extracellular matrix, and so is very important to understand all these molecular factors which regulate regulate the said important phenomena like cell adhesion and self proliferation.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To study cell mechanics, there are several methods, and stretching him sell in a microfluidic channel and the micro pillars so that I didn't report here, and the optical tweezers and also atomic force microscopy, optical tweezers, and atomic force microscopy are capable to assess force in the range of few Pico Newton.",
                    "label": 1
                },
                {
                    "sent": "Indeed, optical tweezers are more sensitive.",
                    "label": 0
                },
                {
                    "sent": "But I would say that AFM is more versatile because can combine different different.",
                    "label": 0
                },
                {
                    "sent": "Different.",
                    "label": 0
                },
                {
                    "sent": "Types of measurements on a single are on a single machine.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So and I mean Pico Newton forces are the one that act in this mechanobiology McKenna Mechanosensing mechanis transduction process.",
                    "label": 0
                },
                {
                    "sent": "So the Atomic force microscopy, as many of you know, is relies on.",
                    "label": 0
                },
                {
                    "sent": "Which is terminated with with a sharp tip, and in order to study mechanobiology, instead of using the sharp tip, we decided to use a bead micro micro bead which is glued on the on the cantilever with which we can try to understand the mechanical features of the cells mediating.",
                    "label": 0
                },
                {
                    "sent": "Over larger areas, and in particular over nuclei.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the Atomic force microscopy has a cantilever and has an optical detector which laser shine light on the back of the cantilever is reflected on the photodiode, and this in this way we measure the bending of the cantilever when is approaching a sample, and there are forcing acting between the two.",
                    "label": 0
                },
                {
                    "sent": "So we use here AFM in the modality of the forces spectroscopy.",
                    "label": 0
                },
                {
                    "sent": "So we take the cantilever from a distance and no force acting between the.",
                    "label": 0
                },
                {
                    "sent": "Keep in the cell, then we go into the contact.",
                    "label": 0
                },
                {
                    "sent": "This is the blue color curve and then we start pressing on to the cell until we promote some deformation.",
                    "label": 0
                },
                {
                    "sent": "Indentation of the cell itself.",
                    "label": 0
                },
                {
                    "sent": "Then we get back and we the cantilever is mounted on a motor on it is electric motor.",
                    "label": 0
                },
                {
                    "sent": "So we take back the cantilever with the motor and we measured the red curve which is the which is different from from the forward curve.",
                    "label": 0
                },
                {
                    "sent": "Because when you detach the two that are in close contact, you measure some addition forces of which are responsible for this peak here.",
                    "label": 0
                },
                {
                    "sent": "But from the analysis of these two curves we can understand the indentation property, how much these people bid is entering inside the cell, and the more is entering the software is the cell and so is a is a way to measure the young modulus.",
                    "label": 0
                },
                {
                    "sent": "Of this cell.",
                    "label": 0
                },
                {
                    "sent": "So if you have a, if you have a rigid bid so when you get in touch at this point doesn't doesn't move, and what moves is only the relative distance between the far end of the cantilevered.",
                    "label": 0
                },
                {
                    "sent": "Here the far end of the cantilever and the surface.",
                    "label": 0
                },
                {
                    "sent": "But if you penetrate with the tip into the cantilever, you have to take into account of this penetration and correlate the forts that you measure from the deflection of the cantilever.",
                    "label": 0
                },
                {
                    "sent": "With the dis distance corrected by the indentation distance and this is what we do.",
                    "label": 0
                },
                {
                    "sent": "Bye bye.",
                    "label": 0
                },
                {
                    "sent": "Buy in analyzing the force distance curve that is this one measured with the model the person model in which we simulated the tip and the sample as two elastic sphere that are indenting the Terra entering one into the other.",
                    "label": 0
                },
                {
                    "sent": "Of course, the indentation is relative to hundreds of hundreds of nanometers, so is well smaller, much smaller than the dimension of the entire sell and buy from this simulation we get to the.",
                    "label": 0
                },
                {
                    "sent": "Elastic modulus of our Samp.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's go to the Pacific Arctic Disease and this is a disease in which the hour tick valve, which is formed by these two leaf letter that continuously open and close instead, so doesn't perform this operation well anymore because there are calcification that reduced elasticity of the valve.",
                    "label": 0
                },
                {
                    "sent": "So if you go into the compositional detail of the valve in the regular session of the valve.",
                    "label": 0
                },
                {
                    "sent": "We see that the extracellular matrix of the valve is very complex and this is the complexity is one that assured the mechanical operation of the valve itself.",
                    "label": 0
                },
                {
                    "sent": "Between these different kind of matrix of the fibrosis ponchos event regularised, which has formed with collagen and elastin and so on.",
                    "label": 0
                },
                {
                    "sent": "There are these valvular interstitial cells which are responsible at mostly fibroblast responsible to.",
                    "label": 0
                },
                {
                    "sent": "A maintainer, this extracellular matrix generated is access allowed matrix when it's when it's damaged somehow and the in small percentage.",
                    "label": 0
                },
                {
                    "sent": "I also formed by my fibroblast in smooth muscle cell when the something gets wrong in the cell because of inflammation, mechanical cues and so on.",
                    "label": 0
                },
                {
                    "sent": "The percentage of my fibroblast are increases and these are my fibroblast.",
                    "label": 0
                },
                {
                    "sent": "Produce some.",
                    "label": 0
                },
                {
                    "sent": "Produce a increase the addition and produce collagen fibers which are not ordered anymore and then lately can differentiate into osteoblast IK like cell producer.",
                    "label": 0
                },
                {
                    "sent": "This mineralisation which at the end destroy the valve.",
                    "label": 0
                },
                {
                    "sent": "So in order to mimic the extracellular matrix but only in.",
                    "label": 0
                },
                {
                    "sent": "A relation to the to the.",
                    "label": 0
                },
                {
                    "sent": "So I forgot to say that a healthy cell as a healthy valve has an extracellular matrix which is softer.",
                    "label": 0
                },
                {
                    "sent": "Of course then I calcific about.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in order to understand what is driving this calcification, we produce some substrate which are not mimicking the morphology of this Tazelaar matrix, but mimic the mechanical properties.",
                    "label": 0
                },
                {
                    "sent": "And we use the same polyacrylamide of different stiffness, different polymerization level, jealous or non structured, all the same.",
                    "label": 0
                },
                {
                    "sent": "And we characterize this child.",
                    "label": 0
                },
                {
                    "sent": "In terms of substance, deep Nessa with AFM and we obtain some gella which are which have different stiffness which goes from the value 1020 kilopascal which are the values of a typical healthy valve to 6050.",
                    "label": 0
                },
                {
                    "sent": "Sixty kilopascal which are the values of a calcific valve.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then we grew some cell.",
                    "label": 0
                },
                {
                    "sent": "Big silent, the valvular interstitial cell taken from a human bulb, in collaboration with the Institute of Ideological Monzino from Milan, which is an Institute of devoted to this cardiac disease, and they provided this human cell human bulb cell, and with them we studied with confocal microscopy.",
                    "label": 0
                },
                {
                    "sent": "What's happening to this cell and immuno staining or what's happening to this cell?",
                    "label": 0
                },
                {
                    "sent": "One growth on the different.",
                    "label": 0
                },
                {
                    "sent": "On the difference services.",
                    "label": 0
                },
                {
                    "sent": "So we did some morphometric analysis and we studied.",
                    "label": 0
                },
                {
                    "sent": "You can see easily that when the matrix is very soft the cell maintain the.",
                    "label": 0
                },
                {
                    "sent": "The seller may compact while when the matrix becomes rigid and this is the limit of Glasser, which should be similar to the high stiffness jail we produce in terms of rigidity.",
                    "label": 0
                },
                {
                    "sent": "You have the spreading of the cell, but not only that, we mark the nuclei with adopci and then with the with the with the red we marked the actin fibers with followed in and then with the.",
                    "label": 0
                },
                {
                    "sent": "It's overlapping here with Alpha SMA.",
                    "label": 0
                },
                {
                    "sent": "We mapped the formation of stress fibers and what we can see is that not only the.",
                    "label": 0
                },
                {
                    "sent": "Not only the dimension, the spreading increases a lot, but there is also a lot of localization and colocalization of the fibers when inside the cell.",
                    "label": 1
                },
                {
                    "sent": "That is the stress fibers when when the substrate increases in.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Fitness and also we measured the stiffness of the silent is correlated very well with the spreading.",
                    "label": 1
                },
                {
                    "sent": "So the higher the stiffness of the substrate that much higher is the stiffness of the cell as well.",
                    "label": 0
                },
                {
                    "sent": "And also we mark to hear the.",
                    "label": 0
                },
                {
                    "sent": "An sorry there is.",
                    "label": 0
                },
                {
                    "sent": "There is some mistake because the green here is not the Alpha SMA but green.",
                    "label": 0
                },
                {
                    "sent": "Here is the vehicle in which is used to mark the focal adhesion and we see that the mode of spreading the more the.",
                    "label": 0
                },
                {
                    "sent": "The stress, fiber form and the more focal addition form consistent inconsistency with the increase of my fibroblastic population in the case of hardware substrate.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then we mark those.",
                    "label": 0
                },
                {
                    "sent": "So this Yep.",
                    "label": 0
                },
                {
                    "sent": "And at the end we see that when on glass and on hard gel substrate, the app is translocated into the nucleus, contributing to increase the number to produce a higher number.",
                    "label": 0
                },
                {
                    "sent": "Higher addition, higher number of local addition points, and this is what happens on.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I I'm lost on this is what happens on homogeneous sample.",
                    "label": 0
                },
                {
                    "sent": "Then also we perform similar studies on tissues.",
                    "label": 0
                },
                {
                    "sent": "So we took human Arctic lab bulb layflat with calcification and this is staining of the presence of hydroxy Opatija appetite and nodules which of Uncle sustaining this is an immunological slice.",
                    "label": 0
                },
                {
                    "sent": "India this is an optical image to which are superimposed the value measured or stiffness measured over the FM and we correlate very well the stiffness of their family with the Calcific partner.",
                    "label": 0
                },
                {
                    "sent": "So these two slices are audition slices OK and they correlate very well.",
                    "label": 0
                },
                {
                    "sent": "The stiffness with the formation of Pacific Calcific nodules and is not reported here.",
                    "label": 0
                },
                {
                    "sent": "But we see that Yahoo translocates into the nucleus in correspondence.",
                    "label": 0
                },
                {
                    "sent": "To this point, but not to this point, said so.",
                    "label": 0
                },
                {
                    "sent": "This means that biomechanical properties can be very useful.",
                    "label": 0
                },
                {
                    "sent": "Also, to assess the distribution of disease area in tissues, imagine to go for some biopsy of the cancer over tumor we can from the tube or from the biopsy.",
                    "label": 0
                },
                {
                    "sent": "Identify different areas according to their stiffness.",
                    "label": 0
                },
                {
                    "sent": "And even though the areas are small characterized, them also in terms.",
                    "label": 0
                },
                {
                    "sent": "All but the expressed by biomarkers and therefore having we hope a more complete multiparametric analysis of also cancer.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then I 5 minutes I will go to the last part of my talk in which we continued in the direction of studying mechanobiology in a beaker of valvular interstitial cell.",
                    "label": 0
                },
                {
                    "sent": "I, but this time we used instead of vagina.",
                    "label": 0
                },
                {
                    "sent": "We used a matrix which was made of carbon nanotubes.",
                    "label": 1
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We chilled, saw nanostructured and resembled better the structure of the extracellular matrix, so we grew in vacuum with chemical vapor deposition matrix or two dimensional matrix of carbon nanotubes.",
                    "label": 0
                },
                {
                    "sent": "Starting from Iran, film precursor on Silicon oxide surface, and then which catalyzed the dissociation of a city Lane.",
                    "label": 0
                },
                {
                    "sent": "And then a liberates carbon what we obtain.",
                    "label": 0
                },
                {
                    "sent": "We obtain from these upon thermal treatment we can regulate the size of desire on clusters on the surface and from each cluster we have a carbon nanotube growing at the end.",
                    "label": 0
                },
                {
                    "sent": "We have a matter.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which can be 100 microns from few microns or 200 microns in height, and which which can be regulated in terms of density and which has the higher on a hidden at the bottom of the interface with the with the with the sample.",
                    "label": 0
                },
                {
                    "sent": "Therefore this part of there is in the upper part of.",
                    "label": 0
                },
                {
                    "sent": "That is only carbon and these totally known.",
                    "label": 0
                },
                {
                    "sent": "And they dangerous for the cells, so so we can use as a matter to Grosse Ille on top of them.",
                    "label": 0
                },
                {
                    "sent": "This matrix, as some voids of the order of a few microns, also resembles the bio scaffolds.",
                    "label": 0
                },
                {
                    "sent": "The estelar matrix bio scaffold natural.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Scaffolder this is some characterization of the nature of the nanotubes that we form that are mostly graphitic nanotubes and then can be pattern.",
                    "label": 0
                },
                {
                    "sent": "And also this is important if you want to grow some.",
                    "label": 0
                },
                {
                    "sent": "Neuronal process.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is inside them.",
                    "label": 0
                },
                {
                    "sent": "But the most important thing is that we managed to grow on few silica short very short matter of of the nanotubes, which are transparent and in this way allow the combination of morphological so can be used in a non inverted optical microscope are suitable to be studied with fluorescence microscopy and atomic force microscopy as well.",
                    "label": 0
                },
                {
                    "sent": "So this matrix you see a few microns are in height and have a stiffness.",
                    "label": 0
                },
                {
                    "sent": "So which is of the order of 20 kilopascal, which is very similar to the stiffness reported for healthy bulbs.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this case we work that is a 2030 kilopascal.",
                    "label": 0
                },
                {
                    "sent": "In this case we didn't work with the human valvular interstitial cell.",
                    "label": 0
                },
                {
                    "sent": "But with porcelain, valvular, interstitial cell, and.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We perform similar similar immunostaining measurements, and we observed that on.",
                    "label": 0
                },
                {
                    "sent": "We observe that these are cell grown on ground on class and these are cell grown on carbon nanotubes and we can see that on carbon nanotubes the cells are smaller and resemble more the fibroblast.",
                    "label": 0
                },
                {
                    "sent": "In fact, if we count the number of cell of one kind or the other kind.",
                    "label": 0
                },
                {
                    "sent": "We see that the percentage of my fibroblastic very little, and this is exactly what happens on healthy cell and so.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A good candidate for this kind of studies and then now we studied the mechanical properties, the stiffness of the cell dividing the cell in the different population, and while we observe that stiffness of the myofibroblast are and smooth, muscle cell is not much different when is measured on on on.",
                    "label": 1
                },
                {
                    "sent": "On glass and carbon nanotube, but there is a good difference.",
                    "label": 0
                },
                {
                    "sent": "A big difference for fibroblast and this difference in fibroblast is likely related to the fact that the fibroblast are very tiny and elongated cells and they have them any point of interaction with the matrix and.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Into the matrix is.",
                    "label": 0
                },
                {
                    "sent": "And also here we see that there is a huge number of focal addition fall into on fibroblast grown on carbon nanotube because the matrix has a single point of contact and this might fibroblast interact more with this single point of contact and so this is a peculiar effect that deserves other kind of studies.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is interesting and it's interesting to see that here we took the this big cells and with those Matic shock we broke up the cell on the surface surface of glass and carbon nanotubes.",
                    "label": 0
                },
                {
                    "sent": "These are these are AFM images and you see that on nanotubes.",
                    "label": 0
                },
                {
                    "sent": "So there is a lot of roughness with respect to the glass and there is a close contact between the carbon nanotubes.",
                    "label": 0
                },
                {
                    "sent": "With the membrane and the disk.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "SEM images and you see that the nanotubes single nanotube are piercing the membrane and so establishing somehow a closer contact which contributes also to the recruitment information of the focal addition.",
                    "label": 0
                },
                {
                    "sent": "So these are results.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tire still an ongoing an need the factor analysis, but the idea is that adding this kind of information, which is the mechanical behavior of salon on different substrate, is very.",
                    "label": 0
                },
                {
                    "sent": "Is very relevant to understand those so many molecular properties of disease that can be used and mechanobiology mechanical properties can be used as a biomarker itself of for the specific disease.",
                    "label": 0
                },
                {
                    "sent": "I just conclude the thanking all the members of the non innovation lab of Electra and specially for this work Luiza lost every enough accuracy.",
                    "label": 0
                },
                {
                    "sent": "Nutella rogotin that is skinny and.",
                    "label": 0
                },
                {
                    "sent": "All the fundings and you for the attention.",
                    "label": 0
                }
            ]
        }
    }
}