{
    "id": "4srumryet5cwr2tapnviuqqcqugc3vod",
    "title": "Evaluating Photo Aesthetics Using Machine Learning",
    "info": {
        "author": [
            "Domen Pogačnik, Faculty of Computer and Information Science, University of Ljubljana"
        ],
        "published": "Nov. 16, 2012",
        "recorded": "October 2012",
        "category": [
            "Top->Computer Science->Machine Learning",
            "Top->Computer Science->Image Analysis"
        ]
    },
    "url": "http://videolectures.net/is2012_pogacnik_photo_aesthetics/",
    "segmentation": [
        [
            "I will be presenting this paper about evaluating photo aesthetics using machine learning.",
            "So, OK, let's begin."
        ],
        [
            "So first I would like to tell you something about the motivation for this research.",
            "With the, with the advent of the digital digital photography, the cost of 1 photography dropped significantly.",
            "And manipulation of these photos is really is really that easy.",
            "So the volume of the photos taken increased accordingly.",
            "So today social networks are the leaders are the most have the largest database photo databases and the larger sense is of course Facebook.",
            "Which has 300 million photo uploads per day on average.",
            "This is data from August 2012.",
            "So and by January 2011 it had night billions photos, so I hope I convince you that this is a problem worth solving.",
            "And OK, let's go forward."
        ],
        [
            "If I can demonstrate you this purpose of the research graphically, if you look at the at the left side and the right side, you can see there is clearly the difference between visual appeal of this image is most of the people would agree that the right the right images are more appealing that the left one.",
            "So OK.",
            "Although some of the art.",
            "Our pictures are like the one the black one can be sold for.",
            "Amazing amount of money yeah yeah.",
            "The artistic photography is a bit different, so that's why I said that most of the people would agree.",
            "So like 90% of the people would agree.",
            "Shady characters, yeah.",
            "Some shady characters yeah.",
            "5 million for this kind of pictures.",
            "So OK."
        ],
        [
            "Now you have a brief idea of what we're trying that we try to do, so I would like to first before we get into our proposed system and our features.",
            "I would like to tell you something about characteristic of a high quality photo and it's of course there.",
            "There are many, many these characteristics and I'm not able to present you.",
            "Also, I will limit myself to only the three which we thought they are the most important one and the first one is simplicity.",
            "Simplicity in the terms that you can, you can distinguish the subject.",
            "You can define the clear center of interest and this can be achieved if the photo has little or no clutter.",
            "So for example, if you look at the left left image, you can clearly see the subject of a photography and this is due to the blurred background of the photo and for if you look at the right one.",
            "You can't even say what's the subject of this photography.",
            "It's just a lot of objects.",
            "OK."
        ],
        [
            "And the second one.",
            "Of course, this composition.",
            "Most of the high quality photos follows one of the established rule rules of composition.",
            "Maybe rule of thirds Golden section or abutment or some other rule.",
            "And another example is showed below.",
            "So here you have two pictures of the same model and one follows the rule of thirds of the right one, then the left one doesn't and again most of the people would agree that the right one.",
            "Is more is more visually appealing?",
            "Yeah, by the book."
        ],
        [
            "So the third one is color selection, cause experience photo grapher's usually take photos and unusual lighting condition.",
            "For example, if you look at the images below, you can see two images of Golden Bridge Golden Bridge in San Francisco and the first one is taken at the sunset.",
            "The second one is.",
            "Golden Gate I'm sorry yeah yeah.",
            "Yeah, and the second one is taken at the daylight at normal daylight conditions.",
            "And again people would say that the left one is more interesting and therefore more visually appealing.",
            "So and also color selection is considered as a design technique and the good good high quality photographs usually follow some of the established color scheme like analogue scheme or complementary scheme.",
            "And so on."
        ],
        [
            "So let me tell you how do we solve how we approach to solve this problem.",
            "So first we try to recognize the characteristics of high quality photos, which I was telling you before and we try to transform this characteristic into calculable features.",
            "An when we when we got this calculable features we use them as an input to machine learning algorithms and by that we try to construct a model which is able to distinguish between low and high quality.",
            "Photographs and it's worth to note that our our system dependent heavily on subject identification.",
            "So for we try to and we looked at the photo first we tried to say oh that is our subject.",
            "So and then we compare it to the rest of the image, an overall we define 74 features so we can roughly divide these features into color selection, composition, simplicity, individual complexity.",
            "This there are too many features so I won't be able to list them all, so I will just give you a brief overview at what we looked at and."
        ],
        [
            "The first one I'm sorry.",
            "OK, just OK. And the first one was color selection.",
            "We looked at, for example, at unique hues used in the in the photo.",
            "Accused pick things like average saturation and brightness.",
            "And of course we also look at the color schemes or if the colors used in the photos follow some of the established color scheme.",
            "Awesome.",
            "You said that you use.",
            "Histogram on 30 bins and how you transform this into features.",
            "Yeah, we use some thresholding and with distress everything that's that's about distress.",
            "Hold the use of the distinct color, for example, yeah.",
            "As."
        ],
        [
            "So the aspect of the photo that we look deeply was composition will analyze different compositional rules like rule of thirds, Golden section and Robotman, and for that we use different computational models there are.",
            "There is a graphical demonstration of the two of these models.",
            "I won't go into the detail just now.",
            "So let's move on so."
        ],
        [
            "So the service automatically right?",
            "Yeah, yeah.",
            "So the third one, the third category, was simplicity.",
            "There was some features that compare some attributes of the subject to the attributes of the background, and by that we try to implicitly measure the simplicity of the photo.",
            "So and the last one, what we looked at was visual complexity.",
            "So we try to analyze visual complexity by analyzing image edges, an also with some help with image compression algorithms.",
            "So I will tell you more about that in the following slides.",
            "So."
        ],
        [
            "How we test our our proposed system onto data set.",
            "First data set was Flickr was was obtained from Flickr and we crawled recently uploaded category cause we wanted to work on the common pictures.",
            "But we realized that this pictures are poor quality.",
            "So we decided to komplement this pictures with pics of the day category.",
            "So this this pictures was was later evaluated by by experienced photographers who evaluated things like overall appeal oils and also color scheme composition and some other things.",
            "And what I need to note here that here the subject was identified manually by help with help of experienced photographers and it was hard to get a large data set so.",
            "In the end we got 258 photos which were at which each of this photo was evaluated by at least three people.",
            "So here are some examples of the bed of the worst rated photo photos and some examples by some examples of high high rated photos.",
            "So again, some people would say that this right ones.",
            "There are a bit too sketchy or.",
            "They are not really good ones, but the majority of the people agree that these are the high quality ones.",
            "Yeah, experienced photographer, so yeah.",
            "Photos were combined with some bad ones from Flickr and some of the boat.",
            "The boat funds was for us from from.",
            "I'm sorry yeah, but different categories.",
            "The first one was from recently uploaded category so just the random yeah so just the random pictures and the other ones were selected by editors as high quality ones so.",
            "Yeah."
        ],
        [
            "So what we did for the first experiment is we we took our old score, which was the three class attributes with values low, average and high, and then we excluded photos rated as average.",
            "So in the end we got 114 photos.",
            "And with South Rim classifier we use 10 fold cross validation and when we use 28 best ranked features by Rally FF metric, we got 95% classification accuracy.",
            "So this data set was a bit was a bit small so I would like to know that even if we take 10 best features ranked by really F metric we still get.",
            "9091% classification accuracy.",
            "Feature selection if I mean that's being could do this for you, or probably even better than I wanted.",
            "We wanted to use us as little features as we can, so and because of the low because of the small datasets, we didn't want to use too many features because the system would overfit.",
            "So that was our concern."
        ],
        [
            "As I said, obtaining larger data set was was proved to be hard cause there was time consuming manual subject in notification.",
            "So for the second data set we choose, we choose just the photos of portraits where we can identify this.",
            "This subject with face detector algorithm.",
            "So.",
            "So this was rated by deeply challenged users.",
            "I'm very sorry about that.",
            "I mean, this is the writing of the photo, not of the person.",
            "What?",
            "So.",
            "This is by dipping challenge users so.",
            "Yeah, so we got this photo from different challenge and these photos were part of photographic contest and were already evaluated by deeply challenged users and each photo was evaluated at least 100 times by at least 100 people.",
            "So yeah, this is example of best photos.",
            "Examples of.",
            "Depends who you ask I guess.",
            "Defense could ask, I guess.",
            "So.",
            "I know, right?",
            "Yeah, it looks."
        ],
        [
            "So yeah, this photos were rated with numeric range from one to ten, 5.5 for the average and then we decided to label all these photos that were rated with average score less than 4.5 as low quality photos and all the photos that has been rated by more than 6.5 as a high quality ones.",
            "So in the end we got 1048 photos which I already told was evaluated by at least 100.",
            "Parsons and.",
            "In that in this time we use the best 41 features by really F metric and with using SVM classifier with 10 fold cross validation technique we got 75% classification accuracy.",
            "So."
        ],
        [
            "We weren't really satisfied with just having our model as a black box, so we try to interpret this results and what we find out was, for example, we looked at the unique use used in the photos and from from photographic theory we can confirm that.",
            "You know that high quality photos has, although if they look colorful and vibrant they use little little unique hues.",
            "So we realize that there's more than 4 four unique users are not preferred.",
            "So up to four and.",
            "So and with Steve three was the median.",
            "We also looked at aspect ratio becausw experience, photo photo grapher's usually corrupt their photos to improve framing.",
            "But what we can observe from data that extreme extreme aspect ratio are not are not preferred.",
            "So actually the interval from zero Point 8 to 1.2 is preferred with.",
            "With one's a median exactly one is a medium."
        ],
        [
            "We looked as I said, we looked at the composition quite a roughly and what we find out that this compositional rules of like rule of thirds and Golden section are very influential.",
            "And for example, this boat this rules.",
            "Divide the fourth of two vertical to vertical and two horizontal lines.",
            "As I mean, just just this one is visible.",
            "This the other ones, the right so it's harder to see.",
            "And what we find out that the subject centered distance to the nearest vertical line is the most influential feature.",
            "So in this example, if we say that this.",
            "This person is a subject of a photography.",
            "We could say that the distance to this line, the red line, is the most influential is the best indicator of the quality of the photo.",
            "So from from the data from the DP challenge data set, we measured the distances up to 11% of total wider preferred.",
            "So up to 11.",
            "No more so.",
            "For the Golden section, this value was 15%.",
            "You said so.",
            "This attribute was best out of all no no no, not not best of the world I mean.",
            "I mean, it was influential.",
            "It was not the best.",
            "I mean this.",
            "The influence we mostly we measured the influence by really FF metric and it did vary a bit through the through the data sets you know different different features performed.",
            "Some of the features were consistent, some of them were not.",
            "So I only want to tell you about the features that perform consistently through the boat datasets so."
        ],
        [
            "K We also looked at the the subject distance from image frame borders, so that's big cause in the photographic theory.",
            "It's not.",
            "They say it's not desirable for a subject to be placed at near to be placed near image borders and from the deeply challenge data set we observe that even that values more than 3838% from the left borders are preferred.",
            "38% of the total white.",
            "With so and this interval for the bottom.",
            "But this actually this actually varies through the data set, so yeah.",
            "Depends on the data set but but the feature itself turned out to be to be influential on both datasets.",
            "We also looked at the detected image as a.",
            "We realized that higher number of detected image edges turned out to indicate more appealing photo, which we argue that the number the higher the number, the easier is to distinguish the subject from the photography.",
            "And also it can mean that the photo is more visually complex, which we will, which I will tell you in the following slides.",
            "And when we when we got this image edges, we also looked at special distribution of this.",
            "Edges will look how how we measure the distance from image center and from borders and with different computational models.",
            "And this special distribution turned out to be very influential.",
            "On both datasets."
        ],
        [
            "And as I told you before, we also looked at visual complexity.",
            "We can also say that the higher number detected image edges also means that the photo is more visually complex and by that, and when we were done analyzing visual complexity, we also looked at some very simple feature that's that we just take the size of the compressed image file size, which if we if we look at the informational theory, if we use compression algorithms with stripped.",
            "We strip out the redundancy and we only get the information.",
            "At least that's the idea.",
            "So we try to compress the compressed the image with JPEG and we looked at the file size so.",
            "Yeah, sound to 5% quality 75 here and yeah and one more important things that the mean.",
            "Domain value of the number of the pixels was 340 with low flow variance, so I think so we observe that 100 to one kilobyte is the images that have more than.",
            "That in size are more preferred.",
            "So this is the example of the one the left one is less visually complex and the right one.",
            "I think you can see it's more complex."
        ],
        [
            "So in conclusion, in conclusion, I can just repeat the.",
            "We recognize the the characteristics of high quality and turned them into calculable features.",
            "We use these features as an input into machine learning algorithms and that's how we constructed constructed the model which is able to distinguish between low and high quality photos.",
            "So we got 95% for Flickr datasets 75, four four DP challenge which was more.",
            "I must say it was.",
            "More challenging data set because the photos were more artistic.",
            "Or we're nearing artistic, so in the future work we should look at the we should distinguish between types of photography 'cause the landscape photography is quite different from portraits.",
            "So we can define more more specific features for the types of the photographie.",
            "And we also need to.",
            "We also need to go into automatic subject recognition, not just for portraits but for common.",
            "Fiction so.",
            "OK, that's that's all."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will be presenting this paper about evaluating photo aesthetics using machine learning.",
                    "label": 0
                },
                {
                    "sent": "So, OK, let's begin.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So first I would like to tell you something about the motivation for this research.",
                    "label": 0
                },
                {
                    "sent": "With the, with the advent of the digital digital photography, the cost of 1 photography dropped significantly.",
                    "label": 0
                },
                {
                    "sent": "And manipulation of these photos is really is really that easy.",
                    "label": 0
                },
                {
                    "sent": "So the volume of the photos taken increased accordingly.",
                    "label": 0
                },
                {
                    "sent": "So today social networks are the leaders are the most have the largest database photo databases and the larger sense is of course Facebook.",
                    "label": 0
                },
                {
                    "sent": "Which has 300 million photo uploads per day on average.",
                    "label": 1
                },
                {
                    "sent": "This is data from August 2012.",
                    "label": 0
                },
                {
                    "sent": "So and by January 2011 it had night billions photos, so I hope I convince you that this is a problem worth solving.",
                    "label": 0
                },
                {
                    "sent": "And OK, let's go forward.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If I can demonstrate you this purpose of the research graphically, if you look at the at the left side and the right side, you can see there is clearly the difference between visual appeal of this image is most of the people would agree that the right the right images are more appealing that the left one.",
                    "label": 0
                },
                {
                    "sent": "So OK.",
                    "label": 0
                },
                {
                    "sent": "Although some of the art.",
                    "label": 0
                },
                {
                    "sent": "Our pictures are like the one the black one can be sold for.",
                    "label": 0
                },
                {
                    "sent": "Amazing amount of money yeah yeah.",
                    "label": 0
                },
                {
                    "sent": "The artistic photography is a bit different, so that's why I said that most of the people would agree.",
                    "label": 0
                },
                {
                    "sent": "So like 90% of the people would agree.",
                    "label": 0
                },
                {
                    "sent": "Shady characters, yeah.",
                    "label": 0
                },
                {
                    "sent": "Some shady characters yeah.",
                    "label": 0
                },
                {
                    "sent": "5 million for this kind of pictures.",
                    "label": 0
                },
                {
                    "sent": "So OK.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now you have a brief idea of what we're trying that we try to do, so I would like to first before we get into our proposed system and our features.",
                    "label": 0
                },
                {
                    "sent": "I would like to tell you something about characteristic of a high quality photo and it's of course there.",
                    "label": 0
                },
                {
                    "sent": "There are many, many these characteristics and I'm not able to present you.",
                    "label": 0
                },
                {
                    "sent": "Also, I will limit myself to only the three which we thought they are the most important one and the first one is simplicity.",
                    "label": 0
                },
                {
                    "sent": "Simplicity in the terms that you can, you can distinguish the subject.",
                    "label": 0
                },
                {
                    "sent": "You can define the clear center of interest and this can be achieved if the photo has little or no clutter.",
                    "label": 1
                },
                {
                    "sent": "So for example, if you look at the left left image, you can clearly see the subject of a photography and this is due to the blurred background of the photo and for if you look at the right one.",
                    "label": 0
                },
                {
                    "sent": "You can't even say what's the subject of this photography.",
                    "label": 0
                },
                {
                    "sent": "It's just a lot of objects.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the second one.",
                    "label": 0
                },
                {
                    "sent": "Of course, this composition.",
                    "label": 0
                },
                {
                    "sent": "Most of the high quality photos follows one of the established rule rules of composition.",
                    "label": 0
                },
                {
                    "sent": "Maybe rule of thirds Golden section or abutment or some other rule.",
                    "label": 1
                },
                {
                    "sent": "And another example is showed below.",
                    "label": 0
                },
                {
                    "sent": "So here you have two pictures of the same model and one follows the rule of thirds of the right one, then the left one doesn't and again most of the people would agree that the right one.",
                    "label": 0
                },
                {
                    "sent": "Is more is more visually appealing?",
                    "label": 0
                },
                {
                    "sent": "Yeah, by the book.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the third one is color selection, cause experience photo grapher's usually take photos and unusual lighting condition.",
                    "label": 1
                },
                {
                    "sent": "For example, if you look at the images below, you can see two images of Golden Bridge Golden Bridge in San Francisco and the first one is taken at the sunset.",
                    "label": 0
                },
                {
                    "sent": "The second one is.",
                    "label": 0
                },
                {
                    "sent": "Golden Gate I'm sorry yeah yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and the second one is taken at the daylight at normal daylight conditions.",
                    "label": 0
                },
                {
                    "sent": "And again people would say that the left one is more interesting and therefore more visually appealing.",
                    "label": 0
                },
                {
                    "sent": "So and also color selection is considered as a design technique and the good good high quality photographs usually follow some of the established color scheme like analogue scheme or complementary scheme.",
                    "label": 0
                },
                {
                    "sent": "And so on.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me tell you how do we solve how we approach to solve this problem.",
                    "label": 0
                },
                {
                    "sent": "So first we try to recognize the characteristics of high quality photos, which I was telling you before and we try to transform this characteristic into calculable features.",
                    "label": 0
                },
                {
                    "sent": "An when we when we got this calculable features we use them as an input to machine learning algorithms and by that we try to construct a model which is able to distinguish between low and high quality.",
                    "label": 1
                },
                {
                    "sent": "Photographs and it's worth to note that our our system dependent heavily on subject identification.",
                    "label": 0
                },
                {
                    "sent": "So for we try to and we looked at the photo first we tried to say oh that is our subject.",
                    "label": 1
                },
                {
                    "sent": "So and then we compare it to the rest of the image, an overall we define 74 features so we can roughly divide these features into color selection, composition, simplicity, individual complexity.",
                    "label": 0
                },
                {
                    "sent": "This there are too many features so I won't be able to list them all, so I will just give you a brief overview at what we looked at and.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The first one I'm sorry.",
                    "label": 0
                },
                {
                    "sent": "OK, just OK. And the first one was color selection.",
                    "label": 1
                },
                {
                    "sent": "We looked at, for example, at unique hues used in the in the photo.",
                    "label": 0
                },
                {
                    "sent": "Accused pick things like average saturation and brightness.",
                    "label": 0
                },
                {
                    "sent": "And of course we also look at the color schemes or if the colors used in the photos follow some of the established color scheme.",
                    "label": 0
                },
                {
                    "sent": "Awesome.",
                    "label": 0
                },
                {
                    "sent": "You said that you use.",
                    "label": 0
                },
                {
                    "sent": "Histogram on 30 bins and how you transform this into features.",
                    "label": 1
                },
                {
                    "sent": "Yeah, we use some thresholding and with distress everything that's that's about distress.",
                    "label": 0
                },
                {
                    "sent": "Hold the use of the distinct color, for example, yeah.",
                    "label": 0
                },
                {
                    "sent": "As.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the aspect of the photo that we look deeply was composition will analyze different compositional rules like rule of thirds, Golden section and Robotman, and for that we use different computational models there are.",
                    "label": 1
                },
                {
                    "sent": "There is a graphical demonstration of the two of these models.",
                    "label": 0
                },
                {
                    "sent": "I won't go into the detail just now.",
                    "label": 0
                },
                {
                    "sent": "So let's move on so.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the service automatically right?",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah.",
                    "label": 0
                },
                {
                    "sent": "So the third one, the third category, was simplicity.",
                    "label": 0
                },
                {
                    "sent": "There was some features that compare some attributes of the subject to the attributes of the background, and by that we try to implicitly measure the simplicity of the photo.",
                    "label": 0
                },
                {
                    "sent": "So and the last one, what we looked at was visual complexity.",
                    "label": 0
                },
                {
                    "sent": "So we try to analyze visual complexity by analyzing image edges, an also with some help with image compression algorithms.",
                    "label": 1
                },
                {
                    "sent": "So I will tell you more about that in the following slides.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How we test our our proposed system onto data set.",
                    "label": 0
                },
                {
                    "sent": "First data set was Flickr was was obtained from Flickr and we crawled recently uploaded category cause we wanted to work on the common pictures.",
                    "label": 0
                },
                {
                    "sent": "But we realized that this pictures are poor quality.",
                    "label": 0
                },
                {
                    "sent": "So we decided to komplement this pictures with pics of the day category.",
                    "label": 1
                },
                {
                    "sent": "So this this pictures was was later evaluated by by experienced photographers who evaluated things like overall appeal oils and also color scheme composition and some other things.",
                    "label": 1
                },
                {
                    "sent": "And what I need to note here that here the subject was identified manually by help with help of experienced photographers and it was hard to get a large data set so.",
                    "label": 0
                },
                {
                    "sent": "In the end we got 258 photos which were at which each of this photo was evaluated by at least three people.",
                    "label": 0
                },
                {
                    "sent": "So here are some examples of the bed of the worst rated photo photos and some examples by some examples of high high rated photos.",
                    "label": 0
                },
                {
                    "sent": "So again, some people would say that this right ones.",
                    "label": 0
                },
                {
                    "sent": "There are a bit too sketchy or.",
                    "label": 0
                },
                {
                    "sent": "They are not really good ones, but the majority of the people agree that these are the high quality ones.",
                    "label": 0
                },
                {
                    "sent": "Yeah, experienced photographer, so yeah.",
                    "label": 0
                },
                {
                    "sent": "Photos were combined with some bad ones from Flickr and some of the boat.",
                    "label": 0
                },
                {
                    "sent": "The boat funds was for us from from.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry yeah, but different categories.",
                    "label": 0
                },
                {
                    "sent": "The first one was from recently uploaded category so just the random yeah so just the random pictures and the other ones were selected by editors as high quality ones so.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what we did for the first experiment is we we took our old score, which was the three class attributes with values low, average and high, and then we excluded photos rated as average.",
                    "label": 1
                },
                {
                    "sent": "So in the end we got 114 photos.",
                    "label": 0
                },
                {
                    "sent": "And with South Rim classifier we use 10 fold cross validation and when we use 28 best ranked features by Rally FF metric, we got 95% classification accuracy.",
                    "label": 0
                },
                {
                    "sent": "So this data set was a bit was a bit small so I would like to know that even if we take 10 best features ranked by really F metric we still get.",
                    "label": 0
                },
                {
                    "sent": "9091% classification accuracy.",
                    "label": 0
                },
                {
                    "sent": "Feature selection if I mean that's being could do this for you, or probably even better than I wanted.",
                    "label": 0
                },
                {
                    "sent": "We wanted to use us as little features as we can, so and because of the low because of the small datasets, we didn't want to use too many features because the system would overfit.",
                    "label": 0
                },
                {
                    "sent": "So that was our concern.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As I said, obtaining larger data set was was proved to be hard cause there was time consuming manual subject in notification.",
                    "label": 1
                },
                {
                    "sent": "So for the second data set we choose, we choose just the photos of portraits where we can identify this.",
                    "label": 1
                },
                {
                    "sent": "This subject with face detector algorithm.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So this was rated by deeply challenged users.",
                    "label": 0
                },
                {
                    "sent": "I'm very sorry about that.",
                    "label": 0
                },
                {
                    "sent": "I mean, this is the writing of the photo, not of the person.",
                    "label": 0
                },
                {
                    "sent": "What?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This is by dipping challenge users so.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so we got this photo from different challenge and these photos were part of photographic contest and were already evaluated by deeply challenged users and each photo was evaluated at least 100 times by at least 100 people.",
                    "label": 0
                },
                {
                    "sent": "So yeah, this is example of best photos.",
                    "label": 0
                },
                {
                    "sent": "Examples of.",
                    "label": 0
                },
                {
                    "sent": "Depends who you ask I guess.",
                    "label": 0
                },
                {
                    "sent": "Defense could ask, I guess.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I know, right?",
                    "label": 0
                },
                {
                    "sent": "Yeah, it looks.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So yeah, this photos were rated with numeric range from one to ten, 5.5 for the average and then we decided to label all these photos that were rated with average score less than 4.5 as low quality photos and all the photos that has been rated by more than 6.5 as a high quality ones.",
                    "label": 0
                },
                {
                    "sent": "So in the end we got 1048 photos which I already told was evaluated by at least 100.",
                    "label": 1
                },
                {
                    "sent": "Parsons and.",
                    "label": 0
                },
                {
                    "sent": "In that in this time we use the best 41 features by really F metric and with using SVM classifier with 10 fold cross validation technique we got 75% classification accuracy.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We weren't really satisfied with just having our model as a black box, so we try to interpret this results and what we find out was, for example, we looked at the unique use used in the photos and from from photographic theory we can confirm that.",
                    "label": 0
                },
                {
                    "sent": "You know that high quality photos has, although if they look colorful and vibrant they use little little unique hues.",
                    "label": 1
                },
                {
                    "sent": "So we realize that there's more than 4 four unique users are not preferred.",
                    "label": 0
                },
                {
                    "sent": "So up to four and.",
                    "label": 1
                },
                {
                    "sent": "So and with Steve three was the median.",
                    "label": 0
                },
                {
                    "sent": "We also looked at aspect ratio becausw experience, photo photo grapher's usually corrupt their photos to improve framing.",
                    "label": 1
                },
                {
                    "sent": "But what we can observe from data that extreme extreme aspect ratio are not are not preferred.",
                    "label": 0
                },
                {
                    "sent": "So actually the interval from zero Point 8 to 1.2 is preferred with.",
                    "label": 0
                },
                {
                    "sent": "With one's a median exactly one is a medium.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We looked as I said, we looked at the composition quite a roughly and what we find out that this compositional rules of like rule of thirds and Golden section are very influential.",
                    "label": 0
                },
                {
                    "sent": "And for example, this boat this rules.",
                    "label": 0
                },
                {
                    "sent": "Divide the fourth of two vertical to vertical and two horizontal lines.",
                    "label": 0
                },
                {
                    "sent": "As I mean, just just this one is visible.",
                    "label": 0
                },
                {
                    "sent": "This the other ones, the right so it's harder to see.",
                    "label": 0
                },
                {
                    "sent": "And what we find out that the subject centered distance to the nearest vertical line is the most influential feature.",
                    "label": 1
                },
                {
                    "sent": "So in this example, if we say that this.",
                    "label": 0
                },
                {
                    "sent": "This person is a subject of a photography.",
                    "label": 0
                },
                {
                    "sent": "We could say that the distance to this line, the red line, is the most influential is the best indicator of the quality of the photo.",
                    "label": 1
                },
                {
                    "sent": "So from from the data from the DP challenge data set, we measured the distances up to 11% of total wider preferred.",
                    "label": 0
                },
                {
                    "sent": "So up to 11.",
                    "label": 1
                },
                {
                    "sent": "No more so.",
                    "label": 0
                },
                {
                    "sent": "For the Golden section, this value was 15%.",
                    "label": 0
                },
                {
                    "sent": "You said so.",
                    "label": 0
                },
                {
                    "sent": "This attribute was best out of all no no no, not not best of the world I mean.",
                    "label": 0
                },
                {
                    "sent": "I mean, it was influential.",
                    "label": 0
                },
                {
                    "sent": "It was not the best.",
                    "label": 0
                },
                {
                    "sent": "I mean this.",
                    "label": 0
                },
                {
                    "sent": "The influence we mostly we measured the influence by really FF metric and it did vary a bit through the through the data sets you know different different features performed.",
                    "label": 0
                },
                {
                    "sent": "Some of the features were consistent, some of them were not.",
                    "label": 0
                },
                {
                    "sent": "So I only want to tell you about the features that perform consistently through the boat datasets so.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "K We also looked at the the subject distance from image frame borders, so that's big cause in the photographic theory.",
                    "label": 1
                },
                {
                    "sent": "It's not.",
                    "label": 1
                },
                {
                    "sent": "They say it's not desirable for a subject to be placed at near to be placed near image borders and from the deeply challenge data set we observe that even that values more than 3838% from the left borders are preferred.",
                    "label": 0
                },
                {
                    "sent": "38% of the total white.",
                    "label": 0
                },
                {
                    "sent": "With so and this interval for the bottom.",
                    "label": 0
                },
                {
                    "sent": "But this actually this actually varies through the data set, so yeah.",
                    "label": 0
                },
                {
                    "sent": "Depends on the data set but but the feature itself turned out to be to be influential on both datasets.",
                    "label": 0
                },
                {
                    "sent": "We also looked at the detected image as a.",
                    "label": 0
                },
                {
                    "sent": "We realized that higher number of detected image edges turned out to indicate more appealing photo, which we argue that the number the higher the number, the easier is to distinguish the subject from the photography.",
                    "label": 1
                },
                {
                    "sent": "And also it can mean that the photo is more visually complex, which we will, which I will tell you in the following slides.",
                    "label": 0
                },
                {
                    "sent": "And when we when we got this image edges, we also looked at special distribution of this.",
                    "label": 1
                },
                {
                    "sent": "Edges will look how how we measure the distance from image center and from borders and with different computational models.",
                    "label": 0
                },
                {
                    "sent": "And this special distribution turned out to be very influential.",
                    "label": 0
                },
                {
                    "sent": "On both datasets.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And as I told you before, we also looked at visual complexity.",
                    "label": 0
                },
                {
                    "sent": "We can also say that the higher number detected image edges also means that the photo is more visually complex and by that, and when we were done analyzing visual complexity, we also looked at some very simple feature that's that we just take the size of the compressed image file size, which if we if we look at the informational theory, if we use compression algorithms with stripped.",
                    "label": 1
                },
                {
                    "sent": "We strip out the redundancy and we only get the information.",
                    "label": 0
                },
                {
                    "sent": "At least that's the idea.",
                    "label": 0
                },
                {
                    "sent": "So we try to compress the compressed the image with JPEG and we looked at the file size so.",
                    "label": 0
                },
                {
                    "sent": "Yeah, sound to 5% quality 75 here and yeah and one more important things that the mean.",
                    "label": 0
                },
                {
                    "sent": "Domain value of the number of the pixels was 340 with low flow variance, so I think so we observe that 100 to one kilobyte is the images that have more than.",
                    "label": 0
                },
                {
                    "sent": "That in size are more preferred.",
                    "label": 0
                },
                {
                    "sent": "So this is the example of the one the left one is less visually complex and the right one.",
                    "label": 0
                },
                {
                    "sent": "I think you can see it's more complex.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in conclusion, in conclusion, I can just repeat the.",
                    "label": 0
                },
                {
                    "sent": "We recognize the the characteristics of high quality and turned them into calculable features.",
                    "label": 1
                },
                {
                    "sent": "We use these features as an input into machine learning algorithms and that's how we constructed constructed the model which is able to distinguish between low and high quality photos.",
                    "label": 1
                },
                {
                    "sent": "So we got 95% for Flickr datasets 75, four four DP challenge which was more.",
                    "label": 0
                },
                {
                    "sent": "I must say it was.",
                    "label": 0
                },
                {
                    "sent": "More challenging data set because the photos were more artistic.",
                    "label": 0
                },
                {
                    "sent": "Or we're nearing artistic, so in the future work we should look at the we should distinguish between types of photography 'cause the landscape photography is quite different from portraits.",
                    "label": 0
                },
                {
                    "sent": "So we can define more more specific features for the types of the photographie.",
                    "label": 1
                },
                {
                    "sent": "And we also need to.",
                    "label": 0
                },
                {
                    "sent": "We also need to go into automatic subject recognition, not just for portraits but for common.",
                    "label": 0
                },
                {
                    "sent": "Fiction so.",
                    "label": 0
                },
                {
                    "sent": "OK, that's that's all.",
                    "label": 0
                }
            ]
        }
    }
}