{
    "id": "4txyvjc34bv5v3othzab732g4lhdkvhj",
    "title": "Opportunities for Technical Innovation",
    "info": {
        "author": [
            "Radik Martirosyan, National Academy of Sciences of Armenia"
        ],
        "published": "April 3, 2008",
        "recorded": "March 2008",
        "category": [
            "Top->Technology->Innovation"
        ]
    },
    "url": "http://videolectures.net/tict08_martirosyan_oti/",
    "segmentation": [
        [
            "Ladies and gentlemen, in this short presentation I will give you some information about Armenian Academy of Sciences.",
            "Some statistique dates, the problems which we have now in Armenians in Academy of Sciences and finally I will give you some examples results which was obtained in different institutes.",
            "Academy of Sciences which can be seen as the innovation.",
            "Modern Armenian Academy of Sciences."
        ],
        [
            "Was established in 1943 as the Supreme Scientific institution of the Republic, integrating the efforts of the Scientist in fundamental research involving at reviewing the rich spiritual legacy of domination and to provide scientific and practical resolution to the outstanding fundamental objectives facing the nation.",
            "The country in the economic, social, and cultural domains, as well as in national security and applied research."
        ],
        [
            "More than 30 Institute.",
            "4040 institutes and other science weakness of the Academy employees.",
            "Over 3700 persons grouped into five sections.",
            "Mathematics, mechanics and information technology, physics and astrophysics, natural Sciences, chemistry and Life Sciences, Armenian studies and social Sciences decade."
        ],
        [
            "Mix stuff.",
            "Includes academic staff.",
            "Includes 75 full members.",
            "54 corresponding members.",
            "3514 members.",
            "330 Doctors of Science and 1019 candidate of science.",
            "For over 60 years of his existence, Armenian Academy of Sciences has played the principal part in organizing basic research in the country, as well as implementing operation in fundamental and applied Sciences."
        ],
        [
            "In the course of those years, the Armenian scientists produced significant results.",
            "No results, establishment of some scientific schools was followed by mediated recognition.",
            "Now about articulation of the scientific policies and the role of the Academy of Sciences in current context."
        ],
        [
            "Following the independence for the last 15 years, major changes have taken place in Armenia, in the domain of science.",
            "In all those years under economic blockade, braindrain collapse of scientific links, it was expedient to focus on retaining the minimal infrastructure for the scientific research capabilities."
        ],
        [
            "In those years, despite the self stream link of the research staff and critical underfunding, the scientific community managed to get along and establish international cooperation with quite a few scientific centers worldwide, sharing its equipments with other countries in those steps were taken to outline the legislative domain for carrying out scientific research, establishing the academic computer network.",
            "While the from the state control as well as benevolent armenus agencies enabled the preservation of the scientific resources to be implemented.",
            "In those years, Academy of Sciences over million along with this country's science, the community vigorously participated in creating several research projects aimed at.",
            "Probability dating and developing the economy under market."
        ],
        [
            "Conditions.",
            "During 2000 three 2006 the activities of the Academy of Sciences can be characterized by the publication International grants and contracted orbit."
        ],
        [
            "Mission.",
            "Which in the National.",
            "15 monographic books and 3140 two articles were published abroad.",
            "He had not included publication in Russia.",
            "66 Grand Prix receipt with total amount of over 10,000,000 US dollars.",
            "The variable dynamics of the grants does confer show that Adminis Academy of Science a bit in the last years has been over the very significant number of grants for science in Armenia."
        ],
        [
            "In this slide you can see National Academy of Sciences and Higher Education and that institutions the the World Wide dynamic to the grants does confer show that I'm in a secondary service in the last years.",
            "Over the many grants in the meantime, having example in the sectors of the state, funding science in a number of countries with the travel history economy.",
            "It should be noted that in our meaning that sector is infinitely small, constituting zero point 3% of GNP."
        ],
        [
            "In this slide you can see the funding different countries in transition period.",
            "A transition period with the absolute value of funding millionaire bro.",
            "You can see that Armenia is only 1212 million, never very years."
        ],
        [
            "10% Dos prompt prompting the need for strengthening links between science and industry and index, so efficiency for scientific research is the number of publication."
        ],
        [
            "Today I'm in a second demo Sciences.",
            "Is particular in the elaboration of the new policy in the domain of science, suggesting to accommodate for the following cravel crucial problems.",
            "The prime mover mover of the counters economic development at the current period of time.",
            "Investment loaned insufficient to reach the brick throat level, bridging the gap between science and technology."
        ],
        [
            "It is need to integrate science and education.",
            "Took commercialization the scientific results, exposing them on the domestic and foreign markets to boost the efficiency of the scientific and research establishment to rise.",
            "The involvement of the youngest specialist in the research efforts to update the list of priority Directions in Science and Technology.",
            "Adam, in a second of science, is putting into operation a number of measures in domain of new scientific policies."
        ],
        [
            "Using the universal uniformity of the format institutes to establish new scientific and international research and development centers.",
            "That's why when I said that 30 and 40, we had many years ago, 40 Institute, now we have 30 because many some Institute is jointed.",
            "Are articulating the problem sorry ability substructures and developing new capabilities to aid scientific research on the participation of the National Academy International Research Association using the proposals in line with the Institute's capabilities based upon the research done by the scientific stuff."
        ],
        [
            "Analysis undertaken in view of developing science and technology with regard to the reality trends as defined in 2002 enabled good lines to be drawn for the following directions.",
            "Armenian study.",
            "Here is our menology.",
            "Information technology and advanced technology.",
            "There is sterile and Space Research, new energy sources, sustainable developments with biological and ecological perspectives.",
            "Major fundamental research to support the development of applied research.",
            "Indeed, this communication is specially focused on their contribution or academic research result aimed at technological innovation in the line or proposed technology transfer.",
            "I said that now I will give."
        ],
        [
            "Do some result.",
            "Which was obtained in different Institute Academy of Science.",
            "The proposals are submitted along with the following spheres.",
            "New materials leading edge technologies, information technologies, life Sciences, innovation, puzzles, new materials.",
            "The proposal by Institute of Radio Physics and electronics, like at North Academy of Sciences on the new materials for thermoelectric cooling, is standing alone here.",
            "The proposal include new materials for the thermal electrical appliance appliance based on the laminated oxide, yielding higher efficiency.",
            "Descripcion are provided of those materials.",
            "Technology of production and technological characteristic.",
            "This result is pattern is patent has patterned United States.",
            "They easy to do geological science."
        ],
        [
            "Of the."
        ],
        [
            "This is this material."
        ],
        [
            "Institute of Inorganic Chemistry of the National Academy of Sciences proposed the anticorrosive animal name with the complete unique properties the enamel can be used at negative ambient temperatures below zero 20 degrees Celsius to code damp Metro surface.",
            "Rusted metal.",
            "And others, the material has been successfully tested at site since Armenia, Russian and Italy and."
        ],
        [
            "Other countries now.",
            "Finish around that."
        ],
        [
            "Testament once more.",
            "This one."
        ],
        [
            "State state of art."
        ],
        [
            "Technologies.",
            "The market microbiology and microorganisms.",
            "The deposit Ori Center of the Science and Technology or the Academy proposed an establishment of the further production and Armenia from England containing plants, mostly Atlantis, tomorrow, SIS and chicory.",
            "Sahara dis sweeteners."
        ],
        [
            "The Institute of the.",
            "Sunnie The Institute of Physical Research Institute Academy of Sciences, obtained the growth litanei, but Crystal with the periodical structures during the growing double the Christies.",
            "This type of material is very important and has many application in laser technology and a non linear nonlinear.",
            "Elements to grow more linear elements."
        ],
        [
            "This.",
            "This here, here you consider this type of crystals advantages."
        ],
        [
            "Information information technology.",
            "the Institute informatics an optimization problem of the National Academy of Sciences.",
            "Initiated the development of Armenian grid for science and education, supporting."
        ],
        [
            "The domain.",
            "The the demand of the scientist for Coco computation and simulation activities as well as Strimling the interdisciplinary research.",
            "Those operations started in Armenia due to the introduction of the first high Performance Computing Center.",
            "Among other proposals, the new approaches to developing virtual intelligence systems, the virtual intelligence systems are the new generation intellectual software.",
            "Packages this hope over context depends easily operating systems open new perspectives, Stewart and quality and services."
        ],
        [
            "This is this."
        ],
        [
            "Get it."
        ],
        [
            "Life signs."
        ],
        [
            "The Institute of Molecular Biology and National Academy of Sciences developed a natural active active compounds at Apple as a highly efficient antiviral and antibacterial remedy.",
            "The remedies patented.",
            "Institute of Subtle Organic Chemistry submitted research result on the Council computer relating holy effects.",
            "No."
        ],
        [
            "A few words about academic Innovation Center to develop the scientific and technological communication between Armenia Republic and the foreign countries and to provide more cyantific mobility to the Armenian scientists as well as to stimulate the informational and invest investment activities.",
            "the National Academy of Sciences established the Armenian Academy Business Information Center.",
            "The same."
        ],
        [
            "That will produce providing conditions for raising the quality and competitive power of their meaning.",
            "Scientific and technical production and services.",
            "But virtue of merging the innovation capabilities in Armenian overseas and by exposing those products to the Armenian market among the targets of the centre are organizing the analytical databases for information exchange on business into incubators.",
            "The technology transfers and stakeholder distributions developing special infrastructures for transfer of knowledge within National Academy of Sciences.",
            "In fact, this is made up in developing strategic investment projects and programs with joint application of national and private funding.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ladies and gentlemen, in this short presentation I will give you some information about Armenian Academy of Sciences.",
                    "label": 0
                },
                {
                    "sent": "Some statistique dates, the problems which we have now in Armenians in Academy of Sciences and finally I will give you some examples results which was obtained in different institutes.",
                    "label": 0
                },
                {
                    "sent": "Academy of Sciences which can be seen as the innovation.",
                    "label": 0
                },
                {
                    "sent": "Modern Armenian Academy of Sciences.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Was established in 1943 as the Supreme Scientific institution of the Republic, integrating the efforts of the Scientist in fundamental research involving at reviewing the rich spiritual legacy of domination and to provide scientific and practical resolution to the outstanding fundamental objectives facing the nation.",
                    "label": 0
                },
                {
                    "sent": "The country in the economic, social, and cultural domains, as well as in national security and applied research.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "More than 30 Institute.",
                    "label": 0
                },
                {
                    "sent": "4040 institutes and other science weakness of the Academy employees.",
                    "label": 0
                },
                {
                    "sent": "Over 3700 persons grouped into five sections.",
                    "label": 0
                },
                {
                    "sent": "Mathematics, mechanics and information technology, physics and astrophysics, natural Sciences, chemistry and Life Sciences, Armenian studies and social Sciences decade.",
                    "label": 1
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Mix stuff.",
                    "label": 0
                },
                {
                    "sent": "Includes academic staff.",
                    "label": 0
                },
                {
                    "sent": "Includes 75 full members.",
                    "label": 0
                },
                {
                    "sent": "54 corresponding members.",
                    "label": 0
                },
                {
                    "sent": "3514 members.",
                    "label": 0
                },
                {
                    "sent": "330 Doctors of Science and 1019 candidate of science.",
                    "label": 1
                },
                {
                    "sent": "For over 60 years of his existence, Armenian Academy of Sciences has played the principal part in organizing basic research in the country, as well as implementing operation in fundamental and applied Sciences.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In the course of those years, the Armenian scientists produced significant results.",
                    "label": 0
                },
                {
                    "sent": "No results, establishment of some scientific schools was followed by mediated recognition.",
                    "label": 1
                },
                {
                    "sent": "Now about articulation of the scientific policies and the role of the Academy of Sciences in current context.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Following the independence for the last 15 years, major changes have taken place in Armenia, in the domain of science.",
                    "label": 0
                },
                {
                    "sent": "In all those years under economic blockade, braindrain collapse of scientific links, it was expedient to focus on retaining the minimal infrastructure for the scientific research capabilities.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In those years, despite the self stream link of the research staff and critical underfunding, the scientific community managed to get along and establish international cooperation with quite a few scientific centers worldwide, sharing its equipments with other countries in those steps were taken to outline the legislative domain for carrying out scientific research, establishing the academic computer network.",
                    "label": 1
                },
                {
                    "sent": "While the from the state control as well as benevolent armenus agencies enabled the preservation of the scientific resources to be implemented.",
                    "label": 0
                },
                {
                    "sent": "In those years, Academy of Sciences over million along with this country's science, the community vigorously participated in creating several research projects aimed at.",
                    "label": 0
                },
                {
                    "sent": "Probability dating and developing the economy under market.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Conditions.",
                    "label": 0
                },
                {
                    "sent": "During 2000 three 2006 the activities of the Academy of Sciences can be characterized by the publication International grants and contracted orbit.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mission.",
                    "label": 0
                },
                {
                    "sent": "Which in the National.",
                    "label": 0
                },
                {
                    "sent": "15 monographic books and 3140 two articles were published abroad.",
                    "label": 0
                },
                {
                    "sent": "He had not included publication in Russia.",
                    "label": 0
                },
                {
                    "sent": "66 Grand Prix receipt with total amount of over 10,000,000 US dollars.",
                    "label": 0
                },
                {
                    "sent": "The variable dynamics of the grants does confer show that Adminis Academy of Science a bit in the last years has been over the very significant number of grants for science in Armenia.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this slide you can see National Academy of Sciences and Higher Education and that institutions the the World Wide dynamic to the grants does confer show that I'm in a secondary service in the last years.",
                    "label": 0
                },
                {
                    "sent": "Over the many grants in the meantime, having example in the sectors of the state, funding science in a number of countries with the travel history economy.",
                    "label": 0
                },
                {
                    "sent": "It should be noted that in our meaning that sector is infinitely small, constituting zero point 3% of GNP.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this slide you can see the funding different countries in transition period.",
                    "label": 0
                },
                {
                    "sent": "A transition period with the absolute value of funding millionaire bro.",
                    "label": 0
                },
                {
                    "sent": "You can see that Armenia is only 1212 million, never very years.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "10% Dos prompt prompting the need for strengthening links between science and industry and index, so efficiency for scientific research is the number of publication.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Today I'm in a second demo Sciences.",
                    "label": 0
                },
                {
                    "sent": "Is particular in the elaboration of the new policy in the domain of science, suggesting to accommodate for the following cravel crucial problems.",
                    "label": 1
                },
                {
                    "sent": "The prime mover mover of the counters economic development at the current period of time.",
                    "label": 0
                },
                {
                    "sent": "Investment loaned insufficient to reach the brick throat level, bridging the gap between science and technology.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It is need to integrate science and education.",
                    "label": 0
                },
                {
                    "sent": "Took commercialization the scientific results, exposing them on the domestic and foreign markets to boost the efficiency of the scientific and research establishment to rise.",
                    "label": 0
                },
                {
                    "sent": "The involvement of the youngest specialist in the research efforts to update the list of priority Directions in Science and Technology.",
                    "label": 1
                },
                {
                    "sent": "Adam, in a second of science, is putting into operation a number of measures in domain of new scientific policies.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Using the universal uniformity of the format institutes to establish new scientific and international research and development centers.",
                    "label": 1
                },
                {
                    "sent": "That's why when I said that 30 and 40, we had many years ago, 40 Institute, now we have 30 because many some Institute is jointed.",
                    "label": 1
                },
                {
                    "sent": "Are articulating the problem sorry ability substructures and developing new capabilities to aid scientific research on the participation of the National Academy International Research Association using the proposals in line with the Institute's capabilities based upon the research done by the scientific stuff.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Analysis undertaken in view of developing science and technology with regard to the reality trends as defined in 2002 enabled good lines to be drawn for the following directions.",
                    "label": 0
                },
                {
                    "sent": "Armenian study.",
                    "label": 0
                },
                {
                    "sent": "Here is our menology.",
                    "label": 0
                },
                {
                    "sent": "Information technology and advanced technology.",
                    "label": 0
                },
                {
                    "sent": "There is sterile and Space Research, new energy sources, sustainable developments with biological and ecological perspectives.",
                    "label": 1
                },
                {
                    "sent": "Major fundamental research to support the development of applied research.",
                    "label": 1
                },
                {
                    "sent": "Indeed, this communication is specially focused on their contribution or academic research result aimed at technological innovation in the line or proposed technology transfer.",
                    "label": 0
                },
                {
                    "sent": "I said that now I will give.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Do some result.",
                    "label": 0
                },
                {
                    "sent": "Which was obtained in different Institute Academy of Science.",
                    "label": 0
                },
                {
                    "sent": "The proposals are submitted along with the following spheres.",
                    "label": 0
                },
                {
                    "sent": "New materials leading edge technologies, information technologies, life Sciences, innovation, puzzles, new materials.",
                    "label": 1
                },
                {
                    "sent": "The proposal by Institute of Radio Physics and electronics, like at North Academy of Sciences on the new materials for thermoelectric cooling, is standing alone here.",
                    "label": 0
                },
                {
                    "sent": "The proposal include new materials for the thermal electrical appliance appliance based on the laminated oxide, yielding higher efficiency.",
                    "label": 0
                },
                {
                    "sent": "Descripcion are provided of those materials.",
                    "label": 0
                },
                {
                    "sent": "Technology of production and technological characteristic.",
                    "label": 0
                },
                {
                    "sent": "This result is pattern is patent has patterned United States.",
                    "label": 0
                },
                {
                    "sent": "They easy to do geological science.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of the.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is this material.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Institute of Inorganic Chemistry of the National Academy of Sciences proposed the anticorrosive animal name with the complete unique properties the enamel can be used at negative ambient temperatures below zero 20 degrees Celsius to code damp Metro surface.",
                    "label": 0
                },
                {
                    "sent": "Rusted metal.",
                    "label": 0
                },
                {
                    "sent": "And others, the material has been successfully tested at site since Armenia, Russian and Italy and.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Other countries now.",
                    "label": 0
                },
                {
                    "sent": "Finish around that.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Testament once more.",
                    "label": 0
                },
                {
                    "sent": "This one.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "State state of art.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Technologies.",
                    "label": 0
                },
                {
                    "sent": "The market microbiology and microorganisms.",
                    "label": 0
                },
                {
                    "sent": "The deposit Ori Center of the Science and Technology or the Academy proposed an establishment of the further production and Armenia from England containing plants, mostly Atlantis, tomorrow, SIS and chicory.",
                    "label": 1
                },
                {
                    "sent": "Sahara dis sweeteners.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The Institute of the.",
                    "label": 0
                },
                {
                    "sent": "Sunnie The Institute of Physical Research Institute Academy of Sciences, obtained the growth litanei, but Crystal with the periodical structures during the growing double the Christies.",
                    "label": 0
                },
                {
                    "sent": "This type of material is very important and has many application in laser technology and a non linear nonlinear.",
                    "label": 0
                },
                {
                    "sent": "Elements to grow more linear elements.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "This here, here you consider this type of crystals advantages.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Information information technology.",
                    "label": 0
                },
                {
                    "sent": "the Institute informatics an optimization problem of the National Academy of Sciences.",
                    "label": 0
                },
                {
                    "sent": "Initiated the development of Armenian grid for science and education, supporting.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The domain.",
                    "label": 0
                },
                {
                    "sent": "The the demand of the scientist for Coco computation and simulation activities as well as Strimling the interdisciplinary research.",
                    "label": 0
                },
                {
                    "sent": "Those operations started in Armenia due to the introduction of the first high Performance Computing Center.",
                    "label": 0
                },
                {
                    "sent": "Among other proposals, the new approaches to developing virtual intelligence systems, the virtual intelligence systems are the new generation intellectual software.",
                    "label": 0
                },
                {
                    "sent": "Packages this hope over context depends easily operating systems open new perspectives, Stewart and quality and services.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is this.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Get it.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Life signs.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The Institute of Molecular Biology and National Academy of Sciences developed a natural active active compounds at Apple as a highly efficient antiviral and antibacterial remedy.",
                    "label": 1
                },
                {
                    "sent": "The remedies patented.",
                    "label": 0
                },
                {
                    "sent": "Institute of Subtle Organic Chemistry submitted research result on the Council computer relating holy effects.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A few words about academic Innovation Center to develop the scientific and technological communication between Armenia Republic and the foreign countries and to provide more cyantific mobility to the Armenian scientists as well as to stimulate the informational and invest investment activities.",
                    "label": 1
                },
                {
                    "sent": "the National Academy of Sciences established the Armenian Academy Business Information Center.",
                    "label": 0
                },
                {
                    "sent": "The same.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That will produce providing conditions for raising the quality and competitive power of their meaning.",
                    "label": 1
                },
                {
                    "sent": "Scientific and technical production and services.",
                    "label": 0
                },
                {
                    "sent": "But virtue of merging the innovation capabilities in Armenian overseas and by exposing those products to the Armenian market among the targets of the centre are organizing the analytical databases for information exchange on business into incubators.",
                    "label": 1
                },
                {
                    "sent": "The technology transfers and stakeholder distributions developing special infrastructures for transfer of knowledge within National Academy of Sciences.",
                    "label": 0
                },
                {
                    "sent": "In fact, this is made up in developing strategic investment projects and programs with joint application of national and private funding.",
                    "label": 1
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}