{
    "id": "4vuxvzinnofkt3tndh4damf4lwejgzk4",
    "title": "Electronic lexicography and computer-assisted language learning: Breaking down the barrier",
    "info": {
        "author": [
            "Sylviane Granger, Centre for English Corpus Linguistics, University of Louvain"
        ],
        "published": "Dec. 20, 2011",
        "recorded": "November 2011",
        "category": [
            "Top->Humanities->Linguistics->Lexicography"
        ]
    },
    "url": "http://videolectures.net/elex2011_granger_language/",
    "segmentation": [
        [
            "And I would like to start by thanking Easter candy organizers for inviting me to this wonderful conference, and particularly in this wonderful venue.",
            "It's my first time in Slovenia, so thanks for inviting me and I really enjoyed it a lot so far, and it's been great to exchange ideas on electronic lexicography with so many of you.",
            "But I've got lots of things to say this morning, I'm afraid.",
            "So I think we'd better get started."
        ],
        [
            "Here's an outline of my presentation.",
            "I will briefly introduce the two fields of electronic lexicography and computer assisted language learning.",
            "And some of the efforts that have been made to link them up.",
            "And then I zoom in on some writing oriented functionalities.",
            "The main part of my presentation will be devoted to that to what I would suggest as top priorities for closer integration of electronic dictionaries and computer assisted language learning.",
            "And these three priorities are better exploitation of the database structure of electronic dictionaries, integration of electronic dictionaries into learning management systems, and design of customizable specialized modules.",
            "And then I'll conclude."
        ],
        [
            "So let's start with the two fields."
        ],
        [
            "Computer assisted language learning can be defined as the search for and study of applications of the computer in language teaching and learning, and the field is very wide.",
            "It embraces a range of applications, including web based and mobile systems, computer mediated communication, the use of corpora and concordances for teaching, etc.",
            "It's probably a bit ludicrous to define electronic lexicography at this conference, although to me it's getting less and less clear exactly what it is, But anyway."
        ],
        [
            "Kilgariff's definition reminds us of the scope of the field.",
            "E. Lexicography, he wrote, can mean a number of things using technology for making dictionaries, using dictionaries and other lexical resources for high tech applications, and making and publishing dictionaries in electronic form.",
            "The main focus of my presentation will be on applications to learning and teaching.",
            "I."
        ],
        [
            "Focus exclusively on human oriented electronic dictionary electronic dictionaries and exclude strictly computer oriented NLP lexicon."
        ],
        [
            "Lexicography and computer assisted language learning are still largely two worlds apart.",
            "With their own conferences, their own journals, and very different theoretical and methodological principles.",
            "However, there are signs of a rapprochement between the two fields.",
            "And in this connection, Obel distinguishes between what she calls, dictionary, come call and call come dictionary.",
            "Dictionary com call Melissa.",
            "Term indicates in this kind of tool.",
            "It is the dictionary that is the central element and the starting point for computer assisted language applications, and in the case of Qualcomm dictionary, it is obviously the opposite.",
            "The call system is central and the dictionary is added as an aid.",
            "A survey of the two fields shows that the most effective integration to date.",
            "Has been achieved in the area of reading activities.",
            "And one of the techniques that have been used most."
        ],
        [
            "Is that of textual glasses created by the teacher or materials designer to explain difficult words in a text?",
            "The glasses become visible with a simple click on a word or by hovering the mouse over it.",
            "Now the good thing about this type of gloss.",
            "Is that they are contextualized, so if the text contains the sequence in a little while while will be glossed as period of time and not as the conjunction of subordination while.",
            "The other good thing is that they work.",
            "They've been proved to work in a lot of studies.",
            "They've been proved to have a positive effect on reading comprehension and language learning.",
            "However, there are downsides too.",
            "And the first downside is that this kind of textual link cannot be used with takes that have not been glossed in advance.",
            "And therefore these type of gloss is extremely time consuming, both for teachers and materials designers.",
            "Another"
        ],
        [
            "What type of writing aid is the dictionary look up facility?",
            "This tool provides direct access to the relevant entry in the Electronic Dictionary for any word in a text by just clicking on it.",
            "The advantage of this type of tool is that it can be used with any text, even a text on the web.",
            "But the glass or the dictionary entry in a way, is not contextualized, and hence requires more skills and time on the part of the user, especially for long entries like for the verb to fit, or in the case of homographs.",
            "And there are many of those in English, so safe can be a verb and noun or preposition.",
            "And also in the case of multiword units like heavy Rain or make heavy weather of something.",
            "Now the technology for more intelligent look up.",
            "It seems to be available.",
            "But is not yet implemented in the majority of tools."
        ],
        [
            "Whitelock and Edmonds describe the sharp intelligent Dictionary, which is characterized by its connectivity.",
            "That is, the dictionary provides the user with the correct equivalent for word used in the passage at hand.",
            "And the tool rests on two technologies.",
            "On the one hand, part of speech disambiguation.",
            "So for instance, to take the example of, while again it would disambiguate, while as a noun or a conjunction.",
            "And recognition of multi word units.",
            "Units like let go of or in relationship to.",
            "The latter functionality is very important as a large proportion of words in texts belong to multi word units.",
            "Whitelock and Edmonds speak of 20 to 50% of the word tokens obviously depends on your definition of multi word units and the authors report a precision rate of 89% recognition, which is quite impressive.",
            "We heard from Peter White logs talk yesterday that an intelligent look up facility is now integrated in Oxford Dictionaries Online, though if I understood correctly, this is not the case for all entries and certainly not for long entries.",
            "But Peter might want to add something later, perhaps now that's for reading and Reading's been spoilt in a way.",
            "What about writing?",
            "Well, I find the situation for writing pretty dismal personally.",
            "And the."
        ],
        [
            "It is because the link between the computer assisted language learning environment and the Electronic Dictionary is either absent or largely ineffective for writing activities.",
            "And this is doubly paradoxical, because on the one hand, learner needs are particularly acute for writing.",
            "And on the other hand, when you think of it, remarkable efforts have been made to turn dictionaries into efficient, productive tool and productive means.",
            "Here mainly writing tools and Michael Randall, of course played a major part in this development."
        ],
        [
            "Now it is interesting to compare.",
            "The description given by nation of learners purpose is for dictionary use for reading and writing.",
            "And as you can see from this slide, the list is much longer for writing than for reading.",
            "For writing Nation, list the following purposes look up unknown words needed to write look up spelling, meaning grammar constraints on used collocations, inflections, and derived forms of partly known words confirm the spelling meaning of known words.",
            "Check that a word exists.",
            "Find a different word to use instead of a known one, and correct an error.",
            "Once for reading, there were only three rubrics.",
            "Look up unknown words.",
            "Confirm the meaning of partly known words and confirm guesses from context.",
            "Soap learners have a multiplicity of writing related needs.",
            "What help are they getting?",
            "Now let's look."
        ],
        [
            "At some writing oriented functionalities that are available today, not all of them.",
            "I mean, I couldn't.",
            "Possibly, but I would."
        ],
        [
            "Like to focus on five writing oriented functionalities and I will start with dictionary.",
            "Look up again.",
            "But this time's in the perspective of writing.",
            "Then concordance seeing link to Collocate Artool vocabulary profiling and error warning.",
            "And I'd like to point out and this is extremely important that I'm going to focus on monolingual searches only.",
            "I will leave translation searches aside today.",
            "So let's start with dictionary look up."
        ],
        [
            "Now dictionary look up facilities.",
            "Take the writer.",
            "From any word in a text to the dictionary.",
            "But unfortunately the link takes the writer to the full headward entry.",
            "There is no direct access to the specific type of information he or she might be looking for, which can be the level of formality, the frequency, the collocations of the word, etc.",
            "This can be illustrated with a wide range of tools.",
            "I've decided to illustrate this on the basis of oops writing a tool called the Oxford IRA."
        ],
        [
            "Later.",
            "And this tool contains a lot of functionalities which are extremely useful, including pop-up dictionary.",
            "So a writer.",
            "Weiss typing is text and the writer will be typing his text here in the interface.",
            "I can't explain what all the rest is, but.",
            "And the sentence is they were anxious to get the support from each state.",
            "Now, the writer who's writing this may want to check.",
            "Whether the word gets is the best verb to use with support and may want to check whether from is the right preposition to use with support.",
            "So what the writer would do would be to click on this word support in the interface and then the pop-up dictionary would open.",
            "Now once it open."
        ],
        [
            "Obviously this is what you see.",
            "You've got to go to.",
            "Go entry, click on that icon and you're taken to the entry for support.",
            "Once you're there, you can see that the entry starts with the verb, so you will need to click on noun to get to the noun entry.",
            "And once you're there.",
            "Then you will need to spend quite a bit of time to find the answer to your query.",
            "You can see and that is in principle a very good point that there is a menu at the top of the entry for the noun, but unfortunately there is no collocation box.",
            "What you will find instead is a box here with Word Origin, which is the etymology of the word, which is not at all relevant for writing.",
            "I mean that you have no need for that.",
            "When you want to know how to write or how to use the word support, there is also another box which is an example bank."
        ],
        [
            "And there if you click on example bank, you are taken to a list of about 50 examples of support of the noun support, but there is no particular highlighting for any of the collocations or particular specific patterning of the noun support.",
            "Now I'm not really sure how many writers will have the time and energy to go through so many clicks and then read the whole entry or read the list of examples to find out how to use the noun support.",
            "The."
        ],
        [
            "Along man writing assistant does better in a way as it gives access to four types of information.",
            "So there's a menu called Thesaurus, another one called grammar, then collocations and errors.",
            "However, the information provided can be very disappointing."
        ],
        [
            "For example, here again, you can write your sentence.",
            "The video shows you how to avoid to have a heart attack.",
            "Now this is not correct in English.",
            "It should be avoid having.",
            "If the writer wants to check what form of the verb you need to use after avoid, I think the writer will quite spontaneously click on grammar, because that's for him is grammar.",
            "It's certainly not thesaurus and not really collocations, and clicking on grammar.",
            "What the writer will get is a list of the derived and inflected forms of the verb avoid.",
            "So you have Word family avoid avoidance.",
            "Unavoidably and etc and you have the verb forms.",
            "Avoid avoids avoided avoiding, but for advanced learners they know that right.",
            "They and especially as English, has very little morphology.",
            "It's not really very useful, except perhaps for irregular verbs.",
            "So another functionality that can help, right?"
        ],
        [
            "As.",
            "Is Concorde and see and a good example of the use of Concorde and seeing in a writing aid environment is Tom Cubs Concorde writer.",
            "Tom Cobbs Tool allows writers to write a text and click on any word in the text to get a concordance concordance for a word or several words.",
            "And then which allows them to check their contextual patterning.",
            "You can see the first few lines of the concordance here.",
            "And once they've done that, they can click on a range of dictionaries to get more information on the words.",
            "So you keep in your text.",
            "Here you can see I've keyed in the beginning of a sentence with the word jeopardized, and if you click on jeopardized then and you select a corpus, there are several corpora that are available.",
            "You get the concordance and then you click on a range of dictionaries.",
            "Here English, French, English, English, etc.",
            "And the dictionary opens all within the same window.",
            "I mean, I think that's the main point.",
            "Now, there's no denying that.",
            "Having direct access to Concordances.",
            "From your writing environment in a range of corpora.",
            "It can be extremely useful to hire intermediate to advanced writers.",
            "However, I would certainly not go as far as gobble."
        ],
        [
            "Who claims that Concordances are superior?",
            "Two traditional grammar books, dictionaries, and course books because they allow easy access to huge amounts of real language in use.",
            "Now the highlighting and underlining is mine, right?",
            "I think what is striking is to see that concordances are presented as competitors in a way for dictionaries and grammars.",
            "Now in this connection, I must admit that I'm really at one with Adam Kilgarriff.",
            "Yes, that happens from time to time.",
            "Who phone said that most learners don't want to be corpus linguists and concordances are unfamiliar and difficult objects, while dictionaries are familiar from an early age, so you can see that the two positions are completely opposite positions.",
            "For me, Concordances have a place in the learners writing environment, but certainly not as the first resource, certainly not as the first kind of aid that writers should turn to.",
            "A third."
        ],
        [
            "Type of aid that is provided takes the form of a link to a color cater tool.",
            "This is the case with John Milton's writing assistant called Check My Words.",
            "And all the references are we on your handout as well as the links to the websites to all these tools.",
            "For grammar within this tool, check my words writers get a great deal of assistance for grammar within the program, and I won't describe this today, but it's really nice.",
            "But for LEXIS, the writer is referred to a web based tool which is not part of the check My Words program.",
            "A web based tool called Word Neighbors.",
            "And.",
            "When they."
        ],
        [
            "Go to word neighbors.",
            "This is what they.",
            "This is what the interface looks like.",
            "What you do is you first have to key in your item, then select noun or verb or adjective.",
            "So there is disambiguation here and then specify a span for your search.",
            "And once you've done that, you can see that instead of concordances you actually get patterns, which is really nice.",
            "So adjective plus, noun determiners, noun noun plus noun.",
            "And you can click further and if you click further, you have the actual color kits that appear with their frequencies.",
            "Now, it's certainly a very good tool.",
            "Very useful one, but learners have to master to use the interface, and in particular the span option, which is not that obvious to use for writers.",
            "I think for non experts.",
            "And then they have to go through a number of stages to get to the information they are interested in, so it's still in a way of hard work.",
            "Another functionality I'd like to mention is vocabulary profiling."
        ],
        [
            "Vocabulary profiling allows you to highlight some words in your text.",
            "For example Tom Cobbs vocab profile tool highlights words belonging to different frequency bands in different colors.",
            "Looks very nice.",
            "It's really nice for teachers.",
            "Actually, I quite like that.",
            "Similarly, the Oxfords eyewriter allows the writer to highlight academic words in his or her text by clicking."
        ],
        [
            "On the as you can see here, by clicking on the highlight Academic Word list icon, you can see that all the academic world words in the learners text are highlighted in red.",
            "These are words like facilitate explicit awareness, traditional their words from Avril coxhead's academic word list, not our own list which magaly refer to yesterday, which is a bit different.",
            "And this is the academic keyword list.",
            "Now again, this is a potentially very useful functionality, but unfortunately the highlighted words are simply linked linked to the general entry in the dictionary, and so do not provide any help as regards the specific patterning of these words in academic text, so you highlight them, But actually, for writing you'd like to have a bit more help.",
            "For as regards this specific patterning.",
            "And find."
        ],
        [
            "Writers can be greatly helped if their attention is drawn to potential errors.",
            "Every warnings rely on the analysis of learner corpus data.",
            "They can take the form of error nodes in learners dictionaries and this is the case in the Macmillan Dictionary where we have over 100.",
            "Get it right boxes based on the international corpus of our learning English and these boxes were designed by our team in Nova.",
            "And you have an errors icon.",
            "I showed you a few minutes ago.",
            "It's one of the boxes in the menu.",
            "You have an errors icon in the Longman writing assistant, and there the analysis is based on the Longman learner's corpus.",
            "But the error warnings can also appear automatically when learners are writing.",
            "This type of highlighting this kind of warning is implemented in Milton's writing a check my words so.",
            "The tool highlights words and phrases that are often used incorrectly by Chinese learners of English.",
            "It doesn't say it's an error.",
            "It says this could be an error.",
            "It might be good to check, right?",
            "It's just just a warning.",
            "The limitation, as I've already said, is that the focus is very much on grammar rather than on LEXIS for LEXIS.",
            "The users are refer to this external tool for patterning.",
            "Now, this brief survey shows that there are quite a few tools.",
            "And quite good tools at that that can really help learners, right?",
            "But it is also clear."
        ],
        [
            "That the coverage of writing needs is patchy.",
            "If you think of nations list.",
            "Um, that I showed a few minutes ago.",
            "It is clear that not all user writing needs are covered.",
            "There is an abundance of tools.",
            "And that characterizes today's landscape.",
            "I think it's this abundance of tools.",
            "With each tool catering for a portion, sometimes a very small portion of the needs.",
            "Another thing that comes out is that a lot of time and effort is required from writers to access the production oriented information they need.",
            "And the user has no control over the type of information provided.",
            "And last, but certainly not least, most tools target generic learners.",
            "There's no customization in terms of learners mothertongue, background, targeted language, variety, or task.",
            "Faced with this situation.",
            "I would like very modestly to suggest three priorities for closer integration between call and electronic dictionaries.",
            "Focusing as I've said on monolingual searches in English."
        ],
        [
            "So let's start with the first priority enhanced exploitation of the database structure of dictionary.",
            "This priority relies on the very definition of electronic Dick."
        ],
        [
            "Trees.",
            "As structured, my underlying electronic data that can be accessed with multiple tools enhanced with a wide range of functionalities and used in various environments."
        ],
        [
            "And selected facts about words are stored in different fields in present day dictionaries and there is many of these fields.",
            "This is just a few that immediately came to mind.",
            "I'm an EOT teacher, both language and linguistics, and these are all very relevant and they're all in different fields in the dictionary.",
            "And the result of this structured format is that, as noted by Atkins and Randall."
        ],
        [
            "Much of the information in the database is accessible to computerize searching and filtering.",
            "So in principle it should be possible for writers to access the different types of information separately in function of their needs.",
            "In reality this is not implemented or fully implemented.",
            "There are exceptions, of course, and we heard from Server Linden Keynote Lecture yesterday that there are efforts that are being made to counter this and Sarah has written extensively on this and he describes different access possibilities for writing, reading and translating.",
            "But this line of research is still quite rare on the whole.",
            "And there's very little to show for it in the current tools.",
            "Now, if the dictionary is integrated into a wider database system as, I will be arguing in a minute.",
            "Then writers can get."
        ],
        [
            "Direct access to different types of productively relevant information via icons that they can turn on or off sofa rings.",
            "For example, you can decide to turn off on the collocation box or the formality level box, but leave the frequency or geographical variety box turned off.",
            "At first the system would be what Gamper had snapped, called an adaptable system that is a system involving manual customization by the user.",
            "But thanks to the dictionary logs, the system could evolve into an adaptive system that is a system that automatically adapts to the user.",
            "Uses of the dictionary would have the choice between 2 Council."
        ],
        [
            "Asian modes.",
            "On the fly and batch mode.",
            "If they go for the Under Fly Consultation mode then they would just click on the relevant tab wise they writing and the teacher would actually do exactly the same thing while he or she is marking the students takes.",
            "In batch mode, then the student would use these functionalities after his written his text and the teacher would have the option of using it either before marking or after marking.",
            "So let's let's have a look at the batch mode in more detail."
        ],
        [
            "So students have the option of highlighting a range of features in their text after they've written it.",
            "So, for instance, they could.",
            "They may be interested, and I think a lot of students would be interested in highlighting different frequency bands in their text because they are often asked not to use basic vocabulary, right?",
            "So they may want to know how many basic vocabulary word they've used.",
            "But also this could be adapted because it could be curriculum or exam specific vocabulary lists that are I'll are highlighted in their text.",
            "Also, the writer could ask to see the stylistically marked words so highly formal, archaic, informal, taboo words would be highlighted.",
            "And obviously, potential errors would also be highlighted automatically.",
            "Anne."
        ],
        [
            "The teachers could use the same functionalities to get additional information on learners text before they start marking or when they finished marking to get additional information, things that they may have missed.",
            "The second priority."
        ],
        [
            "Integration of the dictionary into learning management systems.",
            "Writing activities.",
            "Are only a part actually of a wider language learning environment?",
            "Which today is usually embedded within a learning management system, an LMS.",
            "Now, what exactly is a learning management system?",
            "Graphic L provide a good def."
        ],
        [
            "Mission.",
            "LMS is provide teachers with many features to create, manage, and administrate online courses, allowing them to include different kinds of learning objects or activities such as learning material, forums, quizzes, examples and so on, and facilitating administrative issues such as enrollment, grading and monitoring.",
            "The learners progress and performance.",
            "The main asset of learning management systems for both teachers and learners is integration.",
            "Learning management systems are very popular.",
            "According to a survey conducted this year, seven 373% of students use an LMS.",
            "And among these, moudle really stands out."
        ],
        [
            "Moodle is an open source LMS used by about 1.1 million teachers and more than 38 million users.",
            "I use it for all my courses at Louvar and I really enjoy it and I wish that dictionaries could be integrated within them, so that's why I'm preaching this today.",
            "The tool model is constantly updated.",
            "And the latest version allows for integration with third party, an external tools like Flickr or Google Docs.",
            "And there's also a mobile app which provides access to the Moodle LMS and allows for example students to capture audio on iPhone and upload it to the LMS.",
            "Now the type of electronic dictionary that I described a few minutes ago and the axis that I described would be at the center of the lexical component of the."
        ],
        [
            "LMS.",
            "You can see Electronic dictionary in the middle right?",
            "Now the interface would include two different environments.",
            "The students writing environment and the teachers marking environment.",
            "This is a configuration which is already implemented in two writing assistance Wible it alls I will system and Milton's check my words which is for the students and mark my words which is for the teachers that two parts.",
            "No, the logs here are extremely important.",
            "The logs collected from consultation of the dictionary by both student and teacher, provide very useful information that can help dictionary publishers assess which functionality's are used most and which are never used and on that basis prioritize some features over others."
        ],
        [
            "This diagram here now shows the wider picture.",
            "This is how the system works.",
            "Everything starts with the students as we all know.",
            "The student composes an essay or any text that he's been asked to write.",
            "Within this environment.",
            "And consulting when need be the electronic dictionary.",
            "And when he's finished writing, he sends the text to the teacher within the environment of the learning management system.",
            "Then the teacher will mock the text and he or she will insert comments in the students essay using a standardized error marking system.",
            "It's important for it to be standardized and the teacher.",
            "Once he's done that, will send the.",
            "The text back to the students.",
            "Now this arrow should be a double shafted arrows, right?",
            "So there's a back and forth between the teacher and the student.",
            "Now, what is important here, my mouse is not working, yeah?",
            "Is this?",
            "Um teachers error annotations.",
            "Because teachers mark errors with a standardized system.",
            "The error annotations will help populate a vocabulary error bank.",
            "Which in turn can be used to design vocabulary exercises that target learners most frequent errors.",
            "And this can be done per group of students per mother, down background, etc, of course.",
            "And can also help design A lexical checker of Akabri Checker, which will draw students but also teachers attention to potential errors.",
            "The system also allows the teachers to build a very large collection of L2 text, enriched with error annotations as part of their daily activities.",
            "And the system, as you can see, also includes corpora and corpus handling tool that both students and teachers can use.",
            "This is my dream.",
            "This is my vision.",
            "I think one is allowed to dream from time to time."
        ],
        [
            "The third priority is the design of customizable specialized modules.",
            "Most writing age tools target.",
            "As I've said, the generic learner.",
            "Whoever that is.",
            "Now this is fine up to a point.",
            "It is clear that a large amount of information about words is valid in all texts.",
            "Avoid is always followed by the gerund.",
            "To jeopardize always means to put in danger.",
            "But in addition to this Common Core, different registers of English call for more specific information.",
            "And as Maggie Pacu pointed out in her talk yesterday, this is particularly true for English for academic purposes EAP.",
            "AP Constitutes a big challenge for many non native speakers of English.",
            "As English has become the language of academia.",
            "And non native writers really need help to use EAP words in their correct AP specific patterning.",
            "At Luther, we've been working in this area for eight years now.",
            "Ann in the few minutes I have left, I would like to say a few words about our past work in the field in collaboration with McMillan and the project we are currently working on thanks to a ground from the Belgian National Research Fund.",
            "Let's start at the beginning and that."
        ],
        [
            "Hours.",
            "Our collaboration with Macmillan, where we contributed an extended improve your writing section writing skills section.",
            "For the second edition of the Macmillan English Dictionary, the section is centered on 12 major rhetorical functions.",
            "How do you introduce a topic?",
            "How do you contrast?",
            "How do you exemplify?",
            "How do you conclude?",
            "And we describe a very, very rich description of the specific EAP words and phrases that are used to express these functions.",
            "We focus a lot on phraseology, and we've used the international corpus of Learner English to highlight learners difficulties.",
            "Not only errors, but also words that are overused and underused and the idea was to try and enlarge learners lexical repertoire right, which is usually very limited in this area."
        ],
        [
            "So the good thing about this project is that the material that has been included is extremely rich and I think relevant for writers.",
            "But and also that the work work has been the result of a very successful collaboration between and I can't stress this enough.",
            "Trained lexicographers on the one hand and experience TLT specialists on the other.",
            "But there are downsides as well, and one is that there is no integration or reintegration of the writing section on the CDROM.",
            "This section is not linked even to the dictionary.",
            "And also that the dictionary being a generic dictionary, we could not include a lot of interesting errors because they were restricted to some languages or language families, so we couldn't include them.",
            "That was very frustrating."
        ],
        [
            "Now with A view to overcoming of these shortcomings, we started a new project, the aim of which is to design an integrated web based tool to help non native speakers write academic text in English.",
            "And I want to be very brief here because we gave a talk at the preceding elects conference and you can read the paper in the elect proceedings.",
            "But just a few words.",
            "The new features are the multiplicity of access modes and customization in terms of discipline and mother tongue background.",
            "Also, the tool has integrated E AP focused exercises and direct access to AP and ESP corpora.",
            "I would just say a few words about the 1st two of these feet."
        ],
        [
            "As.",
            "Now the information in the dictionary can be accessed in three different ways.",
            "The traditional way you think of a word like, however or.",
            "Moreover, you're not really sure whether it's the right word to use.",
            "You can check it in the dictionary.",
            "But even with advanced learners, quite often, non native speakers still think in their mother tongue quite a lot right?",
            "So we'll think of a link word or a way of saying things in their mother tongue and not really know how to convey that in English.",
            "So we provide an entry via the translation into the user's mother tongue.",
            "So the dictionary is actually a bilingual eyes dictionary.",
            "And very importantly, I think the third option is very important.",
            "You can search by function.",
            "So if you want to conclude or you want to quote, then you can click on the menu."
        ],
        [
            "You can see here to the left and when you click you have access to all the devices, all the terms and phrases that are in the dictionary and then by clicking again you have all the information about that particular word or phrase.",
            "The second."
        ],
        [
            "Point, which is very important is customize ability.",
            "The content is automatically adapted to user needs in terms of mothertongue.",
            "Background.",
            "For the moment, we cover French and Dutch, but we hope that more will come and discipline.",
            "For the moment we only have 3 business, linguistics and medicine, but here again we'd like to add more."
        ],
        [
            "This is the opening screen of the dictionary.",
            "Magaly showed it yesterday.",
            "The first thing you need to do is to select your discipline.",
            "Here.",
            "Business has been chosen and the mother tongue background here French.",
            "And then the content of."
        ],
        [
            "The dictionary is adapted.",
            "So for instance, you can see that here if you've chosen business, the examples you get will be from business and this is, I think, very important in Jens Allen Airline Sense Talk.",
            "Yesterday very good talk.",
            "He talked about a lot of aspects of electronic lexicography, and one of them was engagement.",
            "You want to engage with this tool?",
            "How can you engage if you're a businessman and the example given is from fiction or from a theology book?",
            "I think there is a problem there.",
            "Right, you read a sentence is not relevant to you at all.",
            "So I think if only at the level of examples, it's good to have examples that are relevant."
        ],
        [
            "And also L1 customization is very important because here our frustration of not being able to include L1 specific error nodes.",
            "Well, we could at least implement them here.",
            "You have a note for French speakers.",
            "Do not use according to me as a translation of soloma use in my opinion, because French learners often use according to me.",
            "Now."
        ],
        [
            "Reed is currently a standalone tool, but we would like to integrate it into a wider environment and our inspiration comes from Michael Randles.",
            "He's a great inspiration from Michaels Randles mix and match scenario, which he describes as follows.",
            "A possible scenario is to see our reference materials as a set of components which customers can mix and match according to their needs.",
            "For example, a learner from China doing a master in agriculture at a British University could have access to a core Lt dictionary.",
            "With the option of Chinese translations, academic writing aids and subject specific terminology.",
            "Within the type of environment I described earlier."
        ],
        [
            "The lead module could be used under fly.",
            "You would have direct access to the AP.",
            "Module wise you right or it could be used after you've written and there you would see all the EAP words highlighted in your text and potential errors highlighted as well in function of learners L1, which is very important."
        ],
        [
            "Conclusion.",
            "And I would like to conclude with a quote from Butler Paskow very recent article on the history of Computer Assisted Language."
        ],
        [
            "Learning.",
            "And the quote says one major challenge for call practitioners is the need to harness the vast assortment of technology resources in a manner that capitalizes on the opportunities they present to meet pedagogical expectation.",
            "I think the word pedagogical is very important here, and obviously the vast assortment of technology resources there is an abundance of tools."
        ],
        [
            "Now, electronic dictionaries have a major role to play in this search for greater pedagogical effectiveness, but to be truly effective, electronic dictionaries and more particularly modeling wilderness dictionaries, need to make full use of their database structure in order to facilitate and speed up information access, be integrated in the type of environment that the vast majority of learners and teachers are using.",
            "That is learning management systems."
        ],
        [
            "In addition, there is a need for customizable modules like lead which cater for learners more specific needs.",
            "And last but not least, to ensure pedagogical effectiveness, it is imperative to rely on multidisciplinary expertise.",
            "We need a lot of skills if we want to produce effective tools, we need it, of course, but we need lexicography, corpus linguistics, computer assisted language learning, second language acquisition, and language pedagogy.",
            "I'm not sure how many of the priorities I have identified will be followed in future years, but if only a few bits and pieces make their way into one or other lexicographic tool, I will feel that I haven't lost my time and much more importantly, that I haven't made you lose yours.",
            "Thank you very much."
        ],
        [
            "I think the electronic dictionary in the center feel a little bit alone in that diagram.",
            "I mean you have a circle between the student and the teacher, which is a traditional circle.",
            "And it is traditional, but it's not implemented.",
            "No, no, of course not.",
            "But what about if the electronic dictionary could learn from this process?",
            "What about if Selectronic dictionary Coote had some kind of learning memory?",
            "Yeah, watching the same student doing the same mistakes over and over again and adapt to that.",
            "But I said that you didn't listen to me.",
            "I missed something.",
            "Yeah, I think you missed something.",
            "Where was it?",
            "Where I said that the system would be?",
            "I don't remember where that is now."
        ],
        [
            "Oh here here it is.",
            "Here it is so the system would first be adaptable, but dictionary logs can progressively help to turn the adaptive system into an adaptive one.",
            "The system adapts automatically to the user.",
            "I think that's the idea because you have the dictionary in the middle and the logs both with the teacher in the student, and that's really nice because the teachers and the students are not going to use the dictionary in the same way and so progressively.",
            "Because in an LMS every student is an individual right with his own profile.",
            "You could actually adapt quite easily within a learning management system.",
            "This is why I'm preaching for integration of electronic dictionaries within a wider management system, and they are used all over the world, but there is no integration of electronic dictionaries with that kind of platform.",
            "One time lovely talk.",
            "One thing you said right at the end I kind of want to challenge you said how it needs to be.",
            "A collaboration between all these different people.",
            "One system that you referenced that I've been sort of astonished by each time I've had an update on it is John Milton's from Hong Kong, University of Science and Technology, which seems like it's quite a lot of years ahead of almost anyone else, and I think.",
            "But your point was that it needed lots of people.",
            "How's it being possible for him to realize?",
            "Pretty singlehandedly so many aspects of the dream singlehandedly.",
            "But he's an IT person, so he's a computer computer analyst, right?",
            "He teaches English, so he's also an EMT specialist, and he's surrounded by Elta specialists, and I think already there, and he's a good corpus linguist.",
            "He knows about corpora and so, and he's got people around him.",
            "A lot about second language acquisition, and so I think actually it's quite a good.",
            "You know circle of people, and no wonder that he has produced such a good and useful tool.",
            "But it's really geared towards the Chinese learners of English, and I think for vocabulary purposes for collocations and so on, and I think it's probably possible to do to do better than send the students to an external tool.",
            "But it's really.",
            "That's the way to go.",
            "That's why I mentioned it as well as the David Wibbles I will interface.",
            "They are the inspiration, right?",
            "Is this, you know?",
            "I haven't really invented much except that the dictionary doesn't play a part in those environments.",
            "And that's where I that's why I've put the dictionary.",
            "Perhaps a bit isolated, but at least at the center of the picture, which in this kind of conference I think was probably a good thing to do.",
            "All the systems you mentioned were academic ones.",
            "And what about Microsoft?",
            "They've been investing hugely for an awful long time, I'm sorry.",
            "Yes.",
            "Yes but no.",
            "I mean spelling and a few grammar errors.",
            "An that's it.",
            "I mean, that's not.",
            "You know, it's useful, and when the students don't use the spell checker, I say, why didn't you use the spell checker, but I never say why didn't you use the grammar checker right?",
            "I don't say that no.",
            "I mean, it's maybe they're doing things that I'm not aware of, but certainly what we're getting as part of the package is not doing the trick.",
            "And it's not only academic programs because I mentioned the Longman writing assistant.",
            "I mentioned the Oxford writing assistant, but the object writing assistant, for instance, is mainly geared towards structuring your paper.",
            "Write the paragraph, the introduction, and the conclusion and help about you know what kind of ideas you put into this environment, and I think it's very useful, but I'm more interested in the product oriented tools rather than process oriented tools.",
            "And and there I think there's still a lot to do, but but my message.",
            "Is the information is there?",
            "Let's use what's there, but maybe I'm not getting it.",
            "Maybe it's so too commercial and I don't see the wider picture, but why isn't it possible to have direct access to these boxes that I showed and allowing students to just highlight some and not others?",
            "That's a real question.",
            "I don't understand why it hasn't been done yet.",
            "As the information is there I. I just don't understand personally.",
            "OK. Any other question?",
            "OK then thank you again Sylviane for this great top."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I would like to start by thanking Easter candy organizers for inviting me to this wonderful conference, and particularly in this wonderful venue.",
                    "label": 0
                },
                {
                    "sent": "It's my first time in Slovenia, so thanks for inviting me and I really enjoyed it a lot so far, and it's been great to exchange ideas on electronic lexicography with so many of you.",
                    "label": 0
                },
                {
                    "sent": "But I've got lots of things to say this morning, I'm afraid.",
                    "label": 0
                },
                {
                    "sent": "So I think we'd better get started.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here's an outline of my presentation.",
                    "label": 0
                },
                {
                    "sent": "I will briefly introduce the two fields of electronic lexicography and computer assisted language learning.",
                    "label": 0
                },
                {
                    "sent": "And some of the efforts that have been made to link them up.",
                    "label": 0
                },
                {
                    "sent": "And then I zoom in on some writing oriented functionalities.",
                    "label": 0
                },
                {
                    "sent": "The main part of my presentation will be devoted to that to what I would suggest as top priorities for closer integration of electronic dictionaries and computer assisted language learning.",
                    "label": 0
                },
                {
                    "sent": "And these three priorities are better exploitation of the database structure of electronic dictionaries, integration of electronic dictionaries into learning management systems, and design of customizable specialized modules.",
                    "label": 1
                },
                {
                    "sent": "And then I'll conclude.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's start with the two fields.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Computer assisted language learning can be defined as the search for and study of applications of the computer in language teaching and learning, and the field is very wide.",
                    "label": 1
                },
                {
                    "sent": "It embraces a range of applications, including web based and mobile systems, computer mediated communication, the use of corpora and concordances for teaching, etc.",
                    "label": 0
                },
                {
                    "sent": "It's probably a bit ludicrous to define electronic lexicography at this conference, although to me it's getting less and less clear exactly what it is, But anyway.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Kilgariff's definition reminds us of the scope of the field.",
                    "label": 0
                },
                {
                    "sent": "E. Lexicography, he wrote, can mean a number of things using technology for making dictionaries, using dictionaries and other lexical resources for high tech applications, and making and publishing dictionaries in electronic form.",
                    "label": 1
                },
                {
                    "sent": "The main focus of my presentation will be on applications to learning and teaching.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Focus exclusively on human oriented electronic dictionary electronic dictionaries and exclude strictly computer oriented NLP lexicon.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Lexicography and computer assisted language learning are still largely two worlds apart.",
                    "label": 0
                },
                {
                    "sent": "With their own conferences, their own journals, and very different theoretical and methodological principles.",
                    "label": 0
                },
                {
                    "sent": "However, there are signs of a rapprochement between the two fields.",
                    "label": 0
                },
                {
                    "sent": "And in this connection, Obel distinguishes between what she calls, dictionary, come call and call come dictionary.",
                    "label": 0
                },
                {
                    "sent": "Dictionary com call Melissa.",
                    "label": 0
                },
                {
                    "sent": "Term indicates in this kind of tool.",
                    "label": 0
                },
                {
                    "sent": "It is the dictionary that is the central element and the starting point for computer assisted language applications, and in the case of Qualcomm dictionary, it is obviously the opposite.",
                    "label": 0
                },
                {
                    "sent": "The call system is central and the dictionary is added as an aid.",
                    "label": 0
                },
                {
                    "sent": "A survey of the two fields shows that the most effective integration to date.",
                    "label": 0
                },
                {
                    "sent": "Has been achieved in the area of reading activities.",
                    "label": 1
                },
                {
                    "sent": "And one of the techniques that have been used most.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is that of textual glasses created by the teacher or materials designer to explain difficult words in a text?",
                    "label": 1
                },
                {
                    "sent": "The glasses become visible with a simple click on a word or by hovering the mouse over it.",
                    "label": 1
                },
                {
                    "sent": "Now the good thing about this type of gloss.",
                    "label": 0
                },
                {
                    "sent": "Is that they are contextualized, so if the text contains the sequence in a little while while will be glossed as period of time and not as the conjunction of subordination while.",
                    "label": 0
                },
                {
                    "sent": "The other good thing is that they work.",
                    "label": 1
                },
                {
                    "sent": "They've been proved to work in a lot of studies.",
                    "label": 1
                },
                {
                    "sent": "They've been proved to have a positive effect on reading comprehension and language learning.",
                    "label": 0
                },
                {
                    "sent": "However, there are downsides too.",
                    "label": 0
                },
                {
                    "sent": "And the first downside is that this kind of textual link cannot be used with takes that have not been glossed in advance.",
                    "label": 0
                },
                {
                    "sent": "And therefore these type of gloss is extremely time consuming, both for teachers and materials designers.",
                    "label": 0
                },
                {
                    "sent": "Another",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What type of writing aid is the dictionary look up facility?",
                    "label": 0
                },
                {
                    "sent": "This tool provides direct access to the relevant entry in the Electronic Dictionary for any word in a text by just clicking on it.",
                    "label": 1
                },
                {
                    "sent": "The advantage of this type of tool is that it can be used with any text, even a text on the web.",
                    "label": 1
                },
                {
                    "sent": "But the glass or the dictionary entry in a way, is not contextualized, and hence requires more skills and time on the part of the user, especially for long entries like for the verb to fit, or in the case of homographs.",
                    "label": 1
                },
                {
                    "sent": "And there are many of those in English, so safe can be a verb and noun or preposition.",
                    "label": 0
                },
                {
                    "sent": "And also in the case of multiword units like heavy Rain or make heavy weather of something.",
                    "label": 0
                },
                {
                    "sent": "Now the technology for more intelligent look up.",
                    "label": 0
                },
                {
                    "sent": "It seems to be available.",
                    "label": 0
                },
                {
                    "sent": "But is not yet implemented in the majority of tools.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Whitelock and Edmonds describe the sharp intelligent Dictionary, which is characterized by its connectivity.",
                    "label": 0
                },
                {
                    "sent": "That is, the dictionary provides the user with the correct equivalent for word used in the passage at hand.",
                    "label": 1
                },
                {
                    "sent": "And the tool rests on two technologies.",
                    "label": 0
                },
                {
                    "sent": "On the one hand, part of speech disambiguation.",
                    "label": 0
                },
                {
                    "sent": "So for instance, to take the example of, while again it would disambiguate, while as a noun or a conjunction.",
                    "label": 0
                },
                {
                    "sent": "And recognition of multi word units.",
                    "label": 1
                },
                {
                    "sent": "Units like let go of or in relationship to.",
                    "label": 0
                },
                {
                    "sent": "The latter functionality is very important as a large proportion of words in texts belong to multi word units.",
                    "label": 0
                },
                {
                    "sent": "Whitelock and Edmonds speak of 20 to 50% of the word tokens obviously depends on your definition of multi word units and the authors report a precision rate of 89% recognition, which is quite impressive.",
                    "label": 0
                },
                {
                    "sent": "We heard from Peter White logs talk yesterday that an intelligent look up facility is now integrated in Oxford Dictionaries Online, though if I understood correctly, this is not the case for all entries and certainly not for long entries.",
                    "label": 0
                },
                {
                    "sent": "But Peter might want to add something later, perhaps now that's for reading and Reading's been spoilt in a way.",
                    "label": 0
                },
                {
                    "sent": "What about writing?",
                    "label": 0
                },
                {
                    "sent": "Well, I find the situation for writing pretty dismal personally.",
                    "label": 0
                },
                {
                    "sent": "And the.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It is because the link between the computer assisted language learning environment and the Electronic Dictionary is either absent or largely ineffective for writing activities.",
                    "label": 1
                },
                {
                    "sent": "And this is doubly paradoxical, because on the one hand, learner needs are particularly acute for writing.",
                    "label": 1
                },
                {
                    "sent": "And on the other hand, when you think of it, remarkable efforts have been made to turn dictionaries into efficient, productive tool and productive means.",
                    "label": 0
                },
                {
                    "sent": "Here mainly writing tools and Michael Randall, of course played a major part in this development.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now it is interesting to compare.",
                    "label": 0
                },
                {
                    "sent": "The description given by nation of learners purpose is for dictionary use for reading and writing.",
                    "label": 0
                },
                {
                    "sent": "And as you can see from this slide, the list is much longer for writing than for reading.",
                    "label": 0
                },
                {
                    "sent": "For writing Nation, list the following purposes look up unknown words needed to write look up spelling, meaning grammar constraints on used collocations, inflections, and derived forms of partly known words confirm the spelling meaning of known words.",
                    "label": 1
                },
                {
                    "sent": "Check that a word exists.",
                    "label": 1
                },
                {
                    "sent": "Find a different word to use instead of a known one, and correct an error.",
                    "label": 0
                },
                {
                    "sent": "Once for reading, there were only three rubrics.",
                    "label": 1
                },
                {
                    "sent": "Look up unknown words.",
                    "label": 0
                },
                {
                    "sent": "Confirm the meaning of partly known words and confirm guesses from context.",
                    "label": 0
                },
                {
                    "sent": "Soap learners have a multiplicity of writing related needs.",
                    "label": 0
                },
                {
                    "sent": "What help are they getting?",
                    "label": 0
                },
                {
                    "sent": "Now let's look.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At some writing oriented functionalities that are available today, not all of them.",
                    "label": 0
                },
                {
                    "sent": "I mean, I couldn't.",
                    "label": 0
                },
                {
                    "sent": "Possibly, but I would.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Like to focus on five writing oriented functionalities and I will start with dictionary.",
                    "label": 0
                },
                {
                    "sent": "Look up again.",
                    "label": 0
                },
                {
                    "sent": "But this time's in the perspective of writing.",
                    "label": 0
                },
                {
                    "sent": "Then concordance seeing link to Collocate Artool vocabulary profiling and error warning.",
                    "label": 1
                },
                {
                    "sent": "And I'd like to point out and this is extremely important that I'm going to focus on monolingual searches only.",
                    "label": 0
                },
                {
                    "sent": "I will leave translation searches aside today.",
                    "label": 0
                },
                {
                    "sent": "So let's start with dictionary look up.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now dictionary look up facilities.",
                    "label": 0
                },
                {
                    "sent": "Take the writer.",
                    "label": 0
                },
                {
                    "sent": "From any word in a text to the dictionary.",
                    "label": 0
                },
                {
                    "sent": "But unfortunately the link takes the writer to the full headward entry.",
                    "label": 1
                },
                {
                    "sent": "There is no direct access to the specific type of information he or she might be looking for, which can be the level of formality, the frequency, the collocations of the word, etc.",
                    "label": 1
                },
                {
                    "sent": "This can be illustrated with a wide range of tools.",
                    "label": 0
                },
                {
                    "sent": "I've decided to illustrate this on the basis of oops writing a tool called the Oxford IRA.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Later.",
                    "label": 0
                },
                {
                    "sent": "And this tool contains a lot of functionalities which are extremely useful, including pop-up dictionary.",
                    "label": 0
                },
                {
                    "sent": "So a writer.",
                    "label": 0
                },
                {
                    "sent": "Weiss typing is text and the writer will be typing his text here in the interface.",
                    "label": 0
                },
                {
                    "sent": "I can't explain what all the rest is, but.",
                    "label": 0
                },
                {
                    "sent": "And the sentence is they were anxious to get the support from each state.",
                    "label": 1
                },
                {
                    "sent": "Now, the writer who's writing this may want to check.",
                    "label": 0
                },
                {
                    "sent": "Whether the word gets is the best verb to use with support and may want to check whether from is the right preposition to use with support.",
                    "label": 0
                },
                {
                    "sent": "So what the writer would do would be to click on this word support in the interface and then the pop-up dictionary would open.",
                    "label": 0
                },
                {
                    "sent": "Now once it open.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Obviously this is what you see.",
                    "label": 0
                },
                {
                    "sent": "You've got to go to.",
                    "label": 1
                },
                {
                    "sent": "Go entry, click on that icon and you're taken to the entry for support.",
                    "label": 0
                },
                {
                    "sent": "Once you're there, you can see that the entry starts with the verb, so you will need to click on noun to get to the noun entry.",
                    "label": 0
                },
                {
                    "sent": "And once you're there.",
                    "label": 0
                },
                {
                    "sent": "Then you will need to spend quite a bit of time to find the answer to your query.",
                    "label": 0
                },
                {
                    "sent": "You can see and that is in principle a very good point that there is a menu at the top of the entry for the noun, but unfortunately there is no collocation box.",
                    "label": 0
                },
                {
                    "sent": "What you will find instead is a box here with Word Origin, which is the etymology of the word, which is not at all relevant for writing.",
                    "label": 0
                },
                {
                    "sent": "I mean that you have no need for that.",
                    "label": 0
                },
                {
                    "sent": "When you want to know how to write or how to use the word support, there is also another box which is an example bank.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there if you click on example bank, you are taken to a list of about 50 examples of support of the noun support, but there is no particular highlighting for any of the collocations or particular specific patterning of the noun support.",
                    "label": 0
                },
                {
                    "sent": "Now I'm not really sure how many writers will have the time and energy to go through so many clicks and then read the whole entry or read the list of examples to find out how to use the noun support.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Along man writing assistant does better in a way as it gives access to four types of information.",
                    "label": 1
                },
                {
                    "sent": "So there's a menu called Thesaurus, another one called grammar, then collocations and errors.",
                    "label": 0
                },
                {
                    "sent": "However, the information provided can be very disappointing.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For example, here again, you can write your sentence.",
                    "label": 0
                },
                {
                    "sent": "The video shows you how to avoid to have a heart attack.",
                    "label": 0
                },
                {
                    "sent": "Now this is not correct in English.",
                    "label": 0
                },
                {
                    "sent": "It should be avoid having.",
                    "label": 0
                },
                {
                    "sent": "If the writer wants to check what form of the verb you need to use after avoid, I think the writer will quite spontaneously click on grammar, because that's for him is grammar.",
                    "label": 0
                },
                {
                    "sent": "It's certainly not thesaurus and not really collocations, and clicking on grammar.",
                    "label": 0
                },
                {
                    "sent": "What the writer will get is a list of the derived and inflected forms of the verb avoid.",
                    "label": 0
                },
                {
                    "sent": "So you have Word family avoid avoidance.",
                    "label": 0
                },
                {
                    "sent": "Unavoidably and etc and you have the verb forms.",
                    "label": 0
                },
                {
                    "sent": "Avoid avoids avoided avoiding, but for advanced learners they know that right.",
                    "label": 0
                },
                {
                    "sent": "They and especially as English, has very little morphology.",
                    "label": 0
                },
                {
                    "sent": "It's not really very useful, except perhaps for irregular verbs.",
                    "label": 0
                },
                {
                    "sent": "So another functionality that can help, right?",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As.",
                    "label": 0
                },
                {
                    "sent": "Is Concorde and see and a good example of the use of Concorde and seeing in a writing aid environment is Tom Cubs Concorde writer.",
                    "label": 0
                },
                {
                    "sent": "Tom Cobbs Tool allows writers to write a text and click on any word in the text to get a concordance concordance for a word or several words.",
                    "label": 0
                },
                {
                    "sent": "And then which allows them to check their contextual patterning.",
                    "label": 0
                },
                {
                    "sent": "You can see the first few lines of the concordance here.",
                    "label": 0
                },
                {
                    "sent": "And once they've done that, they can click on a range of dictionaries to get more information on the words.",
                    "label": 0
                },
                {
                    "sent": "So you keep in your text.",
                    "label": 0
                },
                {
                    "sent": "Here you can see I've keyed in the beginning of a sentence with the word jeopardized, and if you click on jeopardized then and you select a corpus, there are several corpora that are available.",
                    "label": 0
                },
                {
                    "sent": "You get the concordance and then you click on a range of dictionaries.",
                    "label": 0
                },
                {
                    "sent": "Here English, French, English, English, etc.",
                    "label": 0
                },
                {
                    "sent": "And the dictionary opens all within the same window.",
                    "label": 0
                },
                {
                    "sent": "I mean, I think that's the main point.",
                    "label": 0
                },
                {
                    "sent": "Now, there's no denying that.",
                    "label": 0
                },
                {
                    "sent": "Having direct access to Concordances.",
                    "label": 0
                },
                {
                    "sent": "From your writing environment in a range of corpora.",
                    "label": 0
                },
                {
                    "sent": "It can be extremely useful to hire intermediate to advanced writers.",
                    "label": 0
                },
                {
                    "sent": "However, I would certainly not go as far as gobble.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Who claims that Concordances are superior?",
                    "label": 0
                },
                {
                    "sent": "Two traditional grammar books, dictionaries, and course books because they allow easy access to huge amounts of real language in use.",
                    "label": 1
                },
                {
                    "sent": "Now the highlighting and underlining is mine, right?",
                    "label": 0
                },
                {
                    "sent": "I think what is striking is to see that concordances are presented as competitors in a way for dictionaries and grammars.",
                    "label": 0
                },
                {
                    "sent": "Now in this connection, I must admit that I'm really at one with Adam Kilgarriff.",
                    "label": 0
                },
                {
                    "sent": "Yes, that happens from time to time.",
                    "label": 1
                },
                {
                    "sent": "Who phone said that most learners don't want to be corpus linguists and concordances are unfamiliar and difficult objects, while dictionaries are familiar from an early age, so you can see that the two positions are completely opposite positions.",
                    "label": 0
                },
                {
                    "sent": "For me, Concordances have a place in the learners writing environment, but certainly not as the first resource, certainly not as the first kind of aid that writers should turn to.",
                    "label": 0
                },
                {
                    "sent": "A third.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Type of aid that is provided takes the form of a link to a color cater tool.",
                    "label": 0
                },
                {
                    "sent": "This is the case with John Milton's writing assistant called Check My Words.",
                    "label": 1
                },
                {
                    "sent": "And all the references are we on your handout as well as the links to the websites to all these tools.",
                    "label": 0
                },
                {
                    "sent": "For grammar within this tool, check my words writers get a great deal of assistance for grammar within the program, and I won't describe this today, but it's really nice.",
                    "label": 0
                },
                {
                    "sent": "But for LEXIS, the writer is referred to a web based tool which is not part of the check My Words program.",
                    "label": 0
                },
                {
                    "sent": "A web based tool called Word Neighbors.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "When they.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Go to word neighbors.",
                    "label": 0
                },
                {
                    "sent": "This is what they.",
                    "label": 0
                },
                {
                    "sent": "This is what the interface looks like.",
                    "label": 0
                },
                {
                    "sent": "What you do is you first have to key in your item, then select noun or verb or adjective.",
                    "label": 0
                },
                {
                    "sent": "So there is disambiguation here and then specify a span for your search.",
                    "label": 0
                },
                {
                    "sent": "And once you've done that, you can see that instead of concordances you actually get patterns, which is really nice.",
                    "label": 0
                },
                {
                    "sent": "So adjective plus, noun determiners, noun noun plus noun.",
                    "label": 0
                },
                {
                    "sent": "And you can click further and if you click further, you have the actual color kits that appear with their frequencies.",
                    "label": 0
                },
                {
                    "sent": "Now, it's certainly a very good tool.",
                    "label": 0
                },
                {
                    "sent": "Very useful one, but learners have to master to use the interface, and in particular the span option, which is not that obvious to use for writers.",
                    "label": 0
                },
                {
                    "sent": "I think for non experts.",
                    "label": 0
                },
                {
                    "sent": "And then they have to go through a number of stages to get to the information they are interested in, so it's still in a way of hard work.",
                    "label": 0
                },
                {
                    "sent": "Another functionality I'd like to mention is vocabulary profiling.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Vocabulary profiling allows you to highlight some words in your text.",
                    "label": 1
                },
                {
                    "sent": "For example Tom Cobbs vocab profile tool highlights words belonging to different frequency bands in different colors.",
                    "label": 0
                },
                {
                    "sent": "Looks very nice.",
                    "label": 0
                },
                {
                    "sent": "It's really nice for teachers.",
                    "label": 0
                },
                {
                    "sent": "Actually, I quite like that.",
                    "label": 0
                },
                {
                    "sent": "Similarly, the Oxfords eyewriter allows the writer to highlight academic words in his or her text by clicking.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On the as you can see here, by clicking on the highlight Academic Word list icon, you can see that all the academic world words in the learners text are highlighted in red.",
                    "label": 1
                },
                {
                    "sent": "These are words like facilitate explicit awareness, traditional their words from Avril coxhead's academic word list, not our own list which magaly refer to yesterday, which is a bit different.",
                    "label": 0
                },
                {
                    "sent": "And this is the academic keyword list.",
                    "label": 0
                },
                {
                    "sent": "Now again, this is a potentially very useful functionality, but unfortunately the highlighted words are simply linked linked to the general entry in the dictionary, and so do not provide any help as regards the specific patterning of these words in academic text, so you highlight them, But actually, for writing you'd like to have a bit more help.",
                    "label": 0
                },
                {
                    "sent": "For as regards this specific patterning.",
                    "label": 0
                },
                {
                    "sent": "And find.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Writers can be greatly helped if their attention is drawn to potential errors.",
                    "label": 0
                },
                {
                    "sent": "Every warnings rely on the analysis of learner corpus data.",
                    "label": 1
                },
                {
                    "sent": "They can take the form of error nodes in learners dictionaries and this is the case in the Macmillan Dictionary where we have over 100.",
                    "label": 0
                },
                {
                    "sent": "Get it right boxes based on the international corpus of our learning English and these boxes were designed by our team in Nova.",
                    "label": 1
                },
                {
                    "sent": "And you have an errors icon.",
                    "label": 0
                },
                {
                    "sent": "I showed you a few minutes ago.",
                    "label": 0
                },
                {
                    "sent": "It's one of the boxes in the menu.",
                    "label": 0
                },
                {
                    "sent": "You have an errors icon in the Longman writing assistant, and there the analysis is based on the Longman learner's corpus.",
                    "label": 1
                },
                {
                    "sent": "But the error warnings can also appear automatically when learners are writing.",
                    "label": 0
                },
                {
                    "sent": "This type of highlighting this kind of warning is implemented in Milton's writing a check my words so.",
                    "label": 0
                },
                {
                    "sent": "The tool highlights words and phrases that are often used incorrectly by Chinese learners of English.",
                    "label": 1
                },
                {
                    "sent": "It doesn't say it's an error.",
                    "label": 0
                },
                {
                    "sent": "It says this could be an error.",
                    "label": 0
                },
                {
                    "sent": "It might be good to check, right?",
                    "label": 0
                },
                {
                    "sent": "It's just just a warning.",
                    "label": 0
                },
                {
                    "sent": "The limitation, as I've already said, is that the focus is very much on grammar rather than on LEXIS for LEXIS.",
                    "label": 0
                },
                {
                    "sent": "The users are refer to this external tool for patterning.",
                    "label": 0
                },
                {
                    "sent": "Now, this brief survey shows that there are quite a few tools.",
                    "label": 0
                },
                {
                    "sent": "And quite good tools at that that can really help learners, right?",
                    "label": 0
                },
                {
                    "sent": "But it is also clear.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That the coverage of writing needs is patchy.",
                    "label": 1
                },
                {
                    "sent": "If you think of nations list.",
                    "label": 0
                },
                {
                    "sent": "Um, that I showed a few minutes ago.",
                    "label": 1
                },
                {
                    "sent": "It is clear that not all user writing needs are covered.",
                    "label": 0
                },
                {
                    "sent": "There is an abundance of tools.",
                    "label": 0
                },
                {
                    "sent": "And that characterizes today's landscape.",
                    "label": 1
                },
                {
                    "sent": "I think it's this abundance of tools.",
                    "label": 0
                },
                {
                    "sent": "With each tool catering for a portion, sometimes a very small portion of the needs.",
                    "label": 1
                },
                {
                    "sent": "Another thing that comes out is that a lot of time and effort is required from writers to access the production oriented information they need.",
                    "label": 1
                },
                {
                    "sent": "And the user has no control over the type of information provided.",
                    "label": 0
                },
                {
                    "sent": "And last, but certainly not least, most tools target generic learners.",
                    "label": 0
                },
                {
                    "sent": "There's no customization in terms of learners mothertongue, background, targeted language, variety, or task.",
                    "label": 0
                },
                {
                    "sent": "Faced with this situation.",
                    "label": 0
                },
                {
                    "sent": "I would like very modestly to suggest three priorities for closer integration between call and electronic dictionaries.",
                    "label": 0
                },
                {
                    "sent": "Focusing as I've said on monolingual searches in English.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's start with the first priority enhanced exploitation of the database structure of dictionary.",
                    "label": 0
                },
                {
                    "sent": "This priority relies on the very definition of electronic Dick.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Trees.",
                    "label": 0
                },
                {
                    "sent": "As structured, my underlying electronic data that can be accessed with multiple tools enhanced with a wide range of functionalities and used in various environments.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And selected facts about words are stored in different fields in present day dictionaries and there is many of these fields.",
                    "label": 1
                },
                {
                    "sent": "This is just a few that immediately came to mind.",
                    "label": 0
                },
                {
                    "sent": "I'm an EOT teacher, both language and linguistics, and these are all very relevant and they're all in different fields in the dictionary.",
                    "label": 0
                },
                {
                    "sent": "And the result of this structured format is that, as noted by Atkins and Randall.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Much of the information in the database is accessible to computerize searching and filtering.",
                    "label": 1
                },
                {
                    "sent": "So in principle it should be possible for writers to access the different types of information separately in function of their needs.",
                    "label": 1
                },
                {
                    "sent": "In reality this is not implemented or fully implemented.",
                    "label": 0
                },
                {
                    "sent": "There are exceptions, of course, and we heard from Server Linden Keynote Lecture yesterday that there are efforts that are being made to counter this and Sarah has written extensively on this and he describes different access possibilities for writing, reading and translating.",
                    "label": 0
                },
                {
                    "sent": "But this line of research is still quite rare on the whole.",
                    "label": 0
                },
                {
                    "sent": "And there's very little to show for it in the current tools.",
                    "label": 0
                },
                {
                    "sent": "Now, if the dictionary is integrated into a wider database system as, I will be arguing in a minute.",
                    "label": 0
                },
                {
                    "sent": "Then writers can get.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Direct access to different types of productively relevant information via icons that they can turn on or off sofa rings.",
                    "label": 1
                },
                {
                    "sent": "For example, you can decide to turn off on the collocation box or the formality level box, but leave the frequency or geographical variety box turned off.",
                    "label": 0
                },
                {
                    "sent": "At first the system would be what Gamper had snapped, called an adaptable system that is a system involving manual customization by the user.",
                    "label": 1
                },
                {
                    "sent": "But thanks to the dictionary logs, the system could evolve into an adaptive system that is a system that automatically adapts to the user.",
                    "label": 0
                },
                {
                    "sent": "Uses of the dictionary would have the choice between 2 Council.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Asian modes.",
                    "label": 0
                },
                {
                    "sent": "On the fly and batch mode.",
                    "label": 1
                },
                {
                    "sent": "If they go for the Under Fly Consultation mode then they would just click on the relevant tab wise they writing and the teacher would actually do exactly the same thing while he or she is marking the students takes.",
                    "label": 1
                },
                {
                    "sent": "In batch mode, then the student would use these functionalities after his written his text and the teacher would have the option of using it either before marking or after marking.",
                    "label": 0
                },
                {
                    "sent": "So let's let's have a look at the batch mode in more detail.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So students have the option of highlighting a range of features in their text after they've written it.",
                    "label": 1
                },
                {
                    "sent": "So, for instance, they could.",
                    "label": 0
                },
                {
                    "sent": "They may be interested, and I think a lot of students would be interested in highlighting different frequency bands in their text because they are often asked not to use basic vocabulary, right?",
                    "label": 0
                },
                {
                    "sent": "So they may want to know how many basic vocabulary word they've used.",
                    "label": 0
                },
                {
                    "sent": "But also this could be adapted because it could be curriculum or exam specific vocabulary lists that are I'll are highlighted in their text.",
                    "label": 0
                },
                {
                    "sent": "Also, the writer could ask to see the stylistically marked words so highly formal, archaic, informal, taboo words would be highlighted.",
                    "label": 0
                },
                {
                    "sent": "And obviously, potential errors would also be highlighted automatically.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The teachers could use the same functionalities to get additional information on learners text before they start marking or when they finished marking to get additional information, things that they may have missed.",
                    "label": 0
                },
                {
                    "sent": "The second priority.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Integration of the dictionary into learning management systems.",
                    "label": 0
                },
                {
                    "sent": "Writing activities.",
                    "label": 0
                },
                {
                    "sent": "Are only a part actually of a wider language learning environment?",
                    "label": 0
                },
                {
                    "sent": "Which today is usually embedded within a learning management system, an LMS.",
                    "label": 0
                },
                {
                    "sent": "Now, what exactly is a learning management system?",
                    "label": 0
                },
                {
                    "sent": "Graphic L provide a good def.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Mission.",
                    "label": 0
                },
                {
                    "sent": "LMS is provide teachers with many features to create, manage, and administrate online courses, allowing them to include different kinds of learning objects or activities such as learning material, forums, quizzes, examples and so on, and facilitating administrative issues such as enrollment, grading and monitoring.",
                    "label": 1
                },
                {
                    "sent": "The learners progress and performance.",
                    "label": 0
                },
                {
                    "sent": "The main asset of learning management systems for both teachers and learners is integration.",
                    "label": 0
                },
                {
                    "sent": "Learning management systems are very popular.",
                    "label": 0
                },
                {
                    "sent": "According to a survey conducted this year, seven 373% of students use an LMS.",
                    "label": 0
                },
                {
                    "sent": "And among these, moudle really stands out.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Moodle is an open source LMS used by about 1.1 million teachers and more than 38 million users.",
                    "label": 1
                },
                {
                    "sent": "I use it for all my courses at Louvar and I really enjoy it and I wish that dictionaries could be integrated within them, so that's why I'm preaching this today.",
                    "label": 0
                },
                {
                    "sent": "The tool model is constantly updated.",
                    "label": 0
                },
                {
                    "sent": "And the latest version allows for integration with third party, an external tools like Flickr or Google Docs.",
                    "label": 0
                },
                {
                    "sent": "And there's also a mobile app which provides access to the Moodle LMS and allows for example students to capture audio on iPhone and upload it to the LMS.",
                    "label": 0
                },
                {
                    "sent": "Now the type of electronic dictionary that I described a few minutes ago and the axis that I described would be at the center of the lexical component of the.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "LMS.",
                    "label": 0
                },
                {
                    "sent": "You can see Electronic dictionary in the middle right?",
                    "label": 1
                },
                {
                    "sent": "Now the interface would include two different environments.",
                    "label": 0
                },
                {
                    "sent": "The students writing environment and the teachers marking environment.",
                    "label": 1
                },
                {
                    "sent": "This is a configuration which is already implemented in two writing assistance Wible it alls I will system and Milton's check my words which is for the students and mark my words which is for the teachers that two parts.",
                    "label": 0
                },
                {
                    "sent": "No, the logs here are extremely important.",
                    "label": 0
                },
                {
                    "sent": "The logs collected from consultation of the dictionary by both student and teacher, provide very useful information that can help dictionary publishers assess which functionality's are used most and which are never used and on that basis prioritize some features over others.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This diagram here now shows the wider picture.",
                    "label": 0
                },
                {
                    "sent": "This is how the system works.",
                    "label": 0
                },
                {
                    "sent": "Everything starts with the students as we all know.",
                    "label": 0
                },
                {
                    "sent": "The student composes an essay or any text that he's been asked to write.",
                    "label": 0
                },
                {
                    "sent": "Within this environment.",
                    "label": 0
                },
                {
                    "sent": "And consulting when need be the electronic dictionary.",
                    "label": 1
                },
                {
                    "sent": "And when he's finished writing, he sends the text to the teacher within the environment of the learning management system.",
                    "label": 0
                },
                {
                    "sent": "Then the teacher will mock the text and he or she will insert comments in the students essay using a standardized error marking system.",
                    "label": 0
                },
                {
                    "sent": "It's important for it to be standardized and the teacher.",
                    "label": 0
                },
                {
                    "sent": "Once he's done that, will send the.",
                    "label": 0
                },
                {
                    "sent": "The text back to the students.",
                    "label": 0
                },
                {
                    "sent": "Now this arrow should be a double shafted arrows, right?",
                    "label": 0
                },
                {
                    "sent": "So there's a back and forth between the teacher and the student.",
                    "label": 0
                },
                {
                    "sent": "Now, what is important here, my mouse is not working, yeah?",
                    "label": 0
                },
                {
                    "sent": "Is this?",
                    "label": 0
                },
                {
                    "sent": "Um teachers error annotations.",
                    "label": 0
                },
                {
                    "sent": "Because teachers mark errors with a standardized system.",
                    "label": 0
                },
                {
                    "sent": "The error annotations will help populate a vocabulary error bank.",
                    "label": 1
                },
                {
                    "sent": "Which in turn can be used to design vocabulary exercises that target learners most frequent errors.",
                    "label": 0
                },
                {
                    "sent": "And this can be done per group of students per mother, down background, etc, of course.",
                    "label": 1
                },
                {
                    "sent": "And can also help design A lexical checker of Akabri Checker, which will draw students but also teachers attention to potential errors.",
                    "label": 0
                },
                {
                    "sent": "The system also allows the teachers to build a very large collection of L2 text, enriched with error annotations as part of their daily activities.",
                    "label": 0
                },
                {
                    "sent": "And the system, as you can see, also includes corpora and corpus handling tool that both students and teachers can use.",
                    "label": 0
                },
                {
                    "sent": "This is my dream.",
                    "label": 0
                },
                {
                    "sent": "This is my vision.",
                    "label": 0
                },
                {
                    "sent": "I think one is allowed to dream from time to time.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The third priority is the design of customizable specialized modules.",
                    "label": 1
                },
                {
                    "sent": "Most writing age tools target.",
                    "label": 0
                },
                {
                    "sent": "As I've said, the generic learner.",
                    "label": 0
                },
                {
                    "sent": "Whoever that is.",
                    "label": 0
                },
                {
                    "sent": "Now this is fine up to a point.",
                    "label": 0
                },
                {
                    "sent": "It is clear that a large amount of information about words is valid in all texts.",
                    "label": 0
                },
                {
                    "sent": "Avoid is always followed by the gerund.",
                    "label": 0
                },
                {
                    "sent": "To jeopardize always means to put in danger.",
                    "label": 0
                },
                {
                    "sent": "But in addition to this Common Core, different registers of English call for more specific information.",
                    "label": 0
                },
                {
                    "sent": "And as Maggie Pacu pointed out in her talk yesterday, this is particularly true for English for academic purposes EAP.",
                    "label": 0
                },
                {
                    "sent": "AP Constitutes a big challenge for many non native speakers of English.",
                    "label": 0
                },
                {
                    "sent": "As English has become the language of academia.",
                    "label": 0
                },
                {
                    "sent": "And non native writers really need help to use EAP words in their correct AP specific patterning.",
                    "label": 0
                },
                {
                    "sent": "At Luther, we've been working in this area for eight years now.",
                    "label": 0
                },
                {
                    "sent": "Ann in the few minutes I have left, I would like to say a few words about our past work in the field in collaboration with McMillan and the project we are currently working on thanks to a ground from the Belgian National Research Fund.",
                    "label": 0
                },
                {
                    "sent": "Let's start at the beginning and that.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hours.",
                    "label": 0
                },
                {
                    "sent": "Our collaboration with Macmillan, where we contributed an extended improve your writing section writing skills section.",
                    "label": 1
                },
                {
                    "sent": "For the second edition of the Macmillan English Dictionary, the section is centered on 12 major rhetorical functions.",
                    "label": 0
                },
                {
                    "sent": "How do you introduce a topic?",
                    "label": 0
                },
                {
                    "sent": "How do you contrast?",
                    "label": 0
                },
                {
                    "sent": "How do you exemplify?",
                    "label": 0
                },
                {
                    "sent": "How do you conclude?",
                    "label": 0
                },
                {
                    "sent": "And we describe a very, very rich description of the specific EAP words and phrases that are used to express these functions.",
                    "label": 1
                },
                {
                    "sent": "We focus a lot on phraseology, and we've used the international corpus of Learner English to highlight learners difficulties.",
                    "label": 0
                },
                {
                    "sent": "Not only errors, but also words that are overused and underused and the idea was to try and enlarge learners lexical repertoire right, which is usually very limited in this area.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the good thing about this project is that the material that has been included is extremely rich and I think relevant for writers.",
                    "label": 0
                },
                {
                    "sent": "But and also that the work work has been the result of a very successful collaboration between and I can't stress this enough.",
                    "label": 0
                },
                {
                    "sent": "Trained lexicographers on the one hand and experience TLT specialists on the other.",
                    "label": 1
                },
                {
                    "sent": "But there are downsides as well, and one is that there is no integration or reintegration of the writing section on the CDROM.",
                    "label": 1
                },
                {
                    "sent": "This section is not linked even to the dictionary.",
                    "label": 1
                },
                {
                    "sent": "And also that the dictionary being a generic dictionary, we could not include a lot of interesting errors because they were restricted to some languages or language families, so we couldn't include them.",
                    "label": 0
                },
                {
                    "sent": "That was very frustrating.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now with A view to overcoming of these shortcomings, we started a new project, the aim of which is to design an integrated web based tool to help non native speakers write academic text in English.",
                    "label": 1
                },
                {
                    "sent": "And I want to be very brief here because we gave a talk at the preceding elects conference and you can read the paper in the elect proceedings.",
                    "label": 0
                },
                {
                    "sent": "But just a few words.",
                    "label": 0
                },
                {
                    "sent": "The new features are the multiplicity of access modes and customization in terms of discipline and mother tongue background.",
                    "label": 1
                },
                {
                    "sent": "Also, the tool has integrated E AP focused exercises and direct access to AP and ESP corpora.",
                    "label": 0
                },
                {
                    "sent": "I would just say a few words about the 1st two of these feet.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As.",
                    "label": 0
                },
                {
                    "sent": "Now the information in the dictionary can be accessed in three different ways.",
                    "label": 0
                },
                {
                    "sent": "The traditional way you think of a word like, however or.",
                    "label": 0
                },
                {
                    "sent": "Moreover, you're not really sure whether it's the right word to use.",
                    "label": 0
                },
                {
                    "sent": "You can check it in the dictionary.",
                    "label": 0
                },
                {
                    "sent": "But even with advanced learners, quite often, non native speakers still think in their mother tongue quite a lot right?",
                    "label": 0
                },
                {
                    "sent": "So we'll think of a link word or a way of saying things in their mother tongue and not really know how to convey that in English.",
                    "label": 0
                },
                {
                    "sent": "So we provide an entry via the translation into the user's mother tongue.",
                    "label": 0
                },
                {
                    "sent": "So the dictionary is actually a bilingual eyes dictionary.",
                    "label": 0
                },
                {
                    "sent": "And very importantly, I think the third option is very important.",
                    "label": 0
                },
                {
                    "sent": "You can search by function.",
                    "label": 1
                },
                {
                    "sent": "So if you want to conclude or you want to quote, then you can click on the menu.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can see here to the left and when you click you have access to all the devices, all the terms and phrases that are in the dictionary and then by clicking again you have all the information about that particular word or phrase.",
                    "label": 0
                },
                {
                    "sent": "The second.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Point, which is very important is customize ability.",
                    "label": 0
                },
                {
                    "sent": "The content is automatically adapted to user needs in terms of mothertongue.",
                    "label": 1
                },
                {
                    "sent": "Background.",
                    "label": 0
                },
                {
                    "sent": "For the moment, we cover French and Dutch, but we hope that more will come and discipline.",
                    "label": 0
                },
                {
                    "sent": "For the moment we only have 3 business, linguistics and medicine, but here again we'd like to add more.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the opening screen of the dictionary.",
                    "label": 0
                },
                {
                    "sent": "Magaly showed it yesterday.",
                    "label": 0
                },
                {
                    "sent": "The first thing you need to do is to select your discipline.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "Business has been chosen and the mother tongue background here French.",
                    "label": 0
                },
                {
                    "sent": "And then the content of.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The dictionary is adapted.",
                    "label": 0
                },
                {
                    "sent": "So for instance, you can see that here if you've chosen business, the examples you get will be from business and this is, I think, very important in Jens Allen Airline Sense Talk.",
                    "label": 0
                },
                {
                    "sent": "Yesterday very good talk.",
                    "label": 0
                },
                {
                    "sent": "He talked about a lot of aspects of electronic lexicography, and one of them was engagement.",
                    "label": 0
                },
                {
                    "sent": "You want to engage with this tool?",
                    "label": 0
                },
                {
                    "sent": "How can you engage if you're a businessman and the example given is from fiction or from a theology book?",
                    "label": 0
                },
                {
                    "sent": "I think there is a problem there.",
                    "label": 0
                },
                {
                    "sent": "Right, you read a sentence is not relevant to you at all.",
                    "label": 0
                },
                {
                    "sent": "So I think if only at the level of examples, it's good to have examples that are relevant.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And also L1 customization is very important because here our frustration of not being able to include L1 specific error nodes.",
                    "label": 0
                },
                {
                    "sent": "Well, we could at least implement them here.",
                    "label": 0
                },
                {
                    "sent": "You have a note for French speakers.",
                    "label": 0
                },
                {
                    "sent": "Do not use according to me as a translation of soloma use in my opinion, because French learners often use according to me.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Reed is currently a standalone tool, but we would like to integrate it into a wider environment and our inspiration comes from Michael Randles.",
                    "label": 0
                },
                {
                    "sent": "He's a great inspiration from Michaels Randles mix and match scenario, which he describes as follows.",
                    "label": 0
                },
                {
                    "sent": "A possible scenario is to see our reference materials as a set of components which customers can mix and match according to their needs.",
                    "label": 1
                },
                {
                    "sent": "For example, a learner from China doing a master in agriculture at a British University could have access to a core Lt dictionary.",
                    "label": 0
                },
                {
                    "sent": "With the option of Chinese translations, academic writing aids and subject specific terminology.",
                    "label": 0
                },
                {
                    "sent": "Within the type of environment I described earlier.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The lead module could be used under fly.",
                    "label": 0
                },
                {
                    "sent": "You would have direct access to the AP.",
                    "label": 0
                },
                {
                    "sent": "Module wise you right or it could be used after you've written and there you would see all the EAP words highlighted in your text and potential errors highlighted as well in function of learners L1, which is very important.",
                    "label": 1
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Conclusion.",
                    "label": 0
                },
                {
                    "sent": "And I would like to conclude with a quote from Butler Paskow very recent article on the history of Computer Assisted Language.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Learning.",
                    "label": 0
                },
                {
                    "sent": "And the quote says one major challenge for call practitioners is the need to harness the vast assortment of technology resources in a manner that capitalizes on the opportunities they present to meet pedagogical expectation.",
                    "label": 1
                },
                {
                    "sent": "I think the word pedagogical is very important here, and obviously the vast assortment of technology resources there is an abundance of tools.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, electronic dictionaries have a major role to play in this search for greater pedagogical effectiveness, but to be truly effective, electronic dictionaries and more particularly modeling wilderness dictionaries, need to make full use of their database structure in order to facilitate and speed up information access, be integrated in the type of environment that the vast majority of learners and teachers are using.",
                    "label": 0
                },
                {
                    "sent": "That is learning management systems.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In addition, there is a need for customizable modules like lead which cater for learners more specific needs.",
                    "label": 1
                },
                {
                    "sent": "And last but not least, to ensure pedagogical effectiveness, it is imperative to rely on multidisciplinary expertise.",
                    "label": 1
                },
                {
                    "sent": "We need a lot of skills if we want to produce effective tools, we need it, of course, but we need lexicography, corpus linguistics, computer assisted language learning, second language acquisition, and language pedagogy.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure how many of the priorities I have identified will be followed in future years, but if only a few bits and pieces make their way into one or other lexicographic tool, I will feel that I haven't lost my time and much more importantly, that I haven't made you lose yours.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_59": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I think the electronic dictionary in the center feel a little bit alone in that diagram.",
                    "label": 0
                },
                {
                    "sent": "I mean you have a circle between the student and the teacher, which is a traditional circle.",
                    "label": 0
                },
                {
                    "sent": "And it is traditional, but it's not implemented.",
                    "label": 0
                },
                {
                    "sent": "No, no, of course not.",
                    "label": 0
                },
                {
                    "sent": "But what about if the electronic dictionary could learn from this process?",
                    "label": 1
                },
                {
                    "sent": "What about if Selectronic dictionary Coote had some kind of learning memory?",
                    "label": 0
                },
                {
                    "sent": "Yeah, watching the same student doing the same mistakes over and over again and adapt to that.",
                    "label": 0
                },
                {
                    "sent": "But I said that you didn't listen to me.",
                    "label": 0
                },
                {
                    "sent": "I missed something.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I think you missed something.",
                    "label": 0
                },
                {
                    "sent": "Where was it?",
                    "label": 0
                },
                {
                    "sent": "Where I said that the system would be?",
                    "label": 0
                },
                {
                    "sent": "I don't remember where that is now.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Oh here here it is.",
                    "label": 0
                },
                {
                    "sent": "Here it is so the system would first be adaptable, but dictionary logs can progressively help to turn the adaptive system into an adaptive one.",
                    "label": 1
                },
                {
                    "sent": "The system adapts automatically to the user.",
                    "label": 0
                },
                {
                    "sent": "I think that's the idea because you have the dictionary in the middle and the logs both with the teacher in the student, and that's really nice because the teachers and the students are not going to use the dictionary in the same way and so progressively.",
                    "label": 0
                },
                {
                    "sent": "Because in an LMS every student is an individual right with his own profile.",
                    "label": 0
                },
                {
                    "sent": "You could actually adapt quite easily within a learning management system.",
                    "label": 0
                },
                {
                    "sent": "This is why I'm preaching for integration of electronic dictionaries within a wider management system, and they are used all over the world, but there is no integration of electronic dictionaries with that kind of platform.",
                    "label": 0
                },
                {
                    "sent": "One time lovely talk.",
                    "label": 0
                },
                {
                    "sent": "One thing you said right at the end I kind of want to challenge you said how it needs to be.",
                    "label": 0
                },
                {
                    "sent": "A collaboration between all these different people.",
                    "label": 0
                },
                {
                    "sent": "One system that you referenced that I've been sort of astonished by each time I've had an update on it is John Milton's from Hong Kong, University of Science and Technology, which seems like it's quite a lot of years ahead of almost anyone else, and I think.",
                    "label": 0
                },
                {
                    "sent": "But your point was that it needed lots of people.",
                    "label": 0
                },
                {
                    "sent": "How's it being possible for him to realize?",
                    "label": 0
                },
                {
                    "sent": "Pretty singlehandedly so many aspects of the dream singlehandedly.",
                    "label": 0
                },
                {
                    "sent": "But he's an IT person, so he's a computer computer analyst, right?",
                    "label": 0
                },
                {
                    "sent": "He teaches English, so he's also an EMT specialist, and he's surrounded by Elta specialists, and I think already there, and he's a good corpus linguist.",
                    "label": 0
                },
                {
                    "sent": "He knows about corpora and so, and he's got people around him.",
                    "label": 0
                },
                {
                    "sent": "A lot about second language acquisition, and so I think actually it's quite a good.",
                    "label": 0
                },
                {
                    "sent": "You know circle of people, and no wonder that he has produced such a good and useful tool.",
                    "label": 0
                },
                {
                    "sent": "But it's really geared towards the Chinese learners of English, and I think for vocabulary purposes for collocations and so on, and I think it's probably possible to do to do better than send the students to an external tool.",
                    "label": 0
                },
                {
                    "sent": "But it's really.",
                    "label": 0
                },
                {
                    "sent": "That's the way to go.",
                    "label": 0
                },
                {
                    "sent": "That's why I mentioned it as well as the David Wibbles I will interface.",
                    "label": 0
                },
                {
                    "sent": "They are the inspiration, right?",
                    "label": 0
                },
                {
                    "sent": "Is this, you know?",
                    "label": 0
                },
                {
                    "sent": "I haven't really invented much except that the dictionary doesn't play a part in those environments.",
                    "label": 0
                },
                {
                    "sent": "And that's where I that's why I've put the dictionary.",
                    "label": 0
                },
                {
                    "sent": "Perhaps a bit isolated, but at least at the center of the picture, which in this kind of conference I think was probably a good thing to do.",
                    "label": 0
                },
                {
                    "sent": "All the systems you mentioned were academic ones.",
                    "label": 0
                },
                {
                    "sent": "And what about Microsoft?",
                    "label": 0
                },
                {
                    "sent": "They've been investing hugely for an awful long time, I'm sorry.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Yes but no.",
                    "label": 0
                },
                {
                    "sent": "I mean spelling and a few grammar errors.",
                    "label": 0
                },
                {
                    "sent": "An that's it.",
                    "label": 0
                },
                {
                    "sent": "I mean, that's not.",
                    "label": 0
                },
                {
                    "sent": "You know, it's useful, and when the students don't use the spell checker, I say, why didn't you use the spell checker, but I never say why didn't you use the grammar checker right?",
                    "label": 0
                },
                {
                    "sent": "I don't say that no.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's maybe they're doing things that I'm not aware of, but certainly what we're getting as part of the package is not doing the trick.",
                    "label": 0
                },
                {
                    "sent": "And it's not only academic programs because I mentioned the Longman writing assistant.",
                    "label": 0
                },
                {
                    "sent": "I mentioned the Oxford writing assistant, but the object writing assistant, for instance, is mainly geared towards structuring your paper.",
                    "label": 0
                },
                {
                    "sent": "Write the paragraph, the introduction, and the conclusion and help about you know what kind of ideas you put into this environment, and I think it's very useful, but I'm more interested in the product oriented tools rather than process oriented tools.",
                    "label": 0
                },
                {
                    "sent": "And and there I think there's still a lot to do, but but my message.",
                    "label": 0
                },
                {
                    "sent": "Is the information is there?",
                    "label": 0
                },
                {
                    "sent": "Let's use what's there, but maybe I'm not getting it.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's so too commercial and I don't see the wider picture, but why isn't it possible to have direct access to these boxes that I showed and allowing students to just highlight some and not others?",
                    "label": 0
                },
                {
                    "sent": "That's a real question.",
                    "label": 0
                },
                {
                    "sent": "I don't understand why it hasn't been done yet.",
                    "label": 0
                },
                {
                    "sent": "As the information is there I. I just don't understand personally.",
                    "label": 0
                },
                {
                    "sent": "OK. Any other question?",
                    "label": 0
                },
                {
                    "sent": "OK then thank you again Sylviane for this great top.",
                    "label": 0
                }
            ]
        }
    }
}