{
    "id": "5aamoj44jtet5lsmbhwc4fzqrdzus6pj",
    "title": "The use of OER in Higher Education Institutions: a study in Portugal and Mozambique",
    "info": {
        "author": [
            "Dalila Margarida Pinto Coelho, University of Aveiro"
        ],
        "published": "June 23, 2014",
        "recorded": "April 2014",
        "category": [
            "Top->Social Sciences->Education",
            "Top->Social Sciences->Society->Public Policy"
        ]
    },
    "url": "http://videolectures.net/gognseminar2014_coelho_oer_in_higher_institutions/",
    "segmentation": [
        [
            "My name is Lily liquid.",
            "Why came from Portugal from the University of Viral an?",
            "And I'm really glad to be here for this opportunity.",
            "Might the title of my PhD research is the use of open educational resources in higher education institutions.",
            "A study in Portugal and Mozambique.",
            "So it's not only about Portugal, we are now moving to Africa a little bit, so this is a project proposal I would like to underline that I'm at at the very initial stage.",
            "Over my research, so this is mostly a skeleton that I'm going to present of what I intend.",
            "Nevertheless, this proposal was already submitted to the committee and it was approved to be pursued.",
            "I'm attending a doctoral program in education.",
            "It's not ICT based, it's overall education an it has a specific branch which is supervision, an evaluation.",
            "Some other fellows are doing in policy.",
            "My branch, my specific branches, supervision and evaluation, and I'm also supposed to connect my research with this specific area."
        ],
        [
            "So what is the road map for this presentation?",
            "First of all, I think it's better to start with the research question and names that they will explain the rationale.",
            "I will present to you a very brief one after we will move on the methodology framework after the phases with some detail on the chronogram and the tasks an finally main results expected for this whole adventure that I'm intending to start."
        ],
        [
            "So my main overall research question is how are we are being used in Portuguese and Mozambican higher education institutions?",
            "And what collaborative model can be?",
            "Models can be adequate to its promotion and adoption at the institutional level and teaching practice so you can see I have to contact geographical contexts, and I have also a collaborative.",
            "Focus I have a focus on the characterizing the practices.",
            "I'm sort of the ER use and the collaborative issue.",
            "From 2 levels, institutional level policy.",
            "Adoption and teaching practice.",
            "So this leads me to three specific questions that obviously I've shorten them a bit, just not to be so.",
            "Repetitive an one sub question is how is the use of OE are characterized?",
            "Which factors are relevant for collaboration and I mean this at 2 dimensions in in the in each institution an between institutions.",
            "Anne Anne, which collaborative model can be created with institutional actors from the institutions that I'm going to study for a sustainable use of O ER.",
            "So this lead me I would like to underline that for use.",
            "I understand provisionally questions as awareness, the specific types of use and creation or protection as you wish.",
            "Also collaboration for me for us means intra and Inter institutionally dimension an we have two levels.",
            "Institutional adopts adoption at the policy or rectory level, and the teaching practice.",
            "So this being said, this will embed all my speech."
        ],
        [
            "So this leads me to three overall aims and they are pretty much attached to the questions that I've exposed.",
            "One the general aim is to contribute, obviously for the knowledge about all we are use in these two contexts.",
            "2nd is to understand collaborative practices that are relevant or might be relevant for this to use, and a third one inspired and gaining from these two objectives is to conceive a model and approach a proposal.",
            "I still don't have a name for it yet that might be anyhow useful to promote the adoption at an institutional perspective.",
            "So each of these overall.",
            "James has two more specific aims which are over there.",
            "And I will skip so."
        ],
        [
            "Concerning the rationality that has, in a way motivated me to come up to this project.",
            "As you all know better than me, I'm sure there's a worldwide attention on ovr issues recently.",
            "Brought it up by also by the European Commission, an with institution with world institutions leading the way also as UNESCO ICD.",
            "I will see the OCD also and we have.",
            "There are several publications an experiences that show us an exponential growth of resource is an initiatives and groups of interest and work.",
            "And in fact, literature is growing for us every day, right?",
            "So this is all we are is presented in literature as an area of potential, but also as a challenging one, right in one hand, and namely for higher education institutions.",
            "You can look at.",
            "All you are is a way to probably reduce costs to get other Publix to reach.",
            "More resources with more quality, more transparent and everything, but also it's still a challenging area.",
            "We don't know much about intellectual property issues.",
            "We don't know much about the concrete practices about this coherence between the the.",
            "Practice the real practice and that old practice, right?",
            "So there's a lot of changes well represented in the literature.",
            "For us, it has been particularly inspiring.",
            "The need this, for that are in the dots, which is the need to expand.",
            "Though we are use one one hand.",
            "On the other hand, the need to strengthen collaborative networks.",
            "On third level, to provide stakeholders with training and supports an on the other hand to recipient to develop deep in research in this field.",
            "So this for.",
            "Priorities that are.",
            "More or less well defined in the literature work for us particularly inspiring."
        ],
        [
            "So when we look at.",
            "Approaches that intend to help institutions to adopt.",
            "We are weak and our small literature review the.",
            "Allowed us to identify some approaches.",
            "That are specifically intended to help institutions to adopt and promote the implemental we are with teachers and everything.",
            "But they are still very scarce.",
            "If our literature review so then so far is correct, they are very scarce.",
            "On the other hand, we need contextualized and comprehensive integrated approach is not just focus on one aspect of the institutional efforts.",
            "On the other hand, approach is focused on non dominant reality realities such as known as Occidental.",
            "Non English speaking countries.",
            "Are still very scarce, although we have some interesting examples.",
            "It's interesting that in my readings about this collaboration nearly always pops up as a key issue for the success of the approach, although it's still a challenging one, we lack models that rely on collaboration, and we also lack research about those practices so.",
            "Moving forward to Portuguese and Mozambican reality and I will give you a very, very short state of art.",
            "Very initial initial one.",
            "It's interesting because my.",
            "My interest for Mozambique came from the work I've developed there as a volunteer for years ago.",
            "An as a volunteer I was working in Asherati educational charity Ann.",
            "I could see that the main difference between me and between the teachers that I was working too was the access that I had to Internet and resource is, but actually they gave me the key to make those resources were can mean something so.",
            "An I thought why can't we not make the access to this resource is more easy, so this is the seed for the whole process.",
            "Anyway, when I started to look about all we are in Mozambique, I realized that the reported evidences are really scarce as well as in Portugal.",
            "So I came up with this short common lines on one hand as Paula said Open Access is.",
            "Getting some stage in Portugal as well as in Mozambique.",
            "There are both countries have public repository for publications.",
            "There there are some consortia working on all we are.",
            "Namely, on public universities.",
            "Although we don't know any specific study on how we are use or a deep study or not, we are used on both countries.",
            "So evidence report is really scarce.",
            "Once again, I underline if our search is correct.",
            "In other in other cases there are also no specific approaches to help institutions to adopt or we are in those.",
            "These two countries and also not a specific approach that is based on collaboration an if you look at the the Portuguese history, there is a lot of examples of collaboration between the lose off.",
            "Lose often world Portuguese speaking countries, namely Mozambique, an.",
            "Namely, in areas that are very closely connected to ovr.",
            "For instance, ICT technology enhanced learning distance education.",
            "So there has been some cooperation and collaboration, but not yet in ovr.",
            "So this was also motivating for our study.",
            "And of course, there's a growing demand of O ER in the Portuguese.",
            "Language, so this is also an extra motivation for us."
        ],
        [
            "Russian ally out methodology in so as perhaps you could understand this, this will be basically a qualitative research.",
            "It's a multiple case study to be developing two universities, one Portuguese, one Mozambican, an I main purposes are, of course explore Explorer 8 describe interpretate the reality that is.",
            "For us unknown.",
            "I say here that it will have it ethnographic observation components because I intend to develop field work if it is possible.",
            "So who will be the expected intervenient cycle them here?",
            "Stakeholders on?",
            "I don't know if that is the correct term.",
            "You will maybe will help me in that sense.",
            "On one hand, institutional leaders at the rectory level at Department level to tie City level.",
            "Teachers an other key.",
            "Actors such as staff involved in ICT sector, Odiele eventually elearning training fact, people enrolled in training the faculty library or repository and others an in other way external experts to validate the instruments and products throughout the project."
        ],
        [
            "Hurt so about data collection and as you can see I have two main focuses or we are use and the question of collaboration.",
            "I intend to develop.",
            "I think I will be able to get that from all these six context.",
            "In green you have the stakeholder or the context an in Gray you have the technique to be used so.",
            "I will start with the document collection.",
            "It's it's normal and.",
            "Interviewing experts, I want to interview experts in order them to provide.",
            "I'm sorry international experts so that they can provide me with relevant experiences.",
            "An references in these two fields.",
            "I also intend to interview institutional leaders in order to help me to understand the context in infrastructure policy and everything and have the top vision.",
            "I want to inquiry by questionnaire with two teachers mostly about their expectations, perceptions, practices over we are used and I want to also help deliver a focus group with key.",
            "With this key actors that I was mentioning before, mostly also in expectations challenges at an institutional level and of course practices.",
            "You can see over there to try training cycles.",
            "I will skip through there."
        ],
        [
            "I will explain later, so this is a three year food program.",
            "Divide it in five phases.",
            "First phase for literature review that as you can see, it should be already moving on, but I must say it's not still fully implemented.",
            "Second phase dedicated to create an validate the data collection instruments.",
            "A third phase dedicated to the data collection and analysis and here we have first moment of data collection in the field and observ observation in the field.",
            "2nd fourth phase for creating a model.",
            "This model for enhancing adoption of ovr and a fifth phase which is through throughout the project for thesis writing.",
            "An conclusion of this study."
        ],
        [
            "So looking at specific tasks in each of these Phase I want to go too much further, but just underline the main the main tasks of course developed a theoretical framework is where I am at now and to develop the state of art of we are used and collaboration in Portuguese.",
            "In Mozambique, higher education institutions.",
            "Of course I cannot ignore the reality.",
            "Another Portuguese speaking countries, namely Brazil, so that I believe that will.",
            "Provide me with relevant input and Brazil is very different case from the other Portuguese speaking countries.",
            "In the second phase, it will be dedicated to develop methodological framework to build instruments, indicators, dimensions and everything and to submit it to validation and to design the instruments in to validate them in the field before going to the institutions.",
            "A third phase dedicated to plan the field work.",
            "Then to that in these two institutions, then to collect data.",
            "And then I thought about of a first training cycle and this training cycle is mostly dedicated to awareness raising because we thought that perhaps we are going to ask teachers and institutional leaders and everything about all we are, and with a lot of technical vocabulary.",
            "And perhaps this is not very familiar to them, and perhaps if we have a previous moment of.",
            "Awareness and discussion of main concepts.",
            "This might be helpful for the research, so an last less to task of these phases that analysis and we intend to sort of come up to profiles or trends or main lines in connected to O ER and collaborative practices.",
            "After this input from these three phases.",
            "We want to end from those actors that hopefully will collaborate with us during the data collection process.",
            "We want to design a team with myself and the supervision team of course.",
            "And with actors from each group of the two institutions an after that team being built and work methodology defined and supports and everything and some collaborative strategies to be proposed.",
            "We expect a second training cycle that will emerge that will come out from the data collection process, which were the needs most relevant for each of institutions.",
            "Are they the same?",
            "Are they different?",
            "Perhaps one institution may lack more on the technological side.",
            "Other, more on the IP site.",
            "For instance, I don't know we are imagining so based on that that process we foresee the need of.",
            "The training cycle to support the creation of this model so that that this May might do some sense to the people enrolled in it, and after we will.",
            "Go to the creation of the model itself, which is foreseen to happen in three main phases.",
            "And to the theoretical validation and evaluation, I don't foresee the practical implementation of this model, but at least it's theoretical validation with external experts and actors from both contexts from both countries.",
            "So this is writing is this is writing and."
        ],
        [
            "So far.",
            "If I talk to you, I'm at the very initial stage and although I was expecting that PhD was a straight line, it is not so.",
            "I'm very honest with you at so far.",
            "I've done a lot of non structured search for the last two years which connect me to this proposal.",
            "I already defined a literature review strategy with main concepts, main sources and everything, but it's still on paper.",
            "It's not on real.",
            "Last year I tried to.",
            "Use the subjects to my theme and so I developed the first version of a comparative metrics about these approaches that intend to help institutions to adopt A.",
            "We are but is very provisional, is not translated, and it needs rough work.",
            "I we also worked on possible risks and contingency measures of this project.",
            "We are aware that being a project in two countries which have two different school years.",
            "It has risks.",
            "And we also have developed some expected specifically expected results per phase.",
            "An products professing how are we going to validate them?",
            "We also have some expected content.",
            "Overall general content per each data collection instrument and actor.",
            "We have an overall but very provisional thesis structure and we have already disseminated and publicated the project's main main features snow conference in Portugal, an international review, international scientific publication, also in Portugal."
        ],
        [
            "So expected results.",
            "The main result of all of this is of course, besides the some understanding of how is Zoe are being used in these two institutions is to come up with a tool that anyhow can help institutions to promote and support the user Valeyard, which was created jointly with the actual persons to which they are they voted.",
            "To which this model is expected considering some issues like awareness like the use like creation, symptomatic domains like the technological question for the gicle question and everything Anne.",
            "Maybe there's some useful tools to develop them?",
            "I mean checklists for instance.",
            "And that is aware of some context.",
            "Particularity is for instance different pedagogical models.",
            "Different organizational models.",
            "Of course.",
            "I underline I'm speaking about two institutions only, so this is not.",
            "This might be potentially transferable to other institutions, but of course is a limited study."
        ],
        [
            "This is the sources that we used to prepare the present."
        ],
        [
            "Nation."
        ],
        [
            "And thank you for your.",
            "I'm sure your questions will take my sleep also, but that's why I'm here for thanks.",
            "Thank you for your presentation.",
            "One question about your fourth phase is creation and you.",
            "You formulated this creation theoretical foundation.",
            "If the relation of the CM or we are more.",
            "But you didn't tell you say you won't evaluate it by implementing.",
            "How do you plan to failure?",
            "By evaluation I."
        ],
        [
            "Transvaluation of the process.",
            "How did the team work?",
            "Were the main results achieved?",
            "Was collaboration real?",
            "Did it happen or it was just on paper so it was more an evaluation of the process of the building of the model itself not?",
            "Not evaluation of the model because we will submit the model to theoretical validation and hopefully the external validators will provide us with those kind.",
            "That kind of feedback, but I'm not sure if we are going to be able to evaluate the the model.",
            "This evaluation was of the process of building of designing itself, but it can be a.",
            "Do you think it would be a relevant asset?",
            "OK.",
            "Yes, yeah.",
            "Valuation of the model.",
            "Of the process, the process of building the model and I would leave that the evaluation or validation of the model itself to external experts.",
            "Yeah, I know it's a limitation, but.",
            "Yeah yeah yeah yeah.",
            "Thank you.",
            "Very fascinating, I wasn't big in Portugal, including both in your research, but it's not quite clear to me.",
            "What is the real advantage of taking two countries?",
            "In fact 2.",
            "Projects in one research topic.",
            "They are quite different.",
            "Getting some extra value in the results, which is about just an interesting countries.",
            "What is your motivation to include him?",
            "OK, so it started as a personal motivation as I've tried to explain.",
            "But the fact is that although.",
            "And the Paris Declaration is very clear about that.",
            "Collaboration is one of the main pillars to develop or we are adoption.",
            "It's still very scarce on on the practice, and if you look at Portuguese speaking world, it's even more reduced.",
            "You almost don't find the experience or they are not reported.",
            "We don't know that yet.",
            "We don't have enough research about this, nor in higher education, nor in.",
            "Other level so.",
            "The innovative aspect of this proposal, I was told, is that there are no such type of studies as the one I'm proposing to do.",
            "An this is a personal belief.",
            "I believe that this jointly creation could be useful to both institutions, not only because we have protocols long, long while ago, and we have previous work develop on distance education, ICT adoption and everything but.",
            "This specific question of where we are is not addressed in none of the institutions, so this is a new window that we could open here, and that's basically my motivation.",
            "I don't know if I could answer your question.",
            "So just to compete with this, I'm going to compare or I'm going to find out about that.",
            "I'm not going to.",
            "Research that can be beneficial to both.",
            "OK, I'm not going to compare because I don't think that I have the research framework to do that.",
            "That's not my main goal, although I will obviously make a joint reading and analysis of the of common access, different experts and everything so, but I wouldn't call it a comparation.",
            "It's it's not that point.",
            "But your question is actually my inner question too.",
            "I can I can put myself in the side of institutions and and say why am I should going into this right?",
            "Um well.",
            "Portuguese higher education system is looking for students.",
            "If you look at that way, there's a practical advantage here.",
            "We are looking for students and Portuguese speaking students is, of course, our main target, so this is this might be might be useful for institutions.",
            "On the other hand, our courses in Portugal, for instance, they don't usually, and I'm thinking about education, which is my background, and I was also a teacher.",
            "Previously they don't reflect this diversity of the world, and today you are training teachers and you know that they are not going to stay in Portugal.",
            "They will be forced to move away.",
            "So perhaps we if we can in a few years have resources that were created with a more broader view.",
            "They're not just focused or an international cloud, or in Portuguese systems.",
            "Perhaps this can be useful for everybody.",
            "You can have learning paths that are more attractive to international students.",
            "When I was starting to work in this University three years ago, three years ago, I didn't saw African students innovator in the city, and now I see them all over the place so.",
            "This means that we are striking to have them with us.",
            "We have a shortage in students.",
            "It's a demographical shortage.",
            "Also an we must look seriously at the Portuguese speaking world, namely so.",
            "The leader I can hear that you are passionate about that that's very clever.",
            "Can I just?",
            "I'm passionate about Mozambique so it's easy.",
            "Just suggest to you to look further into.",
            "Teaching practices in general between those two countries.",
            "Why I suggest that is that I have done a study with people in different parts of the world and I was astonished about finding out.",
            "That there was so huge differences in teaching styles between countries or cultures.",
            "I would rather say.",
            "And I just suggested you to to put in your into your question and questions on teaching settings, teaching methodology's teaching.",
            "Practices teaching what else could resources one?",
            "I don't know.",
            "We are only, I mean, which resources do they use in their ordinary teaching and things like that so that you can reflect on that and you.",
            "Correct it yeah perhaps.",
            "We can find that teachers are using resources for disseminating information, but perhaps not for evaluating students or ever or something, right?",
            "So it's different.",
            "It's a very nice suggestion.",
            "Thank you.",
            "Maybe little question, just think about the Wyndham, an orphan resources in Portuguese language.",
            "And I would like to know is if institutions support today with some kind of language policy this opportunity?",
            "You know, language languages are considered an ecstatic tool for the institution, so I would like to know because we could be a good opportunity for Portuguese, you mean in with these two institutions?",
            "Do you speak Dutch?",
            "And so we did it?",
            "It's a relevant issue to address to look if they have a policy for language is that.",
            "Thank you.",
            "A lot of preparation.",
            "That does show so well done.",
            "Just one thing, it seems as though the theme throughout your presentation is run collaboration.",
            "I'm sorry.",
            "Friends throughout is mostly on collaboration here.",
            "I would say I have two main focus or we are use an collaboration because if we go back to your title, yes.",
            "I was there and I was thinking.",
            "OK.",
            "But I couldn't change it."
        ],
        [
            "No, it's a useful exercise.",
            "Yeah it is.",
            "I actually got my key concepts so because at the moment I'm reading just the use of open education.",
            "There's no promotion, there's no collaboration.",
            "I've noticed there after your question.",
            "What you going to focus on because?",
            "If you're looking at use, it's kind of the the basis of OK.",
            "So how are we are being used?",
            "But in fact in some of what you saying.",
            "Are you actually asking a previous question you actually asking about the awareness of urban education resource.",
            "And its use and possible creation so your titles only reflecting one of those at the moment, not the awareness.",
            "All the yes, although if I may interrupt this was for convenience.",
            "An I say that in the written project and also here in this yes but OK.",
            "So if you think awareness and adoption aggression?",
            "OK yeah I think that for now what I'm wanting applicating back to a concept that.",
            "Robert raised if you are going to look at collaboration, which is actually quite interesting.",
            "The two things we need to look at one is if you want going to collaborate, you've gotta collaborate about something.",
            "So if for example you are going to do a more intensive study with this training etc.",
            "Other studies that have done some collaborations.",
            "So for example in the test projects, there's another one in a Mets project that you didn't reference, so I'll send it to you.",
            "If they were focused on a particular thing, it was around.",
            "For the second one, it was a mathematics curriculum for a first year teacher education project.",
            "And I want to know if you're going to be talking about this collaboration.",
            "Are you already talking about something where you have seen that there's a similarity, or are you assuming that?",
            "Off to use.",
            "Awareness use creation that collaborative work is kind of like the next step and it should be the next example.",
            "That's why you're looking at collaboration.",
            "Or do you really have something where people are collaborating?",
            "Well, the.",
            "That's a tricky question and you always take our sleep, but that that that.",
            "How to say?",
            "That was one of my my concerns was that I don't have a specific object or a subject.",
            "I don't have language resource or a project or maths or etc.",
            "This is kind of a theoretical.",
            "Object that I want people to gather around and think about this.",
            "And think what would be useful if we wanted to implement or we are in our institution considering our background and everything.",
            "What would be useful to us?",
            "What?",
            "What do we lack?",
            "A model should teach us this and that should give us some suggestions about steps to take or people to enroll.",
            "Or you know, I don't know if this is clear at the moment.",
            "I don't have any other specific subject to give them and that that was one of my first concerns because teachers are motivated to something.",
            "Concrete.",
            "And that tells him something to their hearts or to their practice.",
            "And I don't know.",
            "It's it's a mystery for me yet.",
            "May I follow, yeah.",
            "Yeah, the title tells us that you want to study the use of ovr and heart issues important so big.",
            "If you're only studying two institutions, one portable, one in Mozambique, this title will not be the OK, so.",
            "Rather than.",
            "As his father was advocating more focus here, I think.",
            "This is too ambitious.",
            "Conclude from 2 institutions reported.",
            "Yes, OK.",
            "So that's that's that's a complication.",
            "The other thing is you are combining two very different things.",
            "So what's the use of all we are and the collaborative model.",
            "And that makes it again too ambitious, maybe.",
            "And it is still ambitious.",
            "You should choose.",
            "Peter study the use of all we are in more than two institutions, imported almost anything.",
            "Or you focus on the collective model.",
            "We can still.",
            "Maybe think about not only including available plans.",
            "Yep.",
            "Hello face yeah.",
            "At least you have any focused study on cooperation between two different institutions, and see if I was referring to wirewood.",
            "Combining those two, there is an argument to do that.",
            "Yeah, so the dilemma I think is.",
            "Your title and also your research question is pretty ambitious.",
            "That's too difficult, or you should remind people.",
            "Include more institutions importable Mozambique, but then to again through the collaborative model is too much, yes.",
            "So it's I think you have to make a choice, yeah?",
            "Come back.",
            "Following up on Charles Question, I think.",
            "So I very much like your framework that you have presented, so that's well done.",
            "But now for the next stage to to avoid too many risks.",
            "Yes, be careful.",
            "We can, of course, discussed on this through the conference.",
            "It's not only today to help you and to think about.",
            "Ways of approaching what you want to do.",
            "One of the most big brightness suppression, so we should do that.",
            "Can get away from Mozambique and the combination reported almost the biggest fight.",
            "Don't get Brazil into it.",
            "It's a very different yeah, please stay away from.",
            "Biggest fire.",
            "So then think about just two countries between what you really want to study.",
            "And being a little bit less ambitious, yeah.",
            "Yes, in my project, defense Professor and Tonya more additive shader.",
            "He was the the external experts who evaluated the project and he said OK, very innovative but too ambitious an I know that.",
            "And of course this was made 2 three years full an full full time and fully funded so an it's not the case neither of the.",
            "Neither of the cases.",
            "So the question is, I tried to the main and 1st focus was the collaboration model, but I was tracking with the fact that we have no studies about the we are used.",
            "So how how would I?",
            "I was going to study something that I don't know what is before and I know too.",
            "I need to know what is before.",
            "So this is the dilemma.",
            "Um?",
            "OK, so it's not really a delay.",
            "Because you then have got a really good trigger research problem.",
            "That's always the best thing for research.",
            "Study is absolutely don't know this and I need to know.",
            "Yeah, you absolutely don't know how how people are, how aware people are.",
            "Very yeah how they use it.",
            "If they create or not.",
            "Yes, you don't know that.",
            "So if you can establish that and well.",
            "Then you've got the basis for the next day.",
            "'cause the moment it's almost like you've got the tail dog.",
            "The collaborative work is going.",
            "I actually want people to collaborate, but I don't see how they doing your kids and this is going to find out a little bit about what they're doing.",
            "And then I'll just make this conceptual leap and then hope that they're collaborate.",
            "I think you must separate those things aren't and just focusing on what people are actually doing and why they're doing what they're doing is baseline study work that is needed in these areas, so don't underestimate the value.",
            "Of getting that information and doing it well and deeply.",
            "OK, but in more universities perhaps.",
            "And the Explorers Explorers study more than doing a survey.",
            "I think the exploration of the collective model is extremely important for many of us, and there's just not much available.",
            "You can add.",
            "In terms of.",
            "Even if it's only two universities that still can be relevant, well, initially initial proposal included two in Portugal and two in Mozambique, and then I was told this is too much.",
            "One in one is enough so.",
            "Maybe?",
            "Other remarks.",
            "Questions.",
            "I think we should.",
            "Yeah, you're very close to closing.",
            "Just one just another way of thinking through what it is.",
            "If you are really focused on collaboration.",
            "And if collaboration is the answer, then what is the original problem?",
            "So if you go back with not the only reason why I know this because it's not from the Portuguese company, doesn't Peking University mentioned, but from the Catholic University in bearer their Health Sciences Department are actually working with some institution in Portugal which I don't know what it is now and they are sharing lectures.",
            "So if you were to work from the other way is at the moment you've got Portuguese and Mozambican lecturers, and they they are coming up to Mozambique.",
            "Why instead of the used exchanging lecturers, don't you start collaboratively developing the materials?",
            "Then the collaboration.",
            "Is a possible?",
            "She said she actually working from the actual problem that you quote is people.",
            "Are they collaborating in a way but not around materials production?",
            "The moment all the materials actually produced in Portugal and then just brought into basin beak.",
            "And that means that all the material production knowledge is staying in Portugal and it's not coming to Mozambique, so that's the other way is actually working on what is the trigger problem that actually started my research and those link you can actually then look at that site.",
            "But then let's not use.",
            "Yeah.",
            "The final word?",
            "Yeah, perhaps what triggered the study was an assumption that in a personal belief that collaboration would enhance or we are adoption.",
            "Anne.",
            "Well, I developed the project based on a personal belief, but that I found echoes and evidence on literature to that need, but.",
            "Well.",
            "So let's get home.",
            "Yeah, thank you, thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "My name is Lily liquid.",
                    "label": 0
                },
                {
                    "sent": "Why came from Portugal from the University of Viral an?",
                    "label": 0
                },
                {
                    "sent": "And I'm really glad to be here for this opportunity.",
                    "label": 0
                },
                {
                    "sent": "Might the title of my PhD research is the use of open educational resources in higher education institutions.",
                    "label": 1
                },
                {
                    "sent": "A study in Portugal and Mozambique.",
                    "label": 0
                },
                {
                    "sent": "So it's not only about Portugal, we are now moving to Africa a little bit, so this is a project proposal I would like to underline that I'm at at the very initial stage.",
                    "label": 0
                },
                {
                    "sent": "Over my research, so this is mostly a skeleton that I'm going to present of what I intend.",
                    "label": 0
                },
                {
                    "sent": "Nevertheless, this proposal was already submitted to the committee and it was approved to be pursued.",
                    "label": 0
                },
                {
                    "sent": "I'm attending a doctoral program in education.",
                    "label": 0
                },
                {
                    "sent": "It's not ICT based, it's overall education an it has a specific branch which is supervision, an evaluation.",
                    "label": 0
                },
                {
                    "sent": "Some other fellows are doing in policy.",
                    "label": 0
                },
                {
                    "sent": "My branch, my specific branches, supervision and evaluation, and I'm also supposed to connect my research with this specific area.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is the road map for this presentation?",
                    "label": 0
                },
                {
                    "sent": "First of all, I think it's better to start with the research question and names that they will explain the rationale.",
                    "label": 1
                },
                {
                    "sent": "I will present to you a very brief one after we will move on the methodology framework after the phases with some detail on the chronogram and the tasks an finally main results expected for this whole adventure that I'm intending to start.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So my main overall research question is how are we are being used in Portuguese and Mozambican higher education institutions?",
                    "label": 1
                },
                {
                    "sent": "And what collaborative model can be?",
                    "label": 0
                },
                {
                    "sent": "Models can be adequate to its promotion and adoption at the institutional level and teaching practice so you can see I have to contact geographical contexts, and I have also a collaborative.",
                    "label": 1
                },
                {
                    "sent": "Focus I have a focus on the characterizing the practices.",
                    "label": 0
                },
                {
                    "sent": "I'm sort of the ER use and the collaborative issue.",
                    "label": 0
                },
                {
                    "sent": "From 2 levels, institutional level policy.",
                    "label": 0
                },
                {
                    "sent": "Adoption and teaching practice.",
                    "label": 1
                },
                {
                    "sent": "So this leads me to three specific questions that obviously I've shorten them a bit, just not to be so.",
                    "label": 0
                },
                {
                    "sent": "Repetitive an one sub question is how is the use of OE are characterized?",
                    "label": 1
                },
                {
                    "sent": "Which factors are relevant for collaboration and I mean this at 2 dimensions in in the in each institution an between institutions.",
                    "label": 0
                },
                {
                    "sent": "Anne Anne, which collaborative model can be created with institutional actors from the institutions that I'm going to study for a sustainable use of O ER.",
                    "label": 0
                },
                {
                    "sent": "So this lead me I would like to underline that for use.",
                    "label": 0
                },
                {
                    "sent": "I understand provisionally questions as awareness, the specific types of use and creation or protection as you wish.",
                    "label": 0
                },
                {
                    "sent": "Also collaboration for me for us means intra and Inter institutionally dimension an we have two levels.",
                    "label": 0
                },
                {
                    "sent": "Institutional adopts adoption at the policy or rectory level, and the teaching practice.",
                    "label": 0
                },
                {
                    "sent": "So this being said, this will embed all my speech.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this leads me to three overall aims and they are pretty much attached to the questions that I've exposed.",
                    "label": 0
                },
                {
                    "sent": "One the general aim is to contribute, obviously for the knowledge about all we are use in these two contexts.",
                    "label": 1
                },
                {
                    "sent": "2nd is to understand collaborative practices that are relevant or might be relevant for this to use, and a third one inspired and gaining from these two objectives is to conceive a model and approach a proposal.",
                    "label": 1
                },
                {
                    "sent": "I still don't have a name for it yet that might be anyhow useful to promote the adoption at an institutional perspective.",
                    "label": 0
                },
                {
                    "sent": "So each of these overall.",
                    "label": 0
                },
                {
                    "sent": "James has two more specific aims which are over there.",
                    "label": 0
                },
                {
                    "sent": "And I will skip so.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Concerning the rationality that has, in a way motivated me to come up to this project.",
                    "label": 0
                },
                {
                    "sent": "As you all know better than me, I'm sure there's a worldwide attention on ovr issues recently.",
                    "label": 1
                },
                {
                    "sent": "Brought it up by also by the European Commission, an with institution with world institutions leading the way also as UNESCO ICD.",
                    "label": 0
                },
                {
                    "sent": "I will see the OCD also and we have.",
                    "label": 1
                },
                {
                    "sent": "There are several publications an experiences that show us an exponential growth of resource is an initiatives and groups of interest and work.",
                    "label": 0
                },
                {
                    "sent": "And in fact, literature is growing for us every day, right?",
                    "label": 0
                },
                {
                    "sent": "So this is all we are is presented in literature as an area of potential, but also as a challenging one, right in one hand, and namely for higher education institutions.",
                    "label": 0
                },
                {
                    "sent": "You can look at.",
                    "label": 0
                },
                {
                    "sent": "All you are is a way to probably reduce costs to get other Publix to reach.",
                    "label": 0
                },
                {
                    "sent": "More resources with more quality, more transparent and everything, but also it's still a challenging area.",
                    "label": 0
                },
                {
                    "sent": "We don't know much about intellectual property issues.",
                    "label": 0
                },
                {
                    "sent": "We don't know much about the concrete practices about this coherence between the the.",
                    "label": 0
                },
                {
                    "sent": "Practice the real practice and that old practice, right?",
                    "label": 0
                },
                {
                    "sent": "So there's a lot of changes well represented in the literature.",
                    "label": 0
                },
                {
                    "sent": "For us, it has been particularly inspiring.",
                    "label": 0
                },
                {
                    "sent": "The need this, for that are in the dots, which is the need to expand.",
                    "label": 0
                },
                {
                    "sent": "Though we are use one one hand.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, the need to strengthen collaborative networks.",
                    "label": 1
                },
                {
                    "sent": "On third level, to provide stakeholders with training and supports an on the other hand to recipient to develop deep in research in this field.",
                    "label": 1
                },
                {
                    "sent": "So this for.",
                    "label": 0
                },
                {
                    "sent": "Priorities that are.",
                    "label": 0
                },
                {
                    "sent": "More or less well defined in the literature work for us particularly inspiring.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So when we look at.",
                    "label": 0
                },
                {
                    "sent": "Approaches that intend to help institutions to adopt.",
                    "label": 0
                },
                {
                    "sent": "We are weak and our small literature review the.",
                    "label": 0
                },
                {
                    "sent": "Allowed us to identify some approaches.",
                    "label": 0
                },
                {
                    "sent": "That are specifically intended to help institutions to adopt and promote the implemental we are with teachers and everything.",
                    "label": 0
                },
                {
                    "sent": "But they are still very scarce.",
                    "label": 0
                },
                {
                    "sent": "If our literature review so then so far is correct, they are very scarce.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, we need contextualized and comprehensive integrated approach is not just focus on one aspect of the institutional efforts.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, approach is focused on non dominant reality realities such as known as Occidental.",
                    "label": 0
                },
                {
                    "sent": "Non English speaking countries.",
                    "label": 0
                },
                {
                    "sent": "Are still very scarce, although we have some interesting examples.",
                    "label": 0
                },
                {
                    "sent": "It's interesting that in my readings about this collaboration nearly always pops up as a key issue for the success of the approach, although it's still a challenging one, we lack models that rely on collaboration, and we also lack research about those practices so.",
                    "label": 0
                },
                {
                    "sent": "Moving forward to Portuguese and Mozambican reality and I will give you a very, very short state of art.",
                    "label": 0
                },
                {
                    "sent": "Very initial initial one.",
                    "label": 0
                },
                {
                    "sent": "It's interesting because my.",
                    "label": 0
                },
                {
                    "sent": "My interest for Mozambique came from the work I've developed there as a volunteer for years ago.",
                    "label": 0
                },
                {
                    "sent": "An as a volunteer I was working in Asherati educational charity Ann.",
                    "label": 0
                },
                {
                    "sent": "I could see that the main difference between me and between the teachers that I was working too was the access that I had to Internet and resource is, but actually they gave me the key to make those resources were can mean something so.",
                    "label": 0
                },
                {
                    "sent": "An I thought why can't we not make the access to this resource is more easy, so this is the seed for the whole process.",
                    "label": 0
                },
                {
                    "sent": "Anyway, when I started to look about all we are in Mozambique, I realized that the reported evidences are really scarce as well as in Portugal.",
                    "label": 0
                },
                {
                    "sent": "So I came up with this short common lines on one hand as Paula said Open Access is.",
                    "label": 0
                },
                {
                    "sent": "Getting some stage in Portugal as well as in Mozambique.",
                    "label": 0
                },
                {
                    "sent": "There are both countries have public repository for publications.",
                    "label": 0
                },
                {
                    "sent": "There there are some consortia working on all we are.",
                    "label": 0
                },
                {
                    "sent": "Namely, on public universities.",
                    "label": 0
                },
                {
                    "sent": "Although we don't know any specific study on how we are use or a deep study or not, we are used on both countries.",
                    "label": 0
                },
                {
                    "sent": "So evidence report is really scarce.",
                    "label": 0
                },
                {
                    "sent": "Once again, I underline if our search is correct.",
                    "label": 0
                },
                {
                    "sent": "In other in other cases there are also no specific approaches to help institutions to adopt or we are in those.",
                    "label": 0
                },
                {
                    "sent": "These two countries and also not a specific approach that is based on collaboration an if you look at the the Portuguese history, there is a lot of examples of collaboration between the lose off.",
                    "label": 0
                },
                {
                    "sent": "Lose often world Portuguese speaking countries, namely Mozambique, an.",
                    "label": 0
                },
                {
                    "sent": "Namely, in areas that are very closely connected to ovr.",
                    "label": 0
                },
                {
                    "sent": "For instance, ICT technology enhanced learning distance education.",
                    "label": 0
                },
                {
                    "sent": "So there has been some cooperation and collaboration, but not yet in ovr.",
                    "label": 0
                },
                {
                    "sent": "So this was also motivating for our study.",
                    "label": 0
                },
                {
                    "sent": "And of course, there's a growing demand of O ER in the Portuguese.",
                    "label": 0
                },
                {
                    "sent": "Language, so this is also an extra motivation for us.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Russian ally out methodology in so as perhaps you could understand this, this will be basically a qualitative research.",
                    "label": 0
                },
                {
                    "sent": "It's a multiple case study to be developing two universities, one Portuguese, one Mozambican, an I main purposes are, of course explore Explorer 8 describe interpretate the reality that is.",
                    "label": 0
                },
                {
                    "sent": "For us unknown.",
                    "label": 0
                },
                {
                    "sent": "I say here that it will have it ethnographic observation components because I intend to develop field work if it is possible.",
                    "label": 1
                },
                {
                    "sent": "So who will be the expected intervenient cycle them here?",
                    "label": 0
                },
                {
                    "sent": "Stakeholders on?",
                    "label": 0
                },
                {
                    "sent": "I don't know if that is the correct term.",
                    "label": 0
                },
                {
                    "sent": "You will maybe will help me in that sense.",
                    "label": 1
                },
                {
                    "sent": "On one hand, institutional leaders at the rectory level at Department level to tie City level.",
                    "label": 0
                },
                {
                    "sent": "Teachers an other key.",
                    "label": 0
                },
                {
                    "sent": "Actors such as staff involved in ICT sector, Odiele eventually elearning training fact, people enrolled in training the faculty library or repository and others an in other way external experts to validate the instruments and products throughout the project.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hurt so about data collection and as you can see I have two main focuses or we are use and the question of collaboration.",
                    "label": 0
                },
                {
                    "sent": "I intend to develop.",
                    "label": 0
                },
                {
                    "sent": "I think I will be able to get that from all these six context.",
                    "label": 0
                },
                {
                    "sent": "In green you have the stakeholder or the context an in Gray you have the technique to be used so.",
                    "label": 0
                },
                {
                    "sent": "I will start with the document collection.",
                    "label": 1
                },
                {
                    "sent": "It's it's normal and.",
                    "label": 0
                },
                {
                    "sent": "Interviewing experts, I want to interview experts in order them to provide.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry international experts so that they can provide me with relevant experiences.",
                    "label": 0
                },
                {
                    "sent": "An references in these two fields.",
                    "label": 0
                },
                {
                    "sent": "I also intend to interview institutional leaders in order to help me to understand the context in infrastructure policy and everything and have the top vision.",
                    "label": 0
                },
                {
                    "sent": "I want to inquiry by questionnaire with two teachers mostly about their expectations, perceptions, practices over we are used and I want to also help deliver a focus group with key.",
                    "label": 1
                },
                {
                    "sent": "With this key actors that I was mentioning before, mostly also in expectations challenges at an institutional level and of course practices.",
                    "label": 0
                },
                {
                    "sent": "You can see over there to try training cycles.",
                    "label": 0
                },
                {
                    "sent": "I will skip through there.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I will explain later, so this is a three year food program.",
                    "label": 0
                },
                {
                    "sent": "Divide it in five phases.",
                    "label": 0
                },
                {
                    "sent": "First phase for literature review that as you can see, it should be already moving on, but I must say it's not still fully implemented.",
                    "label": 0
                },
                {
                    "sent": "Second phase dedicated to create an validate the data collection instruments.",
                    "label": 1
                },
                {
                    "sent": "A third phase dedicated to the data collection and analysis and here we have first moment of data collection in the field and observ observation in the field.",
                    "label": 1
                },
                {
                    "sent": "2nd fourth phase for creating a model.",
                    "label": 0
                },
                {
                    "sent": "This model for enhancing adoption of ovr and a fifth phase which is through throughout the project for thesis writing.",
                    "label": 1
                },
                {
                    "sent": "An conclusion of this study.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So looking at specific tasks in each of these Phase I want to go too much further, but just underline the main the main tasks of course developed a theoretical framework is where I am at now and to develop the state of art of we are used and collaboration in Portuguese.",
                    "label": 1
                },
                {
                    "sent": "In Mozambique, higher education institutions.",
                    "label": 0
                },
                {
                    "sent": "Of course I cannot ignore the reality.",
                    "label": 0
                },
                {
                    "sent": "Another Portuguese speaking countries, namely Brazil, so that I believe that will.",
                    "label": 0
                },
                {
                    "sent": "Provide me with relevant input and Brazil is very different case from the other Portuguese speaking countries.",
                    "label": 0
                },
                {
                    "sent": "In the second phase, it will be dedicated to develop methodological framework to build instruments, indicators, dimensions and everything and to submit it to validation and to design the instruments in to validate them in the field before going to the institutions.",
                    "label": 1
                },
                {
                    "sent": "A third phase dedicated to plan the field work.",
                    "label": 0
                },
                {
                    "sent": "Then to that in these two institutions, then to collect data.",
                    "label": 0
                },
                {
                    "sent": "And then I thought about of a first training cycle and this training cycle is mostly dedicated to awareness raising because we thought that perhaps we are going to ask teachers and institutional leaders and everything about all we are, and with a lot of technical vocabulary.",
                    "label": 0
                },
                {
                    "sent": "And perhaps this is not very familiar to them, and perhaps if we have a previous moment of.",
                    "label": 0
                },
                {
                    "sent": "Awareness and discussion of main concepts.",
                    "label": 0
                },
                {
                    "sent": "This might be helpful for the research, so an last less to task of these phases that analysis and we intend to sort of come up to profiles or trends or main lines in connected to O ER and collaborative practices.",
                    "label": 1
                },
                {
                    "sent": "After this input from these three phases.",
                    "label": 0
                },
                {
                    "sent": "We want to end from those actors that hopefully will collaborate with us during the data collection process.",
                    "label": 0
                },
                {
                    "sent": "We want to design a team with myself and the supervision team of course.",
                    "label": 0
                },
                {
                    "sent": "And with actors from each group of the two institutions an after that team being built and work methodology defined and supports and everything and some collaborative strategies to be proposed.",
                    "label": 1
                },
                {
                    "sent": "We expect a second training cycle that will emerge that will come out from the data collection process, which were the needs most relevant for each of institutions.",
                    "label": 0
                },
                {
                    "sent": "Are they the same?",
                    "label": 0
                },
                {
                    "sent": "Are they different?",
                    "label": 0
                },
                {
                    "sent": "Perhaps one institution may lack more on the technological side.",
                    "label": 0
                },
                {
                    "sent": "Other, more on the IP site.",
                    "label": 0
                },
                {
                    "sent": "For instance, I don't know we are imagining so based on that that process we foresee the need of.",
                    "label": 1
                },
                {
                    "sent": "The training cycle to support the creation of this model so that that this May might do some sense to the people enrolled in it, and after we will.",
                    "label": 1
                },
                {
                    "sent": "Go to the creation of the model itself, which is foreseen to happen in three main phases.",
                    "label": 0
                },
                {
                    "sent": "And to the theoretical validation and evaluation, I don't foresee the practical implementation of this model, but at least it's theoretical validation with external experts and actors from both contexts from both countries.",
                    "label": 0
                },
                {
                    "sent": "So this is writing is this is writing and.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So far.",
                    "label": 0
                },
                {
                    "sent": "If I talk to you, I'm at the very initial stage and although I was expecting that PhD was a straight line, it is not so.",
                    "label": 0
                },
                {
                    "sent": "I'm very honest with you at so far.",
                    "label": 1
                },
                {
                    "sent": "I've done a lot of non structured search for the last two years which connect me to this proposal.",
                    "label": 1
                },
                {
                    "sent": "I already defined a literature review strategy with main concepts, main sources and everything, but it's still on paper.",
                    "label": 0
                },
                {
                    "sent": "It's not on real.",
                    "label": 0
                },
                {
                    "sent": "Last year I tried to.",
                    "label": 0
                },
                {
                    "sent": "Use the subjects to my theme and so I developed the first version of a comparative metrics about these approaches that intend to help institutions to adopt A.",
                    "label": 0
                },
                {
                    "sent": "We are but is very provisional, is not translated, and it needs rough work.",
                    "label": 0
                },
                {
                    "sent": "I we also worked on possible risks and contingency measures of this project.",
                    "label": 1
                },
                {
                    "sent": "We are aware that being a project in two countries which have two different school years.",
                    "label": 0
                },
                {
                    "sent": "It has risks.",
                    "label": 0
                },
                {
                    "sent": "And we also have developed some expected specifically expected results per phase.",
                    "label": 0
                },
                {
                    "sent": "An products professing how are we going to validate them?",
                    "label": 1
                },
                {
                    "sent": "We also have some expected content.",
                    "label": 1
                },
                {
                    "sent": "Overall general content per each data collection instrument and actor.",
                    "label": 0
                },
                {
                    "sent": "We have an overall but very provisional thesis structure and we have already disseminated and publicated the project's main main features snow conference in Portugal, an international review, international scientific publication, also in Portugal.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So expected results.",
                    "label": 0
                },
                {
                    "sent": "The main result of all of this is of course, besides the some understanding of how is Zoe are being used in these two institutions is to come up with a tool that anyhow can help institutions to promote and support the user Valeyard, which was created jointly with the actual persons to which they are they voted.",
                    "label": 0
                },
                {
                    "sent": "To which this model is expected considering some issues like awareness like the use like creation, symptomatic domains like the technological question for the gicle question and everything Anne.",
                    "label": 0
                },
                {
                    "sent": "Maybe there's some useful tools to develop them?",
                    "label": 0
                },
                {
                    "sent": "I mean checklists for instance.",
                    "label": 0
                },
                {
                    "sent": "And that is aware of some context.",
                    "label": 0
                },
                {
                    "sent": "Particularity is for instance different pedagogical models.",
                    "label": 0
                },
                {
                    "sent": "Different organizational models.",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                },
                {
                    "sent": "I underline I'm speaking about two institutions only, so this is not.",
                    "label": 0
                },
                {
                    "sent": "This might be potentially transferable to other institutions, but of course is a limited study.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the sources that we used to prepare the present.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nation.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And thank you for your.",
                    "label": 0
                },
                {
                    "sent": "I'm sure your questions will take my sleep also, but that's why I'm here for thanks.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your presentation.",
                    "label": 0
                },
                {
                    "sent": "One question about your fourth phase is creation and you.",
                    "label": 0
                },
                {
                    "sent": "You formulated this creation theoretical foundation.",
                    "label": 0
                },
                {
                    "sent": "If the relation of the CM or we are more.",
                    "label": 0
                },
                {
                    "sent": "But you didn't tell you say you won't evaluate it by implementing.",
                    "label": 0
                },
                {
                    "sent": "How do you plan to failure?",
                    "label": 0
                },
                {
                    "sent": "By evaluation I.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Transvaluation of the process.",
                    "label": 0
                },
                {
                    "sent": "How did the team work?",
                    "label": 0
                },
                {
                    "sent": "Were the main results achieved?",
                    "label": 0
                },
                {
                    "sent": "Was collaboration real?",
                    "label": 0
                },
                {
                    "sent": "Did it happen or it was just on paper so it was more an evaluation of the process of the building of the model itself not?",
                    "label": 0
                },
                {
                    "sent": "Not evaluation of the model because we will submit the model to theoretical validation and hopefully the external validators will provide us with those kind.",
                    "label": 1
                },
                {
                    "sent": "That kind of feedback, but I'm not sure if we are going to be able to evaluate the the model.",
                    "label": 0
                },
                {
                    "sent": "This evaluation was of the process of building of designing itself, but it can be a.",
                    "label": 0
                },
                {
                    "sent": "Do you think it would be a relevant asset?",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Yes, yeah.",
                    "label": 0
                },
                {
                    "sent": "Valuation of the model.",
                    "label": 1
                },
                {
                    "sent": "Of the process, the process of building the model and I would leave that the evaluation or validation of the model itself to external experts.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I know it's a limitation, but.",
                    "label": 0
                },
                {
                    "sent": "Yeah yeah yeah yeah.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Very fascinating, I wasn't big in Portugal, including both in your research, but it's not quite clear to me.",
                    "label": 0
                },
                {
                    "sent": "What is the real advantage of taking two countries?",
                    "label": 0
                },
                {
                    "sent": "In fact 2.",
                    "label": 0
                },
                {
                    "sent": "Projects in one research topic.",
                    "label": 0
                },
                {
                    "sent": "They are quite different.",
                    "label": 0
                },
                {
                    "sent": "Getting some extra value in the results, which is about just an interesting countries.",
                    "label": 0
                },
                {
                    "sent": "What is your motivation to include him?",
                    "label": 0
                },
                {
                    "sent": "OK, so it started as a personal motivation as I've tried to explain.",
                    "label": 0
                },
                {
                    "sent": "But the fact is that although.",
                    "label": 0
                },
                {
                    "sent": "And the Paris Declaration is very clear about that.",
                    "label": 0
                },
                {
                    "sent": "Collaboration is one of the main pillars to develop or we are adoption.",
                    "label": 0
                },
                {
                    "sent": "It's still very scarce on on the practice, and if you look at Portuguese speaking world, it's even more reduced.",
                    "label": 0
                },
                {
                    "sent": "You almost don't find the experience or they are not reported.",
                    "label": 0
                },
                {
                    "sent": "We don't know that yet.",
                    "label": 0
                },
                {
                    "sent": "We don't have enough research about this, nor in higher education, nor in.",
                    "label": 0
                },
                {
                    "sent": "Other level so.",
                    "label": 0
                },
                {
                    "sent": "The innovative aspect of this proposal, I was told, is that there are no such type of studies as the one I'm proposing to do.",
                    "label": 0
                },
                {
                    "sent": "An this is a personal belief.",
                    "label": 0
                },
                {
                    "sent": "I believe that this jointly creation could be useful to both institutions, not only because we have protocols long, long while ago, and we have previous work develop on distance education, ICT adoption and everything but.",
                    "label": 0
                },
                {
                    "sent": "This specific question of where we are is not addressed in none of the institutions, so this is a new window that we could open here, and that's basically my motivation.",
                    "label": 0
                },
                {
                    "sent": "I don't know if I could answer your question.",
                    "label": 0
                },
                {
                    "sent": "So just to compete with this, I'm going to compare or I'm going to find out about that.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to.",
                    "label": 0
                },
                {
                    "sent": "Research that can be beneficial to both.",
                    "label": 0
                },
                {
                    "sent": "OK, I'm not going to compare because I don't think that I have the research framework to do that.",
                    "label": 0
                },
                {
                    "sent": "That's not my main goal, although I will obviously make a joint reading and analysis of the of common access, different experts and everything so, but I wouldn't call it a comparation.",
                    "label": 0
                },
                {
                    "sent": "It's it's not that point.",
                    "label": 0
                },
                {
                    "sent": "But your question is actually my inner question too.",
                    "label": 0
                },
                {
                    "sent": "I can I can put myself in the side of institutions and and say why am I should going into this right?",
                    "label": 0
                },
                {
                    "sent": "Um well.",
                    "label": 0
                },
                {
                    "sent": "Portuguese higher education system is looking for students.",
                    "label": 0
                },
                {
                    "sent": "If you look at that way, there's a practical advantage here.",
                    "label": 0
                },
                {
                    "sent": "We are looking for students and Portuguese speaking students is, of course, our main target, so this is this might be might be useful for institutions.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, our courses in Portugal, for instance, they don't usually, and I'm thinking about education, which is my background, and I was also a teacher.",
                    "label": 0
                },
                {
                    "sent": "Previously they don't reflect this diversity of the world, and today you are training teachers and you know that they are not going to stay in Portugal.",
                    "label": 0
                },
                {
                    "sent": "They will be forced to move away.",
                    "label": 0
                },
                {
                    "sent": "So perhaps we if we can in a few years have resources that were created with a more broader view.",
                    "label": 0
                },
                {
                    "sent": "They're not just focused or an international cloud, or in Portuguese systems.",
                    "label": 0
                },
                {
                    "sent": "Perhaps this can be useful for everybody.",
                    "label": 0
                },
                {
                    "sent": "You can have learning paths that are more attractive to international students.",
                    "label": 0
                },
                {
                    "sent": "When I was starting to work in this University three years ago, three years ago, I didn't saw African students innovator in the city, and now I see them all over the place so.",
                    "label": 0
                },
                {
                    "sent": "This means that we are striking to have them with us.",
                    "label": 0
                },
                {
                    "sent": "We have a shortage in students.",
                    "label": 0
                },
                {
                    "sent": "It's a demographical shortage.",
                    "label": 0
                },
                {
                    "sent": "Also an we must look seriously at the Portuguese speaking world, namely so.",
                    "label": 0
                },
                {
                    "sent": "The leader I can hear that you are passionate about that that's very clever.",
                    "label": 0
                },
                {
                    "sent": "Can I just?",
                    "label": 0
                },
                {
                    "sent": "I'm passionate about Mozambique so it's easy.",
                    "label": 0
                },
                {
                    "sent": "Just suggest to you to look further into.",
                    "label": 0
                },
                {
                    "sent": "Teaching practices in general between those two countries.",
                    "label": 0
                },
                {
                    "sent": "Why I suggest that is that I have done a study with people in different parts of the world and I was astonished about finding out.",
                    "label": 0
                },
                {
                    "sent": "That there was so huge differences in teaching styles between countries or cultures.",
                    "label": 0
                },
                {
                    "sent": "I would rather say.",
                    "label": 0
                },
                {
                    "sent": "And I just suggested you to to put in your into your question and questions on teaching settings, teaching methodology's teaching.",
                    "label": 0
                },
                {
                    "sent": "Practices teaching what else could resources one?",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "We are only, I mean, which resources do they use in their ordinary teaching and things like that so that you can reflect on that and you.",
                    "label": 0
                },
                {
                    "sent": "Correct it yeah perhaps.",
                    "label": 0
                },
                {
                    "sent": "We can find that teachers are using resources for disseminating information, but perhaps not for evaluating students or ever or something, right?",
                    "label": 0
                },
                {
                    "sent": "So it's different.",
                    "label": 0
                },
                {
                    "sent": "It's a very nice suggestion.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Maybe little question, just think about the Wyndham, an orphan resources in Portuguese language.",
                    "label": 0
                },
                {
                    "sent": "And I would like to know is if institutions support today with some kind of language policy this opportunity?",
                    "label": 0
                },
                {
                    "sent": "You know, language languages are considered an ecstatic tool for the institution, so I would like to know because we could be a good opportunity for Portuguese, you mean in with these two institutions?",
                    "label": 0
                },
                {
                    "sent": "Do you speak Dutch?",
                    "label": 0
                },
                {
                    "sent": "And so we did it?",
                    "label": 0
                },
                {
                    "sent": "It's a relevant issue to address to look if they have a policy for language is that.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "A lot of preparation.",
                    "label": 0
                },
                {
                    "sent": "That does show so well done.",
                    "label": 0
                },
                {
                    "sent": "Just one thing, it seems as though the theme throughout your presentation is run collaboration.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry.",
                    "label": 0
                },
                {
                    "sent": "Friends throughout is mostly on collaboration here.",
                    "label": 0
                },
                {
                    "sent": "I would say I have two main focus or we are use an collaboration because if we go back to your title, yes.",
                    "label": 0
                },
                {
                    "sent": "I was there and I was thinking.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "But I couldn't change it.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No, it's a useful exercise.",
                    "label": 0
                },
                {
                    "sent": "Yeah it is.",
                    "label": 0
                },
                {
                    "sent": "I actually got my key concepts so because at the moment I'm reading just the use of open education.",
                    "label": 1
                },
                {
                    "sent": "There's no promotion, there's no collaboration.",
                    "label": 0
                },
                {
                    "sent": "I've noticed there after your question.",
                    "label": 0
                },
                {
                    "sent": "What you going to focus on because?",
                    "label": 0
                },
                {
                    "sent": "If you're looking at use, it's kind of the the basis of OK.",
                    "label": 0
                },
                {
                    "sent": "So how are we are being used?",
                    "label": 0
                },
                {
                    "sent": "But in fact in some of what you saying.",
                    "label": 0
                },
                {
                    "sent": "Are you actually asking a previous question you actually asking about the awareness of urban education resource.",
                    "label": 0
                },
                {
                    "sent": "And its use and possible creation so your titles only reflecting one of those at the moment, not the awareness.",
                    "label": 0
                },
                {
                    "sent": "All the yes, although if I may interrupt this was for convenience.",
                    "label": 0
                },
                {
                    "sent": "An I say that in the written project and also here in this yes but OK.",
                    "label": 0
                },
                {
                    "sent": "So if you think awareness and adoption aggression?",
                    "label": 0
                },
                {
                    "sent": "OK yeah I think that for now what I'm wanting applicating back to a concept that.",
                    "label": 0
                },
                {
                    "sent": "Robert raised if you are going to look at collaboration, which is actually quite interesting.",
                    "label": 0
                },
                {
                    "sent": "The two things we need to look at one is if you want going to collaborate, you've gotta collaborate about something.",
                    "label": 0
                },
                {
                    "sent": "So if for example you are going to do a more intensive study with this training etc.",
                    "label": 0
                },
                {
                    "sent": "Other studies that have done some collaborations.",
                    "label": 0
                },
                {
                    "sent": "So for example in the test projects, there's another one in a Mets project that you didn't reference, so I'll send it to you.",
                    "label": 0
                },
                {
                    "sent": "If they were focused on a particular thing, it was around.",
                    "label": 0
                },
                {
                    "sent": "For the second one, it was a mathematics curriculum for a first year teacher education project.",
                    "label": 0
                },
                {
                    "sent": "And I want to know if you're going to be talking about this collaboration.",
                    "label": 0
                },
                {
                    "sent": "Are you already talking about something where you have seen that there's a similarity, or are you assuming that?",
                    "label": 0
                },
                {
                    "sent": "Off to use.",
                    "label": 0
                },
                {
                    "sent": "Awareness use creation that collaborative work is kind of like the next step and it should be the next example.",
                    "label": 0
                },
                {
                    "sent": "That's why you're looking at collaboration.",
                    "label": 0
                },
                {
                    "sent": "Or do you really have something where people are collaborating?",
                    "label": 0
                },
                {
                    "sent": "Well, the.",
                    "label": 0
                },
                {
                    "sent": "That's a tricky question and you always take our sleep, but that that that.",
                    "label": 0
                },
                {
                    "sent": "How to say?",
                    "label": 0
                },
                {
                    "sent": "That was one of my my concerns was that I don't have a specific object or a subject.",
                    "label": 0
                },
                {
                    "sent": "I don't have language resource or a project or maths or etc.",
                    "label": 0
                },
                {
                    "sent": "This is kind of a theoretical.",
                    "label": 0
                },
                {
                    "sent": "Object that I want people to gather around and think about this.",
                    "label": 0
                },
                {
                    "sent": "And think what would be useful if we wanted to implement or we are in our institution considering our background and everything.",
                    "label": 0
                },
                {
                    "sent": "What would be useful to us?",
                    "label": 0
                },
                {
                    "sent": "What?",
                    "label": 0
                },
                {
                    "sent": "What do we lack?",
                    "label": 0
                },
                {
                    "sent": "A model should teach us this and that should give us some suggestions about steps to take or people to enroll.",
                    "label": 0
                },
                {
                    "sent": "Or you know, I don't know if this is clear at the moment.",
                    "label": 0
                },
                {
                    "sent": "I don't have any other specific subject to give them and that that was one of my first concerns because teachers are motivated to something.",
                    "label": 0
                },
                {
                    "sent": "Concrete.",
                    "label": 0
                },
                {
                    "sent": "And that tells him something to their hearts or to their practice.",
                    "label": 0
                },
                {
                    "sent": "And I don't know.",
                    "label": 0
                },
                {
                    "sent": "It's it's a mystery for me yet.",
                    "label": 0
                },
                {
                    "sent": "May I follow, yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah, the title tells us that you want to study the use of ovr and heart issues important so big.",
                    "label": 0
                },
                {
                    "sent": "If you're only studying two institutions, one portable, one in Mozambique, this title will not be the OK, so.",
                    "label": 0
                },
                {
                    "sent": "Rather than.",
                    "label": 0
                },
                {
                    "sent": "As his father was advocating more focus here, I think.",
                    "label": 0
                },
                {
                    "sent": "This is too ambitious.",
                    "label": 0
                },
                {
                    "sent": "Conclude from 2 institutions reported.",
                    "label": 0
                },
                {
                    "sent": "Yes, OK.",
                    "label": 0
                },
                {
                    "sent": "So that's that's that's a complication.",
                    "label": 0
                },
                {
                    "sent": "The other thing is you are combining two very different things.",
                    "label": 0
                },
                {
                    "sent": "So what's the use of all we are and the collaborative model.",
                    "label": 0
                },
                {
                    "sent": "And that makes it again too ambitious, maybe.",
                    "label": 0
                },
                {
                    "sent": "And it is still ambitious.",
                    "label": 0
                },
                {
                    "sent": "You should choose.",
                    "label": 0
                },
                {
                    "sent": "Peter study the use of all we are in more than two institutions, imported almost anything.",
                    "label": 0
                },
                {
                    "sent": "Or you focus on the collective model.",
                    "label": 0
                },
                {
                    "sent": "We can still.",
                    "label": 0
                },
                {
                    "sent": "Maybe think about not only including available plans.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "Hello face yeah.",
                    "label": 0
                },
                {
                    "sent": "At least you have any focused study on cooperation between two different institutions, and see if I was referring to wirewood.",
                    "label": 0
                },
                {
                    "sent": "Combining those two, there is an argument to do that.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so the dilemma I think is.",
                    "label": 0
                },
                {
                    "sent": "Your title and also your research question is pretty ambitious.",
                    "label": 0
                },
                {
                    "sent": "That's too difficult, or you should remind people.",
                    "label": 0
                },
                {
                    "sent": "Include more institutions importable Mozambique, but then to again through the collaborative model is too much, yes.",
                    "label": 0
                },
                {
                    "sent": "So it's I think you have to make a choice, yeah?",
                    "label": 0
                },
                {
                    "sent": "Come back.",
                    "label": 0
                },
                {
                    "sent": "Following up on Charles Question, I think.",
                    "label": 0
                },
                {
                    "sent": "So I very much like your framework that you have presented, so that's well done.",
                    "label": 0
                },
                {
                    "sent": "But now for the next stage to to avoid too many risks.",
                    "label": 0
                },
                {
                    "sent": "Yes, be careful.",
                    "label": 0
                },
                {
                    "sent": "We can, of course, discussed on this through the conference.",
                    "label": 0
                },
                {
                    "sent": "It's not only today to help you and to think about.",
                    "label": 0
                },
                {
                    "sent": "Ways of approaching what you want to do.",
                    "label": 0
                },
                {
                    "sent": "One of the most big brightness suppression, so we should do that.",
                    "label": 0
                },
                {
                    "sent": "Can get away from Mozambique and the combination reported almost the biggest fight.",
                    "label": 0
                },
                {
                    "sent": "Don't get Brazil into it.",
                    "label": 0
                },
                {
                    "sent": "It's a very different yeah, please stay away from.",
                    "label": 0
                },
                {
                    "sent": "Biggest fire.",
                    "label": 0
                },
                {
                    "sent": "So then think about just two countries between what you really want to study.",
                    "label": 0
                },
                {
                    "sent": "And being a little bit less ambitious, yeah.",
                    "label": 0
                },
                {
                    "sent": "Yes, in my project, defense Professor and Tonya more additive shader.",
                    "label": 0
                },
                {
                    "sent": "He was the the external experts who evaluated the project and he said OK, very innovative but too ambitious an I know that.",
                    "label": 0
                },
                {
                    "sent": "And of course this was made 2 three years full an full full time and fully funded so an it's not the case neither of the.",
                    "label": 0
                },
                {
                    "sent": "Neither of the cases.",
                    "label": 0
                },
                {
                    "sent": "So the question is, I tried to the main and 1st focus was the collaboration model, but I was tracking with the fact that we have no studies about the we are used.",
                    "label": 0
                },
                {
                    "sent": "So how how would I?",
                    "label": 0
                },
                {
                    "sent": "I was going to study something that I don't know what is before and I know too.",
                    "label": 0
                },
                {
                    "sent": "I need to know what is before.",
                    "label": 0
                },
                {
                    "sent": "So this is the dilemma.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "OK, so it's not really a delay.",
                    "label": 0
                },
                {
                    "sent": "Because you then have got a really good trigger research problem.",
                    "label": 0
                },
                {
                    "sent": "That's always the best thing for research.",
                    "label": 0
                },
                {
                    "sent": "Study is absolutely don't know this and I need to know.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you absolutely don't know how how people are, how aware people are.",
                    "label": 0
                },
                {
                    "sent": "Very yeah how they use it.",
                    "label": 0
                },
                {
                    "sent": "If they create or not.",
                    "label": 0
                },
                {
                    "sent": "Yes, you don't know that.",
                    "label": 0
                },
                {
                    "sent": "So if you can establish that and well.",
                    "label": 0
                },
                {
                    "sent": "Then you've got the basis for the next day.",
                    "label": 0
                },
                {
                    "sent": "'cause the moment it's almost like you've got the tail dog.",
                    "label": 0
                },
                {
                    "sent": "The collaborative work is going.",
                    "label": 0
                },
                {
                    "sent": "I actually want people to collaborate, but I don't see how they doing your kids and this is going to find out a little bit about what they're doing.",
                    "label": 0
                },
                {
                    "sent": "And then I'll just make this conceptual leap and then hope that they're collaborate.",
                    "label": 0
                },
                {
                    "sent": "I think you must separate those things aren't and just focusing on what people are actually doing and why they're doing what they're doing is baseline study work that is needed in these areas, so don't underestimate the value.",
                    "label": 0
                },
                {
                    "sent": "Of getting that information and doing it well and deeply.",
                    "label": 0
                },
                {
                    "sent": "OK, but in more universities perhaps.",
                    "label": 0
                },
                {
                    "sent": "And the Explorers Explorers study more than doing a survey.",
                    "label": 0
                },
                {
                    "sent": "I think the exploration of the collective model is extremely important for many of us, and there's just not much available.",
                    "label": 0
                },
                {
                    "sent": "You can add.",
                    "label": 0
                },
                {
                    "sent": "In terms of.",
                    "label": 0
                },
                {
                    "sent": "Even if it's only two universities that still can be relevant, well, initially initial proposal included two in Portugal and two in Mozambique, and then I was told this is too much.",
                    "label": 0
                },
                {
                    "sent": "One in one is enough so.",
                    "label": 0
                },
                {
                    "sent": "Maybe?",
                    "label": 0
                },
                {
                    "sent": "Other remarks.",
                    "label": 0
                },
                {
                    "sent": "Questions.",
                    "label": 0
                },
                {
                    "sent": "I think we should.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you're very close to closing.",
                    "label": 0
                },
                {
                    "sent": "Just one just another way of thinking through what it is.",
                    "label": 0
                },
                {
                    "sent": "If you are really focused on collaboration.",
                    "label": 0
                },
                {
                    "sent": "And if collaboration is the answer, then what is the original problem?",
                    "label": 0
                },
                {
                    "sent": "So if you go back with not the only reason why I know this because it's not from the Portuguese company, doesn't Peking University mentioned, but from the Catholic University in bearer their Health Sciences Department are actually working with some institution in Portugal which I don't know what it is now and they are sharing lectures.",
                    "label": 0
                },
                {
                    "sent": "So if you were to work from the other way is at the moment you've got Portuguese and Mozambican lecturers, and they they are coming up to Mozambique.",
                    "label": 0
                },
                {
                    "sent": "Why instead of the used exchanging lecturers, don't you start collaboratively developing the materials?",
                    "label": 0
                },
                {
                    "sent": "Then the collaboration.",
                    "label": 0
                },
                {
                    "sent": "Is a possible?",
                    "label": 0
                },
                {
                    "sent": "She said she actually working from the actual problem that you quote is people.",
                    "label": 0
                },
                {
                    "sent": "Are they collaborating in a way but not around materials production?",
                    "label": 1
                },
                {
                    "sent": "The moment all the materials actually produced in Portugal and then just brought into basin beak.",
                    "label": 0
                },
                {
                    "sent": "And that means that all the material production knowledge is staying in Portugal and it's not coming to Mozambique, so that's the other way is actually working on what is the trigger problem that actually started my research and those link you can actually then look at that site.",
                    "label": 0
                },
                {
                    "sent": "But then let's not use.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "The final word?",
                    "label": 0
                },
                {
                    "sent": "Yeah, perhaps what triggered the study was an assumption that in a personal belief that collaboration would enhance or we are adoption.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Well, I developed the project based on a personal belief, but that I found echoes and evidence on literature to that need, but.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "So let's get home.",
                    "label": 0
                },
                {
                    "sent": "Yeah, thank you, thank you.",
                    "label": 0
                }
            ]
        }
    }
}