{
    "id": "5aawcmroa7zh2swkh64jfbjzpicusurp",
    "title": "Communicating CERN - what we do and why it matters",
    "info": {
        "author": [
            "James Gillies, CERN - European Organization for Nuclear Research"
        ],
        "published": "June 15, 2015",
        "recorded": "April 2015",
        "category": [
            "Top->Physics"
        ]
    },
    "url": "http://videolectures.net/kolokviji_gillies_cern/",
    "segmentation": [
        [
            "Morning there ladies and gentlemen.",
            "It is my pleasure to welcome today today, speakers Doctor James Gillies, head of Communications Group at CERN.",
            "Let me briefly introduce Doctor Gillies, the person behind many news that we heard of the achievements in CERN, I guess.",
            "He received BS with first class honor in physics from the University of London Diploma in Science, Communication from the University of London and PhD in experimental particle physics from the University of Oxford.",
            "From 1988 to 19 thirty 1993 he was a research assistant and then hire scientific officer in Rutherford Appleton Laboratory, UK.",
            "In 1992 he worked for three months as a science journalist at BBC World Service UK and then from 93 to 95 he was ahead of science at the British Council in Paris, in France.",
            "From 1995 to 2003 he was a member of Communication Group at CERN and then in 2003 he became a head of Communication Group in CERN.",
            "He scientific research of the physics of elementary particles have been reported in about 120 papers.",
            "Doctor Gillis is a senior communication manager with particular experience in an international scientific environment.",
            "He has proven leadership leadership skills in managing, developing, and motivating diverse teams to deliver communications across a wide range of sectors, from media relations to exhibitions, but he's also skilled in writing.",
            "He wrote the successful Oxford University Press title, how the web was born.",
            "Among his main achievements, we should stress the development and implementation of a global multi annual communication stretched strategy for the launch of the Large Hadron Collider.",
            "He was a manager of successful communication campaign for the 50s universe anniversary of the Sun in 2004, which included the publication of the book Infinitely CERN.",
            "An open day attended by.",
            "32,000 people and yet and a year long media campaign.",
            "Doctor Gillis was invited by the eyes of Futerra Chair Project, in which we could recognize the science communication as an essential for its sustainability.",
            "So let us learn something from certain communications.",
            "Of science doctor Giles thank you very much.",
            "Was that really me?",
            "I've forgotten a lot of that, but there we are anyway so."
        ],
        [
            "What I'd like to talk to you about today is I'm going to start talking a little bit about CERN.",
            "What CERN is?",
            "I realize that you're not all particle physicist, so I will give you an introduction soon.",
            "But also, this is a fairly standard introduction.",
            "This is the introduction that my team will give whenever they are presenting Son to outside visitors, be they members of the public or journalists so.",
            "So what is CERN?",
            "Well, CERN is a place of extremes.",
            "What you see here on this picture is."
        ],
        [
            "The trace of where the Large Hadron Collider goes.",
            "This is a 27 kilometre machine that I'm going to describe in a minute.",
            "So flagship machine it's not our only machine."
        ],
        [
            "This is Geneva Airport, so it gives you an idea of the scale of the tunnel.",
            "The city of Geneva is here and I understand the city of Geneva is about a similar size as the city of Libya in terms of population.",
            "So it gives you an idea of the scale of this machine."
        ],
        [
            "That's what he looks when you get underground and into the tunnel.",
            "One way of looking at the LHC.",
            "There it is.",
            "There is it's the fastest race track on the planet.",
            "What we do with this machine is we take tiny bits of stuff, protons of which were all made and we accelerate them to a fraction under the speed of light and we collide with each other.",
            "They're going so close to the speed of light that this is the kind of thing that you get asked if you do communications journalist said, well how close to the speed of light, and so we worked it out.",
            "But if we were to send our protons in a race with the light beam to Proxima Centura, our nearest star apart from the sun.",
            "They would arrive a few seconds later after journey time of 42 years, so it's that close to the speed of light.",
            "We're getting these particles to go around this tunnel."
        ],
        [
            "We won't need particles as I said to collide with each other.",
            "We don't want them to collide with anything else they're doing at that speed, 11,245 laps per second of this machine, and we keep them going around and around for hours and hours at a time in a beam of particles.",
            "Being with particles is something like about this long 10th with human hair.",
            "It contains 100 billion protons, but yet most of the time when these.",
            "Bunches of particles pass through each other.",
            "Only a handful of protons actually collide, so we can keep them going around for ages.",
            "We want the protons to collide with themselves, not with anything else.",
            "We have to develop extremely high vacuum technologies, which means that we're not quite as good inside this beam pipe where the particles circulate as the vacuum on the surface of the moon, but we're not far off the level of vacuum that you find there."
        ],
        [
            "The large hydrocolloid was a superconducting machine.",
            "That means that it uses a property of certain materials to carry electricity with no resistance at very, very low temperatures.",
            "The reason why we need to do that is that what keeps those protons going around in the circle.",
            "Is the ring of Electro magnets and those Electro magnets have to carry this year?",
            "It's a current of 11,000 and 80 amperes is what they've all been trained to, so that's a huge amount of current.",
            "If you wanted to do that with normal copper, then you would need a bundle of copper that I could hardly get my arms around, and it's quite difficult to wind coils out of that.",
            "So we use two conductivity and you can get the same current done away with that kind of cross section.",
            "But it means that we have to operate the LHC at below 4.2 degrees above absolute zero.",
            "We actually operated at one point 9 degrees Resolute 0, so that is makes it about 1 degree colder than the average temperature of outer space.",
            "So it's a very cold machine."
        ],
        [
            "When particles collide and these are pictures of particle collisions taken by particle detectors, they showed tracks coming out of the collisions.",
            "Protracted new particles produced in the collisions coming out.",
            "They produce tiny little fireballs of energy at extremely high temperatures of 100,000 * 100 million times the temperature of the core of the sun.",
            "I might be a few orders of magnitude off there, and if I am excuse me, I'm noticing there is at least one particle physicist in the blink rate.",
            "Incredibly hot temperatures been in very small space."
        ],
        [
            "We want to measure those particles.",
            "It's actually that's where the core of our Sciences is.",
            "By watching these particles collide with each other and analyzing what comes out that we can ask some very profound questions about the nature of the universe.",
            "So we have huge sensors and here is 1.",
            "There's a person standing in the middle there that gives you an idea of the scale of them.",
            "This is one of the four LHC particle detectors.",
            "It's called the Compact Muon solenoid.",
            "Act it is compared to its rival very small, but you can see it's an enormous device and.",
            "It's a sign of the rate of progress in this field of science that I worked on the last generation of experiments at CERN, where the comparable detector had something like 10,000 readout channels in it.",
            "This one has 100 million readout channels in it.",
            "The detector I worked on recorded data at the rate of 10 Hertz.",
            "This one is sampling data at 40 megahertz.",
            "The collaboration I worked on with 300 people, this one is 3000 people, so it's a very very big scale of science Now and if I ever wanted to go back I would be completely and utterly lost.",
            "Going back into this kind of research environment and that's in just one generation."
        ],
        [
            "Experiment.",
            "Within that detector I mentioned the number of 100 I mentioned the number #100 million.",
            "Sensors 100 million readout channels reading out information about the collisions 40 megahertz.",
            "The time that the amount that we are sampling data if you multiply those numbers together, you get a very large number and that tells you that there's a huge amount of data coming out of these things.",
            "So we need to have a very extensive computer system and what we do is we have something called the worldwide LHC computing grid, about 10% of which is at CERN, and the rest of it is distributed around the world.",
            "To analyze the data we actually throw away the vast majority of the data by very quickly sampling it before.",
            "We record it so that we make sure that we're only recording data that might contain interesting science."
        ],
        [
            "So that's sort of what, and by this point audiences are usually saying, well, why on Earth would you want to do all that to those poor little protons?",
            "And the answer is."
        ],
        [
            "Essentially because human beings are curious.",
            "I'll come back to that in the second part of my talk when I talk about certain communications.",
            "We have always, as long as there have been human beings, we've always wanted to understand the universe we live in.",
            "We've always wanted to push back the nature of our amount of knowledge we have about this universe, the world that we inhabit.",
            "And that's why certain exists.",
            "We were created in 1954.",
            "To provide a center of excellence for basic research and physics for Europe after the war.",
            "And these are the kinds of questions that we will address it soon, so Newton's unfinished business where we're getting there now.",
            "Actually, this is a drawing of Newton mapping out the universe and what Newton gave us was a description of gravity, a description of the force that acts upon mass property that we call mass.",
            "This guy gave us a better one.",
            "General relativity, but what this guy did was still good enough for us to put people on the moon and send probes out into space.",
            "It wasn't good enough to power the GPS system that I use in my mobile phone for that I have to use general relativity, but neither.",
            "Newton or Einstein actually told us what it is that mass is what is?",
            "Principles, where is the property that we call mass come from?",
            "What is it that gravity acts upon?",
            "And for that we had to wait for this person and a couple of others, the other two got the Nobel Prize which have chosen to show him this was Francois Anglers, PhD supervisor at Cornell University and his name was Robert Broughton.",
            "He passed away, I think in 2010, which is the reason you've heard of a glaring Higgs but not of him.",
            "He, Francois Wrangler in 1964 and independently Peter Higgs published a paper in I think just about the same issue of the same Journal, but they did it independently.",
            "Explaining why it is that certain forces of nature have a different range from others and they described it by saying that the carriers of certain forces have a heavier than others, basically so they were they were producing a paper that was.",
            "Aimed at describing the range of fundamental forces.",
            "But actually goes much further because the mechanism they described is what gives master all the fundamental particles and we call it.",
            "We call it.",
            "Now the browsing that Higgs mechanism, but the particle itself has got known as the Higgs particle.",
            "So that's coming to an end.",
            "Now we announced the discovery of that particle.",
            "Remember, 1964 was when they when they publish these papers, 2012 is when the experiment symbol to announce that we had confirmed those papers.",
            "It's a very long business if you want to do particle physics.",
            "That's only one of the questions, and it's probably the least interesting of the questions that the LHC was designed to address.",
            "It was the only question that we were pretty much guaranteed an answer to, so the rest is now in nature's hands.",
            "But we're very excited that we might be able to answer some of these.",
            "I'm.",
            "Over the last 50 years or so, particle physics has built up a very good picture to explain the fundamental constituents of everything that we are made of.",
            "The tables, chairs, UMI, stars, planets, everything you can see in the universe is made of.",
            "But at the same time that we've been doing that, there have been other catcher.",
            "Give scientist looking out into space, where as we look into inner space.",
            "There are people looking out into space and they figured out that the visible stuff is only about 5% of what's out there, so there's 95% of the stuff that makes up the universe that we call dark dark matter, dark energy that we don't know anything about.",
            "We're hopeful.",
            "And if you certainly, if you've read the coverage about the sun from this weekend, when we switch the LHC ago on again, the media is certainly hopeful that we might be able to say something about that.",
            "Anti matter is a story that always makes headlines whenever certain talks about it, partly because it's the fuel of the USS Enterprise and partly because in fiction people steal it from Santa Barbara, Vatican and all kinds of things like that, but also partly because.",
            "Are anti matter experiments always choose to publish their papers in nature and nature has a huge control over the science that you all consuming that everybody in the world consumes.",
            "Nature is considered a primary source by most of the other science journalists working in the world, but we might be able to say something about that one experiment at the LHC is trying to create matter in the state that it would have been within the first fractions of a billion for the second of the universe.",
            "Is life something that we quite good on plasma?",
            "I'll come back to that again in a little while and explain how it can be evolved into the kind of stuff that makes up ugh.",
            "So."
        ],
        [
            "Curiosity.",
            "That's the first reason.",
            "First and foremost Western exists.",
            "This then is 50 years of particle physics.",
            "This is the one slide for which you need to be completely and utterly away, 'cause this is where I'm going to give you the whole of the standard model of particle physics and it starts off conceptually very simple.",
            "One of the problems we were discussing earlier with science communication is that people by the time they get to the age of everybody in this room, a lot of people have been taught to be frightened of science.",
            "They're still curious about it, but they're frightened of science will come up to you very shyly.",
            "Say I've got a really stupid question.",
            "Take it from me.",
            "Nobody ever has a really stupid question.",
            "They always have really smart questions.",
            "They're just frightened to ask them.",
            "And conceptually anyone can get this.",
            "You know, we made of matter.",
            "Matter is made of molecules and atoms inside those their nuclei with electrons around the outside, completely off scalars.",
            "I don't need to tell you if the nucleus were really that big than the electron would be somewhere outside this building along way outside this building inside the nucleus you have things called protons and neutrons, and inside that you have quarks and hear the math gets really really simple.",
            "An up quark is a fundamental particle with charge 2/3.",
            "A down quark is a fundamental chart particle with charge minus 1/3.",
            "So you put two ups and down together and you get something that has a charge plus one, and that's a proton.",
            "You take 2 downs and up and you get something that's pretty much the same but has charged 0, and that's a neutron and you stick those together in different combinations.",
            "You get all of the elements of the periodic table and then electrons which have charged minus one.",
            "And that's really, really weird when you think about it.",
            "You know this guy here is a composite particle.",
            "This thing as far as we know is not.",
            "But it has exactly the same charges that with the opposite sign which we don't understand why you get all of the elements.",
            "So that's it.",
            "That's that's it.",
            "Except nature is not quite that simple.",
            "So if we write down the sort of periodic table of particles, then you have the up, down quark there when the electron associated with it and then a thing called an electron neutrino which is associated with the electron.",
            "But doesn't take part in bulk matter, there flitting around all over the universe.",
            "But it seems that nature has produced heavier clones of this family.",
            "So we have second and third generations, which we call strange and charm Clarks with a Muon, which is like a heavy electron and Muon type neutrino top and bottom quarks atau which is heavier.",
            "Still the neutrino associated with that.",
            "So that's half the picture that tells you about matter.",
            "Within the standard model of particle physics, there has to be something that tells quarks that they should stick themselves together into very tight, dense objects that we call protons and neutrons, and that they conglomerate into nuclei and something else that tells the electrons that X between the positive and the negative charge of the nuclei and electrons.",
            "To make things that we call atoms and people and tables and chairs and everything else.",
            "And these are different forces.",
            "So at CERN we study.",
            "Most of the fundamental forces of nature and we have a model whereby the forces are mediated by a different category of particle called Bozon.",
            "So it's if you imagine that you're a particle and I'm a particle and we have an interaction.",
            "You know, it's like I throw a football to you and you catch it right now as I throw the football, I recoil slightly and as you catch it, you recoil slightly so that football has transmitted a repulsive force between the two of us.",
            "A bit like that, but of course it's not exactly like that.",
            "Particles don't go around carrying footballs, they're emitted in their absorbed and whatever else, and the forces can be attractive at the quantum level, as well as being repulsive.",
            "But now you could imagine that if instead of a football that I'm throwing at, you have got a cannonball here.",
            "So I've got a great big steel object here.",
            "I'm not going to be able to throw it as far, so our interaction is going to have a shorter range, and that comes back to what I was saying about the Higgs mechanism earlier.",
            "So the forces we study.",
            "What we call the strong nuclear force, which is mediated by particles called gluons.",
            "And that's the thing that interacts between the quarks and causes them to stick together.",
            "The electromagnetic force which is mediated by photons.",
            "And that's what works between electric charges and causes the electrons to orbit the nucleus and then the weak nuclear force, which has been called heavy light.",
            "And This is why braught Anglican hymns were trying to.",
            "Come up with that theory.",
            "Back in the 60s, which has a quite similar strength to the electromagnetic force, but a very different range.",
            "So these particles NW that is neutral electrically and W is charged positively or negatively mediate what we call the weak nuclear force, which is important in the way that stars generate energy and it's responsible for radioactivity on it.",
            "So that's that, and then back in the background of this there is this mysterious cloudy object called the Higgs Bozon, which we announced the discovery of.",
            "Every other particle's mass is determined by the nature of its interaction with the Higgs field and the Higgs Bozon is produced out of a self interaction in the Higgs field, so you can detect the Higgs bozon you have evidence for the mechanism that gives the fundamental particles their mass is, so that's."
        ],
        [
            "That's the hard bit.",
            "That's 50 years of particle physics in a nutshell.",
            "One thing that if you ever go to certain, you'll hear people saying very excitedly is that the Higgs field is a scalar field.",
            "And what that means is that in the interaction I was describing between you and me, it's a vector.",
            "It has a.",
            "It has a numerical value, and it has a direction as a start point and end point goes from there to there.",
            "So all the forces have described apart from the Higgs mechanism.",
            "A bit like the force that these guys feel swimming upstream, they've gotta force coming at them with a certain strength and direction.",
            "the Higgs field is more like this guy that whether he's going up or down or left or right, he feels the same interaction in every direction.",
            "That's the difference between scalar and vector field in particle physics, so I just put that in in case you ever happened.",
            "Talked with his assistant, he start, start talking very excitedly about scalar field."
        ],
        [
            "So don't matter and energy.",
            "How do we know then that there's more stuff out there than you can see well?",
            "When you look at things like this, for example, they're rotating and you can measure their rotation by measuring the Doppler shift of the light coming from the arms that are moving towards you and away from you, so you know how fast the rotating and you can figure out how much mass there is visible mass there is in that object, and when you do that you figure out that there is.",
            "Not nearly enough visible mass in this object to hold it together.",
            "It should be flying apart, but it's not.",
            "So the majority of this thing is some kind of matter that we can't see that interacts gravitationally with the rest of it and holds it together.",
            "So that's how we know about dark matter.",
            "For example, and that's what particle physics might have a chance of explaining.",
            "We have theories that predict the existence of a whole range of particles that we haven't seen in this very good reason why we haven't been able to detect them will see them yet that interact gravitationally and would perhaps account for that.",
            "Whether it's true or not, I have no idea.",
            "It's a theory and that's why we do the experiments."
        ],
        [
            "Anti matter.",
            "If you.",
            "Pay attention to Hollywood.",
            "It looks like that, and actually the canisters not bad 'cause they modeled it on a real one.",
            "They when they made the film Angels Demons, does everybody know what I'm talking about when they talk about Angels and demons?",
            "So you do not read the book or seen the film?",
            "But you know what it doesn't do is sit in the middle of the canister and glow like that, and the canister actually has to be contained in some quite sophisticated equipment magnets to stop it from escaping and touching the outside, but that's what it looks like in Hollywood.",
            "What it looks like for real is here.",
            "I can't tell you which is matter in which is anti matter, but this is actually a picture from a bubble chamber, so these are tracks of bubbles which form along the passage of ionizing particles in the liquid.",
            "And this thing was holding the magnetic field.",
            "So if you've got 2 tracks that are curving in opposite directions with the same sort of radius of curvature.",
            "Then one of them is matter and one of them is anti matter 'cause the only real difference is the electric charge and one charge will go one way, the other charge will go the other way and when we do experiments on matter and anti matter they seem to behave pretty much identically in the laboratory.",
            "Yet we appear to live in a universe made entirely of antimatter.",
            "There's no reason to think that matter, so there's no reason to think that matter and antimatter wouldn't be created in equal quantities at the big banks are where has the anti matter gone or doesn't have a preference for one over the other.",
            "That's the kind of question that we're asking at CERN about anti matter."
        ],
        [
            "Whoops, OK, so then once it got to do with this well certain's main mission is that pure curiosity, and that's where I spent more time talking about that than than anything else.",
            "But when you put smart people together who motivated about understanding the universe."
        ],
        [
            "They want to do physics.",
            "They develop a lot of technologies, so there's a constant interplay between CERN and in particular medical imaging industry, both for imaging and for therapy.",
            "There are two new light iron cancer therapy facilities coming onstream in Europe now, one in Austria and Italy, based on certain accelerator designs, for example, and for medical imaging, the first pet scanner that the University of Geneva Hospital had was built at CERN before you could buy them off the shelf, and we are constantly developing our techniques for image Ng photons.",
            "That's what pet.",
            "Does ultimately so there's a constant interplay there."
        ],
        [
            "We play a very important role in training.",
            "That's something that we take very seriously.",
            "So we have educational programs at CERN that range from primary school up professional schools in computer science, physics, and accelerator science."
        ],
        [
            "And we bring people together through science.",
            "This is actually written in black and white in the Sun Founding Convention.",
            "It says that we will provide.",
            "A center of Excellence for fundamental physics in Europe, but also a place where the countries of Europe can work peacefully together.",
            "And that's something we've always taken very seriously.",
            "We began with 12 Member States in 1954.",
            "Today we have 21 Member States and if you."
        ],
        [
            "It's the origin.",
            "It's quite hard to read this, but by nationality of all of our users.",
            "So it is a user facility, so we provide the basic infrastructure for research, but the experiments are conducted by University groups.",
            "We have people from.",
            "I'm not quite sure how many countries this is, but it's over 100 all over the world and if you look there Slovenia, there are 26 people of Slovenian nationality registered to use certain facilities, for example.",
            "This was correct on the 11th of January this year, it's constantly changing.",
            "The color scheme shows our Member States in dark blue countries.",
            "For observers they are typically countries who've made a significant contribution to a major project, so in this case the LHC in light blue associate members Turkey is recently becoming associate member.",
            "Romania is a candidate for accession, will become a full member by the end of this year.",
            "And yes, Serbia also candidate for accession."
        ],
        [
            "So that's it, that's that's what CERN is, so I hope I've given you just a brief overview of what CERN is.",
            "That's the that's the presentation.",
            "The group of visiting journalists will get when they come to CERN before they go off and meet meet the scientists themselves.",
            "So what do we do about communicating somewhat?"
        ],
        [
            "The first thing I want to do is tell you what.",
            "When I say the word communication, what I mean by the word communication 'cause I know that when I say the word communication to scientists and I can say this 'cause I am one myself.",
            "But what I notice is they often hear is education and what communication is not education.",
            "Education is part of it, maybe, but this comes out of the Oxford English Dictionary.",
            "It gives various definitions of communication and the one I like the best is number 4, the science and practice of transmitting information, so that's pretty close to what we do.",
            "But my definition is goes beyond that communication group.",
            "In an organization like CERN has the job of managing the relationship of that organization with key stakeholder groups in order to allow the organization to carry out its mission unhindered so those stakeholder groups can be all kinds of people.",
            "They can be the people who play the bills.",
            "They can be the people who live next door.",
            "They could be the people who think they're going to create black holes that are going to develop the universe.",
            "Every one of those relationships has to be managed in such a way that those who can support you will and those who can be detrimental to you won't be so that's what we tried to do."
        ],
        [
            "So what is our mission?",
            "I've mentioned it before.",
            "We have two main missions in our convention.",
            "The first one is to pursue world class research in fundamental physics and the 2nd is to bring nations together through peaceful collaboration in science.",
            "But more and more these days with Cern's profile being what it is today.",
            "We also see that we have a responsibility to promote the cause of science more generally in society today and a lot of our communication is not about particle physics these days.",
            "It's about science and science's role in society."
        ],
        [
            "So what's the challenge?",
            "Well, this is something that I keep pinned up on my wall of my office every day.",
            "The challenge of communicating physics.",
            "This is a newspaper cutting from the Guardian from 2007 and it shows three women out Nightclubbing in London I don't know if you recognize who they are, but this is Sarah Ferguson and these are her two daughters, Princesses, Beatrix and Eugenie.",
            "I don't know what in line to the throne of the United Kingdom they are and they were 1618 years old when this picture was taken out.",
            "Nightclubbing with their mum in London and the article includes this wonderful line.",
            "We all remember what it was like to be 18.",
            "The idea of going to a party with one's mother was pretty much up there with joining the after school physics club in terms of social humiliation.",
            "So I think this tells me that science has a bit of an image problem and it's something that we have to address.",
            "I think actually things have changed since then.",
            "I think that it is now actually.",
            "Quite cool among young people to identify with science in a way that it certainly wasn't when I was at University.",
            "It was a bit like that so, but still, you know you gotta, you gotta bear these things in mind."
        ],
        [
            "So where do we start?",
            "Well, I I was made head of communication that served in 2003.",
            "It was clear that we had a great story to tell that we could do a lot with it.",
            "Where did we start?",
            "Well, we started by going out and doing some market research to figure out what people thought about particle physics and what we do.",
            "And I went into this market research thinking we're going to have a really hard sell.",
            "Convincing people that it's worth spending money on curiosity research that doesn't have any practical benefit for them tomorrow.",
            "What we found out is it's not actually if you ask, people should.",
            "Humanity go out and explore the universe and try and understand what atoms are made of.",
            "They say yes of course.",
            "And then you ask them any knowledge that they have the results of our research.",
            "Non any interest in that they claim that they are interested in it, but they believe it's worth doing so they don't understand what we do.",
            "These are real quotes that we got from from market research.",
            "Science is just there.",
            "I don't care with some person.",
            "I haven't got a clue what CERN is it a stone circle?",
            "Somebody said we need to know what's going what's inside an Atom.",
            "And then you tell me more about the survey.",
            "That's a lot of money.",
            "And then they say, will it have a practical benefit for me?",
            "So this obviously simplifying the market research we did there, but this sort of shaped what we did.",
            "We realized.",
            "Well, actually we don't have to sell the notion of doing basic science, but we do have to justify the value for money.",
            "And we do have to show them that there is there is benefit from it.",
            "Practical benefit from it."
        ],
        [
            "So that's where we started.",
            "We also have a problem of perception.",
            "I've mentioned that before that we have to deal with, so the perception of CERN is our title.",
            "We are title.",
            "Actually certain means nothing.",
            "These days, certain was the European Council for Nuclear Research which existed between 1952 and 1954 to create.",
            "The laboratory, whose official title is the European Organization for Nuclear Research, which would give you a different acronym.",
            "But we don't really do much nuclear research anymore.",
            "We do a bit, but mostly what we do is particle physics these days so.",
            "We can't change our name because apart from anything my pension depends on all the contracts that have been signed, signed between various organizations and the European Organization for Nuclear Research.",
            "So we can't change the name.",
            "Every contracts ever signed.",
            "It's been there and certainly is now known, but we tend to refer to ourselves as far as possible.",
            "Is the European version of particle physics, which reflects better what we actually do, so we're not really a nuclear lab.",
            "People think we do military research whenever there are questions about Iran's nuclear program or press office gets calls from journalists who want to comment from the world's leading nuclear authority on.",
            "The Iranian nuclear program we have to explain some.",
            "No, we don't do that.",
            "We are actually forbidden explicitly from doing nuclear research in our convention.",
            "With secret, if we publish openly pushing Open Access publishing were open to the public, we now have about 100,000 members of the public who come through our doors every year.",
            "Lots of our interest is iaccessible if you want to know what's happening with the LHC, you can go and read the log book and we encourage and enable our scientists to communicate so we can your scientists.",
            "We can't control scientists.",
            "They're not going to listen to a communications person, but what we do is we offer training.",
            "We offer encouragement and we introduce them to journalists and so on so.",
            "We are extremely open.",
            "The protein, I think that serves us in good stead.",
            "So transparent."
        ],
        [
            "Is one of the key planks of our communication.",
            "Again, a couple of things that inspired us in developing that approach with these pictures here.",
            "This is a picture.",
            "This organization is also based in Geneva, so I talked to the people who do communications for them quite often and they were quite disturbed that whenever you went to Google and typed World Economic Forum, you got pictures of Davos barricaded or riots in Seattle.",
            "So they decided what can we do 'cause we're not really like that and they decided that they were just going to become open and they were going to flood the infinite.",
            "the Internet with information they were going to engage with people.",
            "So this guy here for example you see him on stage with world leaders and so on and their image has changed.",
            "You'll still find Seattle, but you find a more balanced debate about the World Economic Forum now than you did.",
            "Back in the early in the first decade of this century and this guy, this is a very very UK based story we were talking about it earlier.",
            "This is a person called Colin Pillinger who crashed this thing and he didn't actually.",
            "He landed it on Mars, but he lost it and he lost it over Christmas and it was really built up in the UK news.",
            "It was called Beagle two.",
            "It was a mission that went to Mars and he was on television every day and he was bearing his soul to the world and they lost it.",
            "They've got lost complete contact with this thing and.",
            "Support for space science in the UK went through the roof, even though scientifically this mission was a complete and utter failure becausw.",
            "There was a human story behind it.",
            "People knew what they were trying to do.",
            "They saw the value of it and so on and so forth.",
            "And recently it was in the news again because they found it and it actually did land.",
            "I mean, the thing appears to have landed, but it didn't deploy properly.",
            "One of these little leaves didn't unfold, so it didn't have any source of power, so it came very very close to succeeding."
        ],
        [
            "So these guys were both transparent and honest and open, and I thought we thought at certain that this is where we should.",
            "We should be.",
            "There's a perception out there that's very different from the reality and the way to address that is to be honest about who we are.",
            "You gain trust in the social media.",
            "Age you have no choice.",
            "People are talking about you out there anyway, and if you're not part of that conversation, you're leaving the conversation open to people who might want to say things about that you don't like so much.",
            "And the reason I have this picture here is just a little anecdote that I'd like to tell.",
            "'cause I was talking to a bunch of people who do communications for the civil engineering industry, including a company that's built an amazing thing right here.",
            "Underneath the River, underneath the Houses of Parliament that I knew nothing about until I got the chance to visit it much later and it's amazing.",
            "And they kept it very quiet.",
            "They didn't communicate about it at all.",
            "It was quite challenging from a civil engineering perspective underneath this iconic ancient building underneath the River and whatever else, and they called it off and nobody knows.",
            "And the reason they didn't communicate about it is they thought, well there was a risk they might damage this building.",
            "So my point here was that if that building falls down, people are going to notice whether you tell them before or not, and the fact is it didn't fall down.",
            "And you missed an opportunity to tell the story there that I think could have helped you.",
            "So we are basic approaches.",
            "To be honest, open timely and that makes authorities without us.",
            "That doesn't mean that the Communication Department of certain will just go and tell every journalist everything that comes our way.",
            "A lot of the business of communication is knowing when not to talk and when not to talk about something.",
            "So we spend a lot of time not talking a case in point is last weekend where a lot of our physics community science community was saying let's invite all the world's pressing again for the first time around the LHC.",
            "It's like Rosetta.",
            "It's not like Rosetta.",
            "When we put the first beam around the LLC in 2008, it was a big step forward.",
            "This time it's not.",
            "The story is different, so we were actually trying to fight off the pressure to invite the press in like we do."
        ],
        [
            "Before.",
            "You have to realize that there are many, many audiences out there.",
            "They're not all the same.",
            "You engage with them in different ways.",
            "You want to have a different impact on each of them, their alumni.",
            "There are job seekers, there's industry.",
            "There's the local community.",
            "Very, very important for a big lab like CERN.",
            "There are people at CERN that's a very complex one because there are people who are certain staff.",
            "There are people who are certain users.",
            "There are physicists or engineers.",
            "There's all kinds of people in there, VIPs there are.",
            "Where are they?",
            "There should be the people who pay for certain somewhere.",
            "Member States their educational systems.",
            "The media is an important channel.",
            "General publics I've put Publix there because there is no such thing as the general public.",
            "I was talking to somebody who is the head of the Communication Office of the US Department of Energy, Office of Science, and he said that he has a swear jar on his desk where by anybody who says the word general public has to put a dollar in it and it's always full.",
            "There is no such thing as the general public.",
            "There are all kinds of different Publix out there, and at some point if you're going to communicate, you have or engage with them, you have to decide which ones you want to engage with, which ones are going to be influential, influential on your ability to function.",
            "And which ones you might just want to engage with because you're altruistic, but if you're doing that, at least you need to know why you're doing it."
        ],
        [
            "We are.",
            "This is actually if you ask me, one reason why certain successfully sends communication is successful.",
            "It's here we are very well networked.",
            "Communication Group does not operate in a vacuum.",
            "If I'm missing it this week 'cause it's about now, but I have a weekly phone call with my counterpart at Fermi Lab in the United States where we talk about what we're doing and what stories are coming up and where we can collaborate.",
            "I regularly meet with the communication officers from all the world's big particle physics laboratories and funding agencies and within our Member States, I have a communication context that I know personally in every single country.",
            "So we do a lot of things with them.",
            "Whenever someone is going to communicate something they know before they very often translate into their own languages.",
            "They will take out quotes from CERN scientists.",
            "They'll put in quotes from scientists who come from their country for a laboratory like so, and it's extremely important that we are relevant not just in Geneva.",
            "We relevant wherever our scientists come from, so this network is incredibly valuable to us."
        ],
        [
            "We have great stories to tell.",
            "I think I went through them earlier, so we have."
        ],
        [
            "Stories about science and this is this is a great human story about science.",
            "This is Francois on glare and Peter Higgs meeting each other.",
            "For the first time at CERN in 2012 when we announced the discovery of the particle they predicted in 1964.",
            "They've never met each other before this, so not not just a great scientific story, but a great human story to tell."
        ],
        [
            "As well about innovation, that's Tim Berners Lee.",
            "This is something that I hope you're not too distant future.",
            "You will be able to experience.",
            "This is the first ever web browser that Tim wrote for a computer system called Next Step in the 1990s.",
            "But the problem with it was and remains that it only worked on this particular computer, and it was incredibly sophisticated, sophisticated thing.",
            "It had full windowing capabilities and graphics, and you could edit straight into it.",
            "It was quite a quite impressive thing, and we're trying to build an emulator for it now.",
            "So we have great stories about innovation."
        ],
        [
            "We have great stories about peace.",
            "This is actually the 1st.",
            "Not even officially, but the first sanction meeting between Representatives East and West Germany, which took place that served in the 1960s, because the governments turned a blind eye to their scientists working together at.",
            "And there are many, many, many more stories of that nature, so we have fantastic stories to tell, and it's communication is all about storytelling.",
            "It's all about identifying stories and telling them."
        ],
        [
            "To people and we have stories about education.",
            "So this is 1 visiting group of people.",
            "Something that is very striking.",
            "Again, it goes back to something we were talking about earlier on.",
            "Is that young people are all scientists.",
            "I mean, look at all those hands up in the air there and now.",
            "Try and imagine putting a group of adults in there.",
            "You're not going to get the same.",
            "Are you something happens along the way?"
        ],
        [
            "But children, all scientists, other people, have stories that they want to tell us about us as well, and whether you like it or not, we've, I believe you have to engage with those and we have."
        ],
        [
            "So.",
            "First one."
        ],
        [
            "Not to mention is this.",
            "This is a book that arrived on my desk in 2000.",
            "It was written.",
            "We never met this guy.",
            "Dan Brown.",
            "As far as I know, he never came to Sir.",
            "We've got no record of ever being there.",
            "We wouldn't necessarily have known because he was a complete unknown author until 2005, but he sent this to my boss, whose name was Neil colder.",
            "Neil.",
            "Hope you enjoy the novel.",
            "Remember it's fiction.",
            ":) best wishes.",
            "Dan Brown.",
            "And I got to read it and it was painful.",
            "I have to say, at least until I got halfway through the book 'cause all the first part was about certain.",
            "It was.",
            "I just kept saying that this is wrong.",
            "This is wrong.",
            "This is wrong.",
            "And then it went to Rome and I'm sure it's equally wrong in Rome.",
            "But it was a really good story.",
            "Tracking down this ticking bomb in Rome was a really good story.",
            "It's quite quite an engaging story, but we read it in 2000.",
            "Nobody else.",
            "Nobody bought the book then, but we were aware that it was out there and that this kind of thing might be something had to deal with, so we had a lot of time to think about it."
        ],
        [
            "And then the BBC did this and this was broadcast a few times on BBC Three, which is the BBC's Youth Channel.",
            "It went out on National Geographic.",
            "It went out on Lt I think, and it's what they call a drama documentary and it was triggered by a slightly credible scientist by the name of Martin Rees, who wrote a book called our Final Century.",
            "Martin Reese was the president of the Royal Society at the time and you know our final century.",
            "He just develops the various ways that the human race might cease to exist before the end of this century, and one of them.",
            "Is dealing with how you manage incredibly small risk and he mentioned particle accelerator's in there, and the chapter of the book says well, party works aren't going to destroy the world.",
            "But because he said it, some people.",
            "But if they do.",
            "So this drama documentary plays out a day in the life of an American scientist waking up in London trying to get to New York to switch on a particle accelerator, and he's stopped by.",
            "Super volcanoes and biological one.",
            "There's an asteroid impact.",
            "There's all kinds of things, and the last time he gets there switches on the machine and you can see what's happening there.",
            "Whoops.",
            "You can see what's happening there.",
            "There's a little swirl.",
            "Is the black hole starts to suck the earth?",
            "In so this went out the universe as we know it.",
            "It says here ceases to exist, so this was actually on television and this was 2003 I think."
        ],
        [
            "So there we are.",
            "So we thought it's time for us to time for us to act so 2005.",
            "Dan Brown tried again and he wrote a book called the Davinci Code and People bought that and when they bought that we thought, well, they're going to start looking for other Dan Brown's Angels and demons.",
            "So what are we going to do?",
            "Are we going to pretend it doesn't exist?",
            "Are we going to say Dan Brown is a charlatan and should be no burn in hell or whatever?",
            "Are we going to take as an opportunity?",
            "And we decided that we would take this as an opportunity so?"
        ],
        [
            "If you went to the CERN website in 2005, this is what you saw.",
            "This is a Lockheed X 33 spaceplane and according to Dan Brown's novel, we have one that we keep top Secret and our Director general use it to hop across the Atlantic in half an hour or something like that.",
            "So so we had this picture there with the question does CERN have one of these?"
        ],
        [
            "And what do you think?",
            "We don't.",
            "Does CERN make antimatter?",
            "Yes, we do.",
            "There's a scene in the book where your Charpak Nobel Prize winning physicist was playing Frisbee, so we went on our shores.",
            "Do you play Frisbee and he said no.",
            "So we went and asked other Nobel Prize winning scientists.",
            "Do you play Frisbee and we found one Jack Steinberger, who said I used to when I was younger, so we said.",
            "You can't play Frisbee with George Sharp at, but you could play Frisbee with Jack Steinberger.",
            "If you came to some.",
            "Can antimatter solve the energy crisis is down.",
            "Round says absolutely not.",
            "Does it have anything useful in SoC?",
            "Yes, and discern payroll in doing that.",
            "We also went on to ask more questions, you know just to make antimatter, yes.",
            "How much do we make a year one nanogram?",
            "How much would you require to blow up the Vatican 1/4 of a gram?",
            "How long would it take so long to make that flat out?",
            "250 million years?",
            "So if you want to look for that, you can think of another way to do it.",
            "So we had we had fun with it really, but we also told some serious science stories and.",
            "Traffic to our website jumped by an order of magnitude overnight, and it's never looked back from there, so we felt that it was definitely the best way to go."
        ],
        [
            "To engage with it.",
            "When they made a film of it.",
            "I was so there was surreal moments where we were getting phone calls from Ron Howard, the director of the film.",
            "There he is.",
            "Who wanted to tell the second part of that book?",
            "He wanted to tell the ticking bomb story and just squash all the bad science away where nobody could see it, and he, I think, accepted that the science was nonsense and I think he did actually quite a good job of telling the story and they launched it in a very cold February.",
            "They launched this film to the world's entertainment press at CERN.",
            "So there you have, it's hard to see that you have Ron Howard.",
            "This is an anti matter physicist called Rolf Landua and if you read the book he would be the one who would have been murdered in the opening scene so they can get his eye to go into the LHC.",
            "Which wouldn't work.",
            "Actually, our biometric access systems do test that your eye is actually living.",
            "This is the.",
            "This is the heroine of the movie.",
            "She's an actress called Violet Zora and she is a brilliant, beautiful woman physicist.",
            "Right say that again, this is the heroine at the Hollywood movie who was a brilliant, beautiful particle physicist.",
            "Now that's not a bad role model, we thought.",
            "This is Tom Hanks.",
            "This is actually a brilliant, beautiful particle physicist.",
            "A real one actually.",
            "So we were able to show that the real ones existed too.",
            "And this is our research director Sergio, both of which."
        ],
        [
            "We did times with the launch that they were in many of the cinemas where this came out.",
            "We had physicists giving talks or doing Cafe Scientifique afterwards and if you buy the DVD version of the film there's a 15 minute documentary about CERN on there with Ron Howard and Tom Hanks saying isn't particle physics wonderful?",
            "Which has value for us so."
        ],
        [
            "We thought that was a good thing to do.",
            "That was easy though.",
            "'cause that says fiction on the cover, you know, remember that thing that Dan Brown Sanchez remember it's only fiction.",
            "This did not say fiction on the cover.",
            "These are people who really believe that we're going to destroy the world.",
            "And."
        ],
        [
            "This is the bit of science behind it.",
            "If you ask yourself the question when you're colliding particles at high energy, are you doing something that isn't happening in nature already?",
            "This shows the spectrum of high energy protons coming from space colliding with protons in the atmosphere, and it goes way, way out.",
            "It's much much higher than the LHC can do, so the answer is no, we're not doing things that aren't happening in nature.",
            "We just bring them into Liberty where we can study them."
        ],
        [
            "And this really, I suppose, pushed our approach of open this really to the limit because somebody posted this on a blog site.",
            "In March 2008, so this before we switched on the machine for the first time.",
            "This was somebody.",
            "This is very Pro science blog.",
            "Once we stop these guys at CERN then we have to ban wardrobes we shouldn't be taking the chance of people ending up in Narnia.",
            "So.",
            "We looked at that and what we did, we started going out and talking to audiences about that.",
            "If you analyze that question scientifically.",
            "What is the chance that when you open your wardrobe you end up in Narnia?",
            "And you can think about this scientifically and you can figure out when did human beings invent wardrobes.",
            "And you figure out when that was and how many wardrobes have existed.",
            "And just multiply this by a factor of a billion or two billion each time, just to make sure that you're being giving a very conservative estimate.",
            "How many times you open the door of a wardrobe before they would always fall off and you have to buy a new one so you can figure out roughly.",
            "Keep multiplying by the odd billion.",
            "How many times wardrobe doors have been opened and closed in the history of wardrobes?",
            "And to the best of our knowledge, nobody's ever going to Narnia, but there may be people have gotten not told us, but I suspect that nobody's going to know every time you open wardrobe, find your clothes.",
            "I mean, that's what's always happened, so all you can, you can't say that the next time you open your wardrobe door thinking scientifically, you won't go to Narnia.",
            "You can just say that it's incredibly unlikely, because on the basis of all these experiments that you've done.",
            "So we actually sat down.",
            "We worked that out and we worked out on the basis of cosmic Ray, part of protons hitting the atmosphere that we've measured.",
            "Overtime.",
            "How dangerous it is to run the LX for 20 years compared to opening your door once and we worked out that opening your door once is actually 10,000 times more dangerous than running the LX for 20 years."
        ],
        [
            "And we started publishing stories about this and we found that people got it actually.",
            "So we found that this is one that I wrote for Physics world actually and.",
            "This was after the main proponent of the main proponent of that whole story was asked on The Daily Show.",
            "the American satirical news program what's the probability that she destroying the universe and he said one in two, and they said why?",
            "And he said, well, either it does, or it doesn't.",
            "Therefore, it's pointing to, so he destroyed his own argument there.",
            "But the point I want to make here is that one of the things that I think we've learned over years at CERN is that the more you treat audiences as intelligent people who just don't share the same knowledge bases you, the more they behave like intelligent people as well.",
            "So."
        ],
        [
            "We've done that, so what's the result of all this communication that we've been doing well?",
            "Media visits one of the metrics that we wanted to measure was media visits on the."
        ],
        [
            "Like this is actually number of people, the number of media all through the 90s was 200 media outlets a year.",
            "We peaked in 2008.",
            "That was 1600 people.",
            "I think it was something like 800 media outlets visits visited CERN in 2008 and we've been pretty high ever since 2014.",
            "It's 1200 people in about 500 media outlets, so that was that was the start of the LHC.",
            "In this year it was 340 media outlets on one day."
        ],
        [
            "Come back to that.",
            "When we put a beam around the machine for the first time, Google did that, which was pretty cool for us at the time we had 340 media outlets on site.",
            "450 broadcasters picked up the signal from video news wires and so on, making two and a half thousand transitions, and there were 91 live.",
            "What they call stand up.",
            "So that's when you see a person on the news talking live to a camera from CERN.",
            "Eurovision, who put the signal up on a satellite for us, said that our audience was over a billion, which would make it a huge, huge scientific event.",
            "My favorite headline of the day was from the site which said CERN is the new NASA.",
            "I didn't believe it and I still don't believe it, but it was still nice to read and in our press, cuttings were from really all over the world."
        ],
        [
            "This is.",
            "Global traffic trend on the web?",
            "That's NASA that was NASA over the time period that soon.",
            "And then we dropped back down again to that were a bit higher up now, but NASA still way up there.",
            "And this is Fermi lab that we put on just to see this little blip.",
            "That Fermi lab is getting getting traction from us too.",
            "So we not NASA."
        ],
        [
            "But it was a big day for deal for us.",
            "And then we broke the machine.",
            "And that got a lot of coverage to.",
            "It was always going to get a lot of coverage and you know, of course I will be defensive about this, but I think that we got such we built up such a good relationship with the media who appreciated being invited in.",
            "They appreciated the challenge that we have.",
            "We were very careful to say that the reason that you guys don't normally get invited to the switch on of these big machines is because they never work first time ever and it will probably be the case this time.",
            "They were very sympathetic to us.",
            "They did documentaries called World's Greatest Fixes and things like that.",
            "And we're very supportive as we started up again.",
            "It was very interesting they would have changed between 2018 two 1010 when we did our first first physics runs.",
            "Was the we had few immediate certain we had huge coverage, but the importance of social media had grown vastly soon.",
            "Put out its first tweet on the 19th of September 2008.",
            "By the time we got to 2010 we went up from 90 thousand 220,000 followers on the day and.",
            "This was what was trending on Twitter on the day that says CERN.",
            "That says Ricky Martin.",
            "That says Justin Bieber and we that says LHC LHC didn't quite beat Justin Bieber.",
            "But you know we were way up there on that day and social media now is huge.",
            "We now we now have.",
            "1/4 million people following CERN on Twitter.",
            "And that's that's not just the raw numbers that count, is how engaged that audiences in.",
            "Two years ago, Burson Marsteller, which is a very big communications agency, said Sir was the most influential international organization on Twitter because of the engagement that follows our what we put out there.",
            "We have an average of 130 retweets per per tweet which we smashed recently and I'll come back to that just a few days ago.",
            "Actually with one tweet that got I think 15,000 retweets.",
            "I'll show you that in a minute."
        ],
        [
            "We also notice that people following on Twitter included guys like this.",
            "I don't know if you know who he is, but this is a guy called will I am who was a founding member of the Black Eyed Peas and is a great philanthropist.",
            "He is actually currently studying for a degree in computer science and he gives lost sums of money for inner city STEM education, product projects in Los Angeles.",
            "And in the UK, because he's a judge on The Voice UK, all of his feet from The Voice UK goes to that.",
            "He's a real fan.",
            "So we've had him at CERN on a couple occasions actually, and he's done shout out videos for us and things like this so it is quite important to have people like this who have a good fan base saying they think you're cool."
        ],
        [
            "Higgs update seminar that this was real sign of how the culture had changed, so it wasn't the communication people going to the physicist saying let's make a story out of this.",
            "It was the physicist coming and saying we've got a story.",
            "How are we going to make it fly?",
            "So we made this a very we made this immediate rhythm.",
            "Close to half a million people watched the webcast.",
            "That was a scientific seminar.",
            "We know Tist before this that people way more than people than their product is in there watching some of our scientific seminars so we put in place a live blog in parallel with the webcast to interpret what was being said for people following it or not particle physicist and we had a chat room that people could drop into and ask questions of physicists in the audience.",
            "So that was."
        ],
        [
            "That was a vast event too.",
            "The tonality of our coverage was this.",
            "Now it costs far more money than any publicly funded scientific organization can afford to have readers in every country reading press and analyzing it for you.",
            "But automatic tone analysis is something that media monitoring companies are now doing, so you can get graphs that show this is positive, so this would be they've discovered.",
            "the Higgs isn't it great, and this would be the yellow is they've discovered the Higgs and this would be they've discovered the Higgs, but why did Fabiola use Comic Sands as her fund?",
            "And actually, that is what it was.",
            "The negatives were all about.",
            "That it allows you just to dig in and see how you're being covered, not just the volume of your coverage, because it's one thing to get vast coverage.",
            "It's another thing to know what is being said about you, of course."
        ],
        [
            "The biggest story of 2013 was the Nobel Prize.",
            "In"
        ],
        [
            "Physics are biggest stories from last year.",
            "Tim Berners Lee being awarded another prize for the invention of the World Wide Web.",
            "Anybody guess what our biggest story of last year would have been from CERN?",
            "Think about it.",
            "So in turn 60.",
            "It amazes me that anyone was interested in that at all, but they were.",
            "Like be one of our experiments, discovered 2 new particles.",
            "This is really esoteric science, but it's a huge peak there, so that again is something that tells you that there's an appetite out there if you tell it in the right channels in the right way.",
            "And our biggest story that the other Giannotti was nominated for the next directional of certain, the first woman to lead the organization."
        ],
        [
            "Biggest stories this year.",
            "That was our biggest story this year.",
            "Certain researchers discovered before and they are using the force.",
            "This is the one that got 15,000 retweets on Twitter.",
            "It was fun."
        ],
        [
            "But this didn't do too badly, even though it happened on Easter Sunday, so we've had over 6000 press cuttings about the first circulating beam in the LHC this year.",
            "We live blogged it in 36,000 people, following it through parts of the day.",
            "The website had 93,000 visitors, which isn't bad for Easter Sunday, but on April the 1st 1.3 million people went and read that story on our website.",
            "So that was that was quite a big story, even though from a content point of view threading a low energy beam around the LHC is not really such a big deal, it's a symbolic restart of run to the legacy."
        ],
        [
            "Why does it matter so this is.",
            "This is where I want to wrap up.",
            "Now I mentioned at the beginning that we've got a third thread to our mandate now, and that's promote science."
        ],
        [
            "Why does it matter?",
            "Well that's the cover of the March edition of National Geographic this year.",
            "The War on science.",
            "Say climate change doesn't exist.",
            "Evolution never happened.",
            "The moon landing was fake.",
            "You can see somebody faking it.",
            "Their vaccination causes autism and genetically modified food is evil.",
            "Now it's not that.",
            "National Geographic believes that, but that's popular.",
            "Perception of science is out there and the anti Science movement is getting stronger and stronger and stronger, which is dangerous.",
            "When we were living at the time when we actually need science.",
            "Is that a rational approach to take these days?",
            "Is a scientific organization, even though I spent a long time trying to avoid the fact we've got nuclear in our title?",
            "Is that a rational approach?",
            "Is this going to solve the world's energy problems?",
            "What are we going to do about climate change vaccines?",
            "My kids are at the age where this story first broke in the UK, and it's heartbreaking that parents chose not to vaccinate their kids and the country is still suffering from that.",
            "Are mobile phones going to fry your brain now?",
            "People people now I think need to really well.",
            "Science needs to re engage with people so they have a rational evidence based mechanism for dealing with questions like."
        ],
        [
            "And this is just one example that I've taken from him.",
            "Former DG of certain crystalline Smith, who gave this talk in 2011, just about energies.",
            "So when the time you gave this talk worlds using energy at 15.7 terawatts, set to increase 50% by 2031.6 billion people lack electricity.",
            "90% hoops pressing the wrong button.",
            "90% of our energy comes from burning things 5% from nuclear, 5% from hydro, half a percent from all other other renewables.",
            "So.",
            "We feel that an organization likes and needs, maybe not to actually stand up and promote nuclear, but actually promote rational evidence based discussions on issues such as this.",
            "So Chris, there in this particular talk he was showing a potential solution if you could solve the politics and you could put solar farms in these places here.",
            "Then you more than solve the world's energy problems.",
            "Politics and technology of distribution as well."
        ],
        [
            "So one of the things that we do is we organized TEDx events and we've done 2 now.",
            "This was the opening speaker of FedEx and last year.",
            "His name is Bob Chris and he's a professor of philosophy at Stony Brook, who studies, among other things, why it is that the political circles on the planet of disengaged with science, and what science needs to do to re engage with them.",
            "So he set the framework for it."
        ],
        [
            "But we actually went out and we looked at the major challenges that society is facing and we looked at the kind of buzzwords that are creating negative vibes in the media, and we put them together.",
            "So we invited people to talk about nanotechnologies.",
            "This is Sonia Trigueros, who's looking at nanomedicine.",
            "For example, this is Marcia Barbosa who studies water and amazing weird ones for properties of water, and I was looking at one of the things that she was talking about in her talk.",
            "Was the fact that if you put Brian along carbon nanotubes, then the water propagates at a different rate from anything else, which may be useful at some point.",
            "This is an ex particle physicist talking about the statistics of climate change.",
            "This is John Mighton who was talking about the importance of science, technology, engineering, mathematics education.",
            "This is 3 Kumar Banerjee talking about thorium cycle vision.",
            "So much cleaner way of getting energy from vision and this was Nina Fedoroff talking about.",
            "GMO is among the research that she's done has been looking at genetic modification for drought resistance in food crops for example and we just thought it would be useful for to use the platform to say there are.",
            "Other ideas out there and we should have a positive debate about them rather than just write them off."
        ],
        [
            "So that's it.",
            "So my take home message here.",
            "I think you know I don't need to tell you science matters, but I think that we're living in a time where communicating science really matters.",
            "If we're going to sustain to secure a sustainable future for the planet and with certain visibility, it's great that we were able to promote particle physics.",
            "But we do it for more than just our own field of science.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Morning there ladies and gentlemen.",
                    "label": 0
                },
                {
                    "sent": "It is my pleasure to welcome today today, speakers Doctor James Gillies, head of Communications Group at CERN.",
                    "label": 0
                },
                {
                    "sent": "Let me briefly introduce Doctor Gillies, the person behind many news that we heard of the achievements in CERN, I guess.",
                    "label": 0
                },
                {
                    "sent": "He received BS with first class honor in physics from the University of London Diploma in Science, Communication from the University of London and PhD in experimental particle physics from the University of Oxford.",
                    "label": 0
                },
                {
                    "sent": "From 1988 to 19 thirty 1993 he was a research assistant and then hire scientific officer in Rutherford Appleton Laboratory, UK.",
                    "label": 0
                },
                {
                    "sent": "In 1992 he worked for three months as a science journalist at BBC World Service UK and then from 93 to 95 he was ahead of science at the British Council in Paris, in France.",
                    "label": 0
                },
                {
                    "sent": "From 1995 to 2003 he was a member of Communication Group at CERN and then in 2003 he became a head of Communication Group in CERN.",
                    "label": 0
                },
                {
                    "sent": "He scientific research of the physics of elementary particles have been reported in about 120 papers.",
                    "label": 0
                },
                {
                    "sent": "Doctor Gillis is a senior communication manager with particular experience in an international scientific environment.",
                    "label": 0
                },
                {
                    "sent": "He has proven leadership leadership skills in managing, developing, and motivating diverse teams to deliver communications across a wide range of sectors, from media relations to exhibitions, but he's also skilled in writing.",
                    "label": 0
                },
                {
                    "sent": "He wrote the successful Oxford University Press title, how the web was born.",
                    "label": 0
                },
                {
                    "sent": "Among his main achievements, we should stress the development and implementation of a global multi annual communication stretched strategy for the launch of the Large Hadron Collider.",
                    "label": 0
                },
                {
                    "sent": "He was a manager of successful communication campaign for the 50s universe anniversary of the Sun in 2004, which included the publication of the book Infinitely CERN.",
                    "label": 0
                },
                {
                    "sent": "An open day attended by.",
                    "label": 0
                },
                {
                    "sent": "32,000 people and yet and a year long media campaign.",
                    "label": 0
                },
                {
                    "sent": "Doctor Gillis was invited by the eyes of Futerra Chair Project, in which we could recognize the science communication as an essential for its sustainability.",
                    "label": 0
                },
                {
                    "sent": "So let us learn something from certain communications.",
                    "label": 0
                },
                {
                    "sent": "Of science doctor Giles thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Was that really me?",
                    "label": 0
                },
                {
                    "sent": "I've forgotten a lot of that, but there we are anyway so.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What I'd like to talk to you about today is I'm going to start talking a little bit about CERN.",
                    "label": 0
                },
                {
                    "sent": "What CERN is?",
                    "label": 0
                },
                {
                    "sent": "I realize that you're not all particle physicist, so I will give you an introduction soon.",
                    "label": 0
                },
                {
                    "sent": "But also, this is a fairly standard introduction.",
                    "label": 0
                },
                {
                    "sent": "This is the introduction that my team will give whenever they are presenting Son to outside visitors, be they members of the public or journalists so.",
                    "label": 0
                },
                {
                    "sent": "So what is CERN?",
                    "label": 0
                },
                {
                    "sent": "Well, CERN is a place of extremes.",
                    "label": 0
                },
                {
                    "sent": "What you see here on this picture is.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The trace of where the Large Hadron Collider goes.",
                    "label": 0
                },
                {
                    "sent": "This is a 27 kilometre machine that I'm going to describe in a minute.",
                    "label": 0
                },
                {
                    "sent": "So flagship machine it's not our only machine.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is Geneva Airport, so it gives you an idea of the scale of the tunnel.",
                    "label": 0
                },
                {
                    "sent": "The city of Geneva is here and I understand the city of Geneva is about a similar size as the city of Libya in terms of population.",
                    "label": 0
                },
                {
                    "sent": "So it gives you an idea of the scale of this machine.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That's what he looks when you get underground and into the tunnel.",
                    "label": 0
                },
                {
                    "sent": "One way of looking at the LHC.",
                    "label": 0
                },
                {
                    "sent": "There it is.",
                    "label": 0
                },
                {
                    "sent": "There is it's the fastest race track on the planet.",
                    "label": 1
                },
                {
                    "sent": "What we do with this machine is we take tiny bits of stuff, protons of which were all made and we accelerate them to a fraction under the speed of light and we collide with each other.",
                    "label": 0
                },
                {
                    "sent": "They're going so close to the speed of light that this is the kind of thing that you get asked if you do communications journalist said, well how close to the speed of light, and so we worked it out.",
                    "label": 0
                },
                {
                    "sent": "But if we were to send our protons in a race with the light beam to Proxima Centura, our nearest star apart from the sun.",
                    "label": 0
                },
                {
                    "sent": "They would arrive a few seconds later after journey time of 42 years, so it's that close to the speed of light.",
                    "label": 0
                },
                {
                    "sent": "We're getting these particles to go around this tunnel.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We won't need particles as I said to collide with each other.",
                    "label": 0
                },
                {
                    "sent": "We don't want them to collide with anything else they're doing at that speed, 11,245 laps per second of this machine, and we keep them going around and around for hours and hours at a time in a beam of particles.",
                    "label": 0
                },
                {
                    "sent": "Being with particles is something like about this long 10th with human hair.",
                    "label": 0
                },
                {
                    "sent": "It contains 100 billion protons, but yet most of the time when these.",
                    "label": 1
                },
                {
                    "sent": "Bunches of particles pass through each other.",
                    "label": 0
                },
                {
                    "sent": "Only a handful of protons actually collide, so we can keep them going around for ages.",
                    "label": 0
                },
                {
                    "sent": "We want the protons to collide with themselves, not with anything else.",
                    "label": 0
                },
                {
                    "sent": "We have to develop extremely high vacuum technologies, which means that we're not quite as good inside this beam pipe where the particles circulate as the vacuum on the surface of the moon, but we're not far off the level of vacuum that you find there.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The large hydrocolloid was a superconducting machine.",
                    "label": 0
                },
                {
                    "sent": "That means that it uses a property of certain materials to carry electricity with no resistance at very, very low temperatures.",
                    "label": 0
                },
                {
                    "sent": "The reason why we need to do that is that what keeps those protons going around in the circle.",
                    "label": 1
                },
                {
                    "sent": "Is the ring of Electro magnets and those Electro magnets have to carry this year?",
                    "label": 0
                },
                {
                    "sent": "It's a current of 11,000 and 80 amperes is what they've all been trained to, so that's a huge amount of current.",
                    "label": 0
                },
                {
                    "sent": "If you wanted to do that with normal copper, then you would need a bundle of copper that I could hardly get my arms around, and it's quite difficult to wind coils out of that.",
                    "label": 0
                },
                {
                    "sent": "So we use two conductivity and you can get the same current done away with that kind of cross section.",
                    "label": 0
                },
                {
                    "sent": "But it means that we have to operate the LHC at below 4.2 degrees above absolute zero.",
                    "label": 0
                },
                {
                    "sent": "We actually operated at one point 9 degrees Resolute 0, so that is makes it about 1 degree colder than the average temperature of outer space.",
                    "label": 0
                },
                {
                    "sent": "So it's a very cold machine.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "When particles collide and these are pictures of particle collisions taken by particle detectors, they showed tracks coming out of the collisions.",
                    "label": 1
                },
                {
                    "sent": "Protracted new particles produced in the collisions coming out.",
                    "label": 1
                },
                {
                    "sent": "They produce tiny little fireballs of energy at extremely high temperatures of 100,000 * 100 million times the temperature of the core of the sun.",
                    "label": 0
                },
                {
                    "sent": "I might be a few orders of magnitude off there, and if I am excuse me, I'm noticing there is at least one particle physicist in the blink rate.",
                    "label": 0
                },
                {
                    "sent": "Incredibly hot temperatures been in very small space.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We want to measure those particles.",
                    "label": 0
                },
                {
                    "sent": "It's actually that's where the core of our Sciences is.",
                    "label": 0
                },
                {
                    "sent": "By watching these particles collide with each other and analyzing what comes out that we can ask some very profound questions about the nature of the universe.",
                    "label": 0
                },
                {
                    "sent": "So we have huge sensors and here is 1.",
                    "label": 0
                },
                {
                    "sent": "There's a person standing in the middle there that gives you an idea of the scale of them.",
                    "label": 0
                },
                {
                    "sent": "This is one of the four LHC particle detectors.",
                    "label": 1
                },
                {
                    "sent": "It's called the Compact Muon solenoid.",
                    "label": 0
                },
                {
                    "sent": "Act it is compared to its rival very small, but you can see it's an enormous device and.",
                    "label": 0
                },
                {
                    "sent": "It's a sign of the rate of progress in this field of science that I worked on the last generation of experiments at CERN, where the comparable detector had something like 10,000 readout channels in it.",
                    "label": 0
                },
                {
                    "sent": "This one has 100 million readout channels in it.",
                    "label": 0
                },
                {
                    "sent": "The detector I worked on recorded data at the rate of 10 Hertz.",
                    "label": 0
                },
                {
                    "sent": "This one is sampling data at 40 megahertz.",
                    "label": 0
                },
                {
                    "sent": "The collaboration I worked on with 300 people, this one is 3000 people, so it's a very very big scale of science Now and if I ever wanted to go back I would be completely and utterly lost.",
                    "label": 0
                },
                {
                    "sent": "Going back into this kind of research environment and that's in just one generation.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Experiment.",
                    "label": 0
                },
                {
                    "sent": "Within that detector I mentioned the number of 100 I mentioned the number #100 million.",
                    "label": 0
                },
                {
                    "sent": "Sensors 100 million readout channels reading out information about the collisions 40 megahertz.",
                    "label": 0
                },
                {
                    "sent": "The time that the amount that we are sampling data if you multiply those numbers together, you get a very large number and that tells you that there's a huge amount of data coming out of these things.",
                    "label": 0
                },
                {
                    "sent": "So we need to have a very extensive computer system and what we do is we have something called the worldwide LHC computing grid, about 10% of which is at CERN, and the rest of it is distributed around the world.",
                    "label": 1
                },
                {
                    "sent": "To analyze the data we actually throw away the vast majority of the data by very quickly sampling it before.",
                    "label": 0
                },
                {
                    "sent": "We record it so that we make sure that we're only recording data that might contain interesting science.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's sort of what, and by this point audiences are usually saying, well, why on Earth would you want to do all that to those poor little protons?",
                    "label": 0
                },
                {
                    "sent": "And the answer is.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Essentially because human beings are curious.",
                    "label": 0
                },
                {
                    "sent": "I'll come back to that in the second part of my talk when I talk about certain communications.",
                    "label": 0
                },
                {
                    "sent": "We have always, as long as there have been human beings, we've always wanted to understand the universe we live in.",
                    "label": 0
                },
                {
                    "sent": "We've always wanted to push back the nature of our amount of knowledge we have about this universe, the world that we inhabit.",
                    "label": 1
                },
                {
                    "sent": "And that's why certain exists.",
                    "label": 0
                },
                {
                    "sent": "We were created in 1954.",
                    "label": 0
                },
                {
                    "sent": "To provide a center of excellence for basic research and physics for Europe after the war.",
                    "label": 0
                },
                {
                    "sent": "And these are the kinds of questions that we will address it soon, so Newton's unfinished business where we're getting there now.",
                    "label": 0
                },
                {
                    "sent": "Actually, this is a drawing of Newton mapping out the universe and what Newton gave us was a description of gravity, a description of the force that acts upon mass property that we call mass.",
                    "label": 0
                },
                {
                    "sent": "This guy gave us a better one.",
                    "label": 0
                },
                {
                    "sent": "General relativity, but what this guy did was still good enough for us to put people on the moon and send probes out into space.",
                    "label": 0
                },
                {
                    "sent": "It wasn't good enough to power the GPS system that I use in my mobile phone for that I have to use general relativity, but neither.",
                    "label": 0
                },
                {
                    "sent": "Newton or Einstein actually told us what it is that mass is what is?",
                    "label": 0
                },
                {
                    "sent": "Principles, where is the property that we call mass come from?",
                    "label": 1
                },
                {
                    "sent": "What is it that gravity acts upon?",
                    "label": 0
                },
                {
                    "sent": "And for that we had to wait for this person and a couple of others, the other two got the Nobel Prize which have chosen to show him this was Francois Anglers, PhD supervisor at Cornell University and his name was Robert Broughton.",
                    "label": 0
                },
                {
                    "sent": "He passed away, I think in 2010, which is the reason you've heard of a glaring Higgs but not of him.",
                    "label": 0
                },
                {
                    "sent": "He, Francois Wrangler in 1964 and independently Peter Higgs published a paper in I think just about the same issue of the same Journal, but they did it independently.",
                    "label": 0
                },
                {
                    "sent": "Explaining why it is that certain forces of nature have a different range from others and they described it by saying that the carriers of certain forces have a heavier than others, basically so they were they were producing a paper that was.",
                    "label": 0
                },
                {
                    "sent": "Aimed at describing the range of fundamental forces.",
                    "label": 0
                },
                {
                    "sent": "But actually goes much further because the mechanism they described is what gives master all the fundamental particles and we call it.",
                    "label": 0
                },
                {
                    "sent": "We call it.",
                    "label": 0
                },
                {
                    "sent": "Now the browsing that Higgs mechanism, but the particle itself has got known as the Higgs particle.",
                    "label": 0
                },
                {
                    "sent": "So that's coming to an end.",
                    "label": 0
                },
                {
                    "sent": "Now we announced the discovery of that particle.",
                    "label": 0
                },
                {
                    "sent": "Remember, 1964 was when they when they publish these papers, 2012 is when the experiment symbol to announce that we had confirmed those papers.",
                    "label": 0
                },
                {
                    "sent": "It's a very long business if you want to do particle physics.",
                    "label": 0
                },
                {
                    "sent": "That's only one of the questions, and it's probably the least interesting of the questions that the LHC was designed to address.",
                    "label": 0
                },
                {
                    "sent": "It was the only question that we were pretty much guaranteed an answer to, so the rest is now in nature's hands.",
                    "label": 0
                },
                {
                    "sent": "But we're very excited that we might be able to answer some of these.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "Over the last 50 years or so, particle physics has built up a very good picture to explain the fundamental constituents of everything that we are made of.",
                    "label": 0
                },
                {
                    "sent": "The tables, chairs, UMI, stars, planets, everything you can see in the universe is made of.",
                    "label": 0
                },
                {
                    "sent": "But at the same time that we've been doing that, there have been other catcher.",
                    "label": 0
                },
                {
                    "sent": "Give scientist looking out into space, where as we look into inner space.",
                    "label": 0
                },
                {
                    "sent": "There are people looking out into space and they figured out that the visible stuff is only about 5% of what's out there, so there's 95% of the stuff that makes up the universe that we call dark dark matter, dark energy that we don't know anything about.",
                    "label": 0
                },
                {
                    "sent": "We're hopeful.",
                    "label": 0
                },
                {
                    "sent": "And if you certainly, if you've read the coverage about the sun from this weekend, when we switch the LHC ago on again, the media is certainly hopeful that we might be able to say something about that.",
                    "label": 0
                },
                {
                    "sent": "Anti matter is a story that always makes headlines whenever certain talks about it, partly because it's the fuel of the USS Enterprise and partly because in fiction people steal it from Santa Barbara, Vatican and all kinds of things like that, but also partly because.",
                    "label": 0
                },
                {
                    "sent": "Are anti matter experiments always choose to publish their papers in nature and nature has a huge control over the science that you all consuming that everybody in the world consumes.",
                    "label": 0
                },
                {
                    "sent": "Nature is considered a primary source by most of the other science journalists working in the world, but we might be able to say something about that one experiment at the LHC is trying to create matter in the state that it would have been within the first fractions of a billion for the second of the universe.",
                    "label": 1
                },
                {
                    "sent": "Is life something that we quite good on plasma?",
                    "label": 0
                },
                {
                    "sent": "I'll come back to that again in a little while and explain how it can be evolved into the kind of stuff that makes up ugh.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Curiosity.",
                    "label": 0
                },
                {
                    "sent": "That's the first reason.",
                    "label": 0
                },
                {
                    "sent": "First and foremost Western exists.",
                    "label": 0
                },
                {
                    "sent": "This then is 50 years of particle physics.",
                    "label": 0
                },
                {
                    "sent": "This is the one slide for which you need to be completely and utterly away, 'cause this is where I'm going to give you the whole of the standard model of particle physics and it starts off conceptually very simple.",
                    "label": 0
                },
                {
                    "sent": "One of the problems we were discussing earlier with science communication is that people by the time they get to the age of everybody in this room, a lot of people have been taught to be frightened of science.",
                    "label": 0
                },
                {
                    "sent": "They're still curious about it, but they're frightened of science will come up to you very shyly.",
                    "label": 0
                },
                {
                    "sent": "Say I've got a really stupid question.",
                    "label": 0
                },
                {
                    "sent": "Take it from me.",
                    "label": 0
                },
                {
                    "sent": "Nobody ever has a really stupid question.",
                    "label": 0
                },
                {
                    "sent": "They always have really smart questions.",
                    "label": 0
                },
                {
                    "sent": "They're just frightened to ask them.",
                    "label": 0
                },
                {
                    "sent": "And conceptually anyone can get this.",
                    "label": 0
                },
                {
                    "sent": "You know, we made of matter.",
                    "label": 0
                },
                {
                    "sent": "Matter is made of molecules and atoms inside those their nuclei with electrons around the outside, completely off scalars.",
                    "label": 0
                },
                {
                    "sent": "I don't need to tell you if the nucleus were really that big than the electron would be somewhere outside this building along way outside this building inside the nucleus you have things called protons and neutrons, and inside that you have quarks and hear the math gets really really simple.",
                    "label": 0
                },
                {
                    "sent": "An up quark is a fundamental particle with charge 2/3.",
                    "label": 0
                },
                {
                    "sent": "A down quark is a fundamental chart particle with charge minus 1/3.",
                    "label": 0
                },
                {
                    "sent": "So you put two ups and down together and you get something that has a charge plus one, and that's a proton.",
                    "label": 0
                },
                {
                    "sent": "You take 2 downs and up and you get something that's pretty much the same but has charged 0, and that's a neutron and you stick those together in different combinations.",
                    "label": 0
                },
                {
                    "sent": "You get all of the elements of the periodic table and then electrons which have charged minus one.",
                    "label": 0
                },
                {
                    "sent": "And that's really, really weird when you think about it.",
                    "label": 0
                },
                {
                    "sent": "You know this guy here is a composite particle.",
                    "label": 0
                },
                {
                    "sent": "This thing as far as we know is not.",
                    "label": 0
                },
                {
                    "sent": "But it has exactly the same charges that with the opposite sign which we don't understand why you get all of the elements.",
                    "label": 0
                },
                {
                    "sent": "So that's it.",
                    "label": 0
                },
                {
                    "sent": "That's that's it.",
                    "label": 0
                },
                {
                    "sent": "Except nature is not quite that simple.",
                    "label": 0
                },
                {
                    "sent": "So if we write down the sort of periodic table of particles, then you have the up, down quark there when the electron associated with it and then a thing called an electron neutrino which is associated with the electron.",
                    "label": 0
                },
                {
                    "sent": "But doesn't take part in bulk matter, there flitting around all over the universe.",
                    "label": 0
                },
                {
                    "sent": "But it seems that nature has produced heavier clones of this family.",
                    "label": 0
                },
                {
                    "sent": "So we have second and third generations, which we call strange and charm Clarks with a Muon, which is like a heavy electron and Muon type neutrino top and bottom quarks atau which is heavier.",
                    "label": 0
                },
                {
                    "sent": "Still the neutrino associated with that.",
                    "label": 0
                },
                {
                    "sent": "So that's half the picture that tells you about matter.",
                    "label": 0
                },
                {
                    "sent": "Within the standard model of particle physics, there has to be something that tells quarks that they should stick themselves together into very tight, dense objects that we call protons and neutrons, and that they conglomerate into nuclei and something else that tells the electrons that X between the positive and the negative charge of the nuclei and electrons.",
                    "label": 0
                },
                {
                    "sent": "To make things that we call atoms and people and tables and chairs and everything else.",
                    "label": 0
                },
                {
                    "sent": "And these are different forces.",
                    "label": 0
                },
                {
                    "sent": "So at CERN we study.",
                    "label": 0
                },
                {
                    "sent": "Most of the fundamental forces of nature and we have a model whereby the forces are mediated by a different category of particle called Bozon.",
                    "label": 0
                },
                {
                    "sent": "So it's if you imagine that you're a particle and I'm a particle and we have an interaction.",
                    "label": 0
                },
                {
                    "sent": "You know, it's like I throw a football to you and you catch it right now as I throw the football, I recoil slightly and as you catch it, you recoil slightly so that football has transmitted a repulsive force between the two of us.",
                    "label": 0
                },
                {
                    "sent": "A bit like that, but of course it's not exactly like that.",
                    "label": 0
                },
                {
                    "sent": "Particles don't go around carrying footballs, they're emitted in their absorbed and whatever else, and the forces can be attractive at the quantum level, as well as being repulsive.",
                    "label": 1
                },
                {
                    "sent": "But now you could imagine that if instead of a football that I'm throwing at, you have got a cannonball here.",
                    "label": 0
                },
                {
                    "sent": "So I've got a great big steel object here.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to be able to throw it as far, so our interaction is going to have a shorter range, and that comes back to what I was saying about the Higgs mechanism earlier.",
                    "label": 0
                },
                {
                    "sent": "So the forces we study.",
                    "label": 0
                },
                {
                    "sent": "What we call the strong nuclear force, which is mediated by particles called gluons.",
                    "label": 0
                },
                {
                    "sent": "And that's the thing that interacts between the quarks and causes them to stick together.",
                    "label": 0
                },
                {
                    "sent": "The electromagnetic force which is mediated by photons.",
                    "label": 0
                },
                {
                    "sent": "And that's what works between electric charges and causes the electrons to orbit the nucleus and then the weak nuclear force, which has been called heavy light.",
                    "label": 0
                },
                {
                    "sent": "And This is why braught Anglican hymns were trying to.",
                    "label": 0
                },
                {
                    "sent": "Come up with that theory.",
                    "label": 0
                },
                {
                    "sent": "Back in the 60s, which has a quite similar strength to the electromagnetic force, but a very different range.",
                    "label": 0
                },
                {
                    "sent": "So these particles NW that is neutral electrically and W is charged positively or negatively mediate what we call the weak nuclear force, which is important in the way that stars generate energy and it's responsible for radioactivity on it.",
                    "label": 0
                },
                {
                    "sent": "So that's that, and then back in the background of this there is this mysterious cloudy object called the Higgs Bozon, which we announced the discovery of.",
                    "label": 0
                },
                {
                    "sent": "Every other particle's mass is determined by the nature of its interaction with the Higgs field and the Higgs Bozon is produced out of a self interaction in the Higgs field, so you can detect the Higgs bozon you have evidence for the mechanism that gives the fundamental particles their mass is, so that's.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That's the hard bit.",
                    "label": 0
                },
                {
                    "sent": "That's 50 years of particle physics in a nutshell.",
                    "label": 0
                },
                {
                    "sent": "One thing that if you ever go to certain, you'll hear people saying very excitedly is that the Higgs field is a scalar field.",
                    "label": 1
                },
                {
                    "sent": "And what that means is that in the interaction I was describing between you and me, it's a vector.",
                    "label": 0
                },
                {
                    "sent": "It has a.",
                    "label": 0
                },
                {
                    "sent": "It has a numerical value, and it has a direction as a start point and end point goes from there to there.",
                    "label": 0
                },
                {
                    "sent": "So all the forces have described apart from the Higgs mechanism.",
                    "label": 0
                },
                {
                    "sent": "A bit like the force that these guys feel swimming upstream, they've gotta force coming at them with a certain strength and direction.",
                    "label": 0
                },
                {
                    "sent": "the Higgs field is more like this guy that whether he's going up or down or left or right, he feels the same interaction in every direction.",
                    "label": 0
                },
                {
                    "sent": "That's the difference between scalar and vector field in particle physics, so I just put that in in case you ever happened.",
                    "label": 0
                },
                {
                    "sent": "Talked with his assistant, he start, start talking very excitedly about scalar field.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So don't matter and energy.",
                    "label": 0
                },
                {
                    "sent": "How do we know then that there's more stuff out there than you can see well?",
                    "label": 0
                },
                {
                    "sent": "When you look at things like this, for example, they're rotating and you can measure their rotation by measuring the Doppler shift of the light coming from the arms that are moving towards you and away from you, so you know how fast the rotating and you can figure out how much mass there is visible mass there is in that object, and when you do that you figure out that there is.",
                    "label": 0
                },
                {
                    "sent": "Not nearly enough visible mass in this object to hold it together.",
                    "label": 0
                },
                {
                    "sent": "It should be flying apart, but it's not.",
                    "label": 0
                },
                {
                    "sent": "So the majority of this thing is some kind of matter that we can't see that interacts gravitationally with the rest of it and holds it together.",
                    "label": 0
                },
                {
                    "sent": "So that's how we know about dark matter.",
                    "label": 0
                },
                {
                    "sent": "For example, and that's what particle physics might have a chance of explaining.",
                    "label": 0
                },
                {
                    "sent": "We have theories that predict the existence of a whole range of particles that we haven't seen in this very good reason why we haven't been able to detect them will see them yet that interact gravitationally and would perhaps account for that.",
                    "label": 0
                },
                {
                    "sent": "Whether it's true or not, I have no idea.",
                    "label": 0
                },
                {
                    "sent": "It's a theory and that's why we do the experiments.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anti matter.",
                    "label": 0
                },
                {
                    "sent": "If you.",
                    "label": 0
                },
                {
                    "sent": "Pay attention to Hollywood.",
                    "label": 0
                },
                {
                    "sent": "It looks like that, and actually the canisters not bad 'cause they modeled it on a real one.",
                    "label": 0
                },
                {
                    "sent": "They when they made the film Angels Demons, does everybody know what I'm talking about when they talk about Angels and demons?",
                    "label": 0
                },
                {
                    "sent": "So you do not read the book or seen the film?",
                    "label": 0
                },
                {
                    "sent": "But you know what it doesn't do is sit in the middle of the canister and glow like that, and the canister actually has to be contained in some quite sophisticated equipment magnets to stop it from escaping and touching the outside, but that's what it looks like in Hollywood.",
                    "label": 0
                },
                {
                    "sent": "What it looks like for real is here.",
                    "label": 0
                },
                {
                    "sent": "I can't tell you which is matter in which is anti matter, but this is actually a picture from a bubble chamber, so these are tracks of bubbles which form along the passage of ionizing particles in the liquid.",
                    "label": 0
                },
                {
                    "sent": "And this thing was holding the magnetic field.",
                    "label": 0
                },
                {
                    "sent": "So if you've got 2 tracks that are curving in opposite directions with the same sort of radius of curvature.",
                    "label": 0
                },
                {
                    "sent": "Then one of them is matter and one of them is anti matter 'cause the only real difference is the electric charge and one charge will go one way, the other charge will go the other way and when we do experiments on matter and anti matter they seem to behave pretty much identically in the laboratory.",
                    "label": 0
                },
                {
                    "sent": "Yet we appear to live in a universe made entirely of antimatter.",
                    "label": 0
                },
                {
                    "sent": "There's no reason to think that matter, so there's no reason to think that matter and antimatter wouldn't be created in equal quantities at the big banks are where has the anti matter gone or doesn't have a preference for one over the other.",
                    "label": 0
                },
                {
                    "sent": "That's the kind of question that we're asking at CERN about anti matter.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Whoops, OK, so then once it got to do with this well certain's main mission is that pure curiosity, and that's where I spent more time talking about that than than anything else.",
                    "label": 0
                },
                {
                    "sent": "But when you put smart people together who motivated about understanding the universe.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "They want to do physics.",
                    "label": 0
                },
                {
                    "sent": "They develop a lot of technologies, so there's a constant interplay between CERN and in particular medical imaging industry, both for imaging and for therapy.",
                    "label": 0
                },
                {
                    "sent": "There are two new light iron cancer therapy facilities coming onstream in Europe now, one in Austria and Italy, based on certain accelerator designs, for example, and for medical imaging, the first pet scanner that the University of Geneva Hospital had was built at CERN before you could buy them off the shelf, and we are constantly developing our techniques for image Ng photons.",
                    "label": 0
                },
                {
                    "sent": "That's what pet.",
                    "label": 0
                },
                {
                    "sent": "Does ultimately so there's a constant interplay there.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We play a very important role in training.",
                    "label": 0
                },
                {
                    "sent": "That's something that we take very seriously.",
                    "label": 0
                },
                {
                    "sent": "So we have educational programs at CERN that range from primary school up professional schools in computer science, physics, and accelerator science.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we bring people together through science.",
                    "label": 1
                },
                {
                    "sent": "This is actually written in black and white in the Sun Founding Convention.",
                    "label": 0
                },
                {
                    "sent": "It says that we will provide.",
                    "label": 0
                },
                {
                    "sent": "A center of Excellence for fundamental physics in Europe, but also a place where the countries of Europe can work peacefully together.",
                    "label": 0
                },
                {
                    "sent": "And that's something we've always taken very seriously.",
                    "label": 0
                },
                {
                    "sent": "We began with 12 Member States in 1954.",
                    "label": 0
                },
                {
                    "sent": "Today we have 21 Member States and if you.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's the origin.",
                    "label": 0
                },
                {
                    "sent": "It's quite hard to read this, but by nationality of all of our users.",
                    "label": 0
                },
                {
                    "sent": "So it is a user facility, so we provide the basic infrastructure for research, but the experiments are conducted by University groups.",
                    "label": 0
                },
                {
                    "sent": "We have people from.",
                    "label": 0
                },
                {
                    "sent": "I'm not quite sure how many countries this is, but it's over 100 all over the world and if you look there Slovenia, there are 26 people of Slovenian nationality registered to use certain facilities, for example.",
                    "label": 0
                },
                {
                    "sent": "This was correct on the 11th of January this year, it's constantly changing.",
                    "label": 0
                },
                {
                    "sent": "The color scheme shows our Member States in dark blue countries.",
                    "label": 0
                },
                {
                    "sent": "For observers they are typically countries who've made a significant contribution to a major project, so in this case the LHC in light blue associate members Turkey is recently becoming associate member.",
                    "label": 0
                },
                {
                    "sent": "Romania is a candidate for accession, will become a full member by the end of this year.",
                    "label": 0
                },
                {
                    "sent": "And yes, Serbia also candidate for accession.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's it, that's that's what CERN is, so I hope I've given you just a brief overview of what CERN is.",
                    "label": 0
                },
                {
                    "sent": "That's the that's the presentation.",
                    "label": 0
                },
                {
                    "sent": "The group of visiting journalists will get when they come to CERN before they go off and meet meet the scientists themselves.",
                    "label": 0
                },
                {
                    "sent": "So what do we do about communicating somewhat?",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The first thing I want to do is tell you what.",
                    "label": 0
                },
                {
                    "sent": "When I say the word communication, what I mean by the word communication 'cause I know that when I say the word communication to scientists and I can say this 'cause I am one myself.",
                    "label": 0
                },
                {
                    "sent": "But what I notice is they often hear is education and what communication is not education.",
                    "label": 0
                },
                {
                    "sent": "Education is part of it, maybe, but this comes out of the Oxford English Dictionary.",
                    "label": 0
                },
                {
                    "sent": "It gives various definitions of communication and the one I like the best is number 4, the science and practice of transmitting information, so that's pretty close to what we do.",
                    "label": 0
                },
                {
                    "sent": "But my definition is goes beyond that communication group.",
                    "label": 0
                },
                {
                    "sent": "In an organization like CERN has the job of managing the relationship of that organization with key stakeholder groups in order to allow the organization to carry out its mission unhindered so those stakeholder groups can be all kinds of people.",
                    "label": 1
                },
                {
                    "sent": "They can be the people who play the bills.",
                    "label": 0
                },
                {
                    "sent": "They can be the people who live next door.",
                    "label": 0
                },
                {
                    "sent": "They could be the people who think they're going to create black holes that are going to develop the universe.",
                    "label": 0
                },
                {
                    "sent": "Every one of those relationships has to be managed in such a way that those who can support you will and those who can be detrimental to you won't be so that's what we tried to do.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is our mission?",
                    "label": 1
                },
                {
                    "sent": "I've mentioned it before.",
                    "label": 0
                },
                {
                    "sent": "We have two main missions in our convention.",
                    "label": 0
                },
                {
                    "sent": "The first one is to pursue world class research in fundamental physics and the 2nd is to bring nations together through peaceful collaboration in science.",
                    "label": 1
                },
                {
                    "sent": "But more and more these days with Cern's profile being what it is today.",
                    "label": 0
                },
                {
                    "sent": "We also see that we have a responsibility to promote the cause of science more generally in society today and a lot of our communication is not about particle physics these days.",
                    "label": 0
                },
                {
                    "sent": "It's about science and science's role in society.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what's the challenge?",
                    "label": 0
                },
                {
                    "sent": "Well, this is something that I keep pinned up on my wall of my office every day.",
                    "label": 0
                },
                {
                    "sent": "The challenge of communicating physics.",
                    "label": 1
                },
                {
                    "sent": "This is a newspaper cutting from the Guardian from 2007 and it shows three women out Nightclubbing in London I don't know if you recognize who they are, but this is Sarah Ferguson and these are her two daughters, Princesses, Beatrix and Eugenie.",
                    "label": 0
                },
                {
                    "sent": "I don't know what in line to the throne of the United Kingdom they are and they were 1618 years old when this picture was taken out.",
                    "label": 0
                },
                {
                    "sent": "Nightclubbing with their mum in London and the article includes this wonderful line.",
                    "label": 0
                },
                {
                    "sent": "We all remember what it was like to be 18.",
                    "label": 1
                },
                {
                    "sent": "The idea of going to a party with one's mother was pretty much up there with joining the after school physics club in terms of social humiliation.",
                    "label": 1
                },
                {
                    "sent": "So I think this tells me that science has a bit of an image problem and it's something that we have to address.",
                    "label": 0
                },
                {
                    "sent": "I think actually things have changed since then.",
                    "label": 0
                },
                {
                    "sent": "I think that it is now actually.",
                    "label": 0
                },
                {
                    "sent": "Quite cool among young people to identify with science in a way that it certainly wasn't when I was at University.",
                    "label": 0
                },
                {
                    "sent": "It was a bit like that so, but still, you know you gotta, you gotta bear these things in mind.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So where do we start?",
                    "label": 0
                },
                {
                    "sent": "Well, I I was made head of communication that served in 2003.",
                    "label": 0
                },
                {
                    "sent": "It was clear that we had a great story to tell that we could do a lot with it.",
                    "label": 0
                },
                {
                    "sent": "Where did we start?",
                    "label": 0
                },
                {
                    "sent": "Well, we started by going out and doing some market research to figure out what people thought about particle physics and what we do.",
                    "label": 0
                },
                {
                    "sent": "And I went into this market research thinking we're going to have a really hard sell.",
                    "label": 0
                },
                {
                    "sent": "Convincing people that it's worth spending money on curiosity research that doesn't have any practical benefit for them tomorrow.",
                    "label": 0
                },
                {
                    "sent": "What we found out is it's not actually if you ask, people should.",
                    "label": 0
                },
                {
                    "sent": "Humanity go out and explore the universe and try and understand what atoms are made of.",
                    "label": 0
                },
                {
                    "sent": "They say yes of course.",
                    "label": 0
                },
                {
                    "sent": "And then you ask them any knowledge that they have the results of our research.",
                    "label": 0
                },
                {
                    "sent": "Non any interest in that they claim that they are interested in it, but they believe it's worth doing so they don't understand what we do.",
                    "label": 1
                },
                {
                    "sent": "These are real quotes that we got from from market research.",
                    "label": 0
                },
                {
                    "sent": "Science is just there.",
                    "label": 0
                },
                {
                    "sent": "I don't care with some person.",
                    "label": 0
                },
                {
                    "sent": "I haven't got a clue what CERN is it a stone circle?",
                    "label": 0
                },
                {
                    "sent": "Somebody said we need to know what's going what's inside an Atom.",
                    "label": 1
                },
                {
                    "sent": "And then you tell me more about the survey.",
                    "label": 1
                },
                {
                    "sent": "That's a lot of money.",
                    "label": 1
                },
                {
                    "sent": "And then they say, will it have a practical benefit for me?",
                    "label": 0
                },
                {
                    "sent": "So this obviously simplifying the market research we did there, but this sort of shaped what we did.",
                    "label": 0
                },
                {
                    "sent": "We realized.",
                    "label": 0
                },
                {
                    "sent": "Well, actually we don't have to sell the notion of doing basic science, but we do have to justify the value for money.",
                    "label": 0
                },
                {
                    "sent": "And we do have to show them that there is there is benefit from it.",
                    "label": 0
                },
                {
                    "sent": "Practical benefit from it.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that's where we started.",
                    "label": 0
                },
                {
                    "sent": "We also have a problem of perception.",
                    "label": 0
                },
                {
                    "sent": "I've mentioned that before that we have to deal with, so the perception of CERN is our title.",
                    "label": 0
                },
                {
                    "sent": "We are title.",
                    "label": 0
                },
                {
                    "sent": "Actually certain means nothing.",
                    "label": 0
                },
                {
                    "sent": "These days, certain was the European Council for Nuclear Research which existed between 1952 and 1954 to create.",
                    "label": 0
                },
                {
                    "sent": "The laboratory, whose official title is the European Organization for Nuclear Research, which would give you a different acronym.",
                    "label": 1
                },
                {
                    "sent": "But we don't really do much nuclear research anymore.",
                    "label": 0
                },
                {
                    "sent": "We do a bit, but mostly what we do is particle physics these days so.",
                    "label": 0
                },
                {
                    "sent": "We can't change our name because apart from anything my pension depends on all the contracts that have been signed, signed between various organizations and the European Organization for Nuclear Research.",
                    "label": 0
                },
                {
                    "sent": "So we can't change the name.",
                    "label": 0
                },
                {
                    "sent": "Every contracts ever signed.",
                    "label": 0
                },
                {
                    "sent": "It's been there and certainly is now known, but we tend to refer to ourselves as far as possible.",
                    "label": 0
                },
                {
                    "sent": "Is the European version of particle physics, which reflects better what we actually do, so we're not really a nuclear lab.",
                    "label": 0
                },
                {
                    "sent": "People think we do military research whenever there are questions about Iran's nuclear program or press office gets calls from journalists who want to comment from the world's leading nuclear authority on.",
                    "label": 0
                },
                {
                    "sent": "The Iranian nuclear program we have to explain some.",
                    "label": 0
                },
                {
                    "sent": "No, we don't do that.",
                    "label": 0
                },
                {
                    "sent": "We are actually forbidden explicitly from doing nuclear research in our convention.",
                    "label": 0
                },
                {
                    "sent": "With secret, if we publish openly pushing Open Access publishing were open to the public, we now have about 100,000 members of the public who come through our doors every year.",
                    "label": 0
                },
                {
                    "sent": "Lots of our interest is iaccessible if you want to know what's happening with the LHC, you can go and read the log book and we encourage and enable our scientists to communicate so we can your scientists.",
                    "label": 0
                },
                {
                    "sent": "We can't control scientists.",
                    "label": 0
                },
                {
                    "sent": "They're not going to listen to a communications person, but what we do is we offer training.",
                    "label": 0
                },
                {
                    "sent": "We offer encouragement and we introduce them to journalists and so on so.",
                    "label": 0
                },
                {
                    "sent": "We are extremely open.",
                    "label": 0
                },
                {
                    "sent": "The protein, I think that serves us in good stead.",
                    "label": 0
                },
                {
                    "sent": "So transparent.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is one of the key planks of our communication.",
                    "label": 0
                },
                {
                    "sent": "Again, a couple of things that inspired us in developing that approach with these pictures here.",
                    "label": 0
                },
                {
                    "sent": "This is a picture.",
                    "label": 0
                },
                {
                    "sent": "This organization is also based in Geneva, so I talked to the people who do communications for them quite often and they were quite disturbed that whenever you went to Google and typed World Economic Forum, you got pictures of Davos barricaded or riots in Seattle.",
                    "label": 0
                },
                {
                    "sent": "So they decided what can we do 'cause we're not really like that and they decided that they were just going to become open and they were going to flood the infinite.",
                    "label": 0
                },
                {
                    "sent": "the Internet with information they were going to engage with people.",
                    "label": 0
                },
                {
                    "sent": "So this guy here for example you see him on stage with world leaders and so on and their image has changed.",
                    "label": 0
                },
                {
                    "sent": "You'll still find Seattle, but you find a more balanced debate about the World Economic Forum now than you did.",
                    "label": 0
                },
                {
                    "sent": "Back in the early in the first decade of this century and this guy, this is a very very UK based story we were talking about it earlier.",
                    "label": 0
                },
                {
                    "sent": "This is a person called Colin Pillinger who crashed this thing and he didn't actually.",
                    "label": 0
                },
                {
                    "sent": "He landed it on Mars, but he lost it and he lost it over Christmas and it was really built up in the UK news.",
                    "label": 0
                },
                {
                    "sent": "It was called Beagle two.",
                    "label": 0
                },
                {
                    "sent": "It was a mission that went to Mars and he was on television every day and he was bearing his soul to the world and they lost it.",
                    "label": 0
                },
                {
                    "sent": "They've got lost complete contact with this thing and.",
                    "label": 0
                },
                {
                    "sent": "Support for space science in the UK went through the roof, even though scientifically this mission was a complete and utter failure becausw.",
                    "label": 0
                },
                {
                    "sent": "There was a human story behind it.",
                    "label": 0
                },
                {
                    "sent": "People knew what they were trying to do.",
                    "label": 0
                },
                {
                    "sent": "They saw the value of it and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "And recently it was in the news again because they found it and it actually did land.",
                    "label": 0
                },
                {
                    "sent": "I mean, the thing appears to have landed, but it didn't deploy properly.",
                    "label": 0
                },
                {
                    "sent": "One of these little leaves didn't unfold, so it didn't have any source of power, so it came very very close to succeeding.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So these guys were both transparent and honest and open, and I thought we thought at certain that this is where we should.",
                    "label": 0
                },
                {
                    "sent": "We should be.",
                    "label": 0
                },
                {
                    "sent": "There's a perception out there that's very different from the reality and the way to address that is to be honest about who we are.",
                    "label": 0
                },
                {
                    "sent": "You gain trust in the social media.",
                    "label": 0
                },
                {
                    "sent": "Age you have no choice.",
                    "label": 1
                },
                {
                    "sent": "People are talking about you out there anyway, and if you're not part of that conversation, you're leaving the conversation open to people who might want to say things about that you don't like so much.",
                    "label": 0
                },
                {
                    "sent": "And the reason I have this picture here is just a little anecdote that I'd like to tell.",
                    "label": 0
                },
                {
                    "sent": "'cause I was talking to a bunch of people who do communications for the civil engineering industry, including a company that's built an amazing thing right here.",
                    "label": 0
                },
                {
                    "sent": "Underneath the River, underneath the Houses of Parliament that I knew nothing about until I got the chance to visit it much later and it's amazing.",
                    "label": 0
                },
                {
                    "sent": "And they kept it very quiet.",
                    "label": 0
                },
                {
                    "sent": "They didn't communicate about it at all.",
                    "label": 0
                },
                {
                    "sent": "It was quite challenging from a civil engineering perspective underneath this iconic ancient building underneath the River and whatever else, and they called it off and nobody knows.",
                    "label": 0
                },
                {
                    "sent": "And the reason they didn't communicate about it is they thought, well there was a risk they might damage this building.",
                    "label": 0
                },
                {
                    "sent": "So my point here was that if that building falls down, people are going to notice whether you tell them before or not, and the fact is it didn't fall down.",
                    "label": 0
                },
                {
                    "sent": "And you missed an opportunity to tell the story there that I think could have helped you.",
                    "label": 0
                },
                {
                    "sent": "So we are basic approaches.",
                    "label": 1
                },
                {
                    "sent": "To be honest, open timely and that makes authorities without us.",
                    "label": 0
                },
                {
                    "sent": "That doesn't mean that the Communication Department of certain will just go and tell every journalist everything that comes our way.",
                    "label": 0
                },
                {
                    "sent": "A lot of the business of communication is knowing when not to talk and when not to talk about something.",
                    "label": 0
                },
                {
                    "sent": "So we spend a lot of time not talking a case in point is last weekend where a lot of our physics community science community was saying let's invite all the world's pressing again for the first time around the LHC.",
                    "label": 0
                },
                {
                    "sent": "It's like Rosetta.",
                    "label": 0
                },
                {
                    "sent": "It's not like Rosetta.",
                    "label": 0
                },
                {
                    "sent": "When we put the first beam around the LLC in 2008, it was a big step forward.",
                    "label": 0
                },
                {
                    "sent": "This time it's not.",
                    "label": 0
                },
                {
                    "sent": "The story is different, so we were actually trying to fight off the pressure to invite the press in like we do.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Before.",
                    "label": 0
                },
                {
                    "sent": "You have to realize that there are many, many audiences out there.",
                    "label": 0
                },
                {
                    "sent": "They're not all the same.",
                    "label": 0
                },
                {
                    "sent": "You engage with them in different ways.",
                    "label": 0
                },
                {
                    "sent": "You want to have a different impact on each of them, their alumni.",
                    "label": 0
                },
                {
                    "sent": "There are job seekers, there's industry.",
                    "label": 0
                },
                {
                    "sent": "There's the local community.",
                    "label": 0
                },
                {
                    "sent": "Very, very important for a big lab like CERN.",
                    "label": 0
                },
                {
                    "sent": "There are people at CERN that's a very complex one because there are people who are certain staff.",
                    "label": 0
                },
                {
                    "sent": "There are people who are certain users.",
                    "label": 0
                },
                {
                    "sent": "There are physicists or engineers.",
                    "label": 0
                },
                {
                    "sent": "There's all kinds of people in there, VIPs there are.",
                    "label": 0
                },
                {
                    "sent": "Where are they?",
                    "label": 0
                },
                {
                    "sent": "There should be the people who pay for certain somewhere.",
                    "label": 0
                },
                {
                    "sent": "Member States their educational systems.",
                    "label": 1
                },
                {
                    "sent": "The media is an important channel.",
                    "label": 0
                },
                {
                    "sent": "General publics I've put Publix there because there is no such thing as the general public.",
                    "label": 0
                },
                {
                    "sent": "I was talking to somebody who is the head of the Communication Office of the US Department of Energy, Office of Science, and he said that he has a swear jar on his desk where by anybody who says the word general public has to put a dollar in it and it's always full.",
                    "label": 0
                },
                {
                    "sent": "There is no such thing as the general public.",
                    "label": 0
                },
                {
                    "sent": "There are all kinds of different Publix out there, and at some point if you're going to communicate, you have or engage with them, you have to decide which ones you want to engage with, which ones are going to be influential, influential on your ability to function.",
                    "label": 0
                },
                {
                    "sent": "And which ones you might just want to engage with because you're altruistic, but if you're doing that, at least you need to know why you're doing it.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We are.",
                    "label": 0
                },
                {
                    "sent": "This is actually if you ask me, one reason why certain successfully sends communication is successful.",
                    "label": 0
                },
                {
                    "sent": "It's here we are very well networked.",
                    "label": 0
                },
                {
                    "sent": "Communication Group does not operate in a vacuum.",
                    "label": 0
                },
                {
                    "sent": "If I'm missing it this week 'cause it's about now, but I have a weekly phone call with my counterpart at Fermi Lab in the United States where we talk about what we're doing and what stories are coming up and where we can collaborate.",
                    "label": 0
                },
                {
                    "sent": "I regularly meet with the communication officers from all the world's big particle physics laboratories and funding agencies and within our Member States, I have a communication context that I know personally in every single country.",
                    "label": 1
                },
                {
                    "sent": "So we do a lot of things with them.",
                    "label": 0
                },
                {
                    "sent": "Whenever someone is going to communicate something they know before they very often translate into their own languages.",
                    "label": 0
                },
                {
                    "sent": "They will take out quotes from CERN scientists.",
                    "label": 0
                },
                {
                    "sent": "They'll put in quotes from scientists who come from their country for a laboratory like so, and it's extremely important that we are relevant not just in Geneva.",
                    "label": 0
                },
                {
                    "sent": "We relevant wherever our scientists come from, so this network is incredibly valuable to us.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have great stories to tell.",
                    "label": 0
                },
                {
                    "sent": "I think I went through them earlier, so we have.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Stories about science and this is this is a great human story about science.",
                    "label": 0
                },
                {
                    "sent": "This is Francois on glare and Peter Higgs meeting each other.",
                    "label": 0
                },
                {
                    "sent": "For the first time at CERN in 2012 when we announced the discovery of the particle they predicted in 1964.",
                    "label": 0
                },
                {
                    "sent": "They've never met each other before this, so not not just a great scientific story, but a great human story to tell.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As well about innovation, that's Tim Berners Lee.",
                    "label": 0
                },
                {
                    "sent": "This is something that I hope you're not too distant future.",
                    "label": 0
                },
                {
                    "sent": "You will be able to experience.",
                    "label": 0
                },
                {
                    "sent": "This is the first ever web browser that Tim wrote for a computer system called Next Step in the 1990s.",
                    "label": 0
                },
                {
                    "sent": "But the problem with it was and remains that it only worked on this particular computer, and it was incredibly sophisticated, sophisticated thing.",
                    "label": 0
                },
                {
                    "sent": "It had full windowing capabilities and graphics, and you could edit straight into it.",
                    "label": 0
                },
                {
                    "sent": "It was quite a quite impressive thing, and we're trying to build an emulator for it now.",
                    "label": 0
                },
                {
                    "sent": "So we have great stories about innovation.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have great stories about peace.",
                    "label": 0
                },
                {
                    "sent": "This is actually the 1st.",
                    "label": 0
                },
                {
                    "sent": "Not even officially, but the first sanction meeting between Representatives East and West Germany, which took place that served in the 1960s, because the governments turned a blind eye to their scientists working together at.",
                    "label": 0
                },
                {
                    "sent": "And there are many, many, many more stories of that nature, so we have fantastic stories to tell, and it's communication is all about storytelling.",
                    "label": 0
                },
                {
                    "sent": "It's all about identifying stories and telling them.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To people and we have stories about education.",
                    "label": 0
                },
                {
                    "sent": "So this is 1 visiting group of people.",
                    "label": 0
                },
                {
                    "sent": "Something that is very striking.",
                    "label": 0
                },
                {
                    "sent": "Again, it goes back to something we were talking about earlier on.",
                    "label": 0
                },
                {
                    "sent": "Is that young people are all scientists.",
                    "label": 0
                },
                {
                    "sent": "I mean, look at all those hands up in the air there and now.",
                    "label": 0
                },
                {
                    "sent": "Try and imagine putting a group of adults in there.",
                    "label": 0
                },
                {
                    "sent": "You're not going to get the same.",
                    "label": 0
                },
                {
                    "sent": "Are you something happens along the way?",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But children, all scientists, other people, have stories that they want to tell us about us as well, and whether you like it or not, we've, I believe you have to engage with those and we have.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "First one.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Not to mention is this.",
                    "label": 0
                },
                {
                    "sent": "This is a book that arrived on my desk in 2000.",
                    "label": 1
                },
                {
                    "sent": "It was written.",
                    "label": 0
                },
                {
                    "sent": "We never met this guy.",
                    "label": 0
                },
                {
                    "sent": "Dan Brown.",
                    "label": 0
                },
                {
                    "sent": "As far as I know, he never came to Sir.",
                    "label": 0
                },
                {
                    "sent": "We've got no record of ever being there.",
                    "label": 0
                },
                {
                    "sent": "We wouldn't necessarily have known because he was a complete unknown author until 2005, but he sent this to my boss, whose name was Neil colder.",
                    "label": 0
                },
                {
                    "sent": "Neil.",
                    "label": 0
                },
                {
                    "sent": "Hope you enjoy the novel.",
                    "label": 0
                },
                {
                    "sent": "Remember it's fiction.",
                    "label": 0
                },
                {
                    "sent": ":) best wishes.",
                    "label": 0
                },
                {
                    "sent": "Dan Brown.",
                    "label": 0
                },
                {
                    "sent": "And I got to read it and it was painful.",
                    "label": 0
                },
                {
                    "sent": "I have to say, at least until I got halfway through the book 'cause all the first part was about certain.",
                    "label": 0
                },
                {
                    "sent": "It was.",
                    "label": 0
                },
                {
                    "sent": "I just kept saying that this is wrong.",
                    "label": 0
                },
                {
                    "sent": "This is wrong.",
                    "label": 0
                },
                {
                    "sent": "This is wrong.",
                    "label": 0
                },
                {
                    "sent": "And then it went to Rome and I'm sure it's equally wrong in Rome.",
                    "label": 0
                },
                {
                    "sent": "But it was a really good story.",
                    "label": 0
                },
                {
                    "sent": "Tracking down this ticking bomb in Rome was a really good story.",
                    "label": 0
                },
                {
                    "sent": "It's quite quite an engaging story, but we read it in 2000.",
                    "label": 0
                },
                {
                    "sent": "Nobody else.",
                    "label": 0
                },
                {
                    "sent": "Nobody bought the book then, but we were aware that it was out there and that this kind of thing might be something had to deal with, so we had a lot of time to think about it.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then the BBC did this and this was broadcast a few times on BBC Three, which is the BBC's Youth Channel.",
                    "label": 0
                },
                {
                    "sent": "It went out on National Geographic.",
                    "label": 0
                },
                {
                    "sent": "It went out on Lt I think, and it's what they call a drama documentary and it was triggered by a slightly credible scientist by the name of Martin Rees, who wrote a book called our Final Century.",
                    "label": 0
                },
                {
                    "sent": "Martin Reese was the president of the Royal Society at the time and you know our final century.",
                    "label": 0
                },
                {
                    "sent": "He just develops the various ways that the human race might cease to exist before the end of this century, and one of them.",
                    "label": 0
                },
                {
                    "sent": "Is dealing with how you manage incredibly small risk and he mentioned particle accelerator's in there, and the chapter of the book says well, party works aren't going to destroy the world.",
                    "label": 0
                },
                {
                    "sent": "But because he said it, some people.",
                    "label": 0
                },
                {
                    "sent": "But if they do.",
                    "label": 0
                },
                {
                    "sent": "So this drama documentary plays out a day in the life of an American scientist waking up in London trying to get to New York to switch on a particle accelerator, and he's stopped by.",
                    "label": 0
                },
                {
                    "sent": "Super volcanoes and biological one.",
                    "label": 0
                },
                {
                    "sent": "There's an asteroid impact.",
                    "label": 0
                },
                {
                    "sent": "There's all kinds of things, and the last time he gets there switches on the machine and you can see what's happening there.",
                    "label": 0
                },
                {
                    "sent": "Whoops.",
                    "label": 0
                },
                {
                    "sent": "You can see what's happening there.",
                    "label": 0
                },
                {
                    "sent": "There's a little swirl.",
                    "label": 0
                },
                {
                    "sent": "Is the black hole starts to suck the earth?",
                    "label": 0
                },
                {
                    "sent": "In so this went out the universe as we know it.",
                    "label": 0
                },
                {
                    "sent": "It says here ceases to exist, so this was actually on television and this was 2003 I think.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So there we are.",
                    "label": 0
                },
                {
                    "sent": "So we thought it's time for us to time for us to act so 2005.",
                    "label": 1
                },
                {
                    "sent": "Dan Brown tried again and he wrote a book called the Davinci Code and People bought that and when they bought that we thought, well, they're going to start looking for other Dan Brown's Angels and demons.",
                    "label": 0
                },
                {
                    "sent": "So what are we going to do?",
                    "label": 0
                },
                {
                    "sent": "Are we going to pretend it doesn't exist?",
                    "label": 0
                },
                {
                    "sent": "Are we going to say Dan Brown is a charlatan and should be no burn in hell or whatever?",
                    "label": 1
                },
                {
                    "sent": "Are we going to take as an opportunity?",
                    "label": 0
                },
                {
                    "sent": "And we decided that we would take this as an opportunity so?",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you went to the CERN website in 2005, this is what you saw.",
                    "label": 0
                },
                {
                    "sent": "This is a Lockheed X 33 spaceplane and according to Dan Brown's novel, we have one that we keep top Secret and our Director general use it to hop across the Atlantic in half an hour or something like that.",
                    "label": 0
                },
                {
                    "sent": "So so we had this picture there with the question does CERN have one of these?",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And what do you think?",
                    "label": 0
                },
                {
                    "sent": "We don't.",
                    "label": 0
                },
                {
                    "sent": "Does CERN make antimatter?",
                    "label": 0
                },
                {
                    "sent": "Yes, we do.",
                    "label": 0
                },
                {
                    "sent": "There's a scene in the book where your Charpak Nobel Prize winning physicist was playing Frisbee, so we went on our shores.",
                    "label": 0
                },
                {
                    "sent": "Do you play Frisbee and he said no.",
                    "label": 0
                },
                {
                    "sent": "So we went and asked other Nobel Prize winning scientists.",
                    "label": 0
                },
                {
                    "sent": "Do you play Frisbee and we found one Jack Steinberger, who said I used to when I was younger, so we said.",
                    "label": 0
                },
                {
                    "sent": "You can't play Frisbee with George Sharp at, but you could play Frisbee with Jack Steinberger.",
                    "label": 0
                },
                {
                    "sent": "If you came to some.",
                    "label": 0
                },
                {
                    "sent": "Can antimatter solve the energy crisis is down.",
                    "label": 1
                },
                {
                    "sent": "Round says absolutely not.",
                    "label": 0
                },
                {
                    "sent": "Does it have anything useful in SoC?",
                    "label": 0
                },
                {
                    "sent": "Yes, and discern payroll in doing that.",
                    "label": 0
                },
                {
                    "sent": "We also went on to ask more questions, you know just to make antimatter, yes.",
                    "label": 0
                },
                {
                    "sent": "How much do we make a year one nanogram?",
                    "label": 0
                },
                {
                    "sent": "How much would you require to blow up the Vatican 1/4 of a gram?",
                    "label": 0
                },
                {
                    "sent": "How long would it take so long to make that flat out?",
                    "label": 0
                },
                {
                    "sent": "250 million years?",
                    "label": 0
                },
                {
                    "sent": "So if you want to look for that, you can think of another way to do it.",
                    "label": 0
                },
                {
                    "sent": "So we had we had fun with it really, but we also told some serious science stories and.",
                    "label": 0
                },
                {
                    "sent": "Traffic to our website jumped by an order of magnitude overnight, and it's never looked back from there, so we felt that it was definitely the best way to go.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To engage with it.",
                    "label": 0
                },
                {
                    "sent": "When they made a film of it.",
                    "label": 0
                },
                {
                    "sent": "I was so there was surreal moments where we were getting phone calls from Ron Howard, the director of the film.",
                    "label": 0
                },
                {
                    "sent": "There he is.",
                    "label": 0
                },
                {
                    "sent": "Who wanted to tell the second part of that book?",
                    "label": 0
                },
                {
                    "sent": "He wanted to tell the ticking bomb story and just squash all the bad science away where nobody could see it, and he, I think, accepted that the science was nonsense and I think he did actually quite a good job of telling the story and they launched it in a very cold February.",
                    "label": 0
                },
                {
                    "sent": "They launched this film to the world's entertainment press at CERN.",
                    "label": 1
                },
                {
                    "sent": "So there you have, it's hard to see that you have Ron Howard.",
                    "label": 0
                },
                {
                    "sent": "This is an anti matter physicist called Rolf Landua and if you read the book he would be the one who would have been murdered in the opening scene so they can get his eye to go into the LHC.",
                    "label": 0
                },
                {
                    "sent": "Which wouldn't work.",
                    "label": 0
                },
                {
                    "sent": "Actually, our biometric access systems do test that your eye is actually living.",
                    "label": 0
                },
                {
                    "sent": "This is the.",
                    "label": 0
                },
                {
                    "sent": "This is the heroine of the movie.",
                    "label": 0
                },
                {
                    "sent": "She's an actress called Violet Zora and she is a brilliant, beautiful woman physicist.",
                    "label": 0
                },
                {
                    "sent": "Right say that again, this is the heroine at the Hollywood movie who was a brilliant, beautiful particle physicist.",
                    "label": 0
                },
                {
                    "sent": "Now that's not a bad role model, we thought.",
                    "label": 0
                },
                {
                    "sent": "This is Tom Hanks.",
                    "label": 0
                },
                {
                    "sent": "This is actually a brilliant, beautiful particle physicist.",
                    "label": 0
                },
                {
                    "sent": "A real one actually.",
                    "label": 0
                },
                {
                    "sent": "So we were able to show that the real ones existed too.",
                    "label": 0
                },
                {
                    "sent": "And this is our research director Sergio, both of which.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We did times with the launch that they were in many of the cinemas where this came out.",
                    "label": 1
                },
                {
                    "sent": "We had physicists giving talks or doing Cafe Scientifique afterwards and if you buy the DVD version of the film there's a 15 minute documentary about CERN on there with Ron Howard and Tom Hanks saying isn't particle physics wonderful?",
                    "label": 0
                },
                {
                    "sent": "Which has value for us so.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We thought that was a good thing to do.",
                    "label": 0
                },
                {
                    "sent": "That was easy though.",
                    "label": 0
                },
                {
                    "sent": "'cause that says fiction on the cover, you know, remember that thing that Dan Brown Sanchez remember it's only fiction.",
                    "label": 0
                },
                {
                    "sent": "This did not say fiction on the cover.",
                    "label": 0
                },
                {
                    "sent": "These are people who really believe that we're going to destroy the world.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the bit of science behind it.",
                    "label": 0
                },
                {
                    "sent": "If you ask yourself the question when you're colliding particles at high energy, are you doing something that isn't happening in nature already?",
                    "label": 0
                },
                {
                    "sent": "This shows the spectrum of high energy protons coming from space colliding with protons in the atmosphere, and it goes way, way out.",
                    "label": 0
                },
                {
                    "sent": "It's much much higher than the LHC can do, so the answer is no, we're not doing things that aren't happening in nature.",
                    "label": 0
                },
                {
                    "sent": "We just bring them into Liberty where we can study them.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this really, I suppose, pushed our approach of open this really to the limit because somebody posted this on a blog site.",
                    "label": 0
                },
                {
                    "sent": "In March 2008, so this before we switched on the machine for the first time.",
                    "label": 0
                },
                {
                    "sent": "This was somebody.",
                    "label": 0
                },
                {
                    "sent": "This is very Pro science blog.",
                    "label": 0
                },
                {
                    "sent": "Once we stop these guys at CERN then we have to ban wardrobes we shouldn't be taking the chance of people ending up in Narnia.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We looked at that and what we did, we started going out and talking to audiences about that.",
                    "label": 0
                },
                {
                    "sent": "If you analyze that question scientifically.",
                    "label": 0
                },
                {
                    "sent": "What is the chance that when you open your wardrobe you end up in Narnia?",
                    "label": 0
                },
                {
                    "sent": "And you can think about this scientifically and you can figure out when did human beings invent wardrobes.",
                    "label": 0
                },
                {
                    "sent": "And you figure out when that was and how many wardrobes have existed.",
                    "label": 0
                },
                {
                    "sent": "And just multiply this by a factor of a billion or two billion each time, just to make sure that you're being giving a very conservative estimate.",
                    "label": 0
                },
                {
                    "sent": "How many times you open the door of a wardrobe before they would always fall off and you have to buy a new one so you can figure out roughly.",
                    "label": 0
                },
                {
                    "sent": "Keep multiplying by the odd billion.",
                    "label": 0
                },
                {
                    "sent": "How many times wardrobe doors have been opened and closed in the history of wardrobes?",
                    "label": 0
                },
                {
                    "sent": "And to the best of our knowledge, nobody's ever going to Narnia, but there may be people have gotten not told us, but I suspect that nobody's going to know every time you open wardrobe, find your clothes.",
                    "label": 0
                },
                {
                    "sent": "I mean, that's what's always happened, so all you can, you can't say that the next time you open your wardrobe door thinking scientifically, you won't go to Narnia.",
                    "label": 0
                },
                {
                    "sent": "You can just say that it's incredibly unlikely, because on the basis of all these experiments that you've done.",
                    "label": 0
                },
                {
                    "sent": "So we actually sat down.",
                    "label": 0
                },
                {
                    "sent": "We worked that out and we worked out on the basis of cosmic Ray, part of protons hitting the atmosphere that we've measured.",
                    "label": 0
                },
                {
                    "sent": "Overtime.",
                    "label": 0
                },
                {
                    "sent": "How dangerous it is to run the LX for 20 years compared to opening your door once and we worked out that opening your door once is actually 10,000 times more dangerous than running the LX for 20 years.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we started publishing stories about this and we found that people got it actually.",
                    "label": 0
                },
                {
                    "sent": "So we found that this is one that I wrote for Physics world actually and.",
                    "label": 0
                },
                {
                    "sent": "This was after the main proponent of the main proponent of that whole story was asked on The Daily Show.",
                    "label": 0
                },
                {
                    "sent": "the American satirical news program what's the probability that she destroying the universe and he said one in two, and they said why?",
                    "label": 0
                },
                {
                    "sent": "And he said, well, either it does, or it doesn't.",
                    "label": 0
                },
                {
                    "sent": "Therefore, it's pointing to, so he destroyed his own argument there.",
                    "label": 0
                },
                {
                    "sent": "But the point I want to make here is that one of the things that I think we've learned over years at CERN is that the more you treat audiences as intelligent people who just don't share the same knowledge bases you, the more they behave like intelligent people as well.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We've done that, so what's the result of all this communication that we've been doing well?",
                    "label": 0
                },
                {
                    "sent": "Media visits one of the metrics that we wanted to measure was media visits on the.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Like this is actually number of people, the number of media all through the 90s was 200 media outlets a year.",
                    "label": 0
                },
                {
                    "sent": "We peaked in 2008.",
                    "label": 0
                },
                {
                    "sent": "That was 1600 people.",
                    "label": 0
                },
                {
                    "sent": "I think it was something like 800 media outlets visits visited CERN in 2008 and we've been pretty high ever since 2014.",
                    "label": 0
                },
                {
                    "sent": "It's 1200 people in about 500 media outlets, so that was that was the start of the LHC.",
                    "label": 0
                },
                {
                    "sent": "In this year it was 340 media outlets on one day.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Come back to that.",
                    "label": 0
                },
                {
                    "sent": "When we put a beam around the machine for the first time, Google did that, which was pretty cool for us at the time we had 340 media outlets on site.",
                    "label": 0
                },
                {
                    "sent": "450 broadcasters picked up the signal from video news wires and so on, making two and a half thousand transitions, and there were 91 live.",
                    "label": 0
                },
                {
                    "sent": "What they call stand up.",
                    "label": 0
                },
                {
                    "sent": "So that's when you see a person on the news talking live to a camera from CERN.",
                    "label": 0
                },
                {
                    "sent": "Eurovision, who put the signal up on a satellite for us, said that our audience was over a billion, which would make it a huge, huge scientific event.",
                    "label": 0
                },
                {
                    "sent": "My favorite headline of the day was from the site which said CERN is the new NASA.",
                    "label": 1
                },
                {
                    "sent": "I didn't believe it and I still don't believe it, but it was still nice to read and in our press, cuttings were from really all over the world.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "Global traffic trend on the web?",
                    "label": 0
                },
                {
                    "sent": "That's NASA that was NASA over the time period that soon.",
                    "label": 0
                },
                {
                    "sent": "And then we dropped back down again to that were a bit higher up now, but NASA still way up there.",
                    "label": 0
                },
                {
                    "sent": "And this is Fermi lab that we put on just to see this little blip.",
                    "label": 0
                },
                {
                    "sent": "That Fermi lab is getting getting traction from us too.",
                    "label": 0
                },
                {
                    "sent": "So we not NASA.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But it was a big day for deal for us.",
                    "label": 0
                },
                {
                    "sent": "And then we broke the machine.",
                    "label": 0
                },
                {
                    "sent": "And that got a lot of coverage to.",
                    "label": 0
                },
                {
                    "sent": "It was always going to get a lot of coverage and you know, of course I will be defensive about this, but I think that we got such we built up such a good relationship with the media who appreciated being invited in.",
                    "label": 0
                },
                {
                    "sent": "They appreciated the challenge that we have.",
                    "label": 0
                },
                {
                    "sent": "We were very careful to say that the reason that you guys don't normally get invited to the switch on of these big machines is because they never work first time ever and it will probably be the case this time.",
                    "label": 0
                },
                {
                    "sent": "They were very sympathetic to us.",
                    "label": 0
                },
                {
                    "sent": "They did documentaries called World's Greatest Fixes and things like that.",
                    "label": 0
                },
                {
                    "sent": "And we're very supportive as we started up again.",
                    "label": 0
                },
                {
                    "sent": "It was very interesting they would have changed between 2018 two 1010 when we did our first first physics runs.",
                    "label": 0
                },
                {
                    "sent": "Was the we had few immediate certain we had huge coverage, but the importance of social media had grown vastly soon.",
                    "label": 0
                },
                {
                    "sent": "Put out its first tweet on the 19th of September 2008.",
                    "label": 0
                },
                {
                    "sent": "By the time we got to 2010 we went up from 90 thousand 220,000 followers on the day and.",
                    "label": 0
                },
                {
                    "sent": "This was what was trending on Twitter on the day that says CERN.",
                    "label": 0
                },
                {
                    "sent": "That says Ricky Martin.",
                    "label": 0
                },
                {
                    "sent": "That says Justin Bieber and we that says LHC LHC didn't quite beat Justin Bieber.",
                    "label": 0
                },
                {
                    "sent": "But you know we were way up there on that day and social media now is huge.",
                    "label": 0
                },
                {
                    "sent": "We now we now have.",
                    "label": 0
                },
                {
                    "sent": "1/4 million people following CERN on Twitter.",
                    "label": 0
                },
                {
                    "sent": "And that's that's not just the raw numbers that count, is how engaged that audiences in.",
                    "label": 0
                },
                {
                    "sent": "Two years ago, Burson Marsteller, which is a very big communications agency, said Sir was the most influential international organization on Twitter because of the engagement that follows our what we put out there.",
                    "label": 0
                },
                {
                    "sent": "We have an average of 130 retweets per per tweet which we smashed recently and I'll come back to that just a few days ago.",
                    "label": 0
                },
                {
                    "sent": "Actually with one tweet that got I think 15,000 retweets.",
                    "label": 0
                },
                {
                    "sent": "I'll show you that in a minute.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We also notice that people following on Twitter included guys like this.",
                    "label": 0
                },
                {
                    "sent": "I don't know if you know who he is, but this is a guy called will I am who was a founding member of the Black Eyed Peas and is a great philanthropist.",
                    "label": 0
                },
                {
                    "sent": "He is actually currently studying for a degree in computer science and he gives lost sums of money for inner city STEM education, product projects in Los Angeles.",
                    "label": 0
                },
                {
                    "sent": "And in the UK, because he's a judge on The Voice UK, all of his feet from The Voice UK goes to that.",
                    "label": 0
                },
                {
                    "sent": "He's a real fan.",
                    "label": 0
                },
                {
                    "sent": "So we've had him at CERN on a couple occasions actually, and he's done shout out videos for us and things like this so it is quite important to have people like this who have a good fan base saying they think you're cool.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Higgs update seminar that this was real sign of how the culture had changed, so it wasn't the communication people going to the physicist saying let's make a story out of this.",
                    "label": 0
                },
                {
                    "sent": "It was the physicist coming and saying we've got a story.",
                    "label": 0
                },
                {
                    "sent": "How are we going to make it fly?",
                    "label": 0
                },
                {
                    "sent": "So we made this a very we made this immediate rhythm.",
                    "label": 0
                },
                {
                    "sent": "Close to half a million people watched the webcast.",
                    "label": 1
                },
                {
                    "sent": "That was a scientific seminar.",
                    "label": 0
                },
                {
                    "sent": "We know Tist before this that people way more than people than their product is in there watching some of our scientific seminars so we put in place a live blog in parallel with the webcast to interpret what was being said for people following it or not particle physicist and we had a chat room that people could drop into and ask questions of physicists in the audience.",
                    "label": 0
                },
                {
                    "sent": "So that was.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That was a vast event too.",
                    "label": 0
                },
                {
                    "sent": "The tonality of our coverage was this.",
                    "label": 0
                },
                {
                    "sent": "Now it costs far more money than any publicly funded scientific organization can afford to have readers in every country reading press and analyzing it for you.",
                    "label": 0
                },
                {
                    "sent": "But automatic tone analysis is something that media monitoring companies are now doing, so you can get graphs that show this is positive, so this would be they've discovered.",
                    "label": 0
                },
                {
                    "sent": "the Higgs isn't it great, and this would be the yellow is they've discovered the Higgs and this would be they've discovered the Higgs, but why did Fabiola use Comic Sands as her fund?",
                    "label": 0
                },
                {
                    "sent": "And actually, that is what it was.",
                    "label": 0
                },
                {
                    "sent": "The negatives were all about.",
                    "label": 0
                },
                {
                    "sent": "That it allows you just to dig in and see how you're being covered, not just the volume of your coverage, because it's one thing to get vast coverage.",
                    "label": 0
                },
                {
                    "sent": "It's another thing to know what is being said about you, of course.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The biggest story of 2013 was the Nobel Prize.",
                    "label": 0
                },
                {
                    "sent": "In",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Physics are biggest stories from last year.",
                    "label": 1
                },
                {
                    "sent": "Tim Berners Lee being awarded another prize for the invention of the World Wide Web.",
                    "label": 0
                },
                {
                    "sent": "Anybody guess what our biggest story of last year would have been from CERN?",
                    "label": 0
                },
                {
                    "sent": "Think about it.",
                    "label": 0
                },
                {
                    "sent": "So in turn 60.",
                    "label": 0
                },
                {
                    "sent": "It amazes me that anyone was interested in that at all, but they were.",
                    "label": 0
                },
                {
                    "sent": "Like be one of our experiments, discovered 2 new particles.",
                    "label": 0
                },
                {
                    "sent": "This is really esoteric science, but it's a huge peak there, so that again is something that tells you that there's an appetite out there if you tell it in the right channels in the right way.",
                    "label": 0
                },
                {
                    "sent": "And our biggest story that the other Giannotti was nominated for the next directional of certain, the first woman to lead the organization.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Biggest stories this year.",
                    "label": 0
                },
                {
                    "sent": "That was our biggest story this year.",
                    "label": 0
                },
                {
                    "sent": "Certain researchers discovered before and they are using the force.",
                    "label": 1
                },
                {
                    "sent": "This is the one that got 15,000 retweets on Twitter.",
                    "label": 0
                },
                {
                    "sent": "It was fun.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But this didn't do too badly, even though it happened on Easter Sunday, so we've had over 6000 press cuttings about the first circulating beam in the LHC this year.",
                    "label": 1
                },
                {
                    "sent": "We live blogged it in 36,000 people, following it through parts of the day.",
                    "label": 0
                },
                {
                    "sent": "The website had 93,000 visitors, which isn't bad for Easter Sunday, but on April the 1st 1.3 million people went and read that story on our website.",
                    "label": 0
                },
                {
                    "sent": "So that was that was quite a big story, even though from a content point of view threading a low energy beam around the LHC is not really such a big deal, it's a symbolic restart of run to the legacy.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Why does it matter so this is.",
                    "label": 0
                },
                {
                    "sent": "This is where I want to wrap up.",
                    "label": 0
                },
                {
                    "sent": "Now I mentioned at the beginning that we've got a third thread to our mandate now, and that's promote science.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Why does it matter?",
                    "label": 0
                },
                {
                    "sent": "Well that's the cover of the March edition of National Geographic this year.",
                    "label": 0
                },
                {
                    "sent": "The War on science.",
                    "label": 0
                },
                {
                    "sent": "Say climate change doesn't exist.",
                    "label": 1
                },
                {
                    "sent": "Evolution never happened.",
                    "label": 0
                },
                {
                    "sent": "The moon landing was fake.",
                    "label": 0
                },
                {
                    "sent": "You can see somebody faking it.",
                    "label": 0
                },
                {
                    "sent": "Their vaccination causes autism and genetically modified food is evil.",
                    "label": 0
                },
                {
                    "sent": "Now it's not that.",
                    "label": 0
                },
                {
                    "sent": "National Geographic believes that, but that's popular.",
                    "label": 0
                },
                {
                    "sent": "Perception of science is out there and the anti Science movement is getting stronger and stronger and stronger, which is dangerous.",
                    "label": 0
                },
                {
                    "sent": "When we were living at the time when we actually need science.",
                    "label": 0
                },
                {
                    "sent": "Is that a rational approach to take these days?",
                    "label": 0
                },
                {
                    "sent": "Is a scientific organization, even though I spent a long time trying to avoid the fact we've got nuclear in our title?",
                    "label": 0
                },
                {
                    "sent": "Is that a rational approach?",
                    "label": 0
                },
                {
                    "sent": "Is this going to solve the world's energy problems?",
                    "label": 0
                },
                {
                    "sent": "What are we going to do about climate change vaccines?",
                    "label": 0
                },
                {
                    "sent": "My kids are at the age where this story first broke in the UK, and it's heartbreaking that parents chose not to vaccinate their kids and the country is still suffering from that.",
                    "label": 1
                },
                {
                    "sent": "Are mobile phones going to fry your brain now?",
                    "label": 0
                },
                {
                    "sent": "People people now I think need to really well.",
                    "label": 0
                },
                {
                    "sent": "Science needs to re engage with people so they have a rational evidence based mechanism for dealing with questions like.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is just one example that I've taken from him.",
                    "label": 0
                },
                {
                    "sent": "Former DG of certain crystalline Smith, who gave this talk in 2011, just about energies.",
                    "label": 0
                },
                {
                    "sent": "So when the time you gave this talk worlds using energy at 15.7 terawatts, set to increase 50% by 2031.6 billion people lack electricity.",
                    "label": 1
                },
                {
                    "sent": "90% hoops pressing the wrong button.",
                    "label": 1
                },
                {
                    "sent": "90% of our energy comes from burning things 5% from nuclear, 5% from hydro, half a percent from all other other renewables.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We feel that an organization likes and needs, maybe not to actually stand up and promote nuclear, but actually promote rational evidence based discussions on issues such as this.",
                    "label": 0
                },
                {
                    "sent": "So Chris, there in this particular talk he was showing a potential solution if you could solve the politics and you could put solar farms in these places here.",
                    "label": 0
                },
                {
                    "sent": "Then you more than solve the world's energy problems.",
                    "label": 0
                },
                {
                    "sent": "Politics and technology of distribution as well.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So one of the things that we do is we organized TEDx events and we've done 2 now.",
                    "label": 0
                },
                {
                    "sent": "This was the opening speaker of FedEx and last year.",
                    "label": 0
                },
                {
                    "sent": "His name is Bob Chris and he's a professor of philosophy at Stony Brook, who studies, among other things, why it is that the political circles on the planet of disengaged with science, and what science needs to do to re engage with them.",
                    "label": 0
                },
                {
                    "sent": "So he set the framework for it.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But we actually went out and we looked at the major challenges that society is facing and we looked at the kind of buzzwords that are creating negative vibes in the media, and we put them together.",
                    "label": 0
                },
                {
                    "sent": "So we invited people to talk about nanotechnologies.",
                    "label": 0
                },
                {
                    "sent": "This is Sonia Trigueros, who's looking at nanomedicine.",
                    "label": 0
                },
                {
                    "sent": "For example, this is Marcia Barbosa who studies water and amazing weird ones for properties of water, and I was looking at one of the things that she was talking about in her talk.",
                    "label": 0
                },
                {
                    "sent": "Was the fact that if you put Brian along carbon nanotubes, then the water propagates at a different rate from anything else, which may be useful at some point.",
                    "label": 0
                },
                {
                    "sent": "This is an ex particle physicist talking about the statistics of climate change.",
                    "label": 1
                },
                {
                    "sent": "This is John Mighton who was talking about the importance of science, technology, engineering, mathematics education.",
                    "label": 0
                },
                {
                    "sent": "This is 3 Kumar Banerjee talking about thorium cycle vision.",
                    "label": 0
                },
                {
                    "sent": "So much cleaner way of getting energy from vision and this was Nina Fedoroff talking about.",
                    "label": 0
                },
                {
                    "sent": "GMO is among the research that she's done has been looking at genetic modification for drought resistance in food crops for example and we just thought it would be useful for to use the platform to say there are.",
                    "label": 0
                },
                {
                    "sent": "Other ideas out there and we should have a positive debate about them rather than just write them off.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that's it.",
                    "label": 0
                },
                {
                    "sent": "So my take home message here.",
                    "label": 1
                },
                {
                    "sent": "I think you know I don't need to tell you science matters, but I think that we're living in a time where communicating science really matters.",
                    "label": 0
                },
                {
                    "sent": "If we're going to sustain to secure a sustainable future for the planet and with certain visibility, it's great that we were able to promote particle physics.",
                    "label": 1
                },
                {
                    "sent": "But we do it for more than just our own field of science.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}