{
    "id": "5dnfb57kndfygslgh7oojwpnamp5w64e",
    "title": "The zero-moment half metal: How can it change spintronics?",
    "info": {
        "author": [
            "J. M. D. Coey, School of Physics, Trinity College Dublin"
        ],
        "published": "Jan. 25, 2016",
        "recorded": "December 2015",
        "category": [
            "Top->Physics"
        ]
    },
    "url": "http://videolectures.net/kolokviji_coey_zero_moment/",
    "segmentation": [
        [
            "Good afternoon.",
            "It is today my duty to deputy professors who normally runs the colloquium at user Steven Institute because he is somewhere in the business trip and welcome to all who came.",
            "To this special, at least for me, special talk.",
            "And I mean, I think it is also special special for many physicists and hopefully also for chemists.",
            "So it is really my honor and great pleasure to introduce to the speaker.",
            "Professor Michael Cohe is professor emeritus in the School of Physics at Trinity College Dublin and visiting professor at Beijing University.",
            "He's an authority on magnetism and its applications.",
            "His contribution include a systematic investigation of magnetism and amorphous solids, magnetic order in minerals, the discovery of interstitial heart magnets, work on the relation between magnetism and charge, transporting conductivity.",
            "Conducting oxides and development of the field of magnetoelectric chemistry.",
            "Professor Corey is the author of more than 700 scientific papers, which which with H-index 72, maybe it is more.",
            "Because it grows almost every day and several books including magnetism and magnetic materials.",
            "Cambridge University press.",
            "In 2010 he found it Magnetic Solutions Limited.",
            "the Trinity College Science Gallery and was a promoter of Cron Ireland Nanoscience Research Center.",
            "He's the he's a fellow of the Royal Society of Four in associate of the US National Academy of Sciences.",
            "And has an honorary degree from the University of Grenoble in France.",
            "Current research is focused on SP independent electron transport magnetic nanostructures, novel magnetic materials and Magneto Electro chemistry.",
            "I will not take more of your time.",
            "My Mike please.",
            "The stage is yours.",
            "So thank you, spell Maker for the introduction and it's it's been a great pleasure.",
            "Visiting here and staying for a few days and Juliana and it's wonderful.",
            "If the country has everything in a small compass, then the city has everything at a small compass as well.",
            "It's very pleasant.",
            "OK, so today I'm going to talk to you about a new sort of magnetic material.",
            "And.",
            "As the monkey mentioned, we're very interested in spin transport in solids and the whole field of spintronics.",
            "And this material or this type of material zero moment half metal.",
            "Has potential.",
            "To have a very large impact on that field.",
            "Now, of course, there's a long way to go between discovering a new material and actually getting it to work and do something useful, and we've only got some part of the way along that track.",
            "So this is a progress report, but I hope that there will be more progress as time goes on.",
            "So what is the material?"
        ],
        [
            "Well, here is this is Mr G and Mr. G is a sort of material with superpowers, and I'll be telling you about Mr. G. Superpowers and you'll understand in a minute why he's Mr Jeep."
        ],
        [
            "We're working in Dublin in Trinity College, where the Sky is blue like this.",
            "About four days a year.",
            "And then there's there's been a lot of active lot of effort put into this material or put into this work.",
            "And So what?",
            "I'm what I'm presenting is really the work of many people.",
            "Talks in four parts and I'm going to introduce half medals in case you don't remember what it is.",
            "And I'm going to introduce the family of Hoist Malloys, which is very large one.",
            "Then I'm going to talk about.",
            "Manganese rich thin films, which you've got a heusler rated structure and this is MRG.",
            "It's manages two ruthenium nought .5 gallium.",
            "And then at the end.",
            "I'll try to tell you what it might be good for."
        ],
        [
            "But let me just show you these people, this is our group.",
            "This is my colleague Plumbing who manages the group.",
            "We do that together and then the people besides plumbing have been mainly involved.",
            "Is this custom?",
            "Who's a senior senior researcher in the group Navetta who is now gone back to Singapore.",
            "But she made a big contribution.",
            "Going to hell.",
            "Who's a postdoc and young Chung who is just writing his thesis?",
            "Now in case some of you missed my.",
            "Talk on Monday.",
            "I can't.",
            "Resist an order."
        ],
        [
            "So this size we have to have a little advertising, so here it is.",
            "So this is the book and I just checked it.",
            "Buy from Amazon dot D. It's only 67 euros, 50, so it's a really good deal.",
            "It's we can say it's an advanced textbook on magnetism and magnetic materials."
        ],
        [
            "So let's go on and start the introduction.",
            "So.",
            "Half metals and heisler's well."
        ],
        [
            "First question is what?",
            "What is 1/2 metal?",
            "Let me just ask does does everybody know what a half metal is?",
            "Put up your hands if you have any idea what type of metal is OK.",
            "Some people alright.",
            "So OK, so this is not wasted, right?",
            "So first of all, I'll show you what is not right first, it's not a semiconductor semiconductor has got so blue and red are the two spin directions and the semiconductors gotta gap.",
            "Nor is it a semimetal.",
            "Very easy to confuse.",
            "And in some languages you have to be very careful.",
            "In French, for example, you have to.",
            "Distinguish the Demi motels from the city medallion and it's not clear what another distinction this, but any metal has got really vanish.",
            "Ingap it's something like bismuth.",
            "You got a few a few electrons in a few holes.",
            "Well, it's.",
            "Some sort of metal?",
            "That's a normal metal where you got the Fermi level and there's no spin polarization, so that would be a non ferromagnetic metal.",
            "This one is a ferromagnetic metal where we've displaced the two bands and we've got more spin ups than spin downs at the Fermi level and more spin up electrons then spin down electrons so that there's a net magnetic moment.",
            "So now, just like the intelligence test you can.",
            "Perhaps put in the last one in the sequence.",
            "This is this is the half metal.",
            "Now look at the half metal.",
            "It's got a gap in one density of states, right?",
            "So it's like a semiconductor spin tons, and it's like a metal for spin ups.",
            "And usually there are different numbers of spin up spin down and and so it will have a net moment.",
            "But the case I'm going to be particularly interested in is when we got equal numbers of spin up spin downs.",
            "And that's nothing to do with antiferromagnets.",
            "I just make that point clear.",
            "What's important often in spin electronics?",
            "Is the polarization of the electrons at the Fermi level.",
            "And the spin polarization is just the difference between spin ups and spin dance divided by the sum.",
            "And this is a number that goes from nought in this case, to one.",
            "In that case, in principle.",
            "And.",
            "Often we would like this spin polarization to be as high as possible, becausw increasingly in spectronics we make use of spin polarized currents.",
            "Spin polarized current is the flow of angle momentum because the electron spin of course is angle MTM and we can use that to flip.",
            "Magnetization of a thin film?"
        ],
        [
            "So what's it?",
            "Spin moment no.",
            "Let's suppose.",
            "Let's suppose we have a stochiometric half metal.",
            "Write some simple formula.",
            "And so the.",
            "Spin moment for formula is going to be the number of spin ups minus the number of spin downs involve monotones.",
            "That's the spin moment.",
            "However.",
            "The total number of electrons in the formula must be an integer.",
            "Is this documetary compound?",
            "The number of spin down electrons also has to be an integer 'cause we have a gap.",
            "So we have an integral number of electrons with spin down.",
            "So if we have an integral number of totals and spin and spin downs, then it follows that the number of synopsis in integer.",
            "And therefore the number of spin UPS minus the number of spin times is an extra.",
            "So we would expect in this simple picture that the magnetic moment of this ferromagnet is so key metric should be an integral number for many times it should be five or four or three or two or one.",
            "40 or minus one.",
            "So I'm going to be focusing on that possibility that we have.",
            "Zero I we have equal numbers of spin up and spin down electrons in this system.",
            "Note I I should warn you a little bit of truth in advertising, this is a very simplified picture I've just given you and it can be.",
            "It can be spoiled by all sorts of things.",
            "Particularly, spin orbit coupling is going to mix the spin up and spin downs.",
            "In any case that equals 0.",
            "And.",
            "This may be true at T = 0, but it may not be true at any finite temperature.",
            "So there are lots of reasons why you might not get perfect spin polarization, but that's the starting point and it's good to fix the ideas."
        ],
        [
            "So why is spin polarization important in spintronics well?",
            "Basically, becausw.",
            "The two.",
            "Fundamental thinfilm devices.",
            "The giant magnetoresistance.",
            "Spin valve sensor which was.",
            "The subject of the Nobel Prize given to effect, and.",
            "Gonna bug.",
            "And the tunnel magnetic.",
            "The magnetic tunnel junction.",
            "Where the current flows across a thin tunnel barrier between two ferromagnetic.",
            "Layers, both of these show a different resistance according to whether the two layers are parallel or antiparallel.",
            "This is my great resistance.",
            "This is the basis of magnetic memory.",
            "In this not in the sense of the off the hard disk, but in the sense of magnetic random access memory.",
            "And the magnetoresistance is defined like this.",
            "It's the difference.",
            "Between the parallel and antiparallel over the parallel that's there.",
            "That's the optimistic definition.",
            "And magnetoresistance.",
            "Depends on polarization.",
            "Because either in this case.",
            "The electrons where there's a copper spacer acquire some spin polarization from scattering at the interface, or here they acquire spin polarization on passing through the pinned layer.",
            "And they arrive on the other side as a spin polarized current.",
            "And it's astonishing how little thickness of ferromagnetic.",
            "Material is necessary to impart spin polarization to a current something like.",
            "One or two nanometers is quite sufficient.",
            "If we start with another unpolarized current, it goes through one or two nanometers of cobalt or cobalt.",
            "Darn, it comes out with the spin polarization of cobalt coupled are, which is usually about 40%."
        ],
        [
            "No, let me continue with this tunnel magnetoresistance because this is what people are mostly interested in.",
            "And I should say that usually now they're interested in the magnetization being perpendicular to the plane for some reasons that are relating to density.",
            "But if we take a very naive picture which was done first by Julia and he just considered tunneling across the barrier from the spin up to the spin up or spin down to this been done states or the other way round if the two electrodes are anti parallel.",
            "And to obtain this formula for the magnetoresistance, which is just two P ^2 / 1 -- B squared.",
            "And if we take a polarization of 45%, which is something like no cobalt, we should get unlikely to resistance of about 50%.",
            "No, in fact we can do better than that.",
            "And."
        ],
        [
            "This was something that was discovered just more than 10 years ago.",
            "That it's possible.",
            "If you use a.",
            "Body centered cubic.",
            "Alloy like cobalt on.",
            "And.",
            "You pass the electrons across a tunnel barrier, which was not what they used to use, which was the amorphous aluminum oxide but crystalline Mgo then.",
            "This MGO Act is a spin filter.",
            "The band is just match up in such a way that the electrons with spin up and spin down have got different symmetry and one is attenuated much, much more quickly than the other.",
            "So we can take this material which has only got about 40% spin polarization.",
            "We can run it through the MGO and the electrons come out the other side almost perfectly spin polarized.",
            "Note these three have to be.",
            "Crystallized and they have to be.",
            "If not epitaxial, they have to be oriented with the one oh direction perpendicular to the.",
            "Film and you may wonder how on Earth do you do that?",
            "Well, it's again.",
            "It's one of those.",
            "Pieces of serendipity.",
            "In the development of this subject, is that?",
            "Notice it's cobalt aren't born, but easy to make amorphous kobold unborn.",
            "You deposit coupled unborn amorphous.",
            "You deposit Mgo on top of the amorphous Kobold are in boron.",
            "If you do it under well defined conditions, you can get the Mgo to be 100.",
            "Then you deposit another layer of amorphous coupled ironborn on top of the.",
            "One opengeo.",
            "You put it in the furnace and anneal it.",
            "And the Mgo templates both the top and the bottom couple down born.",
            "So you've got a quasi quasi epitaxial stack, certainly with the cubic C axis all the way in the same direction across the whole thing.",
            "And when you do that now, these stacks are complicated.",
            "But this part here basically is the tunnel junction, and there's a lot of stuff underneath it, this is.",
            "And antiferromagnetic pinning layer.",
            "These three are called a synthetic antiferromagnet.",
            "They got known that moment and these are all layers that you need to template it.",
            "I mean, the stacks look complicated but it's the heart of the stack is straightforward.",
            "It's basically a tunnel junction.",
            "And.",
            "Notice that you can obtain eternal magnetoresistance in this stack of in excess of 200%.",
            "Under low temperatures it may be in excess of 300 or even 400% so.",
            "As I say, this was first done about almost 10 years ago and we were the first group in Europe actually, who were able to reproduce this with two 100% double magnetoresistance.",
            "If you look at the cross section TM, this is an old one.",
            "You'd be amazed it works at all, you know.",
            "I mean, these are not perfectly flat.",
            "They should be of course be as late as possible, but there is believe it or not, crystallographic coherence in that direction."
        ],
        [
            "This is the tool that we use to make these.",
            "So I think we're just going to go a bunch of money to buy a new one.",
            "This is based on a 20 year old tool that was used to make retails for the hard disk business, and we've added on three other chambers, one of which we use entirely here for going oxides, and the Mgo is critical.",
            "It's grown by target facing target sputtering.",
            "We've got another chamber down here where we've got a JHV.",
            "Chamber for E Beam evaporation and we can flip the wafers and all of this.",
            "We have a cassette module and a dealer, so this was actually an industrial tool and we've built around it so it's now got 3 three chambers so it's a Shamrock, which was actually hard.",
            "Was originally intended to be.",
            "I won't bore you more with that.",
            "Lots of pictures of stain."
        ],
        [
            "Still, that's gone to the other part of the introduction.",
            "What's a heusler right?",
            "Heisler is an in."
        ],
        [
            "Metallic compound usually with the formula X2Y Z.",
            "And these were discovered more than more than 100 years ago by a German gentleman called High Slim.",
            "And they were surprising because he was able to produce an alloy.",
            "Which contain no ferromagnetic element.",
            "It was made with manganese, copper and something else I forgot what and.",
            "The alloy was ferromagnetic, though none of the constituents were ferromagnetic, so this was the this was what caught peoples attention initially and the structure is.",
            "It's basically it's an ordered BCC structure as you can see there are four subclasses as each of the sub lattices, like the blue one, the red one or the green one.",
            "Those are FCC sublattices and the rule is you pick the XY&Z from different parts of the periodic table and you can make enormous numbers of these things.",
            "You can.",
            "There are computer databases with a quarter of a million of them and probably.",
            "Certainly many, many 10s of thousands have been made.",
            "And you can find practically anything you want.",
            "Summer semiconductors, summer superconductors, summer topological insulators, and so on.",
            "We are interested in ferromagnets, and we're particularly interested in half metallic ferromagnets.",
            "And cobalt two magnets, Silicon and COBOL.",
            "Two arm Silicon are examples, and this one is 1/2 metal with five newbie.",
            "This one is 1/2 metal with six movie performed the unit and they got high Curie temperatures.",
            "So those materials have actually been of interest for spin electronics in their own right."
        ],
        [
            "Not if we plot the.",
            "Number.",
            "Of electrons.",
            "Here I'm plotting the number of valence electrons per Atom.",
            "And here I'm plotting the magnetic moment per Atom.",
            "Now this part of the curve, if you're familiar with magnetism, you'll recognize that this this letter pulling curve here.",
            "These are alloys between cobalt nickel.",
            "Sorry copper cobalt, copper, nickel, cobalt and iron and in this.",
            "As you reduce the number of electrons by one, you increase the magnetic moment by 1.",
            "Not this actually isn't half metal, because there's also.",
            "There's also 4S band, but it's what's known as a strong ferromagnets, so that you've got the.",
            "Spin Up Band is full.",
            "And that's been done.",
            "Band is partly filled, and so when you add or subtract an electron, you increase or decrease the moment by one per minute and.",
            "Here, on the other side.",
            "The.",
            "The heusler alloys and this line has also got slow one.",
            "And these ones actually are half metals, and so this is the slope that we expect for half metal.",
            "This is the rule for counting the valence electrons 6 for chromium, 7 from manganese 8 for on line, for ruthenium is so H. For Armand with Indium line for Cobalt, 10 from nickel and so on.",
            "Three for aluminum or gallium.",
            "4 for Silicon or germanium.",
            "And the slope of this is the magnetic moment that's for the formula with four atoms in both monotones.",
            "Is this number of electrons minus 24?",
            "So let's take for example, one of the ones I looked at over which was cobalt two manganese, Silicon cobalt is.",
            "918 magnis 7 25.",
            "Silicon 4.",
            "Sorry I lost got 60.",
            "1623 and 427.",
            "Let me do it again.",
            "Nine for Cobalt, sorry nine for global.",
            "18 Kobo, two manganese 18 + 725 and four 2929 -- 24 five.",
            "That's what I told you 5 formatted, so there it is.",
            "This is 6 four marathons 'cause I just got one more electron, the manganese and so.",
            "This is 654321.",
            "0.",
            "OK, so why don't you just go to the go to rock furnace and make cobalt two scandium aluminum or something like that and you've got your zero moment half metal.",
            "Should be easy.",
            "Well.",
            "This was suggested 20 years ago by Bob Crute.",
            "And for the best part of the last 20 years, every attempt people made.",
            "To produce this zero moment half metal failed.",
            "The case I gave tried to make cobalt two scandium aluminum.",
            "You can make it, but it doesn't have this structure.",
            "Or it will they segregate into two different compounds?",
            "Or it's just not stable so everything people tried didn't work.",
            "So the question was, is there was?",
            "There's some, you know some fundamental reason why nature doesn't want to make a zero moment, half metal?",
            "Or was it just the people hadn't been lucky or they hadn't tried hard enough?",
            "Let's go on.",
            "I should say that the schematic electronic structure of this series of are noises like this.",
            "There's a spin gap in the minority spin band and the Fermi level is in the majority spinner.",
            "No, I don't know it's gone, so pressing the wrong buttons."
        ],
        [
            "There's another Heusler family which is not X two ways there, but XY zed.",
            "It's got a similar structure, except now we only populate half of the X obliges, so there's one X1Y1Z and the example there is nickel manganese, antimony.",
            "This was actually the first half metal.",
            "It was suggested by Declute another.",
            "More than 10 years before the zero moment, health, metal and.",
            "The rules are pretty much the same, but there the rule is the moment is not end total minus 24, it's N total minus 18.",
            "Because six is where it begins."
        ],
        [
            "No, I said that often.",
            "You don't find the structure you expect, and that's particularly true with manganese.",
            "Manganese, for some reason in these heusler alloys has got.",
            "A love of distorting.",
            "Very strongly in the tetragonal sense, so this is the LT1.",
            "That's the normal heusler.",
            "That's the D 03, which would be say, manganese three gallium if X&Y are both manganese.",
            "This is C1B, which is the one I just showed the hell for slow.",
            "But if you try to make Magni St Gallery and Magni St. Gallium 7.",
            "Times 3 is 21 and three is 24.",
            "This manganese three gallium.",
            "If it was CU would be a zero moment, half metal according to the according to the systematics.",
            "When you make it, it doesn't form this structure.",
            "It forms this one.",
            "It's a D or 22 and you can imagine the DL 22 by just taking that bit in the middle of the cube Excel and expanding it by 25%.",
            "So it's like a brain strain your changing DC into an FCC.",
            "Structure.",
            "And so it's strongly tetragonal and it's obviously got an electronic structure, which is nothing like the cubic one.",
            "This is a slight variant of this.",
            "Dio 22 is L10 where we got planes of one and planes of the other and so that would form with a one to one store Kiama tree.",
            "And that's a common that's a common tetragonal structure tag.",
            "And not something else.",
            "That's that's exactly 1.",
            "OK."
        ],
        [
            "So let me talk a bit more about Magnus the gallium.",
            "Even though it doesn't have the structure we want, this is the neutron diffraction pattern.",
            "And you've got.",
            "We've got two manganese sites, the Red one at the green one.",
            "Under in the structure that twice as many green ones, 40s as there are red ones, two peas.",
            "And the net moment it's very magnetic.",
            "The net moment is about one bomanite on, and that's because we've got about 3 bomb and it turns on the B sides and two back Palmetta turns on the site and twice as many of those as those.",
            "So the net moment is about plus one."
        ],
        [
            "No, that's bulk.",
            "And.",
            "There's not much chance of achieving what we want it seems in the book.",
            "But we're talking about thin films were talking about spin electronics, so let's now go into the world of thin films.",
            "And the beauty of thin films is that you have got.",
            "A whole new degree of control over the phases you produce becausw they grow on a substrate.",
            "And you can choose the substrate to be what you want.",
            "To apply string.",
            "So.",
            "The idea initially was to take manganese three gallium.",
            "I'm good on the substrate, which wouldn't allow it to.",
            "Deform tetragonally just keep it more or less stuck in a cubic structure and it takes some thickness before the strain relaxes.",
            "Typically 10s of nanometers, and since we all need to need a few nanometers of these thin firms in spintronics, that is probably a reasonable proposition.",
            "So."
        ],
        [
            "Look here, that's what we've got in terms of substrates.",
            "There's lots of substrates, but mainly three gallium, the Dior 3, which is the cubic one, should have a lattice parameter times divided by root 3 or 4.22.",
            "Actually, pretty much the same as Mgo.",
            "And the deal 22 should have let us as a parameter see parameters different of 3.9 which is just about the same as Palladium platinum.",
            "And vanadium is also a bit more than Mgo.",
            "Chromium's of it so that you can play with buffer layers and try to try to get things to grow the way you want them to.",
            "Now."
        ],
        [
            "Let me not.",
            "Neighbor this point too much.",
            "We can grow the DO 22 very nicely on.",
            "Platinum is a few holes in the platinum, but we can.",
            "We can make these films.",
            "If we look at the magnetization, actually that's the boat.",
            "Monetization.",
            "It's a little bit strange because the moment is of course not.",
            "Of course, it turns out to be perpendicular to the to the plane, 'cause we've got strong anisotropy along the tetragonal axis.",
            "But what a little bit strange is, we have this moment.",
            "Apparently in plane, and that's because it's not actually a collinear structure.",
            "Came out to the neutron study.",
            "Let me not go on.",
            "A measurement which is very valuable.",
            "Because from what I said at the beginning about spin polarization being important, we like to be able to measure that and a good way to measure the spin polarization is by point contact Andreev reflection.",
            "This is a technique where we take a."
        ],
        [
            "When we take a superconducting tip.",
            "And we just make a contact point contact between the superconductor a ballistic or time contact between the superconductor and the ferromagnet.",
            "And the superconductor, typically niobium, has got this one electron density of states like this, where we got Cooper pairs down here and we've got this this superconducting gap.",
            "And a normal metal.",
            "If an electron tunnels over into the superconductor, it has to actually pair up.",
            "So what happens is the supermarket ejects a whole the other way, so.",
            "The conductivity when we bust this junction below the gap is twice as large as the.",
            "As the.",
            "The conductivity, if we were simply pushing the electrons into the into the normal one electron density of states.",
            "However, if it was a half metal.",
            "You can see.",
            "We've tunnel in an electron.",
            "There's nowhere for the whole to go.",
            "With the opposite spin.",
            "So in principle the conductivity should be 0 for hard metal.",
            "And this is a very neat and simple way to determine what the spin polarization is by taking the measured conductivity and just taking ratios.",
            "And in fact, if you take one of the classic half metals which is O2, chromium dioxide and you do this experiment, you measure practically no conductivity and spin polarization of 95%.",
            "Of course it's all done.",
            "Below the TSC of niobium it's all done it.",
            "Helium temperatures and at room temperature of the story may be different, but it's a good method and it gets it gives us."
        ],
        [
            "Information.",
            "Alright to go on?",
            "If these are manganese, two gallium films grown on Mgo, they actually turn out to be tetragonal."
        ],
        [
            "But what is not tetragonal?",
            "We can grow both CU, manganese, three gallium and manganese, two gallium and manganese, two ruthenium, gallium on appropriate substrates, which I won't bother you with.",
            "No, unfortunately when we make the cubic manganese three gallium.",
            "It doesn't have zero mode, so the rationale that got us this far turned out to be not quite right.",
            "In fact, we're just we're just outside the gap.",
            "However.",
            "What's clear is that the moment of manganese, two gallium, and manganese three gallium are opposite in sign and Magnes, two ruthenium gallium.",
            "Is actually smaller than that of manganese.",
            "Well, it's about the same as buying these three gallon, but it's it's the opposite time to make these two gallons.",
            "So if you if you just look at that and you believe those things have opposites and then you.",
            "Guess that by changing the the ruthenium concentration, you could just engineer the gap to be 0.",
            "OK."
        ],
        [
            "It's the end of the first part.",
            "So now I'm going to talk about MRG.",
            "Here he is again and he's his composition is something like manganese, two ruthenium 1/2 gallon.",
            "Now if you count the electrons there.",
            "You will find you may remember I said 24 is the magic number for full heusler.",
            "And 18 for half heusler.",
            "So if we were exactly in between, it should be 21 and this competition has got 21 electrons."
        ],
        [
            "So we can also call it the compensated ferrimagnetic half metal, depending whichever one you like.",
            "A fairly magnet has got two oppositely.",
            "Alone sublattices.",
            "And if at some temperature they just happen to have the same magnitude, then we say the fairy magnet is compensated.",
            "The moment goes to 0.",
            "And that's interesting because when the moment goes to zero, coercivity goes to Infinity.",
            "So we're going to be crossing the spin gap with ruthenium using CU manganese rich heusler."
        ],
        [
            "Films with.",
            "Ruthenium.",
            "Here's a electronic structure calculation which gives us some encouragement.",
            "This is actually for manganese two gather in cubic manganese, two gallium.",
            "There is a spin gap.",
            "It is not in the right place, it's just above the Fermi level.",
            "So we need we need to.",
            "We need to basically fill up these States and get the Fermi level into the spin gap, so that's the rationale."
        ],
        [
            "This is a story about growing them.",
            "The point is that.",
            "They are cubic, but they are a little bit strained, and that's very important because we need them to be slightly strained.",
            "We need them to be slightly tetragonal, 'cause we need a little bit of an insult to be to make the moment point out of the plane.",
            "Of course, the moment is very small, so the demagnetizing effects are are.",
            "A vanishingly small, but we want for spintronics, as I mentioned at the beginning, we like the moments to be perpendicular.",
            "And this we can achieve by using the right the right substrates and you can see that suffice.",
            "Can it really is?",
            "It's really got fourfold symmetry, as you'd expect."
        ],
        [
            "This is the.",
            "This is the atomic structure of manganese, two ruthenium gallium with 25 electrons.",
            "And then if I take half of the ruthenium out, that's manganese, two ruthenium not .5 gallon with 21 electrons.",
            "And as I said we we expect 21 would be the would be the magic number and we got this biaxial strain.",
            "About about 1%."
        ],
        [
            "Those are electronic structure calculations which indicate that.",
            "We're certainly in the ballpark for a spin Gov."
        ],
        [
            "So here are the data.",
            "And let me just go through this step by step.",
            "First of all.",
            "Look at the Curie temperature, that's the blue one, right?",
            "So even though the end one, manganese two gatherings only got the cure temperature of 200 degrees once we get.",
            "Above .3 the Curie temperatures are five or 600 kelvins, so that's OK. That's comfortable.",
            "We can use that.",
            "Next the magnet is 2 gallium.",
            "I said it's got a big moment.",
            "But when we come near .5, you can see the moment is disappeared practically.",
            "And if I plot then the moment.",
            "As in Pomona transfer formula as a function of X, which is the number of States and electrons we've introduced with the ruthenium, then this red line is what we would expect if we were crossing the spin gap I.",
            "In this region.",
            "Shaded Gray the system is 1/2 metal.",
            "As we increase X, we raised the Fermi level.",
            "We could into the gap in the Gray region and then if we put more we get out of it again.",
            "So this is the region where we expect that we have our half metal."
        ],
        [
            "And this is what the half metal should be like.",
            "It's got known that moments or produces no stray field, however.",
            "One of the one of the Maganese Sublattices.",
            "Hi Scott electrons at the Fermi level and the other one.",
            "Hasn't so we've got these two sublattices that inequivalent, so it's not an antiferromagnet.",
            "There's no crystal inkwell.",
            "There's no crystallographic equivalence between the two magnets sites in high structure.",
            "And there's no symmetry relation between the two sides.",
            "It just happened to have this.",
            "Integral spin moment, which in this case if we choose the compound right is 0."
        ],
        [
            "Note half metals have been with us for a long time and it's always been a little bit difficult to say what is this smoking gun?",
            "Experimental proof that you've got a half metal?",
            "I mean, how do you know you've only got one spin of electrons at the firm level?",
            "Well, let me show you some things so we can use this as our system because we can.",
            "We can change the composition.",
            "So point 83.",
            "We're not in the half metallic region .30 three we are.",
            "Let's go back there."
        ],
        [
            "33 is here it's that .80 three is there so 33 is in the spin gap, 83 is not."
        ],
        [
            "What's the difference?",
            "Well, first of all, look at the resistance as a function of temperature.",
            "They look pretty much the same, except this one.",
            "Which is the normal ferromagnet?",
            "Just got a big money to resistance and the half metal doesn't have any at all practically.",
            "And that's not surprising because you apply a field it you know it doesn't change the electrons at the Fermi level.",
            "Another thing is the anomalous Hall effect.",
            "Now this is really useful when we're measuring confirms, because you don't want to measure the magnetization of things in the squid.",
            "It would take you forever and cost you a fortune.",
            "You can make an electrical measurement and there is a term in the whole effect.",
            "Which is proportional to the magnetization, which is out of the plane.",
            "And so simply by making the electrical measurement you can determine what is.",
            "The perpendicular moment.",
            "But it's not.",
            "Of course, the total moment it's the perpendicular moment of the sub lattice which is got electrons at the Fermi level which is contributing to the anomalous Hall effect.",
            "So we can actually measure the perpendicular moment of.",
            "One of the sublattices through the transition.",
            "Note, since you measure this with respect to an external field as you go through the.",
            "As you go through the compensation, either is a function of concentration or temperature.",
            "Then this anomalous Hall is going to switch the hysteresis loop is going to go from one like this to one like that.",
            "And I'll show you intersected, that's exactly what happens.",
            "But the other point is that the anomalous Hall effect is much, much bigger than usual.",
            "I mean, it's it's 10 times bigger here than it is there, and it's.",
            "In emoji, it's about 10 times what it is in our norcold, so that's that's an indication."
        ],
        [
            "That's the story about anomalous hole, and this shows you what the anomalous whole hysteresis loop looks like.",
            "As you go through compensation, not.",
            "I said that the.",
            "Compensation.",
            "Ideally, is a T = 0.",
            "These are two different sublattices.",
            "They're going to have different exchange interactions and therefore they're going to have different temperature depends, so if they compensate at T = 0, they're not going to compensate it some other temperature.",
            "Well, if they just don't quite compensate that equals zero, we can arrange that at some temperature they will compensate, and that's what we're doing in this case.",
            "This has been fixed or the compensation is just above room temperature, and these are the essentially the perpendicular hysteresis loops.",
            "You can see that it's which sign as we go through the compensation, and the other thing is add compensation for the moment goes to zero.",
            "Notice the coercivity is 14 Tesla.",
            "It's incredibly stable.",
            "And the reason it's so?",
            "The reason is so huge is because the UN isotropy field the coercivity will be maybe 10 or 20% of the nice not to be filled.",
            "The only thought to be field is 2 K 1 / M S. Images are not marked as a shun, we just going to zero.",
            "K1 is the isotropy.",
            "I said we've arranged for it to have a little under soldier because we've made it slightly tetragonal.",
            "So two K 1 / M S diverges at compensation and so we get this extraordinary insensitivity.",
            "To external fields and stability of the magnetization."
        ],
        [
            "This is the same thing, except instead of changing temperature, we're changing composition, and this is probably at room temperature, and we're scanning through.",
            "In this case, the compensation concentration is .69 bedroom temp.",
            "And you can see these loops.",
            "First of all, they got lots of hysteresis and they've and they switched.",
            "So, as I say, the K1 is about 30 kilo joules per cubic meter in these forms.",
            "OK, so.",
            "This is giving you a little bit of of a feeling for how the material is behaving now.",
            "The next question is of course.",
            "And then you can think what you might do with it, because you've got this thin film, which can be a source of spin polarized electrons.",
            "In principle, 100% spin polarized electrons, which we can use as a spin polarized electron source in the tunnel junction or whatever.",
            "So the next step will be to make magnetic tunnel junctions.",
            "And get in touch with your favorite semiconductor company.",
            "No."
        ],
        [
            "We have just recently succeeded in making magnetic tunnel junctions.",
            "And these are known as pseudospin valves.",
            "They're actually very beautiful curves, but the magnetoresistance is not 200%, it's 10%.",
            "So this we have to improve, we started off at point 1%.",
            "We've got to tend.",
            "It's pretty good.",
            "Can we get 200?",
            "Who knows?",
            "But there's a particular difficulty with manganese alloys.",
            "And the particular difficulty with nice alloys.",
            "Anybody who's ever been near a semiconductor fab will know that they they just don't want to know about it because it gets everywhere.",
            "It diffuses very, very easily.",
            "And so if a bit of a little bit of manganese magnetic ions diffuse into the tunnel barrier, there likely to destroy the nice.",
            "Spin filtering properties of the tunnel barrier.",
            "They're just going to produce spin scattering.",
            "So there's a technical challenge which which we're working through underground to try to.",
            "Prevent manganese diffusion with very thin diffusion barriers.",
            "In this case, it will be tantalum and it can be.",
            "It can be too optimistic.",
            "Yes, we want that.",
            "That diffusion barrier and that works.",
            "It's astonishing that we can use .8 now for days nanometers of tantalum, between MRG and NGO or MRG and Copeland born.",
            "And it really, really stops the diffusion of magnets across it.",
            "But we also don't want to do this.",
            "We don't want to destroy the spin filtering properties of the interface, so that's a challenge to get this number bigger.",
            "But this is already.",
            "This is already a large enough tunnel magnetoresistance for what?",
            "We believe is going to be the main.",
            "Use of this material and I'll come to that now in the."
        ],
        [
            "This is more stuff if you know about tunnel junctions.",
            "It's very very bias dependent, which is not not usually a good thing.",
            "There's this shop full off of the.",
            "Tunnel like these resistance at 10K with.",
            "The bias you apply and that's relating of course to just where the family level is.",
            "If you apply a large negative bias, you actually have something which is more stable in temperature and.",
            "Shows a larger TMR of minus, minus 12% at room temperature."
        ],
        [
            "Alright, I'll go quickly through the next bit, which is.",
            "Which is a.",
            "A careful study.",
            "Of the.",
            "30 magnetic structure using synchrotron methods using X Ray absorption spectroscopy and X Ray magnetic circular dichroism X MCD is, as you probably know, a way that you can determine both the spin in the orbital moment.",
            "In an alloy element specific.",
            "By measuring the right, and that's been polarized X Ray absorption.",
            "No.",
            "The trouble here is in principle we should be able to distinguish the two magnet sites 'cause there crystallographically inequivalent.",
            "But they're not very."
        ],
        [
            "Far apart, if you look at the X Ray absorption of the two magnet sites, the foray into four see they are overlapping, so we're going to try to do a job.",
            "D. Convoluting these XM CD Spectra so as to get the moment.",
            "On one manganese at the moment on the other menus.",
            "And we've done that.",
            "It's been that's basically the X MCD signal.",
            "It's the sum of those two things.",
            "We measure in total electron yield, so we only are picking out information.",
            "There's a cap layer of a couple of nanometers and we're only looking at the first few nanometers of the thin film.",
            "It's a perfect method for measuring magnetization in thin films.",
            "It's done it in granola."
        ],
        [
            "Or in the.",
            "Exactly.",
            "It's early.",
            "Here are the Spectra.",
            "This is the XM CD signal versus temperature and you can see.",
            "It's inverting as we go through the compensation he's going from the red curves to the green ones, or as a function of concentration.",
            "It's inverting as well.",
            "Position again going from the red curve to the green curve, so that's all behaving exactly like we expected."
        ],
        [
            "And we pick out the moment on the two on the two sublattices and what we find actually is that one of them.",
            "It's probably it's the four A is rather independent temperature.",
            "And the other one, which is the 4C is rather temperature dependent, and for that this particular composition they compensation occurs just about at room temperature.",
            "So that's that's all working."
        ],
        [
            "This is something I don't have time to talk about.",
            "It's actually not finished.",
            "This is TR MC to look at the spin dynamics."
        ],
        [
            "Let me just now we're coming to the end.",
            "Let me take the last few minutes and ask the question what could it be good for?",
            "I mean obviously to have A to have.",
            "A magnetically a perpendicular magnetically ordered layer in a stack.",
            "Which is stable.",
            "And connected the source of spin polarized electrons would be good actually.",
            "In the stack I showed you at the beginning there there's a part of it, the synthetic antiferromagnet and the and the exchange bias layer.",
            "Four layers could in principle be replaced by this one layer.",
            "But that's not the that's not the most important thing."
        ],
        [
            "Also, you can imagine.",
            "Using this ultra ultra stability ultra high stability.",
            "Of energy with respect to external fields to redesign MRAM either using thermal.",
            "The assisted switching because we can play with the temperature and place ourselves on one side or the other of the compensation, or by using spin transfer, torque switching.",
            "And this can be done in a unipolar way.",
            "You can do bipolar writing using pulses of the same sign but different levels.",
            "But that's not even that's not."
        ],
        [
            "But it's going to be out where it's going to be out is this.",
            "Electronics and the Big data revolution.",
            "Everybody knows how have depended on Moore's law.",
            "Moore's Law is the.",
            "Doubling of semiconductors density every 18 months.",
            "And that's one part of it, and the other part of it.",
            "The other pillar on which the big Data revolution is based is semiconductors.",
            "On the one hand, magnetic recording on the other and magnetic recording.",
            "Has also followed.",
            "Equivalent sort of Moore's law.",
            "Even a bit better and has doubled for a long time every 18 months.",
            "And don't forget that everything you ever download on your computer.",
            "Is stored on hard disks in servers somewhere, that's that's why it's so important.",
            "That's why that's why hard disk recording, even though it seems primitive and extraordinary, that using these mechanical things to do this, this has kept pace and the whole big data revolution is based on those two things.",
            "However.",
            "There's one thing that's.",
            "Been left out of the.",
            "Account.",
            "And.",
            "It's becoming more and more a bottleneck.",
            "And that's the data rate.",
            "The rate at which you can transmit data from chip to chip.",
            "And that should also for everything to go hand in hand.",
            "That should also follow a Moore's law.",
            "It should be doubling every one or two years.",
            "And it's not.",
            "It's got stuck at about some 10s of giga Hertz.",
            "You know from that's what your clocks have been for a long time.",
            "In your computers.",
            "So what we need to do is we need to be.",
            "We need to develop.",
            "A new way of transmitting data chip to chip, which is stable and which can take us in well above 100.",
            "Giga Hertz preferably into the terrorists region and this is the this is the famous terahertz gap.",
            "No.",
            "Terahertz radiation exists, of course.",
            "I mean, when you go to the airport and you do this in the machine.",
            "That's a terahertz.",
            "Source which is image in your body, right?",
            "But that's not appropriate at chip level.",
            "You need something which is Silicon compatible thin film.",
            "And this.",
            "And well, there's no obvious.",
            "There's no obvious solution.",
            "There's that sufficiently stable.",
            "But possibly this is so we're suggesting that the.",
            "And the resonance frequency of these of these zero moment half methods.",
            "Just like the resonance frequency of of an antiferromagnet is not determined.",
            "By the net monetization.",
            "It's not 10 giga Hertz, which is FMR frequency of of iron.",
            "It's determined by the exchange by the exchange between the two sublattices, and by then I surgery.",
            "So in principle we should be able to.",
            "Have to create a territory later like this.",
            "Just take a reference reference layer pinned like this and here's our energy, which will be oscillating.",
            "I mean, it's not perpendicular one sublattices perpendicular, but it's got known that moment, but nevertheless the the resistance of this device is going to be modulated at the frequency that it's oscillating here, so we can.",
            "Imagine this as a dirt also later within with it with an antenna and just over there on the next on the next circuit is a detector where we pick up this.",
            "Where we pick up this this radiation and we.",
            "Rectified and because I began to voltage.",
            "No, we're just beginning to get data to show that this is plausable.",
            "This is actually a thin film of a magnet is gallium alloy.",
            "It's been.",
            "This is something that's just been measured at the free electron laser in.",
            "Dresden and we've got a nice.",
            "A nice rest instead 490 GHz.",
            "In principle we calculate for energy this should be at about 7:00 or 800.",
            "So there's the possibility then, that we're going to use this to breach the terahertz gap and give big data another 20 years."
        ],
        [
            "So that's what we're doing.",
            "Here is the summary you can read quickly.",
            "So the first example of this era moment, half metal, we can grow them on Mgo?",
            "They've got perpendicular.",
            "Nice not to be scared of decent Curie temperature.",
            "The Fermi level spin polarization is around 60%, maybe better.",
            "It creates no stray field.",
            "It's immune to external field.",
            "It can serve as the pin layer in these stacks, but best of all, it could actually give us the prospect of.",
            "Terrorists.",
            "Datarates"
        ],
        [
            "So that's our Institute in Dublin.",
            "That's the cutting edge of science we think."
        ],
        [
            "And there's Mr. MRG and myself, thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good afternoon.",
                    "label": 0
                },
                {
                    "sent": "It is today my duty to deputy professors who normally runs the colloquium at user Steven Institute because he is somewhere in the business trip and welcome to all who came.",
                    "label": 0
                },
                {
                    "sent": "To this special, at least for me, special talk.",
                    "label": 0
                },
                {
                    "sent": "And I mean, I think it is also special special for many physicists and hopefully also for chemists.",
                    "label": 0
                },
                {
                    "sent": "So it is really my honor and great pleasure to introduce to the speaker.",
                    "label": 0
                },
                {
                    "sent": "Professor Michael Cohe is professor emeritus in the School of Physics at Trinity College Dublin and visiting professor at Beijing University.",
                    "label": 1
                },
                {
                    "sent": "He's an authority on magnetism and its applications.",
                    "label": 0
                },
                {
                    "sent": "His contribution include a systematic investigation of magnetism and amorphous solids, magnetic order in minerals, the discovery of interstitial heart magnets, work on the relation between magnetism and charge, transporting conductivity.",
                    "label": 0
                },
                {
                    "sent": "Conducting oxides and development of the field of magnetoelectric chemistry.",
                    "label": 0
                },
                {
                    "sent": "Professor Corey is the author of more than 700 scientific papers, which which with H-index 72, maybe it is more.",
                    "label": 0
                },
                {
                    "sent": "Because it grows almost every day and several books including magnetism and magnetic materials.",
                    "label": 0
                },
                {
                    "sent": "Cambridge University press.",
                    "label": 0
                },
                {
                    "sent": "In 2010 he found it Magnetic Solutions Limited.",
                    "label": 0
                },
                {
                    "sent": "the Trinity College Science Gallery and was a promoter of Cron Ireland Nanoscience Research Center.",
                    "label": 0
                },
                {
                    "sent": "He's the he's a fellow of the Royal Society of Four in associate of the US National Academy of Sciences.",
                    "label": 0
                },
                {
                    "sent": "And has an honorary degree from the University of Grenoble in France.",
                    "label": 0
                },
                {
                    "sent": "Current research is focused on SP independent electron transport magnetic nanostructures, novel magnetic materials and Magneto Electro chemistry.",
                    "label": 0
                },
                {
                    "sent": "I will not take more of your time.",
                    "label": 0
                },
                {
                    "sent": "My Mike please.",
                    "label": 0
                },
                {
                    "sent": "The stage is yours.",
                    "label": 0
                },
                {
                    "sent": "So thank you, spell Maker for the introduction and it's it's been a great pleasure.",
                    "label": 0
                },
                {
                    "sent": "Visiting here and staying for a few days and Juliana and it's wonderful.",
                    "label": 0
                },
                {
                    "sent": "If the country has everything in a small compass, then the city has everything at a small compass as well.",
                    "label": 0
                },
                {
                    "sent": "It's very pleasant.",
                    "label": 0
                },
                {
                    "sent": "OK, so today I'm going to talk to you about a new sort of magnetic material.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "As the monkey mentioned, we're very interested in spin transport in solids and the whole field of spintronics.",
                    "label": 0
                },
                {
                    "sent": "And this material or this type of material zero moment half metal.",
                    "label": 0
                },
                {
                    "sent": "Has potential.",
                    "label": 0
                },
                {
                    "sent": "To have a very large impact on that field.",
                    "label": 0
                },
                {
                    "sent": "Now, of course, there's a long way to go between discovering a new material and actually getting it to work and do something useful, and we've only got some part of the way along that track.",
                    "label": 0
                },
                {
                    "sent": "So this is a progress report, but I hope that there will be more progress as time goes on.",
                    "label": 0
                },
                {
                    "sent": "So what is the material?",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, here is this is Mr G and Mr. G is a sort of material with superpowers, and I'll be telling you about Mr. G. Superpowers and you'll understand in a minute why he's Mr Jeep.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We're working in Dublin in Trinity College, where the Sky is blue like this.",
                    "label": 1
                },
                {
                    "sent": "About four days a year.",
                    "label": 0
                },
                {
                    "sent": "And then there's there's been a lot of active lot of effort put into this material or put into this work.",
                    "label": 0
                },
                {
                    "sent": "And So what?",
                    "label": 0
                },
                {
                    "sent": "I'm what I'm presenting is really the work of many people.",
                    "label": 0
                },
                {
                    "sent": "Talks in four parts and I'm going to introduce half medals in case you don't remember what it is.",
                    "label": 0
                },
                {
                    "sent": "And I'm going to introduce the family of Hoist Malloys, which is very large one.",
                    "label": 0
                },
                {
                    "sent": "Then I'm going to talk about.",
                    "label": 0
                },
                {
                    "sent": "Manganese rich thin films, which you've got a heusler rated structure and this is MRG.",
                    "label": 0
                },
                {
                    "sent": "It's manages two ruthenium nought .5 gallium.",
                    "label": 0
                },
                {
                    "sent": "And then at the end.",
                    "label": 0
                },
                {
                    "sent": "I'll try to tell you what it might be good for.",
                    "label": 1
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But let me just show you these people, this is our group.",
                    "label": 0
                },
                {
                    "sent": "This is my colleague Plumbing who manages the group.",
                    "label": 0
                },
                {
                    "sent": "We do that together and then the people besides plumbing have been mainly involved.",
                    "label": 0
                },
                {
                    "sent": "Is this custom?",
                    "label": 0
                },
                {
                    "sent": "Who's a senior senior researcher in the group Navetta who is now gone back to Singapore.",
                    "label": 0
                },
                {
                    "sent": "But she made a big contribution.",
                    "label": 0
                },
                {
                    "sent": "Going to hell.",
                    "label": 0
                },
                {
                    "sent": "Who's a postdoc and young Chung who is just writing his thesis?",
                    "label": 0
                },
                {
                    "sent": "Now in case some of you missed my.",
                    "label": 0
                },
                {
                    "sent": "Talk on Monday.",
                    "label": 0
                },
                {
                    "sent": "I can't.",
                    "label": 0
                },
                {
                    "sent": "Resist an order.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this size we have to have a little advertising, so here it is.",
                    "label": 0
                },
                {
                    "sent": "So this is the book and I just checked it.",
                    "label": 0
                },
                {
                    "sent": "Buy from Amazon dot D. It's only 67 euros, 50, so it's a really good deal.",
                    "label": 0
                },
                {
                    "sent": "It's we can say it's an advanced textbook on magnetism and magnetic materials.",
                    "label": 1
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's go on and start the introduction.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Half metals and heisler's well.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First question is what?",
                    "label": 0
                },
                {
                    "sent": "What is 1/2 metal?",
                    "label": 0
                },
                {
                    "sent": "Let me just ask does does everybody know what a half metal is?",
                    "label": 0
                },
                {
                    "sent": "Put up your hands if you have any idea what type of metal is OK.",
                    "label": 0
                },
                {
                    "sent": "Some people alright.",
                    "label": 0
                },
                {
                    "sent": "So OK, so this is not wasted, right?",
                    "label": 0
                },
                {
                    "sent": "So first of all, I'll show you what is not right first, it's not a semiconductor semiconductor has got so blue and red are the two spin directions and the semiconductors gotta gap.",
                    "label": 0
                },
                {
                    "sent": "Nor is it a semimetal.",
                    "label": 0
                },
                {
                    "sent": "Very easy to confuse.",
                    "label": 0
                },
                {
                    "sent": "And in some languages you have to be very careful.",
                    "label": 0
                },
                {
                    "sent": "In French, for example, you have to.",
                    "label": 0
                },
                {
                    "sent": "Distinguish the Demi motels from the city medallion and it's not clear what another distinction this, but any metal has got really vanish.",
                    "label": 0
                },
                {
                    "sent": "Ingap it's something like bismuth.",
                    "label": 0
                },
                {
                    "sent": "You got a few a few electrons in a few holes.",
                    "label": 0
                },
                {
                    "sent": "Well, it's.",
                    "label": 0
                },
                {
                    "sent": "Some sort of metal?",
                    "label": 0
                },
                {
                    "sent": "That's a normal metal where you got the Fermi level and there's no spin polarization, so that would be a non ferromagnetic metal.",
                    "label": 1
                },
                {
                    "sent": "This one is a ferromagnetic metal where we've displaced the two bands and we've got more spin ups than spin downs at the Fermi level and more spin up electrons then spin down electrons so that there's a net magnetic moment.",
                    "label": 0
                },
                {
                    "sent": "So now, just like the intelligence test you can.",
                    "label": 0
                },
                {
                    "sent": "Perhaps put in the last one in the sequence.",
                    "label": 0
                },
                {
                    "sent": "This is this is the half metal.",
                    "label": 0
                },
                {
                    "sent": "Now look at the half metal.",
                    "label": 0
                },
                {
                    "sent": "It's got a gap in one density of states, right?",
                    "label": 0
                },
                {
                    "sent": "So it's like a semiconductor spin tons, and it's like a metal for spin ups.",
                    "label": 0
                },
                {
                    "sent": "And usually there are different numbers of spin up spin down and and so it will have a net moment.",
                    "label": 0
                },
                {
                    "sent": "But the case I'm going to be particularly interested in is when we got equal numbers of spin up spin downs.",
                    "label": 0
                },
                {
                    "sent": "And that's nothing to do with antiferromagnets.",
                    "label": 0
                },
                {
                    "sent": "I just make that point clear.",
                    "label": 0
                },
                {
                    "sent": "What's important often in spin electronics?",
                    "label": 0
                },
                {
                    "sent": "Is the polarization of the electrons at the Fermi level.",
                    "label": 0
                },
                {
                    "sent": "And the spin polarization is just the difference between spin ups and spin dance divided by the sum.",
                    "label": 0
                },
                {
                    "sent": "And this is a number that goes from nought in this case, to one.",
                    "label": 0
                },
                {
                    "sent": "In that case, in principle.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Often we would like this spin polarization to be as high as possible, becausw increasingly in spectronics we make use of spin polarized currents.",
                    "label": 0
                },
                {
                    "sent": "Spin polarized current is the flow of angle momentum because the electron spin of course is angle MTM and we can use that to flip.",
                    "label": 0
                },
                {
                    "sent": "Magnetization of a thin film?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what's it?",
                    "label": 0
                },
                {
                    "sent": "Spin moment no.",
                    "label": 0
                },
                {
                    "sent": "Let's suppose.",
                    "label": 0
                },
                {
                    "sent": "Let's suppose we have a stochiometric half metal.",
                    "label": 1
                },
                {
                    "sent": "Write some simple formula.",
                    "label": 0
                },
                {
                    "sent": "And so the.",
                    "label": 1
                },
                {
                    "sent": "Spin moment for formula is going to be the number of spin ups minus the number of spin downs involve monotones.",
                    "label": 0
                },
                {
                    "sent": "That's the spin moment.",
                    "label": 0
                },
                {
                    "sent": "However.",
                    "label": 0
                },
                {
                    "sent": "The total number of electrons in the formula must be an integer.",
                    "label": 0
                },
                {
                    "sent": "Is this documetary compound?",
                    "label": 0
                },
                {
                    "sent": "The number of spin down electrons also has to be an integer 'cause we have a gap.",
                    "label": 0
                },
                {
                    "sent": "So we have an integral number of electrons with spin down.",
                    "label": 0
                },
                {
                    "sent": "So if we have an integral number of totals and spin and spin downs, then it follows that the number of synopsis in integer.",
                    "label": 0
                },
                {
                    "sent": "And therefore the number of spin UPS minus the number of spin times is an extra.",
                    "label": 0
                },
                {
                    "sent": "So we would expect in this simple picture that the magnetic moment of this ferromagnet is so key metric should be an integral number for many times it should be five or four or three or two or one.",
                    "label": 0
                },
                {
                    "sent": "40 or minus one.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to be focusing on that possibility that we have.",
                    "label": 0
                },
                {
                    "sent": "Zero I we have equal numbers of spin up and spin down electrons in this system.",
                    "label": 0
                },
                {
                    "sent": "Note I I should warn you a little bit of truth in advertising, this is a very simplified picture I've just given you and it can be.",
                    "label": 0
                },
                {
                    "sent": "It can be spoiled by all sorts of things.",
                    "label": 0
                },
                {
                    "sent": "Particularly, spin orbit coupling is going to mix the spin up and spin downs.",
                    "label": 0
                },
                {
                    "sent": "In any case that equals 0.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "This may be true at T = 0, but it may not be true at any finite temperature.",
                    "label": 0
                },
                {
                    "sent": "So there are lots of reasons why you might not get perfect spin polarization, but that's the starting point and it's good to fix the ideas.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So why is spin polarization important in spintronics well?",
                    "label": 1
                },
                {
                    "sent": "Basically, becausw.",
                    "label": 0
                },
                {
                    "sent": "The two.",
                    "label": 0
                },
                {
                    "sent": "Fundamental thinfilm devices.",
                    "label": 0
                },
                {
                    "sent": "The giant magnetoresistance.",
                    "label": 1
                },
                {
                    "sent": "Spin valve sensor which was.",
                    "label": 0
                },
                {
                    "sent": "The subject of the Nobel Prize given to effect, and.",
                    "label": 0
                },
                {
                    "sent": "Gonna bug.",
                    "label": 0
                },
                {
                    "sent": "And the tunnel magnetic.",
                    "label": 0
                },
                {
                    "sent": "The magnetic tunnel junction.",
                    "label": 0
                },
                {
                    "sent": "Where the current flows across a thin tunnel barrier between two ferromagnetic.",
                    "label": 0
                },
                {
                    "sent": "Layers, both of these show a different resistance according to whether the two layers are parallel or antiparallel.",
                    "label": 0
                },
                {
                    "sent": "This is my great resistance.",
                    "label": 0
                },
                {
                    "sent": "This is the basis of magnetic memory.",
                    "label": 0
                },
                {
                    "sent": "In this not in the sense of the off the hard disk, but in the sense of magnetic random access memory.",
                    "label": 0
                },
                {
                    "sent": "And the magnetoresistance is defined like this.",
                    "label": 0
                },
                {
                    "sent": "It's the difference.",
                    "label": 0
                },
                {
                    "sent": "Between the parallel and antiparallel over the parallel that's there.",
                    "label": 0
                },
                {
                    "sent": "That's the optimistic definition.",
                    "label": 0
                },
                {
                    "sent": "And magnetoresistance.",
                    "label": 0
                },
                {
                    "sent": "Depends on polarization.",
                    "label": 0
                },
                {
                    "sent": "Because either in this case.",
                    "label": 0
                },
                {
                    "sent": "The electrons where there's a copper spacer acquire some spin polarization from scattering at the interface, or here they acquire spin polarization on passing through the pinned layer.",
                    "label": 0
                },
                {
                    "sent": "And they arrive on the other side as a spin polarized current.",
                    "label": 0
                },
                {
                    "sent": "And it's astonishing how little thickness of ferromagnetic.",
                    "label": 0
                },
                {
                    "sent": "Material is necessary to impart spin polarization to a current something like.",
                    "label": 0
                },
                {
                    "sent": "One or two nanometers is quite sufficient.",
                    "label": 0
                },
                {
                    "sent": "If we start with another unpolarized current, it goes through one or two nanometers of cobalt or cobalt.",
                    "label": 0
                },
                {
                    "sent": "Darn, it comes out with the spin polarization of cobalt coupled are, which is usually about 40%.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, let me continue with this tunnel magnetoresistance because this is what people are mostly interested in.",
                    "label": 0
                },
                {
                    "sent": "And I should say that usually now they're interested in the magnetization being perpendicular to the plane for some reasons that are relating to density.",
                    "label": 0
                },
                {
                    "sent": "But if we take a very naive picture which was done first by Julia and he just considered tunneling across the barrier from the spin up to the spin up or spin down to this been done states or the other way round if the two electrodes are anti parallel.",
                    "label": 0
                },
                {
                    "sent": "And to obtain this formula for the magnetoresistance, which is just two P ^2 / 1 -- B squared.",
                    "label": 0
                },
                {
                    "sent": "And if we take a polarization of 45%, which is something like no cobalt, we should get unlikely to resistance of about 50%.",
                    "label": 0
                },
                {
                    "sent": "No, in fact we can do better than that.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This was something that was discovered just more than 10 years ago.",
                    "label": 0
                },
                {
                    "sent": "That it's possible.",
                    "label": 0
                },
                {
                    "sent": "If you use a.",
                    "label": 0
                },
                {
                    "sent": "Body centered cubic.",
                    "label": 0
                },
                {
                    "sent": "Alloy like cobalt on.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "You pass the electrons across a tunnel barrier, which was not what they used to use, which was the amorphous aluminum oxide but crystalline Mgo then.",
                    "label": 1
                },
                {
                    "sent": "This MGO Act is a spin filter.",
                    "label": 0
                },
                {
                    "sent": "The band is just match up in such a way that the electrons with spin up and spin down have got different symmetry and one is attenuated much, much more quickly than the other.",
                    "label": 0
                },
                {
                    "sent": "So we can take this material which has only got about 40% spin polarization.",
                    "label": 0
                },
                {
                    "sent": "We can run it through the MGO and the electrons come out the other side almost perfectly spin polarized.",
                    "label": 0
                },
                {
                    "sent": "Note these three have to be.",
                    "label": 0
                },
                {
                    "sent": "Crystallized and they have to be.",
                    "label": 0
                },
                {
                    "sent": "If not epitaxial, they have to be oriented with the one oh direction perpendicular to the.",
                    "label": 0
                },
                {
                    "sent": "Film and you may wonder how on Earth do you do that?",
                    "label": 0
                },
                {
                    "sent": "Well, it's again.",
                    "label": 0
                },
                {
                    "sent": "It's one of those.",
                    "label": 0
                },
                {
                    "sent": "Pieces of serendipity.",
                    "label": 0
                },
                {
                    "sent": "In the development of this subject, is that?",
                    "label": 0
                },
                {
                    "sent": "Notice it's cobalt aren't born, but easy to make amorphous kobold unborn.",
                    "label": 0
                },
                {
                    "sent": "You deposit coupled unborn amorphous.",
                    "label": 0
                },
                {
                    "sent": "You deposit Mgo on top of the amorphous Kobold are in boron.",
                    "label": 0
                },
                {
                    "sent": "If you do it under well defined conditions, you can get the Mgo to be 100.",
                    "label": 0
                },
                {
                    "sent": "Then you deposit another layer of amorphous coupled ironborn on top of the.",
                    "label": 0
                },
                {
                    "sent": "One opengeo.",
                    "label": 0
                },
                {
                    "sent": "You put it in the furnace and anneal it.",
                    "label": 0
                },
                {
                    "sent": "And the Mgo templates both the top and the bottom couple down born.",
                    "label": 0
                },
                {
                    "sent": "So you've got a quasi quasi epitaxial stack, certainly with the cubic C axis all the way in the same direction across the whole thing.",
                    "label": 0
                },
                {
                    "sent": "And when you do that now, these stacks are complicated.",
                    "label": 0
                },
                {
                    "sent": "But this part here basically is the tunnel junction, and there's a lot of stuff underneath it, this is.",
                    "label": 0
                },
                {
                    "sent": "And antiferromagnetic pinning layer.",
                    "label": 0
                },
                {
                    "sent": "These three are called a synthetic antiferromagnet.",
                    "label": 1
                },
                {
                    "sent": "They got known that moment and these are all layers that you need to template it.",
                    "label": 0
                },
                {
                    "sent": "I mean, the stacks look complicated but it's the heart of the stack is straightforward.",
                    "label": 0
                },
                {
                    "sent": "It's basically a tunnel junction.",
                    "label": 1
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Notice that you can obtain eternal magnetoresistance in this stack of in excess of 200%.",
                    "label": 0
                },
                {
                    "sent": "Under low temperatures it may be in excess of 300 or even 400% so.",
                    "label": 0
                },
                {
                    "sent": "As I say, this was first done about almost 10 years ago and we were the first group in Europe actually, who were able to reproduce this with two 100% double magnetoresistance.",
                    "label": 0
                },
                {
                    "sent": "If you look at the cross section TM, this is an old one.",
                    "label": 0
                },
                {
                    "sent": "You'd be amazed it works at all, you know.",
                    "label": 0
                },
                {
                    "sent": "I mean, these are not perfectly flat.",
                    "label": 0
                },
                {
                    "sent": "They should be of course be as late as possible, but there is believe it or not, crystallographic coherence in that direction.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is the tool that we use to make these.",
                    "label": 0
                },
                {
                    "sent": "So I think we're just going to go a bunch of money to buy a new one.",
                    "label": 0
                },
                {
                    "sent": "This is based on a 20 year old tool that was used to make retails for the hard disk business, and we've added on three other chambers, one of which we use entirely here for going oxides, and the Mgo is critical.",
                    "label": 0
                },
                {
                    "sent": "It's grown by target facing target sputtering.",
                    "label": 1
                },
                {
                    "sent": "We've got another chamber down here where we've got a JHV.",
                    "label": 0
                },
                {
                    "sent": "Chamber for E Beam evaporation and we can flip the wafers and all of this.",
                    "label": 0
                },
                {
                    "sent": "We have a cassette module and a dealer, so this was actually an industrial tool and we've built around it so it's now got 3 three chambers so it's a Shamrock, which was actually hard.",
                    "label": 0
                },
                {
                    "sent": "Was originally intended to be.",
                    "label": 0
                },
                {
                    "sent": "I won't bore you more with that.",
                    "label": 0
                },
                {
                    "sent": "Lots of pictures of stain.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Still, that's gone to the other part of the introduction.",
                    "label": 0
                },
                {
                    "sent": "What's a heusler right?",
                    "label": 0
                },
                {
                    "sent": "Heisler is an in.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Metallic compound usually with the formula X2Y Z.",
                    "label": 0
                },
                {
                    "sent": "And these were discovered more than more than 100 years ago by a German gentleman called High Slim.",
                    "label": 0
                },
                {
                    "sent": "And they were surprising because he was able to produce an alloy.",
                    "label": 0
                },
                {
                    "sent": "Which contain no ferromagnetic element.",
                    "label": 0
                },
                {
                    "sent": "It was made with manganese, copper and something else I forgot what and.",
                    "label": 0
                },
                {
                    "sent": "The alloy was ferromagnetic, though none of the constituents were ferromagnetic, so this was the this was what caught peoples attention initially and the structure is.",
                    "label": 0
                },
                {
                    "sent": "It's basically it's an ordered BCC structure as you can see there are four subclasses as each of the sub lattices, like the blue one, the red one or the green one.",
                    "label": 0
                },
                {
                    "sent": "Those are FCC sublattices and the rule is you pick the XY&Z from different parts of the periodic table and you can make enormous numbers of these things.",
                    "label": 0
                },
                {
                    "sent": "You can.",
                    "label": 0
                },
                {
                    "sent": "There are computer databases with a quarter of a million of them and probably.",
                    "label": 0
                },
                {
                    "sent": "Certainly many, many 10s of thousands have been made.",
                    "label": 0
                },
                {
                    "sent": "And you can find practically anything you want.",
                    "label": 0
                },
                {
                    "sent": "Summer semiconductors, summer superconductors, summer topological insulators, and so on.",
                    "label": 0
                },
                {
                    "sent": "We are interested in ferromagnets, and we're particularly interested in half metallic ferromagnets.",
                    "label": 0
                },
                {
                    "sent": "And cobalt two magnets, Silicon and COBOL.",
                    "label": 0
                },
                {
                    "sent": "Two arm Silicon are examples, and this one is 1/2 metal with five newbie.",
                    "label": 0
                },
                {
                    "sent": "This one is 1/2 metal with six movie performed the unit and they got high Curie temperatures.",
                    "label": 0
                },
                {
                    "sent": "So those materials have actually been of interest for spin electronics in their own right.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Not if we plot the.",
                    "label": 0
                },
                {
                    "sent": "Number.",
                    "label": 0
                },
                {
                    "sent": "Of electrons.",
                    "label": 0
                },
                {
                    "sent": "Here I'm plotting the number of valence electrons per Atom.",
                    "label": 0
                },
                {
                    "sent": "And here I'm plotting the magnetic moment per Atom.",
                    "label": 0
                },
                {
                    "sent": "Now this part of the curve, if you're familiar with magnetism, you'll recognize that this this letter pulling curve here.",
                    "label": 0
                },
                {
                    "sent": "These are alloys between cobalt nickel.",
                    "label": 0
                },
                {
                    "sent": "Sorry copper cobalt, copper, nickel, cobalt and iron and in this.",
                    "label": 0
                },
                {
                    "sent": "As you reduce the number of electrons by one, you increase the magnetic moment by 1.",
                    "label": 0
                },
                {
                    "sent": "Not this actually isn't half metal, because there's also.",
                    "label": 0
                },
                {
                    "sent": "There's also 4S band, but it's what's known as a strong ferromagnets, so that you've got the.",
                    "label": 0
                },
                {
                    "sent": "Spin Up Band is full.",
                    "label": 0
                },
                {
                    "sent": "And that's been done.",
                    "label": 0
                },
                {
                    "sent": "Band is partly filled, and so when you add or subtract an electron, you increase or decrease the moment by one per minute and.",
                    "label": 0
                },
                {
                    "sent": "Here, on the other side.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "The heusler alloys and this line has also got slow one.",
                    "label": 0
                },
                {
                    "sent": "And these ones actually are half metals, and so this is the slope that we expect for half metal.",
                    "label": 0
                },
                {
                    "sent": "This is the rule for counting the valence electrons 6 for chromium, 7 from manganese 8 for on line, for ruthenium is so H. For Armand with Indium line for Cobalt, 10 from nickel and so on.",
                    "label": 1
                },
                {
                    "sent": "Three for aluminum or gallium.",
                    "label": 1
                },
                {
                    "sent": "4 for Silicon or germanium.",
                    "label": 0
                },
                {
                    "sent": "And the slope of this is the magnetic moment that's for the formula with four atoms in both monotones.",
                    "label": 0
                },
                {
                    "sent": "Is this number of electrons minus 24?",
                    "label": 0
                },
                {
                    "sent": "So let's take for example, one of the ones I looked at over which was cobalt two manganese, Silicon cobalt is.",
                    "label": 0
                },
                {
                    "sent": "918 magnis 7 25.",
                    "label": 0
                },
                {
                    "sent": "Silicon 4.",
                    "label": 0
                },
                {
                    "sent": "Sorry I lost got 60.",
                    "label": 0
                },
                {
                    "sent": "1623 and 427.",
                    "label": 0
                },
                {
                    "sent": "Let me do it again.",
                    "label": 0
                },
                {
                    "sent": "Nine for Cobalt, sorry nine for global.",
                    "label": 0
                },
                {
                    "sent": "18 Kobo, two manganese 18 + 725 and four 2929 -- 24 five.",
                    "label": 0
                },
                {
                    "sent": "That's what I told you 5 formatted, so there it is.",
                    "label": 0
                },
                {
                    "sent": "This is 6 four marathons 'cause I just got one more electron, the manganese and so.",
                    "label": 0
                },
                {
                    "sent": "This is 654321.",
                    "label": 0
                },
                {
                    "sent": "0.",
                    "label": 0
                },
                {
                    "sent": "OK, so why don't you just go to the go to rock furnace and make cobalt two scandium aluminum or something like that and you've got your zero moment half metal.",
                    "label": 0
                },
                {
                    "sent": "Should be easy.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "This was suggested 20 years ago by Bob Crute.",
                    "label": 0
                },
                {
                    "sent": "And for the best part of the last 20 years, every attempt people made.",
                    "label": 0
                },
                {
                    "sent": "To produce this zero moment half metal failed.",
                    "label": 0
                },
                {
                    "sent": "The case I gave tried to make cobalt two scandium aluminum.",
                    "label": 0
                },
                {
                    "sent": "You can make it, but it doesn't have this structure.",
                    "label": 0
                },
                {
                    "sent": "Or it will they segregate into two different compounds?",
                    "label": 0
                },
                {
                    "sent": "Or it's just not stable so everything people tried didn't work.",
                    "label": 0
                },
                {
                    "sent": "So the question was, is there was?",
                    "label": 0
                },
                {
                    "sent": "There's some, you know some fundamental reason why nature doesn't want to make a zero moment, half metal?",
                    "label": 0
                },
                {
                    "sent": "Or was it just the people hadn't been lucky or they hadn't tried hard enough?",
                    "label": 0
                },
                {
                    "sent": "Let's go on.",
                    "label": 1
                },
                {
                    "sent": "I should say that the schematic electronic structure of this series of are noises like this.",
                    "label": 0
                },
                {
                    "sent": "There's a spin gap in the minority spin band and the Fermi level is in the majority spinner.",
                    "label": 0
                },
                {
                    "sent": "No, I don't know it's gone, so pressing the wrong buttons.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's another Heusler family which is not X two ways there, but XY zed.",
                    "label": 0
                },
                {
                    "sent": "It's got a similar structure, except now we only populate half of the X obliges, so there's one X1Y1Z and the example there is nickel manganese, antimony.",
                    "label": 0
                },
                {
                    "sent": "This was actually the first half metal.",
                    "label": 0
                },
                {
                    "sent": "It was suggested by Declute another.",
                    "label": 0
                },
                {
                    "sent": "More than 10 years before the zero moment, health, metal and.",
                    "label": 0
                },
                {
                    "sent": "The rules are pretty much the same, but there the rule is the moment is not end total minus 24, it's N total minus 18.",
                    "label": 0
                },
                {
                    "sent": "Because six is where it begins.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No, I said that often.",
                    "label": 0
                },
                {
                    "sent": "You don't find the structure you expect, and that's particularly true with manganese.",
                    "label": 0
                },
                {
                    "sent": "Manganese, for some reason in these heusler alloys has got.",
                    "label": 1
                },
                {
                    "sent": "A love of distorting.",
                    "label": 1
                },
                {
                    "sent": "Very strongly in the tetragonal sense, so this is the LT1.",
                    "label": 0
                },
                {
                    "sent": "That's the normal heusler.",
                    "label": 0
                },
                {
                    "sent": "That's the D 03, which would be say, manganese three gallium if X&Y are both manganese.",
                    "label": 0
                },
                {
                    "sent": "This is C1B, which is the one I just showed the hell for slow.",
                    "label": 0
                },
                {
                    "sent": "But if you try to make Magni St Gallery and Magni St. Gallium 7.",
                    "label": 0
                },
                {
                    "sent": "Times 3 is 21 and three is 24.",
                    "label": 0
                },
                {
                    "sent": "This manganese three gallium.",
                    "label": 0
                },
                {
                    "sent": "If it was CU would be a zero moment, half metal according to the according to the systematics.",
                    "label": 0
                },
                {
                    "sent": "When you make it, it doesn't form this structure.",
                    "label": 1
                },
                {
                    "sent": "It forms this one.",
                    "label": 0
                },
                {
                    "sent": "It's a D or 22 and you can imagine the DL 22 by just taking that bit in the middle of the cube Excel and expanding it by 25%.",
                    "label": 0
                },
                {
                    "sent": "So it's like a brain strain your changing DC into an FCC.",
                    "label": 0
                },
                {
                    "sent": "Structure.",
                    "label": 0
                },
                {
                    "sent": "And so it's strongly tetragonal and it's obviously got an electronic structure, which is nothing like the cubic one.",
                    "label": 1
                },
                {
                    "sent": "This is a slight variant of this.",
                    "label": 0
                },
                {
                    "sent": "Dio 22 is L10 where we got planes of one and planes of the other and so that would form with a one to one store Kiama tree.",
                    "label": 0
                },
                {
                    "sent": "And that's a common that's a common tetragonal structure tag.",
                    "label": 0
                },
                {
                    "sent": "And not something else.",
                    "label": 0
                },
                {
                    "sent": "That's that's exactly 1.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me talk a bit more about Magnus the gallium.",
                    "label": 0
                },
                {
                    "sent": "Even though it doesn't have the structure we want, this is the neutron diffraction pattern.",
                    "label": 1
                },
                {
                    "sent": "And you've got.",
                    "label": 0
                },
                {
                    "sent": "We've got two manganese sites, the Red one at the green one.",
                    "label": 0
                },
                {
                    "sent": "Under in the structure that twice as many green ones, 40s as there are red ones, two peas.",
                    "label": 0
                },
                {
                    "sent": "And the net moment it's very magnetic.",
                    "label": 0
                },
                {
                    "sent": "The net moment is about one bomanite on, and that's because we've got about 3 bomb and it turns on the B sides and two back Palmetta turns on the site and twice as many of those as those.",
                    "label": 0
                },
                {
                    "sent": "So the net moment is about plus one.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, that's bulk.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "There's not much chance of achieving what we want it seems in the book.",
                    "label": 0
                },
                {
                    "sent": "But we're talking about thin films were talking about spin electronics, so let's now go into the world of thin films.",
                    "label": 0
                },
                {
                    "sent": "And the beauty of thin films is that you have got.",
                    "label": 0
                },
                {
                    "sent": "A whole new degree of control over the phases you produce becausw they grow on a substrate.",
                    "label": 0
                },
                {
                    "sent": "And you can choose the substrate to be what you want.",
                    "label": 0
                },
                {
                    "sent": "To apply string.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The idea initially was to take manganese three gallium.",
                    "label": 0
                },
                {
                    "sent": "I'm good on the substrate, which wouldn't allow it to.",
                    "label": 0
                },
                {
                    "sent": "Deform tetragonally just keep it more or less stuck in a cubic structure and it takes some thickness before the strain relaxes.",
                    "label": 0
                },
                {
                    "sent": "Typically 10s of nanometers, and since we all need to need a few nanometers of these thin firms in spintronics, that is probably a reasonable proposition.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Look here, that's what we've got in terms of substrates.",
                    "label": 0
                },
                {
                    "sent": "There's lots of substrates, but mainly three gallium, the Dior 3, which is the cubic one, should have a lattice parameter times divided by root 3 or 4.22.",
                    "label": 0
                },
                {
                    "sent": "Actually, pretty much the same as Mgo.",
                    "label": 0
                },
                {
                    "sent": "And the deal 22 should have let us as a parameter see parameters different of 3.9 which is just about the same as Palladium platinum.",
                    "label": 0
                },
                {
                    "sent": "And vanadium is also a bit more than Mgo.",
                    "label": 0
                },
                {
                    "sent": "Chromium's of it so that you can play with buffer layers and try to try to get things to grow the way you want them to.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let me not.",
                    "label": 0
                },
                {
                    "sent": "Neighbor this point too much.",
                    "label": 0
                },
                {
                    "sent": "We can grow the DO 22 very nicely on.",
                    "label": 0
                },
                {
                    "sent": "Platinum is a few holes in the platinum, but we can.",
                    "label": 0
                },
                {
                    "sent": "We can make these films.",
                    "label": 0
                },
                {
                    "sent": "If we look at the magnetization, actually that's the boat.",
                    "label": 0
                },
                {
                    "sent": "Monetization.",
                    "label": 0
                },
                {
                    "sent": "It's a little bit strange because the moment is of course not.",
                    "label": 0
                },
                {
                    "sent": "Of course, it turns out to be perpendicular to the to the plane, 'cause we've got strong anisotropy along the tetragonal axis.",
                    "label": 0
                },
                {
                    "sent": "But what a little bit strange is, we have this moment.",
                    "label": 0
                },
                {
                    "sent": "Apparently in plane, and that's because it's not actually a collinear structure.",
                    "label": 0
                },
                {
                    "sent": "Came out to the neutron study.",
                    "label": 0
                },
                {
                    "sent": "Let me not go on.",
                    "label": 0
                },
                {
                    "sent": "A measurement which is very valuable.",
                    "label": 0
                },
                {
                    "sent": "Because from what I said at the beginning about spin polarization being important, we like to be able to measure that and a good way to measure the spin polarization is by point contact Andreev reflection.",
                    "label": 1
                },
                {
                    "sent": "This is a technique where we take a.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When we take a superconducting tip.",
                    "label": 0
                },
                {
                    "sent": "And we just make a contact point contact between the superconductor a ballistic or time contact between the superconductor and the ferromagnet.",
                    "label": 0
                },
                {
                    "sent": "And the superconductor, typically niobium, has got this one electron density of states like this, where we got Cooper pairs down here and we've got this this superconducting gap.",
                    "label": 0
                },
                {
                    "sent": "And a normal metal.",
                    "label": 0
                },
                {
                    "sent": "If an electron tunnels over into the superconductor, it has to actually pair up.",
                    "label": 0
                },
                {
                    "sent": "So what happens is the supermarket ejects a whole the other way, so.",
                    "label": 0
                },
                {
                    "sent": "The conductivity when we bust this junction below the gap is twice as large as the.",
                    "label": 0
                },
                {
                    "sent": "As the.",
                    "label": 0
                },
                {
                    "sent": "The conductivity, if we were simply pushing the electrons into the into the normal one electron density of states.",
                    "label": 0
                },
                {
                    "sent": "However, if it was a half metal.",
                    "label": 0
                },
                {
                    "sent": "You can see.",
                    "label": 0
                },
                {
                    "sent": "We've tunnel in an electron.",
                    "label": 0
                },
                {
                    "sent": "There's nowhere for the whole to go.",
                    "label": 0
                },
                {
                    "sent": "With the opposite spin.",
                    "label": 0
                },
                {
                    "sent": "So in principle the conductivity should be 0 for hard metal.",
                    "label": 0
                },
                {
                    "sent": "And this is a very neat and simple way to determine what the spin polarization is by taking the measured conductivity and just taking ratios.",
                    "label": 0
                },
                {
                    "sent": "And in fact, if you take one of the classic half metals which is O2, chromium dioxide and you do this experiment, you measure practically no conductivity and spin polarization of 95%.",
                    "label": 0
                },
                {
                    "sent": "Of course it's all done.",
                    "label": 0
                },
                {
                    "sent": "Below the TSC of niobium it's all done it.",
                    "label": 0
                },
                {
                    "sent": "Helium temperatures and at room temperature of the story may be different, but it's a good method and it gets it gives us.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Information.",
                    "label": 0
                },
                {
                    "sent": "Alright to go on?",
                    "label": 0
                },
                {
                    "sent": "If these are manganese, two gallium films grown on Mgo, they actually turn out to be tetragonal.",
                    "label": 1
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But what is not tetragonal?",
                    "label": 0
                },
                {
                    "sent": "We can grow both CU, manganese, three gallium and manganese, two gallium and manganese, two ruthenium, gallium on appropriate substrates, which I won't bother you with.",
                    "label": 0
                },
                {
                    "sent": "No, unfortunately when we make the cubic manganese three gallium.",
                    "label": 0
                },
                {
                    "sent": "It doesn't have zero mode, so the rationale that got us this far turned out to be not quite right.",
                    "label": 0
                },
                {
                    "sent": "In fact, we're just we're just outside the gap.",
                    "label": 0
                },
                {
                    "sent": "However.",
                    "label": 0
                },
                {
                    "sent": "What's clear is that the moment of manganese, two gallium, and manganese three gallium are opposite in sign and Magnes, two ruthenium gallium.",
                    "label": 0
                },
                {
                    "sent": "Is actually smaller than that of manganese.",
                    "label": 0
                },
                {
                    "sent": "Well, it's about the same as buying these three gallon, but it's it's the opposite time to make these two gallons.",
                    "label": 0
                },
                {
                    "sent": "So if you if you just look at that and you believe those things have opposites and then you.",
                    "label": 0
                },
                {
                    "sent": "Guess that by changing the the ruthenium concentration, you could just engineer the gap to be 0.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's the end of the first part.",
                    "label": 0
                },
                {
                    "sent": "So now I'm going to talk about MRG.",
                    "label": 0
                },
                {
                    "sent": "Here he is again and he's his composition is something like manganese, two ruthenium 1/2 gallon.",
                    "label": 0
                },
                {
                    "sent": "Now if you count the electrons there.",
                    "label": 0
                },
                {
                    "sent": "You will find you may remember I said 24 is the magic number for full heusler.",
                    "label": 0
                },
                {
                    "sent": "And 18 for half heusler.",
                    "label": 0
                },
                {
                    "sent": "So if we were exactly in between, it should be 21 and this competition has got 21 electrons.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we can also call it the compensated ferrimagnetic half metal, depending whichever one you like.",
                    "label": 1
                },
                {
                    "sent": "A fairly magnet has got two oppositely.",
                    "label": 0
                },
                {
                    "sent": "Alone sublattices.",
                    "label": 0
                },
                {
                    "sent": "And if at some temperature they just happen to have the same magnitude, then we say the fairy magnet is compensated.",
                    "label": 0
                },
                {
                    "sent": "The moment goes to 0.",
                    "label": 0
                },
                {
                    "sent": "And that's interesting because when the moment goes to zero, coercivity goes to Infinity.",
                    "label": 0
                },
                {
                    "sent": "So we're going to be crossing the spin gap with ruthenium using CU manganese rich heusler.",
                    "label": 1
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Films with.",
                    "label": 0
                },
                {
                    "sent": "Ruthenium.",
                    "label": 0
                },
                {
                    "sent": "Here's a electronic structure calculation which gives us some encouragement.",
                    "label": 1
                },
                {
                    "sent": "This is actually for manganese two gather in cubic manganese, two gallium.",
                    "label": 0
                },
                {
                    "sent": "There is a spin gap.",
                    "label": 0
                },
                {
                    "sent": "It is not in the right place, it's just above the Fermi level.",
                    "label": 0
                },
                {
                    "sent": "So we need we need to.",
                    "label": 0
                },
                {
                    "sent": "We need to basically fill up these States and get the Fermi level into the spin gap, so that's the rationale.",
                    "label": 1
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is a story about growing them.",
                    "label": 0
                },
                {
                    "sent": "The point is that.",
                    "label": 0
                },
                {
                    "sent": "They are cubic, but they are a little bit strained, and that's very important because we need them to be slightly strained.",
                    "label": 0
                },
                {
                    "sent": "We need them to be slightly tetragonal, 'cause we need a little bit of an insult to be to make the moment point out of the plane.",
                    "label": 0
                },
                {
                    "sent": "Of course, the moment is very small, so the demagnetizing effects are are.",
                    "label": 0
                },
                {
                    "sent": "A vanishingly small, but we want for spintronics, as I mentioned at the beginning, we like the moments to be perpendicular.",
                    "label": 0
                },
                {
                    "sent": "And this we can achieve by using the right the right substrates and you can see that suffice.",
                    "label": 0
                },
                {
                    "sent": "Can it really is?",
                    "label": 0
                },
                {
                    "sent": "It's really got fourfold symmetry, as you'd expect.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is the.",
                    "label": 0
                },
                {
                    "sent": "This is the atomic structure of manganese, two ruthenium gallium with 25 electrons.",
                    "label": 1
                },
                {
                    "sent": "And then if I take half of the ruthenium out, that's manganese, two ruthenium not .5 gallon with 21 electrons.",
                    "label": 0
                },
                {
                    "sent": "And as I said we we expect 21 would be the would be the magic number and we got this biaxial strain.",
                    "label": 0
                },
                {
                    "sent": "About about 1%.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Those are electronic structure calculations which indicate that.",
                    "label": 0
                },
                {
                    "sent": "We're certainly in the ballpark for a spin Gov.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here are the data.",
                    "label": 0
                },
                {
                    "sent": "And let me just go through this step by step.",
                    "label": 0
                },
                {
                    "sent": "First of all.",
                    "label": 0
                },
                {
                    "sent": "Look at the Curie temperature, that's the blue one, right?",
                    "label": 0
                },
                {
                    "sent": "So even though the end one, manganese two gatherings only got the cure temperature of 200 degrees once we get.",
                    "label": 0
                },
                {
                    "sent": "Above .3 the Curie temperatures are five or 600 kelvins, so that's OK. That's comfortable.",
                    "label": 0
                },
                {
                    "sent": "We can use that.",
                    "label": 0
                },
                {
                    "sent": "Next the magnet is 2 gallium.",
                    "label": 0
                },
                {
                    "sent": "I said it's got a big moment.",
                    "label": 0
                },
                {
                    "sent": "But when we come near .5, you can see the moment is disappeared practically.",
                    "label": 0
                },
                {
                    "sent": "And if I plot then the moment.",
                    "label": 0
                },
                {
                    "sent": "As in Pomona transfer formula as a function of X, which is the number of States and electrons we've introduced with the ruthenium, then this red line is what we would expect if we were crossing the spin gap I.",
                    "label": 0
                },
                {
                    "sent": "In this region.",
                    "label": 0
                },
                {
                    "sent": "Shaded Gray the system is 1/2 metal.",
                    "label": 0
                },
                {
                    "sent": "As we increase X, we raised the Fermi level.",
                    "label": 0
                },
                {
                    "sent": "We could into the gap in the Gray region and then if we put more we get out of it again.",
                    "label": 0
                },
                {
                    "sent": "So this is the region where we expect that we have our half metal.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is what the half metal should be like.",
                    "label": 0
                },
                {
                    "sent": "It's got known that moments or produces no stray field, however.",
                    "label": 0
                },
                {
                    "sent": "One of the one of the Maganese Sublattices.",
                    "label": 0
                },
                {
                    "sent": "Hi Scott electrons at the Fermi level and the other one.",
                    "label": 0
                },
                {
                    "sent": "Hasn't so we've got these two sublattices that inequivalent, so it's not an antiferromagnet.",
                    "label": 0
                },
                {
                    "sent": "There's no crystal inkwell.",
                    "label": 0
                },
                {
                    "sent": "There's no crystallographic equivalence between the two magnets sites in high structure.",
                    "label": 0
                },
                {
                    "sent": "And there's no symmetry relation between the two sides.",
                    "label": 0
                },
                {
                    "sent": "It just happened to have this.",
                    "label": 0
                },
                {
                    "sent": "Integral spin moment, which in this case if we choose the compound right is 0.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Note half metals have been with us for a long time and it's always been a little bit difficult to say what is this smoking gun?",
                    "label": 0
                },
                {
                    "sent": "Experimental proof that you've got a half metal?",
                    "label": 0
                },
                {
                    "sent": "I mean, how do you know you've only got one spin of electrons at the firm level?",
                    "label": 0
                },
                {
                    "sent": "Well, let me show you some things so we can use this as our system because we can.",
                    "label": 0
                },
                {
                    "sent": "We can change the composition.",
                    "label": 0
                },
                {
                    "sent": "So point 83.",
                    "label": 0
                },
                {
                    "sent": "We're not in the half metallic region .30 three we are.",
                    "label": 1
                },
                {
                    "sent": "Let's go back there.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "33 is here it's that .80 three is there so 33 is in the spin gap, 83 is not.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What's the difference?",
                    "label": 0
                },
                {
                    "sent": "Well, first of all, look at the resistance as a function of temperature.",
                    "label": 0
                },
                {
                    "sent": "They look pretty much the same, except this one.",
                    "label": 0
                },
                {
                    "sent": "Which is the normal ferromagnet?",
                    "label": 0
                },
                {
                    "sent": "Just got a big money to resistance and the half metal doesn't have any at all practically.",
                    "label": 0
                },
                {
                    "sent": "And that's not surprising because you apply a field it you know it doesn't change the electrons at the Fermi level.",
                    "label": 0
                },
                {
                    "sent": "Another thing is the anomalous Hall effect.",
                    "label": 1
                },
                {
                    "sent": "Now this is really useful when we're measuring confirms, because you don't want to measure the magnetization of things in the squid.",
                    "label": 0
                },
                {
                    "sent": "It would take you forever and cost you a fortune.",
                    "label": 0
                },
                {
                    "sent": "You can make an electrical measurement and there is a term in the whole effect.",
                    "label": 0
                },
                {
                    "sent": "Which is proportional to the magnetization, which is out of the plane.",
                    "label": 0
                },
                {
                    "sent": "And so simply by making the electrical measurement you can determine what is.",
                    "label": 0
                },
                {
                    "sent": "The perpendicular moment.",
                    "label": 0
                },
                {
                    "sent": "But it's not.",
                    "label": 0
                },
                {
                    "sent": "Of course, the total moment it's the perpendicular moment of the sub lattice which is got electrons at the Fermi level which is contributing to the anomalous Hall effect.",
                    "label": 0
                },
                {
                    "sent": "So we can actually measure the perpendicular moment of.",
                    "label": 0
                },
                {
                    "sent": "One of the sublattices through the transition.",
                    "label": 0
                },
                {
                    "sent": "Note, since you measure this with respect to an external field as you go through the.",
                    "label": 0
                },
                {
                    "sent": "As you go through the compensation, either is a function of concentration or temperature.",
                    "label": 0
                },
                {
                    "sent": "Then this anomalous Hall is going to switch the hysteresis loop is going to go from one like this to one like that.",
                    "label": 0
                },
                {
                    "sent": "And I'll show you intersected, that's exactly what happens.",
                    "label": 0
                },
                {
                    "sent": "But the other point is that the anomalous Hall effect is much, much bigger than usual.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's it's 10 times bigger here than it is there, and it's.",
                    "label": 0
                },
                {
                    "sent": "In emoji, it's about 10 times what it is in our norcold, so that's that's an indication.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's the story about anomalous hole, and this shows you what the anomalous whole hysteresis loop looks like.",
                    "label": 0
                },
                {
                    "sent": "As you go through compensation, not.",
                    "label": 0
                },
                {
                    "sent": "I said that the.",
                    "label": 0
                },
                {
                    "sent": "Compensation.",
                    "label": 0
                },
                {
                    "sent": "Ideally, is a T = 0.",
                    "label": 0
                },
                {
                    "sent": "These are two different sublattices.",
                    "label": 0
                },
                {
                    "sent": "They're going to have different exchange interactions and therefore they're going to have different temperature depends, so if they compensate at T = 0, they're not going to compensate it some other temperature.",
                    "label": 0
                },
                {
                    "sent": "Well, if they just don't quite compensate that equals zero, we can arrange that at some temperature they will compensate, and that's what we're doing in this case.",
                    "label": 0
                },
                {
                    "sent": "This has been fixed or the compensation is just above room temperature, and these are the essentially the perpendicular hysteresis loops.",
                    "label": 0
                },
                {
                    "sent": "You can see that it's which sign as we go through the compensation, and the other thing is add compensation for the moment goes to zero.",
                    "label": 0
                },
                {
                    "sent": "Notice the coercivity is 14 Tesla.",
                    "label": 0
                },
                {
                    "sent": "It's incredibly stable.",
                    "label": 0
                },
                {
                    "sent": "And the reason it's so?",
                    "label": 0
                },
                {
                    "sent": "The reason is so huge is because the UN isotropy field the coercivity will be maybe 10 or 20% of the nice not to be filled.",
                    "label": 0
                },
                {
                    "sent": "The only thought to be field is 2 K 1 / M S. Images are not marked as a shun, we just going to zero.",
                    "label": 0
                },
                {
                    "sent": "K1 is the isotropy.",
                    "label": 0
                },
                {
                    "sent": "I said we've arranged for it to have a little under soldier because we've made it slightly tetragonal.",
                    "label": 0
                },
                {
                    "sent": "So two K 1 / M S diverges at compensation and so we get this extraordinary insensitivity.",
                    "label": 0
                },
                {
                    "sent": "To external fields and stability of the magnetization.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the same thing, except instead of changing temperature, we're changing composition, and this is probably at room temperature, and we're scanning through.",
                    "label": 0
                },
                {
                    "sent": "In this case, the compensation concentration is .69 bedroom temp.",
                    "label": 0
                },
                {
                    "sent": "And you can see these loops.",
                    "label": 0
                },
                {
                    "sent": "First of all, they got lots of hysteresis and they've and they switched.",
                    "label": 0
                },
                {
                    "sent": "So, as I say, the K1 is about 30 kilo joules per cubic meter in these forms.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "This is giving you a little bit of of a feeling for how the material is behaving now.",
                    "label": 0
                },
                {
                    "sent": "The next question is of course.",
                    "label": 0
                },
                {
                    "sent": "And then you can think what you might do with it, because you've got this thin film, which can be a source of spin polarized electrons.",
                    "label": 0
                },
                {
                    "sent": "In principle, 100% spin polarized electrons, which we can use as a spin polarized electron source in the tunnel junction or whatever.",
                    "label": 0
                },
                {
                    "sent": "So the next step will be to make magnetic tunnel junctions.",
                    "label": 0
                },
                {
                    "sent": "And get in touch with your favorite semiconductor company.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have just recently succeeded in making magnetic tunnel junctions.",
                    "label": 0
                },
                {
                    "sent": "And these are known as pseudospin valves.",
                    "label": 0
                },
                {
                    "sent": "They're actually very beautiful curves, but the magnetoresistance is not 200%, it's 10%.",
                    "label": 0
                },
                {
                    "sent": "So this we have to improve, we started off at point 1%.",
                    "label": 0
                },
                {
                    "sent": "We've got to tend.",
                    "label": 0
                },
                {
                    "sent": "It's pretty good.",
                    "label": 0
                },
                {
                    "sent": "Can we get 200?",
                    "label": 0
                },
                {
                    "sent": "Who knows?",
                    "label": 0
                },
                {
                    "sent": "But there's a particular difficulty with manganese alloys.",
                    "label": 0
                },
                {
                    "sent": "And the particular difficulty with nice alloys.",
                    "label": 0
                },
                {
                    "sent": "Anybody who's ever been near a semiconductor fab will know that they they just don't want to know about it because it gets everywhere.",
                    "label": 0
                },
                {
                    "sent": "It diffuses very, very easily.",
                    "label": 0
                },
                {
                    "sent": "And so if a bit of a little bit of manganese magnetic ions diffuse into the tunnel barrier, there likely to destroy the nice.",
                    "label": 0
                },
                {
                    "sent": "Spin filtering properties of the tunnel barrier.",
                    "label": 0
                },
                {
                    "sent": "They're just going to produce spin scattering.",
                    "label": 0
                },
                {
                    "sent": "So there's a technical challenge which which we're working through underground to try to.",
                    "label": 0
                },
                {
                    "sent": "Prevent manganese diffusion with very thin diffusion barriers.",
                    "label": 0
                },
                {
                    "sent": "In this case, it will be tantalum and it can be.",
                    "label": 0
                },
                {
                    "sent": "It can be too optimistic.",
                    "label": 0
                },
                {
                    "sent": "Yes, we want that.",
                    "label": 0
                },
                {
                    "sent": "That diffusion barrier and that works.",
                    "label": 0
                },
                {
                    "sent": "It's astonishing that we can use .8 now for days nanometers of tantalum, between MRG and NGO or MRG and Copeland born.",
                    "label": 0
                },
                {
                    "sent": "And it really, really stops the diffusion of magnets across it.",
                    "label": 0
                },
                {
                    "sent": "But we also don't want to do this.",
                    "label": 0
                },
                {
                    "sent": "We don't want to destroy the spin filtering properties of the interface, so that's a challenge to get this number bigger.",
                    "label": 0
                },
                {
                    "sent": "But this is already.",
                    "label": 0
                },
                {
                    "sent": "This is already a large enough tunnel magnetoresistance for what?",
                    "label": 0
                },
                {
                    "sent": "We believe is going to be the main.",
                    "label": 0
                },
                {
                    "sent": "Use of this material and I'll come to that now in the.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is more stuff if you know about tunnel junctions.",
                    "label": 0
                },
                {
                    "sent": "It's very very bias dependent, which is not not usually a good thing.",
                    "label": 0
                },
                {
                    "sent": "There's this shop full off of the.",
                    "label": 0
                },
                {
                    "sent": "Tunnel like these resistance at 10K with.",
                    "label": 0
                },
                {
                    "sent": "The bias you apply and that's relating of course to just where the family level is.",
                    "label": 0
                },
                {
                    "sent": "If you apply a large negative bias, you actually have something which is more stable in temperature and.",
                    "label": 0
                },
                {
                    "sent": "Shows a larger TMR of minus, minus 12% at room temperature.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright, I'll go quickly through the next bit, which is.",
                    "label": 0
                },
                {
                    "sent": "Which is a.",
                    "label": 0
                },
                {
                    "sent": "A careful study.",
                    "label": 0
                },
                {
                    "sent": "Of the.",
                    "label": 0
                },
                {
                    "sent": "30 magnetic structure using synchrotron methods using X Ray absorption spectroscopy and X Ray magnetic circular dichroism X MCD is, as you probably know, a way that you can determine both the spin in the orbital moment.",
                    "label": 1
                },
                {
                    "sent": "In an alloy element specific.",
                    "label": 0
                },
                {
                    "sent": "By measuring the right, and that's been polarized X Ray absorption.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "The trouble here is in principle we should be able to distinguish the two magnet sites 'cause there crystallographically inequivalent.",
                    "label": 0
                },
                {
                    "sent": "But they're not very.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Far apart, if you look at the X Ray absorption of the two magnet sites, the foray into four see they are overlapping, so we're going to try to do a job.",
                    "label": 0
                },
                {
                    "sent": "D. Convoluting these XM CD Spectra so as to get the moment.",
                    "label": 0
                },
                {
                    "sent": "On one manganese at the moment on the other menus.",
                    "label": 0
                },
                {
                    "sent": "And we've done that.",
                    "label": 0
                },
                {
                    "sent": "It's been that's basically the X MCD signal.",
                    "label": 0
                },
                {
                    "sent": "It's the sum of those two things.",
                    "label": 1
                },
                {
                    "sent": "We measure in total electron yield, so we only are picking out information.",
                    "label": 0
                },
                {
                    "sent": "There's a cap layer of a couple of nanometers and we're only looking at the first few nanometers of the thin film.",
                    "label": 0
                },
                {
                    "sent": "It's a perfect method for measuring magnetization in thin films.",
                    "label": 0
                },
                {
                    "sent": "It's done it in granola.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or in the.",
                    "label": 0
                },
                {
                    "sent": "Exactly.",
                    "label": 0
                },
                {
                    "sent": "It's early.",
                    "label": 0
                },
                {
                    "sent": "Here are the Spectra.",
                    "label": 0
                },
                {
                    "sent": "This is the XM CD signal versus temperature and you can see.",
                    "label": 0
                },
                {
                    "sent": "It's inverting as we go through the compensation he's going from the red curves to the green ones, or as a function of concentration.",
                    "label": 1
                },
                {
                    "sent": "It's inverting as well.",
                    "label": 0
                },
                {
                    "sent": "Position again going from the red curve to the green curve, so that's all behaving exactly like we expected.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we pick out the moment on the two on the two sublattices and what we find actually is that one of them.",
                    "label": 0
                },
                {
                    "sent": "It's probably it's the four A is rather independent temperature.",
                    "label": 0
                },
                {
                    "sent": "And the other one, which is the 4C is rather temperature dependent, and for that this particular composition they compensation occurs just about at room temperature.",
                    "label": 0
                },
                {
                    "sent": "So that's that's all working.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is something I don't have time to talk about.",
                    "label": 0
                },
                {
                    "sent": "It's actually not finished.",
                    "label": 0
                },
                {
                    "sent": "This is TR MC to look at the spin dynamics.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let me just now we're coming to the end.",
                    "label": 0
                },
                {
                    "sent": "Let me take the last few minutes and ask the question what could it be good for?",
                    "label": 1
                },
                {
                    "sent": "I mean obviously to have A to have.",
                    "label": 0
                },
                {
                    "sent": "A magnetically a perpendicular magnetically ordered layer in a stack.",
                    "label": 0
                },
                {
                    "sent": "Which is stable.",
                    "label": 0
                },
                {
                    "sent": "And connected the source of spin polarized electrons would be good actually.",
                    "label": 0
                },
                {
                    "sent": "In the stack I showed you at the beginning there there's a part of it, the synthetic antiferromagnet and the and the exchange bias layer.",
                    "label": 0
                },
                {
                    "sent": "Four layers could in principle be replaced by this one layer.",
                    "label": 0
                },
                {
                    "sent": "But that's not the that's not the most important thing.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also, you can imagine.",
                    "label": 0
                },
                {
                    "sent": "Using this ultra ultra stability ultra high stability.",
                    "label": 0
                },
                {
                    "sent": "Of energy with respect to external fields to redesign MRAM either using thermal.",
                    "label": 1
                },
                {
                    "sent": "The assisted switching because we can play with the temperature and place ourselves on one side or the other of the compensation, or by using spin transfer, torque switching.",
                    "label": 1
                },
                {
                    "sent": "And this can be done in a unipolar way.",
                    "label": 0
                },
                {
                    "sent": "You can do bipolar writing using pulses of the same sign but different levels.",
                    "label": 1
                },
                {
                    "sent": "But that's not even that's not.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But it's going to be out where it's going to be out is this.",
                    "label": 0
                },
                {
                    "sent": "Electronics and the Big data revolution.",
                    "label": 0
                },
                {
                    "sent": "Everybody knows how have depended on Moore's law.",
                    "label": 0
                },
                {
                    "sent": "Moore's Law is the.",
                    "label": 0
                },
                {
                    "sent": "Doubling of semiconductors density every 18 months.",
                    "label": 0
                },
                {
                    "sent": "And that's one part of it, and the other part of it.",
                    "label": 0
                },
                {
                    "sent": "The other pillar on which the big Data revolution is based is semiconductors.",
                    "label": 0
                },
                {
                    "sent": "On the one hand, magnetic recording on the other and magnetic recording.",
                    "label": 0
                },
                {
                    "sent": "Has also followed.",
                    "label": 0
                },
                {
                    "sent": "Equivalent sort of Moore's law.",
                    "label": 0
                },
                {
                    "sent": "Even a bit better and has doubled for a long time every 18 months.",
                    "label": 0
                },
                {
                    "sent": "And don't forget that everything you ever download on your computer.",
                    "label": 0
                },
                {
                    "sent": "Is stored on hard disks in servers somewhere, that's that's why it's so important.",
                    "label": 0
                },
                {
                    "sent": "That's why that's why hard disk recording, even though it seems primitive and extraordinary, that using these mechanical things to do this, this has kept pace and the whole big data revolution is based on those two things.",
                    "label": 0
                },
                {
                    "sent": "However.",
                    "label": 0
                },
                {
                    "sent": "There's one thing that's.",
                    "label": 0
                },
                {
                    "sent": "Been left out of the.",
                    "label": 0
                },
                {
                    "sent": "Account.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "It's becoming more and more a bottleneck.",
                    "label": 0
                },
                {
                    "sent": "And that's the data rate.",
                    "label": 0
                },
                {
                    "sent": "The rate at which you can transmit data from chip to chip.",
                    "label": 0
                },
                {
                    "sent": "And that should also for everything to go hand in hand.",
                    "label": 0
                },
                {
                    "sent": "That should also follow a Moore's law.",
                    "label": 0
                },
                {
                    "sent": "It should be doubling every one or two years.",
                    "label": 0
                },
                {
                    "sent": "And it's not.",
                    "label": 0
                },
                {
                    "sent": "It's got stuck at about some 10s of giga Hertz.",
                    "label": 0
                },
                {
                    "sent": "You know from that's what your clocks have been for a long time.",
                    "label": 0
                },
                {
                    "sent": "In your computers.",
                    "label": 0
                },
                {
                    "sent": "So what we need to do is we need to be.",
                    "label": 0
                },
                {
                    "sent": "We need to develop.",
                    "label": 0
                },
                {
                    "sent": "A new way of transmitting data chip to chip, which is stable and which can take us in well above 100.",
                    "label": 0
                },
                {
                    "sent": "Giga Hertz preferably into the terrorists region and this is the this is the famous terahertz gap.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "Terahertz radiation exists, of course.",
                    "label": 0
                },
                {
                    "sent": "I mean, when you go to the airport and you do this in the machine.",
                    "label": 0
                },
                {
                    "sent": "That's a terahertz.",
                    "label": 0
                },
                {
                    "sent": "Source which is image in your body, right?",
                    "label": 0
                },
                {
                    "sent": "But that's not appropriate at chip level.",
                    "label": 0
                },
                {
                    "sent": "You need something which is Silicon compatible thin film.",
                    "label": 0
                },
                {
                    "sent": "And this.",
                    "label": 0
                },
                {
                    "sent": "And well, there's no obvious.",
                    "label": 0
                },
                {
                    "sent": "There's no obvious solution.",
                    "label": 0
                },
                {
                    "sent": "There's that sufficiently stable.",
                    "label": 0
                },
                {
                    "sent": "But possibly this is so we're suggesting that the.",
                    "label": 0
                },
                {
                    "sent": "And the resonance frequency of these of these zero moment half methods.",
                    "label": 0
                },
                {
                    "sent": "Just like the resonance frequency of of an antiferromagnet is not determined.",
                    "label": 1
                },
                {
                    "sent": "By the net monetization.",
                    "label": 0
                },
                {
                    "sent": "It's not 10 giga Hertz, which is FMR frequency of of iron.",
                    "label": 0
                },
                {
                    "sent": "It's determined by the exchange by the exchange between the two sublattices, and by then I surgery.",
                    "label": 0
                },
                {
                    "sent": "So in principle we should be able to.",
                    "label": 0
                },
                {
                    "sent": "Have to create a territory later like this.",
                    "label": 0
                },
                {
                    "sent": "Just take a reference reference layer pinned like this and here's our energy, which will be oscillating.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's not perpendicular one sublattices perpendicular, but it's got known that moment, but nevertheless the the resistance of this device is going to be modulated at the frequency that it's oscillating here, so we can.",
                    "label": 0
                },
                {
                    "sent": "Imagine this as a dirt also later within with it with an antenna and just over there on the next on the next circuit is a detector where we pick up this.",
                    "label": 0
                },
                {
                    "sent": "Where we pick up this this radiation and we.",
                    "label": 0
                },
                {
                    "sent": "Rectified and because I began to voltage.",
                    "label": 0
                },
                {
                    "sent": "No, we're just beginning to get data to show that this is plausable.",
                    "label": 0
                },
                {
                    "sent": "This is actually a thin film of a magnet is gallium alloy.",
                    "label": 0
                },
                {
                    "sent": "It's been.",
                    "label": 0
                },
                {
                    "sent": "This is something that's just been measured at the free electron laser in.",
                    "label": 0
                },
                {
                    "sent": "Dresden and we've got a nice.",
                    "label": 1
                },
                {
                    "sent": "A nice rest instead 490 GHz.",
                    "label": 0
                },
                {
                    "sent": "In principle we calculate for energy this should be at about 7:00 or 800.",
                    "label": 0
                },
                {
                    "sent": "So there's the possibility then, that we're going to use this to breach the terahertz gap and give big data another 20 years.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that's what we're doing.",
                    "label": 0
                },
                {
                    "sent": "Here is the summary you can read quickly.",
                    "label": 0
                },
                {
                    "sent": "So the first example of this era moment, half metal, we can grow them on Mgo?",
                    "label": 1
                },
                {
                    "sent": "They've got perpendicular.",
                    "label": 1
                },
                {
                    "sent": "Nice not to be scared of decent Curie temperature.",
                    "label": 0
                },
                {
                    "sent": "The Fermi level spin polarization is around 60%, maybe better.",
                    "label": 1
                },
                {
                    "sent": "It creates no stray field.",
                    "label": 0
                },
                {
                    "sent": "It's immune to external field.",
                    "label": 1
                },
                {
                    "sent": "It can serve as the pin layer in these stacks, but best of all, it could actually give us the prospect of.",
                    "label": 0
                },
                {
                    "sent": "Terrorists.",
                    "label": 0
                },
                {
                    "sent": "Datarates",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's our Institute in Dublin.",
                    "label": 0
                },
                {
                    "sent": "That's the cutting edge of science we think.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there's Mr. MRG and myself, thank you.",
                    "label": 0
                }
            ]
        }
    }
}