{
    "id": "5dpawpu4ekzgxgddq67tfyiwlbhadkgu",
    "title": "Assessing behaviour in ALS: the importance of using disease-specific tools",
    "info": {
        "author": [
            "Marta Pinto-Grau, Trinity Biomedical Sciences Institute, Trinity College Dublin"
        ],
        "published": "July 21, 2017",
        "recorded": "May 2017",
        "category": [
            "Top->Medicine",
            "Top->Medicine->Neuroscience"
        ]
    },
    "url": "http://videolectures.net/encals2017_pinto_grau_assessing_behaviour/",
    "segmentation": [
        [
            "So thanks very much.",
            "The organization first of all, for allowing us to present this today and the title of my talk is assessing behavior, analyze the importance of using this specific tools.",
            "Some basically going to present the Bowman behavior inventory.",
            "This is an LS specific behavioral assessment that we recently developed and validated, so we're going to have a look at that."
        ],
        [
            "So I'll as an FTD, as we've seen they are two overlapping this panel types and they can.",
            "They can place along a continuum so they overlap both genetically as well as pathologically, but they also."
        ],
        [
            "Overlap clinically OK, so both of these can place along this.",
            "Continuum of clinical symptoms right in the middle.",
            "We have patients who meet criteria for both ILS under temporal dementia.",
            "Going down the continuum.",
            "This way, we have patients who may have made criteria for cognitive impairment be hearing impairment, or both, but they do not meet criteria for dementia and just down at the very end.",
            "Here we have patients who present with allies by digital present with any cognitive or behavioral symptoms.",
            "So one of the largest population based studies of cognition in ILS showed that about 13% of incident paced patients and meeting criteria for ALS also met criteria for behavior in frontotemporal dementia.",
            "These.",
            "Here corresponds to.",
            "This part here of the continuum.",
            "But as I said, that is also good feel.",
            "Patience which can be placed right in here which do meet criteria for behavioral impairment, but they do not meet criteria for dementia, so a recent population based studies have shown that about 30% of patients with ILS also presented with mild behavioral impairment, which do not meet criteria for dementia and they would replace in that part here to continue.",
            "And then we see here the severe ones also.",
            "Correspond to this part here.",
            "So if we."
        ],
        [
            "Have a look now at the revised strong criteria for the diagnosis of neuropsychological deficits in LF, specifically to the diagnosis of LSP ILS behavioral impairment.",
            "We do see that the main items consider are mainly apathy, which is the most commonly reported symptom in ILS, with or without any other behavioral change or the presence of two or more of the following symptoms.",
            "So this division lots of sympathy or empathy perseverative stereotyped or compulsive behavior, hyperactivity, or dietary changes.",
            "Loss of insight.",
            "Or psychotic symptoms, somatic delusions, hallucinations, and irrational beliefs.",
            "So most of these are drawn from the revised criteria for the for the diagnosis of behavior.",
            "FTD Ross kowski criteria."
        ],
        [
            "So assessing the here and I'll ask is fundamental because of they've been saying this has important implications of this management at survival as well as caregiver burden and quality of life.",
            "But sometimes or in most cases detailed family interviews, which are the gold standard for diagnosing behaviors in LS are not feasible, specially in multidisciplinary clinic setting where there is a lot of people that patients need to see.",
            "So we found that there was a need for a self explanatory report that you could hand out to caregivers and.",
            "They could answer that just kind of like a first screening for behavioral changes, so when assessing behavior in a less, it is important to consider.",
            "Sam to determine so the baseline are promoted behavior as of the patients.",
            "So you need to make sure that any behaviors that report there are of new answer.",
            "They're not part of the personality of the patient that they are associated with the time of onset of ILS and that they are disabling or cause causing impairment to the patient.",
            "And how is important as well to consider potential confounds.",
            "So, for example, the effect that gives me respiratory dysfunction or physical dysfunction may have on behavior or even like the psychological reaction to the diagnosis.",
            "So some general behavioral assessments, such as the first we have been used in a less to assess behavior, but this ones do not control for all these potential confounds, so we did felt that it was important to develop Annihilus specific tool that would correct for that.",
            "So this is."
        ],
        [
            "The baby I come so this is how it looks, at least for space."
        ],
        [
            "And so the BBA is another specific.",
            "It's 41 items.",
            "As I said, it's self explanatory.",
            "It's Brooks report an.",
            "This is the behavior and you're right behavior.",
            "So from zero to three.",
            "So zero, meaning no changes.",
            "One mild to moderate three severe.",
            "So the items were phrased to control the effect of this.",
            "To control for the effect of this motor, confounding in behavior the behavior are related to sync to timeline.",
            "So if we go."
        ],
        [
            "Other just a second.",
            "We can see that we asked if any of these behaviors appeared in the last 10 years.",
            "This is basically to capture any behaviors that would have happened before the end of the more symptoms, but were not part of the promoted personality of patient.",
            "And then we have a second column here to assess anything that would have happened since the onset of the morning and disease.",
            "Sorry."
        ],
        [
            "And the cluster takes overall 510 minutes to complete."
        ],
        [
            "So in terms of selecting the items, the three modes use criteria for diagnosis of behavioral brain activity or frontal temporal over the generation where used on the BBA basically assesses as we can see the five main 5 minute assessment that we've seen are part of the revised criteria, and we also added a couple more.",
            "Of items that we do feel they are relevant for Alice patient as well and least and last year but not least psychotic symptoms which are relevant for C9 Northwest expression positive patients as well."
        ],
        [
            "So the baby has been validated against the first day.",
            "We just as I mentioned, it's a non ILS specific measure, so overly proof an adequate internal consistency.",
            "So we did that.",
            "This is part of this study and then a recent study which higher sample has proven even higher internal consistency, conversion and discriminate validity was also proven.",
            "So that baby, I highly correlated with the first be moderately correlated with the fab, which is a measure of frontal systems.",
            "But it's not a behavior specific measure.",
            "And the screaming abilities of their baby.",
            "I did not correlate with any demographic or clinical variables.",
            "So drawn from a healthy control sample of 78 healthy controls which were much the patient sample by age, gender, and education would run this code score which so we showed 88% sensitivity on 79% specificity, and then using the soup sample of patients who met criteria for ILS FD we created using Roku.",
            "Analysis are more specific at quarter for severe behavioral impairment.",
            "Which is concordant with diagnosis of ILS FTD.",
            "An that provide sensitivity of 90% and specificity of 96%, which is very good."
        ],
        [
            "So then we decided to move on a little bit and just re validate the BBA against another ILS specific tulkus we did.",
            "We did find that the use of the first speed, which is not specifically could create some confounding Sir, and we also wanted to explore and the ability of the baby I took after the whole spectrum of behavioral in changes in LS.",
            "Such is that we decided to validate against a LS FTK DLS of PDQ.",
            "It's a very robust psychometric tool that's that's one of the main reasons we chose it 'cause it's been validated very well, so we we did really like that part, so it's again and I'll especific behavioral measure.",
            "It has 25 items and its proxy report and the items were also phrase, so they were adjusted for the effect of modern funds on behavior.",
            "Again, internal consistency was very high, an same as the BBA.",
            "Has proven conversion on this criminality, so again highly correlated with other behavioral inferential measures, but it did not correlate with the LS, FRS or the hats."
        ],
        [
            "So for this hard continuation of the study, we recruited 60 consecutive patients fulfilling this girl criteria for ILS.",
            "They all attended the MMD National Clinic in Beaumont Hospital in Dublin.",
            "Exclusion criteria was diagnosis of any other neurological, psychiatric, or medical condition that affects cognition and behavior.",
            "9% of the patients Metroid revised criteria for diagnosis of behavioral variant FTD and the current campaign are campaigning.",
            "The patient completed both the BBA on the ILS FTK on the same clinic visit.",
            "The LSF arrest was completed by a subset of patients so 20 and demographic and clinical characteristics were obtained from the LS register."
        ],
        [
            "So just quick look at the characteristics of the sample so we see that most of them were male 70% only 30% were female.",
            "Age at the time of the assessment was about 65 years of education, 1380 onset 63.",
            "Most of them were spinal onset stories, about 30% vulgar, an 8% which was breathing answered.",
            "Age of Diagnosis, Route 64, and finally diagnostic delays.",
            "So time seems uncertain.",
            "Diagnosis was about 15 months."
        ],
        [
            "So in terms of correlation analysis, we corroborated the convert conversion and discriminative validity of the BBA.",
            "So again, the BBA highly correlated with the LS FTK.",
            "And there were no significant correlations with both demographic and clinical measures.",
            "So education Agent answered a diagnosis on LSF arrest.",
            "We did find a significant correlation with diagnostic delay and we put a size that so three of out of the five ILS FTD patients would have developed the cognitive symptoms.",
            "Symptoms before, so that delayed the diagnosis of a LS.",
            "So we actually repeated the correlational analysis.",
            "After excluding those five cases, and then we did find that then.",
            "There was no correlation with diagnostic delay and the exact same results were observed with the LS after cues."
        ],
        [
            "So having a look at their contingent contingency table we see.",
            "So this is people classified on the baby.",
            "I did these people testified on my LS FTK so we do see that everyone who are classified as normal on the BBA was also classified as normal on the ILS PDQ so there is no false negatives.",
            "So that brings down the sensitivity of 100% perfect sensitivity so the BBA is actually capturing all the cases of behavioral impairment.",
            "But if you have a look at this column here we do see that there is a.",
            "Sue Court of the patients who are classified as normal on the Allies to the queue, but they were abnormal on the BBI.",
            "OK, so that's what we could call false positives.",
            "And that's what brings our specificity abit down.",
            "OK so we decided then to have an exploratory analysis on those 17 gauge just to have a look qualitatively at what was going on for them.",
            "What?",
            "What were they reporting that somehow here may like this difference.",
            "So most of them aswell Haiti percent of these 17 patients.",
            "For patients who are who are diagnosed with mild behavioral changes, OK?"
        ],
        [
            "So did this, so we hire.",
            "Look at the 41 items on the BVI, and we looked on how frequently we were.",
            "They endorsed by this 17 patients.",
            "OK, so we do see that there is a few of them.",
            "There's a few of them that are actually like picking out that there were more frequently reported and when having a look at what those specific items where.",
            "We had a look what we see that it's from the the making more grammatical mistakes, inappropriate emotional display, diminished social interest, loss of interest or motivation, how their response to sensory stimuli or distract ability.",
            "So then we had a look of all of this.",
            "We wanted to know if the airlines have to queue was also measuring that or if there was anything from here that they allowed us to.",
            "The queue wasn't measuring.",
            "So as we can see, three of the items, the green ones are.",
            "The ones are also measured by the elastic you, but three of them, the red ones, were not measured by 8 at all, OK?",
            "So sorry.",
            "So this one here I want just to highlight this one here.",
            "This one is especially important not only because it's the most frequently reported, but also because if we go by."
        ],
        [
            "To the to the robust criteria for the diagnosis of a LS FTK.",
            "We can see that this diminished social interest is one of the core elements.",
            "To make a diagnosis of ALS, FTD or behavioral variant FTD on its own, so we do feel that this item here is especially important."
        ],
        [
            "So just.",
            "In general, we feel that general behavioral assessments which do not correct for the effects confounding effects of motor dysfunction I'll ask tend to overestimate behavioral changes in LS.",
            "Board scales that do not measure the whole spectrum of inheritance in LS tend to underestimate this, so we do feel that the BBA and specially this additional elements that we just mentioned improve the discriminatory power for mild behavioral changes.",
            "So it seems that the BBA is slightly more sensitive to model behavior changes compared to the LSF PDQ, so we do feel that the PBI is a simple to administer a less specific behavior.",
            "Proxy report.",
            "It has very adequate psychometric properties.",
            "On it seems to overcome both limitations we've mentioned before, so."
        ],
        [
            "So I want to acknowledge all of my colleagues in the amount of research team in in Dublin, Trinity College, specially Professor Orla Hardiman, Professional Pandaren look, tomorrow, Alamin Christy Supervisor, the clinical annual psychological aspects of the project, how entertaining Mr Ahmed Castellane, Mrs Sarah Connor Cousin involving all the data collection and data input process Doctor Tom Bergen.",
            "Finally Mark hovering who we supervise all the management aspects of the project, so thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So thanks very much.",
                    "label": 0
                },
                {
                    "sent": "The organization first of all, for allowing us to present this today and the title of my talk is assessing behavior, analyze the importance of using this specific tools.",
                    "label": 1
                },
                {
                    "sent": "Some basically going to present the Bowman behavior inventory.",
                    "label": 0
                },
                {
                    "sent": "This is an LS specific behavioral assessment that we recently developed and validated, so we're going to have a look at that.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'll as an FTD, as we've seen they are two overlapping this panel types and they can.",
                    "label": 0
                },
                {
                    "sent": "They can place along a continuum so they overlap both genetically as well as pathologically, but they also.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Overlap clinically OK, so both of these can place along this.",
                    "label": 0
                },
                {
                    "sent": "Continuum of clinical symptoms right in the middle.",
                    "label": 1
                },
                {
                    "sent": "We have patients who meet criteria for both ILS under temporal dementia.",
                    "label": 0
                },
                {
                    "sent": "Going down the continuum.",
                    "label": 0
                },
                {
                    "sent": "This way, we have patients who may have made criteria for cognitive impairment be hearing impairment, or both, but they do not meet criteria for dementia and just down at the very end.",
                    "label": 0
                },
                {
                    "sent": "Here we have patients who present with allies by digital present with any cognitive or behavioral symptoms.",
                    "label": 0
                },
                {
                    "sent": "So one of the largest population based studies of cognition in ILS showed that about 13% of incident paced patients and meeting criteria for ALS also met criteria for behavior in frontotemporal dementia.",
                    "label": 0
                },
                {
                    "sent": "These.",
                    "label": 0
                },
                {
                    "sent": "Here corresponds to.",
                    "label": 0
                },
                {
                    "sent": "This part here of the continuum.",
                    "label": 0
                },
                {
                    "sent": "But as I said, that is also good feel.",
                    "label": 0
                },
                {
                    "sent": "Patience which can be placed right in here which do meet criteria for behavioral impairment, but they do not meet criteria for dementia, so a recent population based studies have shown that about 30% of patients with ILS also presented with mild behavioral impairment, which do not meet criteria for dementia and they would replace in that part here to continue.",
                    "label": 0
                },
                {
                    "sent": "And then we see here the severe ones also.",
                    "label": 0
                },
                {
                    "sent": "Correspond to this part here.",
                    "label": 0
                },
                {
                    "sent": "So if we.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Have a look now at the revised strong criteria for the diagnosis of neuropsychological deficits in LF, specifically to the diagnosis of LSP ILS behavioral impairment.",
                    "label": 0
                },
                {
                    "sent": "We do see that the main items consider are mainly apathy, which is the most commonly reported symptom in ILS, with or without any other behavioral change or the presence of two or more of the following symptoms.",
                    "label": 1
                },
                {
                    "sent": "So this division lots of sympathy or empathy perseverative stereotyped or compulsive behavior, hyperactivity, or dietary changes.",
                    "label": 0
                },
                {
                    "sent": "Loss of insight.",
                    "label": 1
                },
                {
                    "sent": "Or psychotic symptoms, somatic delusions, hallucinations, and irrational beliefs.",
                    "label": 0
                },
                {
                    "sent": "So most of these are drawn from the revised criteria for the for the diagnosis of behavior.",
                    "label": 0
                },
                {
                    "sent": "FTD Ross kowski criteria.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So assessing the here and I'll ask is fundamental because of they've been saying this has important implications of this management at survival as well as caregiver burden and quality of life.",
                    "label": 0
                },
                {
                    "sent": "But sometimes or in most cases detailed family interviews, which are the gold standard for diagnosing behaviors in LS are not feasible, specially in multidisciplinary clinic setting where there is a lot of people that patients need to see.",
                    "label": 1
                },
                {
                    "sent": "So we found that there was a need for a self explanatory report that you could hand out to caregivers and.",
                    "label": 0
                },
                {
                    "sent": "They could answer that just kind of like a first screening for behavioral changes, so when assessing behavior in a less, it is important to consider.",
                    "label": 0
                },
                {
                    "sent": "Sam to determine so the baseline are promoted behavior as of the patients.",
                    "label": 0
                },
                {
                    "sent": "So you need to make sure that any behaviors that report there are of new answer.",
                    "label": 1
                },
                {
                    "sent": "They're not part of the personality of the patient that they are associated with the time of onset of ILS and that they are disabling or cause causing impairment to the patient.",
                    "label": 1
                },
                {
                    "sent": "And how is important as well to consider potential confounds.",
                    "label": 0
                },
                {
                    "sent": "So, for example, the effect that gives me respiratory dysfunction or physical dysfunction may have on behavior or even like the psychological reaction to the diagnosis.",
                    "label": 0
                },
                {
                    "sent": "So some general behavioral assessments, such as the first we have been used in a less to assess behavior, but this ones do not control for all these potential confounds, so we did felt that it was important to develop Annihilus specific tool that would correct for that.",
                    "label": 0
                },
                {
                    "sent": "So this is.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The baby I come so this is how it looks, at least for space.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so the BBA is another specific.",
                    "label": 0
                },
                {
                    "sent": "It's 41 items.",
                    "label": 0
                },
                {
                    "sent": "As I said, it's self explanatory.",
                    "label": 0
                },
                {
                    "sent": "It's Brooks report an.",
                    "label": 0
                },
                {
                    "sent": "This is the behavior and you're right behavior.",
                    "label": 0
                },
                {
                    "sent": "So from zero to three.",
                    "label": 0
                },
                {
                    "sent": "So zero, meaning no changes.",
                    "label": 0
                },
                {
                    "sent": "One mild to moderate three severe.",
                    "label": 0
                },
                {
                    "sent": "So the items were phrased to control the effect of this.",
                    "label": 0
                },
                {
                    "sent": "To control for the effect of this motor, confounding in behavior the behavior are related to sync to timeline.",
                    "label": 1
                },
                {
                    "sent": "So if we go.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Other just a second.",
                    "label": 0
                },
                {
                    "sent": "We can see that we asked if any of these behaviors appeared in the last 10 years.",
                    "label": 0
                },
                {
                    "sent": "This is basically to capture any behaviors that would have happened before the end of the more symptoms, but were not part of the promoted personality of patient.",
                    "label": 0
                },
                {
                    "sent": "And then we have a second column here to assess anything that would have happened since the onset of the morning and disease.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the cluster takes overall 510 minutes to complete.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in terms of selecting the items, the three modes use criteria for diagnosis of behavioral brain activity or frontal temporal over the generation where used on the BBA basically assesses as we can see the five main 5 minute assessment that we've seen are part of the revised criteria, and we also added a couple more.",
                    "label": 0
                },
                {
                    "sent": "Of items that we do feel they are relevant for Alice patient as well and least and last year but not least psychotic symptoms which are relevant for C9 Northwest expression positive patients as well.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the baby has been validated against the first day.",
                    "label": 0
                },
                {
                    "sent": "We just as I mentioned, it's a non ILS specific measure, so overly proof an adequate internal consistency.",
                    "label": 0
                },
                {
                    "sent": "So we did that.",
                    "label": 0
                },
                {
                    "sent": "This is part of this study and then a recent study which higher sample has proven even higher internal consistency, conversion and discriminate validity was also proven.",
                    "label": 0
                },
                {
                    "sent": "So that baby, I highly correlated with the first be moderately correlated with the fab, which is a measure of frontal systems.",
                    "label": 0
                },
                {
                    "sent": "But it's not a behavior specific measure.",
                    "label": 0
                },
                {
                    "sent": "And the screaming abilities of their baby.",
                    "label": 0
                },
                {
                    "sent": "I did not correlate with any demographic or clinical variables.",
                    "label": 0
                },
                {
                    "sent": "So drawn from a healthy control sample of 78 healthy controls which were much the patient sample by age, gender, and education would run this code score which so we showed 88% sensitivity on 79% specificity, and then using the soup sample of patients who met criteria for ILS FD we created using Roku.",
                    "label": 0
                },
                {
                    "sent": "Analysis are more specific at quarter for severe behavioral impairment.",
                    "label": 0
                },
                {
                    "sent": "Which is concordant with diagnosis of ILS FTD.",
                    "label": 0
                },
                {
                    "sent": "An that provide sensitivity of 90% and specificity of 96%, which is very good.",
                    "label": 1
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So then we decided to move on a little bit and just re validate the BBA against another ILS specific tulkus we did.",
                    "label": 0
                },
                {
                    "sent": "We did find that the use of the first speed, which is not specifically could create some confounding Sir, and we also wanted to explore and the ability of the baby I took after the whole spectrum of behavioral in changes in LS.",
                    "label": 1
                },
                {
                    "sent": "Such is that we decided to validate against a LS FTK DLS of PDQ.",
                    "label": 0
                },
                {
                    "sent": "It's a very robust psychometric tool that's that's one of the main reasons we chose it 'cause it's been validated very well, so we we did really like that part, so it's again and I'll especific behavioral measure.",
                    "label": 0
                },
                {
                    "sent": "It has 25 items and its proxy report and the items were also phrase, so they were adjusted for the effect of modern funds on behavior.",
                    "label": 0
                },
                {
                    "sent": "Again, internal consistency was very high, an same as the BBA.",
                    "label": 0
                },
                {
                    "sent": "Has proven conversion on this criminality, so again highly correlated with other behavioral inferential measures, but it did not correlate with the LS, FRS or the hats.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for this hard continuation of the study, we recruited 60 consecutive patients fulfilling this girl criteria for ILS.",
                    "label": 0
                },
                {
                    "sent": "They all attended the MMD National Clinic in Beaumont Hospital in Dublin.",
                    "label": 1
                },
                {
                    "sent": "Exclusion criteria was diagnosis of any other neurological, psychiatric, or medical condition that affects cognition and behavior.",
                    "label": 1
                },
                {
                    "sent": "9% of the patients Metroid revised criteria for diagnosis of behavioral variant FTD and the current campaign are campaigning.",
                    "label": 1
                },
                {
                    "sent": "The patient completed both the BBA on the ILS FTK on the same clinic visit.",
                    "label": 0
                },
                {
                    "sent": "The LSF arrest was completed by a subset of patients so 20 and demographic and clinical characteristics were obtained from the LS register.",
                    "label": 1
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So just quick look at the characteristics of the sample so we see that most of them were male 70% only 30% were female.",
                    "label": 0
                },
                {
                    "sent": "Age at the time of the assessment was about 65 years of education, 1380 onset 63.",
                    "label": 1
                },
                {
                    "sent": "Most of them were spinal onset stories, about 30% vulgar, an 8% which was breathing answered.",
                    "label": 0
                },
                {
                    "sent": "Age of Diagnosis, Route 64, and finally diagnostic delays.",
                    "label": 0
                },
                {
                    "sent": "So time seems uncertain.",
                    "label": 0
                },
                {
                    "sent": "Diagnosis was about 15 months.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in terms of correlation analysis, we corroborated the convert conversion and discriminative validity of the BBA.",
                    "label": 0
                },
                {
                    "sent": "So again, the BBA highly correlated with the LS FTK.",
                    "label": 0
                },
                {
                    "sent": "And there were no significant correlations with both demographic and clinical measures.",
                    "label": 1
                },
                {
                    "sent": "So education Agent answered a diagnosis on LSF arrest.",
                    "label": 0
                },
                {
                    "sent": "We did find a significant correlation with diagnostic delay and we put a size that so three of out of the five ILS FTD patients would have developed the cognitive symptoms.",
                    "label": 0
                },
                {
                    "sent": "Symptoms before, so that delayed the diagnosis of a LS.",
                    "label": 0
                },
                {
                    "sent": "So we actually repeated the correlational analysis.",
                    "label": 0
                },
                {
                    "sent": "After excluding those five cases, and then we did find that then.",
                    "label": 0
                },
                {
                    "sent": "There was no correlation with diagnostic delay and the exact same results were observed with the LS after cues.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So having a look at their contingent contingency table we see.",
                    "label": 0
                },
                {
                    "sent": "So this is people classified on the baby.",
                    "label": 0
                },
                {
                    "sent": "I did these people testified on my LS FTK so we do see that everyone who are classified as normal on the BBA was also classified as normal on the ILS PDQ so there is no false negatives.",
                    "label": 0
                },
                {
                    "sent": "So that brings down the sensitivity of 100% perfect sensitivity so the BBA is actually capturing all the cases of behavioral impairment.",
                    "label": 0
                },
                {
                    "sent": "But if you have a look at this column here we do see that there is a.",
                    "label": 0
                },
                {
                    "sent": "Sue Court of the patients who are classified as normal on the Allies to the queue, but they were abnormal on the BBI.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's what we could call false positives.",
                    "label": 0
                },
                {
                    "sent": "And that's what brings our specificity abit down.",
                    "label": 0
                },
                {
                    "sent": "OK so we decided then to have an exploratory analysis on those 17 gauge just to have a look qualitatively at what was going on for them.",
                    "label": 0
                },
                {
                    "sent": "What?",
                    "label": 0
                },
                {
                    "sent": "What were they reporting that somehow here may like this difference.",
                    "label": 0
                },
                {
                    "sent": "So most of them aswell Haiti percent of these 17 patients.",
                    "label": 0
                },
                {
                    "sent": "For patients who are who are diagnosed with mild behavioral changes, OK?",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So did this, so we hire.",
                    "label": 0
                },
                {
                    "sent": "Look at the 41 items on the BVI, and we looked on how frequently we were.",
                    "label": 0
                },
                {
                    "sent": "They endorsed by this 17 patients.",
                    "label": 0
                },
                {
                    "sent": "OK, so we do see that there is a few of them.",
                    "label": 0
                },
                {
                    "sent": "There's a few of them that are actually like picking out that there were more frequently reported and when having a look at what those specific items where.",
                    "label": 0
                },
                {
                    "sent": "We had a look what we see that it's from the the making more grammatical mistakes, inappropriate emotional display, diminished social interest, loss of interest or motivation, how their response to sensory stimuli or distract ability.",
                    "label": 0
                },
                {
                    "sent": "So then we had a look of all of this.",
                    "label": 0
                },
                {
                    "sent": "We wanted to know if the airlines have to queue was also measuring that or if there was anything from here that they allowed us to.",
                    "label": 0
                },
                {
                    "sent": "The queue wasn't measuring.",
                    "label": 0
                },
                {
                    "sent": "So as we can see, three of the items, the green ones are.",
                    "label": 0
                },
                {
                    "sent": "The ones are also measured by the elastic you, but three of them, the red ones, were not measured by 8 at all, OK?",
                    "label": 0
                },
                {
                    "sent": "So sorry.",
                    "label": 0
                },
                {
                    "sent": "So this one here I want just to highlight this one here.",
                    "label": 0
                },
                {
                    "sent": "This one is especially important not only because it's the most frequently reported, but also because if we go by.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To the to the robust criteria for the diagnosis of a LS FTK.",
                    "label": 0
                },
                {
                    "sent": "We can see that this diminished social interest is one of the core elements.",
                    "label": 0
                },
                {
                    "sent": "To make a diagnosis of ALS, FTD or behavioral variant FTD on its own, so we do feel that this item here is especially important.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So just.",
                    "label": 0
                },
                {
                    "sent": "In general, we feel that general behavioral assessments which do not correct for the effects confounding effects of motor dysfunction I'll ask tend to overestimate behavioral changes in LS.",
                    "label": 1
                },
                {
                    "sent": "Board scales that do not measure the whole spectrum of inheritance in LS tend to underestimate this, so we do feel that the BBA and specially this additional elements that we just mentioned improve the discriminatory power for mild behavioral changes.",
                    "label": 1
                },
                {
                    "sent": "So it seems that the BBA is slightly more sensitive to model behavior changes compared to the LSF PDQ, so we do feel that the PBI is a simple to administer a less specific behavior.",
                    "label": 1
                },
                {
                    "sent": "Proxy report.",
                    "label": 0
                },
                {
                    "sent": "It has very adequate psychometric properties.",
                    "label": 1
                },
                {
                    "sent": "On it seems to overcome both limitations we've mentioned before, so.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I want to acknowledge all of my colleagues in the amount of research team in in Dublin, Trinity College, specially Professor Orla Hardiman, Professional Pandaren look, tomorrow, Alamin Christy Supervisor, the clinical annual psychological aspects of the project, how entertaining Mr Ahmed Castellane, Mrs Sarah Connor Cousin involving all the data collection and data input process Doctor Tom Bergen.",
                    "label": 0
                },
                {
                    "sent": "Finally Mark hovering who we supervise all the management aspects of the project, so thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}