{
    "id": "5jhuhneqbrjxrxok7nvg5lkl7l3zfguy",
    "title": "Novel Geo-spatial Interpolation Analytics for General Meteorological Measurements",
    "info": {
        "author": [
            "Jinjun Xiong, IBM Thomas J. Watson Research Center"
        ],
        "published": "Oct. 7, 2014",
        "recorded": "August 2014",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Knowledge Extraction"
        ]
    },
    "url": "http://videolectures.net/kdd2014_xiong_meteorological_measurements/",
    "segmentation": [
        [
            "So good afternoon, ladies and gentlemen.",
            "I know I'm standing between you and the coffee break after a long day.",
            "So I promise, OK, I will make it presentation light, meaning you will see less than two sets of equations.",
            "And you don't have to understand all the equations to understand my talk, and that's my promise.",
            "And also our promise.",
            "You get even some of the questions I don't understand.",
            "OK.",
            "So before I start, OK, this is joint work with my summer student being sent one from Virginia Tech and he's a great student.",
            "And by the way he's going to graduate next year, so anyone interested to get a good talent that's good time to start to recruit, OK?",
            "So."
        ],
        [
            "So let me start OK, I know this is a very different topic, right?",
            "This industry check so I don't want to go into the much of like the want to give you a little background.",
            "What are we trying to do?",
            "What the problem we try to solve and then give this context?",
            "I think that's more interesting, more relevant for having this session.",
            "So we are working on the smarter energy.",
            "OK, and I know a lot of views from it, background, right data mining background, not many of you know, stick a smart energy smart grid meant right?",
            "So actually one of our sticks took for granted that the electricity, right?",
            "How reliable it is.",
            "Actually, once you.",
            "Get into the electrical grid.",
            "You'll be amazed how complicated system is.",
            "And the system has done a tremendous job to deliver the electricity so reliable to all of us.",
            "Given the variability given the uncertain, it has to deal with, because every time you switch off your light you never consider of it.",
            "I'm disturbing the system, right?",
            "So that's why the National Academy of Engineering think of the Electric Electric Electric Ification is the greatest engineering achievement of the 20th century.",
            "But the problem is OK Now as you can see, the electricity electrical grid is aging because of the growing population and the growing demand for the electricity and electricity, and it's a comfortable level of our daily life.",
            "So you actually industries also going through a tremendous transformation because of it.",
            "Industries change now the bigger data is a bigger push for this smart energy.",
            "How can we make it a grid become smarter?",
            "So I work for IBM Smart Energy Research Institute.",
            "So we try to advance the future of utility, OK?",
            "So you."
        ],
        [
            "All kind of a little bit background, so I could give you a quick one or one of the electrical engineering or power engineering 101, right?",
            "So what is look like?",
            "So here you can see this is the kind of the network typically right from the generation.",
            "Tip is at whatever location is most convenient to generate the power be the hydro.",
            "Or maybe the nuclear right, and then you through the transmission network, which is a high voltage network.",
            "And that is go to the place which we can like to get the power.",
            "Actually, during our daily life, you probably most dealing with is called a distribution network, which is kind of the utility companies deal with.",
            "They are on a daily basis in New York, is Cornelissen right and?",
            "That's going to work there.",
            "You have a scene.",
            "And here in this particular work with many work with the utility companies, which is dealing with the distribution network, the disk.",
            "It is showing this picture here and so on the left you see a network.",
            "So on the top.",
            "It's called a power transformer.",
            "The transformer transformer kind of transforms the high level voltage to the medium voltage for the medium voltage level you have the feeder OK number of a medium voltage level feeders.",
            "That kind of brings power from the power transformer to premature on your street OK, and then probably in your neighborhood.",
            "The street you have the distribution Transformers which connect the power from the converged power from the medium voltage level to your household level.",
            "Typically it's like a 110.",
            "Both or maybe in the European is kind of 220, right?",
            "And that is the time gets to your home and then you have the plug at your home.",
            "OK, that's the network.",
            "As you can see, by the way, the picture I'm showing here right is for fun, but also it's a serious picture.",
            "This is the distribution Transformers in the US.",
            "The traditional former USC in probably like at the top like a potop transformer, which is relatively small.",
            "Connect Connect to maybe one or two three households right?",
            "But in the European countries that much more densely populated so there are discussions.",
            "Formal is much bigger so they can do a couple of hundreds and can be hundreds of customers.",
            "So why is in the industry is very critical?",
            "Because this industry is kind of is a capital intensive industry, right?",
            "Have a lot of assets."
        ],
        [
            "The asset means, like the power Transformers that distributions formers and the cables cable joins switches.",
            "All of those things, and all of those devices is pretty expensive.",
            "And also any one of them fail, right have a tremendous impact to our daily life.",
            "Considering you have no power at home, you cannot longer log into the Facebook or Twitter.",
            "So what do you do?",
            "Alright, so here this picture shows you the picture of the Netherlands.",
            "This shows OK. You can see that in power methods region because we are working with the largest utility company in the Netherlands.",
            "This shows you how many power Transformers you have in the system.",
            "Here each circle consider for like kind of a cluster, how many power Transformers.",
            "That's the high voltage level to the medium voltage levels.",
            "All of the Transformers and millions of dollars.",
            "OK, money.",
            "And this is."
        ],
        [
            "Only shows the.",
            "This shows the distribution Transformers even more much more and in the power transformer high voltage level.",
            "Maybe you can afford to do the instrumentation to collect data so you can maintain it better, but with so many distributions for most even the cable switches there's no way you can afford to do the instrumentation and do the analytics.",
            "So that's why we need much more better advanced analytics modeling techniques to understand the health conditions of those assets, so you can do better maintenance."
        ],
        [
            "So of course the many, many problems that involved in this industry include how to transform the older network electrical grid to the smart grid.",
            "And one of the areas we focus on is called optimal asset maintenance and capital investment optimization.",
            "And this is a very important right.",
            "As I said, if these are capital intensive industry and all the asset is very expensive and it's a failure of those assets has tremendous impact to our society.",
            "So, but the existing kind of like you driving car, right?",
            "You have to do maintenance the same thing for those assets.",
            "You also need to do the maintenance.",
            "Existing as a maintenance is typically done logic depends on kind of predetermined.",
            "Rule of thumb OK because OK, OK maybe every.",
            "Two or three years you need to somehow check up, or maybe every half a year you need someone to look to check some of the oil, temperature, etc, right?",
            "Just like our car, maybe every 500 or 600,000 miles.",
            "You need to do the oil change.",
            "That is pretty much kind of rule of thumb, but as you can see, this is not considered a realistic utilization of the impacts, and it can be risk at boasts can be over maintained.",
            "Or it could be under maintenance, right?",
            "Just like all human beings you know and also maybe your car, the driving conditions different even though it's the same number of years of car.",
            "The health condition is different.",
            "So this which means this is kind of you need some kind of way too.",
            "Estimate how healthy of your asset it is.",
            "So that you can do better maintenance schedule optimization and related problems.",
            "So now you can do better capital investment optimization.",
            "You model for you to do this one, which means you need to have a way analytically to assess the so-called electrical age or the failure probability of each asset.",
            "And one of the key components to do that is.",
            "By building the electrical agent model.",
            "So just kind of."
        ],
        [
            "So the the components we build for this to achieve this goal, right?",
            "So at the bottom you have the load model and the ambient temperature models which fit into the transformer agent model.",
            "Once you have the transformer agent which is electrical age, then you build the failure probability models.",
            "Once you have the failure probability models plus the impact of each transformer into the system, then you can do the optimization including the both maintenance schedule optimization and so maybe capital investment optimization.",
            "So these are complicated end to end Association solutions.",
            "And for this particular work, we only focus on this particular lower bottom box called ambient temperature model.",
            "So because of that's one of the key input to this transformer agent model.",
            "So that's how motivate us why we look into this particular problem.",
            "So why this problem is the intro?"
        ],
        [
            "All challenger right?",
            "So look at this matter is region.",
            "As soon as I get this in this particular kind of the symbol K polymer kind of symbol is the weather station.",
            "As you can see the Empower Netherlands region you have only 33 weather stations.",
            "Which means you can only tell at 30 three locations roughly how the ambient temperature looks like, but they look at the power Transformers right?",
            "And also maybe you look better even with the descriptions.",
            "Foremost, I didn't overlay here because I have a cluster.",
            "The picture here.",
            "So as you can see, there's very limited information you have only about 30 three weather stations, but in terms of the Transformers or maybe other.",
            "After you have in the system is much much more.",
            "And how are you going to influence those informations right for the at the location?",
            "You don't have the weather stations this when I say information is related to the meteorological kind of metrics, can be the wind temperature and pressure etc right?",
            "Of course for our particular work we focus on the temperature ambient temperature.",
            "So."
        ],
        [
            "So when we started looking at this problem, we find actually that's a particular challenge.",
            "I'm sorry it's actually very common issues because of meteorological metrics is important for many, many applications.",
            "However, this is only very few limited number of the weather stations.",
            "And actually, for many, many businesses applications, having the final resolution meteorological metrics is very helpful.",
            "The one you typically get it from the Noah, like the ocean or the weather forecast, right?",
            "It's much it's very crude.",
            "Is a city level, or maybe the village level is much, much crude.",
            "There's not much value, less value in terms of the business process, so a solution for the meteorological, meteorological, magic at the final resolution, both spatially and temporary, is required.",
            "So we started to some kind of the little research to see what kind."
        ],
        [
            "For the solutions we have, but this is the first equation that promise to show you.",
            "So the one of the model is called the physical based model, right?",
            "That's typically it's called a weather research forecast or Wolf model.",
            "This is a very complicated partial differential equations with initial conditions, and it's a boundary conditions and then that requires.",
            "Typically you have to do the numerical integration and that is.",
            "Very computationally expensive is high HPC problems, and IBM has a solution to this.",
            "One is called deep Thunder.",
            "And the solution is very good, but this is very expensive, computationally expensive.",
            "And I don't understand this equation at all.",
            "So then we look at another way.",
            "So can we?"
        ],
        [
            "Find another compromise.",
            "Then we've looked at learning based models so the KDD is one of the conference.",
            "We look into the papers right.",
            "Then we find out there's many, many also papers and inverse distance spines regression creaking and the neural networks and machine learning as such, etc.",
            "And the various ways of the tradeoff between accuracy and speed."
        ],
        [
            "So then we said, what is our major contribution when we start looking?",
            "Develop our solution.",
            "First we look at all of those potential solutions we do the implementation and we see how good it is and then we started.",
            "Oh, we find that one solution is called compressed sensing, right?",
            "And those for the people working image processing domain probably notice application.",
            "But when you look at this one, this compressed sensing was not using this larger scale Geo spatial interpolation at all.",
            "So we said, let's apply this compressive sensing into our particular domain.",
            "While walking while walking this one, either we find that the particular application has made some assumptions of the priors.",
            "As you know anything really user base network.",
            "You have priors right?",
            "Different powers are kind of infers different problems, different solutions.",
            "Then we look at the priors in the typical solution they have the price, kind of blushing transformation because they have lots of distribution.",
            "That's how they get a very nice analytical formulas.",
            "Then we look at our data, how it looks like.",
            "Then we find our price different is not the.",
            "LA plus transcription at all, so we find this student distributions much better fit our data then we had.",
            "OK, let's use the student T as a prior.",
            "Then we find them speaking very, very difficult, very difficult to get analytical solution.",
            "Then we have to come up with all kinds of ways of approximation and estimation.",
            "So that's the second contribution we have the student people prior as a way of the compression sensing.",
            "And then we find our way of efficient effective estimation to solve this problem and then we do the experimentation to show the results."
        ],
        [
            "So this is the second formula I'm going to promise you.",
            "OK, that's it.",
            "So this is kind of roughly yes, OK?",
            "We do right?",
            "We give this weather stations this, by the way, is kind of New York station.",
            "New York area is a different set of data, right?",
            "But the idea is the same thing.",
            "You know, we kind of make assumption of the one of the linear transformation of those weather station data as DCT, like a discrete cosine transformation.",
            "Of course, you can use our transformation two, and we assume those coefficient follow some of very sparse distribution and installed using lost distribution.",
            "We use the student problem student student distributions.",
            "And."
        ],
        [
            "Justified by the data which I illustrated here.",
            "So we did some again log likelihood ratio test.",
            "We can test yes statistically significant to user.",
            "Student is a better fit of the data and then we've OK. How can we do the better estimation with the supplier?",
            "And that's how we use the approximated or variational inference and then.",
            "Of course."
        ],
        [
            "You can use Emily Murphy as well.",
            "That's kind of typical solution we probably developed, and that's the solution.",
            "Final solution we have.",
            "So which becomes a general service?",
            "Because once this is the general application as well, so any application can use similar solutions.",
            "We develop here to solve other applications and we use this one to solve the smart grid again for the transformer aging calculation and this just shows some of the data set."
        ],
        [
            "We have two sets of data KMI from the Netherlands and also another vendor provided data with different time resolutions and we do the evaluations OK using some of the average error metrics and we compare it against like six of seven methods we have."
        ],
        [
            "So the result shows pretty promising.",
            "OK for the two methods we've developed, we using the approximate variational inference or using the mercy of chip sampling kind of techniques that the first 2 columns is our contribution compare against other techniques in terms of the error in terms of the speed.",
            "As you can see, we are pretty accurate even using very limited number of the weather stations."
        ],
        [
            "OK, in the interest of time and I'm not going through the details of the tables, I think you can read from our paper and I welcome you to join us in the poster session and we can have the discussions OK, and I know the."
        ],
        [
            "The host is already waving.",
            "I'm running out of time.",
            "This is another one shows the barometric pressure map in the New York."
        ],
        [
            "And so that's the conclusion.",
            "So we provide us a new kind of the way of solving the compressive sensing using student keep prior and we divorce on efficient effective algorithms and did some extensive experimentation for this particular domain.",
            "And we believe this can be a applicable for other applications as well.",
            "So in the future work we want to right now we only focus on the spatial resolution enhancement in the next step.",
            "We want to also improve the temporal resolutions as well, and also considering the spatial and temporal.",
            "Relation of the meteorological metrics and also maybe find better ways of the greeting in order to decide where do you want to put the sensors optimally.",
            "And that concludes, my talk.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So good afternoon, ladies and gentlemen.",
                    "label": 0
                },
                {
                    "sent": "I know I'm standing between you and the coffee break after a long day.",
                    "label": 0
                },
                {
                    "sent": "So I promise, OK, I will make it presentation light, meaning you will see less than two sets of equations.",
                    "label": 0
                },
                {
                    "sent": "And you don't have to understand all the equations to understand my talk, and that's my promise.",
                    "label": 0
                },
                {
                    "sent": "And also our promise.",
                    "label": 0
                },
                {
                    "sent": "You get even some of the questions I don't understand.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So before I start, OK, this is joint work with my summer student being sent one from Virginia Tech and he's a great student.",
                    "label": 0
                },
                {
                    "sent": "And by the way he's going to graduate next year, so anyone interested to get a good talent that's good time to start to recruit, OK?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me start OK, I know this is a very different topic, right?",
                    "label": 0
                },
                {
                    "sent": "This industry check so I don't want to go into the much of like the want to give you a little background.",
                    "label": 0
                },
                {
                    "sent": "What are we trying to do?",
                    "label": 0
                },
                {
                    "sent": "What the problem we try to solve and then give this context?",
                    "label": 0
                },
                {
                    "sent": "I think that's more interesting, more relevant for having this session.",
                    "label": 0
                },
                {
                    "sent": "So we are working on the smarter energy.",
                    "label": 0
                },
                {
                    "sent": "OK, and I know a lot of views from it, background, right data mining background, not many of you know, stick a smart energy smart grid meant right?",
                    "label": 0
                },
                {
                    "sent": "So actually one of our sticks took for granted that the electricity, right?",
                    "label": 0
                },
                {
                    "sent": "How reliable it is.",
                    "label": 0
                },
                {
                    "sent": "Actually, once you.",
                    "label": 0
                },
                {
                    "sent": "Get into the electrical grid.",
                    "label": 0
                },
                {
                    "sent": "You'll be amazed how complicated system is.",
                    "label": 0
                },
                {
                    "sent": "And the system has done a tremendous job to deliver the electricity so reliable to all of us.",
                    "label": 0
                },
                {
                    "sent": "Given the variability given the uncertain, it has to deal with, because every time you switch off your light you never consider of it.",
                    "label": 0
                },
                {
                    "sent": "I'm disturbing the system, right?",
                    "label": 0
                },
                {
                    "sent": "So that's why the National Academy of Engineering think of the Electric Electric Electric Ification is the greatest engineering achievement of the 20th century.",
                    "label": 1
                },
                {
                    "sent": "But the problem is OK Now as you can see, the electricity electrical grid is aging because of the growing population and the growing demand for the electricity and electricity, and it's a comfortable level of our daily life.",
                    "label": 0
                },
                {
                    "sent": "So you actually industries also going through a tremendous transformation because of it.",
                    "label": 0
                },
                {
                    "sent": "Industries change now the bigger data is a bigger push for this smart energy.",
                    "label": 0
                },
                {
                    "sent": "How can we make it a grid become smarter?",
                    "label": 0
                },
                {
                    "sent": "So I work for IBM Smart Energy Research Institute.",
                    "label": 0
                },
                {
                    "sent": "So we try to advance the future of utility, OK?",
                    "label": 0
                },
                {
                    "sent": "So you.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All kind of a little bit background, so I could give you a quick one or one of the electrical engineering or power engineering 101, right?",
                    "label": 0
                },
                {
                    "sent": "So what is look like?",
                    "label": 0
                },
                {
                    "sent": "So here you can see this is the kind of the network typically right from the generation.",
                    "label": 0
                },
                {
                    "sent": "Tip is at whatever location is most convenient to generate the power be the hydro.",
                    "label": 0
                },
                {
                    "sent": "Or maybe the nuclear right, and then you through the transmission network, which is a high voltage network.",
                    "label": 0
                },
                {
                    "sent": "And that is go to the place which we can like to get the power.",
                    "label": 0
                },
                {
                    "sent": "Actually, during our daily life, you probably most dealing with is called a distribution network, which is kind of the utility companies deal with.",
                    "label": 0
                },
                {
                    "sent": "They are on a daily basis in New York, is Cornelissen right and?",
                    "label": 0
                },
                {
                    "sent": "That's going to work there.",
                    "label": 0
                },
                {
                    "sent": "You have a scene.",
                    "label": 0
                },
                {
                    "sent": "And here in this particular work with many work with the utility companies, which is dealing with the distribution network, the disk.",
                    "label": 0
                },
                {
                    "sent": "It is showing this picture here and so on the left you see a network.",
                    "label": 0
                },
                {
                    "sent": "So on the top.",
                    "label": 0
                },
                {
                    "sent": "It's called a power transformer.",
                    "label": 0
                },
                {
                    "sent": "The transformer transformer kind of transforms the high level voltage to the medium voltage for the medium voltage level you have the feeder OK number of a medium voltage level feeders.",
                    "label": 0
                },
                {
                    "sent": "That kind of brings power from the power transformer to premature on your street OK, and then probably in your neighborhood.",
                    "label": 0
                },
                {
                    "sent": "The street you have the distribution Transformers which connect the power from the converged power from the medium voltage level to your household level.",
                    "label": 0
                },
                {
                    "sent": "Typically it's like a 110.",
                    "label": 0
                },
                {
                    "sent": "Both or maybe in the European is kind of 220, right?",
                    "label": 0
                },
                {
                    "sent": "And that is the time gets to your home and then you have the plug at your home.",
                    "label": 0
                },
                {
                    "sent": "OK, that's the network.",
                    "label": 0
                },
                {
                    "sent": "As you can see, by the way, the picture I'm showing here right is for fun, but also it's a serious picture.",
                    "label": 0
                },
                {
                    "sent": "This is the distribution Transformers in the US.",
                    "label": 0
                },
                {
                    "sent": "The traditional former USC in probably like at the top like a potop transformer, which is relatively small.",
                    "label": 0
                },
                {
                    "sent": "Connect Connect to maybe one or two three households right?",
                    "label": 0
                },
                {
                    "sent": "But in the European countries that much more densely populated so there are discussions.",
                    "label": 0
                },
                {
                    "sent": "Formal is much bigger so they can do a couple of hundreds and can be hundreds of customers.",
                    "label": 0
                },
                {
                    "sent": "So why is in the industry is very critical?",
                    "label": 0
                },
                {
                    "sent": "Because this industry is kind of is a capital intensive industry, right?",
                    "label": 0
                },
                {
                    "sent": "Have a lot of assets.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The asset means, like the power Transformers that distributions formers and the cables cable joins switches.",
                    "label": 0
                },
                {
                    "sent": "All of those things, and all of those devices is pretty expensive.",
                    "label": 0
                },
                {
                    "sent": "And also any one of them fail, right have a tremendous impact to our daily life.",
                    "label": 0
                },
                {
                    "sent": "Considering you have no power at home, you cannot longer log into the Facebook or Twitter.",
                    "label": 0
                },
                {
                    "sent": "So what do you do?",
                    "label": 0
                },
                {
                    "sent": "Alright, so here this picture shows you the picture of the Netherlands.",
                    "label": 0
                },
                {
                    "sent": "This shows OK. You can see that in power methods region because we are working with the largest utility company in the Netherlands.",
                    "label": 0
                },
                {
                    "sent": "This shows you how many power Transformers you have in the system.",
                    "label": 0
                },
                {
                    "sent": "Here each circle consider for like kind of a cluster, how many power Transformers.",
                    "label": 0
                },
                {
                    "sent": "That's the high voltage level to the medium voltage levels.",
                    "label": 0
                },
                {
                    "sent": "All of the Transformers and millions of dollars.",
                    "label": 0
                },
                {
                    "sent": "OK, money.",
                    "label": 0
                },
                {
                    "sent": "And this is.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Only shows the.",
                    "label": 0
                },
                {
                    "sent": "This shows the distribution Transformers even more much more and in the power transformer high voltage level.",
                    "label": 1
                },
                {
                    "sent": "Maybe you can afford to do the instrumentation to collect data so you can maintain it better, but with so many distributions for most even the cable switches there's no way you can afford to do the instrumentation and do the analytics.",
                    "label": 0
                },
                {
                    "sent": "So that's why we need much more better advanced analytics modeling techniques to understand the health conditions of those assets, so you can do better maintenance.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So of course the many, many problems that involved in this industry include how to transform the older network electrical grid to the smart grid.",
                    "label": 0
                },
                {
                    "sent": "And one of the areas we focus on is called optimal asset maintenance and capital investment optimization.",
                    "label": 1
                },
                {
                    "sent": "And this is a very important right.",
                    "label": 0
                },
                {
                    "sent": "As I said, if these are capital intensive industry and all the asset is very expensive and it's a failure of those assets has tremendous impact to our society.",
                    "label": 0
                },
                {
                    "sent": "So, but the existing kind of like you driving car, right?",
                    "label": 0
                },
                {
                    "sent": "You have to do maintenance the same thing for those assets.",
                    "label": 0
                },
                {
                    "sent": "You also need to do the maintenance.",
                    "label": 0
                },
                {
                    "sent": "Existing as a maintenance is typically done logic depends on kind of predetermined.",
                    "label": 0
                },
                {
                    "sent": "Rule of thumb OK because OK, OK maybe every.",
                    "label": 0
                },
                {
                    "sent": "Two or three years you need to somehow check up, or maybe every half a year you need someone to look to check some of the oil, temperature, etc, right?",
                    "label": 0
                },
                {
                    "sent": "Just like our car, maybe every 500 or 600,000 miles.",
                    "label": 0
                },
                {
                    "sent": "You need to do the oil change.",
                    "label": 1
                },
                {
                    "sent": "That is pretty much kind of rule of thumb, but as you can see, this is not considered a realistic utilization of the impacts, and it can be risk at boasts can be over maintained.",
                    "label": 0
                },
                {
                    "sent": "Or it could be under maintenance, right?",
                    "label": 0
                },
                {
                    "sent": "Just like all human beings you know and also maybe your car, the driving conditions different even though it's the same number of years of car.",
                    "label": 0
                },
                {
                    "sent": "The health condition is different.",
                    "label": 0
                },
                {
                    "sent": "So this which means this is kind of you need some kind of way too.",
                    "label": 0
                },
                {
                    "sent": "Estimate how healthy of your asset it is.",
                    "label": 0
                },
                {
                    "sent": "So that you can do better maintenance schedule optimization and related problems.",
                    "label": 0
                },
                {
                    "sent": "So now you can do better capital investment optimization.",
                    "label": 1
                },
                {
                    "sent": "You model for you to do this one, which means you need to have a way analytically to assess the so-called electrical age or the failure probability of each asset.",
                    "label": 1
                },
                {
                    "sent": "And one of the key components to do that is.",
                    "label": 0
                },
                {
                    "sent": "By building the electrical agent model.",
                    "label": 0
                },
                {
                    "sent": "So just kind of.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the the components we build for this to achieve this goal, right?",
                    "label": 0
                },
                {
                    "sent": "So at the bottom you have the load model and the ambient temperature models which fit into the transformer agent model.",
                    "label": 0
                },
                {
                    "sent": "Once you have the transformer agent which is electrical age, then you build the failure probability models.",
                    "label": 0
                },
                {
                    "sent": "Once you have the failure probability models plus the impact of each transformer into the system, then you can do the optimization including the both maintenance schedule optimization and so maybe capital investment optimization.",
                    "label": 0
                },
                {
                    "sent": "So these are complicated end to end Association solutions.",
                    "label": 0
                },
                {
                    "sent": "And for this particular work, we only focus on this particular lower bottom box called ambient temperature model.",
                    "label": 1
                },
                {
                    "sent": "So because of that's one of the key input to this transformer agent model.",
                    "label": 0
                },
                {
                    "sent": "So that's how motivate us why we look into this particular problem.",
                    "label": 0
                },
                {
                    "sent": "So why this problem is the intro?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "All challenger right?",
                    "label": 0
                },
                {
                    "sent": "So look at this matter is region.",
                    "label": 0
                },
                {
                    "sent": "As soon as I get this in this particular kind of the symbol K polymer kind of symbol is the weather station.",
                    "label": 0
                },
                {
                    "sent": "As you can see the Empower Netherlands region you have only 33 weather stations.",
                    "label": 1
                },
                {
                    "sent": "Which means you can only tell at 30 three locations roughly how the ambient temperature looks like, but they look at the power Transformers right?",
                    "label": 0
                },
                {
                    "sent": "And also maybe you look better even with the descriptions.",
                    "label": 0
                },
                {
                    "sent": "Foremost, I didn't overlay here because I have a cluster.",
                    "label": 0
                },
                {
                    "sent": "The picture here.",
                    "label": 0
                },
                {
                    "sent": "So as you can see, there's very limited information you have only about 30 three weather stations, but in terms of the Transformers or maybe other.",
                    "label": 0
                },
                {
                    "sent": "After you have in the system is much much more.",
                    "label": 0
                },
                {
                    "sent": "And how are you going to influence those informations right for the at the location?",
                    "label": 0
                },
                {
                    "sent": "You don't have the weather stations this when I say information is related to the meteorological kind of metrics, can be the wind temperature and pressure etc right?",
                    "label": 0
                },
                {
                    "sent": "Of course for our particular work we focus on the temperature ambient temperature.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So when we started looking at this problem, we find actually that's a particular challenge.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry it's actually very common issues because of meteorological metrics is important for many, many applications.",
                    "label": 1
                },
                {
                    "sent": "However, this is only very few limited number of the weather stations.",
                    "label": 0
                },
                {
                    "sent": "And actually, for many, many businesses applications, having the final resolution meteorological metrics is very helpful.",
                    "label": 1
                },
                {
                    "sent": "The one you typically get it from the Noah, like the ocean or the weather forecast, right?",
                    "label": 1
                },
                {
                    "sent": "It's much it's very crude.",
                    "label": 0
                },
                {
                    "sent": "Is a city level, or maybe the village level is much, much crude.",
                    "label": 0
                },
                {
                    "sent": "There's not much value, less value in terms of the business process, so a solution for the meteorological, meteorological, magic at the final resolution, both spatially and temporary, is required.",
                    "label": 1
                },
                {
                    "sent": "So we started to some kind of the little research to see what kind.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For the solutions we have, but this is the first equation that promise to show you.",
                    "label": 0
                },
                {
                    "sent": "So the one of the model is called the physical based model, right?",
                    "label": 0
                },
                {
                    "sent": "That's typically it's called a weather research forecast or Wolf model.",
                    "label": 0
                },
                {
                    "sent": "This is a very complicated partial differential equations with initial conditions, and it's a boundary conditions and then that requires.",
                    "label": 0
                },
                {
                    "sent": "Typically you have to do the numerical integration and that is.",
                    "label": 0
                },
                {
                    "sent": "Very computationally expensive is high HPC problems, and IBM has a solution to this.",
                    "label": 0
                },
                {
                    "sent": "One is called deep Thunder.",
                    "label": 0
                },
                {
                    "sent": "And the solution is very good, but this is very expensive, computationally expensive.",
                    "label": 0
                },
                {
                    "sent": "And I don't understand this equation at all.",
                    "label": 0
                },
                {
                    "sent": "So then we look at another way.",
                    "label": 0
                },
                {
                    "sent": "So can we?",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Find another compromise.",
                    "label": 0
                },
                {
                    "sent": "Then we've looked at learning based models so the KDD is one of the conference.",
                    "label": 0
                },
                {
                    "sent": "We look into the papers right.",
                    "label": 0
                },
                {
                    "sent": "Then we find out there's many, many also papers and inverse distance spines regression creaking and the neural networks and machine learning as such, etc.",
                    "label": 1
                },
                {
                    "sent": "And the various ways of the tradeoff between accuracy and speed.",
                    "label": 1
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So then we said, what is our major contribution when we start looking?",
                    "label": 0
                },
                {
                    "sent": "Develop our solution.",
                    "label": 0
                },
                {
                    "sent": "First we look at all of those potential solutions we do the implementation and we see how good it is and then we started.",
                    "label": 0
                },
                {
                    "sent": "Oh, we find that one solution is called compressed sensing, right?",
                    "label": 1
                },
                {
                    "sent": "And those for the people working image processing domain probably notice application.",
                    "label": 1
                },
                {
                    "sent": "But when you look at this one, this compressed sensing was not using this larger scale Geo spatial interpolation at all.",
                    "label": 0
                },
                {
                    "sent": "So we said, let's apply this compressive sensing into our particular domain.",
                    "label": 0
                },
                {
                    "sent": "While walking while walking this one, either we find that the particular application has made some assumptions of the priors.",
                    "label": 0
                },
                {
                    "sent": "As you know anything really user base network.",
                    "label": 0
                },
                {
                    "sent": "You have priors right?",
                    "label": 0
                },
                {
                    "sent": "Different powers are kind of infers different problems, different solutions.",
                    "label": 0
                },
                {
                    "sent": "Then we look at the priors in the typical solution they have the price, kind of blushing transformation because they have lots of distribution.",
                    "label": 0
                },
                {
                    "sent": "That's how they get a very nice analytical formulas.",
                    "label": 0
                },
                {
                    "sent": "Then we look at our data, how it looks like.",
                    "label": 0
                },
                {
                    "sent": "Then we find our price different is not the.",
                    "label": 0
                },
                {
                    "sent": "LA plus transcription at all, so we find this student distributions much better fit our data then we had.",
                    "label": 0
                },
                {
                    "sent": "OK, let's use the student T as a prior.",
                    "label": 0
                },
                {
                    "sent": "Then we find them speaking very, very difficult, very difficult to get analytical solution.",
                    "label": 1
                },
                {
                    "sent": "Then we have to come up with all kinds of ways of approximation and estimation.",
                    "label": 1
                },
                {
                    "sent": "So that's the second contribution we have the student people prior as a way of the compression sensing.",
                    "label": 0
                },
                {
                    "sent": "And then we find our way of efficient effective estimation to solve this problem and then we do the experimentation to show the results.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is the second formula I'm going to promise you.",
                    "label": 0
                },
                {
                    "sent": "OK, that's it.",
                    "label": 0
                },
                {
                    "sent": "So this is kind of roughly yes, OK?",
                    "label": 0
                },
                {
                    "sent": "We do right?",
                    "label": 0
                },
                {
                    "sent": "We give this weather stations this, by the way, is kind of New York station.",
                    "label": 0
                },
                {
                    "sent": "New York area is a different set of data, right?",
                    "label": 0
                },
                {
                    "sent": "But the idea is the same thing.",
                    "label": 0
                },
                {
                    "sent": "You know, we kind of make assumption of the one of the linear transformation of those weather station data as DCT, like a discrete cosine transformation.",
                    "label": 0
                },
                {
                    "sent": "Of course, you can use our transformation two, and we assume those coefficient follow some of very sparse distribution and installed using lost distribution.",
                    "label": 0
                },
                {
                    "sent": "We use the student problem student student distributions.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Justified by the data which I illustrated here.",
                    "label": 0
                },
                {
                    "sent": "So we did some again log likelihood ratio test.",
                    "label": 0
                },
                {
                    "sent": "We can test yes statistically significant to user.",
                    "label": 0
                },
                {
                    "sent": "Student is a better fit of the data and then we've OK. How can we do the better estimation with the supplier?",
                    "label": 1
                },
                {
                    "sent": "And that's how we use the approximated or variational inference and then.",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You can use Emily Murphy as well.",
                    "label": 0
                },
                {
                    "sent": "That's kind of typical solution we probably developed, and that's the solution.",
                    "label": 0
                },
                {
                    "sent": "Final solution we have.",
                    "label": 0
                },
                {
                    "sent": "So which becomes a general service?",
                    "label": 1
                },
                {
                    "sent": "Because once this is the general application as well, so any application can use similar solutions.",
                    "label": 0
                },
                {
                    "sent": "We develop here to solve other applications and we use this one to solve the smart grid again for the transformer aging calculation and this just shows some of the data set.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have two sets of data KMI from the Netherlands and also another vendor provided data with different time resolutions and we do the evaluations OK using some of the average error metrics and we compare it against like six of seven methods we have.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the result shows pretty promising.",
                    "label": 0
                },
                {
                    "sent": "OK for the two methods we've developed, we using the approximate variational inference or using the mercy of chip sampling kind of techniques that the first 2 columns is our contribution compare against other techniques in terms of the error in terms of the speed.",
                    "label": 0
                },
                {
                    "sent": "As you can see, we are pretty accurate even using very limited number of the weather stations.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, in the interest of time and I'm not going through the details of the tables, I think you can read from our paper and I welcome you to join us in the poster session and we can have the discussions OK, and I know the.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The host is already waving.",
                    "label": 0
                },
                {
                    "sent": "I'm running out of time.",
                    "label": 0
                },
                {
                    "sent": "This is another one shows the barometric pressure map in the New York.",
                    "label": 1
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so that's the conclusion.",
                    "label": 0
                },
                {
                    "sent": "So we provide us a new kind of the way of solving the compressive sensing using student keep prior and we divorce on efficient effective algorithms and did some extensive experimentation for this particular domain.",
                    "label": 0
                },
                {
                    "sent": "And we believe this can be a applicable for other applications as well.",
                    "label": 0
                },
                {
                    "sent": "So in the future work we want to right now we only focus on the spatial resolution enhancement in the next step.",
                    "label": 1
                },
                {
                    "sent": "We want to also improve the temporal resolutions as well, and also considering the spatial and temporal.",
                    "label": 1
                },
                {
                    "sent": "Relation of the meteorological metrics and also maybe find better ways of the greeting in order to decide where do you want to put the sensors optimally.",
                    "label": 0
                },
                {
                    "sent": "And that concludes, my talk.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}