{
    "id": "5m6mxrtw3ohixkdpq6wlqphptwqgvswt",
    "title": "Shared Representation Learning for Heterogenous Face Recognition",
    "info": {
        "author": [
            "Zhen Lei, National Laboratory of Pattern Recognition, Institute of Automation, Chinese Academy of Sciences"
        ],
        "published": "July 2, 2015",
        "recorded": "May 2015",
        "category": [
            "Top->Computer Science->Computer Vision",
            "Top->Computer Science->Computer Vision->Face & Gesture Analysis"
        ]
    },
    "url": "http://videolectures.net/fgconference2015_lei_face_recognition/",
    "segmentation": [
        [
            "These are joint work with Tony Understanding the title.",
            "My presentation is shared representation, learning for heterogeneous, face recognition."
        ],
        [
            "Heat heater genius face recognition means matching face images from different resources or modalities, such as sketch versus visual images in forensics and security applications.",
            "And as we know, due to the good properties to illumination variations, the near infrared images are widely used in many applications.",
            "However, many enrollment phase the visual.",
            "We usually only have visual photos such as ID photo.",
            "So we have to address face matching problem between the near infrared and visual images, which is typical heterogeneous face recognition problem."
        ],
        [
            "There are many challenges for for heterogeneous face recognition.",
            "Why is that even the?",
            "Homogeneous visual face recognition is still an unsolved problem, especially in constraint scenarios.",
            "Second, there are extra nonlinear relation between face images from different modalities which increase the difficulties of face recognition.",
            "And compared to the traditional physical condition.",
            "The hitchhiker genius face images is usually of limited training samples.",
            "In this work, we propose to use multimodel restricted and boys machines to address this problem."
        ],
        [
            "There have been a lot of heterogeneous fashionation method in the last decades.",
            "Under these methods can be roughly divided into two categories.",
            "One is a synthesis based method and another is discriminative based method.",
            "For the since it's best method, the researchers usually synthesized face images of 1 model from another so that different Skype of image intensity are reduced.",
            "Under the traditional face recognition method can be applied.",
            "For the discriminative one we usually extract.",
            "Discriminative features by using DoD filter RB, PFG, or other local descriptors and learn the coupled projections to extract common features.",
            "However, Becausw limited image size, the generalization performance of discriminative method is not very satisfactory in practice.",
            "So in this work we propose an.",
            "Unsupervised method to address this problem so that the generation performance can be improved.",
            "This is."
        ],
        [
            "The pipeline of our method.",
            "We extract level one and Level 2 features to reduce the gap.",
            "Oh, face appearance from different modalities.",
            "Giving a pair of face images from different resources.",
            "We first use a face detector and landmark detectors to located face and serious landmarks.",
            "And then for the Level 1 feature representation we apply a Bank of garbled filters to extract the global features.",
            "And we apply the many local multi model BMS to extract shared representation and finally the PCA is applied to reduce the feature dimension for classification.",
            "This is a.",
            "Number one feature extraction.",
            "We first."
        ],
        [
            "Localized sparse facial landmarks.",
            "48 points used in this work.",
            "After that we generate.",
            "Adaptive feature points by RBF warping based on these 48 points to obtain 176 * 2 points.",
            "At each point, we apply a bankable theaters with five skills and eight orientations to extract 40 dimension double feature.",
            "So in total we have.",
            "176 * 2 * 40 Dimensions of Global features for Face image and this feature is robust to pose illumination, an expression variations."
        ],
        [
            "After that.",
            "We build the relationship between two modalities by much model.",
            "Are IBM's we trained IBM for each official point?",
            "We have 40 couple features respectively.",
            "So we totally using we totally train 176 IBM's for face image and the structure parameter one IBM is 4840 and we finally extract the hidden layer with 40 with 80 dimension feature.",
            "So the final feature dimension after the IBM Learning is becomes 176 * 2 * 80."
        ],
        [
            "In this work, we just use a multi model IBM proposal in NIPS 2012 in training phase, the parameters are learned by using mean field inference.",
            "An MCMC procedure is used.",
            "In testing phase we generate the hidden representation by alternating drips sampler.",
            "After that, we concatenated IBM's learned from each point each feature points and apply PCA to reduce the feature dimension."
        ],
        [
            "Ever, although in local regions local BMS have reduced heat regenerative of different modalities.",
            "However after concatenating these IBM features, we find that there is still heterogeneous heterogeneity between these features.",
            "Here's an example.",
            "The left figure is.",
            "A data distribution of IBM feature in the first three PC space we find that.",
            "The the data from different modalities occupied different position in this space so that there is still heterogeneity between this data.",
            "After removing the first several pieces, this data are merged together so the petrol generator is reduced and face recognition performance could be improved."
        ],
        [
            "We conduct.",
            "Proposed method on four phase databases too.",
            "Infrared versus visual face recognition on Casio, HP data set and Kasia Nevius version two data set.",
            "And we also examine the performance on Sketch versus Visual data Database.",
            "They recommend recognition rate and the IOC performance are reported in our experiment.",
            "Here."
        ],
        [
            "Is a data.",
            "Dataset information The cashier should be includes about 200 persons and the cashier near near infrared.",
            "Visual image version to include about 1700.",
            "Persons.",
            "Here's"
        ],
        [
            "Image example in this database.",
            "This is the visuals versus near infrared images."
        ],
        [
            "And these are the photo versus sketch images."
        ],
        [
            "This is a face recognition performance on Casey HFB.",
            "We can find a date.",
            "Every step of our.",
            "A feature extraction method does improve the face recognition performance.",
            "Using the PC analysis it improves.",
            "Circuit Regina's face recognition performance from about 60% to 94.",
            "Percent in terms of require recognition.",
            "And by using the IBM model, the performance is.",
            "If performance increases to about 99% in terms of rank, one recognition and this performance is compareable to the previous state of the art.",
            "Which, using discriminative models or some.",
            "Commercial softwares."
        ],
        [
            "OK, we also examine the performance of different RPMS used for heterogeneous face recognition.",
            "Here we compare three kinds of IBM models.",
            "One is for Global, One which is fully connected IBM and applied on the high dimension of double feature Directory and other one is convolutional which is locally connected.",
            "IBM with shared weights on different feature points and another one is a local which we adopted in this work is locally connected IBM with unshared weights which are learned on different.",
            "Feature points respectively.",
            "Here is the architectural parameter and the.",
            "Face recognition performance.",
            "We can see that for the global IBM, because of the very limited training data size and the high dimension feature, it is very easy to be over featured in training set and its performance on the testing set is very poor.",
            "Comparatively, the convolutional and localy connected IBM have good generalizations and achieve similar performance on training and testing set.",
            "R. The proposal Okolie connected IBM.",
            "Which have strong representation to model the local variations and.",
            "Have good generalizations.",
            "Achieve the best recognition performance on training and testing set so this is used, finally adopted in our method."
        ],
        [
            "We also examine the effect of removal of the first several pieces on the official election performance.",
            "We can see that by removing the 1st.",
            "Several pieces is the face recognition.",
            "Performance can be greatly improved Becausw history geniti is much reduced.",
            "Comparing the.",
            "Feature using IBM and without IBM we can find the IBM feature can reach its optimal.",
            "Definition performance by very moving more smaller PC components.",
            "Indicating that the Genuity in IBM features is much smaller than the original global features, and validating the effectiveness of our IBM model."
        ],
        [
            "This is some failure.",
            "Cases of our method.",
            "Under the first column is may be caused due to the.",
            "Oppose variations and the second and third column is still through the glass variation and the final column is due to the expression variation."
        ],
        [
            "We also tested the different method performance on Casio, near infrared versus visual version two and similar results are obtained.",
            "We can find that the proposed garbled plus IBM press PC component analysis achieved the best.",
            "Performance in this database."
        ],
        [
            "Much better than the recently proposed decieved prosody method."
        ],
        [
            "Under we also examine the performance on CUFS&CUFSF databases.",
            "This is the first method that can perform perfectly on CFS datasets.",
            "We achieve 100% rank one face recognition rate and 100% verification rate.",
            "We also performed goods on the CU FSF datasets achieves.",
            "98% recommended condition which is incomparable to the previous best method CIT."
        ],
        [
            "So in summary, in this work we propose a local to global learning framework for heterogeneous facial recognition.",
            "Our method is unsupervised, so that generalization performance is much improved compared to the previous methods, and this is the first time to use multimodal BMS to learn shared representation of heterogeneous face images by plugging the local BMS into the framework, we obtain the state of the art results for near infrared versus visual and sketch versus visual problems."
        ],
        [
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These are joint work with Tony Understanding the title.",
                    "label": 0
                },
                {
                    "sent": "My presentation is shared representation, learning for heterogeneous, face recognition.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Heat heater genius face recognition means matching face images from different resources or modalities, such as sketch versus visual images in forensics and security applications.",
                    "label": 1
                },
                {
                    "sent": "And as we know, due to the good properties to illumination variations, the near infrared images are widely used in many applications.",
                    "label": 0
                },
                {
                    "sent": "However, many enrollment phase the visual.",
                    "label": 0
                },
                {
                    "sent": "We usually only have visual photos such as ID photo.",
                    "label": 0
                },
                {
                    "sent": "So we have to address face matching problem between the near infrared and visual images, which is typical heterogeneous face recognition problem.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There are many challenges for for heterogeneous face recognition.",
                    "label": 0
                },
                {
                    "sent": "Why is that even the?",
                    "label": 0
                },
                {
                    "sent": "Homogeneous visual face recognition is still an unsolved problem, especially in constraint scenarios.",
                    "label": 1
                },
                {
                    "sent": "Second, there are extra nonlinear relation between face images from different modalities which increase the difficulties of face recognition.",
                    "label": 0
                },
                {
                    "sent": "And compared to the traditional physical condition.",
                    "label": 0
                },
                {
                    "sent": "The hitchhiker genius face images is usually of limited training samples.",
                    "label": 0
                },
                {
                    "sent": "In this work, we propose to use multimodel restricted and boys machines to address this problem.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There have been a lot of heterogeneous fashionation method in the last decades.",
                    "label": 0
                },
                {
                    "sent": "Under these methods can be roughly divided into two categories.",
                    "label": 0
                },
                {
                    "sent": "One is a synthesis based method and another is discriminative based method.",
                    "label": 0
                },
                {
                    "sent": "For the since it's best method, the researchers usually synthesized face images of 1 model from another so that different Skype of image intensity are reduced.",
                    "label": 0
                },
                {
                    "sent": "Under the traditional face recognition method can be applied.",
                    "label": 0
                },
                {
                    "sent": "For the discriminative one we usually extract.",
                    "label": 0
                },
                {
                    "sent": "Discriminative features by using DoD filter RB, PFG, or other local descriptors and learn the coupled projections to extract common features.",
                    "label": 0
                },
                {
                    "sent": "However, Becausw limited image size, the generalization performance of discriminative method is not very satisfactory in practice.",
                    "label": 0
                },
                {
                    "sent": "So in this work we propose an.",
                    "label": 0
                },
                {
                    "sent": "Unsupervised method to address this problem so that the generation performance can be improved.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The pipeline of our method.",
                    "label": 0
                },
                {
                    "sent": "We extract level one and Level 2 features to reduce the gap.",
                    "label": 0
                },
                {
                    "sent": "Oh, face appearance from different modalities.",
                    "label": 0
                },
                {
                    "sent": "Giving a pair of face images from different resources.",
                    "label": 0
                },
                {
                    "sent": "We first use a face detector and landmark detectors to located face and serious landmarks.",
                    "label": 0
                },
                {
                    "sent": "And then for the Level 1 feature representation we apply a Bank of garbled filters to extract the global features.",
                    "label": 0
                },
                {
                    "sent": "And we apply the many local multi model BMS to extract shared representation and finally the PCA is applied to reduce the feature dimension for classification.",
                    "label": 0
                },
                {
                    "sent": "This is a.",
                    "label": 0
                },
                {
                    "sent": "Number one feature extraction.",
                    "label": 0
                },
                {
                    "sent": "We first.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Localized sparse facial landmarks.",
                    "label": 0
                },
                {
                    "sent": "48 points used in this work.",
                    "label": 0
                },
                {
                    "sent": "After that we generate.",
                    "label": 0
                },
                {
                    "sent": "Adaptive feature points by RBF warping based on these 48 points to obtain 176 * 2 points.",
                    "label": 1
                },
                {
                    "sent": "At each point, we apply a bankable theaters with five skills and eight orientations to extract 40 dimension double feature.",
                    "label": 0
                },
                {
                    "sent": "So in total we have.",
                    "label": 0
                },
                {
                    "sent": "176 * 2 * 40 Dimensions of Global features for Face image and this feature is robust to pose illumination, an expression variations.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "After that.",
                    "label": 0
                },
                {
                    "sent": "We build the relationship between two modalities by much model.",
                    "label": 1
                },
                {
                    "sent": "Are IBM's we trained IBM for each official point?",
                    "label": 0
                },
                {
                    "sent": "We have 40 couple features respectively.",
                    "label": 0
                },
                {
                    "sent": "So we totally using we totally train 176 IBM's for face image and the structure parameter one IBM is 4840 and we finally extract the hidden layer with 40 with 80 dimension feature.",
                    "label": 0
                },
                {
                    "sent": "So the final feature dimension after the IBM Learning is becomes 176 * 2 * 80.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In this work, we just use a multi model IBM proposal in NIPS 2012 in training phase, the parameters are learned by using mean field inference.",
                    "label": 1
                },
                {
                    "sent": "An MCMC procedure is used.",
                    "label": 0
                },
                {
                    "sent": "In testing phase we generate the hidden representation by alternating drips sampler.",
                    "label": 0
                },
                {
                    "sent": "After that, we concatenated IBM's learned from each point each feature points and apply PCA to reduce the feature dimension.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ever, although in local regions local BMS have reduced heat regenerative of different modalities.",
                    "label": 0
                },
                {
                    "sent": "However after concatenating these IBM features, we find that there is still heterogeneous heterogeneity between these features.",
                    "label": 0
                },
                {
                    "sent": "Here's an example.",
                    "label": 0
                },
                {
                    "sent": "The left figure is.",
                    "label": 0
                },
                {
                    "sent": "A data distribution of IBM feature in the first three PC space we find that.",
                    "label": 1
                },
                {
                    "sent": "The the data from different modalities occupied different position in this space so that there is still heterogeneity between this data.",
                    "label": 0
                },
                {
                    "sent": "After removing the first several pieces, this data are merged together so the petrol generator is reduced and face recognition performance could be improved.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We conduct.",
                    "label": 0
                },
                {
                    "sent": "Proposed method on four phase databases too.",
                    "label": 0
                },
                {
                    "sent": "Infrared versus visual face recognition on Casio, HP data set and Kasia Nevius version two data set.",
                    "label": 1
                },
                {
                    "sent": "And we also examine the performance on Sketch versus Visual data Database.",
                    "label": 0
                },
                {
                    "sent": "They recommend recognition rate and the IOC performance are reported in our experiment.",
                    "label": 1
                },
                {
                    "sent": "Here.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is a data.",
                    "label": 0
                },
                {
                    "sent": "Dataset information The cashier should be includes about 200 persons and the cashier near near infrared.",
                    "label": 0
                },
                {
                    "sent": "Visual image version to include about 1700.",
                    "label": 0
                },
                {
                    "sent": "Persons.",
                    "label": 0
                },
                {
                    "sent": "Here's",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Image example in this database.",
                    "label": 0
                },
                {
                    "sent": "This is the visuals versus near infrared images.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And these are the photo versus sketch images.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is a face recognition performance on Casey HFB.",
                    "label": 0
                },
                {
                    "sent": "We can find a date.",
                    "label": 0
                },
                {
                    "sent": "Every step of our.",
                    "label": 0
                },
                {
                    "sent": "A feature extraction method does improve the face recognition performance.",
                    "label": 0
                },
                {
                    "sent": "Using the PC analysis it improves.",
                    "label": 0
                },
                {
                    "sent": "Circuit Regina's face recognition performance from about 60% to 94.",
                    "label": 0
                },
                {
                    "sent": "Percent in terms of require recognition.",
                    "label": 0
                },
                {
                    "sent": "And by using the IBM model, the performance is.",
                    "label": 0
                },
                {
                    "sent": "If performance increases to about 99% in terms of rank, one recognition and this performance is compareable to the previous state of the art.",
                    "label": 0
                },
                {
                    "sent": "Which, using discriminative models or some.",
                    "label": 0
                },
                {
                    "sent": "Commercial softwares.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, we also examine the performance of different RPMS used for heterogeneous face recognition.",
                    "label": 0
                },
                {
                    "sent": "Here we compare three kinds of IBM models.",
                    "label": 0
                },
                {
                    "sent": "One is for Global, One which is fully connected IBM and applied on the high dimension of double feature Directory and other one is convolutional which is locally connected.",
                    "label": 0
                },
                {
                    "sent": "IBM with shared weights on different feature points and another one is a local which we adopted in this work is locally connected IBM with unshared weights which are learned on different.",
                    "label": 1
                },
                {
                    "sent": "Feature points respectively.",
                    "label": 0
                },
                {
                    "sent": "Here is the architectural parameter and the.",
                    "label": 0
                },
                {
                    "sent": "Face recognition performance.",
                    "label": 0
                },
                {
                    "sent": "We can see that for the global IBM, because of the very limited training data size and the high dimension feature, it is very easy to be over featured in training set and its performance on the testing set is very poor.",
                    "label": 0
                },
                {
                    "sent": "Comparatively, the convolutional and localy connected IBM have good generalizations and achieve similar performance on training and testing set.",
                    "label": 0
                },
                {
                    "sent": "R. The proposal Okolie connected IBM.",
                    "label": 0
                },
                {
                    "sent": "Which have strong representation to model the local variations and.",
                    "label": 0
                },
                {
                    "sent": "Have good generalizations.",
                    "label": 0
                },
                {
                    "sent": "Achieve the best recognition performance on training and testing set so this is used, finally adopted in our method.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We also examine the effect of removal of the first several pieces on the official election performance.",
                    "label": 0
                },
                {
                    "sent": "We can see that by removing the 1st.",
                    "label": 0
                },
                {
                    "sent": "Several pieces is the face recognition.",
                    "label": 0
                },
                {
                    "sent": "Performance can be greatly improved Becausw history geniti is much reduced.",
                    "label": 0
                },
                {
                    "sent": "Comparing the.",
                    "label": 0
                },
                {
                    "sent": "Feature using IBM and without IBM we can find the IBM feature can reach its optimal.",
                    "label": 0
                },
                {
                    "sent": "Definition performance by very moving more smaller PC components.",
                    "label": 0
                },
                {
                    "sent": "Indicating that the Genuity in IBM features is much smaller than the original global features, and validating the effectiveness of our IBM model.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is some failure.",
                    "label": 0
                },
                {
                    "sent": "Cases of our method.",
                    "label": 0
                },
                {
                    "sent": "Under the first column is may be caused due to the.",
                    "label": 0
                },
                {
                    "sent": "Oppose variations and the second and third column is still through the glass variation and the final column is due to the expression variation.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We also tested the different method performance on Casio, near infrared versus visual version two and similar results are obtained.",
                    "label": 0
                },
                {
                    "sent": "We can find that the proposed garbled plus IBM press PC component analysis achieved the best.",
                    "label": 0
                },
                {
                    "sent": "Performance in this database.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Much better than the recently proposed decieved prosody method.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Under we also examine the performance on CUFS&CUFSF databases.",
                    "label": 0
                },
                {
                    "sent": "This is the first method that can perform perfectly on CFS datasets.",
                    "label": 1
                },
                {
                    "sent": "We achieve 100% rank one face recognition rate and 100% verification rate.",
                    "label": 0
                },
                {
                    "sent": "We also performed goods on the CU FSF datasets achieves.",
                    "label": 0
                },
                {
                    "sent": "98% recommended condition which is incomparable to the previous best method CIT.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in summary, in this work we propose a local to global learning framework for heterogeneous facial recognition.",
                    "label": 0
                },
                {
                    "sent": "Our method is unsupervised, so that generalization performance is much improved compared to the previous methods, and this is the first time to use multimodal BMS to learn shared representation of heterogeneous face images by plugging the local BMS into the framework, we obtain the state of the art results for near infrared versus visual and sketch versus visual problems.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}