{
    "id": "5okvkfygzneisp6pbbbpauuxmxs6nm37",
    "title": "Linking Lexicographic Resources: The Opportunities and Challenges Offered by the Semantic Web",
    "info": {
        "author": [
            "Andrea Bellandi, Istituto di Linguistica Computazionale \"Antonio Zampolli\"",
            "Fahad Khan, Istituto di Linguistica Computazionale \"Antonio Zampolli\""
        ],
        "published": "July 24, 2018",
        "recorded": "July 2018",
        "category": [
            "Top->Humanities->Linguistics->Lexicography",
            "Top->Computer Science",
            "Top->Data Science"
        ]
    },
    "url": "http://videolectures.net/WNLEXworkshop2018_khan_bellandi_lexicographic/",
    "segmentation": [
        [
            "So this introduction is really intended as an introduction."
        ],
        [
            "Add to the possibilities for Inter and intra data set linking that their semantic web offers to anyone thinking publishing their own linguistic resource is linked data.",
            "In particular, it seemed anyone who's working with digital lexicons, including in particular word Nets, given the theme of the workshop and also retro digitized legs, retro digitized dictionaries.",
            "So can fancy language arrangements.",
            "Talk is to conceptually foreground the notion of a link.",
            "Ann Link data and and on the Semantic Web and so the session is going to be broken up into two parts.",
            "In the first part I'm going to go through some of the basics of the semantic Web as they pertain to the question of linking resources together, and then I'm going to explore some concrete use cases in the second part, Andrea is going to show some actual examples of linking using a tool which is being developed at our Institute, which is really an interface for creating and editing link data lexicons."
        ],
        [
            "I'm going to assume I'm only going to see minimal amount background knowledge on linked data and the semantic Web or however, I'm going to go quite quickly over a lot with a bit of materials, so if anything is unclear, please feel free to interrupt me and ask questions, OK?"
        ],
        [
            "So I."
        ],
        [
            "Going to start with some very basic definitions and John is already gone through some of this material in his his presentation.",
            "So link data is basically it's a method of publishing structured data so that it can be interlinked and become more useful through semantic queries.",
            "And I've stolen this definition from Wikipedia and so then there's the semantic web which is basically it's a web of data sets that are structured in linked together using a common set of standards and technology so that they can be more easily processed by computers in terms of what they mean.",
            "In contrast to normal hypertext documents which are really designed to be read by humans, so just kind of summarize these two definitions, link data is 1 very important way of making the semantic web reality, and then there are the core link."
        ],
        [
            "The principles which I'm sure most of you have already heard of an.",
            "These are basically that you use your eyes, which are universal resource identifiers, is names for things, and you should also be able to look up these your eyes and then when someone looks up you are I.",
            "They should be able to access useful information using various different standards and that your datasets should also include your eyes to other links to other ur eyes so that that.",
            "We did.",
            "Your users can discover more things and then if in addition to these four prerequisites, the data is made available using an open license, then it's classified as linked open data.",
            "So again, to sum up, these four points that these principles are really meant to encourage the maximum of interoperability between datasets.",
            "Anta facilities facilitate a more explicit encoding of meaning within and between datasets."
        ],
        [
            "And so the main standard which is used or one of the most important standards which is used to publish data on the semantic web is the Resource Description framework, an kind of the important thing too.",
            "Mention about the results are a bit RDF is that mix the constraint that our data must be described using statements of the form subject, predicate, object where this subject and object are.",
            "Each resource is so the conceptual things of the last slide and they have their own ur eyes and then these subject and predicate resource is are related together by a predicate which is often called a property or roll and which is also resource with its own ur eyes and these statements are known as RDF triples and a link data data set consists of a series of such triples.",
            "So."
        ],
        [
            "The resource is which I referred to in the last slide.",
            "Can either be individuals such as Ljubljana, Slovenia, Andrea, Blondie or they can be classes such as the class events, class of cities, or they can also be relations such as X loves YX is bigger than Y, we will often find the classes or individuals or properties we're looking for when creating building our own data sets and other datasets and we should reuse them if the semantics are right.",
            "If we can't.",
            "Obviously if we can't find what we need among existing data vocabularies and we should create our own.",
            "Resources our own individual properties in classes in essence.",
            "Then, RDF allows us to build up graphs linking together resources, and these graphs are distributed across different web locations and we can access them using the HTTP protocol so."
        ],
        [
            "The RDF and RDF S give us a number of built-in properties which constrain how we can, how we put a constraint on how we build up our graphs, and they allow for more concision in our data as well.",
            "So basically I skip to slide.",
            "I deleted a slide which actually explains which these built-in properties are, but they're basically RDF type.",
            "An RDF subclass of which are built in properties which you get for free with the RDF and with RDF switches built on top of it.",
            "Just a standard which is built on top of RDF.",
            "So in the previous diagram, if you look at this diagram, I've created a graph little graph which describes the city of Lubiana, which says that Lubiana is of type city and city is a subtype of or subclass of location and."
        ],
        [
            "Obviously, as I said before, we can reuse classes and individuals and resources and relations.",
            "So here for example, I created a little diagram which describes the workshop, which is that it's of type event and I've taken this event class from DB pedia.",
            "DPT and it's spelled incorrectly and then I've also taken the city Ljubljana from the Peter and also the relation located in area again, from the DPP deontology."
        ],
        [
            "So by using shared vocabularies and standard identifiers to describe our data, it becomes much easier to integrate them with other datasets, since obviously where these datasets are using the same names to refer to the same things, and this opens up the possibility of being of being able to query large numbers of datasets at the same time, and then obviously another important standard on the semantic web is sparkle, which gives us a powerful query language for querying linked data datasets, and then we can make our datasets publicly queryable by exposing them.",
            "Using sparkle endpoints and just to mention this website, which is really useful, so it's it's called delovi.",
            "It's hosted by the open node transition.",
            "It's search engine facility which enables you to look up various different link data vocabularies.",
            "So this is just kind of giving you a rundown of some of the basics here."
        ],
        [
            "And then something which will be important for the rest of the talk is that in addition to the built-in properties which I mentioned before, which shows RDF type in RDF subclass of, there are a number of properties which allow us to actually.",
            "Describe relations between between resource is so.",
            "For example, we can say that one property or relation is a sub property of another using RDF.",
            "Sub property of.",
            "So for example, we can see that has sister.",
            "So if we create a a relation of property has sister then we can say OK so sub property of a broader relation has similar has sibling and then we can also we can also do with thanks to our DFS is that we can specify the domains and ranges of properties.",
            "So that's the classes of things that are property.",
            "And potentially relate together.",
            "And so, for example, we can specify the domain of his mother as human, but then we can say the range of his mother is female human.",
            "So this is a way of actually kind of specifying the meanings of properties using kind of a fairly basic set of properties which come with RDF."
        ],
        [
            "So what I'm kind of trying to get out here with these last few slides is that.",
            "It kind of should make it clear, should make clear that the basic.",
            "How different, for example, this conception of data modeling and linked data is from a standard like TI, 'cause our datasets essentially consists of a series of triples which represent declarative subject, predicate object statements, and this should be viewed as graphs with edges with meaningful labels rather than as innocent either.",
            "Really, what you're dealing with are really trees an what this means is that it's harder.",
            "More variables to do things which are perhaps kind of fairly straightforward with the standard leichty, such as creating.",
            "Digital editions of texts and Link data, but it makes other things much easier, and here I'm really kind of.",
            "Well, what I really want to kind of refer to is can basically representation of networks that something comes very naturally with the RDF."
        ],
        [
            "And then of course, if in terms of describing the meanings of classes and properties and so on, there are other kind of standards.",
            "This semantic web standards which give us much more expressive iti, such As for example, the Web Ontology language.",
            "And then there's also scores which is really kind of more focused on allowing the creation of taxonomies of concepts so.",
            "But I'm not going to go into much detail on that."
        ],
        [
            "So like I said, my talk is really about properties about linking together different resources, and two of the kind of most generic, and I guess most important ways of linking together resource is.",
            "The semantic web are the properties.",
            "See also and same as the first of these is a built-in property.",
            "Also has a built in property of RDF's and the other one is a built-in property of our Web Ontology language.",
            "See also is a property which allows us to state that one.",
            "So if you include it in a triple, what's you also basically allows you to do is to relate together the subject and the object of the triple.",
            "And basically it doesn't most generic way possible.",
            "So basically says the object is somehow relevant to the subject.",
            "So for example here I've given an example triple so lubiana.",
            "Is Slovenia somehow relevant to Lubiana but we don't specify what?",
            "How much weight is actually relevant, whereas same as is a much stronger kind of semantics.",
            "So same as basically states that two ur eyes actually refer to the same thing."
        ],
        [
            "So sum up again semantic Web and link.",
            "So the important thing to kind of keep in mind rings to the rest of this talk is that semantic web and link data really enabled the creation distributed knowledge graphs in which the links between the concepts and resource is across datasets can be assigned meanings using formal languages of different levels of expressivity's, so I said probably the most basic level is RDF, but then you have RDF's and then you have hours so you can read it.",
            "You can kind of specify the meanings of the links between.",
            "Different datasets and resources, and as I said, again, this is something which I really want to emphasize.",
            "That kind of necessitates kind of change of mindset in comparison to other kind of standards which may be humanist are more used to like TI and I would, I would argue that the semantic web seems to draw more towards the classical AI knowledge engineering approach, and so in the rest of the talk after this kind of very brief resume, I really want to focus on on the kind of opportunities and challenges which.",
            "Modelling lexical resources linked data throws up, and in particular, what I really want to focus on is how we can actually enrich individual lexical resource is whether those are reward Nets or retro digitized dictionaries, or any kind of lexicon by linking them to other kinds of resources.",
            "Whether these are lexical resource is or."
        ],
        [
            "Not so sip of water."
        ],
        [
            "So I'm not in this part.",
            "What I want to focus on our kind of two questions.",
            "So first question is what kind of links would be particularly interesting or helpful for consumers of lexical RDF datasets?",
            "And then the second question is, how can we best augment lexical datas with the kind of lexical datasets with the kinds of links we saw earlier?",
            "So in what follows in Williston number, why think of the most interesting and useful kinds of links that we can add to lexical datasets?",
            "And I'm going to do this by highlighting two sets of use cases.",
            "The first set of use cases deals with links between lexical datasets and a second set of use cases deals with links between lexical datasets and other kinds of datasets."
        ],
        [
            "Fortunately, due to time constraints, and we'll be able to talk about the very important topic of actually linking to link data.",
            "Lexicons from other kinds of datasets.",
            "So, for example, very kind of probably most well known use cases.",
            "The link the annotation of corpora with the.",
            "Using ur eyes from.",
            "The link data resources such as DB Pedia, but I just want you to bear in mind this is a very important application of lexical linked data datasets."
        ],
        [
            "So what, then are some interesting use cases for linking individual lexical datasets together?",
            "And this is just as a caveat, this is not an exhaustive list.",
            "So first when I mentioned here is the creation of links between entries for the same word in different lexicons in order to make additional linguistic information accessible.",
            "So, for instance, this is very useful for word, NetSuite, which usually do not include a lot of information in terms of phonetics or or phonology, or phonetics, or morphosyntactic information.",
            "Then another use case which I want to look at is the creation of BI or multilingual lexic.",
            "Resources by linking together senses that are translations or equivalents of one another, I think this has been mentioned a few times today already, so I'm not going to put very much depth about it.",
            "And then there's the modeling of etymological data and the referencing words in other languages as part of individual work histories and the 4th one, which I'm not really going to talk about, which I'd like to mention because I think it's very interesting project is the actual linking between different editions of the same dictionary, so this is something more obviously more relevant.",
            "Director digitized dictionaries, so it's the.",
            "Linking between kind of entries to North Tracy.",
            "Evolution of how how different words have been treated across different versions of the same dictionary and one very good example is this is the new far project which if you have questions about, please ask for referral Director Francesca because she's working on this project.",
            "It's a very interesting one."
        ],
        [
            "OK, so I think I think we've seen this.",
            "This has been discussed already, but the simplest kind of lexicon to lexicon linking.",
            "We can carry out its linking together entries for the same word but across different lexicons, and in this case we can use the same as relation to do the linking.",
            "So for instance that Tallinna tell Ward net like I said, like most word Nets, is not a lot of comprehensive morphosyntactic phonetic information.",
            "But at my Institute we also have this kind of a very kind of.",
            "Extensive lexical resource called simple which contains a lot of morphosyntactic in.",
            "Also semantic information, and So what would be kind of very useful would be to link an entry such as Caligari, an award that too simple, and this would enable you to access very easily all the extra information that's in simple."
        ],
        [
            "But there's a caveat here, because the semantics of same ol same as may not always be."
        ],
        [
            "Appropriate case when two and the two lexical resource sources being linked together contain differing or contradictory information about the same entry, and this is something that so it's not.",
            "Obviously it's not limited just to lexical resource is the semantics of same as is so so obviously a more general problem when it comes to link data.",
            "So either either so in order to kind of overcome this year you either need to be very careful when you're actually creating these links between different resources, or.",
            "Perhaps we can think about maybe using another property to link together.",
            "Two entries in different resources, which basically you're dealing with the same entry, but you're not sure whether they contain whether the information is consistent across the two resources."
        ],
        [
            "And then the."
        ],
        [
            "We can also infect another kind of very useful use case, or can have something where linking really comes into its own is in the creation of bilingual or multilingual resources.",
            "By linking together the senses contained in monolingual lexicons, just can either be semi automatically, automatically, or even manually, and we're very lucky because the until X lemon vocabulary already provides a host of properties and classes which enable us to do this, and this is actually.",
            "There's been kind of some work done on this on with respect to the repair team series of dictionaries, and so I think I think it's a 2:00 PM.",
            "Or basically they are thinking a number of this is been a collaboration between number Spanish universities where they managed to actually linked together large number of language pairs using using."
        ],
        [
            "Lemon.",
            "And then there's a linking together lexicons in order to model etymologies.",
            "And, as I say, RDF is an semantic web.",
            "In general, it really comes into its own when we're actually modeling data which is actually graph like, or which is kind of structured as a network.",
            "An etymologies are kind of essentially descriptions of graphs, and very often they involve different kinds of historical and more generally non linguistic information.",
            "Which makes them perfect candidates for being modeled as linked data.",
            "So for example.",
            "Billing data is enables you to kind of distribute.",
            "As I said, distributed knowledge across different kind of nodes in a graph.",
            "So for example, if you're able to.",
            "Use properties or classes or or individuals from.",
            "I don't know from vocabulary dealing with metaphor, metonym, this actually enables to describe metaphorical sense shifts between meanings of words.",
            "So that's just one example where you can actually refer to information.",
            "It's not, strictly speaking.",
            "Kind of dealing with the same kind of topic that you're dealing with, but which is very, very useful in which can be reused.",
            "And then of course, in order to represent the etymology of the word, we need to create links between the entry for that word and entries in other lexicons, or in the same lexecon.",
            "And these, like I say, RDF and the all the other standards that I mentioned are really kind of useful that they allow you to give meanings to these links, and so that you can actually type your links for the specific kinds of historical relationships which obtained between different words.",
            "So the relationship of inheritance so awards is inherited from a parent language or words borrowed from a from another language.",
            "This is something that you can actually.",
            "Give these links meanings and then I just like to mention I also like to mention that this is already been kind of.",
            "Worked worked on this is this this idea of kind of actually using linked data principles to model etymological networks is actually some an idea.",
            "That's it's not that new.",
            "So early exists a resource which is kind of based on this idea."
        ],
        [
            "And then another kind of, you know.",
            "A positive.",
            "I don't know why you would call it, but there's kind of screen push at the moment for towards publishing.",
            "Lexical resource is for historical languages such as ancient Greek, Greek and Latin, and linked data and talk to Frances Bond.",
            "And he says that he's kind of fairly sure that there's going to be.",
            "I think Wordnet Latin word that's already available in ancient Greek word net.",
            "It's kind of.",
            "I think it's public, but it's kind of.",
            "It needs to be cleaned up an I think there's also talk of the Sanskrit word net being made publicly available soonish at the moment, so the until excellent group is working on developing etymology module for lemon and anyone who's interested in contributing to this module is invited to participate by joining the mailing."
        ],
        [
            "And so now I'm going to move on to use cases in which lexical datasets are linked by are enriched by linking to other kinds of linked data data set.",
            "So kind of the different use cases I want to highlight.",
            "Here are the linking of word senses to onto logical tax taxonomical concepts to describe their extensions, and this is really the outlets reference property.",
            "And then there's a kind of the addition of.",
            "Cyclopedic diptych.",
            "You'd call it that world knowledge.",
            "10 trees such as named entities or geographical entities or bibliographical historical information.",
            "Then there's the linking of red lexicons to registries of linguistic categories or other kinds of linguistic ontologies.",
            "And then there's the linking of lexical entries to text through Canonical identifiers for sections of texts in a corpus or two links between lexical entry and a tree bank or other kind of corporate culture.",
            "In other kinds of formats, I'm not going to talk about these last two, but I'm going to focus on the 1st two and really the second one.",
            "Because the."
        ],
        [
            "First one is basically it's I think is one of the core ideas behind the original Lemon model, which the predecessor to until X.",
            "Lemon Ann.",
            "This kind of this idea of kind of.",
            "Giving a kind of very clear semantics to link data based semantics to the kind of meaning to modeling the meaning of words is what kind of really separates.",
            "I think lemon from the otherwise can quite similar lexical markup framework model."
        ],
        [
            "And this This is why I really want to focus on South.",
            "As another kind of resource is, we can link lexicons with named entities, such as people, locations, events in Semantic Web knowledge basis such as DB pedia or VF an.",
            "Again, it's very useful to standard identifiers for these named entities as it makes individual datasets much more interoperable with each other.",
            "And again using RDF properties to link to.",
            "These means that we're able to specify really the relationships that these named entities have with what's being described.",
            "So, for example, we can augment information about the use of variants in the lexicon variance, which are limited to specific geographical regions by linking them to datasets, and by now it's it's.",
            "There's a lot of conversion.",
            "Geographical datasets available, such as wiki data, Geonames also player.",
            "These are places in the ancient world and again take home messages that link data makes a much.",
            "Makes it simpler to link together heterogeneous datasets for purposes of mutual enrichment."
        ],
        [
            "And one type of extra linguistic knowledge it.",
            "I think it's especially important bibliographic knowledge, So what sources does Lexicon site and what specific conditions of work San for which purposes are there work cited in our lexicon?",
            "And this is probably more applicable to retro digitize lexica rather than the Sayward Nets, so there already exists a vocabulary for describing citation links between documents.",
            "Cyto, although this is at the moment it's mostly focused on scientific documents.",
            "And then obviously citations are very often used to describe lexical attestations, and I'm going to be so this is a plug for my talking Saturday, so I'm actually going to be discussing this use case in more detail at my talk.",
            "And then coming Saturday thinks the last session of your legs and then obviously there are different ways, different levels of which texts or works can be referred to.",
            "And again, there exists a number of FRB are influenced or align vocabulary such as Fabio which enables you to do this which enables you to refer to.",
            "Wax it different kind of.",
            "Levels of the concreteness."
        ],
        [
            "And then here's a list of useful load datasets.",
            "And this is the list.",
            "Thanks to Francesca."
        ],
        [
            "And I'm going to pass on Passover to hi everybody.",
            "Going to continue what Father presented before by showing you two practical examples about entity linking among resources."
        ],
        [
            "Anne.",
            "In order to do this, I'm going to present to Lexa that's web based collaborative tool for constructing computational lexica in Lincoln data paradigms and.",
            "In order to hide, to make easy and since there the construction of computational lexical to human, it's an lexicographers.",
            "By hiding them all.",
            "The technical complexity about semantic web.",
            "Such as RDF encoding, linking data technologies, and so on.",
            "So I'm going to introduce Slack, so show you an example of Lexicon, Lexicon, linking and an example of attestation.",
            "That's how to connect a lexical entry to a graphical description.",
            "Anne."
        ],
        [
            "The main goal of Glaxo is to make simpler an accessible the.",
            "The construction of computational lexical to humanists and lexicographers.",
            "By having by hiding them all the technical complexity behind the underlying model and another important aspect are in electronic lexicography is the collaborative Ness.",
            "A lexical results.",
            "Can be constructed by a team of users in a collaborative way.",
            "So in formal formal representation language, such as owl, that support reasoning mechanisms can be very useful in this case.",
            "For example, in order to avoid conflicting assertions on the same resorts and by using web semantic web standards.",
            "Electrical results can be easily shared on the web and can be."
        ],
        [
            "We easily get it through other resources.",
            "These are the projects from which lack, so is being born.",
            "And now I'm going to introduce lecture by means of the last project that is called it mall and that aims at the representing a multilingual and multi multi alphabet.",
            "The lexicon of Old Archit and Medico botanical, an anatomical terminal."
        ],
        [
            "OK.",
            "Probably I have some resolution problems, but.",
            "Can you can you see?",
            "Can you read?",
            "OK, Alexa is web based application an that allow users to edit lexical resources in a collaborative way.",
            "Each user can have a specific profile.",
            "For example simple user or supervisor, each of which with his own rights.",
            "For example, only supervisor can verify or close an entry.",
            "The model the data model underlying lack soup is on TALX.",
            "That's the core of lemon.",
            "That Jaune briefly presented before, and this is the main interface and on your left.",
            "In you can see the.",
            "The entities related to linguistic, documentary, and semantic aspects, while the right part is dedicated to dial details at the bottom and of the interfaces there is.",
            "Some buttons for insert, nieuwland, menu documentation or export the results and lemma tab.",
            "Lists all the lamb of the Lexicon, an here.",
            "For example, you can.",
            "You can choose an open specific language of the lexicon.",
            "And you can for example.",
            "Search a lemma by clicking on it you can you can see the details according to the to the Lamb on today until X Lemon model.",
            "Each each Lambda is composed of.",
            "Each entry is composed of elama that's represented by this red box, all its flex it forms.",
            "An asset of sense.",
            "Of senses and where lemon.",
            "Represent some phenomenon, an extension of the schema is needed, for example.",
            "In this field, the info that means if Emma is reconstructed form or not.",
            "And the.",
            "For each.",
            "Free for each llama or you can you can add new flex it form you sense is some kinds of relation and for each sense you can specify all this lexical semantical relation with the other entries such as translation, Sinonimo, hyponym and so on.",
            "OK, in the documents tab that you can describe.",
            "The text from which you are constructing your lexicon an when you link lexical form text to a text.",
            "The system creates specific attestation in in this tab that's.",
            "That's this field and you can say you can see details of the station.",
            "Since.",
            "The lemon model is a sort of ontology.",
            "Lexico Lexicon Interface lacks allows to link ontological description to a specific sense.",
            "You can import, for example.",
            "Domain ontology Disease draft ontology about it's a taxonomy about anatomical aspects.",
            "And you can.",
            "By using the reference relation you can you can link each sense of your lexical to the formal description contained in an ontology.",
            "And for example, so you can.",
            "You can access to the lexicon in a semantic way.",
            "In this case, I asked Lexo to list me all the lemma related to the nerve concept.",
            "Finally, you can export your lexiko.",
            "In the in the context model, so in linked data paradigma an lexical is ready to share and to published on the web.",
            "This is the tool we are currently working on at our Institute an by the end of the this year we plan to release the first version as open source.",
            "So I'm going to show you a simple example of Lexicon, Lexicon, linking and.",
            "Suppose we have.",
            "Alan Ward, net and.",
            "Italian lexicon describing morphological and.",
            "Phonetic aspects an I want to.",
            "Connect an entry of.",
            "It'll Ward net to the same entry described in that data set.",
            "So.",
            "I I have to locate the remote sparkle endpoint.",
            "All of this data of that data set.",
            "Locate the specific Antrim.",
            "Create a type in link with my with my word net.",
            "And write the RDF trifle that specifies these links.",
            "So.",
            "I prepared a version of Lexo.",
            "In which I uploaded a subset of it award net.",
            "And.",
            "For example.",
            "The dilemma chest, so turn on.",
            "If I I can create.",
            "For example, a see also link from a specific URL if I have it.",
            "Or I can ask Alexa?",
            "2.",
            "Find.",
            "This entry in the data set we we see before I. Preconfigured relax to with the with the SPARQL endpoint of the simple data sets.",
            "So I can ask Alexa to link to the two entries and.",
            "It makes a sort of difference an Electro pulls down all the aspects that are not in my in my election, so.",
            "I have all the flags that form of a chaser a chaser.",
            "A cheesy cheesy.",
            "And for each form I have the phonetic aspects.",
            "The system.",
            "Creates the link set.",
            "You see before.",
            "That's this.",
            "Our RDF trifle.",
            "That's cool, that's says that my little wahdan three, same as.",
            "Archie Soan, three of the simple data set."
        ],
        [
            "The second example going to show you is about at a station that's in this case.",
            "How can we link?",
            "And then three to a specific bibliographic description.",
            "This example.",
            "By this example, I link an N 3, two NVIDIA graphical description that I imported locali in Lexa.",
            "We imported a graphic description.",
            "We created by using pratigya.",
            "Anne.",
            "Of a description of parody of the Paradiso of the Divine Comedy and motto of the scientific society called The Academia Instrumental.",
            "And they are encoded by using Protege and they follow the the Fr bear model.",
            "Let's search for example.",
            "The N 3.",
            "Editor of Aria.",
            "That's a policy amic verb in Italian.",
            "It has two senses.",
            "And for the first sensor.",
            "Is it equivalent to in English to scold?",
            "And the second sensor is try something again means try something again in this case.",
            "For example, I have two.",
            "Create an attestation.",
            "In Moto of academic instrumental.",
            "Fact sorry.",
            "And until I can, I can.",
            "Cut and paste the context.",
            "Of the of this sensor.",
            "This form.",
            "I can.",
            "Put some.",
            "People graph some information and details.",
            "And the system creates the link.",
            "With the.",
            "Maybe between the entry descends, specific sense and the big graphic description for I can make the same same thing with the second sensor.",
            "I cannot pass this second sense.",
            "In mortal chimento and the system.",
            "Creates the link.",
            "And you can see all the deactivation of each sensor inside the related box."
        ],
        [
            "OK our.",
            "Goal is to share you with you our experiences on these topics and father.",
            "Introduce.",
            "And this message concepts, linking opportunities and challenges in the lab.",
            "And I present you.",
            "An instrument that is being born an.",
            "Who are supporting humanistic support?",
            "If it's in stock?"
        ],
        [
            "Update update.",
            "And trying to rescue you, stopping Sir, we are under.",
            "And finally, we want that special for his best support.",
            "Cars."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this introduction is really intended as an introduction.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Add to the possibilities for Inter and intra data set linking that their semantic web offers to anyone thinking publishing their own linguistic resource is linked data.",
                    "label": 1
                },
                {
                    "sent": "In particular, it seemed anyone who's working with digital lexicons, including in particular word Nets, given the theme of the workshop and also retro digitized legs, retro digitized dictionaries.",
                    "label": 0
                },
                {
                    "sent": "So can fancy language arrangements.",
                    "label": 1
                },
                {
                    "sent": "Talk is to conceptually foreground the notion of a link.",
                    "label": 0
                },
                {
                    "sent": "Ann Link data and and on the Semantic Web and so the session is going to be broken up into two parts.",
                    "label": 0
                },
                {
                    "sent": "In the first part I'm going to go through some of the basics of the semantic Web as they pertain to the question of linking resources together, and then I'm going to explore some concrete use cases in the second part, Andrea is going to show some actual examples of linking using a tool which is being developed at our Institute, which is really an interface for creating and editing link data lexicons.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm going to assume I'm only going to see minimal amount background knowledge on linked data and the semantic Web or however, I'm going to go quite quickly over a lot with a bit of materials, so if anything is unclear, please feel free to interrupt me and ask questions, OK?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Going to start with some very basic definitions and John is already gone through some of this material in his his presentation.",
                    "label": 0
                },
                {
                    "sent": "So link data is basically it's a method of publishing structured data so that it can be interlinked and become more useful through semantic queries.",
                    "label": 1
                },
                {
                    "sent": "And I've stolen this definition from Wikipedia and so then there's the semantic web which is basically it's a web of data sets that are structured in linked together using a common set of standards and technology so that they can be more easily processed by computers in terms of what they mean.",
                    "label": 1
                },
                {
                    "sent": "In contrast to normal hypertext documents which are really designed to be read by humans, so just kind of summarize these two definitions, link data is 1 very important way of making the semantic web reality, and then there are the core link.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The principles which I'm sure most of you have already heard of an.",
                    "label": 0
                },
                {
                    "sent": "These are basically that you use your eyes, which are universal resource identifiers, is names for things, and you should also be able to look up these your eyes and then when someone looks up you are I.",
                    "label": 1
                },
                {
                    "sent": "They should be able to access useful information using various different standards and that your datasets should also include your eyes to other links to other ur eyes so that that.",
                    "label": 0
                },
                {
                    "sent": "We did.",
                    "label": 0
                },
                {
                    "sent": "Your users can discover more things and then if in addition to these four prerequisites, the data is made available using an open license, then it's classified as linked open data.",
                    "label": 1
                },
                {
                    "sent": "So again, to sum up, these four points that these principles are really meant to encourage the maximum of interoperability between datasets.",
                    "label": 1
                },
                {
                    "sent": "Anta facilities facilitate a more explicit encoding of meaning within and between datasets.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so the main standard which is used or one of the most important standards which is used to publish data on the semantic web is the Resource Description framework, an kind of the important thing too.",
                    "label": 1
                },
                {
                    "sent": "Mention about the results are a bit RDF is that mix the constraint that our data must be described using statements of the form subject, predicate, object where this subject and object are.",
                    "label": 1
                },
                {
                    "sent": "Each resource is so the conceptual things of the last slide and they have their own ur eyes and then these subject and predicate resource is are related together by a predicate which is often called a property or roll and which is also resource with its own ur eyes and these statements are known as RDF triples and a link data data set consists of a series of such triples.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The resource is which I referred to in the last slide.",
                    "label": 0
                },
                {
                    "sent": "Can either be individuals such as Ljubljana, Slovenia, Andrea, Blondie or they can be classes such as the class events, class of cities, or they can also be relations such as X loves YX is bigger than Y, we will often find the classes or individuals or properties we're looking for when creating building our own data sets and other datasets and we should reuse them if the semantics are right.",
                    "label": 1
                },
                {
                    "sent": "If we can't.",
                    "label": 0
                },
                {
                    "sent": "Obviously if we can't find what we need among existing data vocabularies and we should create our own.",
                    "label": 0
                },
                {
                    "sent": "Resources our own individual properties in classes in essence.",
                    "label": 0
                },
                {
                    "sent": "Then, RDF allows us to build up graphs linking together resources, and these graphs are distributed across different web locations and we can access them using the HTTP protocol so.",
                    "label": 1
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The RDF and RDF S give us a number of built-in properties which constrain how we can, how we put a constraint on how we build up our graphs, and they allow for more concision in our data as well.",
                    "label": 1
                },
                {
                    "sent": "So basically I skip to slide.",
                    "label": 0
                },
                {
                    "sent": "I deleted a slide which actually explains which these built-in properties are, but they're basically RDF type.",
                    "label": 0
                },
                {
                    "sent": "An RDF subclass of which are built in properties which you get for free with the RDF and with RDF switches built on top of it.",
                    "label": 0
                },
                {
                    "sent": "Just a standard which is built on top of RDF.",
                    "label": 0
                },
                {
                    "sent": "So in the previous diagram, if you look at this diagram, I've created a graph little graph which describes the city of Lubiana, which says that Lubiana is of type city and city is a subtype of or subclass of location and.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Obviously, as I said before, we can reuse classes and individuals and resources and relations.",
                    "label": 0
                },
                {
                    "sent": "So here for example, I created a little diagram which describes the workshop, which is that it's of type event and I've taken this event class from DB pedia.",
                    "label": 0
                },
                {
                    "sent": "DPT and it's spelled incorrectly and then I've also taken the city Ljubljana from the Peter and also the relation located in area again, from the DPP deontology.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So by using shared vocabularies and standard identifiers to describe our data, it becomes much easier to integrate them with other datasets, since obviously where these datasets are using the same names to refer to the same things, and this opens up the possibility of being of being able to query large numbers of datasets at the same time, and then obviously another important standard on the semantic web is sparkle, which gives us a powerful query language for querying linked data datasets, and then we can make our datasets publicly queryable by exposing them.",
                    "label": 1
                },
                {
                    "sent": "Using sparkle endpoints and just to mention this website, which is really useful, so it's it's called delovi.",
                    "label": 1
                },
                {
                    "sent": "It's hosted by the open node transition.",
                    "label": 0
                },
                {
                    "sent": "It's search engine facility which enables you to look up various different link data vocabularies.",
                    "label": 0
                },
                {
                    "sent": "So this is just kind of giving you a rundown of some of the basics here.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then something which will be important for the rest of the talk is that in addition to the built-in properties which I mentioned before, which shows RDF type in RDF subclass of, there are a number of properties which allow us to actually.",
                    "label": 1
                },
                {
                    "sent": "Describe relations between between resource is so.",
                    "label": 0
                },
                {
                    "sent": "For example, we can say that one property or relation is a sub property of another using RDF.",
                    "label": 1
                },
                {
                    "sent": "Sub property of.",
                    "label": 0
                },
                {
                    "sent": "So for example, we can see that has sister.",
                    "label": 0
                },
                {
                    "sent": "So if we create a a relation of property has sister then we can say OK so sub property of a broader relation has similar has sibling and then we can also we can also do with thanks to our DFS is that we can specify the domains and ranges of properties.",
                    "label": 1
                },
                {
                    "sent": "So that's the classes of things that are property.",
                    "label": 1
                },
                {
                    "sent": "And potentially relate together.",
                    "label": 0
                },
                {
                    "sent": "And so, for example, we can specify the domain of his mother as human, but then we can say the range of his mother is female human.",
                    "label": 1
                },
                {
                    "sent": "So this is a way of actually kind of specifying the meanings of properties using kind of a fairly basic set of properties which come with RDF.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what I'm kind of trying to get out here with these last few slides is that.",
                    "label": 0
                },
                {
                    "sent": "It kind of should make it clear, should make clear that the basic.",
                    "label": 0
                },
                {
                    "sent": "How different, for example, this conception of data modeling and linked data is from a standard like TI, 'cause our datasets essentially consists of a series of triples which represent declarative subject, predicate object statements, and this should be viewed as graphs with edges with meaningful labels rather than as innocent either.",
                    "label": 1
                },
                {
                    "sent": "Really, what you're dealing with are really trees an what this means is that it's harder.",
                    "label": 0
                },
                {
                    "sent": "More variables to do things which are perhaps kind of fairly straightforward with the standard leichty, such as creating.",
                    "label": 1
                },
                {
                    "sent": "Digital editions of texts and Link data, but it makes other things much easier, and here I'm really kind of.",
                    "label": 0
                },
                {
                    "sent": "Well, what I really want to kind of refer to is can basically representation of networks that something comes very naturally with the RDF.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then of course, if in terms of describing the meanings of classes and properties and so on, there are other kind of standards.",
                    "label": 0
                },
                {
                    "sent": "This semantic web standards which give us much more expressive iti, such As for example, the Web Ontology language.",
                    "label": 1
                },
                {
                    "sent": "And then there's also scores which is really kind of more focused on allowing the creation of taxonomies of concepts so.",
                    "label": 1
                },
                {
                    "sent": "But I'm not going to go into much detail on that.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So like I said, my talk is really about properties about linking together different resources, and two of the kind of most generic, and I guess most important ways of linking together resource is.",
                    "label": 0
                },
                {
                    "sent": "The semantic web are the properties.",
                    "label": 1
                },
                {
                    "sent": "See also and same as the first of these is a built-in property.",
                    "label": 1
                },
                {
                    "sent": "Also has a built in property of RDF's and the other one is a built-in property of our Web Ontology language.",
                    "label": 1
                },
                {
                    "sent": "See also is a property which allows us to state that one.",
                    "label": 0
                },
                {
                    "sent": "So if you include it in a triple, what's you also basically allows you to do is to relate together the subject and the object of the triple.",
                    "label": 0
                },
                {
                    "sent": "And basically it doesn't most generic way possible.",
                    "label": 1
                },
                {
                    "sent": "So basically says the object is somehow relevant to the subject.",
                    "label": 0
                },
                {
                    "sent": "So for example here I've given an example triple so lubiana.",
                    "label": 0
                },
                {
                    "sent": "Is Slovenia somehow relevant to Lubiana but we don't specify what?",
                    "label": 0
                },
                {
                    "sent": "How much weight is actually relevant, whereas same as is a much stronger kind of semantics.",
                    "label": 1
                },
                {
                    "sent": "So same as basically states that two ur eyes actually refer to the same thing.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So sum up again semantic Web and link.",
                    "label": 0
                },
                {
                    "sent": "So the important thing to kind of keep in mind rings to the rest of this talk is that semantic web and link data really enabled the creation distributed knowledge graphs in which the links between the concepts and resource is across datasets can be assigned meanings using formal languages of different levels of expressivity's, so I said probably the most basic level is RDF, but then you have RDF's and then you have hours so you can read it.",
                    "label": 1
                },
                {
                    "sent": "You can kind of specify the meanings of the links between.",
                    "label": 0
                },
                {
                    "sent": "Different datasets and resources, and as I said, again, this is something which I really want to emphasize.",
                    "label": 1
                },
                {
                    "sent": "That kind of necessitates kind of change of mindset in comparison to other kind of standards which may be humanist are more used to like TI and I would, I would argue that the semantic web seems to draw more towards the classical AI knowledge engineering approach, and so in the rest of the talk after this kind of very brief resume, I really want to focus on on the kind of opportunities and challenges which.",
                    "label": 0
                },
                {
                    "sent": "Modelling lexical resources linked data throws up, and in particular, what I really want to focus on is how we can actually enrich individual lexical resource is whether those are reward Nets or retro digitized dictionaries, or any kind of lexicon by linking them to other kinds of resources.",
                    "label": 0
                },
                {
                    "sent": "Whether these are lexical resource is or.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Not so sip of water.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'm not in this part.",
                    "label": 0
                },
                {
                    "sent": "What I want to focus on our kind of two questions.",
                    "label": 0
                },
                {
                    "sent": "So first question is what kind of links would be particularly interesting or helpful for consumers of lexical RDF datasets?",
                    "label": 1
                },
                {
                    "sent": "And then the second question is, how can we best augment lexical datas with the kind of lexical datasets with the kinds of links we saw earlier?",
                    "label": 1
                },
                {
                    "sent": "So in what follows in Williston number, why think of the most interesting and useful kinds of links that we can add to lexical datasets?",
                    "label": 0
                },
                {
                    "sent": "And I'm going to do this by highlighting two sets of use cases.",
                    "label": 0
                },
                {
                    "sent": "The first set of use cases deals with links between lexical datasets and a second set of use cases deals with links between lexical datasets and other kinds of datasets.",
                    "label": 1
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Fortunately, due to time constraints, and we'll be able to talk about the very important topic of actually linking to link data.",
                    "label": 1
                },
                {
                    "sent": "Lexicons from other kinds of datasets.",
                    "label": 0
                },
                {
                    "sent": "So, for example, very kind of probably most well known use cases.",
                    "label": 0
                },
                {
                    "sent": "The link the annotation of corpora with the.",
                    "label": 0
                },
                {
                    "sent": "Using ur eyes from.",
                    "label": 1
                },
                {
                    "sent": "The link data resources such as DB Pedia, but I just want you to bear in mind this is a very important application of lexical linked data datasets.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what, then are some interesting use cases for linking individual lexical datasets together?",
                    "label": 1
                },
                {
                    "sent": "And this is just as a caveat, this is not an exhaustive list.",
                    "label": 0
                },
                {
                    "sent": "So first when I mentioned here is the creation of links between entries for the same word in different lexicons in order to make additional linguistic information accessible.",
                    "label": 0
                },
                {
                    "sent": "So, for instance, this is very useful for word, NetSuite, which usually do not include a lot of information in terms of phonetics or or phonology, or phonetics, or morphosyntactic information.",
                    "label": 0
                },
                {
                    "sent": "Then another use case which I want to look at is the creation of BI or multilingual lexic.",
                    "label": 0
                },
                {
                    "sent": "Resources by linking together senses that are translations or equivalents of one another, I think this has been mentioned a few times today already, so I'm not going to put very much depth about it.",
                    "label": 0
                },
                {
                    "sent": "And then there's the modeling of etymological data and the referencing words in other languages as part of individual work histories and the 4th one, which I'm not really going to talk about, which I'd like to mention because I think it's very interesting project is the actual linking between different editions of the same dictionary, so this is something more obviously more relevant.",
                    "label": 1
                },
                {
                    "sent": "Director digitized dictionaries, so it's the.",
                    "label": 0
                },
                {
                    "sent": "Linking between kind of entries to North Tracy.",
                    "label": 0
                },
                {
                    "sent": "Evolution of how how different words have been treated across different versions of the same dictionary and one very good example is this is the new far project which if you have questions about, please ask for referral Director Francesca because she's working on this project.",
                    "label": 0
                },
                {
                    "sent": "It's a very interesting one.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so I think I think we've seen this.",
                    "label": 0
                },
                {
                    "sent": "This has been discussed already, but the simplest kind of lexicon to lexicon linking.",
                    "label": 1
                },
                {
                    "sent": "We can carry out its linking together entries for the same word but across different lexicons, and in this case we can use the same as relation to do the linking.",
                    "label": 1
                },
                {
                    "sent": "So for instance that Tallinna tell Ward net like I said, like most word Nets, is not a lot of comprehensive morphosyntactic phonetic information.",
                    "label": 0
                },
                {
                    "sent": "But at my Institute we also have this kind of a very kind of.",
                    "label": 0
                },
                {
                    "sent": "Extensive lexical resource called simple which contains a lot of morphosyntactic in.",
                    "label": 0
                },
                {
                    "sent": "Also semantic information, and So what would be kind of very useful would be to link an entry such as Caligari, an award that too simple, and this would enable you to access very easily all the extra information that's in simple.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But there's a caveat here, because the semantics of same ol same as may not always be.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Appropriate case when two and the two lexical resource sources being linked together contain differing or contradictory information about the same entry, and this is something that so it's not.",
                    "label": 1
                },
                {
                    "sent": "Obviously it's not limited just to lexical resource is the semantics of same as is so so obviously a more general problem when it comes to link data.",
                    "label": 0
                },
                {
                    "sent": "So either either so in order to kind of overcome this year you either need to be very careful when you're actually creating these links between different resources, or.",
                    "label": 0
                },
                {
                    "sent": "Perhaps we can think about maybe using another property to link together.",
                    "label": 0
                },
                {
                    "sent": "Two entries in different resources, which basically you're dealing with the same entry, but you're not sure whether they contain whether the information is consistent across the two resources.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then the.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We can also infect another kind of very useful use case, or can have something where linking really comes into its own is in the creation of bilingual or multilingual resources.",
                    "label": 0
                },
                {
                    "sent": "By linking together the senses contained in monolingual lexicons, just can either be semi automatically, automatically, or even manually, and we're very lucky because the until X lemon vocabulary already provides a host of properties and classes which enable us to do this, and this is actually.",
                    "label": 1
                },
                {
                    "sent": "There's been kind of some work done on this on with respect to the repair team series of dictionaries, and so I think I think it's a 2:00 PM.",
                    "label": 0
                },
                {
                    "sent": "Or basically they are thinking a number of this is been a collaboration between number Spanish universities where they managed to actually linked together large number of language pairs using using.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Lemon.",
                    "label": 0
                },
                {
                    "sent": "And then there's a linking together lexicons in order to model etymologies.",
                    "label": 0
                },
                {
                    "sent": "And, as I say, RDF is an semantic web.",
                    "label": 0
                },
                {
                    "sent": "In general, it really comes into its own when we're actually modeling data which is actually graph like, or which is kind of structured as a network.",
                    "label": 0
                },
                {
                    "sent": "An etymologies are kind of essentially descriptions of graphs, and very often they involve different kinds of historical and more generally non linguistic information.",
                    "label": 1
                },
                {
                    "sent": "Which makes them perfect candidates for being modeled as linked data.",
                    "label": 0
                },
                {
                    "sent": "So for example.",
                    "label": 0
                },
                {
                    "sent": "Billing data is enables you to kind of distribute.",
                    "label": 0
                },
                {
                    "sent": "As I said, distributed knowledge across different kind of nodes in a graph.",
                    "label": 0
                },
                {
                    "sent": "So for example, if you're able to.",
                    "label": 1
                },
                {
                    "sent": "Use properties or classes or or individuals from.",
                    "label": 0
                },
                {
                    "sent": "I don't know from vocabulary dealing with metaphor, metonym, this actually enables to describe metaphorical sense shifts between meanings of words.",
                    "label": 0
                },
                {
                    "sent": "So that's just one example where you can actually refer to information.",
                    "label": 0
                },
                {
                    "sent": "It's not, strictly speaking.",
                    "label": 0
                },
                {
                    "sent": "Kind of dealing with the same kind of topic that you're dealing with, but which is very, very useful in which can be reused.",
                    "label": 0
                },
                {
                    "sent": "And then of course, in order to represent the etymology of the word, we need to create links between the entry for that word and entries in other lexicons, or in the same lexecon.",
                    "label": 1
                },
                {
                    "sent": "And these, like I say, RDF and the all the other standards that I mentioned are really kind of useful that they allow you to give meanings to these links, and so that you can actually type your links for the specific kinds of historical relationships which obtained between different words.",
                    "label": 0
                },
                {
                    "sent": "So the relationship of inheritance so awards is inherited from a parent language or words borrowed from a from another language.",
                    "label": 0
                },
                {
                    "sent": "This is something that you can actually.",
                    "label": 0
                },
                {
                    "sent": "Give these links meanings and then I just like to mention I also like to mention that this is already been kind of.",
                    "label": 0
                },
                {
                    "sent": "Worked worked on this is this this idea of kind of actually using linked data principles to model etymological networks is actually some an idea.",
                    "label": 0
                },
                {
                    "sent": "That's it's not that new.",
                    "label": 0
                },
                {
                    "sent": "So early exists a resource which is kind of based on this idea.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then another kind of, you know.",
                    "label": 0
                },
                {
                    "sent": "A positive.",
                    "label": 0
                },
                {
                    "sent": "I don't know why you would call it, but there's kind of screen push at the moment for towards publishing.",
                    "label": 0
                },
                {
                    "sent": "Lexical resource is for historical languages such as ancient Greek, Greek and Latin, and linked data and talk to Frances Bond.",
                    "label": 1
                },
                {
                    "sent": "And he says that he's kind of fairly sure that there's going to be.",
                    "label": 0
                },
                {
                    "sent": "I think Wordnet Latin word that's already available in ancient Greek word net.",
                    "label": 0
                },
                {
                    "sent": "It's kind of.",
                    "label": 0
                },
                {
                    "sent": "I think it's public, but it's kind of.",
                    "label": 0
                },
                {
                    "sent": "It needs to be cleaned up an I think there's also talk of the Sanskrit word net being made publicly available soonish at the moment, so the until excellent group is working on developing etymology module for lemon and anyone who's interested in contributing to this module is invited to participate by joining the mailing.",
                    "label": 1
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so now I'm going to move on to use cases in which lexical datasets are linked by are enriched by linking to other kinds of linked data data set.",
                    "label": 1
                },
                {
                    "sent": "So kind of the different use cases I want to highlight.",
                    "label": 0
                },
                {
                    "sent": "Here are the linking of word senses to onto logical tax taxonomical concepts to describe their extensions, and this is really the outlets reference property.",
                    "label": 1
                },
                {
                    "sent": "And then there's a kind of the addition of.",
                    "label": 0
                },
                {
                    "sent": "Cyclopedic diptych.",
                    "label": 1
                },
                {
                    "sent": "You'd call it that world knowledge.",
                    "label": 0
                },
                {
                    "sent": "10 trees such as named entities or geographical entities or bibliographical historical information.",
                    "label": 0
                },
                {
                    "sent": "Then there's the linking of red lexicons to registries of linguistic categories or other kinds of linguistic ontologies.",
                    "label": 1
                },
                {
                    "sent": "And then there's the linking of lexical entries to text through Canonical identifiers for sections of texts in a corpus or two links between lexical entry and a tree bank or other kind of corporate culture.",
                    "label": 0
                },
                {
                    "sent": "In other kinds of formats, I'm not going to talk about these last two, but I'm going to focus on the 1st two and really the second one.",
                    "label": 0
                },
                {
                    "sent": "Because the.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First one is basically it's I think is one of the core ideas behind the original Lemon model, which the predecessor to until X.",
                    "label": 1
                },
                {
                    "sent": "Lemon Ann.",
                    "label": 0
                },
                {
                    "sent": "This kind of this idea of kind of.",
                    "label": 0
                },
                {
                    "sent": "Giving a kind of very clear semantics to link data based semantics to the kind of meaning to modeling the meaning of words is what kind of really separates.",
                    "label": 1
                },
                {
                    "sent": "I think lemon from the otherwise can quite similar lexical markup framework model.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this This is why I really want to focus on South.",
                    "label": 0
                },
                {
                    "sent": "As another kind of resource is, we can link lexicons with named entities, such as people, locations, events in Semantic Web knowledge basis such as DB pedia or VF an.",
                    "label": 1
                },
                {
                    "sent": "Again, it's very useful to standard identifiers for these named entities as it makes individual datasets much more interoperable with each other.",
                    "label": 1
                },
                {
                    "sent": "And again using RDF properties to link to.",
                    "label": 0
                },
                {
                    "sent": "These means that we're able to specify really the relationships that these named entities have with what's being described.",
                    "label": 0
                },
                {
                    "sent": "So, for example, we can augment information about the use of variants in the lexicon variance, which are limited to specific geographical regions by linking them to datasets, and by now it's it's.",
                    "label": 1
                },
                {
                    "sent": "There's a lot of conversion.",
                    "label": 0
                },
                {
                    "sent": "Geographical datasets available, such as wiki data, Geonames also player.",
                    "label": 1
                },
                {
                    "sent": "These are places in the ancient world and again take home messages that link data makes a much.",
                    "label": 0
                },
                {
                    "sent": "Makes it simpler to link together heterogeneous datasets for purposes of mutual enrichment.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And one type of extra linguistic knowledge it.",
                    "label": 1
                },
                {
                    "sent": "I think it's especially important bibliographic knowledge, So what sources does Lexicon site and what specific conditions of work San for which purposes are there work cited in our lexicon?",
                    "label": 1
                },
                {
                    "sent": "And this is probably more applicable to retro digitize lexica rather than the Sayward Nets, so there already exists a vocabulary for describing citation links between documents.",
                    "label": 1
                },
                {
                    "sent": "Cyto, although this is at the moment it's mostly focused on scientific documents.",
                    "label": 0
                },
                {
                    "sent": "And then obviously citations are very often used to describe lexical attestations, and I'm going to be so this is a plug for my talking Saturday, so I'm actually going to be discussing this use case in more detail at my talk.",
                    "label": 1
                },
                {
                    "sent": "And then coming Saturday thinks the last session of your legs and then obviously there are different ways, different levels of which texts or works can be referred to.",
                    "label": 0
                },
                {
                    "sent": "And again, there exists a number of FRB are influenced or align vocabulary such as Fabio which enables you to do this which enables you to refer to.",
                    "label": 0
                },
                {
                    "sent": "Wax it different kind of.",
                    "label": 0
                },
                {
                    "sent": "Levels of the concreteness.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then here's a list of useful load datasets.",
                    "label": 0
                },
                {
                    "sent": "And this is the list.",
                    "label": 0
                },
                {
                    "sent": "Thanks to Francesca.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I'm going to pass on Passover to hi everybody.",
                    "label": 0
                },
                {
                    "sent": "Going to continue what Father presented before by showing you two practical examples about entity linking among resources.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "In order to do this, I'm going to present to Lexa that's web based collaborative tool for constructing computational lexica in Lincoln data paradigms and.",
                    "label": 0
                },
                {
                    "sent": "In order to hide, to make easy and since there the construction of computational lexical to human, it's an lexicographers.",
                    "label": 0
                },
                {
                    "sent": "By hiding them all.",
                    "label": 0
                },
                {
                    "sent": "The technical complexity about semantic web.",
                    "label": 0
                },
                {
                    "sent": "Such as RDF encoding, linking data technologies, and so on.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to introduce Slack, so show you an example of Lexicon, Lexicon, linking and an example of attestation.",
                    "label": 0
                },
                {
                    "sent": "That's how to connect a lexical entry to a graphical description.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The main goal of Glaxo is to make simpler an accessible the.",
                    "label": 0
                },
                {
                    "sent": "The construction of computational lexical to humanists and lexicographers.",
                    "label": 1
                },
                {
                    "sent": "By having by hiding them all the technical complexity behind the underlying model and another important aspect are in electronic lexicography is the collaborative Ness.",
                    "label": 1
                },
                {
                    "sent": "A lexical results.",
                    "label": 1
                },
                {
                    "sent": "Can be constructed by a team of users in a collaborative way.",
                    "label": 1
                },
                {
                    "sent": "So in formal formal representation language, such as owl, that support reasoning mechanisms can be very useful in this case.",
                    "label": 0
                },
                {
                    "sent": "For example, in order to avoid conflicting assertions on the same resorts and by using web semantic web standards.",
                    "label": 1
                },
                {
                    "sent": "Electrical results can be easily shared on the web and can be.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We easily get it through other resources.",
                    "label": 0
                },
                {
                    "sent": "These are the projects from which lack, so is being born.",
                    "label": 0
                },
                {
                    "sent": "And now I'm going to introduce lecture by means of the last project that is called it mall and that aims at the representing a multilingual and multi multi alphabet.",
                    "label": 0
                },
                {
                    "sent": "The lexicon of Old Archit and Medico botanical, an anatomical terminal.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Probably I have some resolution problems, but.",
                    "label": 0
                },
                {
                    "sent": "Can you can you see?",
                    "label": 0
                },
                {
                    "sent": "Can you read?",
                    "label": 0
                },
                {
                    "sent": "OK, Alexa is web based application an that allow users to edit lexical resources in a collaborative way.",
                    "label": 0
                },
                {
                    "sent": "Each user can have a specific profile.",
                    "label": 0
                },
                {
                    "sent": "For example simple user or supervisor, each of which with his own rights.",
                    "label": 0
                },
                {
                    "sent": "For example, only supervisor can verify or close an entry.",
                    "label": 1
                },
                {
                    "sent": "The model the data model underlying lack soup is on TALX.",
                    "label": 0
                },
                {
                    "sent": "That's the core of lemon.",
                    "label": 1
                },
                {
                    "sent": "That Jaune briefly presented before, and this is the main interface and on your left.",
                    "label": 0
                },
                {
                    "sent": "In you can see the.",
                    "label": 0
                },
                {
                    "sent": "The entities related to linguistic, documentary, and semantic aspects, while the right part is dedicated to dial details at the bottom and of the interfaces there is.",
                    "label": 0
                },
                {
                    "sent": "Some buttons for insert, nieuwland, menu documentation or export the results and lemma tab.",
                    "label": 0
                },
                {
                    "sent": "Lists all the lamb of the Lexicon, an here.",
                    "label": 0
                },
                {
                    "sent": "For example, you can.",
                    "label": 0
                },
                {
                    "sent": "You can choose an open specific language of the lexicon.",
                    "label": 0
                },
                {
                    "sent": "And you can for example.",
                    "label": 0
                },
                {
                    "sent": "Search a lemma by clicking on it you can you can see the details according to the to the Lamb on today until X Lemon model.",
                    "label": 0
                },
                {
                    "sent": "Each each Lambda is composed of.",
                    "label": 0
                },
                {
                    "sent": "Each entry is composed of elama that's represented by this red box, all its flex it forms.",
                    "label": 0
                },
                {
                    "sent": "An asset of sense.",
                    "label": 0
                },
                {
                    "sent": "Of senses and where lemon.",
                    "label": 0
                },
                {
                    "sent": "Represent some phenomenon, an extension of the schema is needed, for example.",
                    "label": 0
                },
                {
                    "sent": "In this field, the info that means if Emma is reconstructed form or not.",
                    "label": 0
                },
                {
                    "sent": "And the.",
                    "label": 0
                },
                {
                    "sent": "For each.",
                    "label": 0
                },
                {
                    "sent": "Free for each llama or you can you can add new flex it form you sense is some kinds of relation and for each sense you can specify all this lexical semantical relation with the other entries such as translation, Sinonimo, hyponym and so on.",
                    "label": 0
                },
                {
                    "sent": "OK, in the documents tab that you can describe.",
                    "label": 0
                },
                {
                    "sent": "The text from which you are constructing your lexicon an when you link lexical form text to a text.",
                    "label": 0
                },
                {
                    "sent": "The system creates specific attestation in in this tab that's.",
                    "label": 0
                },
                {
                    "sent": "That's this field and you can say you can see details of the station.",
                    "label": 0
                },
                {
                    "sent": "Since.",
                    "label": 0
                },
                {
                    "sent": "The lemon model is a sort of ontology.",
                    "label": 0
                },
                {
                    "sent": "Lexico Lexicon Interface lacks allows to link ontological description to a specific sense.",
                    "label": 0
                },
                {
                    "sent": "You can import, for example.",
                    "label": 0
                },
                {
                    "sent": "Domain ontology Disease draft ontology about it's a taxonomy about anatomical aspects.",
                    "label": 0
                },
                {
                    "sent": "And you can.",
                    "label": 0
                },
                {
                    "sent": "By using the reference relation you can you can link each sense of your lexical to the formal description contained in an ontology.",
                    "label": 0
                },
                {
                    "sent": "And for example, so you can.",
                    "label": 0
                },
                {
                    "sent": "You can access to the lexicon in a semantic way.",
                    "label": 0
                },
                {
                    "sent": "In this case, I asked Lexo to list me all the lemma related to the nerve concept.",
                    "label": 0
                },
                {
                    "sent": "Finally, you can export your lexiko.",
                    "label": 0
                },
                {
                    "sent": "In the in the context model, so in linked data paradigma an lexical is ready to share and to published on the web.",
                    "label": 0
                },
                {
                    "sent": "This is the tool we are currently working on at our Institute an by the end of the this year we plan to release the first version as open source.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to show you a simple example of Lexicon, Lexicon, linking and.",
                    "label": 0
                },
                {
                    "sent": "Suppose we have.",
                    "label": 0
                },
                {
                    "sent": "Alan Ward, net and.",
                    "label": 0
                },
                {
                    "sent": "Italian lexicon describing morphological and.",
                    "label": 0
                },
                {
                    "sent": "Phonetic aspects an I want to.",
                    "label": 0
                },
                {
                    "sent": "Connect an entry of.",
                    "label": 0
                },
                {
                    "sent": "It'll Ward net to the same entry described in that data set.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I I have to locate the remote sparkle endpoint.",
                    "label": 1
                },
                {
                    "sent": "All of this data of that data set.",
                    "label": 0
                },
                {
                    "sent": "Locate the specific Antrim.",
                    "label": 0
                },
                {
                    "sent": "Create a type in link with my with my word net.",
                    "label": 0
                },
                {
                    "sent": "And write the RDF trifle that specifies these links.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I prepared a version of Lexo.",
                    "label": 0
                },
                {
                    "sent": "In which I uploaded a subset of it award net.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "For example.",
                    "label": 0
                },
                {
                    "sent": "The dilemma chest, so turn on.",
                    "label": 0
                },
                {
                    "sent": "If I I can create.",
                    "label": 0
                },
                {
                    "sent": "For example, a see also link from a specific URL if I have it.",
                    "label": 0
                },
                {
                    "sent": "Or I can ask Alexa?",
                    "label": 0
                },
                {
                    "sent": "2.",
                    "label": 0
                },
                {
                    "sent": "Find.",
                    "label": 0
                },
                {
                    "sent": "This entry in the data set we we see before I. Preconfigured relax to with the with the SPARQL endpoint of the simple data sets.",
                    "label": 0
                },
                {
                    "sent": "So I can ask Alexa to link to the two entries and.",
                    "label": 0
                },
                {
                    "sent": "It makes a sort of difference an Electro pulls down all the aspects that are not in my in my election, so.",
                    "label": 0
                },
                {
                    "sent": "I have all the flags that form of a chaser a chaser.",
                    "label": 0
                },
                {
                    "sent": "A cheesy cheesy.",
                    "label": 0
                },
                {
                    "sent": "And for each form I have the phonetic aspects.",
                    "label": 0
                },
                {
                    "sent": "The system.",
                    "label": 0
                },
                {
                    "sent": "Creates the link set.",
                    "label": 0
                },
                {
                    "sent": "You see before.",
                    "label": 0
                },
                {
                    "sent": "That's this.",
                    "label": 0
                },
                {
                    "sent": "Our RDF trifle.",
                    "label": 0
                },
                {
                    "sent": "That's cool, that's says that my little wahdan three, same as.",
                    "label": 0
                },
                {
                    "sent": "Archie Soan, three of the simple data set.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The second example going to show you is about at a station that's in this case.",
                    "label": 0
                },
                {
                    "sent": "How can we link?",
                    "label": 0
                },
                {
                    "sent": "And then three to a specific bibliographic description.",
                    "label": 0
                },
                {
                    "sent": "This example.",
                    "label": 0
                },
                {
                    "sent": "By this example, I link an N 3, two NVIDIA graphical description that I imported locali in Lexa.",
                    "label": 0
                },
                {
                    "sent": "We imported a graphic description.",
                    "label": 0
                },
                {
                    "sent": "We created by using pratigya.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Of a description of parody of the Paradiso of the Divine Comedy and motto of the scientific society called The Academia Instrumental.",
                    "label": 1
                },
                {
                    "sent": "And they are encoded by using Protege and they follow the the Fr bear model.",
                    "label": 0
                },
                {
                    "sent": "Let's search for example.",
                    "label": 0
                },
                {
                    "sent": "The N 3.",
                    "label": 0
                },
                {
                    "sent": "Editor of Aria.",
                    "label": 0
                },
                {
                    "sent": "That's a policy amic verb in Italian.",
                    "label": 0
                },
                {
                    "sent": "It has two senses.",
                    "label": 0
                },
                {
                    "sent": "And for the first sensor.",
                    "label": 0
                },
                {
                    "sent": "Is it equivalent to in English to scold?",
                    "label": 0
                },
                {
                    "sent": "And the second sensor is try something again means try something again in this case.",
                    "label": 0
                },
                {
                    "sent": "For example, I have two.",
                    "label": 0
                },
                {
                    "sent": "Create an attestation.",
                    "label": 0
                },
                {
                    "sent": "In Moto of academic instrumental.",
                    "label": 0
                },
                {
                    "sent": "Fact sorry.",
                    "label": 0
                },
                {
                    "sent": "And until I can, I can.",
                    "label": 0
                },
                {
                    "sent": "Cut and paste the context.",
                    "label": 0
                },
                {
                    "sent": "Of the of this sensor.",
                    "label": 0
                },
                {
                    "sent": "This form.",
                    "label": 0
                },
                {
                    "sent": "I can.",
                    "label": 0
                },
                {
                    "sent": "Put some.",
                    "label": 0
                },
                {
                    "sent": "People graph some information and details.",
                    "label": 0
                },
                {
                    "sent": "And the system creates the link.",
                    "label": 0
                },
                {
                    "sent": "With the.",
                    "label": 0
                },
                {
                    "sent": "Maybe between the entry descends, specific sense and the big graphic description for I can make the same same thing with the second sensor.",
                    "label": 0
                },
                {
                    "sent": "I cannot pass this second sense.",
                    "label": 0
                },
                {
                    "sent": "In mortal chimento and the system.",
                    "label": 0
                },
                {
                    "sent": "Creates the link.",
                    "label": 0
                },
                {
                    "sent": "And you can see all the deactivation of each sensor inside the related box.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK our.",
                    "label": 0
                },
                {
                    "sent": "Goal is to share you with you our experiences on these topics and father.",
                    "label": 0
                },
                {
                    "sent": "Introduce.",
                    "label": 0
                },
                {
                    "sent": "And this message concepts, linking opportunities and challenges in the lab.",
                    "label": 0
                },
                {
                    "sent": "And I present you.",
                    "label": 0
                },
                {
                    "sent": "An instrument that is being born an.",
                    "label": 0
                },
                {
                    "sent": "Who are supporting humanistic support?",
                    "label": 0
                },
                {
                    "sent": "If it's in stock?",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Update update.",
                    "label": 0
                },
                {
                    "sent": "And trying to rescue you, stopping Sir, we are under.",
                    "label": 0
                },
                {
                    "sent": "And finally, we want that special for his best support.",
                    "label": 0
                },
                {
                    "sent": "Cars.",
                    "label": 0
                }
            ]
        }
    }
}