{
    "id": "5oxirbrvwcrqrfajfetsb7roqt3ku26s",
    "title": "Amsterdam Living Lab",
    "info": {
        "author": [
            "Daan Velthausz, Telematica Institut"
        ],
        "published": "Feb. 5, 2008",
        "recorded": "December 2007",
        "category": [
            "Top->Business->Living Labs"
        ]
    },
    "url": "http://videolectures.net/esocenet07_velthausz_all/",
    "segmentation": [
        [
            "Hello.",
            "Just I'll before I start.",
            "I just want to explain a little bit about it movie.",
            "Sorry about the noise in this, but Amsterdam is major city of cultural events and media and arts and this is an example of an area where they like to involve a lot of living lab activities.",
            "OK. Mariss going back to the beginning.",
            "It's not working properly, the sound maybe this microphone?",
            "Where is it?",
            "Where?",
            "Yeah.",
            "Really.",
            "Go to.",
            "So this was an example of how Amsterdam is involved in creative combination of arts and media and technology and also events and also the public broadcasting industry like in health.",
            "Some alot of broadcasters are now moving to Amsterdam to be on the move on that."
        ],
        [
            "Given the time, I'll go quickly to some slides, but what is being said is about the change in.",
            "That has been causing towards more the social aspects, the dynamics of communities and roles in society that needs to be investigated in."
        ],
        [
            "And one of the projects that Telematica is doing is calling the service SoC and we also see the different roles of the different individuals in there and one of the essential parts is.",
            "The Living Lab's methodology for the whole program.",
            "To give an idea about the size of this program is being developed.",
            "Currently about 400 million euros for next eight years.",
            "So to give you an idea in which the Living lab methodology is being part of the."
        ],
        [
            "It's in the Netherlands.",
            "And this open innovation program to give you an idea from also the Institute I'm involved in the Telematic Institute.",
            "It's about 50 industrial partners and is bridging, say, scientific.",
            "True Precompetitive research into applied research and we have a lot of knowledge institutes and not of say partners from the applied sides, SMS regions and industries.",
            "So in fact we try to bridge the communities of theory to the communities of practice.",
            "An effects all.",
            "Most of the people I positioning Living Lab in this."
        ],
        [
            "Right, but in our opinion it's covering the whole.",
            "We also have to have research methodology's of living left as well.",
            "Like this OK?"
        ],
        [
            "Anne, this living laptop approach and also telematics institutes heavily involved in debt and we have several projects like free Burnt Future Workspace to any working environment knowledge area but also into local.",
            "See someone from Rock Institute.",
            "South Africa's in the audience.",
            "Living life Poland San rather than we do a lot of things, an core laps and also in Amsterdam.",
            "We involved in setting this up as well and to give you an idea.",
            "As I said 400 million euros being 100 million euros invested from the Dutch government.",
            "So maybe the French can learn something from that."
        ],
        [
            "But the part is it's part of a method."
        ],
        [
            "Kalajian albala maybe you've seen this before a living lab cube.",
            "It is away from the collapse project to structure all these questions and I addressed earlier on and to make some kind of approach how to make a common language and to discuss about things and to position the living left in that."
        ],
        [
            "And in fact, in Fort Inferium they had also nice article about this.",
            "So even in Finland they now promoting is kind of cubes."
        ],
        [
            "Methodology.",
            "And in fact it's a foldable cube and it has a lot of sites.",
            "All the of it an if you know like to know more about it, please see me in the break.",
            "Or ask."
        ],
        [
            "Michael.",
            "In fact, the methodology is they provide, say, access to the communities customers.",
            "Users get some objective and subjective data.",
            "So not only the objective measurements were also feelings, emotions and these kinds of things.",
            "You want to know.",
            "Real life usage in the context should be unobtrusive an involved, the dynamics of social networks because it's very hard.",
            "People can be brought into a lab like the home, Lab or Phillips, but it's completely different.",
            "If you want to observe him in between groups to interact."
        ],
        [
            "In real life.",
            "What we do is a lot of sensors to measure all these kind of things and we also want to."
        ],
        [
            "Do it with kind of experiences.",
            "So instead of just the application logs and the context where people are, we also want to have something like.",
            "I just self reflecting about emotions, but also like to get some kind of feedback and also between groups of into."
        ],
        [
            "Action.",
            "What we say is that not the content is King, but the context of where you are and with whom you are is more important."
        ],
        [
            "I'll speed up to get off the time, so that was my introduction towards the Amsterdam Living Lab.",
            "It's being prepared, and now with the early stages of being raw."
        ],
        [
            "Hold out.",
            "An effect it's.",
            "Just a question.",
            "How many people who have been to Amsterdam?",
            "OK, so.",
            "You shouldn't recognize some of these images at least, or maybe the nightlife on the right.",
            "Or maybe the old history part."
        ],
        [
            "The idea in Amsterdam is to have an open innovation environment is attractive for the outside, an also from the both business perspective, but also from say, content perspective would like to be the content hub to Europe.",
            "For instance, an unable to share knowledge.",
            "People from academia and business are involved, open, tested for and all kinds of new applications.",
            "ICT dominated in that fact.",
            "And also with the market focus and we wanted to extend that together with European cities like Rome, Helsinki, Barcelona and maybe others in Paris."
        ],
        [
            "The best.",
            "To give you an idea about the partners, so these are another on the right side, the main partners and the rest of the people involved, or partners involved to give you an idea.",
            "It's about 3 year program.",
            "Currently as a start up at 12 million euros invested, 4 million of which of the City of Amsterdam, 4 million of the national government and four million after companies.",
            "So there is some money involved to get this off."
        ],
        [
            "The ground.",
            "And what I try to do now is to give you an idea using the cube.",
            "What that means in Amsterdam, very big."
        ],
        [
            "Given the time.",
            "So we have one of the signs of this.",
            "Cube is dealing with all kinds of user involved."
        ],
        [
            "In fact, how to obtain the data and how to provide Open Access to everyone and everyone can add an incident and also to collect a lot of data and to motivate people.",
            "So one of the questions is.",
            "How to get people on a sustainable level motivated to participate?",
            "Should you get kind of incentives?",
            "Or maybe you spoiled in the test and people like to participate and be very proud."
        ],
        [
            "About things service creation deals a lot about how to invent a create novel services and how."
        ],
        [
            "It is important.",
            "There is is also all kinds of new medium you mechanisms to combination of cultural events in combination with other cities can be leading to complete new concepts from participating on different site."
        ],
        [
            "If you look at the lot of infrastructure an is a lot of glass fiber in Amsterdam in the region.",
            "Actually what we call a Metropole, Amsterdam is about 2 million peoples and the surrounding suburbs around Amsterdam as well.",
            "They defined that two weeks ago that they said everything in a radius about 50 kilometres about Amsterdam is called Amsterdam.",
            "If we go abroad.",
            "So like Hilversum Utrecht or other kind of cities, they call themselves Amsterdam FTP."
        ],
        [
            "And abroad, and there's a lot of.",
            "Fiber optics for minute.",
            "For instance, the new city of Alameda and it's more or less like we have the Amsterdam Internet exchange is the most used or the most site traffic generated.",
            "M exchange in the world.",
            "So to give you an idea is a lot of traffic."
        ],
        [
            "Going through this this area.",
            "To give you an idea about the governance, we have also a governance model of different simple apps targeting specific areas.",
            "We have a kind of expertise center on the on both applications and or methodology.",
            "So we try to tackle as well.",
            "How to deal with the governance and one of the things I'd like to propose here is to jointly develop these kind of tools like in an open environment instead of every living lab is developing several tools themselves, why not jointly develop open source software that we can actually do and use together instead of?",
            "I have something here you can use it, it's it's more interesting to develop them."
        ],
        [
            "Together and also we do a lot of business development.",
            "Get partners involved if you want to commercialize certain aspects in this methodology as well, but for now we try to promote ourselves together with academia and small."
        ],
        [
            "Industry.",
            "Amsterdam is well known for also is fashion and this is an example to see what can close and new technology be combined.",
            "So next time we tried also to experiment with like Lightning in close an the social interaction between people and these kind of novel ideas of how to stimuli."
        ],
        [
            "Light interaction between people and also to come up with Co creation that people themselves can invent and contribute to new."
        ],
        [
            "Innovation outcomes."
        ],
        [
            "And the method of tools what we try said as we like to focus on open source together with other initiatives, develop something and working with the European Community and also."
        ],
        [
            "Local community in Amsterdam.",
            "To sum up.",
            "The Telematic Institute is a research institutes.",
            "And together with Amsterdam Living Lab on these kind of issues like methodology, software development.",
            "Measuring the infrastructure and also the organizational part in the managerial part and also looking to the international embedding.",
            "So that's why I representing here the Amsterdam people themselves.",
            "It couldn't join, but I try to be replace them as good as I can.",
            "So if you're only contact, see me afterwards or send me an email."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hello.",
                    "label": 0
                },
                {
                    "sent": "Just I'll before I start.",
                    "label": 0
                },
                {
                    "sent": "I just want to explain a little bit about it movie.",
                    "label": 0
                },
                {
                    "sent": "Sorry about the noise in this, but Amsterdam is major city of cultural events and media and arts and this is an example of an area where they like to involve a lot of living lab activities.",
                    "label": 0
                },
                {
                    "sent": "OK. Mariss going back to the beginning.",
                    "label": 0
                },
                {
                    "sent": "It's not working properly, the sound maybe this microphone?",
                    "label": 0
                },
                {
                    "sent": "Where is it?",
                    "label": 0
                },
                {
                    "sent": "Where?",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Really.",
                    "label": 0
                },
                {
                    "sent": "Go to.",
                    "label": 0
                },
                {
                    "sent": "So this was an example of how Amsterdam is involved in creative combination of arts and media and technology and also events and also the public broadcasting industry like in health.",
                    "label": 0
                },
                {
                    "sent": "Some alot of broadcasters are now moving to Amsterdam to be on the move on that.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Given the time, I'll go quickly to some slides, but what is being said is about the change in.",
                    "label": 0
                },
                {
                    "sent": "That has been causing towards more the social aspects, the dynamics of communities and roles in society that needs to be investigated in.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And one of the projects that Telematica is doing is calling the service SoC and we also see the different roles of the different individuals in there and one of the essential parts is.",
                    "label": 0
                },
                {
                    "sent": "The Living Lab's methodology for the whole program.",
                    "label": 0
                },
                {
                    "sent": "To give an idea about the size of this program is being developed.",
                    "label": 0
                },
                {
                    "sent": "Currently about 400 million euros for next eight years.",
                    "label": 0
                },
                {
                    "sent": "So to give you an idea in which the Living lab methodology is being part of the.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's in the Netherlands.",
                    "label": 0
                },
                {
                    "sent": "And this open innovation program to give you an idea from also the Institute I'm involved in the Telematic Institute.",
                    "label": 0
                },
                {
                    "sent": "It's about 50 industrial partners and is bridging, say, scientific.",
                    "label": 0
                },
                {
                    "sent": "True Precompetitive research into applied research and we have a lot of knowledge institutes and not of say partners from the applied sides, SMS regions and industries.",
                    "label": 1
                },
                {
                    "sent": "So in fact we try to bridge the communities of theory to the communities of practice.",
                    "label": 1
                },
                {
                    "sent": "An effects all.",
                    "label": 0
                },
                {
                    "sent": "Most of the people I positioning Living Lab in this.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right, but in our opinion it's covering the whole.",
                    "label": 0
                },
                {
                    "sent": "We also have to have research methodology's of living left as well.",
                    "label": 0
                },
                {
                    "sent": "Like this OK?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anne, this living laptop approach and also telematics institutes heavily involved in debt and we have several projects like free Burnt Future Workspace to any working environment knowledge area but also into local.",
                    "label": 0
                },
                {
                    "sent": "See someone from Rock Institute.",
                    "label": 0
                },
                {
                    "sent": "South Africa's in the audience.",
                    "label": 0
                },
                {
                    "sent": "Living life Poland San rather than we do a lot of things, an core laps and also in Amsterdam.",
                    "label": 0
                },
                {
                    "sent": "We involved in setting this up as well and to give you an idea.",
                    "label": 0
                },
                {
                    "sent": "As I said 400 million euros being 100 million euros invested from the Dutch government.",
                    "label": 0
                },
                {
                    "sent": "So maybe the French can learn something from that.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But the part is it's part of a method.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Kalajian albala maybe you've seen this before a living lab cube.",
                    "label": 0
                },
                {
                    "sent": "It is away from the collapse project to structure all these questions and I addressed earlier on and to make some kind of approach how to make a common language and to discuss about things and to position the living left in that.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in fact, in Fort Inferium they had also nice article about this.",
                    "label": 0
                },
                {
                    "sent": "So even in Finland they now promoting is kind of cubes.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Methodology.",
                    "label": 0
                },
                {
                    "sent": "And in fact it's a foldable cube and it has a lot of sites.",
                    "label": 0
                },
                {
                    "sent": "All the of it an if you know like to know more about it, please see me in the break.",
                    "label": 0
                },
                {
                    "sent": "Or ask.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Michael.",
                    "label": 0
                },
                {
                    "sent": "In fact, the methodology is they provide, say, access to the communities customers.",
                    "label": 0
                },
                {
                    "sent": "Users get some objective and subjective data.",
                    "label": 1
                },
                {
                    "sent": "So not only the objective measurements were also feelings, emotions and these kinds of things.",
                    "label": 0
                },
                {
                    "sent": "You want to know.",
                    "label": 1
                },
                {
                    "sent": "Real life usage in the context should be unobtrusive an involved, the dynamics of social networks because it's very hard.",
                    "label": 0
                },
                {
                    "sent": "People can be brought into a lab like the home, Lab or Phillips, but it's completely different.",
                    "label": 0
                },
                {
                    "sent": "If you want to observe him in between groups to interact.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In real life.",
                    "label": 0
                },
                {
                    "sent": "What we do is a lot of sensors to measure all these kind of things and we also want to.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Do it with kind of experiences.",
                    "label": 0
                },
                {
                    "sent": "So instead of just the application logs and the context where people are, we also want to have something like.",
                    "label": 0
                },
                {
                    "sent": "I just self reflecting about emotions, but also like to get some kind of feedback and also between groups of into.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Action.",
                    "label": 0
                },
                {
                    "sent": "What we say is that not the content is King, but the context of where you are and with whom you are is more important.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'll speed up to get off the time, so that was my introduction towards the Amsterdam Living Lab.",
                    "label": 0
                },
                {
                    "sent": "It's being prepared, and now with the early stages of being raw.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hold out.",
                    "label": 0
                },
                {
                    "sent": "An effect it's.",
                    "label": 0
                },
                {
                    "sent": "Just a question.",
                    "label": 0
                },
                {
                    "sent": "How many people who have been to Amsterdam?",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "You shouldn't recognize some of these images at least, or maybe the nightlife on the right.",
                    "label": 0
                },
                {
                    "sent": "Or maybe the old history part.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The idea in Amsterdam is to have an open innovation environment is attractive for the outside, an also from the both business perspective, but also from say, content perspective would like to be the content hub to Europe.",
                    "label": 1
                },
                {
                    "sent": "For instance, an unable to share knowledge.",
                    "label": 1
                },
                {
                    "sent": "People from academia and business are involved, open, tested for and all kinds of new applications.",
                    "label": 0
                },
                {
                    "sent": "ICT dominated in that fact.",
                    "label": 0
                },
                {
                    "sent": "And also with the market focus and we wanted to extend that together with European cities like Rome, Helsinki, Barcelona and maybe others in Paris.",
                    "label": 1
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The best.",
                    "label": 0
                },
                {
                    "sent": "To give you an idea about the partners, so these are another on the right side, the main partners and the rest of the people involved, or partners involved to give you an idea.",
                    "label": 0
                },
                {
                    "sent": "It's about 3 year program.",
                    "label": 0
                },
                {
                    "sent": "Currently as a start up at 12 million euros invested, 4 million of which of the City of Amsterdam, 4 million of the national government and four million after companies.",
                    "label": 1
                },
                {
                    "sent": "So there is some money involved to get this off.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The ground.",
                    "label": 0
                },
                {
                    "sent": "And what I try to do now is to give you an idea using the cube.",
                    "label": 0
                },
                {
                    "sent": "What that means in Amsterdam, very big.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Given the time.",
                    "label": 0
                },
                {
                    "sent": "So we have one of the signs of this.",
                    "label": 0
                },
                {
                    "sent": "Cube is dealing with all kinds of user involved.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In fact, how to obtain the data and how to provide Open Access to everyone and everyone can add an incident and also to collect a lot of data and to motivate people.",
                    "label": 0
                },
                {
                    "sent": "So one of the questions is.",
                    "label": 0
                },
                {
                    "sent": "How to get people on a sustainable level motivated to participate?",
                    "label": 0
                },
                {
                    "sent": "Should you get kind of incentives?",
                    "label": 0
                },
                {
                    "sent": "Or maybe you spoiled in the test and people like to participate and be very proud.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About things service creation deals a lot about how to invent a create novel services and how.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is important.",
                    "label": 0
                },
                {
                    "sent": "There is is also all kinds of new medium you mechanisms to combination of cultural events in combination with other cities can be leading to complete new concepts from participating on different site.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you look at the lot of infrastructure an is a lot of glass fiber in Amsterdam in the region.",
                    "label": 0
                },
                {
                    "sent": "Actually what we call a Metropole, Amsterdam is about 2 million peoples and the surrounding suburbs around Amsterdam as well.",
                    "label": 0
                },
                {
                    "sent": "They defined that two weeks ago that they said everything in a radius about 50 kilometres about Amsterdam is called Amsterdam.",
                    "label": 0
                },
                {
                    "sent": "If we go abroad.",
                    "label": 0
                },
                {
                    "sent": "So like Hilversum Utrecht or other kind of cities, they call themselves Amsterdam FTP.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And abroad, and there's a lot of.",
                    "label": 0
                },
                {
                    "sent": "Fiber optics for minute.",
                    "label": 0
                },
                {
                    "sent": "For instance, the new city of Alameda and it's more or less like we have the Amsterdam Internet exchange is the most used or the most site traffic generated.",
                    "label": 0
                },
                {
                    "sent": "M exchange in the world.",
                    "label": 0
                },
                {
                    "sent": "So to give you an idea is a lot of traffic.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Going through this this area.",
                    "label": 0
                },
                {
                    "sent": "To give you an idea about the governance, we have also a governance model of different simple apps targeting specific areas.",
                    "label": 0
                },
                {
                    "sent": "We have a kind of expertise center on the on both applications and or methodology.",
                    "label": 0
                },
                {
                    "sent": "So we try to tackle as well.",
                    "label": 0
                },
                {
                    "sent": "How to deal with the governance and one of the things I'd like to propose here is to jointly develop these kind of tools like in an open environment instead of every living lab is developing several tools themselves, why not jointly develop open source software that we can actually do and use together instead of?",
                    "label": 0
                },
                {
                    "sent": "I have something here you can use it, it's it's more interesting to develop them.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Together and also we do a lot of business development.",
                    "label": 0
                },
                {
                    "sent": "Get partners involved if you want to commercialize certain aspects in this methodology as well, but for now we try to promote ourselves together with academia and small.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Industry.",
                    "label": 0
                },
                {
                    "sent": "Amsterdam is well known for also is fashion and this is an example to see what can close and new technology be combined.",
                    "label": 0
                },
                {
                    "sent": "So next time we tried also to experiment with like Lightning in close an the social interaction between people and these kind of novel ideas of how to stimuli.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Light interaction between people and also to come up with Co creation that people themselves can invent and contribute to new.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Innovation outcomes.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the method of tools what we try said as we like to focus on open source together with other initiatives, develop something and working with the European Community and also.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Local community in Amsterdam.",
                    "label": 0
                },
                {
                    "sent": "To sum up.",
                    "label": 0
                },
                {
                    "sent": "The Telematic Institute is a research institutes.",
                    "label": 1
                },
                {
                    "sent": "And together with Amsterdam Living Lab on these kind of issues like methodology, software development.",
                    "label": 1
                },
                {
                    "sent": "Measuring the infrastructure and also the organizational part in the managerial part and also looking to the international embedding.",
                    "label": 0
                },
                {
                    "sent": "So that's why I representing here the Amsterdam people themselves.",
                    "label": 0
                },
                {
                    "sent": "It couldn't join, but I try to be replace them as good as I can.",
                    "label": 0
                },
                {
                    "sent": "So if you're only contact, see me afterwards or send me an email.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": []
        }
    }
}