{
    "id": "5qn7a4xpxu3bvthocv2e2cegfil3em4c",
    "title": "Overview of the Challenge and Results",
    "info": {
        "author": [
            "Mark Everingham, University of Oxford"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "April 2005",
        "category": [
            "Top->Computer Science->Machine Learning"
        ]
    },
    "url": "http://videolectures.net/pcw05_everingham_ocr/",
    "segmentation": [
        [
            "Is this working?",
            "Is this working?",
            "I swim mark everyone.",
            "I'm at the University of Oxford.",
            "I'm just going to run through some information about what the challenge was and then go through some of the results that we received.",
            "So the channel is covered for object classes.",
            "Most bikes, bicycles, people, and cars, and there were two main sets of competitions.",
            "One was classification in which the task is to predict for a given image, if an object of the given class is present or not, and the second was detection where the task is to predict the bounding boxes of any instances of the object present in the image.",
            "Within these computations, there are two possibilities.",
            "One was that the entrant could train on any data of their choosing other than the test data we provided."
        ],
        [
            "And what we are interested in and answering here is how well the state of the art methods perform on these tasks that we've given.",
            "An indeed which methods perform best?",
            "And the second possibility was to train on the data that was."
        ],
        [
            "It is part of the Challenge Development Kit and here we wanted to find out which methods perform best given the specified data that we have.",
            "So there were four datasets provided for the challenge, three training validation and the test.",
            "One set was sampled from the same distribution of images, and these images were taken from the set of Pascal images, image databases that."
        ],
        [
            "Being collected and show examples in a moment.",
            "And the thought here was that this would provide an easier challenge, since in particular the test images are sampled from the same distribution of images as the training set.",
            "So it provides a sort of classical machine learning problem.",
            "And the 4th set of data called test two was freshly collected for the challenge, mostly from Google Images, and the idea here was to provide a harder challenge in that the images don't come from the same distribution."
        ],
        [
            "Training data and the images picked were perhaps less controlled than in the original databases.",
            "In terms of the amount of data that we had available for training and validation.",
            "And entrance were free to use this data in any way they required.",
            "If they don't need validation data, they could use or for training purposes.",
            "We had a total of around 700 images, 684 images and between one and 200 odd images per per class.",
            "And some of the images have several instances of objects present, so so we have these numbers here.",
            "And we split the data 5050 between training and testing, so we have approximately the same number of images and the same distribution over classes for tests As for training.",
            "Here's some examples of the kind of images that were provided is some examples of motorbikes, so we have sort of fast."
        ],
        [
            "Assign views people like we've got some images of multiple examples and some occlusion, some rather more heavily included examples and variations in scale and more difficult images like this.",
            "Here's some examples of bicycles, where again we have nice clean side views and scale variations like pose variations, so extreme pose variations.",
            "And some examples of people in the case of people we included.",
            "Shots of the entire person.",
            "People walking or more distant views and also examples of people in other poses.",
            "Just sitting or crouching images.",
            "Where the."
        ],
        [
            "Whole person was not visible, and indeed where they are facing away from the.",
            "From the camera.",
            "And here's some examples of the car images and the test one date set where we had primarily side and rear views.",
            "There are some grayscale images taken from one of the databases, and so images with different poses and certainly scale very."
        ],
        [
            "So for the 2nd test set which was gathered freshly for the challenge, we had a rather larger test that, particularly in the case of."
        ],
        [
            "People where we had lots of examples provided by by area.",
            "We've got rather more object instances.",
            "And as I say, the intention was to make it more challenging.",
            "Set here we can see that perhaps the some of the images are of the same characters.",
            "In the first Test set, but we also have examples of more pose variation, more occlusion and again."
        ],
        [
            "Creation and certainly more motorbikes with people riding them perhaps.",
            "In the case of bicycles, again, some some images similar to test one, but also rather difficult poses with riders and lots of pose variation.",
            "So on."
        ],
        [
            "Here's an example of some people images where we have people not only stand in the street, but engaged in activities so you know, sitting on a motorbike, signing by schools, playing volleyball, some scale variations so we can not see face."
        ],
        [
            "This is and so on here and in quite complicated scenes.",
            "And here's an example of the the car Magician from test to again.",
            "Much more pose variation and then in the first Test set not just side and reviews predominant.",
            "Lots of occlusion and lots of."
        ],
        [
            "Causing the same image etc.",
            "So for training purposes, we said the tensions were free to use.",
            "Any of the annotation that was provided on the data.",
            "So for example, they could just."
        ],
        [
            "To use the object is present or absent in the image, they can use the subclass labels which are present which indicate, for example if it's in front view or assign view of the car, they could use the bounding box provided and segmentation masks which say which pixels are part of the object.",
            "In the cases that those were present and certainly in."
        ],
        [
            "In both of the competitions, the conservation detection, I think all of this information was used by various participants.",
            "So we provided this ground truth data and.",
            "Perhaps it's worth mentioning a few issues with provision of ground truth data at this point.",
            "The ground truth data cannot be considered."
        ],
        [
            "Perfect the first thing that we had to decide when preparing this data.",
            "So one central thing is what objects in the image should we consider detectable such that they'll be marked in the ground truth?",
            "And here we conducted a subjective judgment by the size of the object in the image, the level of occlusion, and we said the objects should be considered detectable if we didn't have to undergo some sort of complex inference to determine that they were there.",
            "Disagreements in which objects are detectable or not will cause some noise in the evaluation.",
            "For example, if we haven't marked an object in some of these detected it, we will call that."
        ],
        [
            "False positive, so we have to anticipate there's some sort of variance in the results.",
            "There are some errors in the in the training data.",
            "There are instances of objects which aren't annotated in the data.",
            "So for example, you would expect to need machine learning algorithms which are robust to noise on the labels in the training data.",
            "And there are other factors such as inaccurate bounding boxes.",
            "For example, in the case of bicycles, it's quite hard to specify an accurate bounding box, so to try and.",
            "Ensure that this didn't affect results too much.",
            "We used quite a liberal threshold on one overlap to judge detection, so specify later.",
            "So let's move on to some results.",
            "So first the classification task where the task is to say whether an object is present or not in in an image and his table showing participation in this challenge.",
            "So most of the results we had were on the classification rather than detection problem of these all but one participant tackled each of the classes and there was a little bit more participation on the test one set then.",
            "Test 2 the kind of methods that people used.",
            "Predominant was this approach of using an interest point detector, Harris Corner detector or Laplacian of Gaussian type interest point detector taking."
        ],
        [
            "Patches or David Lowe.",
            "Sift descriptors around these points and then."
        ],
        [
            "These methods are split into three kind of subclasses of methods.",
            "So in the 1st and predominant one, people then clustered patches or descriptors together in event quantization and get a histogram of visual words or bag of features, or these exotic names for this, and then it was popular to stick these into a support vector machine."
        ],
        [
            "Classifier, so this was done by by 2 two.",
            "Participants from from INRIA.",
            "Parker News to a different classification model with the same style of image representation and Edinburgh again tried a different classification model, logistic regression model and the Matthew Group had another model of the same kind of distribution of descriptors.",
            "Starting again from the same interest point and SIFT descriptor approach two groups also went on without using a clustering step.",
            "By using a different kind of kernel in their support vector machine.",
            "So the group at Jubing and Southampton used two different kinds of kernels on the unquantized descriptors.",
            "And two groups also added additional features to the Patch or certain descriptors in form of color, or I think Gray level moments.",
            "We'll hear more about that later.",
            "In addition to this of costs of methods based on interest points and sift descriptor type things, we had one entry which you something perhaps closer to classical image retrieval mechanism where they used automatic image segmentation computed features on the regions from the segmentation algorithm to be used MPEG 7 descriptors of color shape and this kind of thing and use the method based on self organizing Maps.",
            "For classification.",
            "And we also had one entry which approach the classification problem by detection.",
            "So here they run a detector for objects on the image and if it detected at least one instance then they classified it as containing an instance of the object and group from dump that use their method, which is based on generalized softness Ormond."
        ],
        [
            "And SVM verification step.",
            "And we'll we'll hear more about that method later.",
            "To evaluate the results, we use the standard receiver operating characteristic RAC method and we computed two statistics on the RSC curve.",
            "Firstly, the equal error rate and also the the area under the curve.",
            "Both of these statistics are reported in the results document which you can get from the website in ranking the results we use the equal error rate and we can show that the ranking.",
            "Changes only in one instance, where the difference between both results and methods is very small, which you can see in the documentation.",
            "So in the first competition we had the training and validation data available for training and testing was done on the test one data set, so this."
        ],
        [
            "RC.",
            "Plot shows the results for the motorbikes pass an we see a fairly wide variance of results, but a lot of methods.",
            "Right where they want to be, so the best equal error rate here was.",
            "97.7 percent, which was achieved by one of the participants from INRIA in this area.",
            "We can see so these results are ranked by decreasing equal error rate.",
            "But up in this top corner we've got several methods or based on this mechanism of interest points and surf descriptors and the differences in the result."
        ],
        [
            "Methods were fairly small.",
            "It seems that the methods based on clustering of the descriptors perform slightly better.",
            "It's interesting, perhaps.",
            "Note that in this case the method it's based on, detection of the object is some way below, and we'll discuss that a little bit later.",
            "In the case of bicycles on the the same test set, we've got overalls.",
            "Any higher equal error rates as we might expect, it's Maps that class is harder to recognize visually, although it was.",
            "Maybe it's worth some discussion.",
            "The results were significantly lower than you might expect.",
            "And in this case, again, the best performing method in terms of equal error rate was method from Henry, or in this case two of the methods entered by Henry achieve the same equal error rate 93%.",
            "For people, again, slightly lower equal error rate.",
            "The same methods were the most successful and an equal rate of 9192%.",
            "And for cars.",
            "Perhaps higher higher equal error rates?"
        ],
        [
            "In this case, the the one of the inner ear methods outperformed both the other in real methods and all the others by some margin.",
            "Perhaps Frederick will, that's why later.",
            "So moving on to the the 2nd test that the the first thing to to notice is that equal error rates of these methods decreases notably from.",
            "Up around 98% for motorbikes on test set 1.",
            "Down to around 80% and test set 2."
        ],
        [
            "And this might be explained either by the difference in distribution between the training and the test data, in this case, or that there's some implicit in."
        ],
        [
            "Facing difficulty of these images, which is what was intended that we wanted to see really how well these methods could do on on tough data.",
            "Again.",
            "In this case, one of the inner participants didn't contribute results on the 2nd test set where we can see that the."
        ],
        [
            "Method on the scripters.",
            "Again performing best in terms of equal error, although in this case where the difference between the distributions of the training and test data is notable.",
            "Method submitted by ARC in which uses a different classifier mechanism with a similar kind of image representation.",
            "Looks quite comprable.",
            "For bicycles, again, we see the same kind of ranking of the methods.",
            "In this case we can see that some methods are really starting to approach chance in in their classification.",
            "Here the results for people, again, perhaps equal error rate is decreased.",
            "The gain similar ranking of methods with the interior method coming out top and the Ark and method close behind.",
            "And again some methods really rather close to chance.",
            "And for cars, again similar similar results.",
            "So overall we look at the best results we had on each class across the two datasets.",
            "We can see that the test one and test two sets differ significantly, and how?"
        ],
        [
            "How difficult they were for these methods.",
            "The mean across the cost is for the for the best methods around 95% equal error on test one and 74% on test 2.",
            "We can see that there isn't."
        ],
        [
            "Very significant looking difference in the results across the image classes.",
            "Which was part of the challenge, and some of these seem somewhat counterintuitive.",
            "For example, one might expect perhaps motorbikes to be harder to recognize them cars, but this is not supported."
        ],
        [
            "Bye.",
            "By these results this could be due to."
        ],
        [
            "Such as increased post variation in the cars.",
            "Or it could also be explained by there being more statistical regularity's in the background of the images with motorbikes which could be exploited by these methods for for recognition.",
            "So.",
            "If we can draw some conclusions from these results, overall methods based on interest points and sit tight descriptors, clustering and SPMS did best.",
            "The log linear model proposed by Arkan came a close second and seen perhaps to generalize matter to the harder data set, and it's interesting to note that the results using the support vector machine did differ significantly than results using logistic regression, which Edinburgh.",
            "Provided if Chris wants to comment.",
            "Although I'm happy to make that also, logistic regression baseline didn't do very well.",
            "I would say that there may be differences in the kernel as well, so.",
            "I think I remember correctly, did you some other kernels isn't?",
            "It may not be just that.",
            "I mean, we're very interested to know what."
        ],
        [
            "So so yeah, it's through the Internet were using a chi squared kernel and Chris method could perhaps be compared to an SVM with linear linear SVM.",
            "So the differences?",
            "Yeah, indeed, we can't really draw too many conclusions about what the difference is.",
            "Are due to it could be due to the.",
            "Number of clusters which we used in the clustering step or the type of kernel or some other engineering factor.",
            "It might be interesting to see if we could plug those various components together and narrow that down.",
            "I think it's also interesting to note that the method using detection as the mechanism for classification, which done step and in this case didn't do so well.",
            "So one factor here is that this proposed method can't exploit the context of the image.",
            "For example, cars often appear on roads.",
            "And we might give you this in two ways.",
            "One is a weakness in terms of an image retrieval application, but also it may be that this availability of useful context was somewhat unintended bias in the data here that were we interested in car recognition or car plus Rd recognition.",
            "So I think it's very good that we had somebody actually submit this detection approach.",
            "They also used a subset of the training data which may have.",
            "Which was restricted to side views I think, which may have reduced the the recall of the method, but on the other hand there method is able to to localize and sort of explain the basis of the decision.",
            "So we were very pleased to have that entry.",
            "Competitions three and four were similarly classification task, but in this case entrance is free to use.",
            "Any training data there they were, they wished and we didn't have any entries for this this task.",
            "This is a shame.",
            "We might come back to that later.",
            "So moving on to your results in the detection.",
            "Challenge we had fewer participants for detection and then in classification here.",
            "Perhaps this is due to the short time frame of the challenge, which was.",
            "Quite challenging in itself for the party's phone setting.",
            "So in this case only one one group submitted results on all of the computations.",
            "Results they are indeed.",
            "The same way."
        ],
        [
            "Most people choose a few few object classes, perhaps which they've had some experience on in the past.",
            "There's good that most most people submit it on both the test one and test 2.",
            "Test two sets.",
            "It should be pointed out that the Edinburgh results."
        ],
        [
            "Baseline methods here so.",
            "Easy for them."
        ],
        [
            "The middle class is that.",
            "So the kind of methods we had here.",
            "So the method proposed by Darmstadt is a.",
            "Kind of a generalized Hough transform method, Mario will tell us about that later, which uses interest points, cluster patches, another generalized talk transform.",
            "There are two variants were cemented.",
            "Her dumb stat who did the original work on this kind of method also extended their method of the verification stage based on a support vector machine they chose to use any site.",
            "Please correct me if I'm wrong on their side views for training and they made use of the segmentation masks.",
            "This method is quite impressive for the few.",
            "The very small number of training images that are you."
        ],
        [
            "Enria also submitted a method which is a variant on this, in which these the SIFT features which we saw were very successful in classification problem.",
            "Semi supervised clustering to select.",
            "Parts and they restricted themselves to a single detection per image to reduce the false positive rate.",
            "We have two methods submitted which could be considered based on sliding window classifiers where an exhaustive search is conducted over translation and scaling the image group at France Telecom submitted a method based on convolutional convolutional neural networks.",
            "And one participant from INRIA used to support vector machine with.",
            "A top secret input representation based on SIFT descriptors.",
            "And.",
            "Worth noting also that Edinburgh will say, provided us with copious supply of baseline methods and.",
            "And I think this is, you know, this is very valuable to have these baseline methods.",
            "Partly to expose what you know what regularity's there were in the data that we didn't didn't know about and see how well you do with some very simple methods in some cases.",
            "So I think it's worth going going through kind of things.",
            "They did so to assign confidence to their detections in each image.",
            "They in one case just use the the prior probability of the class across the training set and in the second these the whole image classifier which they used in the classification task does a similar thing."
        ],
        [
            "Put it in the development kit.",
            "To predict bounding boxes, they tried selection of.",
            "You know, sneaky things?",
            "Again, which one would say that's a different to the development kit?",
            "Say in one case they just replace the entire image as the as the bounding box of the object.",
            "And indeed in test one.",
            "In some cases this won't do do so badly because for example in the motorbikes date set a lot of the motorbikes are large in the image and centered.",
            "They also proposed to.",
            "Hypothesize the mean bounding box of the training images after scale normalization of the images, which again exploits this regularity in the placement of the object in some images, and they also propose two methods which actually looked at the end that image and compute its bounding boxes of all interest points or interest points weighted by an estimate of relevance to the class of of interest.",
            "So to evaluate the results in the detection task, the first thing we had to define was what we would consider a correct detection, and this was done by computing a measure of overlap between the ground truth bounding box and the bounding box output by an algorithm.",
            "We set the threshold on an overlap fairly low, here to around 50%, partly to account for in accuracies and bounding box in the ground truth.",
            "We had comments on many aspects of the challenge.",
            "This wasn't the one I was expecting to have comments on our setting of this particular threshold.",
            "People seem to be happy with that.",
            "We also considered multiple detections of a single object as false positives."
        ],
        [
            "Case, so detecting a same object multiple times would be considered one true positive and several false positives.",
            "There's two views on this one.",
            "One reason for doing this is that there are some methods emerging, for example method from Darmstadt, which use kind of high level reasoning about the image too.",
            "Arbitrate between low level detections and so we wanted these methods too.",
            "To sort of show off their effectiveness, and in this this evaluation.",
            "So having decided whether it's detection is correct or not, we then used precision recall treating the problem as a kind of image retrieval problem to do the evaluation.",
            "So we have a roar precision recall curve which will have this sawtooth shape that points to too few false positive protections and then recovery by the system and to get a quantitative score on a particular precision recall curve.",
            "We use the.",
            "Average precision measure which is used by the track text and video retrieval conferences.",
            "So this is computed by interpolating the.",
            "Precision at 11 fixed recall levels between zero and one.",
            "The interpolation is done such that the value at a particular recall is taken as the maximum precision for any recall greater than or equal to that particular point.",
            "So for example, these dips in the curve don't affect this.",
            "This measure this measure does take into account the whole range of recall between.",
            "011 so it will tend to penalize methods which have high precision but low recall.",
            "I think we can see on the figures and in the results document that the ranking of methods by this measure support was was compatible with subjective judgment based on the precision recall curves.",
            "So in the first set of competitions in detection again we had training plus file for the training data and testing on the test one data set.",
            "So here we got the results for the motorbike class and in this case we can see that the method proposed by the Group of Darmstadt is convincingly above all the other methods with the.",
            "In real variation on this method coming somewhat close, although the precision drops off at low recall.",
            "Also, the method proposed by France Telecom is somewhat comparable, and these methods are."
        ],
        [
            "Well above the baseline baseline methods provided by Edinburgh, in particular on this motor by itself, we've got a pretty decent average precision here close to 90%.",
            "I mean this is a very very impressive result then.",
            "For bicycles which point out here that the only participant here was Edinburgh.",
            "And this recall curve does start at one, so that was.",
            "Does not appear to be disparaged so.",
            "That's more work needed on bicycles for the next next challenge, I think.",
            "I mean, perhaps it's interesting to note that this number is still 10% with these these baseline methods, which probably exposes some unintended regularity's in the position of the objects within the images.",
            "For people here, we did actually have 3 three methods shown here, so Edinburgh's baseline methods."
        ],
        [
            "Put from INRIA using an SVM and I'll talk about this a little bit more later to explain these results and.",
            "A variation on the the generalist help Transform method submitted by an area we can see in this case that the results are rather poor.",
            "We can see the SVM method menorrhea managing some some precision at recall above 0 but not convincing results.",
            "Some discussion of these results, little later.",
            "And on cars again, we're back up some."
        ],
        [
            "Reasonable results, although we recall falling off, perhaps because of the greater pose variation in this data, and in this case the Darmstadt method performed very well.",
            "The SVM based method from.",
            "INRIA also performed comparably and actually achieved higher recall, probably because dance that restricted themselves to side views and also the method from France Telecom is very well above the baseline method.",
            "So also looks promising.",
            "These are the baseline methods down here.",
            "Moving on to the."
        ],
        [
            "2nd test set in terms of motorbikes we also had.",
            "Quite reasonable results, although the recall dropped off even sooner on the test.",
            "One set, perhaps due to the.",
            "Large variation and appearance in this data set and the subjective ranking of the methods with similar with the Dom step method looking very.",
            "Very effective.",
            "In terms of bicycles, in this case, again, we've only got baseline methods from Edinburgh, and it seems perhaps there was some more regularity in the images in test two and test 1 here, since these results are rather.",
            "Rather better.",
            "For people, again no convincing results.",
            "And for car."
        ],
        [
            "Rather poor results on test two than tax policy mistake towards significantly more challenging, and in this case the SVM based method from INRIA came out best in terms of both precision and recall.",
            "The Darmstadt method is still comparable and the method from France Telecom is building something better than the baseline methods.",
            "So for detection, in contrast to the."
        ],
        [
            "Location task we saw.",
            "A significant well in common we saw a significant difference between the test one and test two datasets on the two classes."
        ],
        [
            "Which people had some success all and the difference in results?"
        ],
        [
            "Even for the classification task.",
            "On here, perhaps as we expected in the classification task, we see significant differences in the results across the classes, so the results for motor motor bikes and cars are significantly better than for the bicycles and people, and this is perhaps what we expect given the visual complexity of of bicycles and people in terms of bicycles being.",
            "Transparent object so we can't stick a nice window around there and people being articulated and much."
        ],
        [
            "Cost variation that.",
            "If there are conclusions to be drawn, the method from dance that based on the generalized Hough transform did best on the classes which they entered results, and it seemed that the SVM verification stage they proposed was was also affected.",
            "However, on some data it was limited to low recall than other methods, perhaps 'cause it's the use of side views only the SVM method proposed by inner ear was comprable the cars and seemed.",
            "Well, the bathroom test two perhaps suggesting better generalization, or it may be that it was better able to cope with smaller objects or at higher recall, because they considered all all views.",
            "And performance on bicycles and people was.",
            "Portia, we say?"
        ],
        [
            "And this is probably due to the.",
            "These are implicit greater difficulty of visually recognizing these classes.",
            "The final competitions were for the detection problem where participants were again free to use their their own training data.",
            "In fact, we only had one submission for this competition for the class of people, but we had results both for test one and test 2 on this problem, and I think it's worthwhile looking at these results.",
            "So what's shown here is the same method submitted by in real.",
            "This is the SVM based based detection method and what we can see at the bottom here is the.",
            "Results on test one that were attained off the training.",
            "This method on the training data provided for the challenge.",
            "And in red, here are the results trained on their own."
        ],
        [
            "Specified training data so we can see that there's a world of difference between these results and their average precision is really very much higher on these.",
            "This position recall is actually quite reasonable.",
            "So there are two possible conclusions to draw from this.",
            "One is it certainly the training data we provided was perhaps inadequate for learning the task of detection of people, perhaps because of the great interclass variation in appearance, there is a small caveat that.",
            "Some of the test data was provided by in real.",
            "While there's certainly no overlap between training and test data, we might anticipate that there is greater similarity in the distribution of images between the test two data set and Henry's own training data, so this should be explored further and again on the same methods results on the test two test 2 data set, the.",
            "Method trained on their own training data was very significantly better.",
            "So in conclusion, on the classification task we were lucky to have a variety of methods submitted, an several variations on the theme of systems, plus SVM which performed similarly, but that it shows on some differences.",
            "And we obtained encouraging performance on all the object classes in the classification task.",
            "In the detection task and we had a wide variety of methods and several variations on the generalized Hough transform, which did give significantly different results.",
            "I think we obtained."
        ],
        [
            "Encouraging performance on the car and motorbike classes, but the people and bicycles proved significantly more challenging.",
            "In terms of comparing methods using the."
        ],
        [
            "The training data provided and establishing what state of the art performances for methods which have been built outside this training data.",
            "Unfortunately, we only had one entry which is for people detection and in this case they obtain much better results using their own data, so really further assessment of what state of the art form it is on these problems remains to be to be done.",
            "And that concludes.",
            "Any questions?",
            "Positive 1 three plus.",
            "Given multiple false positives.",
            "Change the.",
            "I can't tell you empirically if it will change the ranking.",
            "I think it is very important actually because.",
            "So lots of methods.",
            "Don't worry about the false positive problem in detection and people quietly use a variety of heuristics proving the detections like variance on non maximum suppression.",
            "Now we now have some methods, for example domstad done some very interesting work on using more intelligent models than the non maximum suppression to remove these.",
            "So I think too.",
            "A fair judgement of which of these does better?",
            "It's important to consider non maximum to consider multiple detection removal as part of the problem.",
            "I can't tell you offhand whether in this case it would have changed the ranking was I don't have that data.",
            "And it's true that it may be that the differences between results might have been due to cleverer non maximum suppression schemes.",
            "That would be interesting to compare."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is this working?",
                    "label": 0
                },
                {
                    "sent": "Is this working?",
                    "label": 0
                },
                {
                    "sent": "I swim mark everyone.",
                    "label": 0
                },
                {
                    "sent": "I'm at the University of Oxford.",
                    "label": 0
                },
                {
                    "sent": "I'm just going to run through some information about what the challenge was and then go through some of the results that we received.",
                    "label": 0
                },
                {
                    "sent": "So the channel is covered for object classes.",
                    "label": 0
                },
                {
                    "sent": "Most bikes, bicycles, people, and cars, and there were two main sets of competitions.",
                    "label": 0
                },
                {
                    "sent": "One was classification in which the task is to predict for a given image, if an object of the given class is present or not, and the second was detection where the task is to predict the bounding boxes of any instances of the object present in the image.",
                    "label": 0
                },
                {
                    "sent": "Within these computations, there are two possibilities.",
                    "label": 0
                },
                {
                    "sent": "One was that the entrant could train on any data of their choosing other than the test data we provided.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And what we are interested in and answering here is how well the state of the art methods perform on these tasks that we've given.",
                    "label": 0
                },
                {
                    "sent": "An indeed which methods perform best?",
                    "label": 0
                },
                {
                    "sent": "And the second possibility was to train on the data that was.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is part of the Challenge Development Kit and here we wanted to find out which methods perform best given the specified data that we have.",
                    "label": 0
                },
                {
                    "sent": "So there were four datasets provided for the challenge, three training validation and the test.",
                    "label": 0
                },
                {
                    "sent": "One set was sampled from the same distribution of images, and these images were taken from the set of Pascal images, image databases that.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Being collected and show examples in a moment.",
                    "label": 0
                },
                {
                    "sent": "And the thought here was that this would provide an easier challenge, since in particular the test images are sampled from the same distribution of images as the training set.",
                    "label": 0
                },
                {
                    "sent": "So it provides a sort of classical machine learning problem.",
                    "label": 0
                },
                {
                    "sent": "And the 4th set of data called test two was freshly collected for the challenge, mostly from Google Images, and the idea here was to provide a harder challenge in that the images don't come from the same distribution.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Training data and the images picked were perhaps less controlled than in the original databases.",
                    "label": 0
                },
                {
                    "sent": "In terms of the amount of data that we had available for training and validation.",
                    "label": 0
                },
                {
                    "sent": "And entrance were free to use this data in any way they required.",
                    "label": 0
                },
                {
                    "sent": "If they don't need validation data, they could use or for training purposes.",
                    "label": 0
                },
                {
                    "sent": "We had a total of around 700 images, 684 images and between one and 200 odd images per per class.",
                    "label": 0
                },
                {
                    "sent": "And some of the images have several instances of objects present, so so we have these numbers here.",
                    "label": 0
                },
                {
                    "sent": "And we split the data 5050 between training and testing, so we have approximately the same number of images and the same distribution over classes for tests As for training.",
                    "label": 1
                },
                {
                    "sent": "Here's some examples of the kind of images that were provided is some examples of motorbikes, so we have sort of fast.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Assign views people like we've got some images of multiple examples and some occlusion, some rather more heavily included examples and variations in scale and more difficult images like this.",
                    "label": 0
                },
                {
                    "sent": "Here's some examples of bicycles, where again we have nice clean side views and scale variations like pose variations, so extreme pose variations.",
                    "label": 0
                },
                {
                    "sent": "And some examples of people in the case of people we included.",
                    "label": 0
                },
                {
                    "sent": "Shots of the entire person.",
                    "label": 0
                },
                {
                    "sent": "People walking or more distant views and also examples of people in other poses.",
                    "label": 0
                },
                {
                    "sent": "Just sitting or crouching images.",
                    "label": 0
                },
                {
                    "sent": "Where the.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Whole person was not visible, and indeed where they are facing away from the.",
                    "label": 0
                },
                {
                    "sent": "From the camera.",
                    "label": 0
                },
                {
                    "sent": "And here's some examples of the car images and the test one date set where we had primarily side and rear views.",
                    "label": 0
                },
                {
                    "sent": "There are some grayscale images taken from one of the databases, and so images with different poses and certainly scale very.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So for the 2nd test set which was gathered freshly for the challenge, we had a rather larger test that, particularly in the case of.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "People where we had lots of examples provided by by area.",
                    "label": 0
                },
                {
                    "sent": "We've got rather more object instances.",
                    "label": 0
                },
                {
                    "sent": "And as I say, the intention was to make it more challenging.",
                    "label": 0
                },
                {
                    "sent": "Set here we can see that perhaps the some of the images are of the same characters.",
                    "label": 0
                },
                {
                    "sent": "In the first Test set, but we also have examples of more pose variation, more occlusion and again.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Creation and certainly more motorbikes with people riding them perhaps.",
                    "label": 0
                },
                {
                    "sent": "In the case of bicycles, again, some some images similar to test one, but also rather difficult poses with riders and lots of pose variation.",
                    "label": 0
                },
                {
                    "sent": "So on.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here's an example of some people images where we have people not only stand in the street, but engaged in activities so you know, sitting on a motorbike, signing by schools, playing volleyball, some scale variations so we can not see face.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is and so on here and in quite complicated scenes.",
                    "label": 0
                },
                {
                    "sent": "And here's an example of the the car Magician from test to again.",
                    "label": 0
                },
                {
                    "sent": "Much more pose variation and then in the first Test set not just side and reviews predominant.",
                    "label": 0
                },
                {
                    "sent": "Lots of occlusion and lots of.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Causing the same image etc.",
                    "label": 0
                },
                {
                    "sent": "So for training purposes, we said the tensions were free to use.",
                    "label": 0
                },
                {
                    "sent": "Any of the annotation that was provided on the data.",
                    "label": 0
                },
                {
                    "sent": "So for example, they could just.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To use the object is present or absent in the image, they can use the subclass labels which are present which indicate, for example if it's in front view or assign view of the car, they could use the bounding box provided and segmentation masks which say which pixels are part of the object.",
                    "label": 0
                },
                {
                    "sent": "In the cases that those were present and certainly in.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In both of the competitions, the conservation detection, I think all of this information was used by various participants.",
                    "label": 0
                },
                {
                    "sent": "So we provided this ground truth data and.",
                    "label": 0
                },
                {
                    "sent": "Perhaps it's worth mentioning a few issues with provision of ground truth data at this point.",
                    "label": 0
                },
                {
                    "sent": "The ground truth data cannot be considered.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Perfect the first thing that we had to decide when preparing this data.",
                    "label": 0
                },
                {
                    "sent": "So one central thing is what objects in the image should we consider detectable such that they'll be marked in the ground truth?",
                    "label": 0
                },
                {
                    "sent": "And here we conducted a subjective judgment by the size of the object in the image, the level of occlusion, and we said the objects should be considered detectable if we didn't have to undergo some sort of complex inference to determine that they were there.",
                    "label": 0
                },
                {
                    "sent": "Disagreements in which objects are detectable or not will cause some noise in the evaluation.",
                    "label": 0
                },
                {
                    "sent": "For example, if we haven't marked an object in some of these detected it, we will call that.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "False positive, so we have to anticipate there's some sort of variance in the results.",
                    "label": 0
                },
                {
                    "sent": "There are some errors in the in the training data.",
                    "label": 1
                },
                {
                    "sent": "There are instances of objects which aren't annotated in the data.",
                    "label": 0
                },
                {
                    "sent": "So for example, you would expect to need machine learning algorithms which are robust to noise on the labels in the training data.",
                    "label": 1
                },
                {
                    "sent": "And there are other factors such as inaccurate bounding boxes.",
                    "label": 0
                },
                {
                    "sent": "For example, in the case of bicycles, it's quite hard to specify an accurate bounding box, so to try and.",
                    "label": 0
                },
                {
                    "sent": "Ensure that this didn't affect results too much.",
                    "label": 0
                },
                {
                    "sent": "We used quite a liberal threshold on one overlap to judge detection, so specify later.",
                    "label": 0
                },
                {
                    "sent": "So let's move on to some results.",
                    "label": 0
                },
                {
                    "sent": "So first the classification task where the task is to say whether an object is present or not in in an image and his table showing participation in this challenge.",
                    "label": 0
                },
                {
                    "sent": "So most of the results we had were on the classification rather than detection problem of these all but one participant tackled each of the classes and there was a little bit more participation on the test one set then.",
                    "label": 0
                },
                {
                    "sent": "Test 2 the kind of methods that people used.",
                    "label": 0
                },
                {
                    "sent": "Predominant was this approach of using an interest point detector, Harris Corner detector or Laplacian of Gaussian type interest point detector taking.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Patches or David Lowe.",
                    "label": 0
                },
                {
                    "sent": "Sift descriptors around these points and then.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These methods are split into three kind of subclasses of methods.",
                    "label": 0
                },
                {
                    "sent": "So in the 1st and predominant one, people then clustered patches or descriptors together in event quantization and get a histogram of visual words or bag of features, or these exotic names for this, and then it was popular to stick these into a support vector machine.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Classifier, so this was done by by 2 two.",
                    "label": 0
                },
                {
                    "sent": "Participants from from INRIA.",
                    "label": 0
                },
                {
                    "sent": "Parker News to a different classification model with the same style of image representation and Edinburgh again tried a different classification model, logistic regression model and the Matthew Group had another model of the same kind of distribution of descriptors.",
                    "label": 0
                },
                {
                    "sent": "Starting again from the same interest point and SIFT descriptor approach two groups also went on without using a clustering step.",
                    "label": 0
                },
                {
                    "sent": "By using a different kind of kernel in their support vector machine.",
                    "label": 0
                },
                {
                    "sent": "So the group at Jubing and Southampton used two different kinds of kernels on the unquantized descriptors.",
                    "label": 0
                },
                {
                    "sent": "And two groups also added additional features to the Patch or certain descriptors in form of color, or I think Gray level moments.",
                    "label": 0
                },
                {
                    "sent": "We'll hear more about that later.",
                    "label": 0
                },
                {
                    "sent": "In addition to this of costs of methods based on interest points and sift descriptor type things, we had one entry which you something perhaps closer to classical image retrieval mechanism where they used automatic image segmentation computed features on the regions from the segmentation algorithm to be used MPEG 7 descriptors of color shape and this kind of thing and use the method based on self organizing Maps.",
                    "label": 0
                },
                {
                    "sent": "For classification.",
                    "label": 0
                },
                {
                    "sent": "And we also had one entry which approach the classification problem by detection.",
                    "label": 0
                },
                {
                    "sent": "So here they run a detector for objects on the image and if it detected at least one instance then they classified it as containing an instance of the object and group from dump that use their method, which is based on generalized softness Ormond.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And SVM verification step.",
                    "label": 0
                },
                {
                    "sent": "And we'll we'll hear more about that method later.",
                    "label": 0
                },
                {
                    "sent": "To evaluate the results, we use the standard receiver operating characteristic RAC method and we computed two statistics on the RSC curve.",
                    "label": 0
                },
                {
                    "sent": "Firstly, the equal error rate and also the the area under the curve.",
                    "label": 0
                },
                {
                    "sent": "Both of these statistics are reported in the results document which you can get from the website in ranking the results we use the equal error rate and we can show that the ranking.",
                    "label": 0
                },
                {
                    "sent": "Changes only in one instance, where the difference between both results and methods is very small, which you can see in the documentation.",
                    "label": 0
                },
                {
                    "sent": "So in the first competition we had the training and validation data available for training and testing was done on the test one data set, so this.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "RC.",
                    "label": 0
                },
                {
                    "sent": "Plot shows the results for the motorbikes pass an we see a fairly wide variance of results, but a lot of methods.",
                    "label": 0
                },
                {
                    "sent": "Right where they want to be, so the best equal error rate here was.",
                    "label": 0
                },
                {
                    "sent": "97.7 percent, which was achieved by one of the participants from INRIA in this area.",
                    "label": 0
                },
                {
                    "sent": "We can see so these results are ranked by decreasing equal error rate.",
                    "label": 0
                },
                {
                    "sent": "But up in this top corner we've got several methods or based on this mechanism of interest points and surf descriptors and the differences in the result.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Methods were fairly small.",
                    "label": 0
                },
                {
                    "sent": "It seems that the methods based on clustering of the descriptors perform slightly better.",
                    "label": 0
                },
                {
                    "sent": "It's interesting, perhaps.",
                    "label": 0
                },
                {
                    "sent": "Note that in this case the method it's based on, detection of the object is some way below, and we'll discuss that a little bit later.",
                    "label": 0
                },
                {
                    "sent": "In the case of bicycles on the the same test set, we've got overalls.",
                    "label": 0
                },
                {
                    "sent": "Any higher equal error rates as we might expect, it's Maps that class is harder to recognize visually, although it was.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's worth some discussion.",
                    "label": 0
                },
                {
                    "sent": "The results were significantly lower than you might expect.",
                    "label": 0
                },
                {
                    "sent": "And in this case, again, the best performing method in terms of equal error rate was method from Henry, or in this case two of the methods entered by Henry achieve the same equal error rate 93%.",
                    "label": 0
                },
                {
                    "sent": "For people, again, slightly lower equal error rate.",
                    "label": 0
                },
                {
                    "sent": "The same methods were the most successful and an equal rate of 9192%.",
                    "label": 0
                },
                {
                    "sent": "And for cars.",
                    "label": 0
                },
                {
                    "sent": "Perhaps higher higher equal error rates?",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this case, the the one of the inner ear methods outperformed both the other in real methods and all the others by some margin.",
                    "label": 0
                },
                {
                    "sent": "Perhaps Frederick will, that's why later.",
                    "label": 0
                },
                {
                    "sent": "So moving on to the the 2nd test that the the first thing to to notice is that equal error rates of these methods decreases notably from.",
                    "label": 0
                },
                {
                    "sent": "Up around 98% for motorbikes on test set 1.",
                    "label": 0
                },
                {
                    "sent": "Down to around 80% and test set 2.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this might be explained either by the difference in distribution between the training and the test data, in this case, or that there's some implicit in.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Facing difficulty of these images, which is what was intended that we wanted to see really how well these methods could do on on tough data.",
                    "label": 0
                },
                {
                    "sent": "Again.",
                    "label": 0
                },
                {
                    "sent": "In this case, one of the inner participants didn't contribute results on the 2nd test set where we can see that the.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Method on the scripters.",
                    "label": 0
                },
                {
                    "sent": "Again performing best in terms of equal error, although in this case where the difference between the distributions of the training and test data is notable.",
                    "label": 0
                },
                {
                    "sent": "Method submitted by ARC in which uses a different classifier mechanism with a similar kind of image representation.",
                    "label": 0
                },
                {
                    "sent": "Looks quite comprable.",
                    "label": 0
                },
                {
                    "sent": "For bicycles, again, we see the same kind of ranking of the methods.",
                    "label": 0
                },
                {
                    "sent": "In this case we can see that some methods are really starting to approach chance in in their classification.",
                    "label": 0
                },
                {
                    "sent": "Here the results for people, again, perhaps equal error rate is decreased.",
                    "label": 0
                },
                {
                    "sent": "The gain similar ranking of methods with the interior method coming out top and the Ark and method close behind.",
                    "label": 0
                },
                {
                    "sent": "And again some methods really rather close to chance.",
                    "label": 0
                },
                {
                    "sent": "And for cars, again similar similar results.",
                    "label": 0
                },
                {
                    "sent": "So overall we look at the best results we had on each class across the two datasets.",
                    "label": 0
                },
                {
                    "sent": "We can see that the test one and test two sets differ significantly, and how?",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How difficult they were for these methods.",
                    "label": 0
                },
                {
                    "sent": "The mean across the cost is for the for the best methods around 95% equal error on test one and 74% on test 2.",
                    "label": 0
                },
                {
                    "sent": "We can see that there isn't.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Very significant looking difference in the results across the image classes.",
                    "label": 0
                },
                {
                    "sent": "Which was part of the challenge, and some of these seem somewhat counterintuitive.",
                    "label": 0
                },
                {
                    "sent": "For example, one might expect perhaps motorbikes to be harder to recognize them cars, but this is not supported.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Bye.",
                    "label": 0
                },
                {
                    "sent": "By these results this could be due to.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Such as increased post variation in the cars.",
                    "label": 0
                },
                {
                    "sent": "Or it could also be explained by there being more statistical regularity's in the background of the images with motorbikes which could be exploited by these methods for for recognition.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "If we can draw some conclusions from these results, overall methods based on interest points and sit tight descriptors, clustering and SPMS did best.",
                    "label": 0
                },
                {
                    "sent": "The log linear model proposed by Arkan came a close second and seen perhaps to generalize matter to the harder data set, and it's interesting to note that the results using the support vector machine did differ significantly than results using logistic regression, which Edinburgh.",
                    "label": 0
                },
                {
                    "sent": "Provided if Chris wants to comment.",
                    "label": 0
                },
                {
                    "sent": "Although I'm happy to make that also, logistic regression baseline didn't do very well.",
                    "label": 0
                },
                {
                    "sent": "I would say that there may be differences in the kernel as well, so.",
                    "label": 0
                },
                {
                    "sent": "I think I remember correctly, did you some other kernels isn't?",
                    "label": 0
                },
                {
                    "sent": "It may not be just that.",
                    "label": 0
                },
                {
                    "sent": "I mean, we're very interested to know what.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So so yeah, it's through the Internet were using a chi squared kernel and Chris method could perhaps be compared to an SVM with linear linear SVM.",
                    "label": 0
                },
                {
                    "sent": "So the differences?",
                    "label": 0
                },
                {
                    "sent": "Yeah, indeed, we can't really draw too many conclusions about what the difference is.",
                    "label": 0
                },
                {
                    "sent": "Are due to it could be due to the.",
                    "label": 0
                },
                {
                    "sent": "Number of clusters which we used in the clustering step or the type of kernel or some other engineering factor.",
                    "label": 0
                },
                {
                    "sent": "It might be interesting to see if we could plug those various components together and narrow that down.",
                    "label": 0
                },
                {
                    "sent": "I think it's also interesting to note that the method using detection as the mechanism for classification, which done step and in this case didn't do so well.",
                    "label": 0
                },
                {
                    "sent": "So one factor here is that this proposed method can't exploit the context of the image.",
                    "label": 0
                },
                {
                    "sent": "For example, cars often appear on roads.",
                    "label": 0
                },
                {
                    "sent": "And we might give you this in two ways.",
                    "label": 0
                },
                {
                    "sent": "One is a weakness in terms of an image retrieval application, but also it may be that this availability of useful context was somewhat unintended bias in the data here that were we interested in car recognition or car plus Rd recognition.",
                    "label": 0
                },
                {
                    "sent": "So I think it's very good that we had somebody actually submit this detection approach.",
                    "label": 0
                },
                {
                    "sent": "They also used a subset of the training data which may have.",
                    "label": 1
                },
                {
                    "sent": "Which was restricted to side views I think, which may have reduced the the recall of the method, but on the other hand there method is able to to localize and sort of explain the basis of the decision.",
                    "label": 0
                },
                {
                    "sent": "So we were very pleased to have that entry.",
                    "label": 0
                },
                {
                    "sent": "Competitions three and four were similarly classification task, but in this case entrance is free to use.",
                    "label": 1
                },
                {
                    "sent": "Any training data there they were, they wished and we didn't have any entries for this this task.",
                    "label": 0
                },
                {
                    "sent": "This is a shame.",
                    "label": 0
                },
                {
                    "sent": "We might come back to that later.",
                    "label": 0
                },
                {
                    "sent": "So moving on to your results in the detection.",
                    "label": 0
                },
                {
                    "sent": "Challenge we had fewer participants for detection and then in classification here.",
                    "label": 0
                },
                {
                    "sent": "Perhaps this is due to the short time frame of the challenge, which was.",
                    "label": 0
                },
                {
                    "sent": "Quite challenging in itself for the party's phone setting.",
                    "label": 0
                },
                {
                    "sent": "So in this case only one one group submitted results on all of the computations.",
                    "label": 1
                },
                {
                    "sent": "Results they are indeed.",
                    "label": 0
                },
                {
                    "sent": "The same way.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Most people choose a few few object classes, perhaps which they've had some experience on in the past.",
                    "label": 0
                },
                {
                    "sent": "There's good that most most people submit it on both the test one and test 2.",
                    "label": 0
                },
                {
                    "sent": "Test two sets.",
                    "label": 0
                },
                {
                    "sent": "It should be pointed out that the Edinburgh results.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Baseline methods here so.",
                    "label": 0
                },
                {
                    "sent": "Easy for them.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The middle class is that.",
                    "label": 0
                },
                {
                    "sent": "So the kind of methods we had here.",
                    "label": 0
                },
                {
                    "sent": "So the method proposed by Darmstadt is a.",
                    "label": 0
                },
                {
                    "sent": "Kind of a generalized Hough transform method, Mario will tell us about that later, which uses interest points, cluster patches, another generalized talk transform.",
                    "label": 0
                },
                {
                    "sent": "There are two variants were cemented.",
                    "label": 0
                },
                {
                    "sent": "Her dumb stat who did the original work on this kind of method also extended their method of the verification stage based on a support vector machine they chose to use any site.",
                    "label": 0
                },
                {
                    "sent": "Please correct me if I'm wrong on their side views for training and they made use of the segmentation masks.",
                    "label": 0
                },
                {
                    "sent": "This method is quite impressive for the few.",
                    "label": 0
                },
                {
                    "sent": "The very small number of training images that are you.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Enria also submitted a method which is a variant on this, in which these the SIFT features which we saw were very successful in classification problem.",
                    "label": 0
                },
                {
                    "sent": "Semi supervised clustering to select.",
                    "label": 0
                },
                {
                    "sent": "Parts and they restricted themselves to a single detection per image to reduce the false positive rate.",
                    "label": 0
                },
                {
                    "sent": "We have two methods submitted which could be considered based on sliding window classifiers where an exhaustive search is conducted over translation and scaling the image group at France Telecom submitted a method based on convolutional convolutional neural networks.",
                    "label": 0
                },
                {
                    "sent": "And one participant from INRIA used to support vector machine with.",
                    "label": 0
                },
                {
                    "sent": "A top secret input representation based on SIFT descriptors.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Worth noting also that Edinburgh will say, provided us with copious supply of baseline methods and.",
                    "label": 0
                },
                {
                    "sent": "And I think this is, you know, this is very valuable to have these baseline methods.",
                    "label": 0
                },
                {
                    "sent": "Partly to expose what you know what regularity's there were in the data that we didn't didn't know about and see how well you do with some very simple methods in some cases.",
                    "label": 0
                },
                {
                    "sent": "So I think it's worth going going through kind of things.",
                    "label": 0
                },
                {
                    "sent": "They did so to assign confidence to their detections in each image.",
                    "label": 0
                },
                {
                    "sent": "They in one case just use the the prior probability of the class across the training set and in the second these the whole image classifier which they used in the classification task does a similar thing.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Put it in the development kit.",
                    "label": 0
                },
                {
                    "sent": "To predict bounding boxes, they tried selection of.",
                    "label": 0
                },
                {
                    "sent": "You know, sneaky things?",
                    "label": 0
                },
                {
                    "sent": "Again, which one would say that's a different to the development kit?",
                    "label": 0
                },
                {
                    "sent": "Say in one case they just replace the entire image as the as the bounding box of the object.",
                    "label": 1
                },
                {
                    "sent": "And indeed in test one.",
                    "label": 0
                },
                {
                    "sent": "In some cases this won't do do so badly because for example in the motorbikes date set a lot of the motorbikes are large in the image and centered.",
                    "label": 0
                },
                {
                    "sent": "They also proposed to.",
                    "label": 0
                },
                {
                    "sent": "Hypothesize the mean bounding box of the training images after scale normalization of the images, which again exploits this regularity in the placement of the object in some images, and they also propose two methods which actually looked at the end that image and compute its bounding boxes of all interest points or interest points weighted by an estimate of relevance to the class of of interest.",
                    "label": 1
                },
                {
                    "sent": "So to evaluate the results in the detection task, the first thing we had to define was what we would consider a correct detection, and this was done by computing a measure of overlap between the ground truth bounding box and the bounding box output by an algorithm.",
                    "label": 0
                },
                {
                    "sent": "We set the threshold on an overlap fairly low, here to around 50%, partly to account for in accuracies and bounding box in the ground truth.",
                    "label": 0
                },
                {
                    "sent": "We had comments on many aspects of the challenge.",
                    "label": 0
                },
                {
                    "sent": "This wasn't the one I was expecting to have comments on our setting of this particular threshold.",
                    "label": 0
                },
                {
                    "sent": "People seem to be happy with that.",
                    "label": 0
                },
                {
                    "sent": "We also considered multiple detections of a single object as false positives.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Case, so detecting a same object multiple times would be considered one true positive and several false positives.",
                    "label": 1
                },
                {
                    "sent": "There's two views on this one.",
                    "label": 0
                },
                {
                    "sent": "One reason for doing this is that there are some methods emerging, for example method from Darmstadt, which use kind of high level reasoning about the image too.",
                    "label": 0
                },
                {
                    "sent": "Arbitrate between low level detections and so we wanted these methods too.",
                    "label": 0
                },
                {
                    "sent": "To sort of show off their effectiveness, and in this this evaluation.",
                    "label": 0
                },
                {
                    "sent": "So having decided whether it's detection is correct or not, we then used precision recall treating the problem as a kind of image retrieval problem to do the evaluation.",
                    "label": 0
                },
                {
                    "sent": "So we have a roar precision recall curve which will have this sawtooth shape that points to too few false positive protections and then recovery by the system and to get a quantitative score on a particular precision recall curve.",
                    "label": 0
                },
                {
                    "sent": "We use the.",
                    "label": 1
                },
                {
                    "sent": "Average precision measure which is used by the track text and video retrieval conferences.",
                    "label": 0
                },
                {
                    "sent": "So this is computed by interpolating the.",
                    "label": 0
                },
                {
                    "sent": "Precision at 11 fixed recall levels between zero and one.",
                    "label": 0
                },
                {
                    "sent": "The interpolation is done such that the value at a particular recall is taken as the maximum precision for any recall greater than or equal to that particular point.",
                    "label": 0
                },
                {
                    "sent": "So for example, these dips in the curve don't affect this.",
                    "label": 0
                },
                {
                    "sent": "This measure this measure does take into account the whole range of recall between.",
                    "label": 0
                },
                {
                    "sent": "011 so it will tend to penalize methods which have high precision but low recall.",
                    "label": 0
                },
                {
                    "sent": "I think we can see on the figures and in the results document that the ranking of methods by this measure support was was compatible with subjective judgment based on the precision recall curves.",
                    "label": 0
                },
                {
                    "sent": "So in the first set of competitions in detection again we had training plus file for the training data and testing on the test one data set.",
                    "label": 0
                },
                {
                    "sent": "So here we got the results for the motorbike class and in this case we can see that the method proposed by the Group of Darmstadt is convincingly above all the other methods with the.",
                    "label": 0
                },
                {
                    "sent": "In real variation on this method coming somewhat close, although the precision drops off at low recall.",
                    "label": 0
                },
                {
                    "sent": "Also, the method proposed by France Telecom is somewhat comparable, and these methods are.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well above the baseline baseline methods provided by Edinburgh, in particular on this motor by itself, we've got a pretty decent average precision here close to 90%.",
                    "label": 0
                },
                {
                    "sent": "I mean this is a very very impressive result then.",
                    "label": 0
                },
                {
                    "sent": "For bicycles which point out here that the only participant here was Edinburgh.",
                    "label": 0
                },
                {
                    "sent": "And this recall curve does start at one, so that was.",
                    "label": 0
                },
                {
                    "sent": "Does not appear to be disparaged so.",
                    "label": 0
                },
                {
                    "sent": "That's more work needed on bicycles for the next next challenge, I think.",
                    "label": 0
                },
                {
                    "sent": "I mean, perhaps it's interesting to note that this number is still 10% with these these baseline methods, which probably exposes some unintended regularity's in the position of the objects within the images.",
                    "label": 0
                },
                {
                    "sent": "For people here, we did actually have 3 three methods shown here, so Edinburgh's baseline methods.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Put from INRIA using an SVM and I'll talk about this a little bit more later to explain these results and.",
                    "label": 0
                },
                {
                    "sent": "A variation on the the generalist help Transform method submitted by an area we can see in this case that the results are rather poor.",
                    "label": 0
                },
                {
                    "sent": "We can see the SVM method menorrhea managing some some precision at recall above 0 but not convincing results.",
                    "label": 0
                },
                {
                    "sent": "Some discussion of these results, little later.",
                    "label": 0
                },
                {
                    "sent": "And on cars again, we're back up some.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Reasonable results, although we recall falling off, perhaps because of the greater pose variation in this data, and in this case the Darmstadt method performed very well.",
                    "label": 0
                },
                {
                    "sent": "The SVM based method from.",
                    "label": 0
                },
                {
                    "sent": "INRIA also performed comparably and actually achieved higher recall, probably because dance that restricted themselves to side views and also the method from France Telecom is very well above the baseline method.",
                    "label": 0
                },
                {
                    "sent": "So also looks promising.",
                    "label": 0
                },
                {
                    "sent": "These are the baseline methods down here.",
                    "label": 0
                },
                {
                    "sent": "Moving on to the.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "2nd test set in terms of motorbikes we also had.",
                    "label": 0
                },
                {
                    "sent": "Quite reasonable results, although the recall dropped off even sooner on the test.",
                    "label": 0
                },
                {
                    "sent": "One set, perhaps due to the.",
                    "label": 0
                },
                {
                    "sent": "Large variation and appearance in this data set and the subjective ranking of the methods with similar with the Dom step method looking very.",
                    "label": 0
                },
                {
                    "sent": "Very effective.",
                    "label": 0
                },
                {
                    "sent": "In terms of bicycles, in this case, again, we've only got baseline methods from Edinburgh, and it seems perhaps there was some more regularity in the images in test two and test 1 here, since these results are rather.",
                    "label": 0
                },
                {
                    "sent": "Rather better.",
                    "label": 0
                },
                {
                    "sent": "For people, again no convincing results.",
                    "label": 0
                },
                {
                    "sent": "And for car.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Rather poor results on test two than tax policy mistake towards significantly more challenging, and in this case the SVM based method from INRIA came out best in terms of both precision and recall.",
                    "label": 0
                },
                {
                    "sent": "The Darmstadt method is still comparable and the method from France Telecom is building something better than the baseline methods.",
                    "label": 0
                },
                {
                    "sent": "So for detection, in contrast to the.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Location task we saw.",
                    "label": 0
                },
                {
                    "sent": "A significant well in common we saw a significant difference between the test one and test two datasets on the two classes.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which people had some success all and the difference in results?",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Even for the classification task.",
                    "label": 0
                },
                {
                    "sent": "On here, perhaps as we expected in the classification task, we see significant differences in the results across the classes, so the results for motor motor bikes and cars are significantly better than for the bicycles and people, and this is perhaps what we expect given the visual complexity of of bicycles and people in terms of bicycles being.",
                    "label": 0
                },
                {
                    "sent": "Transparent object so we can't stick a nice window around there and people being articulated and much.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cost variation that.",
                    "label": 0
                },
                {
                    "sent": "If there are conclusions to be drawn, the method from dance that based on the generalized Hough transform did best on the classes which they entered results, and it seemed that the SVM verification stage they proposed was was also affected.",
                    "label": 0
                },
                {
                    "sent": "However, on some data it was limited to low recall than other methods, perhaps 'cause it's the use of side views only the SVM method proposed by inner ear was comprable the cars and seemed.",
                    "label": 0
                },
                {
                    "sent": "Well, the bathroom test two perhaps suggesting better generalization, or it may be that it was better able to cope with smaller objects or at higher recall, because they considered all all views.",
                    "label": 0
                },
                {
                    "sent": "And performance on bicycles and people was.",
                    "label": 0
                },
                {
                    "sent": "Portia, we say?",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is probably due to the.",
                    "label": 0
                },
                {
                    "sent": "These are implicit greater difficulty of visually recognizing these classes.",
                    "label": 0
                },
                {
                    "sent": "The final competitions were for the detection problem where participants were again free to use their their own training data.",
                    "label": 1
                },
                {
                    "sent": "In fact, we only had one submission for this competition for the class of people, but we had results both for test one and test 2 on this problem, and I think it's worthwhile looking at these results.",
                    "label": 0
                },
                {
                    "sent": "So what's shown here is the same method submitted by in real.",
                    "label": 0
                },
                {
                    "sent": "This is the SVM based based detection method and what we can see at the bottom here is the.",
                    "label": 0
                },
                {
                    "sent": "Results on test one that were attained off the training.",
                    "label": 1
                },
                {
                    "sent": "This method on the training data provided for the challenge.",
                    "label": 0
                },
                {
                    "sent": "And in red, here are the results trained on their own.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Specified training data so we can see that there's a world of difference between these results and their average precision is really very much higher on these.",
                    "label": 0
                },
                {
                    "sent": "This position recall is actually quite reasonable.",
                    "label": 0
                },
                {
                    "sent": "So there are two possible conclusions to draw from this.",
                    "label": 0
                },
                {
                    "sent": "One is it certainly the training data we provided was perhaps inadequate for learning the task of detection of people, perhaps because of the great interclass variation in appearance, there is a small caveat that.",
                    "label": 0
                },
                {
                    "sent": "Some of the test data was provided by in real.",
                    "label": 0
                },
                {
                    "sent": "While there's certainly no overlap between training and test data, we might anticipate that there is greater similarity in the distribution of images between the test two data set and Henry's own training data, so this should be explored further and again on the same methods results on the test two test 2 data set, the.",
                    "label": 0
                },
                {
                    "sent": "Method trained on their own training data was very significantly better.",
                    "label": 1
                },
                {
                    "sent": "So in conclusion, on the classification task we were lucky to have a variety of methods submitted, an several variations on the theme of systems, plus SVM which performed similarly, but that it shows on some differences.",
                    "label": 0
                },
                {
                    "sent": "And we obtained encouraging performance on all the object classes in the classification task.",
                    "label": 0
                },
                {
                    "sent": "In the detection task and we had a wide variety of methods and several variations on the generalized Hough transform, which did give significantly different results.",
                    "label": 0
                },
                {
                    "sent": "I think we obtained.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Encouraging performance on the car and motorbike classes, but the people and bicycles proved significantly more challenging.",
                    "label": 0
                },
                {
                    "sent": "In terms of comparing methods using the.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The training data provided and establishing what state of the art performances for methods which have been built outside this training data.",
                    "label": 1
                },
                {
                    "sent": "Unfortunately, we only had one entry which is for people detection and in this case they obtain much better results using their own data, so really further assessment of what state of the art form it is on these problems remains to be to be done.",
                    "label": 1
                },
                {
                    "sent": "And that concludes.",
                    "label": 0
                },
                {
                    "sent": "Any questions?",
                    "label": 0
                },
                {
                    "sent": "Positive 1 three plus.",
                    "label": 0
                },
                {
                    "sent": "Given multiple false positives.",
                    "label": 0
                },
                {
                    "sent": "Change the.",
                    "label": 0
                },
                {
                    "sent": "I can't tell you empirically if it will change the ranking.",
                    "label": 0
                },
                {
                    "sent": "I think it is very important actually because.",
                    "label": 0
                },
                {
                    "sent": "So lots of methods.",
                    "label": 0
                },
                {
                    "sent": "Don't worry about the false positive problem in detection and people quietly use a variety of heuristics proving the detections like variance on non maximum suppression.",
                    "label": 0
                },
                {
                    "sent": "Now we now have some methods, for example domstad done some very interesting work on using more intelligent models than the non maximum suppression to remove these.",
                    "label": 0
                },
                {
                    "sent": "So I think too.",
                    "label": 0
                },
                {
                    "sent": "A fair judgement of which of these does better?",
                    "label": 0
                },
                {
                    "sent": "It's important to consider non maximum to consider multiple detection removal as part of the problem.",
                    "label": 0
                },
                {
                    "sent": "I can't tell you offhand whether in this case it would have changed the ranking was I don't have that data.",
                    "label": 0
                },
                {
                    "sent": "And it's true that it may be that the differences between results might have been due to cleverer non maximum suppression schemes.",
                    "label": 0
                },
                {
                    "sent": "That would be interesting to compare.",
                    "label": 0
                }
            ]
        }
    }
}