{
    "id": "5r3i2fmnj3poemp22n4jntv7swdulsir",
    "title": "Finding Seeds of Future Discoveries in Current Literature",
    "info": {
        "author": [
            "Tanja Urbančič, University of Nova Gorica"
        ],
        "published": "Sept. 25, 2013",
        "recorded": "July 2013",
        "category": [
            "Top->Computer Science->Artificial Intelligence",
            "Top->Philosophy",
            "Top->Social Sciences->Psychology"
        ]
    },
    "url": "http://videolectures.net/ktsymposium2013_urbancic_seeds/",
    "segmentation": [
        [
            "Hello everybody, first I would like to tell you about my experience when I visited the school on Computational Creativity in portal two years ago.",
            "If I may advertise a little bit.",
            "Before I went there, I had no idea what to expect.",
            "It just sounded really appealing and interesting, but it turned out to be not just very nice and pleasant experience.",
            "It was also very, very valuable and influential event.",
            "So we realized that our work could really benefit by bringing more computational creativity in.",
            "So I think it's a marvelous development that.",
            "The lecturers of that school, almost all of them are here today and we are looking forward to our joint projects which have already started or will start very soon.",
            "So we also realized at that point that what we were doing had some connection with what computational creativity aims at.",
            "I don't claim that we are doing computational creativity, but we see a lot of potential.",
            "And in my talk I will try to connect our work with the points when we see we could bring more computational creativity in.",
            "So the presentation is based on joint work.",
            "So first of all I would like to adknowledge my colleague Ingrid Patriots from the University of Margarita.",
            "Then of course Nada and boy and then our medical expert Martha Macedonia.",
            "Luke said she worked with us in some very crucial phases of the development of the methods will present.",
            "And I will also mention the work of some other colleagues like massage modes, Looper."
        ],
        [
            "So we will be talking about creativity in another context in the context of knowledge discovery, scientific discovery.",
            "And after a more general introduction, we will focus on a specific type of discovery.",
            "This is literature based discovery.",
            "I will present the net worth supporting creativity in this endeavor, supporting human creativity.",
            "It is called traveling.",
            "It was developed in our team and I will present two sets of experiments which proved the methods to be successful.",
            "Then I will very briefly mention some other developments related to the topic and conclude with the discussion, what's next."
        ],
        [
            "I would like to start with a motivating example showing how surprising knowledge discovery can be, showing that sometimes it comes at places we don't expect it, and also in ways which could be characterized as very unusual.",
            "I read about this story some days ago, but it really illustrates the point quite well.",
            "It was described in a book written by Slacky Francis Slakey.",
            "He selected her own physics and associate director for public affairs of the American physicists physical SoC.",
            "So, um.",
            "It is about a very.",
            "Very very influential discovery.",
            "Hubble Space Telescope was carried into the orbit by a space shuttle in 1990, and it is positioned above the Earth's atmosphere, which allows it for taking pictures with extremely high resolution and many harbor observations actually led to breakthroughs in astrophysics.",
            "An interesting story happened in 1995.",
            "There was a group of scientists very, very curious scientists who just wanted to focus the telescope on a very, very small region of the space.",
            "It was an empty black void, so practically nothing known was there.",
            "So it's also nicely described in the book that this scientists were very lucky that influential people.",
            "Actually made this possible in spite of complaints of other scientists who viewed this as waste of time and actually wanted the resources to be used in more productive ways.",
            "But the result was really surprising, so.",
            "An image assembled from 342 separate exposures taken over ten consecutive days, actually revealed over 1500 galaxies and became a landmark image in the study of the early universe.",
            "So it's something really.",
            "Inspiring in a way that it's good sometime too to allow.",
            "Also research to go in some.",
            "Not very, very useful directions."
        ],
        [
            "Obviously, scientific discovery is connected with creativity.",
            "I will not mention any definitions.",
            "We heard that there are many, but I will type.",
            "I will repeat about three types of creativity, also mentioned in in Tony's talk, Margaret Pordon characterizes creativity to be combinatorial exploratory.",
            "Or transformation ull combinatorial.",
            "Combining already known facts in a new way, facts or pieces, then exploratory using known principles in a new way and finally transformation.",
            "ULL creativity which goes into another search space using new principles and leading to big lips and big breakthroughs.",
            "In many discoveries, existing knowledge is actually creatively combined with new ideas.",
            "So already at the combinatorial level of creativity, there's much room for new discoveries.",
            "But of course these lines are are not.",
            "These borders are not very, very sharp, and you will see also in the examples that we can also come from combinatorial to this so called higher.",
            "Levels of creativity.",
            "But as I said already, at this combinatorial level, there's much room for new discoveries.",
            "And Arthur Koestler, already in 1964, actually characterized creative act.",
            "Is something that uncovers select reshuffles, combines synthesizes already existing facts, ideas, skills and so on.",
            "And he added the more familiar departs.",
            "The more striking than you whole.",
            "Here I would like to add immediately that these ideas often come from other contexts.",
            "As we all know from this legendary story about."
        ],
        [
            "Argument is, but there are some more interesting examples also.",
            "For example, in the history of computer science.",
            "I think that you all know.",
            "How idea of punched cards was transferred from Jacquards Loom to the Babbages analytic engine?",
            "So he was at?",
            "A sort of analogy in the case of the cards loom, this punched cards were used to code this colorful patterns used in textile.",
            "But Babbage somehow realized that instead of these threats, actually.",
            "Something more abstract could be going on, so he actually had the idea of using this punched cards for coding data, algorithms and things like that.",
            "Another example would be the development of evolutionary computing, which has an evident inspiration in nature."
        ],
        [
            "So.",
            "If I go back to the customer's work, he actually introduced the notion of so-called bisociation's as a basis of human creativity, and he was talking about perceiving a situation or idea into self consistent but usually incompatible frames of reference.",
            "So that the event in the intersection is not associated just in one dimension, so to say.",
            "But it's been associated with two so.",
            "Obviously creativity has something to do with finding links which lead out of the plane, and this idea was put on a more technical ground in the framework of the European project.",
            "This on bisociation networks for creative information discovery, in which.",
            "We use the definition that two concepts are be so sheated if and only if there is no direct obvious evidence linking them.",
            "One has to cross contexts to find the link, and this new link provides some novel insight."
        ],
        [
            "No, I will continue how this.",
            "Contexts can be linked on the basis of literature mining, and I will present a well known example by Swanson, very influential researcher who started this field of literature mining in the early 90s.",
            "And this is one of the examples which is really.",
            "Sort of a gold standard, although he did.",
            "He used many others as well, so in one of his studies he was interested if migraine headaches are connected with magnesium.",
            "Nowadays this is commonly accepted and we know that it is, but the dead time there was practically no evidence about that.",
            "There were a death time, almost 40,000 articles about magnesium available in the apartment, but none of them actually mentioned my green.",
            "And on the other hand there were almost 5000 articles about my green, but they did not mention magnesium so.",
            "Swanson had a very simple but very powerful idea.",
            "And he asked himself, are there any concerts, any terms?",
            "Which we can find in literature about magnesium but also in the literature about my green so that they could somehow represent the bridge between these two separate domains."
        ],
        [
            "Actually he found.",
            "About 60 pairs of documents which shared interesting terms, interesting concepts.",
            "And then."
        ],
        [
            "When he had a closer look at this pairs, he actually found 11.",
            "Evidence is supporting hypothesis that magnesium deficiency can lead to migraine headaches.",
            "If we have a look at some examples in one document, there was a fact that magnesium is a natural calcium channel blocker.",
            "On the other hand, in the migraine literature there was the fact that calcium channel blockers can prevent migraine attacks, and there were ten more like this.",
            "Of course, then clinical studies also followed to confirm, although it's quite easy to believe that this might be reasonable."
        ],
        [
            "The question we asked ourselves was why magnesium, if we're interested in migraine headaches.",
            "There are so many possibilities possibilities.",
            "What else could be connected with this problem?",
            "Swanson was not very explicit when he described how he came with this idea, and this is what he said.",
            "Such proceeds via some intermediate literature be so with an unknown destination A and success depends entirely on the knowledge.",
            "And ingenuity of the researcher.",
            "So our question was, can we provide some support to researchers when they look for such hypothesis?"
        ],
        [
            "What do we have at disposal in the biomedical fields?",
            "As you probably know, there is very, very good source of knowledge.",
            "In biomedical bibliographical database apartment and what is really striking is that they add between 2004 thousand references to this database each working day.",
            "So you can imagine the amount and grow."
        ],
        [
            "Both of these database, so now the next question is do use such sources of knowledge effectively?",
            "This amount and cross is not the only problem.",
            "The part of the problem is also that as researchers we tend to be more and more specialized.",
            "So we work on almost like an on islands in in relatively closed scientific communities as it was really nicely illustrated by matiash usage yesterday.",
            "So we saw each other visit the same conferences and so on.",
            "Even in our own specialization, it's difficult to follow everything.",
            "What is going on?",
            "And it's even harder to follow the development in the neighboring fields.",
            "That's one problem.",
            "Swanson himself also explicitly claimed that over specialization of researchers actually can inhibit creativity.",
            "So our objective was.",
            "To help researchers to buy methods and software tools to support their creativity in knowledge discovery."
        ],
        [
            "So in the situation when we had.",
            "Both domains known in advance like my green and magnesium.",
            "We have the situation of so-called closed discovery.",
            "We have the hypothesis and we are looking for breaching terms B.",
            "While in the situation we are just interested in a specific phenomenon we are investigating like only my green, we have the situation of open discovery."
        ],
        [
            "And in the continuation I will show how in our method we combine both.",
            "But I will definitely concentrate on the open discovery part, which is, I believe even more connected to creativity.",
            "So we start with the domain we are interested in.",
            "This is C. And then first we do the upper part of the figure.",
            "We use rare terms in the literature about the phenomenon, see.",
            "It's a guidance.",
            "The words.",
            "The A and I will show how we do it later.",
            "So we use red terms to identify, identify A and then we have the situation of closed discovery, which is the lower part of the figure."
        ],
        [
            "So the basic idea is as follows.",
            "We start with the literature C identify interesting, rare terms that we believe that could lead us towards novel discoveries, and then we have a closer look at everything we can find in literature about this rare terms.",
            "So we look for example about all the literature available about the first rare term.",
            "Even if it doesn't mention literature, see at all.",
            "And similarly we do for the other chosen rare terms, and finally.",
            "We ask ourselves, do this rare terms have something in common?",
            "Is there any hidden underlying reason why these terms occasionally appear in the literature about C?",
            "And why their terms?",
            "Because something which is really frequent is probably well investigated and explored, and there's not so much.",
            "Chance that it will discover this.",
            "So.",
            "When we have these literatures about this rare terms, we look at the intersection.",
            "What do they share?",
            "And we identify potential interesting joint terms which could actually identify the domain A to be targeted."
        ],
        [
            "And then we followed with close discovery part preaching pretty much the same Swanson."
        ],
        [
            "So it's algorithmic.",
            "We go in three steps, identifying reference identifying joint terms, and finally close discovery, identifying linking terms or breaching terms.",
            "I would like to draw your attention to the fact that expert is also in the loop, so at certain points when we get the list of candidates, we show it to the expert.",
            "Instead of trying just everything that computer program suggested, becausw experts have some intuition, have some interest, and they guide the process quite efficiently."
        ],
        [
            "So in the first case, when we wanted to evaluate the method.",
            "We had no expert.",
            "To help us, so we just pretended it was here.",
            "1988 this was the year when Swanson did his experiments and we took just the papers about my green which were available to him at that time.",
            "So the answer was, could we find magnesium as a candidate with drizzling?"
        ],
        [
            "I will make a story short.",
            "Not only we found magnesium, we also found some other interesting candidates like interfere."
        ],
        [
            "Drawn interlocking tumour necrosis factor and when Ingrid Pitt Rich analyzed this results, she had a look into apartment.",
            "If this relations actually made any sense and actually in some years after.",
            "The year of the experiment, so to speak, actually, Impartment first papers appeared connecting my green with interferon interleukin tumor necrosis factor.",
            "So of course this is speculation.",
            "We cannot know what if researchers had this tool.",
            "Would this help or not?",
            "But it was quite encouraging.",
            "So."
        ],
        [
            "But then we moved to a new case not long before becausw we were lucky to get in touch with the expert medical expert interested in autism.",
            "As you probably know, autism is a very very complex disorder and causal explanation why it appears in a particular person is known only in 10 or 15% of cases.",
            "It is also.",
            "It is also known that there are genetic factors important, but also other factors are important.",
            "The difficulty is that the research in autism is very, very fragmented, so there are researchers in behavior psychology studying it.",
            "Then researchers in genetics, biochemistry, brain anatomy and Physiology we.",
            "Obviously have the situation of these islands of.",
            "Specific knowledge, but it is known that no island can explain this phenomenon itself, so there are some interactions that should be understood.",
            "So it's a perfect case for our method."
        ],
        [
            "Here is also.",
            "Simple Ontology we built with a tool on to gain semi automatically from all the papers available on autism impartment just to see this rich structure and you actually can see from genetic factors, behavioral issues, phenotype expression and so on."
        ],
        [
            "So used apartment is the data source and.",
            "Went through our experiments with this medical expert and I will go very briefly through this becausw."
        ],
        [
            "So it's just the main idea which is important at this moment, so you just type in autism, open discovery.",
            "We have just one domain we are interested in and then based on frequencies in the domain and some."
        ],
        [
            "Election that can be done by using medical subject heading."
        ],
        [
            "Some filterings and so on."
        ],
        [
            "We get a list of candidates for rare terms to be used."
        ],
        [
            "For exploring this, intersections in in the future phases.",
            "So in this specific case actually our expert tools certain rare terms.",
            "She was some background knowledge.",
            "Of course when when she made this decision decision and in the next phase we were explored exploring if these selected rare terms have something."
        ],
        [
            "In common.",
            "So we have exactly this idea with chosen rap terms."
        ],
        [
            "In the first experiment, the expert decided for calcineurin being a good candidate for another domain."
        ],
        [
            "And we also identified some linking terms actually connecting these two domains."
        ],
        [
            "In a way we know from the swansons example.",
            "Now, what is really interesting is how much the expert liked this representation.",
            "So from these hundreds of papers she got just one sheet of paper.",
            "With this abstracts of the papers.",
            "They were put in parallel so she had immediately checked if this makes any sense, and when she saw this output, she immediately noticed this fragile X in one of the assets and and she got really excited and and she said."
        ],
        [
            "This is this is really interesting.",
            "Continuing this now when we think more and more about computational creativity, the question appears.",
            "Could the program itself identify as such an interesting hint, but at the moment we are still far from it.",
            "We just very gratefully used this hint given by the expert."
        ],
        [
            "She's in the loop.",
            "As I said before, and what we did in our next set of experiments is."
        ],
        [
            "But we narrowed the original domain from all autism particles impartment to those of these particles, which mentioned also refrigerated eggs, and we went to a similar process and."
        ],
        [
            "In the end, in the intersection, the experts confirmed the transcription factor.",
            "NF Kappa Beta is very, very interesting."
        ],
        [
            "Again, we helped her with this pairs of abstracts, which she compared and based on this she was able to give us an explanation and evaluation and I will mention just the most important parts of it.",
            "It is thought that autism could result from an interaction between genetic and environmental factors with an oxidative stress and immunological disorders.",
            "As potential mechanisms linking the two and in the end she wrote.",
            "So according to our analysis, one possible point of convergence between oxidative stress and immunological disorder paradigm in autism is NF Kappa beta and we pay."
        ],
        [
            "Published this in year 2007.",
            "What followed was really amazing.",
            "In 2011 there was a paper published in a medical community.",
            "They actually did in a hospital laboratory some tests with with blood of these children with autism, and they published their results in.",
            "Respect it Journal plus one.",
            "They say we have noticed significant increase in NF Kappa beta in DNA binding activity in peripheral blood samples of children with autism.",
            "This finding has immense value in understanding many of the known biochemical changes reported in autism.",
            "So this was something we were really very very pleased to see.",
            "Of course, we were sorry we had not such laboratories available to do this further confirmations ourselves, but still, it's really a good feeling."
        ],
        [
            "This is the paper the authors are from India.",
            "Oh"
        ],
        [
            "So if I conclude.",
            "About these findings in open discovery, it has been proved that it's worthwhile to explore rare terms for generation of hypothesis with treasure link method.",
            "Experts involvement is crucial.",
            "Expert evaluation evaluation confirms the relevance of findings.",
            "And actually, we can see this method as a method for finding seeds of future discoveries in nowadays literature.",
            "Now in the."
        ],
        [
            "Closed the discovery framework.",
            "There's also quite some work going on.",
            "A lot of it."
        ],
        [
            "Buy matiash again.",
            "I will mention just some most important findings so far.",
            "We actually found that the role of outliers is extremely important.",
            "It was founded.",
            "The majority of bridging concepts can be found in outlier documents and."
        ],
        [
            "Also, we evaluated how much we gain if we focus just on outliers in the sense of speed.",
            "So."
        ],
        [
            "Matache actually provided a very nice improvement in the sense.",
            "Towards program, selecting from the set of candidates by ranking the candidates by choosing which are the best ones.",
            "Then he also improved this side-by-side document view, and there are also many other additional features with very nice functionality, interface and so on."
        ],
        [
            "So this is how he represented in one of his previous presentations, how this list of Candidate B terms can be actually."
        ],
        [
            "So."
        ],
        [
            "Select it so that the most promising ones are on the top, which makes work again easier for the expert."
        ],
        [
            "And this is this."
        ],
        [
            "Nice interface.",
            "Up if I go."
        ],
        [
            "So two conclusions, what next?",
            "Of course, we have many, many ideas how to upgrade open discovery across B and.",
            "Obviously we would like to bring more more computational creativity into the process of knowledge discovery, so we believe that our work in the concrete projects where we will be working on concept creation technology will help us to move from this combinatorial.",
            "A type of creativity also to the other types could be for example.",
            "Discover this analogies like in examples I showed you with punched cars or evolutionary computing.",
            "Finally, we are very proactively looking for the next case where we will prove our methods and we would like to do it from the first idea to the glorious end by ourselves.",
            "So if there is any idea around, we will definitely take it seriously and see if we can do something together.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hello everybody, first I would like to tell you about my experience when I visited the school on Computational Creativity in portal two years ago.",
                    "label": 0
                },
                {
                    "sent": "If I may advertise a little bit.",
                    "label": 0
                },
                {
                    "sent": "Before I went there, I had no idea what to expect.",
                    "label": 0
                },
                {
                    "sent": "It just sounded really appealing and interesting, but it turned out to be not just very nice and pleasant experience.",
                    "label": 0
                },
                {
                    "sent": "It was also very, very valuable and influential event.",
                    "label": 0
                },
                {
                    "sent": "So we realized that our work could really benefit by bringing more computational creativity in.",
                    "label": 0
                },
                {
                    "sent": "So I think it's a marvelous development that.",
                    "label": 0
                },
                {
                    "sent": "The lecturers of that school, almost all of them are here today and we are looking forward to our joint projects which have already started or will start very soon.",
                    "label": 0
                },
                {
                    "sent": "So we also realized at that point that what we were doing had some connection with what computational creativity aims at.",
                    "label": 0
                },
                {
                    "sent": "I don't claim that we are doing computational creativity, but we see a lot of potential.",
                    "label": 0
                },
                {
                    "sent": "And in my talk I will try to connect our work with the points when we see we could bring more computational creativity in.",
                    "label": 0
                },
                {
                    "sent": "So the presentation is based on joint work.",
                    "label": 0
                },
                {
                    "sent": "So first of all I would like to adknowledge my colleague Ingrid Patriots from the University of Margarita.",
                    "label": 0
                },
                {
                    "sent": "Then of course Nada and boy and then our medical expert Martha Macedonia.",
                    "label": 0
                },
                {
                    "sent": "Luke said she worked with us in some very crucial phases of the development of the methods will present.",
                    "label": 0
                },
                {
                    "sent": "And I will also mention the work of some other colleagues like massage modes, Looper.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we will be talking about creativity in another context in the context of knowledge discovery, scientific discovery.",
                    "label": 1
                },
                {
                    "sent": "And after a more general introduction, we will focus on a specific type of discovery.",
                    "label": 0
                },
                {
                    "sent": "This is literature based discovery.",
                    "label": 0
                },
                {
                    "sent": "I will present the net worth supporting creativity in this endeavor, supporting human creativity.",
                    "label": 0
                },
                {
                    "sent": "It is called traveling.",
                    "label": 0
                },
                {
                    "sent": "It was developed in our team and I will present two sets of experiments which proved the methods to be successful.",
                    "label": 0
                },
                {
                    "sent": "Then I will very briefly mention some other developments related to the topic and conclude with the discussion, what's next.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I would like to start with a motivating example showing how surprising knowledge discovery can be, showing that sometimes it comes at places we don't expect it, and also in ways which could be characterized as very unusual.",
                    "label": 0
                },
                {
                    "sent": "I read about this story some days ago, but it really illustrates the point quite well.",
                    "label": 0
                },
                {
                    "sent": "It was described in a book written by Slacky Francis Slakey.",
                    "label": 0
                },
                {
                    "sent": "He selected her own physics and associate director for public affairs of the American physicists physical SoC.",
                    "label": 0
                },
                {
                    "sent": "So, um.",
                    "label": 0
                },
                {
                    "sent": "It is about a very.",
                    "label": 0
                },
                {
                    "sent": "Very very influential discovery.",
                    "label": 0
                },
                {
                    "sent": "Hubble Space Telescope was carried into the orbit by a space shuttle in 1990, and it is positioned above the Earth's atmosphere, which allows it for taking pictures with extremely high resolution and many harbor observations actually led to breakthroughs in astrophysics.",
                    "label": 1
                },
                {
                    "sent": "An interesting story happened in 1995.",
                    "label": 0
                },
                {
                    "sent": "There was a group of scientists very, very curious scientists who just wanted to focus the telescope on a very, very small region of the space.",
                    "label": 0
                },
                {
                    "sent": "It was an empty black void, so practically nothing known was there.",
                    "label": 0
                },
                {
                    "sent": "So it's also nicely described in the book that this scientists were very lucky that influential people.",
                    "label": 0
                },
                {
                    "sent": "Actually made this possible in spite of complaints of other scientists who viewed this as waste of time and actually wanted the resources to be used in more productive ways.",
                    "label": 0
                },
                {
                    "sent": "But the result was really surprising, so.",
                    "label": 0
                },
                {
                    "sent": "An image assembled from 342 separate exposures taken over ten consecutive days, actually revealed over 1500 galaxies and became a landmark image in the study of the early universe.",
                    "label": 1
                },
                {
                    "sent": "So it's something really.",
                    "label": 0
                },
                {
                    "sent": "Inspiring in a way that it's good sometime too to allow.",
                    "label": 0
                },
                {
                    "sent": "Also research to go in some.",
                    "label": 0
                },
                {
                    "sent": "Not very, very useful directions.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Obviously, scientific discovery is connected with creativity.",
                    "label": 0
                },
                {
                    "sent": "I will not mention any definitions.",
                    "label": 0
                },
                {
                    "sent": "We heard that there are many, but I will type.",
                    "label": 0
                },
                {
                    "sent": "I will repeat about three types of creativity, also mentioned in in Tony's talk, Margaret Pordon characterizes creativity to be combinatorial exploratory.",
                    "label": 0
                },
                {
                    "sent": "Or transformation ull combinatorial.",
                    "label": 0
                },
                {
                    "sent": "Combining already known facts in a new way, facts or pieces, then exploratory using known principles in a new way and finally transformation.",
                    "label": 0
                },
                {
                    "sent": "ULL creativity which goes into another search space using new principles and leading to big lips and big breakthroughs.",
                    "label": 0
                },
                {
                    "sent": "In many discoveries, existing knowledge is actually creatively combined with new ideas.",
                    "label": 1
                },
                {
                    "sent": "So already at the combinatorial level of creativity, there's much room for new discoveries.",
                    "label": 0
                },
                {
                    "sent": "But of course these lines are are not.",
                    "label": 0
                },
                {
                    "sent": "These borders are not very, very sharp, and you will see also in the examples that we can also come from combinatorial to this so called higher.",
                    "label": 0
                },
                {
                    "sent": "Levels of creativity.",
                    "label": 0
                },
                {
                    "sent": "But as I said already, at this combinatorial level, there's much room for new discoveries.",
                    "label": 0
                },
                {
                    "sent": "And Arthur Koestler, already in 1964, actually characterized creative act.",
                    "label": 1
                },
                {
                    "sent": "Is something that uncovers select reshuffles, combines synthesizes already existing facts, ideas, skills and so on.",
                    "label": 1
                },
                {
                    "sent": "And he added the more familiar departs.",
                    "label": 1
                },
                {
                    "sent": "The more striking than you whole.",
                    "label": 0
                },
                {
                    "sent": "Here I would like to add immediately that these ideas often come from other contexts.",
                    "label": 0
                },
                {
                    "sent": "As we all know from this legendary story about.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Argument is, but there are some more interesting examples also.",
                    "label": 0
                },
                {
                    "sent": "For example, in the history of computer science.",
                    "label": 1
                },
                {
                    "sent": "I think that you all know.",
                    "label": 0
                },
                {
                    "sent": "How idea of punched cards was transferred from Jacquards Loom to the Babbages analytic engine?",
                    "label": 1
                },
                {
                    "sent": "So he was at?",
                    "label": 1
                },
                {
                    "sent": "A sort of analogy in the case of the cards loom, this punched cards were used to code this colorful patterns used in textile.",
                    "label": 0
                },
                {
                    "sent": "But Babbage somehow realized that instead of these threats, actually.",
                    "label": 1
                },
                {
                    "sent": "Something more abstract could be going on, so he actually had the idea of using this punched cards for coding data, algorithms and things like that.",
                    "label": 0
                },
                {
                    "sent": "Another example would be the development of evolutionary computing, which has an evident inspiration in nature.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "If I go back to the customer's work, he actually introduced the notion of so-called bisociation's as a basis of human creativity, and he was talking about perceiving a situation or idea into self consistent but usually incompatible frames of reference.",
                    "label": 1
                },
                {
                    "sent": "So that the event in the intersection is not associated just in one dimension, so to say.",
                    "label": 0
                },
                {
                    "sent": "But it's been associated with two so.",
                    "label": 0
                },
                {
                    "sent": "Obviously creativity has something to do with finding links which lead out of the plane, and this idea was put on a more technical ground in the framework of the European project.",
                    "label": 1
                },
                {
                    "sent": "This on bisociation networks for creative information discovery, in which.",
                    "label": 0
                },
                {
                    "sent": "We use the definition that two concepts are be so sheated if and only if there is no direct obvious evidence linking them.",
                    "label": 1
                },
                {
                    "sent": "One has to cross contexts to find the link, and this new link provides some novel insight.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No, I will continue how this.",
                    "label": 0
                },
                {
                    "sent": "Contexts can be linked on the basis of literature mining, and I will present a well known example by Swanson, very influential researcher who started this field of literature mining in the early 90s.",
                    "label": 0
                },
                {
                    "sent": "And this is one of the examples which is really.",
                    "label": 0
                },
                {
                    "sent": "Sort of a gold standard, although he did.",
                    "label": 0
                },
                {
                    "sent": "He used many others as well, so in one of his studies he was interested if migraine headaches are connected with magnesium.",
                    "label": 0
                },
                {
                    "sent": "Nowadays this is commonly accepted and we know that it is, but the dead time there was practically no evidence about that.",
                    "label": 0
                },
                {
                    "sent": "There were a death time, almost 40,000 articles about magnesium available in the apartment, but none of them actually mentioned my green.",
                    "label": 0
                },
                {
                    "sent": "And on the other hand there were almost 5000 articles about my green, but they did not mention magnesium so.",
                    "label": 0
                },
                {
                    "sent": "Swanson had a very simple but very powerful idea.",
                    "label": 0
                },
                {
                    "sent": "And he asked himself, are there any concerts, any terms?",
                    "label": 0
                },
                {
                    "sent": "Which we can find in literature about magnesium but also in the literature about my green so that they could somehow represent the bridge between these two separate domains.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actually he found.",
                    "label": 0
                },
                {
                    "sent": "About 60 pairs of documents which shared interesting terms, interesting concepts.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "When he had a closer look at this pairs, he actually found 11.",
                    "label": 0
                },
                {
                    "sent": "Evidence is supporting hypothesis that magnesium deficiency can lead to migraine headaches.",
                    "label": 1
                },
                {
                    "sent": "If we have a look at some examples in one document, there was a fact that magnesium is a natural calcium channel blocker.",
                    "label": 1
                },
                {
                    "sent": "On the other hand, in the migraine literature there was the fact that calcium channel blockers can prevent migraine attacks, and there were ten more like this.",
                    "label": 1
                },
                {
                    "sent": "Of course, then clinical studies also followed to confirm, although it's quite easy to believe that this might be reasonable.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The question we asked ourselves was why magnesium, if we're interested in migraine headaches.",
                    "label": 0
                },
                {
                    "sent": "There are so many possibilities possibilities.",
                    "label": 0
                },
                {
                    "sent": "What else could be connected with this problem?",
                    "label": 0
                },
                {
                    "sent": "Swanson was not very explicit when he described how he came with this idea, and this is what he said.",
                    "label": 0
                },
                {
                    "sent": "Such proceeds via some intermediate literature be so with an unknown destination A and success depends entirely on the knowledge.",
                    "label": 1
                },
                {
                    "sent": "And ingenuity of the researcher.",
                    "label": 0
                },
                {
                    "sent": "So our question was, can we provide some support to researchers when they look for such hypothesis?",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What do we have at disposal in the biomedical fields?",
                    "label": 1
                },
                {
                    "sent": "As you probably know, there is very, very good source of knowledge.",
                    "label": 1
                },
                {
                    "sent": "In biomedical bibliographical database apartment and what is really striking is that they add between 2004 thousand references to this database each working day.",
                    "label": 0
                },
                {
                    "sent": "So you can imagine the amount and grow.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Both of these database, so now the next question is do use such sources of knowledge effectively?",
                    "label": 1
                },
                {
                    "sent": "This amount and cross is not the only problem.",
                    "label": 0
                },
                {
                    "sent": "The part of the problem is also that as researchers we tend to be more and more specialized.",
                    "label": 0
                },
                {
                    "sent": "So we work on almost like an on islands in in relatively closed scientific communities as it was really nicely illustrated by matiash usage yesterday.",
                    "label": 0
                },
                {
                    "sent": "So we saw each other visit the same conferences and so on.",
                    "label": 0
                },
                {
                    "sent": "Even in our own specialization, it's difficult to follow everything.",
                    "label": 0
                },
                {
                    "sent": "What is going on?",
                    "label": 0
                },
                {
                    "sent": "And it's even harder to follow the development in the neighboring fields.",
                    "label": 0
                },
                {
                    "sent": "That's one problem.",
                    "label": 1
                },
                {
                    "sent": "Swanson himself also explicitly claimed that over specialization of researchers actually can inhibit creativity.",
                    "label": 0
                },
                {
                    "sent": "So our objective was.",
                    "label": 1
                },
                {
                    "sent": "To help researchers to buy methods and software tools to support their creativity in knowledge discovery.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in the situation when we had.",
                    "label": 0
                },
                {
                    "sent": "Both domains known in advance like my green and magnesium.",
                    "label": 1
                },
                {
                    "sent": "We have the situation of so-called closed discovery.",
                    "label": 0
                },
                {
                    "sent": "We have the hypothesis and we are looking for breaching terms B.",
                    "label": 0
                },
                {
                    "sent": "While in the situation we are just interested in a specific phenomenon we are investigating like only my green, we have the situation of open discovery.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And in the continuation I will show how in our method we combine both.",
                    "label": 0
                },
                {
                    "sent": "But I will definitely concentrate on the open discovery part, which is, I believe even more connected to creativity.",
                    "label": 0
                },
                {
                    "sent": "So we start with the domain we are interested in.",
                    "label": 0
                },
                {
                    "sent": "This is C. And then first we do the upper part of the figure.",
                    "label": 1
                },
                {
                    "sent": "We use rare terms in the literature about the phenomenon, see.",
                    "label": 0
                },
                {
                    "sent": "It's a guidance.",
                    "label": 0
                },
                {
                    "sent": "The words.",
                    "label": 0
                },
                {
                    "sent": "The A and I will show how we do it later.",
                    "label": 0
                },
                {
                    "sent": "So we use red terms to identify, identify A and then we have the situation of closed discovery, which is the lower part of the figure.",
                    "label": 1
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the basic idea is as follows.",
                    "label": 0
                },
                {
                    "sent": "We start with the literature C identify interesting, rare terms that we believe that could lead us towards novel discoveries, and then we have a closer look at everything we can find in literature about this rare terms.",
                    "label": 1
                },
                {
                    "sent": "So we look for example about all the literature available about the first rare term.",
                    "label": 1
                },
                {
                    "sent": "Even if it doesn't mention literature, see at all.",
                    "label": 0
                },
                {
                    "sent": "And similarly we do for the other chosen rare terms, and finally.",
                    "label": 0
                },
                {
                    "sent": "We ask ourselves, do this rare terms have something in common?",
                    "label": 0
                },
                {
                    "sent": "Is there any hidden underlying reason why these terms occasionally appear in the literature about C?",
                    "label": 0
                },
                {
                    "sent": "And why their terms?",
                    "label": 0
                },
                {
                    "sent": "Because something which is really frequent is probably well investigated and explored, and there's not so much.",
                    "label": 0
                },
                {
                    "sent": "Chance that it will discover this.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "When we have these literatures about this rare terms, we look at the intersection.",
                    "label": 0
                },
                {
                    "sent": "What do they share?",
                    "label": 0
                },
                {
                    "sent": "And we identify potential interesting joint terms which could actually identify the domain A to be targeted.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we followed with close discovery part preaching pretty much the same Swanson.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So it's algorithmic.",
                    "label": 0
                },
                {
                    "sent": "We go in three steps, identifying reference identifying joint terms, and finally close discovery, identifying linking terms or breaching terms.",
                    "label": 0
                },
                {
                    "sent": "I would like to draw your attention to the fact that expert is also in the loop, so at certain points when we get the list of candidates, we show it to the expert.",
                    "label": 0
                },
                {
                    "sent": "Instead of trying just everything that computer program suggested, becausw experts have some intuition, have some interest, and they guide the process quite efficiently.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in the first case, when we wanted to evaluate the method.",
                    "label": 0
                },
                {
                    "sent": "We had no expert.",
                    "label": 0
                },
                {
                    "sent": "To help us, so we just pretended it was here.",
                    "label": 0
                },
                {
                    "sent": "1988 this was the year when Swanson did his experiments and we took just the papers about my green which were available to him at that time.",
                    "label": 0
                },
                {
                    "sent": "So the answer was, could we find magnesium as a candidate with drizzling?",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will make a story short.",
                    "label": 0
                },
                {
                    "sent": "Not only we found magnesium, we also found some other interesting candidates like interfere.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Drawn interlocking tumour necrosis factor and when Ingrid Pitt Rich analyzed this results, she had a look into apartment.",
                    "label": 0
                },
                {
                    "sent": "If this relations actually made any sense and actually in some years after.",
                    "label": 0
                },
                {
                    "sent": "The year of the experiment, so to speak, actually, Impartment first papers appeared connecting my green with interferon interleukin tumor necrosis factor.",
                    "label": 1
                },
                {
                    "sent": "So of course this is speculation.",
                    "label": 0
                },
                {
                    "sent": "We cannot know what if researchers had this tool.",
                    "label": 0
                },
                {
                    "sent": "Would this help or not?",
                    "label": 0
                },
                {
                    "sent": "But it was quite encouraging.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But then we moved to a new case not long before becausw we were lucky to get in touch with the expert medical expert interested in autism.",
                    "label": 0
                },
                {
                    "sent": "As you probably know, autism is a very very complex disorder and causal explanation why it appears in a particular person is known only in 10 or 15% of cases.",
                    "label": 0
                },
                {
                    "sent": "It is also.",
                    "label": 0
                },
                {
                    "sent": "It is also known that there are genetic factors important, but also other factors are important.",
                    "label": 0
                },
                {
                    "sent": "The difficulty is that the research in autism is very, very fragmented, so there are researchers in behavior psychology studying it.",
                    "label": 0
                },
                {
                    "sent": "Then researchers in genetics, biochemistry, brain anatomy and Physiology we.",
                    "label": 1
                },
                {
                    "sent": "Obviously have the situation of these islands of.",
                    "label": 0
                },
                {
                    "sent": "Specific knowledge, but it is known that no island can explain this phenomenon itself, so there are some interactions that should be understood.",
                    "label": 0
                },
                {
                    "sent": "So it's a perfect case for our method.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here is also.",
                    "label": 0
                },
                {
                    "sent": "Simple Ontology we built with a tool on to gain semi automatically from all the papers available on autism impartment just to see this rich structure and you actually can see from genetic factors, behavioral issues, phenotype expression and so on.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So used apartment is the data source and.",
                    "label": 0
                },
                {
                    "sent": "Went through our experiments with this medical expert and I will go very briefly through this becausw.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So it's just the main idea which is important at this moment, so you just type in autism, open discovery.",
                    "label": 0
                },
                {
                    "sent": "We have just one domain we are interested in and then based on frequencies in the domain and some.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Election that can be done by using medical subject heading.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some filterings and so on.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We get a list of candidates for rare terms to be used.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For exploring this, intersections in in the future phases.",
                    "label": 0
                },
                {
                    "sent": "So in this specific case actually our expert tools certain rare terms.",
                    "label": 1
                },
                {
                    "sent": "She was some background knowledge.",
                    "label": 1
                },
                {
                    "sent": "Of course when when she made this decision decision and in the next phase we were explored exploring if these selected rare terms have something.",
                    "label": 1
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In common.",
                    "label": 0
                },
                {
                    "sent": "So we have exactly this idea with chosen rap terms.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the first experiment, the expert decided for calcineurin being a good candidate for another domain.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we also identified some linking terms actually connecting these two domains.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In a way we know from the swansons example.",
                    "label": 0
                },
                {
                    "sent": "Now, what is really interesting is how much the expert liked this representation.",
                    "label": 0
                },
                {
                    "sent": "So from these hundreds of papers she got just one sheet of paper.",
                    "label": 0
                },
                {
                    "sent": "With this abstracts of the papers.",
                    "label": 0
                },
                {
                    "sent": "They were put in parallel so she had immediately checked if this makes any sense, and when she saw this output, she immediately noticed this fragile X in one of the assets and and she got really excited and and she said.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is this is really interesting.",
                    "label": 0
                },
                {
                    "sent": "Continuing this now when we think more and more about computational creativity, the question appears.",
                    "label": 0
                },
                {
                    "sent": "Could the program itself identify as such an interesting hint, but at the moment we are still far from it.",
                    "label": 0
                },
                {
                    "sent": "We just very gratefully used this hint given by the expert.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "She's in the loop.",
                    "label": 0
                },
                {
                    "sent": "As I said before, and what we did in our next set of experiments is.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But we narrowed the original domain from all autism particles impartment to those of these particles, which mentioned also refrigerated eggs, and we went to a similar process and.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the end, in the intersection, the experts confirmed the transcription factor.",
                    "label": 0
                },
                {
                    "sent": "NF Kappa Beta is very, very interesting.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Again, we helped her with this pairs of abstracts, which she compared and based on this she was able to give us an explanation and evaluation and I will mention just the most important parts of it.",
                    "label": 0
                },
                {
                    "sent": "It is thought that autism could result from an interaction between genetic and environmental factors with an oxidative stress and immunological disorders.",
                    "label": 1
                },
                {
                    "sent": "As potential mechanisms linking the two and in the end she wrote.",
                    "label": 1
                },
                {
                    "sent": "So according to our analysis, one possible point of convergence between oxidative stress and immunological disorder paradigm in autism is NF Kappa beta and we pay.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Published this in year 2007.",
                    "label": 0
                },
                {
                    "sent": "What followed was really amazing.",
                    "label": 0
                },
                {
                    "sent": "In 2011 there was a paper published in a medical community.",
                    "label": 0
                },
                {
                    "sent": "They actually did in a hospital laboratory some tests with with blood of these children with autism, and they published their results in.",
                    "label": 0
                },
                {
                    "sent": "Respect it Journal plus one.",
                    "label": 0
                },
                {
                    "sent": "They say we have noticed significant increase in NF Kappa beta in DNA binding activity in peripheral blood samples of children with autism.",
                    "label": 1
                },
                {
                    "sent": "This finding has immense value in understanding many of the known biochemical changes reported in autism.",
                    "label": 1
                },
                {
                    "sent": "So this was something we were really very very pleased to see.",
                    "label": 0
                },
                {
                    "sent": "Of course, we were sorry we had not such laboratories available to do this further confirmations ourselves, but still, it's really a good feeling.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the paper the authors are from India.",
                    "label": 0
                },
                {
                    "sent": "Oh",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So if I conclude.",
                    "label": 0
                },
                {
                    "sent": "About these findings in open discovery, it has been proved that it's worthwhile to explore rare terms for generation of hypothesis with treasure link method.",
                    "label": 1
                },
                {
                    "sent": "Experts involvement is crucial.",
                    "label": 1
                },
                {
                    "sent": "Expert evaluation evaluation confirms the relevance of findings.",
                    "label": 0
                },
                {
                    "sent": "And actually, we can see this method as a method for finding seeds of future discoveries in nowadays literature.",
                    "label": 1
                },
                {
                    "sent": "Now in the.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Closed the discovery framework.",
                    "label": 0
                },
                {
                    "sent": "There's also quite some work going on.",
                    "label": 0
                },
                {
                    "sent": "A lot of it.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Buy matiash again.",
                    "label": 0
                },
                {
                    "sent": "I will mention just some most important findings so far.",
                    "label": 0
                },
                {
                    "sent": "We actually found that the role of outliers is extremely important.",
                    "label": 0
                },
                {
                    "sent": "It was founded.",
                    "label": 0
                },
                {
                    "sent": "The majority of bridging concepts can be found in outlier documents and.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also, we evaluated how much we gain if we focus just on outliers in the sense of speed.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Matache actually provided a very nice improvement in the sense.",
                    "label": 0
                },
                {
                    "sent": "Towards program, selecting from the set of candidates by ranking the candidates by choosing which are the best ones.",
                    "label": 0
                },
                {
                    "sent": "Then he also improved this side-by-side document view, and there are also many other additional features with very nice functionality, interface and so on.",
                    "label": 1
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is how he represented in one of his previous presentations, how this list of Candidate B terms can be actually.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Select it so that the most promising ones are on the top, which makes work again easier for the expert.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is this.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nice interface.",
                    "label": 0
                },
                {
                    "sent": "Up if I go.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So two conclusions, what next?",
                    "label": 1
                },
                {
                    "sent": "Of course, we have many, many ideas how to upgrade open discovery across B and.",
                    "label": 0
                },
                {
                    "sent": "Obviously we would like to bring more more computational creativity into the process of knowledge discovery, so we believe that our work in the concrete projects where we will be working on concept creation technology will help us to move from this combinatorial.",
                    "label": 1
                },
                {
                    "sent": "A type of creativity also to the other types could be for example.",
                    "label": 0
                },
                {
                    "sent": "Discover this analogies like in examples I showed you with punched cars or evolutionary computing.",
                    "label": 0
                },
                {
                    "sent": "Finally, we are very proactively looking for the next case where we will prove our methods and we would like to do it from the first idea to the glorious end by ourselves.",
                    "label": 0
                },
                {
                    "sent": "So if there is any idea around, we will definitely take it seriously and see if we can do something together.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}