{
    "id": "5saldyq276226he4b6j34ojq4fh5o6cd",
    "title": "A Micro Crowdsourcing Architecture to Localize Web Content for Less-Resourced Languages",
    "info": {
        "author": [
            "Ruwan Asanka Wasala, Localisation Research Centre, CSIS Dept, University of Limerick"
        ],
        "published": "Dec. 12, 2011",
        "recorded": "October 2011",
        "category": [
            "Top->Computer Science->Multilingual Information Access"
        ]
    },
    "url": "http://videolectures.net/w3cworkshop2011_wasala_web/",
    "segmentation": [
        [
            "Good afternoon everybody.",
            "I'm one of the PhD student at the Localization Resource Center of University of Limerick, so my presentation is going to be a little bit different from the rest.",
            "It's be technical and the title is a my crowdsourcing architecture localized content for less resource."
        ],
        [
            "Languages.",
            "So when I say multilingual web, usually these are the languages that comes to mind and this word cloud represents the Internet content by language.",
            "But in my presentation are not then focusing on these languages.",
            "If you can see small dots here.",
            "I'm going to talk about."
        ],
        [
            "Languages that are not well represented in Internet.",
            "And particularly, I will be using my language which is single whole throughout the presentation to give you some examples and single is the mother of the majority of freedom."
        ],
        [
            "Consider a scenario that you have come across said saying Hello website that you need to somehow understand it."
        ],
        [
            "This is the website.",
            "And if you don't know single, of course you can understand anything.",
            "But if you really want to understand it.",
            "What would you do?",
            "And this is a really interesting article about one of the most famous festival in Sri Lanka.",
            "I think."
        ],
        [
            "The first approach is you go to Google.",
            "Translate and then you paste the URL.",
            "Click here and unfortunately single is not there.",
            "Sure, do."
        ],
        [
            "Next and single is not that true.",
            "Many other languages are not there."
        ],
        [
            "OK, if you go to variable fish smoke there too.",
            "So what will?"
        ],
        [
            "You do the.",
            "All option is to send this article to one of your friends in freedom can get it translated back so we can identify 2."
        ],
        [
            "Turns off website localization.",
            "One is automatic using machine translation engines, the other one is member of course.",
            "Consider Internet full of these articles.",
            "So we have a lot of particles."
        ],
        [
            "Like this, but if you don't know the language."
        ],
        [
            "It's of no use to you.",
            "You can't understand anything."
        ],
        [
            "And actually, this is the situation for people whose mother tongue is.",
            "These languages, for them, the Internet, is largely an English trip, so they cannot comprehend the knowledge in this English web.",
            "This is a very big problem."
        ],
        [
            "So obviously it's Needless to say website localization is very important from the social aspect when it comes to business too.",
            "According to Harvard based Forrester Research, English dominated web pages on the Internet have resulted in business losing sales revenues of $10,000,000 per year.",
            "So this is significant amount."
        ],
        [
            "But Luckily most of the people of majority are somewhat English literate.",
            "For example, how they?"
        ],
        [
            "The Internet is something like this.",
            "Let me.",
            "Show web page here.",
            "Get off and you come up with some very difficult words like this which you don't know the meaning.",
            "And this is the case of me as well when I'm browsing.",
            "I found some very difficult words.",
            "Assume this in the same script and to help with this community, but very first we came up with a very simple extension.",
            "All you have to do is just Hoover your mouse on top of such words and it will show you the definition that will help people to understand there.",
            "And it's not only that actually you can replace the actual.",
            "Definition like this.",
            "Kate.",
            "So this is a very simple adult.",
            "We first police this add on in 2018.",
            "Sri Lankan actually within a few months the download count up went.",
            "It went up around 20,000 and there are similar deals for other languages like Korean, Japanese, Chinese as well as Croatian similar isn't there?",
            "Though even the simple add-ons like dictionaries, player, major role in the multilingual web, let me go back to my presentation now."
        ],
        [
            "OK then, in 2009, at Localization Resource Center we came up with a novel idea too localized desktop software using the power of the crowd.",
            "The idea here is you just right click one term like this.",
            "And then you enter your translation here at the instance you get the translation and we have described the method in this Journal paper here.",
            "So we had this idea in our mind and we saw this around as well with this extension and this year we try to combine these two ideas together.",
            "So the result?"
        ],
        [
            "These crowd based real time paper localization strategy here that I'm going to explain so."
        ],
        [
            "So approach is somewhat different from the existing approaches.",
            "It semi automatic utilized the power of the crowd and is translation memory base.",
            "It's not machine translation based."
        ],
        [
            "Since the idea is very simple, let me quickly show you how we take books.",
            "Suppose you visit a website like this.",
            "You select a segment simply right click and use translate and you enter."
        ],
        [
            "Your translation in context.",
            "That's it, and you can do the same for the rest of the text as well, like this.",
            "And let's see how this architecture works real time.",
            "So."
        ],
        [
            "Is this your website?",
            "Then you're translating something you just submitted the translation.",
            "The translation will be taken care of by your extension, and this extension talks with a special server here and this server communicates with the actual web server, and when you submit your translation it will be sent to the server and it's going to so store."
        ],
        [
            "The details about the translation in next week format.",
            "We use texlive because you can store contextual information and use extensions as well."
        ],
        [
            "So it's going to store in the translation memory here and when you visit the website next time, what actually happen is you get the actual website from the web server and this you get all the translation measured from the server and you get the rendered page and it will be done by the extension here."
        ],
        [
            "This is how you get similar pages and all that.",
            "Now these days we are working on the editing of existing translations.",
            "An actual reporting alternative translations as well."
        ],
        [
            "How big do you look this prototype your signs?",
            "Identify some of the issues.",
            "First, the legal issues.",
            "Can I localize someone else's website?",
            "Can I look at his house website for example?",
            "And then this is.",
            "This only deals in the textual content of the websites, which is the most crucial element.",
            "But we have to think of methods for localising images and so on.",
            "And more these days, most of the websites are pretty dynamic, so how can you deal with constant updates?",
            "Maybe if you have a large translation memory you can deal with these updates and then there are styles and formatting issues, for example font size, level of times new Roman English might be the optimum when it comes to seeing or any other script.",
            "So these formatting issues are there for right to left languages and all these, and when it comes to translation voting, if there are two translations, the same number of words.",
            "How can you decide the best translation?",
            "And these are open issues, asset and employment issues of course.",
            "So farms load balancing all these users.",
            "If you are diploid, this in actual Internet."
        ],
        [
            "Besides all these issues, it is a very particular method, specially user for less resource language is not only for restless, less resource languages, it can be used as a tool to facilitate localization.",
            "An early stages of localization lifecycle actually.",
            "And it is a website independent framework.",
            "Actually localized season ladies virtual here needs among in cruising mechanism.",
            "Anyone can be a translator.",
            "You just right click the segment and then choose translate.",
            "So there's no learning curve associated with this method, and ultimately it's team based, so it's more accurate, and it helps build power resources such as parallel corpora for lists of languages."
        ],
        [
            "And having when we were developing, we also faced some challenges like if you develop an add on for certain browser you have to change it somehow to make it available for other browsers because there's no standard improves extensions today."
        ],
        [
            "And then there are some basic issues associated, especially with less resource language like thundering.",
            "Choose different processes, different rendering engine, some process used, the rendering of operating system, and then when it comes to operating system cleaner you have several Cutie Tango operating system Windows uniscribe.",
            "So and some of the processes their own lamp rendering engines.",
            "Even in Opentype fonts, Audioporn behaves in different parts in different process.",
            "So this is basically due to."
        ],
        [
            "How to solve?",
            "In the context of this workshop, I'd like to draw attention to standardization of proxy extensions and rendering engines possible.",
            "I don't know how practical is it."
        ],
        [
            "Memory.",
            "I presented to him.",
            "I'd like to emphasize that marketing will this one.",
            "Killing the web is not just a topical languages.",
            "We have to delete all the other languages as well.",
            "Even the simple browser extensions, like degenerates, they play a major role in multilingual web.",
            "And I also presented the novel crowd pairs translation memory based website localization architecture today.",
            "And then I drew attention to sanitization of proxy extensions and rendering engines have 4 minutes left so I will do a quick demonstration of the actual adult.",
            "So this is the website that I'm going to localize.",
            "Simply, you can select a segment here and now it's not in context, but you can just rightly choose translate here.",
            "I'll actually consult with the translation.",
            "How old are you translated from the articular six months here?",
            "OK.",
            "Basic tier submitted.",
            "So actually.",
            "It says it will be reviewed and updated.",
            "And similarly I can translate few more segments.",
            "Yes, choose.",
            "Yeah right click.",
            "Translate best.",
            "OK. To take while to update the server.",
            "But how can you retrieved all these translations back?",
            "I have translated most of the sentences here, just press F2.",
            "Can see it's done.",
            "So this is the idea.",
            "Female left, but of course you can translate similarly.",
            "Just like we can translate.",
            "Another website and this is the English page and you just press F2 here.",
            "And it's the same English with pitch, but the hotel changes some of the sentences here, so this is the idea that this extension, unless I told you this, will create a huge translation memory next week formats.",
            "OK, thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good afternoon everybody.",
                    "label": 0
                },
                {
                    "sent": "I'm one of the PhD student at the Localization Resource Center of University of Limerick, so my presentation is going to be a little bit different from the rest.",
                    "label": 0
                },
                {
                    "sent": "It's be technical and the title is a my crowdsourcing architecture localized content for less resource.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Languages.",
                    "label": 0
                },
                {
                    "sent": "So when I say multilingual web, usually these are the languages that comes to mind and this word cloud represents the Internet content by language.",
                    "label": 0
                },
                {
                    "sent": "But in my presentation are not then focusing on these languages.",
                    "label": 0
                },
                {
                    "sent": "If you can see small dots here.",
                    "label": 0
                },
                {
                    "sent": "I'm going to talk about.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Languages that are not well represented in Internet.",
                    "label": 0
                },
                {
                    "sent": "And particularly, I will be using my language which is single whole throughout the presentation to give you some examples and single is the mother of the majority of freedom.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Consider a scenario that you have come across said saying Hello website that you need to somehow understand it.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the website.",
                    "label": 0
                },
                {
                    "sent": "And if you don't know single, of course you can understand anything.",
                    "label": 0
                },
                {
                    "sent": "But if you really want to understand it.",
                    "label": 0
                },
                {
                    "sent": "What would you do?",
                    "label": 0
                },
                {
                    "sent": "And this is a really interesting article about one of the most famous festival in Sri Lanka.",
                    "label": 0
                },
                {
                    "sent": "I think.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The first approach is you go to Google.",
                    "label": 0
                },
                {
                    "sent": "Translate and then you paste the URL.",
                    "label": 0
                },
                {
                    "sent": "Click here and unfortunately single is not there.",
                    "label": 0
                },
                {
                    "sent": "Sure, do.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Next and single is not that true.",
                    "label": 0
                },
                {
                    "sent": "Many other languages are not there.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, if you go to variable fish smoke there too.",
                    "label": 0
                },
                {
                    "sent": "So what will?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You do the.",
                    "label": 0
                },
                {
                    "sent": "All option is to send this article to one of your friends in freedom can get it translated back so we can identify 2.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Turns off website localization.",
                    "label": 0
                },
                {
                    "sent": "One is automatic using machine translation engines, the other one is member of course.",
                    "label": 0
                },
                {
                    "sent": "Consider Internet full of these articles.",
                    "label": 0
                },
                {
                    "sent": "So we have a lot of particles.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Like this, but if you don't know the language.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's of no use to you.",
                    "label": 0
                },
                {
                    "sent": "You can't understand anything.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And actually, this is the situation for people whose mother tongue is.",
                    "label": 0
                },
                {
                    "sent": "These languages, for them, the Internet, is largely an English trip, so they cannot comprehend the knowledge in this English web.",
                    "label": 0
                },
                {
                    "sent": "This is a very big problem.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So obviously it's Needless to say website localization is very important from the social aspect when it comes to business too.",
                    "label": 0
                },
                {
                    "sent": "According to Harvard based Forrester Research, English dominated web pages on the Internet have resulted in business losing sales revenues of $10,000,000 per year.",
                    "label": 1
                },
                {
                    "sent": "So this is significant amount.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But Luckily most of the people of majority are somewhat English literate.",
                    "label": 0
                },
                {
                    "sent": "For example, how they?",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The Internet is something like this.",
                    "label": 0
                },
                {
                    "sent": "Let me.",
                    "label": 0
                },
                {
                    "sent": "Show web page here.",
                    "label": 0
                },
                {
                    "sent": "Get off and you come up with some very difficult words like this which you don't know the meaning.",
                    "label": 0
                },
                {
                    "sent": "And this is the case of me as well when I'm browsing.",
                    "label": 0
                },
                {
                    "sent": "I found some very difficult words.",
                    "label": 0
                },
                {
                    "sent": "Assume this in the same script and to help with this community, but very first we came up with a very simple extension.",
                    "label": 0
                },
                {
                    "sent": "All you have to do is just Hoover your mouse on top of such words and it will show you the definition that will help people to understand there.",
                    "label": 0
                },
                {
                    "sent": "And it's not only that actually you can replace the actual.",
                    "label": 0
                },
                {
                    "sent": "Definition like this.",
                    "label": 0
                },
                {
                    "sent": "Kate.",
                    "label": 0
                },
                {
                    "sent": "So this is a very simple adult.",
                    "label": 0
                },
                {
                    "sent": "We first police this add on in 2018.",
                    "label": 0
                },
                {
                    "sent": "Sri Lankan actually within a few months the download count up went.",
                    "label": 0
                },
                {
                    "sent": "It went up around 20,000 and there are similar deals for other languages like Korean, Japanese, Chinese as well as Croatian similar isn't there?",
                    "label": 0
                },
                {
                    "sent": "Though even the simple add-ons like dictionaries, player, major role in the multilingual web, let me go back to my presentation now.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK then, in 2009, at Localization Resource Center we came up with a novel idea too localized desktop software using the power of the crowd.",
                    "label": 0
                },
                {
                    "sent": "The idea here is you just right click one term like this.",
                    "label": 0
                },
                {
                    "sent": "And then you enter your translation here at the instance you get the translation and we have described the method in this Journal paper here.",
                    "label": 0
                },
                {
                    "sent": "So we had this idea in our mind and we saw this around as well with this extension and this year we try to combine these two ideas together.",
                    "label": 0
                },
                {
                    "sent": "So the result?",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These crowd based real time paper localization strategy here that I'm going to explain so.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So approach is somewhat different from the existing approaches.",
                    "label": 0
                },
                {
                    "sent": "It semi automatic utilized the power of the crowd and is translation memory base.",
                    "label": 0
                },
                {
                    "sent": "It's not machine translation based.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Since the idea is very simple, let me quickly show you how we take books.",
                    "label": 0
                },
                {
                    "sent": "Suppose you visit a website like this.",
                    "label": 0
                },
                {
                    "sent": "You select a segment simply right click and use translate and you enter.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Your translation in context.",
                    "label": 0
                },
                {
                    "sent": "That's it, and you can do the same for the rest of the text as well, like this.",
                    "label": 0
                },
                {
                    "sent": "And let's see how this architecture works real time.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is this your website?",
                    "label": 0
                },
                {
                    "sent": "Then you're translating something you just submitted the translation.",
                    "label": 0
                },
                {
                    "sent": "The translation will be taken care of by your extension, and this extension talks with a special server here and this server communicates with the actual web server, and when you submit your translation it will be sent to the server and it's going to so store.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The details about the translation in next week format.",
                    "label": 0
                },
                {
                    "sent": "We use texlive because you can store contextual information and use extensions as well.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So it's going to store in the translation memory here and when you visit the website next time, what actually happen is you get the actual website from the web server and this you get all the translation measured from the server and you get the rendered page and it will be done by the extension here.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is how you get similar pages and all that.",
                    "label": 0
                },
                {
                    "sent": "Now these days we are working on the editing of existing translations.",
                    "label": 0
                },
                {
                    "sent": "An actual reporting alternative translations as well.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How big do you look this prototype your signs?",
                    "label": 0
                },
                {
                    "sent": "Identify some of the issues.",
                    "label": 0
                },
                {
                    "sent": "First, the legal issues.",
                    "label": 0
                },
                {
                    "sent": "Can I localize someone else's website?",
                    "label": 0
                },
                {
                    "sent": "Can I look at his house website for example?",
                    "label": 0
                },
                {
                    "sent": "And then this is.",
                    "label": 0
                },
                {
                    "sent": "This only deals in the textual content of the websites, which is the most crucial element.",
                    "label": 0
                },
                {
                    "sent": "But we have to think of methods for localising images and so on.",
                    "label": 0
                },
                {
                    "sent": "And more these days, most of the websites are pretty dynamic, so how can you deal with constant updates?",
                    "label": 1
                },
                {
                    "sent": "Maybe if you have a large translation memory you can deal with these updates and then there are styles and formatting issues, for example font size, level of times new Roman English might be the optimum when it comes to seeing or any other script.",
                    "label": 1
                },
                {
                    "sent": "So these formatting issues are there for right to left languages and all these, and when it comes to translation voting, if there are two translations, the same number of words.",
                    "label": 0
                },
                {
                    "sent": "How can you decide the best translation?",
                    "label": 0
                },
                {
                    "sent": "And these are open issues, asset and employment issues of course.",
                    "label": 0
                },
                {
                    "sent": "So farms load balancing all these users.",
                    "label": 0
                },
                {
                    "sent": "If you are diploid, this in actual Internet.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Besides all these issues, it is a very particular method, specially user for less resource language is not only for restless, less resource languages, it can be used as a tool to facilitate localization.",
                    "label": 0
                },
                {
                    "sent": "An early stages of localization lifecycle actually.",
                    "label": 0
                },
                {
                    "sent": "And it is a website independent framework.",
                    "label": 1
                },
                {
                    "sent": "Actually localized season ladies virtual here needs among in cruising mechanism.",
                    "label": 0
                },
                {
                    "sent": "Anyone can be a translator.",
                    "label": 0
                },
                {
                    "sent": "You just right click the segment and then choose translate.",
                    "label": 0
                },
                {
                    "sent": "So there's no learning curve associated with this method, and ultimately it's team based, so it's more accurate, and it helps build power resources such as parallel corpora for lists of languages.",
                    "label": 1
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And having when we were developing, we also faced some challenges like if you develop an add on for certain browser you have to change it somehow to make it available for other browsers because there's no standard improves extensions today.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then there are some basic issues associated, especially with less resource language like thundering.",
                    "label": 0
                },
                {
                    "sent": "Choose different processes, different rendering engine, some process used, the rendering of operating system, and then when it comes to operating system cleaner you have several Cutie Tango operating system Windows uniscribe.",
                    "label": 1
                },
                {
                    "sent": "So and some of the processes their own lamp rendering engines.",
                    "label": 0
                },
                {
                    "sent": "Even in Opentype fonts, Audioporn behaves in different parts in different process.",
                    "label": 0
                },
                {
                    "sent": "So this is basically due to.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How to solve?",
                    "label": 0
                },
                {
                    "sent": "In the context of this workshop, I'd like to draw attention to standardization of proxy extensions and rendering engines possible.",
                    "label": 1
                },
                {
                    "sent": "I don't know how practical is it.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Memory.",
                    "label": 0
                },
                {
                    "sent": "I presented to him.",
                    "label": 0
                },
                {
                    "sent": "I'd like to emphasize that marketing will this one.",
                    "label": 0
                },
                {
                    "sent": "Killing the web is not just a topical languages.",
                    "label": 1
                },
                {
                    "sent": "We have to delete all the other languages as well.",
                    "label": 1
                },
                {
                    "sent": "Even the simple browser extensions, like degenerates, they play a major role in multilingual web.",
                    "label": 0
                },
                {
                    "sent": "And I also presented the novel crowd pairs translation memory based website localization architecture today.",
                    "label": 0
                },
                {
                    "sent": "And then I drew attention to sanitization of proxy extensions and rendering engines have 4 minutes left so I will do a quick demonstration of the actual adult.",
                    "label": 0
                },
                {
                    "sent": "So this is the website that I'm going to localize.",
                    "label": 0
                },
                {
                    "sent": "Simply, you can select a segment here and now it's not in context, but you can just rightly choose translate here.",
                    "label": 0
                },
                {
                    "sent": "I'll actually consult with the translation.",
                    "label": 0
                },
                {
                    "sent": "How old are you translated from the articular six months here?",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Basic tier submitted.",
                    "label": 0
                },
                {
                    "sent": "So actually.",
                    "label": 0
                },
                {
                    "sent": "It says it will be reviewed and updated.",
                    "label": 0
                },
                {
                    "sent": "And similarly I can translate few more segments.",
                    "label": 0
                },
                {
                    "sent": "Yes, choose.",
                    "label": 0
                },
                {
                    "sent": "Yeah right click.",
                    "label": 0
                },
                {
                    "sent": "Translate best.",
                    "label": 0
                },
                {
                    "sent": "OK. To take while to update the server.",
                    "label": 1
                },
                {
                    "sent": "But how can you retrieved all these translations back?",
                    "label": 0
                },
                {
                    "sent": "I have translated most of the sentences here, just press F2.",
                    "label": 0
                },
                {
                    "sent": "Can see it's done.",
                    "label": 0
                },
                {
                    "sent": "So this is the idea.",
                    "label": 0
                },
                {
                    "sent": "Female left, but of course you can translate similarly.",
                    "label": 0
                },
                {
                    "sent": "Just like we can translate.",
                    "label": 0
                },
                {
                    "sent": "Another website and this is the English page and you just press F2 here.",
                    "label": 0
                },
                {
                    "sent": "And it's the same English with pitch, but the hotel changes some of the sentences here, so this is the idea that this extension, unless I told you this, will create a huge translation memory next week formats.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you very much.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": []
        }
    }
}