{
    "id": "5thv24cjiwib4eqhlz3gze7qpxih4kto",
    "title": "Building with wood",
    "info": {
        "author": [
            "Peter Nussbaumer, Lead Discovery Center (LDC)"
        ],
        "published": "April 8, 2019",
        "recorded": "March 2019",
        "category": [
            "Top->Architecture"
        ]
    },
    "url": "http://videolectures.net/fa_nussbaumer_building_with_wood/",
    "segmentation": [
        [
            "Thank you for the warm welcome.",
            "I'm happy to be here in the city of Petznick.",
            "And I will give you a brief.",
            "A short breathing of our office first.",
            "How we work.",
            "So our understanding of architecture is.",
            "We have a first problem."
        ],
        [
            "D25 was founded in 1993 in Bregenz.",
            "It's a small city near Lake Constance.",
            "Started as a as a two person firm and.",
            "Managed to win some competitions.",
            "In the beginning.",
            "The biggest one they run in the starting of the of the office was the face peeling Congress housing bragance.",
            "It's one of the most important buildings for us.",
            "It was the start of.",
            "Of our career and till now we we.",
            "We were able to to rise to a group of about 100 architects.",
            "Working on different projects.",
            "From very small ones to quite big ones.",
            "From steel over concrete over wooden constructions, we don't want to be fixed in any position just to build in order just to build in concrete.",
            "We like to be open open minded.",
            "Open minded as our office is we have about 24 different countries in our office.",
            "And we like to be to get input from different cultures.",
            "Although our our our point where we started is in breeding season for alcoholic, mostly known for wooden architecture.",
            "We like to build with boots.",
            "We built many projects with both, but not for any price.",
            "It has to fit.",
            "Construction has to fit to the project and and so it's always a. I thinking which element is to write one.",
            "Nowadays we are working on five different in five different cities.",
            "We have the main office in Bragance.",
            "We have one in Vienna.",
            "One in Germany and Munich.",
            "Specially opened for the for the tail mentioned projects we do now.",
            "One in central in Switzerland and one in Paris."
        ],
        [
            "I want to show you three different projects with it.",
            "In the last 15 years.",
            "It's all these are all educational buildings.",
            "Schools and and the University in Munich.",
            "The first project I want to talk about just how to link Laos.",
            "It's a small village in for Albuq.",
            "In the rental.",
            "It was a.",
            "A competition in 2003.",
            "We have here the existing complex of the of the school building totally ran down.",
            "Energetically over it was it was done so the community decided to launch a competition for.",
            "For.",
            "A new school building and they want they had a building site nearby, so we made a proposal for volume.",
            "A form of AL we had the domain part, the school building and the 2nd second part with the All the.",
            "Official user Republic uses its library, it's a.",
            "It's a small hole for four.",
            "External use or for for smaller events.",
            "And we.",
            "Place the building like that to have a place where you arrive at the building where you have some space where you have.",
            "Cars and buses and different.",
            "Too too fast, too fast.",
            "And the second area, second outer space.",
            "That's more quiet.",
            "That's just for for the school itself, so."
        ],
        [
            "That's the the facade of the building showing to the street.",
            "We have this facade quite closed from the outside, quite closed.",
            "It was the we were thinking about the Kent Kent Food Bin that you that you open at one point.",
            "So you take this.",
            "Peace up and you.",
            "You define your entrance, your point where you can go into the into the areas near by what we see here is the existing building.",
            "We did this project in 2 two phases.",
            "One phase where the first phase was for the school building itself.",
            "The second one was to renovate and rebuilt the education.",
            "The chin facility and all the sports facilities nearby.",
            "And so it was a project that lasted for about 15 years.",
            "We started with this project here with the school with this.",
            "Element of the facade to the street and the school building in the rear part in the quiet."
        ],
        [
            "But when you look at the at the ground floor at the floor plan, it's quite easy organized.",
            "You see the incoming incoming space with the possibility to get into the.",
            "Volume were in the school in this central Hall for.",
            "Smaller events or pauses and it's easy organized with classes on the eastern part of the of the volume.",
            "Special classes at the western part of the of the volume and a big middle zone or floor zone where where we.",
            "Where we arrived is this single rooms.",
            "It's a very open space, open over the whole length of the building and open over the whole Heights of the building so it's there are no fire sections.",
            "It was it was important for us to keep it quite open as you will see later on.",
            "I'll talk about the gymnastics building later on so."
        ],
        [
            "The upper level is nearly.",
            "Same organized in the main sector.",
            "We have two staircases here in here where we can have secure six.",
            "You can get security out of the building and we have a library in this in this official in public."
        ],
        [
            "Part of the building.",
            "Here you see appeal.",
            "Picture of the construction site.",
            "It was a building that was completely built in vote.",
            "Just all the ground touching elements were built in concrete.",
            "And all the other stuff was built in wooden construction, totally prefabricated.",
            "That means you have to have a very good and high level planning processing before because changing on the construction site is very, very hard to do so.",
            "It's like this kind of building because you think about all the points that could make problems in a very early stage, so the construction.",
            "Face is very very easy normally so."
        ],
        [
            "Some pictures out of the of the construction, all prefabricated, all tubes, tubes.",
            "Where were you have to hold for order tubes?",
            "You have to think about them in a very early stage."
        ],
        [
            "So.",
            "The outside facade's quite easy with this big windows going over the whole length.",
            "Separated in two parts, I'll talk about the system of this Windows later on.",
            "And."
        ],
        [
            "Here you see it growing.",
            "Getting ready.",
            "The old Hall.",
            "The old gym Hall that we replaced later on."
        ],
        [
            "This is how it looks like looks now it's about 1716 years old.",
            "Meanwhile we have this this cool.",
            "Here we have this connecting element of the incoming place of the library here and the new chain building at Eastern part.",
            "With a beautiful view, it looks like like now we have that much snow really yet."
        ],
        [
            "So.",
            "We have a very transparent situation between the traffic here and the quiet zone for the.",
            "For the classes directly in front of the classrooms, but it's a it's a, although it's a barrier because it's it's organized in official and public space and then.",
            "Private more private outer space for them for school."
        ],
        [
            "The facades are quite easy organized.",
            "We have very big windows as I said over the whole length of the building, separated in two parts.",
            "We have a.",
            "One part at the upper site with very big classes this this one can be shaded.",
            "We can close it and the second one you see here it's put on the inner side of the wall.",
            "So we have a natural natural shading for these elements and we don't have to close them.",
            "It was important for us to allow pupils when they sit in there that they always have to visual or a few to the outside and the possibility to look to the outer space.",
            "And it's an element for us to structure these long big facilities for sets are about 80 meters long.",
            "From here to here, and I think.",
            "And nearly 12 meters high, so this element of two layers in the facade.",
            "It was a nice element to structure it."
        ],
        [
            "The copper element you signed the 1st.",
            "Pictures.",
            "In the first picture is quite dramatic.",
            "When you look from the outside, when you're in the inside, it's it's like a light curtain.",
            "It's a copper perforated with very small holes.",
            "Perforated just 27% of its fits.",
            "Of it all, so you wouldn't think that it could be that transparent, but when you're inside, it's like like a light curtain hanging in there.",
            "And what we like about this material is it?",
            "It changes, it changes.",
            "It's.",
            "Character in the night because in the night it close it gets this glow from the inside.",
            "You see there's something going on.",
            "You see the library is working.",
            "You see there are some events in the in the Hall so it gets like like a small showcase."
        ],
        [
            "We try in all our projects with try to.",
            "2.",
            "Use.",
            "Very.",
            "Little different materials we don't want to have 1015 materials we try to use three or four if possible.",
            "Here we have all the all the things that were constructed in concrete.",
            "You see them as the last layer we did.",
            "We didn't do anything on them, so it's all concrete.",
            "You see here, the staircase is the grounds.",
            "These are all concrete surface is.",
            "And all the wooden surface is reconstructed.",
            "We cover them in vote.",
            "We covered them here with Birch panels.",
            "The four in the hole in a room.",
            "We use this purge panels as a third element, we."
        ],
        [
            "We used.",
            "A red carpet for the school.",
            "This is the main domain zone of the of the school building.",
            "The floor where where everything goes on we have toward rooms.",
            "Here we have pauses.",
            "Here we have the entrance to every class over a small bridge.",
            "So every class has its own its own bridge going into into the room and in connection with the bridge we have these showcases here.",
            "They are empty because it was a picture when we opened it where the pupils can show what they're doing.",
            "They show their paintings, they show their their things they're making.",
            "It was their their point to show what they're doing.",
            "Every class has the same one in the in the at the other side of the door of the of the class, as you see here.",
            "It's totally open open.",
            "It's totally open over over the stores, so we have."
        ],
        [
            "These 60 metre long volume open over 60 meters open over the whole height and we use these elements here.",
            "These spaces to bring down over light places.",
            "Bring bring the light down to the ground and have the opportunity to bring light into the classes from a second facade so we have a light from the from the outer."
        ],
        [
            "So sad as you see here.",
            "And we have the possibility to have light from the inner facade and we always have these views you can.",
            "You can see through the whole building.",
            "You can when you when you're going down the floors you can look into the classes.",
            "You can look through the classes into the outside.",
            "And here I think you see the element of this changing layer from the outside of the wall to the inner side of the wall.",
            "With this natural shading always keeping open this this element so the pupil sitting here has always the possibility to look out."
        ],
        [
            "The second part of this project was the Chim we see here that the the.",
            "Old Jim.",
            "The community wanted to do it immediately after we have to be finished the school building they wanted to renovate the chain, but there was no money.",
            "So they waited and waited and waited and waited for about 10 years.",
            "And in these ten years the the building was.",
            "That rundown that that was the only possibility to remove it.",
            "And.",
            "We made a proposal for the removal."
        ],
        [
            "With a single volume placed in nearly the same way as the old building was, but in a higher energetic.",
            "Stay."
        ],
        [
            "Entered.",
            "As well as I showed before the ground, the floor plan here with the entrance to the school building using the same platform to come into the building in this big four year here with rooms for school, some groups rooms for some rooms for.",
            "They when they when they look after the kids for the whole day, they need some space.",
            "It was it was placed here.",
            "We had these two teams able to be separated and we had.",
            "The builder wanted to have a hole where they could make some events.",
            "Clause is a very small village, but they are quite good in wrestling and there, there in Bundesliga wrestling so they need a hole where they can do these events so.",
            "It was they wanted to have a whole where they do could do these wrestling and where they could have some some spectator platforms for the for the for the spectators to have a good view on the on the site.",
            "I'll show you something about that later."
        ],
        [
            "It's the upper floor in the upper floor.",
            "You just have some rooms for the music Society of the village and we have the constructive layer over the Hall.",
            "It's all.",
            "Built.",
            "Constructively, in the same way than the school, we did everything that was possible in the wooden construction.",
            "We were struggling for a long time whether we should do it.",
            "In the same way.",
            "Talking about surface is and colors.",
            "Then we did 10 years before in the school or whether we should do it in a total different way.",
            "In the end we we chose to do it in the same way as we did it in the school and I think it was the right decision.",
            "We used the same materials and we used to.",
            "We used the same.",
            "Elements for organizing these things and the same openness views it was.",
            "It was the same theme as we had in the in the school."
        ],
        [
            "The construction of the of the Hall of the gym.",
            "As you see here, it's a.",
            "It's a picture showing the idea.",
            "It was the idea for egg Carton where you bring in your X but just with a little disturb instead.",
            "We don't have this regular.",
            "Great on the ground floor and on the upper floor.",
            "We wanted to have the District grid on the on the.",
            "On the ground of this construction, but we didn't want to have it at the points of the light, so we these slight points are switching in every field.",
            "We have about 56.",
            "Elements of light in over this over his chin and we arranged to have four different.",
            "Elements of where this where this point 6.",
            "Kushner."
        ],
        [
            "Where this point sets and we arrange them to do that, you don't can't see that there are any similarities in this room, so."
        ],
        [
            "We see the construction site with this wooden beams going over the 30 meters free spanning andthis prefabricated elements we put in between these beams.",
            "They are all as you see here.",
            "They have all different shapes.",
            "And we arrange them to make it innovative.",
            "You have a very.",
            "Yeah, it's very free.",
            "Playoffs of light when you come into the Hall."
        ],
        [
            "The construction site.",
            "The construction, the Hall we arranged to do it one level down because we wanted to have a good overview when we come into the into the building.",
            "We have this wooden constructions.",
            "Here we have all the service rooms down there for for material that they use in these in these halls."
        ],
        [
            "And here you see.",
            "Two phases of building.",
            "The one was was already finished, the other one wasn't.",
            "Was in construction with all the Birch panels we put in here with very little amount of acoustic perforated elements because the angle of these elements were very ideal for acoustics not to have any echoes in this.",
            "In this rooms and you see the second picture with us.",
            "Stadium of constructing."
        ],
        [
            "The whole now has when you look at it, very strict grid.",
            "It's quite geometric and strict and.",
            "Only the one that stands in the chin and looks to the Sky sees this.",
            "This wymering of the lights we have the possibility here to bring some spectator platforms out electrically the we can.",
            "We can drive it here to have a good overview over the whole gym."
        ],
        [
            "Yeah.",
            "Picture of the."
        ],
        [
            "One element and we designed it in the same way as we did it in school with no fire shake sections if possible.",
            "In Australia it's it's law that you have to reach outer space.",
            "About 40 meters.",
            "So if you arrange to do that, you don't need any fire sections.",
            "And we arranged we could manage to do that so we didn't have any any.",
            "Sorry.",
            "Sorry.",
            "With two busy so we didn't didn't have to do any.",
            "Any closes here with glass panels or things like that so we could keep it very, very open.",
            "Using the same materials using concrete using Birch using this red floor."
        ],
        [
            "This is the room for the musicians for the music SoC where they do their trainings."
        ],
        [
            "And this is the whole once again with the possibility to to divide the two holes.",
            "But this dividing floor is just going up to this to this element here, so it's always possible to have an overview over the whole over the whole area."
        ],
        [
            "We, the covering of the building at the outside, we did also in wooden panels.",
            "It's all white fur.",
            "It's a regional route from our region.",
            "And."
        ],
        [
            "That's how it looks now with the building now 15 years old.",
            "The copper it got dark.",
            "It got it this black color.",
            "With the perforation you can see things from the inside here and the new building placed nearby with a bright wooden surface."
        ],
        [
            "Second project I'd like to show is the.",
            "Functionally, in Hoechst it's a.",
            "It's a project.",
            "For a small community about 6:00 or 7000 inhabitants.",
            "For a new school building for kids from 6 to 10 years.",
            "And they had a quite.",
            "Good picture of what they wanted to have.",
            "They wanted to have a school weather with a very strong direct connection from the inside to the outside.",
            "They wanted to have an inclusive school.",
            "No barriers.",
            "They wanted 2 1/3.",
            "One for us were voice.",
            "It's a region where there's.",
            "There are many single houses.",
            "It's a quiet.",
            "Quite narrow building structure and we wanted to to to take care of this building structure nearby so.",
            "In the competition we we said OK, we have a very big site where we could build.",
            "It was about 15,000 square meters and so we said we will try to arrange it all in one floor.",
            "It was a big risk for us because we knew there are two possibilities.",
            "The first is we will go out of the competition after three minutes and the second one is we will win it.",
            "Sadly it was."
        ],
        [
            "Second one.",
            "We what we see here is the existing building.",
            "It was a school of the 70s.",
            "Yeah.",
            "That's how they look.",
            "They are quite ugly, dark narrow.",
            "It's not working with new educational concepts and.",
            "Hicks wanted to do a school in the Nordic way of educating, so they wanted to have.",
            "The possibility that teachers can have very free education.",
            "So the the pupils say when and what and where they want to do their work.",
            "They just have plans for a week, what they have to do but they are free to do it on Monday on Thursday or on Friday, and they're free to do it at every space they want.",
            "So it's it was important to have a very open house.",
            "It was.",
            "It was important to have a very very transparent house, so the teachers also could oversee the whole area, as we will see later."
        ],
        [
            "That's how the school looks now.",
            "It's a.",
            "But four 4 1/2 meters of height, it's about 100 meters long and it's about 40 meters deep.",
            "Weather old old trees.",
            "Or three standing here we integrate it in the outer planning and with the main entrance going.",
            "Going in here with more height.",
            "We took the roof and placed it higher so we have more space.",
            "When we when we enter into the project."
        ],
        [
            "The floor plan.",
            "This is a quite easy one.",
            "We enter this cool at this place.",
            "We have a big forum or a Plaza where they meet one once a week to sync together to make smaller events.",
            "To make things like that.",
            "It's also used for pauses for four day care when they have total daycare.",
            "It's also used for playing we have.",
            "All the administration and special classes in this area.",
            "We have the gym.",
            "As we did it in Klaus, we also read it here.",
            "1 one floor down so we could arrange to have this 4 1/2 meters of height over the whole project and we have these four.",
            "House in a house is I would say it's a teaser cluster schools.",
            "These classes schools are always organized with the with the entrance with two small group education rooms, 2 classes, one central room with an over light or a skylight, and the direct connection to the the Garden and to the free class and.",
            "Somewhat rooms and toilets.",
            "These are four.",
            "Totally the same equal elements where every.",
            "Cluster have to say it has the same connection to the outer space.",
            "So.",
            "That was the argument."
        ],
        [
            "I think because we want the competition later on.",
            "I have some pictures from the from the construction site.",
            "The.",
            "With the Mega Trolley going here down, we have here the main room of the cluster we have here the the possibilities of gardening later on and here, with this pergola, the outside classes."
        ],
        [
            "The construction we did here was also completely done in Woods.",
            "Everything prefabricated and to make it even harder we try to to keep the constructive elements we placed as the surface you see later on so we had to be aware of all the.",
            "Dirt.",
            "Eating all the fluids, everything that could happen on a construction site.",
            "We had to be aware of this and we had to protect every wooden element with these panels over the whole construction time.",
            "We had also, these protections were also very important for us because we didn't want to have any UV light on these timber constructions, because when you have UV light on these timber construction state change their color.",
            "They are getting yellow or Brown or whatever and they're quite yeah it's not in a McCain race and it's quite a pity if you have that."
        ],
        [
            "All the constructions that this is the construction of the of the gym.",
            "Was done prefabricated.",
            "Always done in that way that we as you see here this is growing and it's falling down again.",
            "It's important for the construction site that you that the water in the construction time knows where to go so we don't plan any flat roofs.",
            "We always plan roofs that that have a direction for the word so that it's clear it's going and we have the possibility to keep the keep the constructions dry over the over the period."
        ],
        [
            "It was nearly finished at the outside with the with the main entrance.",
            "The gym here and the the.",
            "Administration and special rooms.",
            "At the right end."
        ],
        [
            "Side growing in the inside with the with the.",
            "Technicals we had here with the surface is we did here.",
            "We wanted to make it the same way as we did it in clouds with constructive elements we need for stiffening or for Fire Protection especially.",
            "I don't, I can't really handle this thing.",
            "I think my thumbs to pick weather.",
            "We try to keep them.",
            "Without any covering, so the constructive elements we need for stiffening there there.",
            "We didn't do anything on these surfaces."
        ],
        [
            "And we have this this element of.",
            "Of a cantilevered roof.",
            "As to mark the entrance to have some space to stand at the outside when it's raining."
        ],
        [
            "This is the in this for year now it's you're coming into into the building.",
            "At this point you have the daycare here.",
            "You have smaller events in this area.",
            "You can you can close it with with these.",
            "Curtains if you."
        ],
        [
            "Like and here is the Max trolley going over this 100 meter long building.",
            "Always having a look to the courtyards here to the to the gardens of the clusters.",
            "It's in a regular.",
            "You see it here, here, here.",
            "It's always been about 20 meters of.",
            "You have these connections to the to the gardens you have light to this, to these floors and you also have the connection with.",
            "You have this.",
            "Pick classes with the connection to the, to the gyms.",
            "It was important for us to have an open.",
            "There are no doors between the single clusters.",
            "They're all opened.",
            "There are no doors between the floor and the class to stare, all opening."
        ],
        [
            "Element this is the central room of these classes, with a connection to the space outside.",
            "With the gardening with the free classes, with the possibility to get this element away and have a big opening to the outside.",
            "It's all flexible inside so you can do with their furniture what you want.",
            "There are no fixed furnitures inside.",
            "And we have this very transparent situation from this from this central room to the classes.",
            "So the teacher can oversee the whole area."
        ],
        [
            "Here's a few from into the class with the big windows to the outside.",
            "The flexible furnishing here."
        ],
        [
            "The possibility to get out to the to the gardens with the free classes and later on the pergola at the light left."
        ],
        [
            "Inside it's a.",
            "It's a what we like about it is that every every class that has its own.",
            "It's own room.",
            "It's possible to get in there.",
            "You can easily go over this.",
            "This concrete element, but it's it's kind of barrier.",
            "So every every class has its own."
        ],
        [
            "Space."
        ],
        [
            "This is the main entrance."
        ],
        [
            "The third project that I'd like to talk is in construction.",
            "Now it's the campus of the teal mention.",
            "It's a very very prominent.",
            "Construction site.",
            "If you know Munich Olympiapark, it's the Olympic Village from 1972.",
            "Here you see the Fly Auto Stadium Olympic Stadium.",
            "Here we have to be in Bayville, Tacoma, blah.",
            "Here we have to be envy cylinders from Swanson here.",
            "It's a very very architectural historic.",
            "It's very very significant area and it was a.",
            "A competition to build a new.",
            "Esports.",
            "Faculty of The of the.",
            "University of Munich.",
            "They were split all over the all over the street all over the city.",
            "They had some sport sport facilities here.",
            "They had offices in the city.",
            "They had educational rooms and another place and the idea was to bring them all together at one point again.",
            "So.",
            "And this should all work in progress, so the University didn't have any any pause.",
            "It was going on over.",
            "It's going on right now, so we're constructing it parallel to the education.",
            "So it was quite hard to arrange it that we placed the building in that way that it's possible to build to remove and to build again.",
            "And.",
            "Our proposal was to."
        ],
        [
            "Was a project.",
            "With the with the.",
            "Very big, it's very big and very long and very broad.",
            "It's about 200 meters long, it's about 160 meters broad and it's about.",
            "Nine and a half, partly in some cases even higher nine and a half meters high.",
            "A2 Storey building where it was where it was the term to manage for about 20 chins.",
            "All the University administration stuff offices.",
            "All the seminar rooms, audimax, things like that library container.",
            "Sport facilities they have around 20 or 25 football fields around around this area with all all kinds of different sports.",
            "We had to work on and our proposal was to place one big volume.",
            "And this big volume you wanted to to get into this volume with the bridge we have this this significant.",
            "While I don't know it's called in English, it's A kind of kind of small amount, and I'd say going around the whole area and we wanted to get into the into the building at the first level at the level where all the student rooms, educational seminar rooms, all the audio Max is.",
            "Are located and to have.",
            "At the other side of this bridge, a second element with a with a cantilevered roof for about it cantilevers for about 22 meters free, constructed in votes to cover the.",
            "Lighted clitics runway, so they wanted to use these runways even though it's raining, so we managed that with this cantilevered roof that secures tries situation for usage.",
            "The big volume we structured with six.",
            "Square she put out of this of this element to have the possibility to bring light into the into the office is on to bring light into the middle zone.",
            "It's like.",
            "It's like a spiral column.",
            "I'd say it's the main thing of the whole project is going through through here from the beginning from the bridge till the end.",
            "We have here the Continent library with a big overview over the whole area and.",
            "In a very early stage, we decided to.",
            "Try to manage to build it in in vote.",
            "It's quite hard in Germany because.",
            "Germans like loss.",
            "And they have very many laws and we had to struggle for a long time to get it.",
            "Now for I think about 80% done in vote in a wooden construction."
        ],
        [
            "The building should look like this in the end, so.",
            "Yeah, as you see here, it's the building with this cantilevered roof over the over the runways.",
            "We have to ramp going up to the cafeteria with the library here at the front corner.",
            "We have all the offices in the front part here at the building at the corner in the rear part we have chims special rooms etc."
        ],
        [
            "The floor here looks.",
            "Quite complicated, we have this this.",
            "Spiral column in the in the middle with the bridge at the right hand side going through the through the building.",
            "This is the ground floor.",
            "With all the offices at.",
            "Left part and at the right part up with all the offices will with all the administration rooms.",
            "We have the halls with special usages for athletics, gym diagnostics etc.",
            "At the left upper left and the right down site.",
            "With about 20 holes, we managed to two."
        ],
        [
            "Bring in there and we have to the floor of the of the dam where we can where we come in.",
            "From the from the bridge into this.",
            "Middle zone with all the seminar rooms with all the fuse it was necessary it was it was a our idea to have always a few into this courtyard so you go down this main.",
            "Do you until you and have a view into this courtyards a few into your sport room so it's always changing sights and it's it's a quite open situation."
        ],
        [
            "Have to go through very quick so we see the construction site here with the old halls.",
            "This this."
        ],
        [
            "Hence we see the office tracked with the partly completed facades."
        ],
        [
            "We have the offices later in we see this cantilevered roof quite quick.",
            "Currently Woodroof over these 22 meters.",
            "Going over the going over the runways outside, it's just for constructing these columns down there.",
            "They will be removed later on."
        ],
        [
            "We have whole constructions inside.",
            "It's getting very very."
        ],
        [
            "Very, very quick."
        ],
        [
            "And you see this neighborhood with a fry auto with the old horse with our Audi of Idea.",
            "Afraid.",
            "OK.",
            "It was quite quite rapid ending, but yeah.",
            "That was that were the three project that I would like to show you.",
            "About our project.",
            "We didn't vote.",
            "It's not, I would say it's about 50% of our work.",
            "Is it in vote?",
            "But it has to fit to the to the sketches you make into the projects you make.",
            "We like to do it in Word.",
            "I hope you like it too.",
            "And yeah, thank you for attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you for the warm welcome.",
                    "label": 0
                },
                {
                    "sent": "I'm happy to be here in the city of Petznick.",
                    "label": 0
                },
                {
                    "sent": "And I will give you a brief.",
                    "label": 0
                },
                {
                    "sent": "A short breathing of our office first.",
                    "label": 0
                },
                {
                    "sent": "How we work.",
                    "label": 0
                },
                {
                    "sent": "So our understanding of architecture is.",
                    "label": 0
                },
                {
                    "sent": "We have a first problem.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "D25 was founded in 1993 in Bregenz.",
                    "label": 1
                },
                {
                    "sent": "It's a small city near Lake Constance.",
                    "label": 0
                },
                {
                    "sent": "Started as a as a two person firm and.",
                    "label": 0
                },
                {
                    "sent": "Managed to win some competitions.",
                    "label": 0
                },
                {
                    "sent": "In the beginning.",
                    "label": 0
                },
                {
                    "sent": "The biggest one they run in the starting of the of the office was the face peeling Congress housing bragance.",
                    "label": 0
                },
                {
                    "sent": "It's one of the most important buildings for us.",
                    "label": 0
                },
                {
                    "sent": "It was the start of.",
                    "label": 0
                },
                {
                    "sent": "Of our career and till now we we.",
                    "label": 0
                },
                {
                    "sent": "We were able to to rise to a group of about 100 architects.",
                    "label": 0
                },
                {
                    "sent": "Working on different projects.",
                    "label": 0
                },
                {
                    "sent": "From very small ones to quite big ones.",
                    "label": 0
                },
                {
                    "sent": "From steel over concrete over wooden constructions, we don't want to be fixed in any position just to build in order just to build in concrete.",
                    "label": 0
                },
                {
                    "sent": "We like to be open open minded.",
                    "label": 0
                },
                {
                    "sent": "Open minded as our office is we have about 24 different countries in our office.",
                    "label": 0
                },
                {
                    "sent": "And we like to be to get input from different cultures.",
                    "label": 0
                },
                {
                    "sent": "Although our our our point where we started is in breeding season for alcoholic, mostly known for wooden architecture.",
                    "label": 0
                },
                {
                    "sent": "We like to build with boots.",
                    "label": 0
                },
                {
                    "sent": "We built many projects with both, but not for any price.",
                    "label": 0
                },
                {
                    "sent": "It has to fit.",
                    "label": 0
                },
                {
                    "sent": "Construction has to fit to the project and and so it's always a. I thinking which element is to write one.",
                    "label": 0
                },
                {
                    "sent": "Nowadays we are working on five different in five different cities.",
                    "label": 0
                },
                {
                    "sent": "We have the main office in Bragance.",
                    "label": 0
                },
                {
                    "sent": "We have one in Vienna.",
                    "label": 0
                },
                {
                    "sent": "One in Germany and Munich.",
                    "label": 0
                },
                {
                    "sent": "Specially opened for the for the tail mentioned projects we do now.",
                    "label": 0
                },
                {
                    "sent": "One in central in Switzerland and one in Paris.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I want to show you three different projects with it.",
                    "label": 0
                },
                {
                    "sent": "In the last 15 years.",
                    "label": 0
                },
                {
                    "sent": "It's all these are all educational buildings.",
                    "label": 0
                },
                {
                    "sent": "Schools and and the University in Munich.",
                    "label": 0
                },
                {
                    "sent": "The first project I want to talk about just how to link Laos.",
                    "label": 0
                },
                {
                    "sent": "It's a small village in for Albuq.",
                    "label": 0
                },
                {
                    "sent": "In the rental.",
                    "label": 0
                },
                {
                    "sent": "It was a.",
                    "label": 0
                },
                {
                    "sent": "A competition in 2003.",
                    "label": 0
                },
                {
                    "sent": "We have here the existing complex of the of the school building totally ran down.",
                    "label": 0
                },
                {
                    "sent": "Energetically over it was it was done so the community decided to launch a competition for.",
                    "label": 0
                },
                {
                    "sent": "For.",
                    "label": 0
                },
                {
                    "sent": "A new school building and they want they had a building site nearby, so we made a proposal for volume.",
                    "label": 0
                },
                {
                    "sent": "A form of AL we had the domain part, the school building and the 2nd second part with the All the.",
                    "label": 0
                },
                {
                    "sent": "Official user Republic uses its library, it's a.",
                    "label": 0
                },
                {
                    "sent": "It's a small hole for four.",
                    "label": 0
                },
                {
                    "sent": "External use or for for smaller events.",
                    "label": 0
                },
                {
                    "sent": "And we.",
                    "label": 0
                },
                {
                    "sent": "Place the building like that to have a place where you arrive at the building where you have some space where you have.",
                    "label": 0
                },
                {
                    "sent": "Cars and buses and different.",
                    "label": 0
                },
                {
                    "sent": "Too too fast, too fast.",
                    "label": 0
                },
                {
                    "sent": "And the second area, second outer space.",
                    "label": 0
                },
                {
                    "sent": "That's more quiet.",
                    "label": 0
                },
                {
                    "sent": "That's just for for the school itself, so.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's the the facade of the building showing to the street.",
                    "label": 0
                },
                {
                    "sent": "We have this facade quite closed from the outside, quite closed.",
                    "label": 0
                },
                {
                    "sent": "It was the we were thinking about the Kent Kent Food Bin that you that you open at one point.",
                    "label": 0
                },
                {
                    "sent": "So you take this.",
                    "label": 0
                },
                {
                    "sent": "Peace up and you.",
                    "label": 0
                },
                {
                    "sent": "You define your entrance, your point where you can go into the into the areas near by what we see here is the existing building.",
                    "label": 0
                },
                {
                    "sent": "We did this project in 2 two phases.",
                    "label": 0
                },
                {
                    "sent": "One phase where the first phase was for the school building itself.",
                    "label": 0
                },
                {
                    "sent": "The second one was to renovate and rebuilt the education.",
                    "label": 0
                },
                {
                    "sent": "The chin facility and all the sports facilities nearby.",
                    "label": 0
                },
                {
                    "sent": "And so it was a project that lasted for about 15 years.",
                    "label": 0
                },
                {
                    "sent": "We started with this project here with the school with this.",
                    "label": 0
                },
                {
                    "sent": "Element of the facade to the street and the school building in the rear part in the quiet.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But when you look at the at the ground floor at the floor plan, it's quite easy organized.",
                    "label": 0
                },
                {
                    "sent": "You see the incoming incoming space with the possibility to get into the.",
                    "label": 0
                },
                {
                    "sent": "Volume were in the school in this central Hall for.",
                    "label": 0
                },
                {
                    "sent": "Smaller events or pauses and it's easy organized with classes on the eastern part of the of the volume.",
                    "label": 0
                },
                {
                    "sent": "Special classes at the western part of the of the volume and a big middle zone or floor zone where where we.",
                    "label": 0
                },
                {
                    "sent": "Where we arrived is this single rooms.",
                    "label": 0
                },
                {
                    "sent": "It's a very open space, open over the whole length of the building and open over the whole Heights of the building so it's there are no fire sections.",
                    "label": 0
                },
                {
                    "sent": "It was it was important for us to keep it quite open as you will see later on.",
                    "label": 0
                },
                {
                    "sent": "I'll talk about the gymnastics building later on so.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The upper level is nearly.",
                    "label": 0
                },
                {
                    "sent": "Same organized in the main sector.",
                    "label": 0
                },
                {
                    "sent": "We have two staircases here in here where we can have secure six.",
                    "label": 0
                },
                {
                    "sent": "You can get security out of the building and we have a library in this in this official in public.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Part of the building.",
                    "label": 0
                },
                {
                    "sent": "Here you see appeal.",
                    "label": 0
                },
                {
                    "sent": "Picture of the construction site.",
                    "label": 0
                },
                {
                    "sent": "It was a building that was completely built in vote.",
                    "label": 0
                },
                {
                    "sent": "Just all the ground touching elements were built in concrete.",
                    "label": 0
                },
                {
                    "sent": "And all the other stuff was built in wooden construction, totally prefabricated.",
                    "label": 0
                },
                {
                    "sent": "That means you have to have a very good and high level planning processing before because changing on the construction site is very, very hard to do so.",
                    "label": 0
                },
                {
                    "sent": "It's like this kind of building because you think about all the points that could make problems in a very early stage, so the construction.",
                    "label": 0
                },
                {
                    "sent": "Face is very very easy normally so.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some pictures out of the of the construction, all prefabricated, all tubes, tubes.",
                    "label": 0
                },
                {
                    "sent": "Where were you have to hold for order tubes?",
                    "label": 0
                },
                {
                    "sent": "You have to think about them in a very early stage.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The outside facade's quite easy with this big windows going over the whole length.",
                    "label": 0
                },
                {
                    "sent": "Separated in two parts, I'll talk about the system of this Windows later on.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here you see it growing.",
                    "label": 0
                },
                {
                    "sent": "Getting ready.",
                    "label": 0
                },
                {
                    "sent": "The old Hall.",
                    "label": 0
                },
                {
                    "sent": "The old gym Hall that we replaced later on.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is how it looks like looks now it's about 1716 years old.",
                    "label": 0
                },
                {
                    "sent": "Meanwhile we have this this cool.",
                    "label": 0
                },
                {
                    "sent": "Here we have this connecting element of the incoming place of the library here and the new chain building at Eastern part.",
                    "label": 0
                },
                {
                    "sent": "With a beautiful view, it looks like like now we have that much snow really yet.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We have a very transparent situation between the traffic here and the quiet zone for the.",
                    "label": 0
                },
                {
                    "sent": "For the classes directly in front of the classrooms, but it's a it's a, although it's a barrier because it's it's organized in official and public space and then.",
                    "label": 0
                },
                {
                    "sent": "Private more private outer space for them for school.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The facades are quite easy organized.",
                    "label": 0
                },
                {
                    "sent": "We have very big windows as I said over the whole length of the building, separated in two parts.",
                    "label": 0
                },
                {
                    "sent": "We have a.",
                    "label": 0
                },
                {
                    "sent": "One part at the upper site with very big classes this this one can be shaded.",
                    "label": 0
                },
                {
                    "sent": "We can close it and the second one you see here it's put on the inner side of the wall.",
                    "label": 0
                },
                {
                    "sent": "So we have a natural natural shading for these elements and we don't have to close them.",
                    "label": 0
                },
                {
                    "sent": "It was important for us to allow pupils when they sit in there that they always have to visual or a few to the outside and the possibility to look to the outer space.",
                    "label": 0
                },
                {
                    "sent": "And it's an element for us to structure these long big facilities for sets are about 80 meters long.",
                    "label": 0
                },
                {
                    "sent": "From here to here, and I think.",
                    "label": 0
                },
                {
                    "sent": "And nearly 12 meters high, so this element of two layers in the facade.",
                    "label": 0
                },
                {
                    "sent": "It was a nice element to structure it.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The copper element you signed the 1st.",
                    "label": 0
                },
                {
                    "sent": "Pictures.",
                    "label": 0
                },
                {
                    "sent": "In the first picture is quite dramatic.",
                    "label": 0
                },
                {
                    "sent": "When you look from the outside, when you're in the inside, it's it's like a light curtain.",
                    "label": 0
                },
                {
                    "sent": "It's a copper perforated with very small holes.",
                    "label": 0
                },
                {
                    "sent": "Perforated just 27% of its fits.",
                    "label": 0
                },
                {
                    "sent": "Of it all, so you wouldn't think that it could be that transparent, but when you're inside, it's like like a light curtain hanging in there.",
                    "label": 0
                },
                {
                    "sent": "And what we like about this material is it?",
                    "label": 0
                },
                {
                    "sent": "It changes, it changes.",
                    "label": 0
                },
                {
                    "sent": "It's.",
                    "label": 0
                },
                {
                    "sent": "Character in the night because in the night it close it gets this glow from the inside.",
                    "label": 0
                },
                {
                    "sent": "You see there's something going on.",
                    "label": 0
                },
                {
                    "sent": "You see the library is working.",
                    "label": 0
                },
                {
                    "sent": "You see there are some events in the in the Hall so it gets like like a small showcase.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We try in all our projects with try to.",
                    "label": 0
                },
                {
                    "sent": "2.",
                    "label": 0
                },
                {
                    "sent": "Use.",
                    "label": 0
                },
                {
                    "sent": "Very.",
                    "label": 0
                },
                {
                    "sent": "Little different materials we don't want to have 1015 materials we try to use three or four if possible.",
                    "label": 0
                },
                {
                    "sent": "Here we have all the all the things that were constructed in concrete.",
                    "label": 0
                },
                {
                    "sent": "You see them as the last layer we did.",
                    "label": 0
                },
                {
                    "sent": "We didn't do anything on them, so it's all concrete.",
                    "label": 0
                },
                {
                    "sent": "You see here, the staircase is the grounds.",
                    "label": 0
                },
                {
                    "sent": "These are all concrete surface is.",
                    "label": 0
                },
                {
                    "sent": "And all the wooden surface is reconstructed.",
                    "label": 0
                },
                {
                    "sent": "We cover them in vote.",
                    "label": 0
                },
                {
                    "sent": "We covered them here with Birch panels.",
                    "label": 0
                },
                {
                    "sent": "The four in the hole in a room.",
                    "label": 0
                },
                {
                    "sent": "We use this purge panels as a third element, we.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We used.",
                    "label": 0
                },
                {
                    "sent": "A red carpet for the school.",
                    "label": 0
                },
                {
                    "sent": "This is the main domain zone of the of the school building.",
                    "label": 0
                },
                {
                    "sent": "The floor where where everything goes on we have toward rooms.",
                    "label": 0
                },
                {
                    "sent": "Here we have pauses.",
                    "label": 0
                },
                {
                    "sent": "Here we have the entrance to every class over a small bridge.",
                    "label": 0
                },
                {
                    "sent": "So every class has its own its own bridge going into into the room and in connection with the bridge we have these showcases here.",
                    "label": 0
                },
                {
                    "sent": "They are empty because it was a picture when we opened it where the pupils can show what they're doing.",
                    "label": 0
                },
                {
                    "sent": "They show their paintings, they show their their things they're making.",
                    "label": 0
                },
                {
                    "sent": "It was their their point to show what they're doing.",
                    "label": 0
                },
                {
                    "sent": "Every class has the same one in the in the at the other side of the door of the of the class, as you see here.",
                    "label": 0
                },
                {
                    "sent": "It's totally open open.",
                    "label": 0
                },
                {
                    "sent": "It's totally open over over the stores, so we have.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These 60 metre long volume open over 60 meters open over the whole height and we use these elements here.",
                    "label": 0
                },
                {
                    "sent": "These spaces to bring down over light places.",
                    "label": 0
                },
                {
                    "sent": "Bring bring the light down to the ground and have the opportunity to bring light into the classes from a second facade so we have a light from the from the outer.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So sad as you see here.",
                    "label": 0
                },
                {
                    "sent": "And we have the possibility to have light from the inner facade and we always have these views you can.",
                    "label": 0
                },
                {
                    "sent": "You can see through the whole building.",
                    "label": 0
                },
                {
                    "sent": "You can when you when you're going down the floors you can look into the classes.",
                    "label": 0
                },
                {
                    "sent": "You can look through the classes into the outside.",
                    "label": 0
                },
                {
                    "sent": "And here I think you see the element of this changing layer from the outside of the wall to the inner side of the wall.",
                    "label": 0
                },
                {
                    "sent": "With this natural shading always keeping open this this element so the pupil sitting here has always the possibility to look out.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The second part of this project was the Chim we see here that the the.",
                    "label": 0
                },
                {
                    "sent": "Old Jim.",
                    "label": 0
                },
                {
                    "sent": "The community wanted to do it immediately after we have to be finished the school building they wanted to renovate the chain, but there was no money.",
                    "label": 0
                },
                {
                    "sent": "So they waited and waited and waited and waited for about 10 years.",
                    "label": 0
                },
                {
                    "sent": "And in these ten years the the building was.",
                    "label": 0
                },
                {
                    "sent": "That rundown that that was the only possibility to remove it.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "We made a proposal for the removal.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With a single volume placed in nearly the same way as the old building was, but in a higher energetic.",
                    "label": 0
                },
                {
                    "sent": "Stay.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Entered.",
                    "label": 0
                },
                {
                    "sent": "As well as I showed before the ground, the floor plan here with the entrance to the school building using the same platform to come into the building in this big four year here with rooms for school, some groups rooms for some rooms for.",
                    "label": 0
                },
                {
                    "sent": "They when they when they look after the kids for the whole day, they need some space.",
                    "label": 0
                },
                {
                    "sent": "It was it was placed here.",
                    "label": 0
                },
                {
                    "sent": "We had these two teams able to be separated and we had.",
                    "label": 0
                },
                {
                    "sent": "The builder wanted to have a hole where they could make some events.",
                    "label": 0
                },
                {
                    "sent": "Clause is a very small village, but they are quite good in wrestling and there, there in Bundesliga wrestling so they need a hole where they can do these events so.",
                    "label": 0
                },
                {
                    "sent": "It was they wanted to have a whole where they do could do these wrestling and where they could have some some spectator platforms for the for the for the spectators to have a good view on the on the site.",
                    "label": 0
                },
                {
                    "sent": "I'll show you something about that later.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's the upper floor in the upper floor.",
                    "label": 0
                },
                {
                    "sent": "You just have some rooms for the music Society of the village and we have the constructive layer over the Hall.",
                    "label": 0
                },
                {
                    "sent": "It's all.",
                    "label": 0
                },
                {
                    "sent": "Built.",
                    "label": 0
                },
                {
                    "sent": "Constructively, in the same way than the school, we did everything that was possible in the wooden construction.",
                    "label": 0
                },
                {
                    "sent": "We were struggling for a long time whether we should do it.",
                    "label": 0
                },
                {
                    "sent": "In the same way.",
                    "label": 0
                },
                {
                    "sent": "Talking about surface is and colors.",
                    "label": 0
                },
                {
                    "sent": "Then we did 10 years before in the school or whether we should do it in a total different way.",
                    "label": 0
                },
                {
                    "sent": "In the end we we chose to do it in the same way as we did it in the school and I think it was the right decision.",
                    "label": 0
                },
                {
                    "sent": "We used the same materials and we used to.",
                    "label": 0
                },
                {
                    "sent": "We used the same.",
                    "label": 0
                },
                {
                    "sent": "Elements for organizing these things and the same openness views it was.",
                    "label": 0
                },
                {
                    "sent": "It was the same theme as we had in the in the school.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The construction of the of the Hall of the gym.",
                    "label": 0
                },
                {
                    "sent": "As you see here, it's a.",
                    "label": 0
                },
                {
                    "sent": "It's a picture showing the idea.",
                    "label": 0
                },
                {
                    "sent": "It was the idea for egg Carton where you bring in your X but just with a little disturb instead.",
                    "label": 0
                },
                {
                    "sent": "We don't have this regular.",
                    "label": 0
                },
                {
                    "sent": "Great on the ground floor and on the upper floor.",
                    "label": 0
                },
                {
                    "sent": "We wanted to have the District grid on the on the.",
                    "label": 0
                },
                {
                    "sent": "On the ground of this construction, but we didn't want to have it at the points of the light, so we these slight points are switching in every field.",
                    "label": 0
                },
                {
                    "sent": "We have about 56.",
                    "label": 0
                },
                {
                    "sent": "Elements of light in over this over his chin and we arranged to have four different.",
                    "label": 0
                },
                {
                    "sent": "Elements of where this where this point 6.",
                    "label": 0
                },
                {
                    "sent": "Kushner.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Where this point sets and we arrange them to do that, you don't can't see that there are any similarities in this room, so.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We see the construction site with this wooden beams going over the 30 meters free spanning andthis prefabricated elements we put in between these beams.",
                    "label": 0
                },
                {
                    "sent": "They are all as you see here.",
                    "label": 0
                },
                {
                    "sent": "They have all different shapes.",
                    "label": 0
                },
                {
                    "sent": "And we arrange them to make it innovative.",
                    "label": 0
                },
                {
                    "sent": "You have a very.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's very free.",
                    "label": 0
                },
                {
                    "sent": "Playoffs of light when you come into the Hall.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The construction site.",
                    "label": 0
                },
                {
                    "sent": "The construction, the Hall we arranged to do it one level down because we wanted to have a good overview when we come into the into the building.",
                    "label": 0
                },
                {
                    "sent": "We have this wooden constructions.",
                    "label": 0
                },
                {
                    "sent": "Here we have all the service rooms down there for for material that they use in these in these halls.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here you see.",
                    "label": 0
                },
                {
                    "sent": "Two phases of building.",
                    "label": 0
                },
                {
                    "sent": "The one was was already finished, the other one wasn't.",
                    "label": 0
                },
                {
                    "sent": "Was in construction with all the Birch panels we put in here with very little amount of acoustic perforated elements because the angle of these elements were very ideal for acoustics not to have any echoes in this.",
                    "label": 0
                },
                {
                    "sent": "In this rooms and you see the second picture with us.",
                    "label": 0
                },
                {
                    "sent": "Stadium of constructing.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The whole now has when you look at it, very strict grid.",
                    "label": 0
                },
                {
                    "sent": "It's quite geometric and strict and.",
                    "label": 0
                },
                {
                    "sent": "Only the one that stands in the chin and looks to the Sky sees this.",
                    "label": 0
                },
                {
                    "sent": "This wymering of the lights we have the possibility here to bring some spectator platforms out electrically the we can.",
                    "label": 0
                },
                {
                    "sent": "We can drive it here to have a good overview over the whole gym.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Picture of the.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One element and we designed it in the same way as we did it in school with no fire shake sections if possible.",
                    "label": 0
                },
                {
                    "sent": "In Australia it's it's law that you have to reach outer space.",
                    "label": 0
                },
                {
                    "sent": "About 40 meters.",
                    "label": 0
                },
                {
                    "sent": "So if you arrange to do that, you don't need any fire sections.",
                    "label": 0
                },
                {
                    "sent": "And we arranged we could manage to do that so we didn't have any any.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "With two busy so we didn't didn't have to do any.",
                    "label": 0
                },
                {
                    "sent": "Any closes here with glass panels or things like that so we could keep it very, very open.",
                    "label": 0
                },
                {
                    "sent": "Using the same materials using concrete using Birch using this red floor.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the room for the musicians for the music SoC where they do their trainings.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is the whole once again with the possibility to to divide the two holes.",
                    "label": 0
                },
                {
                    "sent": "But this dividing floor is just going up to this to this element here, so it's always possible to have an overview over the whole over the whole area.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We, the covering of the building at the outside, we did also in wooden panels.",
                    "label": 0
                },
                {
                    "sent": "It's all white fur.",
                    "label": 0
                },
                {
                    "sent": "It's a regional route from our region.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's how it looks now with the building now 15 years old.",
                    "label": 0
                },
                {
                    "sent": "The copper it got dark.",
                    "label": 0
                },
                {
                    "sent": "It got it this black color.",
                    "label": 0
                },
                {
                    "sent": "With the perforation you can see things from the inside here and the new building placed nearby with a bright wooden surface.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Second project I'd like to show is the.",
                    "label": 0
                },
                {
                    "sent": "Functionally, in Hoechst it's a.",
                    "label": 0
                },
                {
                    "sent": "It's a project.",
                    "label": 0
                },
                {
                    "sent": "For a small community about 6:00 or 7000 inhabitants.",
                    "label": 0
                },
                {
                    "sent": "For a new school building for kids from 6 to 10 years.",
                    "label": 0
                },
                {
                    "sent": "And they had a quite.",
                    "label": 0
                },
                {
                    "sent": "Good picture of what they wanted to have.",
                    "label": 0
                },
                {
                    "sent": "They wanted to have a school weather with a very strong direct connection from the inside to the outside.",
                    "label": 0
                },
                {
                    "sent": "They wanted to have an inclusive school.",
                    "label": 0
                },
                {
                    "sent": "No barriers.",
                    "label": 0
                },
                {
                    "sent": "They wanted 2 1/3.",
                    "label": 0
                },
                {
                    "sent": "One for us were voice.",
                    "label": 0
                },
                {
                    "sent": "It's a region where there's.",
                    "label": 0
                },
                {
                    "sent": "There are many single houses.",
                    "label": 0
                },
                {
                    "sent": "It's a quiet.",
                    "label": 0
                },
                {
                    "sent": "Quite narrow building structure and we wanted to to to take care of this building structure nearby so.",
                    "label": 0
                },
                {
                    "sent": "In the competition we we said OK, we have a very big site where we could build.",
                    "label": 0
                },
                {
                    "sent": "It was about 15,000 square meters and so we said we will try to arrange it all in one floor.",
                    "label": 0
                },
                {
                    "sent": "It was a big risk for us because we knew there are two possibilities.",
                    "label": 0
                },
                {
                    "sent": "The first is we will go out of the competition after three minutes and the second one is we will win it.",
                    "label": 0
                },
                {
                    "sent": "Sadly it was.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Second one.",
                    "label": 0
                },
                {
                    "sent": "We what we see here is the existing building.",
                    "label": 0
                },
                {
                    "sent": "It was a school of the 70s.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "That's how they look.",
                    "label": 0
                },
                {
                    "sent": "They are quite ugly, dark narrow.",
                    "label": 0
                },
                {
                    "sent": "It's not working with new educational concepts and.",
                    "label": 0
                },
                {
                    "sent": "Hicks wanted to do a school in the Nordic way of educating, so they wanted to have.",
                    "label": 0
                },
                {
                    "sent": "The possibility that teachers can have very free education.",
                    "label": 0
                },
                {
                    "sent": "So the the pupils say when and what and where they want to do their work.",
                    "label": 0
                },
                {
                    "sent": "They just have plans for a week, what they have to do but they are free to do it on Monday on Thursday or on Friday, and they're free to do it at every space they want.",
                    "label": 0
                },
                {
                    "sent": "So it's it was important to have a very open house.",
                    "label": 0
                },
                {
                    "sent": "It was.",
                    "label": 0
                },
                {
                    "sent": "It was important to have a very very transparent house, so the teachers also could oversee the whole area, as we will see later.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's how the school looks now.",
                    "label": 0
                },
                {
                    "sent": "It's a.",
                    "label": 0
                },
                {
                    "sent": "But four 4 1/2 meters of height, it's about 100 meters long and it's about 40 meters deep.",
                    "label": 0
                },
                {
                    "sent": "Weather old old trees.",
                    "label": 0
                },
                {
                    "sent": "Or three standing here we integrate it in the outer planning and with the main entrance going.",
                    "label": 0
                },
                {
                    "sent": "Going in here with more height.",
                    "label": 0
                },
                {
                    "sent": "We took the roof and placed it higher so we have more space.",
                    "label": 0
                },
                {
                    "sent": "When we when we enter into the project.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The floor plan.",
                    "label": 0
                },
                {
                    "sent": "This is a quite easy one.",
                    "label": 0
                },
                {
                    "sent": "We enter this cool at this place.",
                    "label": 0
                },
                {
                    "sent": "We have a big forum or a Plaza where they meet one once a week to sync together to make smaller events.",
                    "label": 0
                },
                {
                    "sent": "To make things like that.",
                    "label": 0
                },
                {
                    "sent": "It's also used for pauses for four day care when they have total daycare.",
                    "label": 0
                },
                {
                    "sent": "It's also used for playing we have.",
                    "label": 0
                },
                {
                    "sent": "All the administration and special classes in this area.",
                    "label": 0
                },
                {
                    "sent": "We have the gym.",
                    "label": 0
                },
                {
                    "sent": "As we did it in Klaus, we also read it here.",
                    "label": 0
                },
                {
                    "sent": "1 one floor down so we could arrange to have this 4 1/2 meters of height over the whole project and we have these four.",
                    "label": 0
                },
                {
                    "sent": "House in a house is I would say it's a teaser cluster schools.",
                    "label": 0
                },
                {
                    "sent": "These classes schools are always organized with the with the entrance with two small group education rooms, 2 classes, one central room with an over light or a skylight, and the direct connection to the the Garden and to the free class and.",
                    "label": 0
                },
                {
                    "sent": "Somewhat rooms and toilets.",
                    "label": 0
                },
                {
                    "sent": "These are four.",
                    "label": 0
                },
                {
                    "sent": "Totally the same equal elements where every.",
                    "label": 0
                },
                {
                    "sent": "Cluster have to say it has the same connection to the outer space.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "That was the argument.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I think because we want the competition later on.",
                    "label": 0
                },
                {
                    "sent": "I have some pictures from the from the construction site.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "With the Mega Trolley going here down, we have here the main room of the cluster we have here the the possibilities of gardening later on and here, with this pergola, the outside classes.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The construction we did here was also completely done in Woods.",
                    "label": 0
                },
                {
                    "sent": "Everything prefabricated and to make it even harder we try to to keep the constructive elements we placed as the surface you see later on so we had to be aware of all the.",
                    "label": 0
                },
                {
                    "sent": "Dirt.",
                    "label": 0
                },
                {
                    "sent": "Eating all the fluids, everything that could happen on a construction site.",
                    "label": 0
                },
                {
                    "sent": "We had to be aware of this and we had to protect every wooden element with these panels over the whole construction time.",
                    "label": 0
                },
                {
                    "sent": "We had also, these protections were also very important for us because we didn't want to have any UV light on these timber constructions, because when you have UV light on these timber construction state change their color.",
                    "label": 0
                },
                {
                    "sent": "They are getting yellow or Brown or whatever and they're quite yeah it's not in a McCain race and it's quite a pity if you have that.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All the constructions that this is the construction of the of the gym.",
                    "label": 0
                },
                {
                    "sent": "Was done prefabricated.",
                    "label": 0
                },
                {
                    "sent": "Always done in that way that we as you see here this is growing and it's falling down again.",
                    "label": 0
                },
                {
                    "sent": "It's important for the construction site that you that the water in the construction time knows where to go so we don't plan any flat roofs.",
                    "label": 0
                },
                {
                    "sent": "We always plan roofs that that have a direction for the word so that it's clear it's going and we have the possibility to keep the keep the constructions dry over the over the period.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It was nearly finished at the outside with the with the main entrance.",
                    "label": 0
                },
                {
                    "sent": "The gym here and the the.",
                    "label": 0
                },
                {
                    "sent": "Administration and special rooms.",
                    "label": 0
                },
                {
                    "sent": "At the right end.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Side growing in the inside with the with the.",
                    "label": 0
                },
                {
                    "sent": "Technicals we had here with the surface is we did here.",
                    "label": 0
                },
                {
                    "sent": "We wanted to make it the same way as we did it in clouds with constructive elements we need for stiffening or for Fire Protection especially.",
                    "label": 0
                },
                {
                    "sent": "I don't, I can't really handle this thing.",
                    "label": 0
                },
                {
                    "sent": "I think my thumbs to pick weather.",
                    "label": 0
                },
                {
                    "sent": "We try to keep them.",
                    "label": 0
                },
                {
                    "sent": "Without any covering, so the constructive elements we need for stiffening there there.",
                    "label": 0
                },
                {
                    "sent": "We didn't do anything on these surfaces.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we have this this element of.",
                    "label": 0
                },
                {
                    "sent": "Of a cantilevered roof.",
                    "label": 0
                },
                {
                    "sent": "As to mark the entrance to have some space to stand at the outside when it's raining.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the in this for year now it's you're coming into into the building.",
                    "label": 0
                },
                {
                    "sent": "At this point you have the daycare here.",
                    "label": 0
                },
                {
                    "sent": "You have smaller events in this area.",
                    "label": 0
                },
                {
                    "sent": "You can you can close it with with these.",
                    "label": 0
                },
                {
                    "sent": "Curtains if you.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Like and here is the Max trolley going over this 100 meter long building.",
                    "label": 0
                },
                {
                    "sent": "Always having a look to the courtyards here to the to the gardens of the clusters.",
                    "label": 0
                },
                {
                    "sent": "It's in a regular.",
                    "label": 0
                },
                {
                    "sent": "You see it here, here, here.",
                    "label": 0
                },
                {
                    "sent": "It's always been about 20 meters of.",
                    "label": 0
                },
                {
                    "sent": "You have these connections to the to the gardens you have light to this, to these floors and you also have the connection with.",
                    "label": 0
                },
                {
                    "sent": "You have this.",
                    "label": 0
                },
                {
                    "sent": "Pick classes with the connection to the, to the gyms.",
                    "label": 0
                },
                {
                    "sent": "It was important for us to have an open.",
                    "label": 0
                },
                {
                    "sent": "There are no doors between the single clusters.",
                    "label": 0
                },
                {
                    "sent": "They're all opened.",
                    "label": 0
                },
                {
                    "sent": "There are no doors between the floor and the class to stare, all opening.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Element this is the central room of these classes, with a connection to the space outside.",
                    "label": 0
                },
                {
                    "sent": "With the gardening with the free classes, with the possibility to get this element away and have a big opening to the outside.",
                    "label": 0
                },
                {
                    "sent": "It's all flexible inside so you can do with their furniture what you want.",
                    "label": 0
                },
                {
                    "sent": "There are no fixed furnitures inside.",
                    "label": 0
                },
                {
                    "sent": "And we have this very transparent situation from this from this central room to the classes.",
                    "label": 0
                },
                {
                    "sent": "So the teacher can oversee the whole area.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here's a few from into the class with the big windows to the outside.",
                    "label": 0
                },
                {
                    "sent": "The flexible furnishing here.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The possibility to get out to the to the gardens with the free classes and later on the pergola at the light left.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Inside it's a.",
                    "label": 0
                },
                {
                    "sent": "It's a what we like about it is that every every class that has its own.",
                    "label": 0
                },
                {
                    "sent": "It's own room.",
                    "label": 0
                },
                {
                    "sent": "It's possible to get in there.",
                    "label": 0
                },
                {
                    "sent": "You can easily go over this.",
                    "label": 0
                },
                {
                    "sent": "This concrete element, but it's it's kind of barrier.",
                    "label": 0
                },
                {
                    "sent": "So every every class has its own.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Space.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the main entrance.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The third project that I'd like to talk is in construction.",
                    "label": 0
                },
                {
                    "sent": "Now it's the campus of the teal mention.",
                    "label": 0
                },
                {
                    "sent": "It's a very very prominent.",
                    "label": 0
                },
                {
                    "sent": "Construction site.",
                    "label": 0
                },
                {
                    "sent": "If you know Munich Olympiapark, it's the Olympic Village from 1972.",
                    "label": 0
                },
                {
                    "sent": "Here you see the Fly Auto Stadium Olympic Stadium.",
                    "label": 0
                },
                {
                    "sent": "Here we have to be in Bayville, Tacoma, blah.",
                    "label": 0
                },
                {
                    "sent": "Here we have to be envy cylinders from Swanson here.",
                    "label": 0
                },
                {
                    "sent": "It's a very very architectural historic.",
                    "label": 0
                },
                {
                    "sent": "It's very very significant area and it was a.",
                    "label": 0
                },
                {
                    "sent": "A competition to build a new.",
                    "label": 0
                },
                {
                    "sent": "Esports.",
                    "label": 0
                },
                {
                    "sent": "Faculty of The of the.",
                    "label": 0
                },
                {
                    "sent": "University of Munich.",
                    "label": 0
                },
                {
                    "sent": "They were split all over the all over the street all over the city.",
                    "label": 0
                },
                {
                    "sent": "They had some sport sport facilities here.",
                    "label": 0
                },
                {
                    "sent": "They had offices in the city.",
                    "label": 0
                },
                {
                    "sent": "They had educational rooms and another place and the idea was to bring them all together at one point again.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "And this should all work in progress, so the University didn't have any any pause.",
                    "label": 0
                },
                {
                    "sent": "It was going on over.",
                    "label": 0
                },
                {
                    "sent": "It's going on right now, so we're constructing it parallel to the education.",
                    "label": 0
                },
                {
                    "sent": "So it was quite hard to arrange it that we placed the building in that way that it's possible to build to remove and to build again.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Our proposal was to.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Was a project.",
                    "label": 0
                },
                {
                    "sent": "With the with the.",
                    "label": 0
                },
                {
                    "sent": "Very big, it's very big and very long and very broad.",
                    "label": 0
                },
                {
                    "sent": "It's about 200 meters long, it's about 160 meters broad and it's about.",
                    "label": 0
                },
                {
                    "sent": "Nine and a half, partly in some cases even higher nine and a half meters high.",
                    "label": 0
                },
                {
                    "sent": "A2 Storey building where it was where it was the term to manage for about 20 chins.",
                    "label": 0
                },
                {
                    "sent": "All the University administration stuff offices.",
                    "label": 0
                },
                {
                    "sent": "All the seminar rooms, audimax, things like that library container.",
                    "label": 0
                },
                {
                    "sent": "Sport facilities they have around 20 or 25 football fields around around this area with all all kinds of different sports.",
                    "label": 0
                },
                {
                    "sent": "We had to work on and our proposal was to place one big volume.",
                    "label": 0
                },
                {
                    "sent": "And this big volume you wanted to to get into this volume with the bridge we have this this significant.",
                    "label": 0
                },
                {
                    "sent": "While I don't know it's called in English, it's A kind of kind of small amount, and I'd say going around the whole area and we wanted to get into the into the building at the first level at the level where all the student rooms, educational seminar rooms, all the audio Max is.",
                    "label": 0
                },
                {
                    "sent": "Are located and to have.",
                    "label": 0
                },
                {
                    "sent": "At the other side of this bridge, a second element with a with a cantilevered roof for about it cantilevers for about 22 meters free, constructed in votes to cover the.",
                    "label": 0
                },
                {
                    "sent": "Lighted clitics runway, so they wanted to use these runways even though it's raining, so we managed that with this cantilevered roof that secures tries situation for usage.",
                    "label": 0
                },
                {
                    "sent": "The big volume we structured with six.",
                    "label": 0
                },
                {
                    "sent": "Square she put out of this of this element to have the possibility to bring light into the into the office is on to bring light into the middle zone.",
                    "label": 0
                },
                {
                    "sent": "It's like.",
                    "label": 0
                },
                {
                    "sent": "It's like a spiral column.",
                    "label": 0
                },
                {
                    "sent": "I'd say it's the main thing of the whole project is going through through here from the beginning from the bridge till the end.",
                    "label": 0
                },
                {
                    "sent": "We have here the Continent library with a big overview over the whole area and.",
                    "label": 0
                },
                {
                    "sent": "In a very early stage, we decided to.",
                    "label": 0
                },
                {
                    "sent": "Try to manage to build it in in vote.",
                    "label": 0
                },
                {
                    "sent": "It's quite hard in Germany because.",
                    "label": 0
                },
                {
                    "sent": "Germans like loss.",
                    "label": 0
                },
                {
                    "sent": "And they have very many laws and we had to struggle for a long time to get it.",
                    "label": 0
                },
                {
                    "sent": "Now for I think about 80% done in vote in a wooden construction.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The building should look like this in the end, so.",
                    "label": 0
                },
                {
                    "sent": "Yeah, as you see here, it's the building with this cantilevered roof over the over the runways.",
                    "label": 0
                },
                {
                    "sent": "We have to ramp going up to the cafeteria with the library here at the front corner.",
                    "label": 0
                },
                {
                    "sent": "We have all the offices in the front part here at the building at the corner in the rear part we have chims special rooms etc.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The floor here looks.",
                    "label": 0
                },
                {
                    "sent": "Quite complicated, we have this this.",
                    "label": 0
                },
                {
                    "sent": "Spiral column in the in the middle with the bridge at the right hand side going through the through the building.",
                    "label": 0
                },
                {
                    "sent": "This is the ground floor.",
                    "label": 0
                },
                {
                    "sent": "With all the offices at.",
                    "label": 0
                },
                {
                    "sent": "Left part and at the right part up with all the offices will with all the administration rooms.",
                    "label": 0
                },
                {
                    "sent": "We have the halls with special usages for athletics, gym diagnostics etc.",
                    "label": 0
                },
                {
                    "sent": "At the left upper left and the right down site.",
                    "label": 0
                },
                {
                    "sent": "With about 20 holes, we managed to two.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Bring in there and we have to the floor of the of the dam where we can where we come in.",
                    "label": 0
                },
                {
                    "sent": "From the from the bridge into this.",
                    "label": 0
                },
                {
                    "sent": "Middle zone with all the seminar rooms with all the fuse it was necessary it was it was a our idea to have always a few into this courtyard so you go down this main.",
                    "label": 0
                },
                {
                    "sent": "Do you until you and have a view into this courtyards a few into your sport room so it's always changing sights and it's it's a quite open situation.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Have to go through very quick so we see the construction site here with the old halls.",
                    "label": 0
                },
                {
                    "sent": "This this.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hence we see the office tracked with the partly completed facades.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have the offices later in we see this cantilevered roof quite quick.",
                    "label": 0
                },
                {
                    "sent": "Currently Woodroof over these 22 meters.",
                    "label": 0
                },
                {
                    "sent": "Going over the going over the runways outside, it's just for constructing these columns down there.",
                    "label": 0
                },
                {
                    "sent": "They will be removed later on.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have whole constructions inside.",
                    "label": 0
                },
                {
                    "sent": "It's getting very very.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Very, very quick.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you see this neighborhood with a fry auto with the old horse with our Audi of Idea.",
                    "label": 0
                },
                {
                    "sent": "Afraid.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "It was quite quite rapid ending, but yeah.",
                    "label": 0
                },
                {
                    "sent": "That was that were the three project that I would like to show you.",
                    "label": 0
                },
                {
                    "sent": "About our project.",
                    "label": 0
                },
                {
                    "sent": "We didn't vote.",
                    "label": 0
                },
                {
                    "sent": "It's not, I would say it's about 50% of our work.",
                    "label": 0
                },
                {
                    "sent": "Is it in vote?",
                    "label": 0
                },
                {
                    "sent": "But it has to fit to the to the sketches you make into the projects you make.",
                    "label": 0
                },
                {
                    "sent": "We like to do it in Word.",
                    "label": 0
                },
                {
                    "sent": "I hope you like it too.",
                    "label": 0
                },
                {
                    "sent": "And yeah, thank you for attention.",
                    "label": 0
                }
            ]
        }
    }
}