{
    "id": "5wgd3ioews2heklbtxxyqyhflitojygc",
    "title": "Biophotonics",
    "info": {
        "author": [
            "Seok-Hyun Yun, Bio-Optics Lab"
        ],
        "published": "Oct. 20, 2016",
        "recorded": "September 2016",
        "category": [
            "Top->Physics",
            "Top->Medicine"
        ]
    },
    "url": "http://videolectures.net/kolokviji_yun_biophotonics/",
    "segmentation": [
        [
            "Good afternoon everyone likes also thanks organizer everyone for inviting me to this beautiful place and Juliana in Slovenia is my first time coming to this institution and except Steven Institution is special to me because one of my former postdoc member studied in this University.",
            "And work in the institution and came to my lab.",
            "We're studying for peers and recently joined Institute here as a faculty member.",
            "I'm.",
            "And after being invited to this place, I was a little bit lazy in turning into the title and abstract, and I realize that somebody came up with a great title for my talk and posted in the website.",
            "So I had to decide to go with that.",
            "But actually that made me think what it is really biophotonics is a broad topic and how I can summarize that in this short period of time."
        ],
        [
            "So biophotonics is really 2 words.",
            "There's a bio and photonics, and from the perspective of physicist engineer, maybe technologists.",
            "This is photonics branch of photonics.",
            "Has anything to do with biology.",
            "But if you want to put a little more scientific context into it.",
            "Maybe we can think about this diagram here, so we have a photonics that is generated light and then biological matter, biological system.",
            "And really, the motivation of this whole fill is to use lights to understand in science, in biological systems better.",
            "And also we.",
            "Like to use light to find out the status of matter and specially in human patients and four to detect the disease.",
            "And we also use a sample from patients to analyze and to understand their state of the health is more disease like analysis and practical clinical medicine, but also like to use light to manipulate the system.",
            "To better understand the biology.",
            "An in clinical medicine will also like to make affect onto the living systems to improve their health or fix the problems an for treating the disease.",
            "So these are all underlying.",
            "The motivations an example of developing microscope perfectly fit into this category and from technology point of view.",
            "So this is what currently mostly what how we use light in this field.",
            "But we had in the morning.",
            "Great talk about Silicon photonics and Silicon photonics is not really about using light to understand Silicon.",
            "Is it mostly the other way round?",
            "You use silicone as an optical material.",
            "To create the functionality.",
            "And eventually you like to integrate this integrate this functionality onto the platform of Silicon.",
            "And integrated with the other functionality like Electro Opto Electronics and data into connection.",
            "So using that analogy we can broaden the concept of biophotonics and maybe this way so we use biomaterial bio matter as an optical material.",
            "We can think that way.",
            "Or we can think about having this photonic functionality maybe more seamlessly integrated into biological systems to appear living organisms or human patients.",
            "So today I like to talk about this letter part mostly and mostly using the result that came out of my lap.",
            "But before that I'd like to touch on the 1st topic, the current paradigm.",
            "How we use lights to make a better sense of what we like to do in the future and to make it better.",
            "So first."
        ],
        [
            "Sensing imaging, diagnosis, we already heard a little bit about this topic today.",
            "An here is more like using light to observation for observation.",
            "So in this case there is a photon coming into the sample, could be a blood sample from patient, or it could be a tissue taken from the patient or alive animal for experimental purposes or living patient.",
            "And this interacted with the matter.",
            "And then we measure the changes in the property of the photons, so that change could be absorption so that transmission.",
            "And phase change or the spectrum change their options.",
            "We analyze that to gather information about this biological matter.",
            "For example, this tissue oximeter oxygen oximeter is that uses spectroscopy methods and to measure the pulsation and the health of the patient.",
            "And also it's light, can interact and then scatter lights or change the polarization and we can map this property changes of the property over space to create images and tomography for diagnosis or scientific investigations.",
            "That's the one paradigm, but also going a little further, this photon interact a little more in the matter and get absorbed and energy changes energy so it can cause it in elastic scaling.",
            "With here about Rahman scaring and Breeland scaling today and it gets absorbed by the floor from molecules and this energy gets re emitted through full essence emission.",
            "And this is a very powerful tool for microscopy another.",
            "Chemical sensing.",
            "And some of these centers also realities through different form non electromagnetic wave.",
            "For example acoustic wave.",
            "So we measure this acoustic waves from that we infer and detect measured the molecular components were structural information from sample.",
            "So there are basic principles that we used for sensing image in diagonal."
        ],
        [
            "Beyond this observation, now is more active role and changing the state of matter and hear the photon coming in.",
            "And in this case a photon light.",
            "Really essentially serves as energy source is a non context noninvasive, what its electromagnetic energy source.",
            "This photo never gets absorbed in biological matter.",
            "And then these centers turned into very different forms an create the effect so it can be a heat that's photothermal effect, and the heat does a lot of different things can stimulate certain metabolism and expedite the chemical process and also denaturation.",
            "It can burn away issues and so that's either both positive way and then destructive way.",
            "We use that property.",
            "And this energy can turn into mechanical physical energy.",
            "Example like sharp mechanical.",
            "Create the shop that blatant issues and cut that issues.",
            "Things like that or like a kidney stone using laser to crack this kidney stone.",
            "That's based on this mechanism.",
            "And beyond this physical mechanism, you can also use like it generates a chemical effect, so excited molecule specific molecules excited state is really photons comes in at the left part of the chemical equation reaction, and it's a product of the chemistry.",
            "And provide a generate set useful effect.",
            "That chemical.",
            "Chemical reaction is tightly connected to the biological circuits.",
            "Cellular, biological circuit or genetic.",
            "Their circuit that we call it often time rather than photochemical, is a photo.",
            "It's a relevant photobiology.",
            "And light.",
            "Affecting the biological, the status that all these areas and mechanisms are used in different ways and different techniques in biological science and also clinical medicine.",
            "So I'm not going to go although details today, but I pick a few simple."
        ],
        [
            "Sample is just to give you an idea how we use light in clinical medicine, so this is a disease called B9 prostate hyperplasia.",
            "This is obviously happened in Mail, but it's a disorder but naturally happens.",
            "Almost all males and it's certainly so.",
            "It's basically enlargement of the prostate and that gets so big and start to compress the urine channels and causes all sorts of problems.",
            "And so solution.",
            "The treatment of that is surgically and open up this year in the channel.",
            "And there you can think about the surgical opening and cut it out.",
            "But the current standard care and the clinic is to use optical fiber and through this urinary channel, about half a millimeter diameter and using high power laser and to a blade that issues and open up this channels, and particularly using the wave links that are highly absorbed by.",
            "Buy water."
        ],
        [
            "And also another area that light is used very popularly is a optomology in I care.",
            "So probably you know the refractive surgery using femtosecond laser to carve out a blade cornea and also the excimer laser and also in the retina when you have a problem in retina for example.",
            "There can be a some care in the retina that can happen spontaneously.",
            "Most people at some point in your life.",
            "Happens and untreated when the severe the liquid in the eyeball leaks into.",
            "That answer was that issue and can lead to their lifting up the retina and at least the blindness.",
            "So how to treat that anyone is that air is minimal.",
            "An one way is to put surgical tools into your eyeball and then fix that.",
            "But when it's in most cases, current standard care is using laser pulses, so position using post laser and green for example color and then shoot the beam 1 by 1 around this tear an instantly damage actually damages that issue and overtime a few couple of weeks later naturally heal and create this car so that instantly formed a watertight sealing around is your tear an preventing the disease?",
            "From progressing further and getting worse.",
            "So light is used in this case.",
            "It's full of thermal effect.",
            "It's basically increase in temperature.",
            "And we use a light in the specialty area.",
            "The places where is otherwise very difficult.",
            "Access physically.",
            "That's for thermal effect.",
            "An there is also very popular powerful technique."
        ],
        [
            "Through the photochemistry.",
            "So photochemistry the effect of sunlight an molecules in human, some molecules inside the body has been known for many, many years 1000 years.",
            "But recently what it's really the first major success of triumph of that photobiology.",
            "It's happened about 100 years ago in Europe, Northern Europe, and then there was a like pandemic problems in bacterial infection in the skin, and particularly in the face and causes disfiguration.",
            "And even the death has been so pop widespread and become a real problem.",
            "So one physician back then is FinCEN Doctor Vincent and from Danish Mark, and he discovered that when he he made arc lamp and then shine this blue light and UV light onto this infectious area, the bacteria got killed.",
            "And while not damaging minimally damaging the surrounding native tissues, so many underlying mechanism is a bacteria produces certain molecules inside.",
            "Which absorbs of UV light and blue light and gets excited and interact with the surrounding environment like oxygen to create this reactive very toxic optic option.",
            "Species so killed of its own bacteria whereas human doesn't produce that as much as their molecule.",
            "So it became very successful an end up eradicating all this pandemic problems.",
            "So for that contribution he actually received the Nobel Prize in.",
            "Physiology and medicine for this.",
            "Light radiation therapy.",
            "So about the same."
        ],
        [
            "Time, another physician did very courageous self experiment, so he extracted a molecule from plants and injected himself and this plants again.",
            "Same thing absorb the sunlight and activate it and create the photo.",
            "Toxic species so he's found himself like all the skins that exposed to sunlight as well and then overtime it comes down.",
            "Bring the practice.",
            "Nowadays we call this.",
            "There are pharmaceutical companies developing these drugs.",
            "Synthetic drugs to maximize photosensitization effects school now photodynamic therapies use in a clinic.",
            "In very late stage cancer patients to kill the cancer, an overly stays and also bacterial removal.",
            "So these are like these are extrinsic molecules inject as a drug but also human being produces certain those light sensitive molecules.",
            "That's.",
            "That there are like phototherapy that's developed around that molecules.",
            "For example in infant baby they called sometimes develop a young this problem yellowing of the skin that's very popular in Asia.",
            "This is because of their high conservative Malec ability would be in the blue screen, which are the yellow coloring molecule that you find in the urine is too much, then causes can cause a toxic effect, and this molecule you probably have seen the baby under the small chamber with the blue lights and blue lights.",
            "Excited smolik and then make them conformational change into the form.",
            "There are more water soluble so it's easily secret out about it.",
            "So it's all like light therapy use in clinic."
        ],
        [
            "So it's here this busy cartoon shows a variety of a subset of the variety of the technologies that are actually being used in the clinic and mainstream medicine.",
            "There are a lot of techniques under development and doing research in the pipeline.",
            "There other other things and the people are developing here.",
            "This is a give you an idea that light is already being used and doing very useful job and.",
            "Clinical medicine and efficient to beyond the biological science in this.",
            "Area of surgery.",
            "Light activated therapy and optical diagnostics is rapidly emerging area.",
            "So if you look at here, there are all sorts of different organs in a whole body, but the predominant application of light it's in skin care and dermatology application an optomology.",
            "And that's basically simply because it's easier to access from outside the other applications, specially diagnosis, and the scope is a great example.",
            "And then through this GI digestive channels or Airways there are.",
            "We have a natural opening.",
            "Where is Ellis?",
            "Generate tissue is opaque and difficult to deliver lights and to this all these techniques.",
            "So."
        ],
        [
            "Beyond this, current technology and current paradigm, and there are efforts to.",
            "So if you look at here, you can imagine there are patient or live experiments and sample their optical instrumentation.",
            "The providing light detecting a light.",
            "And there is efforts to bring this instrument closer to your biological system.",
            "Um, that's."
        ],
        [
            "I'm going to talk about the rest of the topic, so for example, 1F word is too.",
            "Rather than make this instrument hard, and as we are is it is we are familiar with and making more flexible and even wearable, so it's closer to your body system and for example here, like in this case a light emitting diode, an miniaturizing liar and making on the various very thin substrate and putting on their flexible polymeric substrate that you can place.",
            "On your wearable devices where you're directly on your skin, this will serve as a sensor.",
            "For example, sweat sense or insight.",
            "You collect the sweat and analyze analyzing there, and we so example that it says implanted the superficially and then maybe detect chemicals like a glucose and other physiological status etc.",
            "An another also very emerging."
        ],
        [
            "Hot Topic is called optogenetics.",
            "This is basically started with an idea that using.",
            "Intrinsic light sensitive ion channels that's found in Algy and some plants.",
            "So this ion channel and present in the surface of the cell.",
            "When you absorb the photon and also conformational changes and open up the gate or close the gates so this is a way to use light too.",
            "Change the voltage signal so activate the neurons.",
            "And he activated neurons, where this is a way to modulate nerve signals so.",
            "That has been very very popular tool because it directly while you're special in the brain research, we're like brain signals, basic electrical signal.",
            "This is a way to modulate and stimulate and inhibit this brain.",
            "To better understand how the brain works or even the treat.",
            "Some of the new regenerated disease.",
            "And nowadays the concept has been broadened beyond this.",
            "Now it's like rather than just ion channels, people discovering or engineer or."
        ],
        [
            "You get the very clear signature of the lasing, so this is a.",
            "This is just demonstration that you can generate lasing from biological tissue in there.",
            "So sensing and lasing, it's all great and this is one of the other area that's application.",
            "We are particularly excited about is using beads as a tagging barcoding material, so."
        ],
        [
            "This is a spring Gallery mode spectrum of the one bit and if you look at it this you get the free spectral range.",
            "Again splitting TTM mode, they are all different and this you can analyze.",
            "This is directly related to the geometrical.",
            "Optical path length and geometry.",
            "So by analyzing this curve fitting you can actually very accurately determine the effective diameter of the bead with the precision that's as good as 50 pico meter out of by Micron 10 Micron.",
            "So imagine you have a lot of bids.",
            "Anne Anne, by analyzing their whispering Gallery mode the pattern you can determine the diameter if they have all different diameter, can identify individual ones.",
            "And in fact these are the beads as already inside the cell, which we don't just don't see the cell here.",
            "So imagine the cells analysis having this speed.",
            "Normally it's very difficult to all.",
            "The cells are different.",
            "They don't have a name tag on there on the earth surface, and this will be a good way to identify them.",
            "And you can trace them where they go inside a living animal, for example, and that will be a very powerful tool.",
            "For biological investigations.",
            "So we're going what we're going."
        ],
        [
            "One Direction that we're interested in here is this.",
            "This current paradigm.",
            "Again, there's a laser, and there is a biological sample, or patients.",
            "And we like to have a new paradigm an an making this laser very, very small, anbia compatible so that you can inject and embed them in public school system.",
            "So right now we are, we are purchasing it laser as an equipment.",
            "But in the future if that works well, that will be all supplies."
        ],
        [
            "So imagine now we have a laser inside tissue inside a human patient.",
            "How do you detect them?",
            "We want to trace them an follow individual cells.",
            "So we start to think about that.",
            "And so imagine here.",
            "I have a small yellow represent those individual lasers.",
            "And spread in 3D homogeneously and we use a light focusing objective lens to detect and we scan the beam.",
            "Hoping to detect one by one so normal case when you just detect fluorescence, the signal intensity is a linear function of the pump intensity.",
            "Like this, but if you do the signal integrity over depth resolved signal integrity over entire cross section as a function of Z.",
            "It's flat because here the intensity high at the focus, but you have a less number of probes and here intensity will be lower.",
            "By spread 'cause it is spread but you have a larger number of particles.",
            "So if you detect or integrate everything together so you get the flat response in optical microscopy with said there is no optical sectioning effect.",
            "So This is why you use a normal brightfield microscopy and looking at thick tissue.",
            "Everything gets blurred because signal from all the depth coming to the detector you just don't resolve.",
            "So to solve that in intravital microscopy sectioning microscope, people use.",
            "Nonlinear effects, so here, rather than using one photon, absorption used to photon upstairs, 2 photon microscopy so that your signal for this signal is a quadratic function of intensity, so that you have a more signal at the focus then outside.",
            "So that allows you to emphasize it and increase the signal only at the focus.",
            "That's so that we can pick tissue and you get a much clearer for sectional image.",
            "So now let."
        ],
        [
            "Think about laser.",
            "This now not spontaneous emission.",
            "This stimulate emission.",
            "What would happen?",
            "They will get the dramatic extreme maybe nonni around this threshold effect lasing threshold.",
            "So if you look at all mysterial emission you get you generate simulations only at the focal point we're intensities above your threshold, whereas else you don't have any stimuli mission.",
            "So that first of all you have a very little background, so gives you a very good contrast offer sectioning.",
            "And also the width of this will be narrower than your diffraction limit.",
            "So we did a simple experiments to confirm that verify that is resolution enhancement.",
            "So to do that we use Periscope nanowire very small, about 300 narrow mirror width, and we scanned beam using large beam and scan the beam across this short axis and see how the signal varies.",
            "So when you look at fluorescence broad, spontaneous fluorescent below threshold or even above threshold we can only focusing.",
            "This is what you get.",
            "If abroad awith, which perfectly match the European size, is diffraction limited when you look at the stimuli emission.",
            "The sharp peak above the broad spontaneous emission spectrum, then you only have a very narrow.",
            "Much narrower at this point.",
            "Spread function would be with.",
            "And here the signal with and you get the signal resolution in management about the effect of four and five and which is there some unique property of using laser as an emerging problem?",
            "OK, so."
        ],
        [
            "Summary so I. Hopefully that I convinced that showed light is already a useful tool.",
            "Alot of already penetrate into even biological lab in medical science labs and people use they don't call it photonics, it's taking for granted the use life variety to propose and they use a different lasers and instruments.",
            "And it's all based on very rich interaction between light and matter, specially biological matter and scaring the whole familiar with absorption for thermal.",
            "And there is for chemical or biological effects an.",
            "And the lights like.",
            "Above everything that we are using an already useful and practical an one thing opportunity there is light is a great tool to connect us to molecular status, individual molecules or even use.",
            "We can use a light to manipulate the genetic circuits in the cell or the molecular stated.",
            "And this is a great way to access to biological circuits from outside, noninvasive way.",
            "So in order to I think in the field.",
            "It will be growing in that area.",
            "To harvest this close connection and rich interactions directly into the biological circuits, and to do that there will be a more integration of photonics biological system.",
            "And I will show some of the initial efforts that's being in my made in my lap.",
            "OK, before I conclude I'd like to show them any result that's obtained by my former and current Members an there are.",
            "3 plus tax.",
            "Who came from Europe and already returned to Europe and 1st and then two.",
            "They both of them got ERCO starting grand and two years ago and the last year and then my third post stuff sitting over there.",
            "I hope that he can continue the tradition.",
            "So with that, thank you for your attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good afternoon everyone likes also thanks organizer everyone for inviting me to this beautiful place and Juliana in Slovenia is my first time coming to this institution and except Steven Institution is special to me because one of my former postdoc member studied in this University.",
                    "label": 0
                },
                {
                    "sent": "And work in the institution and came to my lab.",
                    "label": 0
                },
                {
                    "sent": "We're studying for peers and recently joined Institute here as a faculty member.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "And after being invited to this place, I was a little bit lazy in turning into the title and abstract, and I realize that somebody came up with a great title for my talk and posted in the website.",
                    "label": 0
                },
                {
                    "sent": "So I had to decide to go with that.",
                    "label": 0
                },
                {
                    "sent": "But actually that made me think what it is really biophotonics is a broad topic and how I can summarize that in this short period of time.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So biophotonics is really 2 words.",
                    "label": 0
                },
                {
                    "sent": "There's a bio and photonics, and from the perspective of physicist engineer, maybe technologists.",
                    "label": 0
                },
                {
                    "sent": "This is photonics branch of photonics.",
                    "label": 0
                },
                {
                    "sent": "Has anything to do with biology.",
                    "label": 0
                },
                {
                    "sent": "But if you want to put a little more scientific context into it.",
                    "label": 0
                },
                {
                    "sent": "Maybe we can think about this diagram here, so we have a photonics that is generated light and then biological matter, biological system.",
                    "label": 0
                },
                {
                    "sent": "And really, the motivation of this whole fill is to use lights to understand in science, in biological systems better.",
                    "label": 0
                },
                {
                    "sent": "And also we.",
                    "label": 0
                },
                {
                    "sent": "Like to use light to find out the status of matter and specially in human patients and four to detect the disease.",
                    "label": 0
                },
                {
                    "sent": "And we also use a sample from patients to analyze and to understand their state of the health is more disease like analysis and practical clinical medicine, but also like to use light to manipulate the system.",
                    "label": 0
                },
                {
                    "sent": "To better understand the biology.",
                    "label": 0
                },
                {
                    "sent": "An in clinical medicine will also like to make affect onto the living systems to improve their health or fix the problems an for treating the disease.",
                    "label": 0
                },
                {
                    "sent": "So these are all underlying.",
                    "label": 0
                },
                {
                    "sent": "The motivations an example of developing microscope perfectly fit into this category and from technology point of view.",
                    "label": 0
                },
                {
                    "sent": "So this is what currently mostly what how we use light in this field.",
                    "label": 0
                },
                {
                    "sent": "But we had in the morning.",
                    "label": 0
                },
                {
                    "sent": "Great talk about Silicon photonics and Silicon photonics is not really about using light to understand Silicon.",
                    "label": 0
                },
                {
                    "sent": "Is it mostly the other way round?",
                    "label": 0
                },
                {
                    "sent": "You use silicone as an optical material.",
                    "label": 0
                },
                {
                    "sent": "To create the functionality.",
                    "label": 0
                },
                {
                    "sent": "And eventually you like to integrate this integrate this functionality onto the platform of Silicon.",
                    "label": 0
                },
                {
                    "sent": "And integrated with the other functionality like Electro Opto Electronics and data into connection.",
                    "label": 0
                },
                {
                    "sent": "So using that analogy we can broaden the concept of biophotonics and maybe this way so we use biomaterial bio matter as an optical material.",
                    "label": 0
                },
                {
                    "sent": "We can think that way.",
                    "label": 0
                },
                {
                    "sent": "Or we can think about having this photonic functionality maybe more seamlessly integrated into biological systems to appear living organisms or human patients.",
                    "label": 1
                },
                {
                    "sent": "So today I like to talk about this letter part mostly and mostly using the result that came out of my lap.",
                    "label": 0
                },
                {
                    "sent": "But before that I'd like to touch on the 1st topic, the current paradigm.",
                    "label": 0
                },
                {
                    "sent": "How we use lights to make a better sense of what we like to do in the future and to make it better.",
                    "label": 0
                },
                {
                    "sent": "So first.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sensing imaging, diagnosis, we already heard a little bit about this topic today.",
                    "label": 1
                },
                {
                    "sent": "An here is more like using light to observation for observation.",
                    "label": 0
                },
                {
                    "sent": "So in this case there is a photon coming into the sample, could be a blood sample from patient, or it could be a tissue taken from the patient or alive animal for experimental purposes or living patient.",
                    "label": 0
                },
                {
                    "sent": "And this interacted with the matter.",
                    "label": 0
                },
                {
                    "sent": "And then we measure the changes in the property of the photons, so that change could be absorption so that transmission.",
                    "label": 0
                },
                {
                    "sent": "And phase change or the spectrum change their options.",
                    "label": 0
                },
                {
                    "sent": "We analyze that to gather information about this biological matter.",
                    "label": 0
                },
                {
                    "sent": "For example, this tissue oximeter oxygen oximeter is that uses spectroscopy methods and to measure the pulsation and the health of the patient.",
                    "label": 0
                },
                {
                    "sent": "And also it's light, can interact and then scatter lights or change the polarization and we can map this property changes of the property over space to create images and tomography for diagnosis or scientific investigations.",
                    "label": 0
                },
                {
                    "sent": "That's the one paradigm, but also going a little further, this photon interact a little more in the matter and get absorbed and energy changes energy so it can cause it in elastic scaling.",
                    "label": 0
                },
                {
                    "sent": "With here about Rahman scaring and Breeland scaling today and it gets absorbed by the floor from molecules and this energy gets re emitted through full essence emission.",
                    "label": 0
                },
                {
                    "sent": "And this is a very powerful tool for microscopy another.",
                    "label": 0
                },
                {
                    "sent": "Chemical sensing.",
                    "label": 0
                },
                {
                    "sent": "And some of these centers also realities through different form non electromagnetic wave.",
                    "label": 0
                },
                {
                    "sent": "For example acoustic wave.",
                    "label": 0
                },
                {
                    "sent": "So we measure this acoustic waves from that we infer and detect measured the molecular components were structural information from sample.",
                    "label": 0
                },
                {
                    "sent": "So there are basic principles that we used for sensing image in diagonal.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Beyond this observation, now is more active role and changing the state of matter and hear the photon coming in.",
                    "label": 0
                },
                {
                    "sent": "And in this case a photon light.",
                    "label": 0
                },
                {
                    "sent": "Really essentially serves as energy source is a non context noninvasive, what its electromagnetic energy source.",
                    "label": 0
                },
                {
                    "sent": "This photo never gets absorbed in biological matter.",
                    "label": 1
                },
                {
                    "sent": "And then these centers turned into very different forms an create the effect so it can be a heat that's photothermal effect, and the heat does a lot of different things can stimulate certain metabolism and expedite the chemical process and also denaturation.",
                    "label": 0
                },
                {
                    "sent": "It can burn away issues and so that's either both positive way and then destructive way.",
                    "label": 0
                },
                {
                    "sent": "We use that property.",
                    "label": 0
                },
                {
                    "sent": "And this energy can turn into mechanical physical energy.",
                    "label": 0
                },
                {
                    "sent": "Example like sharp mechanical.",
                    "label": 0
                },
                {
                    "sent": "Create the shop that blatant issues and cut that issues.",
                    "label": 0
                },
                {
                    "sent": "Things like that or like a kidney stone using laser to crack this kidney stone.",
                    "label": 0
                },
                {
                    "sent": "That's based on this mechanism.",
                    "label": 0
                },
                {
                    "sent": "And beyond this physical mechanism, you can also use like it generates a chemical effect, so excited molecule specific molecules excited state is really photons comes in at the left part of the chemical equation reaction, and it's a product of the chemistry.",
                    "label": 0
                },
                {
                    "sent": "And provide a generate set useful effect.",
                    "label": 0
                },
                {
                    "sent": "That chemical.",
                    "label": 0
                },
                {
                    "sent": "Chemical reaction is tightly connected to the biological circuits.",
                    "label": 0
                },
                {
                    "sent": "Cellular, biological circuit or genetic.",
                    "label": 0
                },
                {
                    "sent": "Their circuit that we call it often time rather than photochemical, is a photo.",
                    "label": 0
                },
                {
                    "sent": "It's a relevant photobiology.",
                    "label": 0
                },
                {
                    "sent": "And light.",
                    "label": 0
                },
                {
                    "sent": "Affecting the biological, the status that all these areas and mechanisms are used in different ways and different techniques in biological science and also clinical medicine.",
                    "label": 0
                },
                {
                    "sent": "So I'm not going to go although details today, but I pick a few simple.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sample is just to give you an idea how we use light in clinical medicine, so this is a disease called B9 prostate hyperplasia.",
                    "label": 0
                },
                {
                    "sent": "This is obviously happened in Mail, but it's a disorder but naturally happens.",
                    "label": 0
                },
                {
                    "sent": "Almost all males and it's certainly so.",
                    "label": 0
                },
                {
                    "sent": "It's basically enlargement of the prostate and that gets so big and start to compress the urine channels and causes all sorts of problems.",
                    "label": 0
                },
                {
                    "sent": "And so solution.",
                    "label": 0
                },
                {
                    "sent": "The treatment of that is surgically and open up this year in the channel.",
                    "label": 0
                },
                {
                    "sent": "And there you can think about the surgical opening and cut it out.",
                    "label": 0
                },
                {
                    "sent": "But the current standard care and the clinic is to use optical fiber and through this urinary channel, about half a millimeter diameter and using high power laser and to a blade that issues and open up this channels, and particularly using the wave links that are highly absorbed by.",
                    "label": 0
                },
                {
                    "sent": "Buy water.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And also another area that light is used very popularly is a optomology in I care.",
                    "label": 0
                },
                {
                    "sent": "So probably you know the refractive surgery using femtosecond laser to carve out a blade cornea and also the excimer laser and also in the retina when you have a problem in retina for example.",
                    "label": 0
                },
                {
                    "sent": "There can be a some care in the retina that can happen spontaneously.",
                    "label": 0
                },
                {
                    "sent": "Most people at some point in your life.",
                    "label": 0
                },
                {
                    "sent": "Happens and untreated when the severe the liquid in the eyeball leaks into.",
                    "label": 0
                },
                {
                    "sent": "That answer was that issue and can lead to their lifting up the retina and at least the blindness.",
                    "label": 0
                },
                {
                    "sent": "So how to treat that anyone is that air is minimal.",
                    "label": 0
                },
                {
                    "sent": "An one way is to put surgical tools into your eyeball and then fix that.",
                    "label": 0
                },
                {
                    "sent": "But when it's in most cases, current standard care is using laser pulses, so position using post laser and green for example color and then shoot the beam 1 by 1 around this tear an instantly damage actually damages that issue and overtime a few couple of weeks later naturally heal and create this car so that instantly formed a watertight sealing around is your tear an preventing the disease?",
                    "label": 0
                },
                {
                    "sent": "From progressing further and getting worse.",
                    "label": 0
                },
                {
                    "sent": "So light is used in this case.",
                    "label": 0
                },
                {
                    "sent": "It's full of thermal effect.",
                    "label": 0
                },
                {
                    "sent": "It's basically increase in temperature.",
                    "label": 0
                },
                {
                    "sent": "And we use a light in the specialty area.",
                    "label": 0
                },
                {
                    "sent": "The places where is otherwise very difficult.",
                    "label": 0
                },
                {
                    "sent": "Access physically.",
                    "label": 0
                },
                {
                    "sent": "That's for thermal effect.",
                    "label": 0
                },
                {
                    "sent": "An there is also very popular powerful technique.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Through the photochemistry.",
                    "label": 0
                },
                {
                    "sent": "So photochemistry the effect of sunlight an molecules in human, some molecules inside the body has been known for many, many years 1000 years.",
                    "label": 0
                },
                {
                    "sent": "But recently what it's really the first major success of triumph of that photobiology.",
                    "label": 0
                },
                {
                    "sent": "It's happened about 100 years ago in Europe, Northern Europe, and then there was a like pandemic problems in bacterial infection in the skin, and particularly in the face and causes disfiguration.",
                    "label": 0
                },
                {
                    "sent": "And even the death has been so pop widespread and become a real problem.",
                    "label": 0
                },
                {
                    "sent": "So one physician back then is FinCEN Doctor Vincent and from Danish Mark, and he discovered that when he he made arc lamp and then shine this blue light and UV light onto this infectious area, the bacteria got killed.",
                    "label": 0
                },
                {
                    "sent": "And while not damaging minimally damaging the surrounding native tissues, so many underlying mechanism is a bacteria produces certain molecules inside.",
                    "label": 0
                },
                {
                    "sent": "Which absorbs of UV light and blue light and gets excited and interact with the surrounding environment like oxygen to create this reactive very toxic optic option.",
                    "label": 0
                },
                {
                    "sent": "Species so killed of its own bacteria whereas human doesn't produce that as much as their molecule.",
                    "label": 0
                },
                {
                    "sent": "So it became very successful an end up eradicating all this pandemic problems.",
                    "label": 0
                },
                {
                    "sent": "So for that contribution he actually received the Nobel Prize in.",
                    "label": 0
                },
                {
                    "sent": "Physiology and medicine for this.",
                    "label": 0
                },
                {
                    "sent": "Light radiation therapy.",
                    "label": 0
                },
                {
                    "sent": "So about the same.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Time, another physician did very courageous self experiment, so he extracted a molecule from plants and injected himself and this plants again.",
                    "label": 0
                },
                {
                    "sent": "Same thing absorb the sunlight and activate it and create the photo.",
                    "label": 0
                },
                {
                    "sent": "Toxic species so he's found himself like all the skins that exposed to sunlight as well and then overtime it comes down.",
                    "label": 0
                },
                {
                    "sent": "Bring the practice.",
                    "label": 0
                },
                {
                    "sent": "Nowadays we call this.",
                    "label": 0
                },
                {
                    "sent": "There are pharmaceutical companies developing these drugs.",
                    "label": 0
                },
                {
                    "sent": "Synthetic drugs to maximize photosensitization effects school now photodynamic therapies use in a clinic.",
                    "label": 0
                },
                {
                    "sent": "In very late stage cancer patients to kill the cancer, an overly stays and also bacterial removal.",
                    "label": 0
                },
                {
                    "sent": "So these are like these are extrinsic molecules inject as a drug but also human being produces certain those light sensitive molecules.",
                    "label": 0
                },
                {
                    "sent": "That's.",
                    "label": 0
                },
                {
                    "sent": "That there are like phototherapy that's developed around that molecules.",
                    "label": 0
                },
                {
                    "sent": "For example in infant baby they called sometimes develop a young this problem yellowing of the skin that's very popular in Asia.",
                    "label": 0
                },
                {
                    "sent": "This is because of their high conservative Malec ability would be in the blue screen, which are the yellow coloring molecule that you find in the urine is too much, then causes can cause a toxic effect, and this molecule you probably have seen the baby under the small chamber with the blue lights and blue lights.",
                    "label": 0
                },
                {
                    "sent": "Excited smolik and then make them conformational change into the form.",
                    "label": 0
                },
                {
                    "sent": "There are more water soluble so it's easily secret out about it.",
                    "label": 0
                },
                {
                    "sent": "So it's all like light therapy use in clinic.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So it's here this busy cartoon shows a variety of a subset of the variety of the technologies that are actually being used in the clinic and mainstream medicine.",
                    "label": 0
                },
                {
                    "sent": "There are a lot of techniques under development and doing research in the pipeline.",
                    "label": 0
                },
                {
                    "sent": "There other other things and the people are developing here.",
                    "label": 0
                },
                {
                    "sent": "This is a give you an idea that light is already being used and doing very useful job and.",
                    "label": 0
                },
                {
                    "sent": "Clinical medicine and efficient to beyond the biological science in this.",
                    "label": 0
                },
                {
                    "sent": "Area of surgery.",
                    "label": 0
                },
                {
                    "sent": "Light activated therapy and optical diagnostics is rapidly emerging area.",
                    "label": 0
                },
                {
                    "sent": "So if you look at here, there are all sorts of different organs in a whole body, but the predominant application of light it's in skin care and dermatology application an optomology.",
                    "label": 0
                },
                {
                    "sent": "And that's basically simply because it's easier to access from outside the other applications, specially diagnosis, and the scope is a great example.",
                    "label": 0
                },
                {
                    "sent": "And then through this GI digestive channels or Airways there are.",
                    "label": 0
                },
                {
                    "sent": "We have a natural opening.",
                    "label": 0
                },
                {
                    "sent": "Where is Ellis?",
                    "label": 0
                },
                {
                    "sent": "Generate tissue is opaque and difficult to deliver lights and to this all these techniques.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Beyond this, current technology and current paradigm, and there are efforts to.",
                    "label": 0
                },
                {
                    "sent": "So if you look at here, you can imagine there are patient or live experiments and sample their optical instrumentation.",
                    "label": 0
                },
                {
                    "sent": "The providing light detecting a light.",
                    "label": 0
                },
                {
                    "sent": "And there is efforts to bring this instrument closer to your biological system.",
                    "label": 0
                },
                {
                    "sent": "Um, that's.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm going to talk about the rest of the topic, so for example, 1F word is too.",
                    "label": 0
                },
                {
                    "sent": "Rather than make this instrument hard, and as we are is it is we are familiar with and making more flexible and even wearable, so it's closer to your body system and for example here, like in this case a light emitting diode, an miniaturizing liar and making on the various very thin substrate and putting on their flexible polymeric substrate that you can place.",
                    "label": 0
                },
                {
                    "sent": "On your wearable devices where you're directly on your skin, this will serve as a sensor.",
                    "label": 0
                },
                {
                    "sent": "For example, sweat sense or insight.",
                    "label": 0
                },
                {
                    "sent": "You collect the sweat and analyze analyzing there, and we so example that it says implanted the superficially and then maybe detect chemicals like a glucose and other physiological status etc.",
                    "label": 0
                },
                {
                    "sent": "An another also very emerging.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hot Topic is called optogenetics.",
                    "label": 0
                },
                {
                    "sent": "This is basically started with an idea that using.",
                    "label": 0
                },
                {
                    "sent": "Intrinsic light sensitive ion channels that's found in Algy and some plants.",
                    "label": 0
                },
                {
                    "sent": "So this ion channel and present in the surface of the cell.",
                    "label": 0
                },
                {
                    "sent": "When you absorb the photon and also conformational changes and open up the gate or close the gates so this is a way to use light too.",
                    "label": 0
                },
                {
                    "sent": "Change the voltage signal so activate the neurons.",
                    "label": 0
                },
                {
                    "sent": "And he activated neurons, where this is a way to modulate nerve signals so.",
                    "label": 0
                },
                {
                    "sent": "That has been very very popular tool because it directly while you're special in the brain research, we're like brain signals, basic electrical signal.",
                    "label": 0
                },
                {
                    "sent": "This is a way to modulate and stimulate and inhibit this brain.",
                    "label": 0
                },
                {
                    "sent": "To better understand how the brain works or even the treat.",
                    "label": 0
                },
                {
                    "sent": "Some of the new regenerated disease.",
                    "label": 0
                },
                {
                    "sent": "And nowadays the concept has been broadened beyond this.",
                    "label": 0
                },
                {
                    "sent": "Now it's like rather than just ion channels, people discovering or engineer or.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You get the very clear signature of the lasing, so this is a.",
                    "label": 0
                },
                {
                    "sent": "This is just demonstration that you can generate lasing from biological tissue in there.",
                    "label": 0
                },
                {
                    "sent": "So sensing and lasing, it's all great and this is one of the other area that's application.",
                    "label": 0
                },
                {
                    "sent": "We are particularly excited about is using beads as a tagging barcoding material, so.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is a spring Gallery mode spectrum of the one bit and if you look at it this you get the free spectral range.",
                    "label": 0
                },
                {
                    "sent": "Again splitting TTM mode, they are all different and this you can analyze.",
                    "label": 0
                },
                {
                    "sent": "This is directly related to the geometrical.",
                    "label": 0
                },
                {
                    "sent": "Optical path length and geometry.",
                    "label": 0
                },
                {
                    "sent": "So by analyzing this curve fitting you can actually very accurately determine the effective diameter of the bead with the precision that's as good as 50 pico meter out of by Micron 10 Micron.",
                    "label": 0
                },
                {
                    "sent": "So imagine you have a lot of bids.",
                    "label": 0
                },
                {
                    "sent": "Anne Anne, by analyzing their whispering Gallery mode the pattern you can determine the diameter if they have all different diameter, can identify individual ones.",
                    "label": 0
                },
                {
                    "sent": "And in fact these are the beads as already inside the cell, which we don't just don't see the cell here.",
                    "label": 0
                },
                {
                    "sent": "So imagine the cells analysis having this speed.",
                    "label": 0
                },
                {
                    "sent": "Normally it's very difficult to all.",
                    "label": 0
                },
                {
                    "sent": "The cells are different.",
                    "label": 0
                },
                {
                    "sent": "They don't have a name tag on there on the earth surface, and this will be a good way to identify them.",
                    "label": 0
                },
                {
                    "sent": "And you can trace them where they go inside a living animal, for example, and that will be a very powerful tool.",
                    "label": 0
                },
                {
                    "sent": "For biological investigations.",
                    "label": 0
                },
                {
                    "sent": "So we're going what we're going.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One Direction that we're interested in here is this.",
                    "label": 0
                },
                {
                    "sent": "This current paradigm.",
                    "label": 0
                },
                {
                    "sent": "Again, there's a laser, and there is a biological sample, or patients.",
                    "label": 0
                },
                {
                    "sent": "And we like to have a new paradigm an an making this laser very, very small, anbia compatible so that you can inject and embed them in public school system.",
                    "label": 0
                },
                {
                    "sent": "So right now we are, we are purchasing it laser as an equipment.",
                    "label": 0
                },
                {
                    "sent": "But in the future if that works well, that will be all supplies.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So imagine now we have a laser inside tissue inside a human patient.",
                    "label": 0
                },
                {
                    "sent": "How do you detect them?",
                    "label": 0
                },
                {
                    "sent": "We want to trace them an follow individual cells.",
                    "label": 0
                },
                {
                    "sent": "So we start to think about that.",
                    "label": 0
                },
                {
                    "sent": "And so imagine here.",
                    "label": 0
                },
                {
                    "sent": "I have a small yellow represent those individual lasers.",
                    "label": 0
                },
                {
                    "sent": "And spread in 3D homogeneously and we use a light focusing objective lens to detect and we scan the beam.",
                    "label": 0
                },
                {
                    "sent": "Hoping to detect one by one so normal case when you just detect fluorescence, the signal intensity is a linear function of the pump intensity.",
                    "label": 0
                },
                {
                    "sent": "Like this, but if you do the signal integrity over depth resolved signal integrity over entire cross section as a function of Z.",
                    "label": 0
                },
                {
                    "sent": "It's flat because here the intensity high at the focus, but you have a less number of probes and here intensity will be lower.",
                    "label": 0
                },
                {
                    "sent": "By spread 'cause it is spread but you have a larger number of particles.",
                    "label": 0
                },
                {
                    "sent": "So if you detect or integrate everything together so you get the flat response in optical microscopy with said there is no optical sectioning effect.",
                    "label": 0
                },
                {
                    "sent": "So This is why you use a normal brightfield microscopy and looking at thick tissue.",
                    "label": 0
                },
                {
                    "sent": "Everything gets blurred because signal from all the depth coming to the detector you just don't resolve.",
                    "label": 0
                },
                {
                    "sent": "So to solve that in intravital microscopy sectioning microscope, people use.",
                    "label": 0
                },
                {
                    "sent": "Nonlinear effects, so here, rather than using one photon, absorption used to photon upstairs, 2 photon microscopy so that your signal for this signal is a quadratic function of intensity, so that you have a more signal at the focus then outside.",
                    "label": 0
                },
                {
                    "sent": "So that allows you to emphasize it and increase the signal only at the focus.",
                    "label": 0
                },
                {
                    "sent": "That's so that we can pick tissue and you get a much clearer for sectional image.",
                    "label": 0
                },
                {
                    "sent": "So now let.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Think about laser.",
                    "label": 0
                },
                {
                    "sent": "This now not spontaneous emission.",
                    "label": 0
                },
                {
                    "sent": "This stimulate emission.",
                    "label": 0
                },
                {
                    "sent": "What would happen?",
                    "label": 0
                },
                {
                    "sent": "They will get the dramatic extreme maybe nonni around this threshold effect lasing threshold.",
                    "label": 0
                },
                {
                    "sent": "So if you look at all mysterial emission you get you generate simulations only at the focal point we're intensities above your threshold, whereas else you don't have any stimuli mission.",
                    "label": 0
                },
                {
                    "sent": "So that first of all you have a very little background, so gives you a very good contrast offer sectioning.",
                    "label": 0
                },
                {
                    "sent": "And also the width of this will be narrower than your diffraction limit.",
                    "label": 0
                },
                {
                    "sent": "So we did a simple experiments to confirm that verify that is resolution enhancement.",
                    "label": 0
                },
                {
                    "sent": "So to do that we use Periscope nanowire very small, about 300 narrow mirror width, and we scanned beam using large beam and scan the beam across this short axis and see how the signal varies.",
                    "label": 0
                },
                {
                    "sent": "So when you look at fluorescence broad, spontaneous fluorescent below threshold or even above threshold we can only focusing.",
                    "label": 0
                },
                {
                    "sent": "This is what you get.",
                    "label": 0
                },
                {
                    "sent": "If abroad awith, which perfectly match the European size, is diffraction limited when you look at the stimuli emission.",
                    "label": 0
                },
                {
                    "sent": "The sharp peak above the broad spontaneous emission spectrum, then you only have a very narrow.",
                    "label": 0
                },
                {
                    "sent": "Much narrower at this point.",
                    "label": 0
                },
                {
                    "sent": "Spread function would be with.",
                    "label": 0
                },
                {
                    "sent": "And here the signal with and you get the signal resolution in management about the effect of four and five and which is there some unique property of using laser as an emerging problem?",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Summary so I. Hopefully that I convinced that showed light is already a useful tool.",
                    "label": 1
                },
                {
                    "sent": "Alot of already penetrate into even biological lab in medical science labs and people use they don't call it photonics, it's taking for granted the use life variety to propose and they use a different lasers and instruments.",
                    "label": 0
                },
                {
                    "sent": "And it's all based on very rich interaction between light and matter, specially biological matter and scaring the whole familiar with absorption for thermal.",
                    "label": 0
                },
                {
                    "sent": "And there is for chemical or biological effects an.",
                    "label": 0
                },
                {
                    "sent": "And the lights like.",
                    "label": 0
                },
                {
                    "sent": "Above everything that we are using an already useful and practical an one thing opportunity there is light is a great tool to connect us to molecular status, individual molecules or even use.",
                    "label": 0
                },
                {
                    "sent": "We can use a light to manipulate the genetic circuits in the cell or the molecular stated.",
                    "label": 1
                },
                {
                    "sent": "And this is a great way to access to biological circuits from outside, noninvasive way.",
                    "label": 0
                },
                {
                    "sent": "So in order to I think in the field.",
                    "label": 0
                },
                {
                    "sent": "It will be growing in that area.",
                    "label": 1
                },
                {
                    "sent": "To harvest this close connection and rich interactions directly into the biological circuits, and to do that there will be a more integration of photonics biological system.",
                    "label": 0
                },
                {
                    "sent": "And I will show some of the initial efforts that's being in my made in my lap.",
                    "label": 0
                },
                {
                    "sent": "OK, before I conclude I'd like to show them any result that's obtained by my former and current Members an there are.",
                    "label": 0
                },
                {
                    "sent": "3 plus tax.",
                    "label": 0
                },
                {
                    "sent": "Who came from Europe and already returned to Europe and 1st and then two.",
                    "label": 0
                },
                {
                    "sent": "They both of them got ERCO starting grand and two years ago and the last year and then my third post stuff sitting over there.",
                    "label": 0
                },
                {
                    "sent": "I hope that he can continue the tradition.",
                    "label": 0
                },
                {
                    "sent": "So with that, thank you for your attention.",
                    "label": 0
                }
            ]
        }
    }
}