{
    "id": "655ooqrmtgc7mohtkpolfsqgbolgux7i",
    "title": "Relational Topographic Maps",
    "info": {
        "author": [
            "Alexander Hasenfuss, Department of Informatics, Clausthal University of Technology"
        ],
        "published": "Oct. 8, 2007",
        "recorded": "September 2007",
        "category": [
            "Top->Computer Science->Machine Learning->Neural Networks"
        ]
    },
    "url": "http://videolectures.net/ida07_hasenfuss_rtm/",
    "segmentation": [
        [
            "Yeah, my topic is relational Topa graphic Maps."
        ],
        [
            "The first outline of my talk and 1st.",
            "Thank you something about Truetype based methods and you may be familiar with then present.",
            "Just short K means newer gas and self organizing Maps, then Molly focus on proximity data and present the idea of some medium based methods and first of all is in new approach the relational approach and done some experiments so."
        ],
        [
            "First of all, true threat based methods.",
            "We introduce troops and tape prototypes per class, and now we assume we have Euclidean space.",
            "So I'm given some data vectors from you space.",
            "We introduce some prototypes, each with a class label, and every prototypes determines its receptive field and this is the data points that I need to choose corresponding prototype and.",
            "Yeah.",
            "The assign the class label to the data.",
            "And we can measure this kind of.",
            "Clustering without labels and with Winner takes all functions is defined.",
            "It's one if data point.",
            "If the prototype is the winner for the data point.",
            "And you can see in textbooks that one measurement is a quantization error.",
            "It's some obscure detik distance to the corresponding prototype.",
            "Present each field so this idea of prototype."
        ],
        [
            "Methods.",
            "One method that directly optimizes these quantization as a famous K means clustering method.",
            "The points are given the initialized prototypes randomly.",
            "Determine the receptive fields and move the prototypes to the corresponding center of gravity of this field.",
            "And then repeat until in convergence.",
            "One drawback is that this algorithm is very sensitive to introduction initialization.",
            "It gets easily stuck in local Optima.",
            "And one message to overcome.",
            "This problem is a newer gas method."
        ],
        [
            "I will show you know and same task given a data vectors from or miss based distributed according to an underlying probability density function and now go on and find some prototypes that represent the data data is given.",
            "We initialize the prototypes run only.",
            "Now we present.",
            "This time we show you the online version.",
            "We present the sample data data vector determines the rings.",
            "Also, distances to this data point and now in we scale the vectors.",
            "According to the ranks and with help of current neighborhood size will come to this later and move the prototypes to into the direction.",
            "And now we repeat presenting another sample.",
            "Important part to see neighborhood size.",
            "Overcome this problem of the local Optima, we first use a very large neighborhood size and then enabled size is large and there's almost one global Optima.",
            "It's parabolic.",
            "This underlying cost function and later on we small enabled size and.",
            "We hope that the local Optima come up will slowly so that we come over.",
            "And new gas works very good method.",
            "And just to mention, because we will rely the next algorithms on it, there's a fast Patch alternative where.",
            "That's fine at data set given in advance.",
            "You can perform these steps.",
            "Alternately optimize location support types, and then the ranks in hidden violence.",
            "So just to mention that the self organizing map is almost the same, but the ranks are not determined in data space like here, but you have fixed grid structure value.",
            "Determines the distances.",
            "Every prototype has some corresponding element in this grid."
        ],
        [
            "Well, for now I was talking about clearing data.",
            "Now remove two more general proximity data."
        ],
        [
            "Then there's only powers distances given.",
            "We know nothing about underlying room space.",
            "This data set must not embedded in Euclidean vector space.",
            "The prototype locations there cannot be chosen in between data points because cause.",
            "Must not be continuous.",
            "And one way to deal with this situation is to locate munes at data point positions.",
            "So to say, data points represent the new ones.",
            "Here shortly situation.",
            "Before Noon's are within data points, now we take data points through present.",
            "See data points around let's prototypes.",
            "This is a work presented in 2006.",
            "And it's based on the so-called generalized median.",
            "Says the next data point at a potential location you make small errors that cause you cannot set it on the optimal position because maybe there is no data point in space, but it looks very fine."
        ],
        [
            "OK, come to the relational approach.",
            "Optimal data points in this proximity data set could be set in between, so now."
        ],
        [
            "Pearson approach how to do it and given up Everest squared data distances as metrics you don't know about the underlying data points.",
            "And now resume that prototypes are fast as convex combinations of.",
            "And now this.",
            "The prototypes are convex formulations of these data points.",
            "We don't know nothing about where it's convex sums up to one this Alpha.",
            "Now can be shown that another restriction that this.",
            "Vector points can be embedded in some potentially high dimensional Euclidean space, or it should be an L. The font is not on there, so it's L2 and now it can be shown that we can represent the distances between data points and prototypes.",
            "Can represent this is term and you can see in this term there's nothing about these data points, it's only.",
            "Expressed with distances and this Alpha.",
            "So we go can take these old methods.",
            "This median this batch new gas batch norm and plug in this new term where in the old method is the Euclidean one?",
            "And can derive new update rewards and end up with the relational new gas.",
            "Some K means methods.",
            "And canal.",
            "Small continuous shift around these prototypes."
        ],
        [
            "Yeah, it's short in shortest algorithm in the first step we calculate these distances with this expression.",
            "Then we determine the ranks of the prototypes with those distances and then update this Alpha.",
            "And this term is in new gas.",
            "You plug in these exponential curve.",
            "And this yeah.",
            "And then you normalize these values and continue.",
            "Until convergence can be proven.",
            "And one nice feature, and that we've shown is that this algorithm does not only convert for this data set that.",
            "Can be embedded in higher dimensional Euclidean space.",
            "It also converges for every symmetric nonsingular matrix D. What might be helpful?",
            "One drawback is that the complexities convert quadratic in the number of data points, so here's the.",
            "Well, we have to do something."
        ],
        [
            "And."
        ],
        [
            "I will show you some experience.",
            "First of all we used in synthetic and data set to 150 points and just to show you.",
            "The performance is Euclidean data space.",
            "Will we expect to fall asleep prototypes of the relational method to be on the same spot as the written in your gas one?",
            "And you can see this as the blue and you can see the red one 'cause it's on the same spot and a little bit of ours is green ones.",
            "Is the median approach 'cause it's not all this on can't set prototypes in between the data set, so it's.",
            "Slightly different.",
            "You can see you can see this convergence.",
            "See, that's the quantization error."
        ],
        [
            "Next one in the Trident on protein classification.",
            "That's a data set from Memphis and at all in the system alignment distance.",
            "So there's no Euclidean space.",
            "It's distance metrics is given its stamps from you related in some evolutionary distance of globin proteins.",
            "Used 45 new ones.",
            "It's chosen by heart.",
            "Restaurants in this way and thermal cross validation average over 100 runs and you can see compared to the old methods, the median K means or median energy.",
            "This relational is far better in performance.",
            "Is the performance on the test set classification performance and those overseas supervised ones.",
            "Meanwhile, we also introduced some supervised violence, so I've shown them here."
        ],
        [
            "You can also use it on self organizing Maps, so here's some picture of relational hyperbolic self organizing map on the same data set, and you can see clearly these clusters of this data set, and there's also an model measure scaling of this relation in your gas.",
            "We worked together with some biologists and from a plant.",
            "It's a plant Research Institute and they laughed these pictures.",
            "They can see clearly.",
            "See some classes.",
            "So we did these pictures."
        ],
        [
            "Another one to see Copenhagen troubles on database and it's a big one.",
            "Also in a long distance.",
            "Also here you can see a better performance."
        ],
        [
            "And this one is interesting 'cause this CAT Cortex data set is 1 metric so.",
            "Fun point of theory.",
            "There are some negative values.",
            "Do the runtime also algorithm and you have to cover some.",
            "But we found out that it runs pretty well.",
            "Does not didn't.",
            "Made us any problems and with very good performance and that's one another point to investigate.",
            "How to extend this principle on datasets that are not embeddable into Euclidean spaces?"
        ],
        [
            "Well, to summarize, Mom before Moses million bats new gas and so on for the similarity data, much prototype locations will restricted to data points.",
            "Re introduce this concept, prototypes are linear combinations of data points and this unknown distances to prototypes can be expressed by giving the sensors only by giving distances.",
            "And based on this idea on the idea of vaginal gas and so on, we graph update roots and demonstrated the method in experiments while working progress.",
            "Is this work on the computational complexity?",
            "It's correct, so quadratic, so it's not so nice and there are some new ideas and we'll work on that.",
            "And of course we only did that supervised violence.",
            "Yeah, thank you very much.",
            "M it's.",
            "Really, by random initialized you put em like to do a newer gas.",
            "You put them into data space, so so to say.",
            "And then starts a message 'cause it's not so sensitive against this pre initialization it's no problem.",
            "Because of this night neighborhood.",
            "Slowly.",
            "See.",
            "Yeah.",
            "Personalized the game means was.",
            "I think we spread it over the data space in some way.",
            "Yeah.",
            "Not not sophisticated on because we did several runs with cross validation, so I think.",
            "You could do better with K means with help of some intelligent pre initialization, but you can also take.",
            "You'll guess it's not that much slower and.",
            "Yeah.",
            "This talk is awesome advertisement for new Gassen compared to K means because it's I think it's much nicer.",
            "Slow.",
            "No, not that much.",
            "New gas is quite fast.",
            "This is just to show you have to rank, but.",
            "Question.",
            "Suggest that you might do it in the kernel Frankenstein.",
            "Sorry.",
            "Might do this in a kernel Vine features, but I don't know if.",
            "It's yes, yes, awesome, kernelized volunteer.",
            "You can take this kernel, it's I'm not so much from this kernelized sites, or my bosses more.",
            "But.",
            "We could also plug in and Colonel in positive in it metrics, gram metrics, and work with this one would be different.",
            "Normally stay in front of Colonel.",
            "Because he would be genuinely finding prototype in the feature space.",
            "Rather, you know in in some yeah sure sure yeah yeah.",
            "Yeah.",
            "Typical question is where do you get the number of clusters from?",
            "Do you assume they have given us later on?",
            "Well.",
            "For this experiment will be true some format and yeah, sure, it's always the same question how many prototypes?",
            "At least you can do the following.",
            "You take some more.",
            "Try it and you will see what happens.",
            "Well, reinvents.",
            "His methods were not the ones that use on the practice.",
            "So yeah, maybe we have to sync over with what to do with the practitioners there.",
            "Got some.",
            "As exam much, there are many approaches in thinking about this problem, but we are not dealing with it.",
            "Or sometimes had to do with some outliers which maybe already you too, of course, yeah.",
            "Sure, it's all this depends on what do you want to get, yeah?",
            "All lessons are good topic 'cause it's also possible to do some magnification control here in this method to new gas methods.",
            "That's some other points at some progress to extend it on this relation with purchase so that you are able to.",
            "Taking the influence on the distribution of these prototypes in the space to shift it more to the outlines.",
            "Sure, it needs one more prototypes.",
            "It's a hard question.",
            "2.",
            "No more questions where exactly on time.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, my topic is relational Topa graphic Maps.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The first outline of my talk and 1st.",
                    "label": 0
                },
                {
                    "sent": "Thank you something about Truetype based methods and you may be familiar with then present.",
                    "label": 0
                },
                {
                    "sent": "Just short K means newer gas and self organizing Maps, then Molly focus on proximity data and present the idea of some medium based methods and first of all is in new approach the relational approach and done some experiments so.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First of all, true threat based methods.",
                    "label": 0
                },
                {
                    "sent": "We introduce troops and tape prototypes per class, and now we assume we have Euclidean space.",
                    "label": 0
                },
                {
                    "sent": "So I'm given some data vectors from you space.",
                    "label": 1
                },
                {
                    "sent": "We introduce some prototypes, each with a class label, and every prototypes determines its receptive field and this is the data points that I need to choose corresponding prototype and.",
                    "label": 1
                },
                {
                    "sent": "Yeah.",
                    "label": 1
                },
                {
                    "sent": "The assign the class label to the data.",
                    "label": 0
                },
                {
                    "sent": "And we can measure this kind of.",
                    "label": 0
                },
                {
                    "sent": "Clustering without labels and with Winner takes all functions is defined.",
                    "label": 1
                },
                {
                    "sent": "It's one if data point.",
                    "label": 0
                },
                {
                    "sent": "If the prototype is the winner for the data point.",
                    "label": 0
                },
                {
                    "sent": "And you can see in textbooks that one measurement is a quantization error.",
                    "label": 0
                },
                {
                    "sent": "It's some obscure detik distance to the corresponding prototype.",
                    "label": 0
                },
                {
                    "sent": "Present each field so this idea of prototype.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Methods.",
                    "label": 0
                },
                {
                    "sent": "One method that directly optimizes these quantization as a famous K means clustering method.",
                    "label": 0
                },
                {
                    "sent": "The points are given the initialized prototypes randomly.",
                    "label": 0
                },
                {
                    "sent": "Determine the receptive fields and move the prototypes to the corresponding center of gravity of this field.",
                    "label": 1
                },
                {
                    "sent": "And then repeat until in convergence.",
                    "label": 0
                },
                {
                    "sent": "One drawback is that this algorithm is very sensitive to introduction initialization.",
                    "label": 1
                },
                {
                    "sent": "It gets easily stuck in local Optima.",
                    "label": 0
                },
                {
                    "sent": "And one message to overcome.",
                    "label": 0
                },
                {
                    "sent": "This problem is a newer gas method.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I will show you know and same task given a data vectors from or miss based distributed according to an underlying probability density function and now go on and find some prototypes that represent the data data is given.",
                    "label": 1
                },
                {
                    "sent": "We initialize the prototypes run only.",
                    "label": 0
                },
                {
                    "sent": "Now we present.",
                    "label": 0
                },
                {
                    "sent": "This time we show you the online version.",
                    "label": 1
                },
                {
                    "sent": "We present the sample data data vector determines the rings.",
                    "label": 0
                },
                {
                    "sent": "Also, distances to this data point and now in we scale the vectors.",
                    "label": 0
                },
                {
                    "sent": "According to the ranks and with help of current neighborhood size will come to this later and move the prototypes to into the direction.",
                    "label": 0
                },
                {
                    "sent": "And now we repeat presenting another sample.",
                    "label": 0
                },
                {
                    "sent": "Important part to see neighborhood size.",
                    "label": 0
                },
                {
                    "sent": "Overcome this problem of the local Optima, we first use a very large neighborhood size and then enabled size is large and there's almost one global Optima.",
                    "label": 0
                },
                {
                    "sent": "It's parabolic.",
                    "label": 0
                },
                {
                    "sent": "This underlying cost function and later on we small enabled size and.",
                    "label": 0
                },
                {
                    "sent": "We hope that the local Optima come up will slowly so that we come over.",
                    "label": 1
                },
                {
                    "sent": "And new gas works very good method.",
                    "label": 0
                },
                {
                    "sent": "And just to mention, because we will rely the next algorithms on it, there's a fast Patch alternative where.",
                    "label": 0
                },
                {
                    "sent": "That's fine at data set given in advance.",
                    "label": 0
                },
                {
                    "sent": "You can perform these steps.",
                    "label": 0
                },
                {
                    "sent": "Alternately optimize location support types, and then the ranks in hidden violence.",
                    "label": 0
                },
                {
                    "sent": "So just to mention that the self organizing map is almost the same, but the ranks are not determined in data space like here, but you have fixed grid structure value.",
                    "label": 1
                },
                {
                    "sent": "Determines the distances.",
                    "label": 0
                },
                {
                    "sent": "Every prototype has some corresponding element in this grid.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, for now I was talking about clearing data.",
                    "label": 0
                },
                {
                    "sent": "Now remove two more general proximity data.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then there's only powers distances given.",
                    "label": 0
                },
                {
                    "sent": "We know nothing about underlying room space.",
                    "label": 0
                },
                {
                    "sent": "This data set must not embedded in Euclidean vector space.",
                    "label": 1
                },
                {
                    "sent": "The prototype locations there cannot be chosen in between data points because cause.",
                    "label": 1
                },
                {
                    "sent": "Must not be continuous.",
                    "label": 0
                },
                {
                    "sent": "And one way to deal with this situation is to locate munes at data point positions.",
                    "label": 0
                },
                {
                    "sent": "So to say, data points represent the new ones.",
                    "label": 0
                },
                {
                    "sent": "Here shortly situation.",
                    "label": 0
                },
                {
                    "sent": "Before Noon's are within data points, now we take data points through present.",
                    "label": 0
                },
                {
                    "sent": "See data points around let's prototypes.",
                    "label": 0
                },
                {
                    "sent": "This is a work presented in 2006.",
                    "label": 0
                },
                {
                    "sent": "And it's based on the so-called generalized median.",
                    "label": 0
                },
                {
                    "sent": "Says the next data point at a potential location you make small errors that cause you cannot set it on the optimal position because maybe there is no data point in space, but it looks very fine.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, come to the relational approach.",
                    "label": 0
                },
                {
                    "sent": "Optimal data points in this proximity data set could be set in between, so now.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Pearson approach how to do it and given up Everest squared data distances as metrics you don't know about the underlying data points.",
                    "label": 0
                },
                {
                    "sent": "And now resume that prototypes are fast as convex combinations of.",
                    "label": 1
                },
                {
                    "sent": "And now this.",
                    "label": 0
                },
                {
                    "sent": "The prototypes are convex formulations of these data points.",
                    "label": 0
                },
                {
                    "sent": "We don't know nothing about where it's convex sums up to one this Alpha.",
                    "label": 0
                },
                {
                    "sent": "Now can be shown that another restriction that this.",
                    "label": 1
                },
                {
                    "sent": "Vector points can be embedded in some potentially high dimensional Euclidean space, or it should be an L. The font is not on there, so it's L2 and now it can be shown that we can represent the distances between data points and prototypes.",
                    "label": 0
                },
                {
                    "sent": "Can represent this is term and you can see in this term there's nothing about these data points, it's only.",
                    "label": 0
                },
                {
                    "sent": "Expressed with distances and this Alpha.",
                    "label": 0
                },
                {
                    "sent": "So we go can take these old methods.",
                    "label": 1
                },
                {
                    "sent": "This median this batch new gas batch norm and plug in this new term where in the old method is the Euclidean one?",
                    "label": 0
                },
                {
                    "sent": "And can derive new update rewards and end up with the relational new gas.",
                    "label": 0
                },
                {
                    "sent": "Some K means methods.",
                    "label": 0
                },
                {
                    "sent": "And canal.",
                    "label": 0
                },
                {
                    "sent": "Small continuous shift around these prototypes.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, it's short in shortest algorithm in the first step we calculate these distances with this expression.",
                    "label": 0
                },
                {
                    "sent": "Then we determine the ranks of the prototypes with those distances and then update this Alpha.",
                    "label": 0
                },
                {
                    "sent": "And this term is in new gas.",
                    "label": 0
                },
                {
                    "sent": "You plug in these exponential curve.",
                    "label": 0
                },
                {
                    "sent": "And this yeah.",
                    "label": 0
                },
                {
                    "sent": "And then you normalize these values and continue.",
                    "label": 0
                },
                {
                    "sent": "Until convergence can be proven.",
                    "label": 0
                },
                {
                    "sent": "And one nice feature, and that we've shown is that this algorithm does not only convert for this data set that.",
                    "label": 0
                },
                {
                    "sent": "Can be embedded in higher dimensional Euclidean space.",
                    "label": 0
                },
                {
                    "sent": "It also converges for every symmetric nonsingular matrix D. What might be helpful?",
                    "label": 1
                },
                {
                    "sent": "One drawback is that the complexities convert quadratic in the number of data points, so here's the.",
                    "label": 0
                },
                {
                    "sent": "Well, we have to do something.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will show you some experience.",
                    "label": 0
                },
                {
                    "sent": "First of all we used in synthetic and data set to 150 points and just to show you.",
                    "label": 0
                },
                {
                    "sent": "The performance is Euclidean data space.",
                    "label": 0
                },
                {
                    "sent": "Will we expect to fall asleep prototypes of the relational method to be on the same spot as the written in your gas one?",
                    "label": 0
                },
                {
                    "sent": "And you can see this as the blue and you can see the red one 'cause it's on the same spot and a little bit of ours is green ones.",
                    "label": 0
                },
                {
                    "sent": "Is the median approach 'cause it's not all this on can't set prototypes in between the data set, so it's.",
                    "label": 0
                },
                {
                    "sent": "Slightly different.",
                    "label": 0
                },
                {
                    "sent": "You can see you can see this convergence.",
                    "label": 0
                },
                {
                    "sent": "See, that's the quantization error.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Next one in the Trident on protein classification.",
                    "label": 1
                },
                {
                    "sent": "That's a data set from Memphis and at all in the system alignment distance.",
                    "label": 0
                },
                {
                    "sent": "So there's no Euclidean space.",
                    "label": 0
                },
                {
                    "sent": "It's distance metrics is given its stamps from you related in some evolutionary distance of globin proteins.",
                    "label": 1
                },
                {
                    "sent": "Used 45 new ones.",
                    "label": 0
                },
                {
                    "sent": "It's chosen by heart.",
                    "label": 1
                },
                {
                    "sent": "Restaurants in this way and thermal cross validation average over 100 runs and you can see compared to the old methods, the median K means or median energy.",
                    "label": 0
                },
                {
                    "sent": "This relational is far better in performance.",
                    "label": 0
                },
                {
                    "sent": "Is the performance on the test set classification performance and those overseas supervised ones.",
                    "label": 0
                },
                {
                    "sent": "Meanwhile, we also introduced some supervised violence, so I've shown them here.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can also use it on self organizing Maps, so here's some picture of relational hyperbolic self organizing map on the same data set, and you can see clearly these clusters of this data set, and there's also an model measure scaling of this relation in your gas.",
                    "label": 0
                },
                {
                    "sent": "We worked together with some biologists and from a plant.",
                    "label": 0
                },
                {
                    "sent": "It's a plant Research Institute and they laughed these pictures.",
                    "label": 0
                },
                {
                    "sent": "They can see clearly.",
                    "label": 0
                },
                {
                    "sent": "See some classes.",
                    "label": 0
                },
                {
                    "sent": "So we did these pictures.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another one to see Copenhagen troubles on database and it's a big one.",
                    "label": 0
                },
                {
                    "sent": "Also in a long distance.",
                    "label": 0
                },
                {
                    "sent": "Also here you can see a better performance.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this one is interesting 'cause this CAT Cortex data set is 1 metric so.",
                    "label": 0
                },
                {
                    "sent": "Fun point of theory.",
                    "label": 0
                },
                {
                    "sent": "There are some negative values.",
                    "label": 0
                },
                {
                    "sent": "Do the runtime also algorithm and you have to cover some.",
                    "label": 0
                },
                {
                    "sent": "But we found out that it runs pretty well.",
                    "label": 0
                },
                {
                    "sent": "Does not didn't.",
                    "label": 0
                },
                {
                    "sent": "Made us any problems and with very good performance and that's one another point to investigate.",
                    "label": 0
                },
                {
                    "sent": "How to extend this principle on datasets that are not embeddable into Euclidean spaces?",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, to summarize, Mom before Moses million bats new gas and so on for the similarity data, much prototype locations will restricted to data points.",
                    "label": 1
                },
                {
                    "sent": "Re introduce this concept, prototypes are linear combinations of data points and this unknown distances to prototypes can be expressed by giving the sensors only by giving distances.",
                    "label": 1
                },
                {
                    "sent": "And based on this idea on the idea of vaginal gas and so on, we graph update roots and demonstrated the method in experiments while working progress.",
                    "label": 0
                },
                {
                    "sent": "Is this work on the computational complexity?",
                    "label": 1
                },
                {
                    "sent": "It's correct, so quadratic, so it's not so nice and there are some new ideas and we'll work on that.",
                    "label": 0
                },
                {
                    "sent": "And of course we only did that supervised violence.",
                    "label": 0
                },
                {
                    "sent": "Yeah, thank you very much.",
                    "label": 0
                },
                {
                    "sent": "M it's.",
                    "label": 0
                },
                {
                    "sent": "Really, by random initialized you put em like to do a newer gas.",
                    "label": 0
                },
                {
                    "sent": "You put them into data space, so so to say.",
                    "label": 0
                },
                {
                    "sent": "And then starts a message 'cause it's not so sensitive against this pre initialization it's no problem.",
                    "label": 0
                },
                {
                    "sent": "Because of this night neighborhood.",
                    "label": 0
                },
                {
                    "sent": "Slowly.",
                    "label": 0
                },
                {
                    "sent": "See.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Personalized the game means was.",
                    "label": 0
                },
                {
                    "sent": "I think we spread it over the data space in some way.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Not not sophisticated on because we did several runs with cross validation, so I think.",
                    "label": 0
                },
                {
                    "sent": "You could do better with K means with help of some intelligent pre initialization, but you can also take.",
                    "label": 0
                },
                {
                    "sent": "You'll guess it's not that much slower and.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "This talk is awesome advertisement for new Gassen compared to K means because it's I think it's much nicer.",
                    "label": 0
                },
                {
                    "sent": "Slow.",
                    "label": 0
                },
                {
                    "sent": "No, not that much.",
                    "label": 0
                },
                {
                    "sent": "New gas is quite fast.",
                    "label": 0
                },
                {
                    "sent": "This is just to show you have to rank, but.",
                    "label": 0
                },
                {
                    "sent": "Question.",
                    "label": 0
                },
                {
                    "sent": "Suggest that you might do it in the kernel Frankenstein.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "Might do this in a kernel Vine features, but I don't know if.",
                    "label": 0
                },
                {
                    "sent": "It's yes, yes, awesome, kernelized volunteer.",
                    "label": 0
                },
                {
                    "sent": "You can take this kernel, it's I'm not so much from this kernelized sites, or my bosses more.",
                    "label": 0
                },
                {
                    "sent": "But.",
                    "label": 0
                },
                {
                    "sent": "We could also plug in and Colonel in positive in it metrics, gram metrics, and work with this one would be different.",
                    "label": 0
                },
                {
                    "sent": "Normally stay in front of Colonel.",
                    "label": 0
                },
                {
                    "sent": "Because he would be genuinely finding prototype in the feature space.",
                    "label": 0
                },
                {
                    "sent": "Rather, you know in in some yeah sure sure yeah yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Typical question is where do you get the number of clusters from?",
                    "label": 0
                },
                {
                    "sent": "Do you assume they have given us later on?",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "For this experiment will be true some format and yeah, sure, it's always the same question how many prototypes?",
                    "label": 0
                },
                {
                    "sent": "At least you can do the following.",
                    "label": 0
                },
                {
                    "sent": "You take some more.",
                    "label": 0
                },
                {
                    "sent": "Try it and you will see what happens.",
                    "label": 0
                },
                {
                    "sent": "Well, reinvents.",
                    "label": 0
                },
                {
                    "sent": "His methods were not the ones that use on the practice.",
                    "label": 0
                },
                {
                    "sent": "So yeah, maybe we have to sync over with what to do with the practitioners there.",
                    "label": 0
                },
                {
                    "sent": "Got some.",
                    "label": 0
                },
                {
                    "sent": "As exam much, there are many approaches in thinking about this problem, but we are not dealing with it.",
                    "label": 0
                },
                {
                    "sent": "Or sometimes had to do with some outliers which maybe already you too, of course, yeah.",
                    "label": 0
                },
                {
                    "sent": "Sure, it's all this depends on what do you want to get, yeah?",
                    "label": 0
                },
                {
                    "sent": "All lessons are good topic 'cause it's also possible to do some magnification control here in this method to new gas methods.",
                    "label": 0
                },
                {
                    "sent": "That's some other points at some progress to extend it on this relation with purchase so that you are able to.",
                    "label": 0
                },
                {
                    "sent": "Taking the influence on the distribution of these prototypes in the space to shift it more to the outlines.",
                    "label": 0
                },
                {
                    "sent": "Sure, it needs one more prototypes.",
                    "label": 0
                },
                {
                    "sent": "It's a hard question.",
                    "label": 0
                },
                {
                    "sent": "2.",
                    "label": 0
                },
                {
                    "sent": "No more questions where exactly on time.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}