{
    "id": "6a6sstbovmr2rnlvcys4xffvuhtie7x7",
    "title": "Bridging the gap between health care professionals and eHealth industry",
    "info": {
        "author": [
            "Matic Meglič, Institute of Public Health of the Republic of Slovenia"
        ],
        "published": "Feb. 19, 2010",
        "recorded": "January 2010",
        "category": [
            "Top->Medicine->Informatics",
            "Top->Social Sciences->Society->Information Society",
            "Top->Medicine"
        ]
    },
    "url": "http://videolectures.net/seehealth2010_meglic_bgbc/",
    "segmentation": [
        [
            "OK, so now the last speaker of the first session, it's Millage Institute for Public Health.",
            "And the military will present us how to bridge the gap between healthcare professionals and we have industry.",
            "So I look forward for the next 15 minutes.",
            "Admit it's vendors along with your discussion with all three presenters, please.",
            "Thank you blush.",
            "Thanks for inviting me to present at this event.",
            "I'm very pleased to see that there's such a good attendance.",
            "I said I'm I'm coming from that of public health.",
            "I will try to talk about the gap between the health care professionals in the health industry, which I think is quite important in terms of.",
            "Trying to create trying to increase the growth of the health market we all need to be aware of these issues, 'cause they're the ones that are really hampering the the successfulness of health project and I'll try to take you through the journey.",
            "The way I sort of see things and I hope to get some feedback and to maybe.",
            "Sort of sparkle a few sparkles in your heads as well.",
            "Maybe you've you've either heard of these things before and you've definitely come across them, so I'm looking forward to any feedback."
        ],
        [
            "As well.",
            "OK, so about the gap.",
            "Why is it?",
            "Why is it important?",
            "What actually it is and why is it there was what's it cost, and are there any specifics, let's say in the South, Southeast and central central Eastern Europe?",
            "I'll try to talk about this briefly, and then I'll also address a bit the sort of how to reduce the gap.",
            "And I also tried to give some sort of off the record information or or things that I've I've seen in the last years that maybe are a bit more descriptive of the actual things going and taking place instead of the theory."
        ],
        [
            "The all the all the literature that is going to be mentioned.",
            "You can find it on my blog which is a bit little bit dot LY at health.",
            "If you would be interested."
        ],
        [
            "I imagine you've all come across this picture before or if you haven't, it's it's a nice one to understand the general problems that the IT industry is facing with developing new services to various clients.",
            "It's not detailed specific.",
            "But it's something we need to have in mind when moving to EHS."
        ],
        [
            "Field as well.",
            "When we ask ourselves so what's this email gap actually?",
            "Is the way I see it the most simply?",
            "We could say, OK, so there's a gap between the understanding of what the health needs health is and what's it supposed to do between the health industry.",
            "So the providers of the software and the solutions on one hand, and the health care provider providers on the other hand.",
            "So the ones that are actually executing and delivering care.",
            "Is this the only gap in the area?",
            "I don't think so.",
            "Actually I think there's a bit more of them the the two main obvious ones which we've come across is of course.",
            "The gap between the way that the governments easy health under the way the research institution see health and see what the priorities are and what should be developed."
        ],
        [
            "So.",
            "Looking now more specifically into the gap between the healthcare professionals in the healthcare industry, is it any different than the gap in other industries?",
            "Same way as it in other industries.",
            "E Health can be disruptive disruptive, so this brings a whole set of issues and it also.",
            "Email faces the same IT development issues that the projects are facing the same issues as the usual IT development projects like being overtime being over budget, the usual risks and.",
            "That that was being shown just recently is that the project failure rate in E health is about the same or a bit higher than the average failure rate of other IT projects, so it's still in the range of 40 to 60 plus percent.",
            "But now I was sort of thinking then.",
            "OK, so what's?",
            "What's the real difference?",
            "So what's?",
            "What's the real difference in email?",
            "So what's the difference of healthcare professionals versus the other ones?",
            "I said OK, so who?",
            "Who are you dealing with and what is the field that you're working here?",
            "So mostly you're dealing with so the medical field.",
            "Medicine is described spark art, part science, which is kind of a problem for informatics.",
            "And there's a lot of specifics of it of healthcare information like the lack of a certain information can mean more than just not being there.",
            "So an interesting book written by by Berg on the on the specifics gives you a bit a bit of of of insight into why it's so difficult to actually develop to develop solutions for retail.",
            "And why there's always a problem between the health care providers like the doctors saying, yeah, sure, we know we know what we need.",
            "We just need five students or IT students and they'll develop it for us.",
            "And then on the other hand.",
            "There's so many specifics of the IT development, which which they don't actually understand, so there is.",
            "There is a big issue on the on healthcare information, specifically the other one.",
            "The other specific is that you will be mostly dealing from if your industry service your software provider, you will be mostly dealing with medical doctors as your counter counter speaker on the other side, and you know they are or we are a few of the kind.",
            "We are a bit special in good and in positive and negative ways.",
            "There is some always some sort of a tradition, patient relationship, ethics in the background, but often what happens is that there's with the hell.",
            "They are often that the medical doctors often feel in danger, so you're trying to you come to them and trying to sell them.",
            "Decision support systems, risk management, care management systems, and they're saying, OK, so what's my work then?",
            "That's that's what we often hear.",
            "Say we need to be very careful, careful.",
            "Communicating to what's the?",
            "What's their added value and the E health is not trying to eat.",
            "Their added value.",
            "We're not trying to replace them, we're trying to enhance what they're doing, and an interesting observation is that partly in relation to this.",
            "Feeling of endangerment, they actually there's reports on that.",
            "Nearly half of the projects are being obstructed by staff.",
            "So there is.",
            "These are the issues that we need to sort of see when when doing it development and implementation."
        ],
        [
            "Coming back to the importance why is it important?",
            "Well, there's what it causes is there's a huge gap between the plans and the reality of what we plan and try to deliver.",
            "We always say, OK, I will do that next year and then we see that it's so difficult to get the doctors in to communicate to get there together, demands to get to to agree on functionalities, and then they're all out.",
            "So it just takes so much time.",
            "And then there's the huge failure rate.",
            "They're always saying, well, yeah, well, we actually.",
            "This is not actually what we wanted.",
            "So we're not going to use it.",
            "Then there's the low uptake or attrition.",
            "So instead of instead of, well, we always see there's the presentation from from the previous speaker was excellent.",
            "I was really fascinated by it and I'm I see I see things similarly.",
            "There's just a slight problem with coming to to to sort of do the trenches talking to the doctors.",
            "They often don't see the added value in such a way they see their own.",
            "Different problems, and often we're not trying to solve the problem that they see.",
            "I'm going to talk about it a bit later and what it causes is that they don't see that often.",
            "They don't see the perceived value as big as the the the IT provider sees it said this.",
            "This often results in failed business cases."
        ],
        [
            "Preparing for this.",
            "Preparing for this event, I sort of tried to look a bit more into specifics of of South and central Eastern Europe.",
            "Are there any specifics on the gap and there is an interesting research being done and I sort of tried to make a picture of it.",
            "What was the difference?",
            "As well?",
            "Definitely we have lower GDP spending on on health on the on the health as well, so we've got, mostly.",
            "We've got all the infrastructure.",
            "We've got a lot of sort of big, strong, historically driven health care providers like the University medical centers, big big big ones, and often there quite sort of.",
            "Poorly responsive to change and we've got a lot of shielding from operational performance, which is again partly based in the way the Healthcare is organized and financed reimbursed.",
            "So if you, if you're working as a medical doctor in this part of Europe, often in the public sector, your primary concern is not actually efficiency and quality of care, but a whole lot of other different things that you need to sort of think about.",
            "And this is one of the issues and the other one is that there's a.",
            "A lack of focus on on quality and on reporting on the outcome, so there's poor assessment of what's actually going on in healthcare.",
            "And I'm I'm still building on it.",
            "There's a, there's actually.",
            "There's actually a lesson coming out of it, but just wait a bit more so the other one problem which I mentioned is the centralized provider site.",
            "So we've got this huge public providers which are difficult to move.",
            "And also this huge providers are quite hesitant to collaborate with the pub with the industry.",
            "They're saying now the industry is just trying to get money from us where we know what we need best and will try to find our ways to handle these issues."
        ],
        [
            "So the results of it are, so we've got these meetings.",
            "Missing incentives for efficiency we don't have, so the doctors are not sort of motivated to do more to do that in a better way.",
            "And there is quite low transparency because the the Exposition of errors, Medical errors is not that strong as in Western Europe.",
            "And the processes of care are quite less formal, and the notion of, let's say care pathways and care processes is not that strong here.",
            "There's not not that much standardization.",
            "And the of course the usually the overall ebusiness leg, which is also hampering email development.",
            "And all of these results in the.",
            "Lower perceived value of the health.",
            "And resultingly lower willingness to pay for these services.",
            "And then another problem with the industry is facing when coming to South Central Eastern Europe is that the structure of the health needs is quite different than in the Western Europe or in the states.",
            "It's it's like trying to.",
            "Seller and often selling an F1 race car to someone that maybe doesn't actually have tarmac Rd on the way to his home.",
            "So we need to keep in mind that it's often.",
            "Not what we're trying to sort of, not what we have, and we're trying to sell, but it's actually.",
            "The their needs are quite much."
        ],
        [
            "Different than the ones that we expect."
        ],
        [
            "So why bother?",
            "There's some good study being done on on how to accelerate the growth of the health.",
            "It's been published in 207 and I have it here on the right hand side, and while it describes the barriers affecting the development of demand.",
            "And, um, I've underlined the four major issues, and I was kind of missing.",
            "It's it's a great document.",
            "I was kind of maybe missing the the the.",
            "The gap there is some not much talking about this.",
            "The gap and I tried to sort of go through that here as well.",
            "So what can we achieve by reducing the gap?"
        ],
        [
            "By bringing the right industry closer to align these needs and to communicate more what we achieve is the health care providers are much more satisfied, right?",
            "So their willingness to pay and they perceive that value of the health increases.",
            "And because of this because because they feel much closer connected to the industry.",
            "Also the risk reduction in it development and implementation projects reduces.",
            "Because the in the case when when we try to reduce the gap, the healthcare professionals understand the health much better so the so their own incentives in uptake of these solutions increases.",
            "So we have a potential for further market growth.",
            "And then the response of the market is much faster, so if you're trying to bring a new technology and you have if you have a big gap, it will just be impossible to bring it actually to show the added value to the health care providers.",
            "Whereas if you're trying to have this gap smaller by communicating by educating and things, I'll talk about in the next slide, you can actually do this, turn around much faster.",
            "So I'm trying to really summarize in four points on how can we actually try to reduce the gap, and I think that the the four most important ones are one is communication and understanding of the other one, which is.",
            "I mean, it's something we always say, and it's quite difficult to actually put into practice.",
            "But what we need to do is.",
            "We need to find ways of exchanging the needs and between the health care professionals back to the industry and we tried.",
            "We need to share what's available and what the industry can offer back to the health care professional.",
            "So it's a circle of exchange of information that we need to sort of start rotating, and often there's this.",
            "Reception of looking at email from it and Healthcare is quite different, so here there usually there is some use of of people who know both sides.",
            "So if you have a chance finding people who actually are interdisciplinary who understand both sides, that's that's quite a good value.",
            "Another thing that you can do is to create need and creating need is usually by trying to involve healthcare professionals and organizations that are sort of.",
            "Let's say the leaders in the in the health sector and tried then organize events where they can share this good practices.",
            "Try to to open other channels when they can share this experience.",
            "And in terms of business business development, if your industry and approaching the approaching the healthcare sector, this was an excellent example that we've just seen before.",
            "Show specific sort of trying to show specific cases in terms of improvements of outcome, returns of investment, so not just not just saying, well we can do this wonderful things, but actually showing the specific results of a specific implementation that the health care professional or health care organization can actually project themselves to say.",
            "Oh, so they've done it and they've seen such results.",
            "And because I know that we are similar to them or different in these ways, I can actually see how this is going to work in our case.",
            "And it's this is quite important and the other thing which I think it's a good way of trying to reduce the gap is getting the industry involved in research, either through funding or through participating as technology providers.",
            "Because this is the way that you can actually bring both of these two players on the same side, trying to achieve a similar goal.",
            "I'll try to do some try to show."
        ],
        [
            "Examples they're not all good practice, they're just practice.",
            "So we've learned good things, and we've learned we did mistakes and we did good things."
        ],
        [
            "An interesting one was the future.",
            "The Future Health Initiative that we started in 2008 and.",
            "It's been in 2009.",
            "It was nominated for Best Business Idea in in Slovenia.",
            "So then the trick was this is actually trying to implement what I was just talking about.",
            "So how to achieve the market growth on the far right hand?",
            "By trying to circle the circle which is drawn here.",
            "So support investments of the industry into strategic research and development.",
            "Creating new services and then creating the needs for these services in a separate mode.",
            "And it's an interesting model and I think it's it's quite important.",
            "It sort of to keep it complex enough to keep these investments to keep research and development to keep the the education and information exchange in sort of have it under control.",
            "So if your industry it's a good that you actually think of all this."
        ],
        [
            "All these things.",
            "In terms of research, I'll just go briefly on what I think it's sort of shown as good as a good way to focus on.",
            "Try trying to do applicative research 'cause it adds specific values.",
            "Try to do clinical trials because they are the ones that will give you the results.",
            "The measurement that you would be able to show that to the clinicians to the health care providers.",
            "And try to focus on finishing the research with any type of health technology assessment study that will actually give you the numbers.",
            "Again, don't forget on the numbers and.",
            "Again, The thing is not to forget is what the specifics of the local health care system are, so don't forget like.",
            "As we heard before as well, it's it's a different thing.",
            "Trying to implement decision support systems in Slovenia or maybe in Germany because of the.",
            "The whole infrastructure existing, the care, the care pathways, the usage of computers and CHRS by the doctors.",
            "There are so many issues."
        ],
        [
            "And another thing on how to actually cooperate better in it development project is trying to listen more, so address concerns, focus on concerns, address them, do testings on on different sites, different sizes of sites and on different groups of users.",
            "So don't just focus on early adopters, but also of course work with them.",
            "But then think of those who will be actually using the 90% will be actually forced to use it in the end.",
            "And study failures and then again use different contextual settings as well because.",
            "It's.",
            "We've we've seen it often in smaller projects that we've.",
            "We thought it was a wonderful idea, and we thought that the doctors would be so thrilled to have it.",
            "But in the end, while they said, yeah, it's a nice idea, but there's so many other issues that we actually need to solve before then.",
            "Um?"
        ],
        [
            "I'm just coming to the conclusion so.",
            "I just thought so.",
            "This was basically what we almost mostly know.",
            "It's an overview.",
            "I was just trying to ask myself a question is it?",
            "Is it really what we do?",
            "Is it really that we're trying to be so altruistic and doing things by the book?",
            "Well, the truth is, the industry often has existing products that it needs to sell, so it's it's not.",
            "It will be always listening to health care professionals, so we will do what you need.",
            "Now sometimes we say OK, we have this product, how we're going to sell it.",
            "This is what we need.",
            "Will sort of try to squeeze that in and also from the government point of view, government.",
            "Often has its own agenda which is mostly underlined with sort of in line with the health care profession, but not always.",
            "And sometimes even the health care professionals don't always know what they need, especially if we talk about disruptive technologies.",
            "It's it's different difficult to foresee.",
            "And then sometimes the availability of clinicians is also an issue.",
            "This is something that we are facing with the email strategy now."
        ],
        [
            "So to conclude, I would maybe say that what we've learned is to try to plan this gap related resources in advance, so take that into account.",
            "Invest into connecting and exchanging information between the industry and healthcare professionals in structured ways.",
            "Support research and development, and do a combination of push and pull sort of approach to to work with them."
        ],
        [
            "That will be all from my side.",
            "Thank you for your attention.",
            "Thank you, Mr."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so now the last speaker of the first session, it's Millage Institute for Public Health.",
                    "label": 0
                },
                {
                    "sent": "And the military will present us how to bridge the gap between healthcare professionals and we have industry.",
                    "label": 0
                },
                {
                    "sent": "So I look forward for the next 15 minutes.",
                    "label": 0
                },
                {
                    "sent": "Admit it's vendors along with your discussion with all three presenters, please.",
                    "label": 0
                },
                {
                    "sent": "Thank you blush.",
                    "label": 0
                },
                {
                    "sent": "Thanks for inviting me to present at this event.",
                    "label": 0
                },
                {
                    "sent": "I'm very pleased to see that there's such a good attendance.",
                    "label": 0
                },
                {
                    "sent": "I said I'm I'm coming from that of public health.",
                    "label": 0
                },
                {
                    "sent": "I will try to talk about the gap between the health care professionals in the health industry, which I think is quite important in terms of.",
                    "label": 0
                },
                {
                    "sent": "Trying to create trying to increase the growth of the health market we all need to be aware of these issues, 'cause they're the ones that are really hampering the the successfulness of health project and I'll try to take you through the journey.",
                    "label": 0
                },
                {
                    "sent": "The way I sort of see things and I hope to get some feedback and to maybe.",
                    "label": 0
                },
                {
                    "sent": "Sort of sparkle a few sparkles in your heads as well.",
                    "label": 0
                },
                {
                    "sent": "Maybe you've you've either heard of these things before and you've definitely come across them, so I'm looking forward to any feedback.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As well.",
                    "label": 0
                },
                {
                    "sent": "OK, so about the gap.",
                    "label": 1
                },
                {
                    "sent": "Why is it?",
                    "label": 0
                },
                {
                    "sent": "Why is it important?",
                    "label": 0
                },
                {
                    "sent": "What actually it is and why is it there was what's it cost, and are there any specifics, let's say in the South, Southeast and central central Eastern Europe?",
                    "label": 0
                },
                {
                    "sent": "I'll try to talk about this briefly, and then I'll also address a bit the sort of how to reduce the gap.",
                    "label": 1
                },
                {
                    "sent": "And I also tried to give some sort of off the record information or or things that I've I've seen in the last years that maybe are a bit more descriptive of the actual things going and taking place instead of the theory.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The all the all the literature that is going to be mentioned.",
                    "label": 0
                },
                {
                    "sent": "You can find it on my blog which is a bit little bit dot LY at health.",
                    "label": 0
                },
                {
                    "sent": "If you would be interested.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I imagine you've all come across this picture before or if you haven't, it's it's a nice one to understand the general problems that the IT industry is facing with developing new services to various clients.",
                    "label": 0
                },
                {
                    "sent": "It's not detailed specific.",
                    "label": 0
                },
                {
                    "sent": "But it's something we need to have in mind when moving to EHS.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Field as well.",
                    "label": 0
                },
                {
                    "sent": "When we ask ourselves so what's this email gap actually?",
                    "label": 0
                },
                {
                    "sent": "Is the way I see it the most simply?",
                    "label": 0
                },
                {
                    "sent": "We could say, OK, so there's a gap between the understanding of what the health needs health is and what's it supposed to do between the health industry.",
                    "label": 0
                },
                {
                    "sent": "So the providers of the software and the solutions on one hand, and the health care provider providers on the other hand.",
                    "label": 1
                },
                {
                    "sent": "So the ones that are actually executing and delivering care.",
                    "label": 0
                },
                {
                    "sent": "Is this the only gap in the area?",
                    "label": 0
                },
                {
                    "sent": "I don't think so.",
                    "label": 0
                },
                {
                    "sent": "Actually I think there's a bit more of them the the two main obvious ones which we've come across is of course.",
                    "label": 0
                },
                {
                    "sent": "The gap between the way that the governments easy health under the way the research institution see health and see what the priorities are and what should be developed.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Looking now more specifically into the gap between the healthcare professionals in the healthcare industry, is it any different than the gap in other industries?",
                    "label": 0
                },
                {
                    "sent": "Same way as it in other industries.",
                    "label": 0
                },
                {
                    "sent": "E Health can be disruptive disruptive, so this brings a whole set of issues and it also.",
                    "label": 0
                },
                {
                    "sent": "Email faces the same IT development issues that the projects are facing the same issues as the usual IT development projects like being overtime being over budget, the usual risks and.",
                    "label": 0
                },
                {
                    "sent": "That that was being shown just recently is that the project failure rate in E health is about the same or a bit higher than the average failure rate of other IT projects, so it's still in the range of 40 to 60 plus percent.",
                    "label": 0
                },
                {
                    "sent": "But now I was sort of thinking then.",
                    "label": 0
                },
                {
                    "sent": "OK, so what's?",
                    "label": 0
                },
                {
                    "sent": "What's the real difference?",
                    "label": 0
                },
                {
                    "sent": "So what's?",
                    "label": 0
                },
                {
                    "sent": "What's the real difference in email?",
                    "label": 0
                },
                {
                    "sent": "So what's the difference of healthcare professionals versus the other ones?",
                    "label": 0
                },
                {
                    "sent": "I said OK, so who?",
                    "label": 0
                },
                {
                    "sent": "Who are you dealing with and what is the field that you're working here?",
                    "label": 0
                },
                {
                    "sent": "So mostly you're dealing with so the medical field.",
                    "label": 0
                },
                {
                    "sent": "Medicine is described spark art, part science, which is kind of a problem for informatics.",
                    "label": 0
                },
                {
                    "sent": "And there's a lot of specifics of it of healthcare information like the lack of a certain information can mean more than just not being there.",
                    "label": 0
                },
                {
                    "sent": "So an interesting book written by by Berg on the on the specifics gives you a bit a bit of of of insight into why it's so difficult to actually develop to develop solutions for retail.",
                    "label": 0
                },
                {
                    "sent": "And why there's always a problem between the health care providers like the doctors saying, yeah, sure, we know we know what we need.",
                    "label": 0
                },
                {
                    "sent": "We just need five students or IT students and they'll develop it for us.",
                    "label": 0
                },
                {
                    "sent": "And then on the other hand.",
                    "label": 0
                },
                {
                    "sent": "There's so many specifics of the IT development, which which they don't actually understand, so there is.",
                    "label": 0
                },
                {
                    "sent": "There is a big issue on the on healthcare information, specifically the other one.",
                    "label": 0
                },
                {
                    "sent": "The other specific is that you will be mostly dealing from if your industry service your software provider, you will be mostly dealing with medical doctors as your counter counter speaker on the other side, and you know they are or we are a few of the kind.",
                    "label": 0
                },
                {
                    "sent": "We are a bit special in good and in positive and negative ways.",
                    "label": 0
                },
                {
                    "sent": "There is some always some sort of a tradition, patient relationship, ethics in the background, but often what happens is that there's with the hell.",
                    "label": 0
                },
                {
                    "sent": "They are often that the medical doctors often feel in danger, so you're trying to you come to them and trying to sell them.",
                    "label": 0
                },
                {
                    "sent": "Decision support systems, risk management, care management systems, and they're saying, OK, so what's my work then?",
                    "label": 0
                },
                {
                    "sent": "That's that's what we often hear.",
                    "label": 0
                },
                {
                    "sent": "Say we need to be very careful, careful.",
                    "label": 0
                },
                {
                    "sent": "Communicating to what's the?",
                    "label": 0
                },
                {
                    "sent": "What's their added value and the E health is not trying to eat.",
                    "label": 0
                },
                {
                    "sent": "Their added value.",
                    "label": 0
                },
                {
                    "sent": "We're not trying to replace them, we're trying to enhance what they're doing, and an interesting observation is that partly in relation to this.",
                    "label": 0
                },
                {
                    "sent": "Feeling of endangerment, they actually there's reports on that.",
                    "label": 0
                },
                {
                    "sent": "Nearly half of the projects are being obstructed by staff.",
                    "label": 1
                },
                {
                    "sent": "So there is.",
                    "label": 0
                },
                {
                    "sent": "These are the issues that we need to sort of see when when doing it development and implementation.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Coming back to the importance why is it important?",
                    "label": 0
                },
                {
                    "sent": "Well, there's what it causes is there's a huge gap between the plans and the reality of what we plan and try to deliver.",
                    "label": 0
                },
                {
                    "sent": "We always say, OK, I will do that next year and then we see that it's so difficult to get the doctors in to communicate to get there together, demands to get to to agree on functionalities, and then they're all out.",
                    "label": 0
                },
                {
                    "sent": "So it just takes so much time.",
                    "label": 0
                },
                {
                    "sent": "And then there's the huge failure rate.",
                    "label": 0
                },
                {
                    "sent": "They're always saying, well, yeah, well, we actually.",
                    "label": 0
                },
                {
                    "sent": "This is not actually what we wanted.",
                    "label": 0
                },
                {
                    "sent": "So we're not going to use it.",
                    "label": 0
                },
                {
                    "sent": "Then there's the low uptake or attrition.",
                    "label": 0
                },
                {
                    "sent": "So instead of instead of, well, we always see there's the presentation from from the previous speaker was excellent.",
                    "label": 0
                },
                {
                    "sent": "I was really fascinated by it and I'm I see I see things similarly.",
                    "label": 0
                },
                {
                    "sent": "There's just a slight problem with coming to to to sort of do the trenches talking to the doctors.",
                    "label": 0
                },
                {
                    "sent": "They often don't see the added value in such a way they see their own.",
                    "label": 0
                },
                {
                    "sent": "Different problems, and often we're not trying to solve the problem that they see.",
                    "label": 0
                },
                {
                    "sent": "I'm going to talk about it a bit later and what it causes is that they don't see that often.",
                    "label": 0
                },
                {
                    "sent": "They don't see the perceived value as big as the the the IT provider sees it said this.",
                    "label": 0
                },
                {
                    "sent": "This often results in failed business cases.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Preparing for this.",
                    "label": 0
                },
                {
                    "sent": "Preparing for this event, I sort of tried to look a bit more into specifics of of South and central Eastern Europe.",
                    "label": 0
                },
                {
                    "sent": "Are there any specifics on the gap and there is an interesting research being done and I sort of tried to make a picture of it.",
                    "label": 0
                },
                {
                    "sent": "What was the difference?",
                    "label": 0
                },
                {
                    "sent": "As well?",
                    "label": 0
                },
                {
                    "sent": "Definitely we have lower GDP spending on on health on the on the health as well, so we've got, mostly.",
                    "label": 0
                },
                {
                    "sent": "We've got all the infrastructure.",
                    "label": 0
                },
                {
                    "sent": "We've got a lot of sort of big, strong, historically driven health care providers like the University medical centers, big big big ones, and often there quite sort of.",
                    "label": 0
                },
                {
                    "sent": "Poorly responsive to change and we've got a lot of shielding from operational performance, which is again partly based in the way the Healthcare is organized and financed reimbursed.",
                    "label": 1
                },
                {
                    "sent": "So if you, if you're working as a medical doctor in this part of Europe, often in the public sector, your primary concern is not actually efficiency and quality of care, but a whole lot of other different things that you need to sort of think about.",
                    "label": 0
                },
                {
                    "sent": "And this is one of the issues and the other one is that there's a.",
                    "label": 0
                },
                {
                    "sent": "A lack of focus on on quality and on reporting on the outcome, so there's poor assessment of what's actually going on in healthcare.",
                    "label": 0
                },
                {
                    "sent": "And I'm I'm still building on it.",
                    "label": 0
                },
                {
                    "sent": "There's a, there's actually.",
                    "label": 0
                },
                {
                    "sent": "There's actually a lesson coming out of it, but just wait a bit more so the other one problem which I mentioned is the centralized provider site.",
                    "label": 0
                },
                {
                    "sent": "So we've got this huge public providers which are difficult to move.",
                    "label": 0
                },
                {
                    "sent": "And also this huge providers are quite hesitant to collaborate with the pub with the industry.",
                    "label": 0
                },
                {
                    "sent": "They're saying now the industry is just trying to get money from us where we know what we need best and will try to find our ways to handle these issues.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the results of it are, so we've got these meetings.",
                    "label": 0
                },
                {
                    "sent": "Missing incentives for efficiency we don't have, so the doctors are not sort of motivated to do more to do that in a better way.",
                    "label": 1
                },
                {
                    "sent": "And there is quite low transparency because the the Exposition of errors, Medical errors is not that strong as in Western Europe.",
                    "label": 0
                },
                {
                    "sent": "And the processes of care are quite less formal, and the notion of, let's say care pathways and care processes is not that strong here.",
                    "label": 0
                },
                {
                    "sent": "There's not not that much standardization.",
                    "label": 0
                },
                {
                    "sent": "And the of course the usually the overall ebusiness leg, which is also hampering email development.",
                    "label": 0
                },
                {
                    "sent": "And all of these results in the.",
                    "label": 1
                },
                {
                    "sent": "Lower perceived value of the health.",
                    "label": 0
                },
                {
                    "sent": "And resultingly lower willingness to pay for these services.",
                    "label": 0
                },
                {
                    "sent": "And then another problem with the industry is facing when coming to South Central Eastern Europe is that the structure of the health needs is quite different than in the Western Europe or in the states.",
                    "label": 0
                },
                {
                    "sent": "It's it's like trying to.",
                    "label": 0
                },
                {
                    "sent": "Seller and often selling an F1 race car to someone that maybe doesn't actually have tarmac Rd on the way to his home.",
                    "label": 0
                },
                {
                    "sent": "So we need to keep in mind that it's often.",
                    "label": 0
                },
                {
                    "sent": "Not what we're trying to sort of, not what we have, and we're trying to sell, but it's actually.",
                    "label": 0
                },
                {
                    "sent": "The their needs are quite much.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Different than the ones that we expect.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So why bother?",
                    "label": 0
                },
                {
                    "sent": "There's some good study being done on on how to accelerate the growth of the health.",
                    "label": 0
                },
                {
                    "sent": "It's been published in 207 and I have it here on the right hand side, and while it describes the barriers affecting the development of demand.",
                    "label": 0
                },
                {
                    "sent": "And, um, I've underlined the four major issues, and I was kind of missing.",
                    "label": 0
                },
                {
                    "sent": "It's it's a great document.",
                    "label": 0
                },
                {
                    "sent": "I was kind of maybe missing the the the.",
                    "label": 0
                },
                {
                    "sent": "The gap there is some not much talking about this.",
                    "label": 0
                },
                {
                    "sent": "The gap and I tried to sort of go through that here as well.",
                    "label": 0
                },
                {
                    "sent": "So what can we achieve by reducing the gap?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "By bringing the right industry closer to align these needs and to communicate more what we achieve is the health care providers are much more satisfied, right?",
                    "label": 0
                },
                {
                    "sent": "So their willingness to pay and they perceive that value of the health increases.",
                    "label": 0
                },
                {
                    "sent": "And because of this because because they feel much closer connected to the industry.",
                    "label": 0
                },
                {
                    "sent": "Also the risk reduction in it development and implementation projects reduces.",
                    "label": 0
                },
                {
                    "sent": "Because the in the case when when we try to reduce the gap, the healthcare professionals understand the health much better so the so their own incentives in uptake of these solutions increases.",
                    "label": 0
                },
                {
                    "sent": "So we have a potential for further market growth.",
                    "label": 0
                },
                {
                    "sent": "And then the response of the market is much faster, so if you're trying to bring a new technology and you have if you have a big gap, it will just be impossible to bring it actually to show the added value to the health care providers.",
                    "label": 0
                },
                {
                    "sent": "Whereas if you're trying to have this gap smaller by communicating by educating and things, I'll talk about in the next slide, you can actually do this, turn around much faster.",
                    "label": 0
                },
                {
                    "sent": "So I'm trying to really summarize in four points on how can we actually try to reduce the gap, and I think that the the four most important ones are one is communication and understanding of the other one, which is.",
                    "label": 1
                },
                {
                    "sent": "I mean, it's something we always say, and it's quite difficult to actually put into practice.",
                    "label": 0
                },
                {
                    "sent": "But what we need to do is.",
                    "label": 0
                },
                {
                    "sent": "We need to find ways of exchanging the needs and between the health care professionals back to the industry and we tried.",
                    "label": 0
                },
                {
                    "sent": "We need to share what's available and what the industry can offer back to the health care professional.",
                    "label": 0
                },
                {
                    "sent": "So it's a circle of exchange of information that we need to sort of start rotating, and often there's this.",
                    "label": 0
                },
                {
                    "sent": "Reception of looking at email from it and Healthcare is quite different, so here there usually there is some use of of people who know both sides.",
                    "label": 0
                },
                {
                    "sent": "So if you have a chance finding people who actually are interdisciplinary who understand both sides, that's that's quite a good value.",
                    "label": 0
                },
                {
                    "sent": "Another thing that you can do is to create need and creating need is usually by trying to involve healthcare professionals and organizations that are sort of.",
                    "label": 0
                },
                {
                    "sent": "Let's say the leaders in the in the health sector and tried then organize events where they can share this good practices.",
                    "label": 0
                },
                {
                    "sent": "Try to to open other channels when they can share this experience.",
                    "label": 0
                },
                {
                    "sent": "And in terms of business business development, if your industry and approaching the approaching the healthcare sector, this was an excellent example that we've just seen before.",
                    "label": 0
                },
                {
                    "sent": "Show specific sort of trying to show specific cases in terms of improvements of outcome, returns of investment, so not just not just saying, well we can do this wonderful things, but actually showing the specific results of a specific implementation that the health care professional or health care organization can actually project themselves to say.",
                    "label": 0
                },
                {
                    "sent": "Oh, so they've done it and they've seen such results.",
                    "label": 0
                },
                {
                    "sent": "And because I know that we are similar to them or different in these ways, I can actually see how this is going to work in our case.",
                    "label": 0
                },
                {
                    "sent": "And it's this is quite important and the other thing which I think it's a good way of trying to reduce the gap is getting the industry involved in research, either through funding or through participating as technology providers.",
                    "label": 0
                },
                {
                    "sent": "Because this is the way that you can actually bring both of these two players on the same side, trying to achieve a similar goal.",
                    "label": 0
                },
                {
                    "sent": "I'll try to do some try to show.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Examples they're not all good practice, they're just practice.",
                    "label": 0
                },
                {
                    "sent": "So we've learned good things, and we've learned we did mistakes and we did good things.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "An interesting one was the future.",
                    "label": 0
                },
                {
                    "sent": "The Future Health Initiative that we started in 2008 and.",
                    "label": 0
                },
                {
                    "sent": "It's been in 2009.",
                    "label": 0
                },
                {
                    "sent": "It was nominated for Best Business Idea in in Slovenia.",
                    "label": 0
                },
                {
                    "sent": "So then the trick was this is actually trying to implement what I was just talking about.",
                    "label": 0
                },
                {
                    "sent": "So how to achieve the market growth on the far right hand?",
                    "label": 1
                },
                {
                    "sent": "By trying to circle the circle which is drawn here.",
                    "label": 1
                },
                {
                    "sent": "So support investments of the industry into strategic research and development.",
                    "label": 1
                },
                {
                    "sent": "Creating new services and then creating the needs for these services in a separate mode.",
                    "label": 0
                },
                {
                    "sent": "And it's an interesting model and I think it's it's quite important.",
                    "label": 0
                },
                {
                    "sent": "It sort of to keep it complex enough to keep these investments to keep research and development to keep the the education and information exchange in sort of have it under control.",
                    "label": 0
                },
                {
                    "sent": "So if your industry it's a good that you actually think of all this.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "All these things.",
                    "label": 0
                },
                {
                    "sent": "In terms of research, I'll just go briefly on what I think it's sort of shown as good as a good way to focus on.",
                    "label": 0
                },
                {
                    "sent": "Try trying to do applicative research 'cause it adds specific values.",
                    "label": 0
                },
                {
                    "sent": "Try to do clinical trials because they are the ones that will give you the results.",
                    "label": 1
                },
                {
                    "sent": "The measurement that you would be able to show that to the clinicians to the health care providers.",
                    "label": 0
                },
                {
                    "sent": "And try to focus on finishing the research with any type of health technology assessment study that will actually give you the numbers.",
                    "label": 0
                },
                {
                    "sent": "Again, don't forget on the numbers and.",
                    "label": 0
                },
                {
                    "sent": "Again, The thing is not to forget is what the specifics of the local health care system are, so don't forget like.",
                    "label": 1
                },
                {
                    "sent": "As we heard before as well, it's it's a different thing.",
                    "label": 0
                },
                {
                    "sent": "Trying to implement decision support systems in Slovenia or maybe in Germany because of the.",
                    "label": 0
                },
                {
                    "sent": "The whole infrastructure existing, the care, the care pathways, the usage of computers and CHRS by the doctors.",
                    "label": 0
                },
                {
                    "sent": "There are so many issues.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And another thing on how to actually cooperate better in it development project is trying to listen more, so address concerns, focus on concerns, address them, do testings on on different sites, different sizes of sites and on different groups of users.",
                    "label": 0
                },
                {
                    "sent": "So don't just focus on early adopters, but also of course work with them.",
                    "label": 0
                },
                {
                    "sent": "But then think of those who will be actually using the 90% will be actually forced to use it in the end.",
                    "label": 0
                },
                {
                    "sent": "And study failures and then again use different contextual settings as well because.",
                    "label": 0
                },
                {
                    "sent": "It's.",
                    "label": 0
                },
                {
                    "sent": "We've we've seen it often in smaller projects that we've.",
                    "label": 0
                },
                {
                    "sent": "We thought it was a wonderful idea, and we thought that the doctors would be so thrilled to have it.",
                    "label": 0
                },
                {
                    "sent": "But in the end, while they said, yeah, it's a nice idea, but there's so many other issues that we actually need to solve before then.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm just coming to the conclusion so.",
                    "label": 0
                },
                {
                    "sent": "I just thought so.",
                    "label": 0
                },
                {
                    "sent": "This was basically what we almost mostly know.",
                    "label": 0
                },
                {
                    "sent": "It's an overview.",
                    "label": 0
                },
                {
                    "sent": "I was just trying to ask myself a question is it?",
                    "label": 0
                },
                {
                    "sent": "Is it really what we do?",
                    "label": 0
                },
                {
                    "sent": "Is it really that we're trying to be so altruistic and doing things by the book?",
                    "label": 0
                },
                {
                    "sent": "Well, the truth is, the industry often has existing products that it needs to sell, so it's it's not.",
                    "label": 1
                },
                {
                    "sent": "It will be always listening to health care professionals, so we will do what you need.",
                    "label": 0
                },
                {
                    "sent": "Now sometimes we say OK, we have this product, how we're going to sell it.",
                    "label": 0
                },
                {
                    "sent": "This is what we need.",
                    "label": 0
                },
                {
                    "sent": "Will sort of try to squeeze that in and also from the government point of view, government.",
                    "label": 0
                },
                {
                    "sent": "Often has its own agenda which is mostly underlined with sort of in line with the health care profession, but not always.",
                    "label": 0
                },
                {
                    "sent": "And sometimes even the health care professionals don't always know what they need, especially if we talk about disruptive technologies.",
                    "label": 1
                },
                {
                    "sent": "It's it's different difficult to foresee.",
                    "label": 0
                },
                {
                    "sent": "And then sometimes the availability of clinicians is also an issue.",
                    "label": 0
                },
                {
                    "sent": "This is something that we are facing with the email strategy now.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to conclude, I would maybe say that what we've learned is to try to plan this gap related resources in advance, so take that into account.",
                    "label": 1
                },
                {
                    "sent": "Invest into connecting and exchanging information between the industry and healthcare professionals in structured ways.",
                    "label": 0
                },
                {
                    "sent": "Support research and development, and do a combination of push and pull sort of approach to to work with them.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That will be all from my side.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your attention.",
                    "label": 0
                },
                {
                    "sent": "Thank you, Mr.",
                    "label": 0
                }
            ]
        }
    }
}