{
    "id": "6bialsq4k3hnajaqufsuwlvvwldsbwed",
    "title": "Ranking From Pairs and Triplets: Information Quality, Evaluation Methods and Query Complexity",
    "info": {
        "author": [
            "Kira Radinsky, Computer Science Department, Technion - Israel Institute of Technology"
        ],
        "published": "Aug. 9, 2011",
        "recorded": "February 2011",
        "category": [
            "Top->Computer Science->Web Search"
        ]
    },
    "url": "http://videolectures.net/wsdm2011_radinsky_rfp/",
    "segmentation": [
        [
            "Well, everybody, I'm my name is Karen presenting joint work with neural on from technician named ranking from present riblets Information quality Evaluation methods an query complexity."
        ],
        [
            "So what is actually ranking algorithm evaluation?",
            "So we actually want to check whether our ranking ranking algorithm is a good one.",
            "So there are actually two methods to do that.",
            "One is explicit evaluation, one is implicit evaluation, implicit is looking at search engine logs and looking at what people are actually clicking an explicit evolution is what we are dealing here.",
            "Is asking people.",
            "So we usually compare it to people, explicit ranking, whereas them given a search query Anna result what they think is the relevance grade for the result they have and then we somehow compare the results or algorithm.",
            "God, there's a lot of research about.",
            "What are the good metrics of comparison of the algorithm resolved and resolved that the human actually gave us and what we are dealing in this paper is?",
            "How should I actually get the ranking correctly from the user to compare it to our algorithm results?"
        ],
        [
            "So let's just imagine where a human evaluator an doing that, as they usually do in Mechanical Turk for one cent.",
            "So they usually presented with a query with them 2011, then they see a result.",
            "OK, so we see Wisdom 2011, a Google Group.",
            "So what would be a good rank for that?",
            "Give me a number between zero and five.",
            "Not altogether.",
            "OK so OK, I'm going to do it.",
            "For good.",
            "OK, now we're going to look in another one.",
            "OK, web search data mining 2011.",
            "OK oh, that looks like a much better result than previous one, right?",
            "So I'm going to get the."
        ],
        [
            "I've.",
            "OK."
        ],
        [
            "Woman no, not three.",
            "OK, so this is the call for papers.",
            "This was the I was actually looking for.",
            "Oh I can change what I gave before.",
            "OK so this is about 5 as well OK?"
        ],
        [
            "Now we're seeing another result.",
            "OK, now this is the actual site of Wisdom 2011, right?",
            "So, but I don't know it because I see 2009 here.",
            "So I remember the Google groups resolve.",
            "OK, it's probably A3, right?",
            "Then we're usually taking all the results we got from the user."
        ],
        [
            "Sorting them.",
            "Sorting them OK and then we'll compare."
        ],
        [
            "Bring it to the results we got from our algorithm.",
            "Angela metrics we use is average precision disagree in the CG RP MRR.",
            "This is usually not a lot of metrics which I didn't say here."
        ],
        [
            "But we should take a look at what actually happened here.",
            "We're trying to learn the preference of the user based on several samples.",
            "So if we think about it as a machine learning algorithm were given some kind of training examples and then tried to learn an objective function, is preference right?",
            "So how do we train this machine learning algorithm?",
            "We ask users to give individual search results relevance right?",
            "But then all the metrics we use actually use the relative position of all the results.",
            "So we asking the user about single relevance, but then learning his preference."
        ],
        [
            "So this is what we call the information retrieval detour, which is illustrated in errors A&B.",
            "So when asking words again the relevance, then doing some kind of ranking or induced preferences and based on that trying to learn his relevance modeling.",
            "So what would be a good solution to that instead of doing a detour would be regular classification asking user for relevance and then giving us a single result trying to predict this relevance, which is error C, An econometric theorie?",
            "They're also trying to do utility modeling which product you like the best, but the way they do it, they show you several products an ask you which one you like best.",
            "So this is D and what we're trying to do here as well would be actually trying to learn the preference of the user.",
            "Meaning we're going to ask him about his preference and then based on that, infer his actual preference modeling which we call the direct approach."
        ],
        [
            "So this is how the list was approach developed, a term coined by Microsoft Research in Asia.",
            "So usually users are shown now a sets of K results and ask a combinatorial question.",
            "Which one you like the best.",
            "Please bring the results you can see here but OK, let's take a look that's around like 10 results, right?",
            "So asking poor user to rank all the 10 results at once is a bit problematic.",
            "There's a paper in Cigar 2009 which is talking about less is more.",
            "OK, so giving too much results to a user will make him make more mistakes an I don't know.",
            "It doesn't worth my time like for one cent, right?"
        ],
        [
            "So the three questions we ask in our work is, first of all, the information quality of the list waves approach.",
            "No human responses to comparative combinatorial questions of this cave results contain information that actually differ from single relevance.",
            "Meaning, do we actually need information retrieval detour, we're doing now.",
            "Query complexity is a question of OK. We're trying to learn the user preference, right?",
            "So how many training examples do we need?",
            "How many case stats do we need the user to actually rank?",
            "An evaluation based on this case adds were given.",
            "How do we validate whether our algorithm is good enough?"
        ],
        [
            "So we first start with an empirical study of we were taking 50 queries from track and asking around 10 to 30 people for each result.",
            "Well, to give her balance grade so there are two control groups, will call them.",
            "The first one would see only the query and a single result and would be asked to give only relevant result to this one.",
            "Other people were seeing 2 results an giving relevance grading to both of them.",
            "And then we were trying to find out whether the amount of people were giving low results mean like low ranking one, two or three.",
            "Are the same amount in both groups and does it differ statistically?",
            "So we're doing a CMH test for paired testing and repeated tasks.",
            "Because we had like several queries.",
            "So what do you think happened?",
            "Is it the same?",
            "OK, so I'm going to help you.",
            "OK, so the watering pairs, no matter how we did it, both in relevance or in pairs or in preference statistical difference from single to ordering.",
            "So showing only one result and showing 2 results gets like totally different orderings.",
            "So we did two experiments.",
            "The first one would be irrelevant.",
            "Asking users to give 2 numbers and the second one would be asking the users to choose one of them an in both of them it gave different results.",
            "So how do we did it with the Singleton results?",
            "We just sampled pairs and.",
            "And saw which the order was.",
            "So the first conclusion we make here.",
            "Is that extra context actually affects the relevance perception of the user?"
        ],
        [
            "Nastic of experiments was OK. We saw that pairs give different results than showing only a single result, but do we need an extra Contacts?",
            "Maybe triplets is much better.",
            "So again we do the same experiment.",
            "Some users only see 2 results in some C3 and then we ask him again.",
            "Give us let relevance ranking or some groups are asked to do preference ranking me meaning they prefer result 1 result 2 result 3.",
            "And then we test again is the number of people giving the same results in Control Group One is the same one as in Control Group 2.",
            "But here is also very interesting 'cause we're seeds the same.",
            "Meaning you only need to add a little bit of context and then the person can make a good decision.",
            "You don't need to do.",
            "I don't like a set of 10414 or more.",
            "Maybe two is enough."
        ],
        [
            "So we continue checking a lot of work.",
            "Are talking about preference versus relevance, and wanted to check whether there is any difference.",
            "If we ask a person to choose one of them or to give relevance grades to them so well, again, two groups.",
            "One was asked to give preference, meaning result.",
            "One is better than result 2 or opposite an another group was asked to give numbers and then the result was actually that there is no statistically significant difference between the rankings induced by this results.",
            "So it seems that relevant scores, no matter where they are given in preference or relevance, no matter if you ask them to give numbers or to choose one, looks the same.",
            "But"
        ],
        [
            "There's a phenomenon.",
            "Psychological anchoring.",
            "Usually people leave their presented with big numbers like if you take 2 control groups, one control up, you ask how many people are there in China, and then you ask them.",
            "Now give me some number no matter what like.",
            "Anything to do with the first question?",
            "Then you take another groups as as them.",
            "How many fingers do you have?",
            "No, don't tell me and now tell me whichever number you want.",
            "So the first group to China Group will always say like really big numbers and the fingers will always say like little numbers so we're trying to illustrate the same thing here and we were asking presenting users with three results result 1 result 2 and a very relevant result and another group would be presented with result 1, result 2 and an extremely relevant result to the query.",
            "And then we're asking them again.",
            "The same questions give me preference on this triplet, give me relevance on this triplet.",
            "And what we're trying to check that whether the additional context actually affect their relevance or ranking, were giving on the pairs meaning are can we trust pair relevance?",
            "Is it stable enough so the results we got here is the relevance?",
            "An ordering of the pairs remain the same.",
            "However, people were in there seeing very relevant result give much lower grades to result one and result 2.",
            "An if they see an extremely irrelevant one, they're going to give a higher results.",
            "2 result, 1 result 2.",
            "And another interesting result we've seen here that preference resolved would give statistically nonsignificant difference, meaning it was stable enough.",
            "So in this kind of cases, you better ask users for preference."
        ],
        [
            "Another interesting experiment.",
            "Would be to have OK, so it's an experiment actually designed by our really many many years ago.",
            "Users were presented with two options.",
            "Do we want to go to London with breakfast for $1000 or do we want to go to Paris with breakfast?",
            "$1000 so users were divided half and half?",
            "Then another group was presented with the same with the same options at London with breakfast, $1000 Paris with breakfast, $1000, but then they saw another option London without breakfast for $1000 and now all the users will now.",
            "Magically wanting to go to London with breakfast for $1000, so we're trying to do the same here, then another.",
            "Another interesting experiment.",
            "There were asking women, which meant they prefer accounts showing only two pictures, and then they added an extra picture taking one.",
            "Clean Photo shop and then asking which one do you prefer an all women prefer the beautiful version of the men who was made ugly.",
            "OK, so let's see what happens here.",
            "We were taking a result 1 result to an making one of the results ugly, so they were making it ugly.",
            "We're translating it to Italian then back.",
            "OK, this is the best way we could find.",
            "Then you got like it looked like English.",
            "It wasn't the same subject, but again it will OK and it looked quite similar an for one control group were asking and preference and for the other group were asking relevance and hear the results were surprising when are when we were asking user to the relevance judgment.",
            "It didn't change, meaning the ordering of result one and result 2 did not change.",
            "But when we were asking users to make preference, it actually changed.",
            "So sometimes it depends on what you think your results are going to be.",
            "If there you think they're very similar, for example here they're very similar.",
            "There is a small difference between them.",
            "You better ask them for relevance, but if you have like big differences like very good results and really bad results, you should consider asking the user for preferences."
        ],
        [
            "So here I'm coming to talk about query complexity, so usually what people say in most daughter goes in this subject that using pairwise ranking is problematic as you need an square pairs to train your model.",
            "So this is what we want to talk about here an ask.",
            "Do we actually need that?"
        ],
        [
            "Much.",
            "The first thing I'm going to do is a quick reminder.",
            "I'm going to try to make it a bit clearer of what is VC dimension, so let's take a look at a Boolean function group of them.",
            "We call it C and we say a group as shattered by C. If no matter how we label the objects.",
            "C will have a consistent function.",
            "With the labeling, so let's give us an example, so we'll have a patience.",
            "This is our group S and some of the patients are sick and some are not, and the functions in CR blend function saying whether somebody is sick or not.",
            "So no matter how we look at those patients, no matter who is sick or not, we're going to have a function which is consistent with the labeling of the patients.",
            "I'm going to have another example so and the visa dimension is actually the biggest group that you can actually shutter by C, But it functions with C."
        ],
        [
            "So a good example is let's take a look at functions will call it a box and here are elements and no matter how I label that elements, the labeling here is either red or blue.",
            "I will still have a box which inside a box everything will be blue and outside of blocks everything will be read.",
            "So no matter where you put it in space, no matter how you label it, I'm still going to have a function from Box Square which is consistent with the labeling, but I cannot have five points because if you have 5.",
            "Five points, and they're all pluses.",
            "A square has to contain all of them, so if we take a look at.",
            "This plus inside it if we have a labeling giving it the minus will not have a consistent function from Box Square.",
            "OK, so this meaning that our visit dimension is less than five."
        ],
        [
            "OK.",
            "So well, why I was explaining that Visa Dimension is a very nice.",
            "Thing to use when you want to know how many samples you need to get in order to have a small error.",
            "For example in your learner.",
            "So Botnick proved that if you take this dimension of a group in our, in our case the groups are pairs, so this is the patients I had before.",
            "Now the groups pairs.",
            "It should be smaller than long.",
            "The size of the group.",
            "In my case.",
            "Well, what are those functions?",
            "The functions are permutations being in the rankings.",
            "How many of those do you have?",
            "And factorial, so it's an Logan.",
            "So and this is the misconception so."
        ],
        [
            "I'd like to prove that it's not an organics less, and then we're going to show that you need less than an square pairs.",
            "So I'm dividing into two cases.",
            "The first one would be taking a look at a group of pairs.",
            "And let's say that we have an pairs, so if we assume 2 results are inside there, both UV envy.",
            "You are inside a group.",
            "But that cannot be.",
            "But 'cause then I will not have a ranking function which says both result AIDS before result being and result be is before result a so we don't have a consistent function.",
            "So we say as stock cannot be shuttered.",
            "Then this dimension is at most N -- 1."
        ],
        [
            "The second case is, again, I'm assuming a group of pairs size N an.",
            "Now I assume you VNV you cannot be in the same group, so I actually can draw a graph and there is an edge between VNU if V is before you're in our ranking.",
            "However, if we take a closer look, we have end results and and pairs, so we gotta have a circle in our graph, right?",
            "But if you have a circle, means as before BBS before C, but C is before a.",
            "So we can never ever permutation, which is consistent with her.",
            "And again, we say estar cannot be shared and visit the mentions at most N1.",
            "And if you actually want to prove that it's endless one, any spanning tree of this graph is equivalent to the permutation you are looking at."
        ],
        [
            "OK, so last calculations were talking bout diveley.",
            "Actually the valuation method.",
            "So we were looking about the true ranking of the human an they induced one based on the sampling of the pairs.",
            "So if we take a look at the loss function which counts how many pairs were located in correctly.",
            "So this is the L. This is the number which is derived based on but Nicks Thierry.",
            "So if we take only this number of samples, meaning this number of pairs.",
            "Would it be added levely worse than the optimal permutation by epsilon?",
            "And if we take another reason, if you take a look at the Kendall Town distance, it will be at most epsilon from what the user is actually thinking about.",
            "And the last resolve if you the number of pairs we actually need.",
            "OK, based on the options from 2009 is ANSI Square, where C is the number you can use here.",
            "When you would like the elements to be at most distance and divided by C."
        ],
        [
            "So just to conclude, the main ideas of our work as there should be some kind of match between how you feed our ranking evaluator an how you actually evaluate it.",
            "You cannot ask for relevance and then do relative checkins.",
            "Second thing is information quality.",
            "Pairs are enough for ranking.",
            "Ordering for pairs is different from ordering from single tones.",
            "We think that bears are enough because we saw it has the same information as triplets.",
            "Sometimes you should use preference relevance in some and sometimes you need to use relevance.",
            "Revelation is done by only sampling any pairs.",
            "Then you need much less than N square.",
            "You only need and see square."
        ],
        [
            "Anne.",
            "About like future work, we think that you don't have to just randomly sample those pairs an we conjecture about this algorithm, which actually if you see that two pairs are very far from each other, stop sampling from the ends and always try to concentrate on the samples which are not sure about their position.",
            "So by ranking in the middle and then it would be much practical result of N polylog and without this see that's it."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, everybody, I'm my name is Karen presenting joint work with neural on from technician named ranking from present riblets Information quality Evaluation methods an query complexity.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is actually ranking algorithm evaluation?",
                    "label": 0
                },
                {
                    "sent": "So we actually want to check whether our ranking ranking algorithm is a good one.",
                    "label": 1
                },
                {
                    "sent": "So there are actually two methods to do that.",
                    "label": 0
                },
                {
                    "sent": "One is explicit evaluation, one is implicit evaluation, implicit is looking at search engine logs and looking at what people are actually clicking an explicit evolution is what we are dealing here.",
                    "label": 0
                },
                {
                    "sent": "Is asking people.",
                    "label": 0
                },
                {
                    "sent": "So we usually compare it to people, explicit ranking, whereas them given a search query Anna result what they think is the relevance grade for the result they have and then we somehow compare the results or algorithm.",
                    "label": 1
                },
                {
                    "sent": "God, there's a lot of research about.",
                    "label": 1
                },
                {
                    "sent": "What are the good metrics of comparison of the algorithm resolved and resolved that the human actually gave us and what we are dealing in this paper is?",
                    "label": 0
                },
                {
                    "sent": "How should I actually get the ranking correctly from the user to compare it to our algorithm results?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's just imagine where a human evaluator an doing that, as they usually do in Mechanical Turk for one cent.",
                    "label": 0
                },
                {
                    "sent": "So they usually presented with a query with them 2011, then they see a result.",
                    "label": 0
                },
                {
                    "sent": "OK, so we see Wisdom 2011, a Google Group.",
                    "label": 0
                },
                {
                    "sent": "So what would be a good rank for that?",
                    "label": 0
                },
                {
                    "sent": "Give me a number between zero and five.",
                    "label": 0
                },
                {
                    "sent": "Not altogether.",
                    "label": 0
                },
                {
                    "sent": "OK so OK, I'm going to do it.",
                    "label": 0
                },
                {
                    "sent": "For good.",
                    "label": 0
                },
                {
                    "sent": "OK, now we're going to look in another one.",
                    "label": 0
                },
                {
                    "sent": "OK, web search data mining 2011.",
                    "label": 0
                },
                {
                    "sent": "OK oh, that looks like a much better result than previous one, right?",
                    "label": 0
                },
                {
                    "sent": "So I'm going to get the.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I've.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Woman no, not three.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is the call for papers.",
                    "label": 0
                },
                {
                    "sent": "This was the I was actually looking for.",
                    "label": 0
                },
                {
                    "sent": "Oh I can change what I gave before.",
                    "label": 0
                },
                {
                    "sent": "OK so this is about 5 as well OK?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now we're seeing another result.",
                    "label": 0
                },
                {
                    "sent": "OK, now this is the actual site of Wisdom 2011, right?",
                    "label": 0
                },
                {
                    "sent": "So, but I don't know it because I see 2009 here.",
                    "label": 0
                },
                {
                    "sent": "So I remember the Google groups resolve.",
                    "label": 0
                },
                {
                    "sent": "OK, it's probably A3, right?",
                    "label": 0
                },
                {
                    "sent": "Then we're usually taking all the results we got from the user.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sorting them.",
                    "label": 0
                },
                {
                    "sent": "Sorting them OK and then we'll compare.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Bring it to the results we got from our algorithm.",
                    "label": 1
                },
                {
                    "sent": "Angela metrics we use is average precision disagree in the CG RP MRR.",
                    "label": 0
                },
                {
                    "sent": "This is usually not a lot of metrics which I didn't say here.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But we should take a look at what actually happened here.",
                    "label": 0
                },
                {
                    "sent": "We're trying to learn the preference of the user based on several samples.",
                    "label": 1
                },
                {
                    "sent": "So if we think about it as a machine learning algorithm were given some kind of training examples and then tried to learn an objective function, is preference right?",
                    "label": 0
                },
                {
                    "sent": "So how do we train this machine learning algorithm?",
                    "label": 0
                },
                {
                    "sent": "We ask users to give individual search results relevance right?",
                    "label": 1
                },
                {
                    "sent": "But then all the metrics we use actually use the relative position of all the results.",
                    "label": 0
                },
                {
                    "sent": "So we asking the user about single relevance, but then learning his preference.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is what we call the information retrieval detour, which is illustrated in errors A&B.",
                    "label": 1
                },
                {
                    "sent": "So when asking words again the relevance, then doing some kind of ranking or induced preferences and based on that trying to learn his relevance modeling.",
                    "label": 0
                },
                {
                    "sent": "So what would be a good solution to that instead of doing a detour would be regular classification asking user for relevance and then giving us a single result trying to predict this relevance, which is error C, An econometric theorie?",
                    "label": 0
                },
                {
                    "sent": "They're also trying to do utility modeling which product you like the best, but the way they do it, they show you several products an ask you which one you like best.",
                    "label": 0
                },
                {
                    "sent": "So this is D and what we're trying to do here as well would be actually trying to learn the preference of the user.",
                    "label": 0
                },
                {
                    "sent": "Meaning we're going to ask him about his preference and then based on that, infer his actual preference modeling which we call the direct approach.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is how the list was approach developed, a term coined by Microsoft Research in Asia.",
                    "label": 0
                },
                {
                    "sent": "So usually users are shown now a sets of K results and ask a combinatorial question.",
                    "label": 0
                },
                {
                    "sent": "Which one you like the best.",
                    "label": 0
                },
                {
                    "sent": "Please bring the results you can see here but OK, let's take a look that's around like 10 results, right?",
                    "label": 0
                },
                {
                    "sent": "So asking poor user to rank all the 10 results at once is a bit problematic.",
                    "label": 0
                },
                {
                    "sent": "There's a paper in Cigar 2009 which is talking about less is more.",
                    "label": 0
                },
                {
                    "sent": "OK, so giving too much results to a user will make him make more mistakes an I don't know.",
                    "label": 0
                },
                {
                    "sent": "It doesn't worth my time like for one cent, right?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the three questions we ask in our work is, first of all, the information quality of the list waves approach.",
                    "label": 1
                },
                {
                    "sent": "No human responses to comparative combinatorial questions of this cave results contain information that actually differ from single relevance.",
                    "label": 0
                },
                {
                    "sent": "Meaning, do we actually need information retrieval detour, we're doing now.",
                    "label": 0
                },
                {
                    "sent": "Query complexity is a question of OK. We're trying to learn the user preference, right?",
                    "label": 0
                },
                {
                    "sent": "So how many training examples do we need?",
                    "label": 0
                },
                {
                    "sent": "How many case stats do we need the user to actually rank?",
                    "label": 0
                },
                {
                    "sent": "An evaluation based on this case adds were given.",
                    "label": 0
                },
                {
                    "sent": "How do we validate whether our algorithm is good enough?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we first start with an empirical study of we were taking 50 queries from track and asking around 10 to 30 people for each result.",
                    "label": 0
                },
                {
                    "sent": "Well, to give her balance grade so there are two control groups, will call them.",
                    "label": 0
                },
                {
                    "sent": "The first one would see only the query and a single result and would be asked to give only relevant result to this one.",
                    "label": 0
                },
                {
                    "sent": "Other people were seeing 2 results an giving relevance grading to both of them.",
                    "label": 0
                },
                {
                    "sent": "And then we were trying to find out whether the amount of people were giving low results mean like low ranking one, two or three.",
                    "label": 0
                },
                {
                    "sent": "Are the same amount in both groups and does it differ statistically?",
                    "label": 0
                },
                {
                    "sent": "So we're doing a CMH test for paired testing and repeated tasks.",
                    "label": 0
                },
                {
                    "sent": "Because we had like several queries.",
                    "label": 0
                },
                {
                    "sent": "So what do you think happened?",
                    "label": 0
                },
                {
                    "sent": "Is it the same?",
                    "label": 0
                },
                {
                    "sent": "OK, so I'm going to help you.",
                    "label": 0
                },
                {
                    "sent": "OK, so the watering pairs, no matter how we did it, both in relevance or in pairs or in preference statistical difference from single to ordering.",
                    "label": 0
                },
                {
                    "sent": "So showing only one result and showing 2 results gets like totally different orderings.",
                    "label": 0
                },
                {
                    "sent": "So we did two experiments.",
                    "label": 0
                },
                {
                    "sent": "The first one would be irrelevant.",
                    "label": 0
                },
                {
                    "sent": "Asking users to give 2 numbers and the second one would be asking the users to choose one of them an in both of them it gave different results.",
                    "label": 0
                },
                {
                    "sent": "So how do we did it with the Singleton results?",
                    "label": 0
                },
                {
                    "sent": "We just sampled pairs and.",
                    "label": 0
                },
                {
                    "sent": "And saw which the order was.",
                    "label": 0
                },
                {
                    "sent": "So the first conclusion we make here.",
                    "label": 0
                },
                {
                    "sent": "Is that extra context actually affects the relevance perception of the user?",
                    "label": 1
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nastic of experiments was OK. We saw that pairs give different results than showing only a single result, but do we need an extra Contacts?",
                    "label": 0
                },
                {
                    "sent": "Maybe triplets is much better.",
                    "label": 0
                },
                {
                    "sent": "So again we do the same experiment.",
                    "label": 0
                },
                {
                    "sent": "Some users only see 2 results in some C3 and then we ask him again.",
                    "label": 0
                },
                {
                    "sent": "Give us let relevance ranking or some groups are asked to do preference ranking me meaning they prefer result 1 result 2 result 3.",
                    "label": 0
                },
                {
                    "sent": "And then we test again is the number of people giving the same results in Control Group One is the same one as in Control Group 2.",
                    "label": 0
                },
                {
                    "sent": "But here is also very interesting 'cause we're seeds the same.",
                    "label": 0
                },
                {
                    "sent": "Meaning you only need to add a little bit of context and then the person can make a good decision.",
                    "label": 0
                },
                {
                    "sent": "You don't need to do.",
                    "label": 0
                },
                {
                    "sent": "I don't like a set of 10414 or more.",
                    "label": 0
                },
                {
                    "sent": "Maybe two is enough.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we continue checking a lot of work.",
                    "label": 0
                },
                {
                    "sent": "Are talking about preference versus relevance, and wanted to check whether there is any difference.",
                    "label": 0
                },
                {
                    "sent": "If we ask a person to choose one of them or to give relevance grades to them so well, again, two groups.",
                    "label": 0
                },
                {
                    "sent": "One was asked to give preference, meaning result.",
                    "label": 0
                },
                {
                    "sent": "One is better than result 2 or opposite an another group was asked to give numbers and then the result was actually that there is no statistically significant difference between the rankings induced by this results.",
                    "label": 1
                },
                {
                    "sent": "So it seems that relevant scores, no matter where they are given in preference or relevance, no matter if you ask them to give numbers or to choose one, looks the same.",
                    "label": 0
                },
                {
                    "sent": "But",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's a phenomenon.",
                    "label": 0
                },
                {
                    "sent": "Psychological anchoring.",
                    "label": 0
                },
                {
                    "sent": "Usually people leave their presented with big numbers like if you take 2 control groups, one control up, you ask how many people are there in China, and then you ask them.",
                    "label": 0
                },
                {
                    "sent": "Now give me some number no matter what like.",
                    "label": 0
                },
                {
                    "sent": "Anything to do with the first question?",
                    "label": 0
                },
                {
                    "sent": "Then you take another groups as as them.",
                    "label": 0
                },
                {
                    "sent": "How many fingers do you have?",
                    "label": 0
                },
                {
                    "sent": "No, don't tell me and now tell me whichever number you want.",
                    "label": 0
                },
                {
                    "sent": "So the first group to China Group will always say like really big numbers and the fingers will always say like little numbers so we're trying to illustrate the same thing here and we were asking presenting users with three results result 1 result 2 and a very relevant result and another group would be presented with result 1, result 2 and an extremely relevant result to the query.",
                    "label": 0
                },
                {
                    "sent": "And then we're asking them again.",
                    "label": 0
                },
                {
                    "sent": "The same questions give me preference on this triplet, give me relevance on this triplet.",
                    "label": 0
                },
                {
                    "sent": "And what we're trying to check that whether the additional context actually affect their relevance or ranking, were giving on the pairs meaning are can we trust pair relevance?",
                    "label": 0
                },
                {
                    "sent": "Is it stable enough so the results we got here is the relevance?",
                    "label": 0
                },
                {
                    "sent": "An ordering of the pairs remain the same.",
                    "label": 0
                },
                {
                    "sent": "However, people were in there seeing very relevant result give much lower grades to result one and result 2.",
                    "label": 0
                },
                {
                    "sent": "An if they see an extremely irrelevant one, they're going to give a higher results.",
                    "label": 0
                },
                {
                    "sent": "2 result, 1 result 2.",
                    "label": 0
                },
                {
                    "sent": "And another interesting result we've seen here that preference resolved would give statistically nonsignificant difference, meaning it was stable enough.",
                    "label": 0
                },
                {
                    "sent": "So in this kind of cases, you better ask users for preference.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another interesting experiment.",
                    "label": 0
                },
                {
                    "sent": "Would be to have OK, so it's an experiment actually designed by our really many many years ago.",
                    "label": 0
                },
                {
                    "sent": "Users were presented with two options.",
                    "label": 1
                },
                {
                    "sent": "Do we want to go to London with breakfast for $1000 or do we want to go to Paris with breakfast?",
                    "label": 0
                },
                {
                    "sent": "$1000 so users were divided half and half?",
                    "label": 0
                },
                {
                    "sent": "Then another group was presented with the same with the same options at London with breakfast, $1000 Paris with breakfast, $1000, but then they saw another option London without breakfast for $1000 and now all the users will now.",
                    "label": 0
                },
                {
                    "sent": "Magically wanting to go to London with breakfast for $1000, so we're trying to do the same here, then another.",
                    "label": 0
                },
                {
                    "sent": "Another interesting experiment.",
                    "label": 0
                },
                {
                    "sent": "There were asking women, which meant they prefer accounts showing only two pictures, and then they added an extra picture taking one.",
                    "label": 0
                },
                {
                    "sent": "Clean Photo shop and then asking which one do you prefer an all women prefer the beautiful version of the men who was made ugly.",
                    "label": 0
                },
                {
                    "sent": "OK, so let's see what happens here.",
                    "label": 0
                },
                {
                    "sent": "We were taking a result 1 result to an making one of the results ugly, so they were making it ugly.",
                    "label": 0
                },
                {
                    "sent": "We're translating it to Italian then back.",
                    "label": 0
                },
                {
                    "sent": "OK, this is the best way we could find.",
                    "label": 0
                },
                {
                    "sent": "Then you got like it looked like English.",
                    "label": 0
                },
                {
                    "sent": "It wasn't the same subject, but again it will OK and it looked quite similar an for one control group were asking and preference and for the other group were asking relevance and hear the results were surprising when are when we were asking user to the relevance judgment.",
                    "label": 1
                },
                {
                    "sent": "It didn't change, meaning the ordering of result one and result 2 did not change.",
                    "label": 0
                },
                {
                    "sent": "But when we were asking users to make preference, it actually changed.",
                    "label": 0
                },
                {
                    "sent": "So sometimes it depends on what you think your results are going to be.",
                    "label": 0
                },
                {
                    "sent": "If there you think they're very similar, for example here they're very similar.",
                    "label": 0
                },
                {
                    "sent": "There is a small difference between them.",
                    "label": 0
                },
                {
                    "sent": "You better ask them for relevance, but if you have like big differences like very good results and really bad results, you should consider asking the user for preferences.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here I'm coming to talk about query complexity, so usually what people say in most daughter goes in this subject that using pairwise ranking is problematic as you need an square pairs to train your model.",
                    "label": 0
                },
                {
                    "sent": "So this is what we want to talk about here an ask.",
                    "label": 0
                },
                {
                    "sent": "Do we actually need that?",
                    "label": 1
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Much.",
                    "label": 0
                },
                {
                    "sent": "The first thing I'm going to do is a quick reminder.",
                    "label": 1
                },
                {
                    "sent": "I'm going to try to make it a bit clearer of what is VC dimension, so let's take a look at a Boolean function group of them.",
                    "label": 0
                },
                {
                    "sent": "We call it C and we say a group as shattered by C. If no matter how we label the objects.",
                    "label": 0
                },
                {
                    "sent": "C will have a consistent function.",
                    "label": 0
                },
                {
                    "sent": "With the labeling, so let's give us an example, so we'll have a patience.",
                    "label": 0
                },
                {
                    "sent": "This is our group S and some of the patients are sick and some are not, and the functions in CR blend function saying whether somebody is sick or not.",
                    "label": 0
                },
                {
                    "sent": "So no matter how we look at those patients, no matter who is sick or not, we're going to have a function which is consistent with the labeling of the patients.",
                    "label": 0
                },
                {
                    "sent": "I'm going to have another example so and the visa dimension is actually the biggest group that you can actually shutter by C, But it functions with C.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So a good example is let's take a look at functions will call it a box and here are elements and no matter how I label that elements, the labeling here is either red or blue.",
                    "label": 0
                },
                {
                    "sent": "I will still have a box which inside a box everything will be blue and outside of blocks everything will be read.",
                    "label": 0
                },
                {
                    "sent": "So no matter where you put it in space, no matter how you label it, I'm still going to have a function from Box Square which is consistent with the labeling, but I cannot have five points because if you have 5.",
                    "label": 0
                },
                {
                    "sent": "Five points, and they're all pluses.",
                    "label": 0
                },
                {
                    "sent": "A square has to contain all of them, so if we take a look at.",
                    "label": 0
                },
                {
                    "sent": "This plus inside it if we have a labeling giving it the minus will not have a consistent function from Box Square.",
                    "label": 0
                },
                {
                    "sent": "OK, so this meaning that our visit dimension is less than five.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So well, why I was explaining that Visa Dimension is a very nice.",
                    "label": 0
                },
                {
                    "sent": "Thing to use when you want to know how many samples you need to get in order to have a small error.",
                    "label": 0
                },
                {
                    "sent": "For example in your learner.",
                    "label": 0
                },
                {
                    "sent": "So Botnick proved that if you take this dimension of a group in our, in our case the groups are pairs, so this is the patients I had before.",
                    "label": 0
                },
                {
                    "sent": "Now the groups pairs.",
                    "label": 0
                },
                {
                    "sent": "It should be smaller than long.",
                    "label": 0
                },
                {
                    "sent": "The size of the group.",
                    "label": 0
                },
                {
                    "sent": "In my case.",
                    "label": 0
                },
                {
                    "sent": "Well, what are those functions?",
                    "label": 0
                },
                {
                    "sent": "The functions are permutations being in the rankings.",
                    "label": 0
                },
                {
                    "sent": "How many of those do you have?",
                    "label": 1
                },
                {
                    "sent": "And factorial, so it's an Logan.",
                    "label": 0
                },
                {
                    "sent": "So and this is the misconception so.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'd like to prove that it's not an organics less, and then we're going to show that you need less than an square pairs.",
                    "label": 0
                },
                {
                    "sent": "So I'm dividing into two cases.",
                    "label": 0
                },
                {
                    "sent": "The first one would be taking a look at a group of pairs.",
                    "label": 1
                },
                {
                    "sent": "And let's say that we have an pairs, so if we assume 2 results are inside there, both UV envy.",
                    "label": 0
                },
                {
                    "sent": "You are inside a group.",
                    "label": 0
                },
                {
                    "sent": "But that cannot be.",
                    "label": 0
                },
                {
                    "sent": "But 'cause then I will not have a ranking function which says both result AIDS before result being and result be is before result a so we don't have a consistent function.",
                    "label": 1
                },
                {
                    "sent": "So we say as stock cannot be shuttered.",
                    "label": 0
                },
                {
                    "sent": "Then this dimension is at most N -- 1.",
                    "label": 1
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The second case is, again, I'm assuming a group of pairs size N an.",
                    "label": 1
                },
                {
                    "sent": "Now I assume you VNV you cannot be in the same group, so I actually can draw a graph and there is an edge between VNU if V is before you're in our ranking.",
                    "label": 1
                },
                {
                    "sent": "However, if we take a closer look, we have end results and and pairs, so we gotta have a circle in our graph, right?",
                    "label": 1
                },
                {
                    "sent": "But if you have a circle, means as before BBS before C, but C is before a.",
                    "label": 1
                },
                {
                    "sent": "So we can never ever permutation, which is consistent with her.",
                    "label": 1
                },
                {
                    "sent": "And again, we say estar cannot be shared and visit the mentions at most N1.",
                    "label": 0
                },
                {
                    "sent": "And if you actually want to prove that it's endless one, any spanning tree of this graph is equivalent to the permutation you are looking at.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so last calculations were talking bout diveley.",
                    "label": 0
                },
                {
                    "sent": "Actually the valuation method.",
                    "label": 0
                },
                {
                    "sent": "So we were looking about the true ranking of the human an they induced one based on the sampling of the pairs.",
                    "label": 0
                },
                {
                    "sent": "So if we take a look at the loss function which counts how many pairs were located in correctly.",
                    "label": 1
                },
                {
                    "sent": "So this is the L. This is the number which is derived based on but Nicks Thierry.",
                    "label": 0
                },
                {
                    "sent": "So if we take only this number of samples, meaning this number of pairs.",
                    "label": 0
                },
                {
                    "sent": "Would it be added levely worse than the optimal permutation by epsilon?",
                    "label": 0
                },
                {
                    "sent": "And if we take another reason, if you take a look at the Kendall Town distance, it will be at most epsilon from what the user is actually thinking about.",
                    "label": 0
                },
                {
                    "sent": "And the last resolve if you the number of pairs we actually need.",
                    "label": 0
                },
                {
                    "sent": "OK, based on the options from 2009 is ANSI Square, where C is the number you can use here.",
                    "label": 0
                },
                {
                    "sent": "When you would like the elements to be at most distance and divided by C.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So just to conclude, the main ideas of our work as there should be some kind of match between how you feed our ranking evaluator an how you actually evaluate it.",
                    "label": 0
                },
                {
                    "sent": "You cannot ask for relevance and then do relative checkins.",
                    "label": 0
                },
                {
                    "sent": "Second thing is information quality.",
                    "label": 0
                },
                {
                    "sent": "Pairs are enough for ranking.",
                    "label": 0
                },
                {
                    "sent": "Ordering for pairs is different from ordering from single tones.",
                    "label": 0
                },
                {
                    "sent": "We think that bears are enough because we saw it has the same information as triplets.",
                    "label": 0
                },
                {
                    "sent": "Sometimes you should use preference relevance in some and sometimes you need to use relevance.",
                    "label": 0
                },
                {
                    "sent": "Revelation is done by only sampling any pairs.",
                    "label": 0
                },
                {
                    "sent": "Then you need much less than N square.",
                    "label": 0
                },
                {
                    "sent": "You only need and see square.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "About like future work, we think that you don't have to just randomly sample those pairs an we conjecture about this algorithm, which actually if you see that two pairs are very far from each other, stop sampling from the ends and always try to concentrate on the samples which are not sure about their position.",
                    "label": 0
                },
                {
                    "sent": "So by ranking in the middle and then it would be much practical result of N polylog and without this see that's it.",
                    "label": 0
                }
            ]
        }
    }
}