{
    "id": "6d65g2evwo4kbnke5t3pdvhfv22m6l4i",
    "title": "Toward the Web of Functions: Interoperable High-Order Functions in SPARQL",
    "info": {
        "author": [
            "Maurizio Atzori, University of Cagliari"
        ],
        "published": "Dec. 19, 2014",
        "recorded": "October 2014",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2014_atzori_web_of_functions/",
    "segmentation": [
        [
            "So my talk is about sparkle functions.",
            "An I will show."
        ],
        [
            "Problems with current implementation.",
            "Current recommendation for sparkle function.",
            "In particular interoperability, an expressivity and then we will show how to solve these problems with, let's say, a vision that I called web of functions.",
            "And that reminds the web of data where we can implement our special function to implement.",
            "Actually it and we will see some methods to do it."
        ],
        [
            "OK.",
            "So.",
            "And some background we have in Spark.",
            "Well we have a number of building functions, let's say built in functions that are specified in the recommendation of WTC.",
            "Like substring is Uriah etc.",
            "And also we have operator extensibility.",
            "That means that we can implement a new function in our local endpoint and they are expressed by your eyes.",
            "So they are just identifiers.",
            "But the syntax is your eyes.",
            "So that's more that's very important.",
            "For example, in Gina, we have a fan.",
            "SQRT to compute the square root FN contains, so they are prefix, so they are URLs.",
            "Actually we have a beef contains in virtuals.",
            "So the."
        ],
        [
            "First problem that I can see is limited interoperability.",
            "Actually, it's a known problem.",
            "An for example, if we run and if we ask SQRT 9 in Gina, we get 3.",
            "But if we get if we run the same query in under in, which was alright.",
            "We get undefined procedure becausw that URL that is HTTP, Gina, HPL etc.",
            "Doesn't mean anything in that also."
        ],
        [
            "And even worse, sometimes the same you arise implemented in different endpoints but with different semantics.",
            "For example, this query runs perfectly both on Gina and Virtuoso, but the results is different.",
            "What I'm doing here is looking for 4 three strings.",
            "I'm looking if the strings contain the substring is cool, OK?",
            "So I got through through."
        ],
        [
            "Also in Gina I got 1 one an undefined in Virtuozzo and the important thing is.",
            "That they are now."
        ],
        [
            "Bugs I'm trying to answer.",
            "Actually the previous question.",
            "They're not bugs in this case.",
            "Of course, that's another way they can.",
            "Both Gina Virtuoso are doing a good job in this case, 'cause the recommendation doesn't specify any semantics for user defined functions.",
            "You can do whatever you want, and this contain function is a user defined so that also and Gina can take different approaches on the output of these functions.",
            "So I put a question mark on semantic web becausw semantics should be important in semantic web and it is in web of data.",
            "So if I go to HT because there are URL differentiation for data.",
            "So if I say the paideia.org resource Riverdale Garda I can differentiate it and I think that it's a city.",
            "It's in Italy, no ambiguity but there is no such a thing in for functions.",
            "And that's why I think we should have a web of functions."
        ],
        [
            "So let let me also show the other problem that I can see in current implementation function which is limited expressivity we cannot represent I harder functionalities for example in this case I'm putting the functions contain an concat.",
            "There are two string functions into a variable F, and then I am binding the execution of F. So in computing, but I would like to compute contains and can count against two strings.",
            "So Melissa sorry is cool, so I would like to know whether I am cool and the desired results is should be something like false.",
            "Be cause it's cool is not contained in Morissette.",
            "Sorry, and also the concatenations should be more research schools OK.",
            "I don't know if it's clear, but it's it's very simple, but it unfortunately doesn't work on sparkwell because it doesn't allow to call a function which is in a variable.",
            "And it's."
        ],
        [
            "Just a trick.",
            "Let's say there are application for I order function.",
            "We may want to memorize a function to run faster if we called multiple times we can have map with my order function.",
            "So I can apply a Max function of over a list of numbers or we can compose function.",
            "For example the absolute number and then round Number I compute out dynamically function F and then I run against.",
            "Minus 4.9, so I I'd like to have the.",
            "Absolute number an round Number at the same time."
        ],
        [
            "So this functionality's are not present right now.",
            "But we have we can do it with the web or function which is interoperable.",
            "I heard their functions."
        ],
        [
            "How can we implement the web of function?",
            "It's very simple by implementing a single spatial Queen, let's say King.",
            "Function called call, so in this case we solve both problems and also we realized in level function the definition of call in terms of URL is this one and."
        ],
        [
            "This is the syntax how to use it.",
            "So in the previous case in the previous example we can change the call of a variable with by using the call function and passing the variable the variable.",
            "So the first argument is the function we want to call, and then the arguments of the function.",
            "So in this case it will work and we'll get the right results.",
            "So the syntax is this one, but what is the real semantics of this call function?"
        ],
        [
            "The semantics is the following.",
            "We get the function, which is our UI.",
            "We compute the appropriate sparkle endpoint that implements that function.",
            "There are three alternatives in the paper I, but I can show a simple one.",
            "We can just agree that we can remove the characters except for the last.",
            "\\ and then add spark well.",
            "Of course we there are other upper other possibilities and also the call function allows to specify explicitly then the endpoint we want to run the function against."
        ],
        [
            "So this is the architecture the user will use an endpoint with.",
            "Featuring the call function.",
            "Only the called function, and then if we run a functional query like that one.",
            "So we are calling the function.",
            "I'm alzar.com blah blah blah.",
            "They are our endpoint will call.",
            "The remote endpoint will run the function against the remote endpoint which implements that function and then get the results back to our user O the no matter which end point we are using, no matter which end point we are using.",
            "It will call the remote provider of the function, so all the endpoints will run the same function."
        ],
        [
            "And not to do that this week.",
            "Of course we need to deploy.",
            "I'm sorry.",
            "What can we do to publish a new function?",
            "We can deploy a spark one point with your user defined functions.",
            "Or we can just write a simple script in any language.",
            "For example BHP takes 3 lines of code to publish a new function in the web of function, so it's very easy to publish new functions.",
            "Ah, now."
        ],
        [
            "Our implementation is online, it's open source, it's implemented for Gina, Jose, Kiana, or Gene Agenda, and we also have an endpoint that implements the function.",
            "It's fast and it introduces us very small delay, so unless you are running a millions of remote query functions, I don't know to say remote functions, then it's OK."
        ],
        [
            "Anne.",
            "OK, in the paper we also have different implementation.",
            "OK, that disables one is to implement in Java for example in C invert also.",
            "But there are also we tried to address the out to implement it in pure sparkwell."
        ],
        [
            "That's not trivial, as the other friend before May know becausw the arguments are not passed to their remote.",
            "OK, we can use Federated queries, but the arguments of the function are not passed to the other endpoint, so it's not trivial unless your function doesn't take any any argument."
        ],
        [
            "Anyway, we developed two alternatives, which are one is based on a proxy endpoint, so like an endpoint in the middle that feature called and this case.",
            "Of course we need.",
            "We need a proxy and we also require one non normative part to be implemented in the color, so it may not work always, but we verify that it works on Gina.",
            "Anvil was also if there are applications OK and another another approach is to have 100% sparkle.",
            "Approach means no proxy, nor Java or C sparkle only.",
            "And it requires in this case two non normative parts to be implemented in the color.",
            "So it's even it's less likely to work, but still in ingenia it works.",
            "So there are application also for this other approach."
        ],
        [
            "So conclusions are web of fun with verbal function we can as a user we can call any function in the web of function from our own endpoint as long as we have the called function.",
            "Anne, right now there are more than thousand 10,000 function already developed.",
            "For example, we can do facial recognition or get the temperature of a city given the name of the city or the latitude and longitude.",
            "I mean thousands of functions and you can see the demo paper for this.",
            "I also have an as publisher.",
            "We can implement a function you functional very quickly.",
            "But in any language without deploying a triplestore server, just a PHP script, if we like PHP or Python.",
            "So we both function can be realized without changing the current Sparkle specification.",
            "That's important, it's just on if we want implement in Java, it's on station to our endpoint or otherwise.",
            "We can use the sparkle 100% pure approach.",
            "And actually it does exist.",
            "So if we want to use it or get new information, you can go to the official website.",
            "It's missing, it's missing."
        ],
        [
            "There one OK doesn't matter, and these are related papers, especially the I don't have the time, but there is also a related paper already published, the last one which is very related but doesn't solve this problem.",
            "OK, thank you.",
            "Yes, as I understand we need to pass two arguments to the function.",
            "The function name and endpoint that implements it.",
            "Becausw we want to tell them how do you want to do other version of contains or Gina version of contains.",
            "Sometimes the functional will be completely different with this emura.",
            "OK that the idea is OK.",
            "This is like something.",
            "Also say transitive way to use existing function so I can specify the spark well, but the final approach will be to agree on on this thing.",
            "So if you want to publish answer to all questions function you will put it in a sparkling point that match that string that URL.",
            "So in that case all the users will use the same function and you don't.",
            "You don't need to specify there.",
            "Of course there are other approaches like differentiation to get.",
            "There are other approaches, but in general you don't have to specify that.",
            "The idea is that you don't have to specify this permanent point.",
            "I'm of course afraid of performance for large queries.",
            "Of course.",
            "I was wondering if you've considered a way to transport the implementation, either packaged as a Java class for JNI, or maybe have a family of implementations that could be transported back to the original server.",
            "I didn't and there's a good reason, because Williams did the other guy and OK. You may think it's a better solution to get the source code and run it in my own.",
            "And the point, I think it's a good solution for some functions, but there are security problems because you're so you have you gain a speed, but you lose in security.",
            "And also if I want to get the current.",
            "Temperature in Rome right now.",
            "OK, there is no code that can run in my computer that answer my question.",
            "OK, so and so the thousands of.",
            "Or maybe you need special hardware to answer that.",
            "So in general I preferred the other approach, but they can be mixed and we can both both.",
            "We can use both.",
            "I agree absolutely what I meant, yes.",
            "I'm pleased to see a higher order function arrive Inspector obviously suggested.",
            "Don't you think that the next step would be to allow the definition of anonymous?",
            "Functions like Lambda abstractions.",
            "I mean, if you want to do a map, maybe the function that you want to pass the map.",
            "Does not exist on do you want to define it as a composition of other functions or?",
            "Yeah, so I love so you would say you would want to put in this PACR query in the users query.",
            "Something like some function taking some X on Y and returning and then you get an express.",
            "Yeah they all all.",
            "Calls will be done by the call function, so of course that the function will not be implemented in their remote function, but it will be called back.",
            "So every time I call a function, it's implemented because it's implemented remotely.",
            "Do but do you agree?",
            "So if it's going to work, I think it's going to work because the map function doesn't have the function.",
            "To map to.",
            "But it will call it remotely, yes, but what I mean is that the function being defined as no name.",
            "You just say some function like composition.",
            "Not not composition, because then composition is a composition of two name function.",
            "Here is equation of defining a user function.",
            "You know, just from an expression on from a binding of the argument variables.",
            "Yeah, as long as it's in the web of function, so you need to not just define locali.",
            "I don't know how to do it, but you also have to publish in the web of function.",
            "Then you can use.",
            "It may publish in the web of function means that if a caller called that try to run remotely your your server will answer with the running your function.",
            "I see so yeah.",
            "There may not be OKC 3 compatibility with you present, it's just that you need a bit more.",
            "Things to do in this particular engine.",
            "To to take into account those anonymous functions, but maybe we can discuss this.",
            "Yeah, of course I didn't think about anonymous function actually, so either that would be natural.",
            "Your ideas come from if you did come from the programming and then it makes sense to make it complete.",
            "OK, so two questions kind of following up on the point about the security issue in possibly sending codes other servers.",
            "The first being that in this case you require that we send data potentially private to a third party that we don't control and 2nd what's to prevent you from updating your server a year from now and changing the semantics of this function so that I can't reference an earlier iteration that worked for my code and maybe your new version breaks the semantics of my existing Sparkle query.",
            "I think I lost the second question for the first question.",
            "Yeah, I mentioned it in the paper.",
            "Of course, passing data to a service provider in general is maybe like a privacy leak.",
            "I don't know how to say, but you know, there are rest services.",
            "Ann Webb.",
            "I don't know web web APIs, so people are using them.",
            "I mean, I'm not discovering anything new and so I also in edit all the problems of this approach.",
            "But still I think there are applications.",
            "Alright, so just repeating the second part of my question.",
            "For example, what if virtuoso change the semantics of their contains function to return true or false?",
            "Like Jenna, and now you know you've updated your server, which was based on Virtuoso and the semantics of my old query that was calling your function.",
            "OK, I think you are focusing on like kind of building functions.",
            "OK, it's like saying that Windows has a number of triples built in.",
            "OK yeah, maybe you cannot find them in Gina, but you are not really interested in them.",
            "You are just using the one that you can find the web of data.",
            "While in this case you are using most, you're probably using the functions that you find in the web of functions, so there may be functions that with those implements without publishing the web of data, let's say in the web of functions.",
            "But maybe you can avoid them.",
            "We're not really interested in them.",
            "I think the last short one.",
            "Yes, just a comment to the previous question.",
            "We have also proposed the syntax for anonymous functions and 2nd order functions in our scientific sparkle because our users really wanted to have some functional semantics and sparkle great.",
            "Is it online?",
            "Your yes, it wasn't the poster and you can see it online.",
            "It was a team of paper on size particle.",
            "OK, so we can talk.",
            "We have it all.",
            "I think OK. OK, thank you everybody and thank the speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So my talk is about sparkle functions.",
                    "label": 0
                },
                {
                    "sent": "An I will show.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Problems with current implementation.",
                    "label": 0
                },
                {
                    "sent": "Current recommendation for sparkle function.",
                    "label": 0
                },
                {
                    "sent": "In particular interoperability, an expressivity and then we will show how to solve these problems with, let's say, a vision that I called web of functions.",
                    "label": 0
                },
                {
                    "sent": "And that reminds the web of data where we can implement our special function to implement.",
                    "label": 1
                },
                {
                    "sent": "Actually it and we will see some methods to do it.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "And some background we have in Spark.",
                    "label": 0
                },
                {
                    "sent": "Well we have a number of building functions, let's say built in functions that are specified in the recommendation of WTC.",
                    "label": 0
                },
                {
                    "sent": "Like substring is Uriah etc.",
                    "label": 0
                },
                {
                    "sent": "And also we have operator extensibility.",
                    "label": 1
                },
                {
                    "sent": "That means that we can implement a new function in our local endpoint and they are expressed by your eyes.",
                    "label": 0
                },
                {
                    "sent": "So they are just identifiers.",
                    "label": 0
                },
                {
                    "sent": "But the syntax is your eyes.",
                    "label": 0
                },
                {
                    "sent": "So that's more that's very important.",
                    "label": 0
                },
                {
                    "sent": "For example, in Gina, we have a fan.",
                    "label": 1
                },
                {
                    "sent": "SQRT to compute the square root FN contains, so they are prefix, so they are URLs.",
                    "label": 0
                },
                {
                    "sent": "Actually we have a beef contains in virtuals.",
                    "label": 0
                },
                {
                    "sent": "So the.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First problem that I can see is limited interoperability.",
                    "label": 1
                },
                {
                    "sent": "Actually, it's a known problem.",
                    "label": 0
                },
                {
                    "sent": "An for example, if we run and if we ask SQRT 9 in Gina, we get 3.",
                    "label": 0
                },
                {
                    "sent": "But if we get if we run the same query in under in, which was alright.",
                    "label": 1
                },
                {
                    "sent": "We get undefined procedure becausw that URL that is HTTP, Gina, HPL etc.",
                    "label": 0
                },
                {
                    "sent": "Doesn't mean anything in that also.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And even worse, sometimes the same you arise implemented in different endpoints but with different semantics.",
                    "label": 0
                },
                {
                    "sent": "For example, this query runs perfectly both on Gina and Virtuoso, but the results is different.",
                    "label": 0
                },
                {
                    "sent": "What I'm doing here is looking for 4 three strings.",
                    "label": 0
                },
                {
                    "sent": "I'm looking if the strings contain the substring is cool, OK?",
                    "label": 0
                },
                {
                    "sent": "So I got through through.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also in Gina I got 1 one an undefined in Virtuozzo and the important thing is.",
                    "label": 0
                },
                {
                    "sent": "That they are now.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Bugs I'm trying to answer.",
                    "label": 0
                },
                {
                    "sent": "Actually the previous question.",
                    "label": 0
                },
                {
                    "sent": "They're not bugs in this case.",
                    "label": 0
                },
                {
                    "sent": "Of course, that's another way they can.",
                    "label": 0
                },
                {
                    "sent": "Both Gina Virtuoso are doing a good job in this case, 'cause the recommendation doesn't specify any semantics for user defined functions.",
                    "label": 0
                },
                {
                    "sent": "You can do whatever you want, and this contain function is a user defined so that also and Gina can take different approaches on the output of these functions.",
                    "label": 0
                },
                {
                    "sent": "So I put a question mark on semantic web becausw semantics should be important in semantic web and it is in web of data.",
                    "label": 1
                },
                {
                    "sent": "So if I go to HT because there are URL differentiation for data.",
                    "label": 0
                },
                {
                    "sent": "So if I say the paideia.org resource Riverdale Garda I can differentiate it and I think that it's a city.",
                    "label": 0
                },
                {
                    "sent": "It's in Italy, no ambiguity but there is no such a thing in for functions.",
                    "label": 0
                },
                {
                    "sent": "And that's why I think we should have a web of functions.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let let me also show the other problem that I can see in current implementation function which is limited expressivity we cannot represent I harder functionalities for example in this case I'm putting the functions contain an concat.",
                    "label": 0
                },
                {
                    "sent": "There are two string functions into a variable F, and then I am binding the execution of F. So in computing, but I would like to compute contains and can count against two strings.",
                    "label": 0
                },
                {
                    "sent": "So Melissa sorry is cool, so I would like to know whether I am cool and the desired results is should be something like false.",
                    "label": 0
                },
                {
                    "sent": "Be cause it's cool is not contained in Morissette.",
                    "label": 0
                },
                {
                    "sent": "Sorry, and also the concatenations should be more research schools OK.",
                    "label": 0
                },
                {
                    "sent": "I don't know if it's clear, but it's it's very simple, but it unfortunately doesn't work on sparkwell because it doesn't allow to call a function which is in a variable.",
                    "label": 1
                },
                {
                    "sent": "And it's.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just a trick.",
                    "label": 0
                },
                {
                    "sent": "Let's say there are application for I order function.",
                    "label": 0
                },
                {
                    "sent": "We may want to memorize a function to run faster if we called multiple times we can have map with my order function.",
                    "label": 0
                },
                {
                    "sent": "So I can apply a Max function of over a list of numbers or we can compose function.",
                    "label": 0
                },
                {
                    "sent": "For example the absolute number and then round Number I compute out dynamically function F and then I run against.",
                    "label": 0
                },
                {
                    "sent": "Minus 4.9, so I I'd like to have the.",
                    "label": 0
                },
                {
                    "sent": "Absolute number an round Number at the same time.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this functionality's are not present right now.",
                    "label": 0
                },
                {
                    "sent": "But we have we can do it with the web or function which is interoperable.",
                    "label": 0
                },
                {
                    "sent": "I heard their functions.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How can we implement the web of function?",
                    "label": 1
                },
                {
                    "sent": "It's very simple by implementing a single spatial Queen, let's say King.",
                    "label": 0
                },
                {
                    "sent": "Function called call, so in this case we solve both problems and also we realized in level function the definition of call in terms of URL is this one and.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the syntax how to use it.",
                    "label": 0
                },
                {
                    "sent": "So in the previous case in the previous example we can change the call of a variable with by using the call function and passing the variable the variable.",
                    "label": 0
                },
                {
                    "sent": "So the first argument is the function we want to call, and then the arguments of the function.",
                    "label": 0
                },
                {
                    "sent": "So in this case it will work and we'll get the right results.",
                    "label": 0
                },
                {
                    "sent": "So the syntax is this one, but what is the real semantics of this call function?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The semantics is the following.",
                    "label": 0
                },
                {
                    "sent": "We get the function, which is our UI.",
                    "label": 0
                },
                {
                    "sent": "We compute the appropriate sparkle endpoint that implements that function.",
                    "label": 0
                },
                {
                    "sent": "There are three alternatives in the paper I, but I can show a simple one.",
                    "label": 1
                },
                {
                    "sent": "We can just agree that we can remove the characters except for the last.",
                    "label": 0
                },
                {
                    "sent": "\\ and then add spark well.",
                    "label": 1
                },
                {
                    "sent": "Of course we there are other upper other possibilities and also the call function allows to specify explicitly then the endpoint we want to run the function against.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is the architecture the user will use an endpoint with.",
                    "label": 0
                },
                {
                    "sent": "Featuring the call function.",
                    "label": 0
                },
                {
                    "sent": "Only the called function, and then if we run a functional query like that one.",
                    "label": 0
                },
                {
                    "sent": "So we are calling the function.",
                    "label": 0
                },
                {
                    "sent": "I'm alzar.com blah blah blah.",
                    "label": 0
                },
                {
                    "sent": "They are our endpoint will call.",
                    "label": 0
                },
                {
                    "sent": "The remote endpoint will run the function against the remote endpoint which implements that function and then get the results back to our user O the no matter which end point we are using, no matter which end point we are using.",
                    "label": 0
                },
                {
                    "sent": "It will call the remote provider of the function, so all the endpoints will run the same function.",
                    "label": 1
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And not to do that this week.",
                    "label": 0
                },
                {
                    "sent": "Of course we need to deploy.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry.",
                    "label": 0
                },
                {
                    "sent": "What can we do to publish a new function?",
                    "label": 0
                },
                {
                    "sent": "We can deploy a spark one point with your user defined functions.",
                    "label": 1
                },
                {
                    "sent": "Or we can just write a simple script in any language.",
                    "label": 1
                },
                {
                    "sent": "For example BHP takes 3 lines of code to publish a new function in the web of function, so it's very easy to publish new functions.",
                    "label": 0
                },
                {
                    "sent": "Ah, now.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our implementation is online, it's open source, it's implemented for Gina, Jose, Kiana, or Gene Agenda, and we also have an endpoint that implements the function.",
                    "label": 0
                },
                {
                    "sent": "It's fast and it introduces us very small delay, so unless you are running a millions of remote query functions, I don't know to say remote functions, then it's OK.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "OK, in the paper we also have different implementation.",
                    "label": 1
                },
                {
                    "sent": "OK, that disables one is to implement in Java for example in C invert also.",
                    "label": 0
                },
                {
                    "sent": "But there are also we tried to address the out to implement it in pure sparkwell.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's not trivial, as the other friend before May know becausw the arguments are not passed to their remote.",
                    "label": 0
                },
                {
                    "sent": "OK, we can use Federated queries, but the arguments of the function are not passed to the other endpoint, so it's not trivial unless your function doesn't take any any argument.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Anyway, we developed two alternatives, which are one is based on a proxy endpoint, so like an endpoint in the middle that feature called and this case.",
                    "label": 0
                },
                {
                    "sent": "Of course we need.",
                    "label": 0
                },
                {
                    "sent": "We need a proxy and we also require one non normative part to be implemented in the color, so it may not work always, but we verify that it works on Gina.",
                    "label": 1
                },
                {
                    "sent": "Anvil was also if there are applications OK and another another approach is to have 100% sparkle.",
                    "label": 1
                },
                {
                    "sent": "Approach means no proxy, nor Java or C sparkle only.",
                    "label": 1
                },
                {
                    "sent": "And it requires in this case two non normative parts to be implemented in the color.",
                    "label": 0
                },
                {
                    "sent": "So it's even it's less likely to work, but still in ingenia it works.",
                    "label": 0
                },
                {
                    "sent": "So there are application also for this other approach.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So conclusions are web of fun with verbal function we can as a user we can call any function in the web of function from our own endpoint as long as we have the called function.",
                    "label": 1
                },
                {
                    "sent": "Anne, right now there are more than thousand 10,000 function already developed.",
                    "label": 0
                },
                {
                    "sent": "For example, we can do facial recognition or get the temperature of a city given the name of the city or the latitude and longitude.",
                    "label": 0
                },
                {
                    "sent": "I mean thousands of functions and you can see the demo paper for this.",
                    "label": 0
                },
                {
                    "sent": "I also have an as publisher.",
                    "label": 1
                },
                {
                    "sent": "We can implement a function you functional very quickly.",
                    "label": 1
                },
                {
                    "sent": "But in any language without deploying a triplestore server, just a PHP script, if we like PHP or Python.",
                    "label": 1
                },
                {
                    "sent": "So we both function can be realized without changing the current Sparkle specification.",
                    "label": 0
                },
                {
                    "sent": "That's important, it's just on if we want implement in Java, it's on station to our endpoint or otherwise.",
                    "label": 1
                },
                {
                    "sent": "We can use the sparkle 100% pure approach.",
                    "label": 0
                },
                {
                    "sent": "And actually it does exist.",
                    "label": 0
                },
                {
                    "sent": "So if we want to use it or get new information, you can go to the official website.",
                    "label": 0
                },
                {
                    "sent": "It's missing, it's missing.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There one OK doesn't matter, and these are related papers, especially the I don't have the time, but there is also a related paper already published, the last one which is very related but doesn't solve this problem.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you.",
                    "label": 0
                },
                {
                    "sent": "Yes, as I understand we need to pass two arguments to the function.",
                    "label": 0
                },
                {
                    "sent": "The function name and endpoint that implements it.",
                    "label": 0
                },
                {
                    "sent": "Becausw we want to tell them how do you want to do other version of contains or Gina version of contains.",
                    "label": 0
                },
                {
                    "sent": "Sometimes the functional will be completely different with this emura.",
                    "label": 0
                },
                {
                    "sent": "OK that the idea is OK.",
                    "label": 0
                },
                {
                    "sent": "This is like something.",
                    "label": 0
                },
                {
                    "sent": "Also say transitive way to use existing function so I can specify the spark well, but the final approach will be to agree on on this thing.",
                    "label": 0
                },
                {
                    "sent": "So if you want to publish answer to all questions function you will put it in a sparkling point that match that string that URL.",
                    "label": 0
                },
                {
                    "sent": "So in that case all the users will use the same function and you don't.",
                    "label": 0
                },
                {
                    "sent": "You don't need to specify there.",
                    "label": 0
                },
                {
                    "sent": "Of course there are other approaches like differentiation to get.",
                    "label": 0
                },
                {
                    "sent": "There are other approaches, but in general you don't have to specify that.",
                    "label": 0
                },
                {
                    "sent": "The idea is that you don't have to specify this permanent point.",
                    "label": 0
                },
                {
                    "sent": "I'm of course afraid of performance for large queries.",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                },
                {
                    "sent": "I was wondering if you've considered a way to transport the implementation, either packaged as a Java class for JNI, or maybe have a family of implementations that could be transported back to the original server.",
                    "label": 0
                },
                {
                    "sent": "I didn't and there's a good reason, because Williams did the other guy and OK. You may think it's a better solution to get the source code and run it in my own.",
                    "label": 0
                },
                {
                    "sent": "And the point, I think it's a good solution for some functions, but there are security problems because you're so you have you gain a speed, but you lose in security.",
                    "label": 0
                },
                {
                    "sent": "And also if I want to get the current.",
                    "label": 0
                },
                {
                    "sent": "Temperature in Rome right now.",
                    "label": 0
                },
                {
                    "sent": "OK, there is no code that can run in my computer that answer my question.",
                    "label": 0
                },
                {
                    "sent": "OK, so and so the thousands of.",
                    "label": 0
                },
                {
                    "sent": "Or maybe you need special hardware to answer that.",
                    "label": 0
                },
                {
                    "sent": "So in general I preferred the other approach, but they can be mixed and we can both both.",
                    "label": 0
                },
                {
                    "sent": "We can use both.",
                    "label": 0
                },
                {
                    "sent": "I agree absolutely what I meant, yes.",
                    "label": 0
                },
                {
                    "sent": "I'm pleased to see a higher order function arrive Inspector obviously suggested.",
                    "label": 0
                },
                {
                    "sent": "Don't you think that the next step would be to allow the definition of anonymous?",
                    "label": 0
                },
                {
                    "sent": "Functions like Lambda abstractions.",
                    "label": 0
                },
                {
                    "sent": "I mean, if you want to do a map, maybe the function that you want to pass the map.",
                    "label": 0
                },
                {
                    "sent": "Does not exist on do you want to define it as a composition of other functions or?",
                    "label": 0
                },
                {
                    "sent": "Yeah, so I love so you would say you would want to put in this PACR query in the users query.",
                    "label": 0
                },
                {
                    "sent": "Something like some function taking some X on Y and returning and then you get an express.",
                    "label": 0
                },
                {
                    "sent": "Yeah they all all.",
                    "label": 0
                },
                {
                    "sent": "Calls will be done by the call function, so of course that the function will not be implemented in their remote function, but it will be called back.",
                    "label": 0
                },
                {
                    "sent": "So every time I call a function, it's implemented because it's implemented remotely.",
                    "label": 1
                },
                {
                    "sent": "Do but do you agree?",
                    "label": 0
                },
                {
                    "sent": "So if it's going to work, I think it's going to work because the map function doesn't have the function.",
                    "label": 0
                },
                {
                    "sent": "To map to.",
                    "label": 0
                },
                {
                    "sent": "But it will call it remotely, yes, but what I mean is that the function being defined as no name.",
                    "label": 0
                },
                {
                    "sent": "You just say some function like composition.",
                    "label": 0
                },
                {
                    "sent": "Not not composition, because then composition is a composition of two name function.",
                    "label": 0
                },
                {
                    "sent": "Here is equation of defining a user function.",
                    "label": 1
                },
                {
                    "sent": "You know, just from an expression on from a binding of the argument variables.",
                    "label": 0
                },
                {
                    "sent": "Yeah, as long as it's in the web of function, so you need to not just define locali.",
                    "label": 0
                },
                {
                    "sent": "I don't know how to do it, but you also have to publish in the web of function.",
                    "label": 0
                },
                {
                    "sent": "Then you can use.",
                    "label": 0
                },
                {
                    "sent": "It may publish in the web of function means that if a caller called that try to run remotely your your server will answer with the running your function.",
                    "label": 0
                },
                {
                    "sent": "I see so yeah.",
                    "label": 0
                },
                {
                    "sent": "There may not be OKC 3 compatibility with you present, it's just that you need a bit more.",
                    "label": 0
                },
                {
                    "sent": "Things to do in this particular engine.",
                    "label": 0
                },
                {
                    "sent": "To to take into account those anonymous functions, but maybe we can discuss this.",
                    "label": 0
                },
                {
                    "sent": "Yeah, of course I didn't think about anonymous function actually, so either that would be natural.",
                    "label": 0
                },
                {
                    "sent": "Your ideas come from if you did come from the programming and then it makes sense to make it complete.",
                    "label": 0
                },
                {
                    "sent": "OK, so two questions kind of following up on the point about the security issue in possibly sending codes other servers.",
                    "label": 0
                },
                {
                    "sent": "The first being that in this case you require that we send data potentially private to a third party that we don't control and 2nd what's to prevent you from updating your server a year from now and changing the semantics of this function so that I can't reference an earlier iteration that worked for my code and maybe your new version breaks the semantics of my existing Sparkle query.",
                    "label": 0
                },
                {
                    "sent": "I think I lost the second question for the first question.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I mentioned it in the paper.",
                    "label": 0
                },
                {
                    "sent": "Of course, passing data to a service provider in general is maybe like a privacy leak.",
                    "label": 0
                },
                {
                    "sent": "I don't know how to say, but you know, there are rest services.",
                    "label": 0
                },
                {
                    "sent": "Ann Webb.",
                    "label": 0
                },
                {
                    "sent": "I don't know web web APIs, so people are using them.",
                    "label": 0
                },
                {
                    "sent": "I mean, I'm not discovering anything new and so I also in edit all the problems of this approach.",
                    "label": 0
                },
                {
                    "sent": "But still I think there are applications.",
                    "label": 0
                },
                {
                    "sent": "Alright, so just repeating the second part of my question.",
                    "label": 0
                },
                {
                    "sent": "For example, what if virtuoso change the semantics of their contains function to return true or false?",
                    "label": 0
                },
                {
                    "sent": "Like Jenna, and now you know you've updated your server, which was based on Virtuoso and the semantics of my old query that was calling your function.",
                    "label": 0
                },
                {
                    "sent": "OK, I think you are focusing on like kind of building functions.",
                    "label": 0
                },
                {
                    "sent": "OK, it's like saying that Windows has a number of triples built in.",
                    "label": 0
                },
                {
                    "sent": "OK yeah, maybe you cannot find them in Gina, but you are not really interested in them.",
                    "label": 0
                },
                {
                    "sent": "You are just using the one that you can find the web of data.",
                    "label": 0
                },
                {
                    "sent": "While in this case you are using most, you're probably using the functions that you find in the web of functions, so there may be functions that with those implements without publishing the web of data, let's say in the web of functions.",
                    "label": 1
                },
                {
                    "sent": "But maybe you can avoid them.",
                    "label": 0
                },
                {
                    "sent": "We're not really interested in them.",
                    "label": 0
                },
                {
                    "sent": "I think the last short one.",
                    "label": 0
                },
                {
                    "sent": "Yes, just a comment to the previous question.",
                    "label": 0
                },
                {
                    "sent": "We have also proposed the syntax for anonymous functions and 2nd order functions in our scientific sparkle because our users really wanted to have some functional semantics and sparkle great.",
                    "label": 0
                },
                {
                    "sent": "Is it online?",
                    "label": 0
                },
                {
                    "sent": "Your yes, it wasn't the poster and you can see it online.",
                    "label": 0
                },
                {
                    "sent": "It was a team of paper on size particle.",
                    "label": 0
                },
                {
                    "sent": "OK, so we can talk.",
                    "label": 0
                },
                {
                    "sent": "We have it all.",
                    "label": 1
                },
                {
                    "sent": "I think OK. OK, thank you everybody and thank the speaker again.",
                    "label": 0
                }
            ]
        }
    }
}