{
    "id": "6fc26g4bq76xcqtbrrkx57gwa5zfbz7n",
    "title": "The use of SMT in financial news sentiment analysis",
    "info": {
        "author": [
            "Thomas Dohmen, SemLab"
        ],
        "published": "Dec. 12, 2011",
        "recorded": "October 2011",
        "category": [
            "Top->Computer Science->Multilingual Information Access"
        ]
    },
    "url": "http://videolectures.net/w3cworkshop2011_dohmen_smt/",
    "segmentation": [
        [
            "Several things, but we do not do translation.",
            "So you might wonder what I'm doing here and that's what I'm going to tell you.",
            "We were founded in 2000 and Overspecializing.",
            "There's two kinds of software.",
            "We do more things, but these are two main lines which is financial software and healthcare software.",
            "Those are two kinds of software that's are considered very important by people, so we need accurate and fairly robust solutions for that.",
            "In finance is very important.",
            "People do not lose money, and because I want to gain money and in the healthcare sector is very important that people do not lose their lives.",
            "So what we do is make very specialized software for these two kinds of sectors will be talking today about the financial sector in order.",
            "So far you make for financial sector and our flagship products.",
            "Our core products is called Viewer Pro which is a semantic analysis platform that's interprets or analyzes financial news.",
            "What happens with banks and trading houses?",
            "Gets a lot of news, for example, the Dow Jones News Stream can deliver up to 10,000 used messages per day, and it's considered that financial news contains information's relevance to what's happening.",
            "Is it better?",
            "So with these amounts of news messages people needs under very many people reading it, something 10,000 messages per day.",
            "There is quite a lot.",
            "These are not big messages that consists of say 200 words or so, but it's nevertheless.",
            "This is a lot of information and if you deal with many equities this is.",
            "You should still go through everything if you deal and only few equities, one portfolio or so you need to discard a lot, so a software solution is necessary to be very useful to quickly go through things and to process news as soon as it comes in.",
            "And what typically happens is that we analyze news automatically using semantic analysis within few milliseconds.",
            "We process the news message as soon as it comes in, which social reading time and traders can interact automatically or instantly on what's happening on the market.",
            "It's not fast enough for the ultra low latency trading, so it's not not very suitable for your submitted second algo system, but for anything in the second after that, it's the natural millions for banks and trading houses and hedge funds etc.",
            "Um, one of these spinoff products from this year Pro system is new sentiments as EU.",
            "And this is something that's.",
            "Specially where language and translation comes in, and this is what I'll be discussing today.",
            "Or should we be humble be discussing today?",
            "For those of you interested, can go to the website, www.newcms.edu to get a quick glance.",
            "That's how it's kind of.",
            "Image this produces this financial news sentiment analysis."
        ],
        [
            "So apart from doing commercial work with local banks, as I said, similar participants in research, this is mostly funded by EU or via national funds.",
            "Summer collaborates with several leading research institutes for several universities, for example, as well as the Founder Institute for Financial Mathematics.",
            "In Germany.",
            "And yeah, last 10 years we invested, so it's quite a small company.",
            "So 5.8 million euros might not seem too much, but for a company of 15 people this is quite a lot of money.",
            "So we do invest in research to stay on top of our market and to make sure our semantic analysis software is."
        ],
        [
            "As useful as it could be to our clients.",
            "Analysis is quite solid, versatile technology, so it is suitable for a wide range of R&D innovation projects ranging from ontologies, which is what we are very interested in.",
            "'cause that's that's the core of our business language.",
            "Processing technologies, creation of new financial tools, social media, etc etc.",
            "Quite a number of.",
            "Projects we involved in logos on the sides show a few of those.",
            "And the lesson 3 projects that's shown here is the one I'll be talking about today because that's the one that involves statistical machine translation."
        ],
        [
            "If you have any questions about the photo project that we're doing will be happy to answer you during any of the brakes, and I can also show you a bit more about the new sentiments of websites and our new app so I can show you.",
            "So someone was also involved in the lesson 2 projects, which is a statistical machine translation projects from the body FT-7 program.",
            "And focus of this project is small European languages such as Latvian and Dutch and Danish.",
            "Um?",
            "For statistical machine translation, need quite a number equal of resources and experts on this field, but as far as I take it you need lots and lots of data and the smaller languages the less representative is on web, so it's harder to find resources for this.",
            "One of the benefits for us at some lab is that a statistical machine translation system is capable and then topic specific translation.",
            "And of course when you're dealing with business and finance news, you need something that can translate these sort of news.",
            "Source of news quite accurately, especially since there's quite a lot of money involved for clients.",
            "I'm just translation can easily lead to millions and millions of losses and.",
            "This is not exactly what they want, so.",
            "It would be interesting for us to to have language translation systems on board, but we need to be very careful, but this is actual technology.",
            "Um?",
            "So we don't want on this on this lesson T project, which is a collaboration projects.",
            "It was set up by company called Tilda, which I'm sure many of you are familiar with.",
            "It's called based in Latvia.",
            "University of Edinburgh Zagreb Copenhagen Uppsala Company called Moravia but I've seen past one of the slides before today and I said send them.",
            "Now, as I said before, someone doesn't deal with translation or empty systems.",
            "You don't have any of this technology in house, so our role in the project is old or just with the outsider here in the in the technology field.",
            "One of the roles we play is that we provide parallel corpora for the training of the system of the systems.",
            "As I said, we had a lot of news feeds from Dow Jones and rotors and we have quite some backstock of financial news.",
            "I think we have 20 years of Dow Jones back stock.",
            "Which is log data.",
            "There are some problems with this, which I'll be coming back to you shortly because most news notes delivered as a multilingual sets.",
            "So this is rather tricky.",
            "And our goal of positioning participating in this project is to integrate translation into our new sentence websites that you sent both of you that I mentioned before."
        ],
        [
            "So this is what it's approximately looks like.",
            "I don't know life with this because it's still in progress.",
            "Some of you visiting the website might be experiencing problems like receiving updates or something, so I took the safe side and some screenshots.",
            "To see here on the left side of the screen is a few blocks that show several companies and several several colors in several sizes.",
            "Sizes indicates the amount of news that was published about the company or the equity and the color, and it gets the sentiment.",
            "So always on top is our companies that have been very positively reported on in the last three hours.",
            "I think everything is a 3 hour average.",
            "While the bottom ones show companies that have some issues.",
            "On the right side you can see the actual events, so it's it's pretty small, could be able to see it from there as it shows the companies and the events that we've extracted.",
            "So what happens is that you get a new message or say 200 words and we extract about two or three words from that sense showed the actual thing that's going on.",
            "So for example picture is.",
            "Some companies saying profit up, for example, company X profit up properly for Company X. CEO resigns.",
            "That sort of thing obviously.",
            "Profit up is a good thing and CEO resigns is a bad thing.",
            "Now what we've been doing in this lesson 2 project is to integrate a translation function into this right in the left hand corner you can see a translate button.",
            "Um?",
            "So this is not online yet, this is just another test phase."
        ],
        [
            "What happens when you click, for example, one of the events on the right hand side on it, some great.",
            "Now you get the actual message there was that the event was extracted from and you get the option to translate into several languages.",
            "This is just a mock up, so this doesn't work."
        ],
        [
            "You can select your language."
        ],
        [
            "Little side of translating and then."
        ],
        [
            "Results.",
            "However, this is not live yet for a reason.",
            "It was mentioned before today that machine translation with Cisco Machine translation is either surprisingly good or surprisingly bad.",
            "Andy let some tedious project.",
            "We've had surprisingly good results with with our test sets.",
            "However, with the business and finance new sets we've had some problems and what we have done so now in our training data or training sets was not actually up to standards, so we could not publish this live yet.",
            "It was actually surprisingly bad.",
            "Now there are several reasons for that, so we'll go through that in the next slide.",
            "1st, I'll tell you what we do with the empty on the new sensors website.",
            "So on the one hand we use empty to translate the outputs.",
            "Just very simple events like I showed in the slide before."
        ],
        [
            "Just to give our viewers another place that is a native English speaker, so some people might wonder Office pretty clear, but there are some terms in that are very specific and if you're not familiar with the English term, you might want to translate that into their own language.",
            "So that's a service to our customers.",
            "That's that's one of the reasons we're using this.",
            "The other reason is."
        ],
        [
            "And that's a bit more technical is that we would like to use other kinds of languages as inputs for training for semantic analysis.",
            "So we've been doing now is using English language financial news.",
            "Which covers most important activities in the world.",
            "But if you're basically trading in China or in Russia, for example, you might want to be ahead of your competitors and get this news from the source.",
            "In Russian, for example, not all news surfaces in Russian 1st and then English, but for the most important equities, the English one is actually first, but if you're dealing in smaller equities than might very well be that there is news in the local language about the company or surroundings of the company.",
            "It's relevant to you.",
            "It might give you a baton advantage towards your competitors.",
            "So what we'd like to do is to slowly integrate several languages that we consider relevant for our customers into the system, and then translate them into English, and then submit these translations for semantic analysis.",
            "Now, of course, we're all language experts, so I think you are noted problems in this sort of thing.",
            "Semantic analysis or sentiment extraction is a pretty sensitive thing, and it is not entirely clear to us at least as normal language or not non translation experts.",
            "If translation will lead to the right kind of event extraction, it might.",
            "There might be subtleties in phrasings and news that leads to a lot of different translations."
        ],
        [
            "Which might lead to problems for trailers.",
            "So to get back to the standards slide.",
            "We need several things I asked around in our consortium.",
            "What is what is required?",
            "What were the main problems that we run into?",
            "One of us, one of the problems for us as a user, was the integration of the empty system.",
            "We need some sort of standard API or several kinds of APIs.",
            "I believe for this I heard among experts that's Google.",
            "the Google APIs are pretty big API, but that does not live up to our expectations with regard to very specific SMT sets, such as specific finance and business news SMT system.",
            "So there might be some more information added to it, and I think it's important for us as users of empty.",
            "That's the MC community reaches some sort of standards to standard API that's, at least it involves a lot of things that are demanded by the outside the outside world.",
            "Another big important problem that we run into value basis is the data collection.",
            "So as I said we are providers of news and we have quite a lot of back stock on news.",
            "But this news is not delivered as a as a parallel corpus.",
            "So we got news in English and we have to just find the relevant use in Dutch.",
            "And that proved to be so much work that we shifted our work to our attention to something else.",
            "This is just more manageable.",
            "Part of this project.",
            "So what we did is we focused our attention on financial news reports.",
            "These are annual reports, for example, that now then I published most big companies have these in several languages for the shareholders.",
            "And these are usually published in English and in the native language of the company.",
            "We thought this would be.",
            "A very good source for parallel corpora.",
            "Corpora, however, not all translations in these are equally useful for us.",
            "They contain the right kind of information that contain the numbers.",
            "What happens to the company that here, but turns out phrasing is rather different in some of these, some companies have a word by word translation, almost while others taken very free and make more of an interpretation of the text in English and then with normal language around.",
            "And this turned out to be very problematic, and this, I think is the main reason why.",
            "Find out some business news, translate some tea sets is not yet up to standards for us to use Santa presents for our customers.",
            "So to wrap up, in general there are two kinds of things that I think are needed from the community.",
            "Is the Accessibility of the whole thing, for example standard APIs or perhaps some standard website where we can find several kinds of language services?",
            "'cause if you want Chinese now, it's kind of a haystack to find somebody who actually delivers a work in Chinese to English into system.",
            "Another thing is the quality assurance tester with the lights out and provided.",
            "How do you know whether dates are good?",
            "Now that could be straight from work and I missed the point, but that's so actually use automatic scraping.",
            "It could be from already empty translated text or from human translations.",
            "There needs to be some sort of markup for that so that we can recognize what is quality data and was not.",
            "This has been rehashed, so to speak.",
            "Yeah, that's sorted."
        ],
        [
            "I'll be happy to answer all your questions later."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Several things, but we do not do translation.",
                    "label": 0
                },
                {
                    "sent": "So you might wonder what I'm doing here and that's what I'm going to tell you.",
                    "label": 0
                },
                {
                    "sent": "We were founded in 2000 and Overspecializing.",
                    "label": 1
                },
                {
                    "sent": "There's two kinds of software.",
                    "label": 0
                },
                {
                    "sent": "We do more things, but these are two main lines which is financial software and healthcare software.",
                    "label": 0
                },
                {
                    "sent": "Those are two kinds of software that's are considered very important by people, so we need accurate and fairly robust solutions for that.",
                    "label": 0
                },
                {
                    "sent": "In finance is very important.",
                    "label": 0
                },
                {
                    "sent": "People do not lose money, and because I want to gain money and in the healthcare sector is very important that people do not lose their lives.",
                    "label": 0
                },
                {
                    "sent": "So what we do is make very specialized software for these two kinds of sectors will be talking today about the financial sector in order.",
                    "label": 0
                },
                {
                    "sent": "So far you make for financial sector and our flagship products.",
                    "label": 0
                },
                {
                    "sent": "Our core products is called Viewer Pro which is a semantic analysis platform that's interprets or analyzes financial news.",
                    "label": 1
                },
                {
                    "sent": "What happens with banks and trading houses?",
                    "label": 0
                },
                {
                    "sent": "Gets a lot of news, for example, the Dow Jones News Stream can deliver up to 10,000 used messages per day, and it's considered that financial news contains information's relevance to what's happening.",
                    "label": 0
                },
                {
                    "sent": "Is it better?",
                    "label": 0
                },
                {
                    "sent": "So with these amounts of news messages people needs under very many people reading it, something 10,000 messages per day.",
                    "label": 0
                },
                {
                    "sent": "There is quite a lot.",
                    "label": 0
                },
                {
                    "sent": "These are not big messages that consists of say 200 words or so, but it's nevertheless.",
                    "label": 0
                },
                {
                    "sent": "This is a lot of information and if you deal with many equities this is.",
                    "label": 0
                },
                {
                    "sent": "You should still go through everything if you deal and only few equities, one portfolio or so you need to discard a lot, so a software solution is necessary to be very useful to quickly go through things and to process news as soon as it comes in.",
                    "label": 0
                },
                {
                    "sent": "And what typically happens is that we analyze news automatically using semantic analysis within few milliseconds.",
                    "label": 0
                },
                {
                    "sent": "We process the news message as soon as it comes in, which social reading time and traders can interact automatically or instantly on what's happening on the market.",
                    "label": 0
                },
                {
                    "sent": "It's not fast enough for the ultra low latency trading, so it's not not very suitable for your submitted second algo system, but for anything in the second after that, it's the natural millions for banks and trading houses and hedge funds etc.",
                    "label": 0
                },
                {
                    "sent": "Um, one of these spinoff products from this year Pro system is new sentiments as EU.",
                    "label": 0
                },
                {
                    "sent": "And this is something that's.",
                    "label": 0
                },
                {
                    "sent": "Specially where language and translation comes in, and this is what I'll be discussing today.",
                    "label": 0
                },
                {
                    "sent": "Or should we be humble be discussing today?",
                    "label": 0
                },
                {
                    "sent": "For those of you interested, can go to the website, www.newcms.edu to get a quick glance.",
                    "label": 1
                },
                {
                    "sent": "That's how it's kind of.",
                    "label": 0
                },
                {
                    "sent": "Image this produces this financial news sentiment analysis.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So apart from doing commercial work with local banks, as I said, similar participants in research, this is mostly funded by EU or via national funds.",
                    "label": 0
                },
                {
                    "sent": "Summer collaborates with several leading research institutes for several universities, for example, as well as the Founder Institute for Financial Mathematics.",
                    "label": 1
                },
                {
                    "sent": "In Germany.",
                    "label": 0
                },
                {
                    "sent": "And yeah, last 10 years we invested, so it's quite a small company.",
                    "label": 0
                },
                {
                    "sent": "So 5.8 million euros might not seem too much, but for a company of 15 people this is quite a lot of money.",
                    "label": 0
                },
                {
                    "sent": "So we do invest in research to stay on top of our market and to make sure our semantic analysis software is.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As useful as it could be to our clients.",
                    "label": 0
                },
                {
                    "sent": "Analysis is quite solid, versatile technology, so it is suitable for a wide range of R&D innovation projects ranging from ontologies, which is what we are very interested in.",
                    "label": 0
                },
                {
                    "sent": "'cause that's that's the core of our business language.",
                    "label": 0
                },
                {
                    "sent": "Processing technologies, creation of new financial tools, social media, etc etc.",
                    "label": 1
                },
                {
                    "sent": "Quite a number of.",
                    "label": 0
                },
                {
                    "sent": "Projects we involved in logos on the sides show a few of those.",
                    "label": 0
                },
                {
                    "sent": "And the lesson 3 projects that's shown here is the one I'll be talking about today because that's the one that involves statistical machine translation.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If you have any questions about the photo project that we're doing will be happy to answer you during any of the brakes, and I can also show you a bit more about the new sentiments of websites and our new app so I can show you.",
                    "label": 0
                },
                {
                    "sent": "So someone was also involved in the lesson 2 projects, which is a statistical machine translation projects from the body FT-7 program.",
                    "label": 0
                },
                {
                    "sent": "And focus of this project is small European languages such as Latvian and Dutch and Danish.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "For statistical machine translation, need quite a number equal of resources and experts on this field, but as far as I take it you need lots and lots of data and the smaller languages the less representative is on web, so it's harder to find resources for this.",
                    "label": 0
                },
                {
                    "sent": "One of the benefits for us at some lab is that a statistical machine translation system is capable and then topic specific translation.",
                    "label": 0
                },
                {
                    "sent": "And of course when you're dealing with business and finance news, you need something that can translate these sort of news.",
                    "label": 0
                },
                {
                    "sent": "Source of news quite accurately, especially since there's quite a lot of money involved for clients.",
                    "label": 0
                },
                {
                    "sent": "I'm just translation can easily lead to millions and millions of losses and.",
                    "label": 0
                },
                {
                    "sent": "This is not exactly what they want, so.",
                    "label": 0
                },
                {
                    "sent": "It would be interesting for us to to have language translation systems on board, but we need to be very careful, but this is actual technology.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So we don't want on this on this lesson T project, which is a collaboration projects.",
                    "label": 0
                },
                {
                    "sent": "It was set up by company called Tilda, which I'm sure many of you are familiar with.",
                    "label": 0
                },
                {
                    "sent": "It's called based in Latvia.",
                    "label": 0
                },
                {
                    "sent": "University of Edinburgh Zagreb Copenhagen Uppsala Company called Moravia but I've seen past one of the slides before today and I said send them.",
                    "label": 0
                },
                {
                    "sent": "Now, as I said before, someone doesn't deal with translation or empty systems.",
                    "label": 0
                },
                {
                    "sent": "You don't have any of this technology in house, so our role in the project is old or just with the outsider here in the in the technology field.",
                    "label": 0
                },
                {
                    "sent": "One of the roles we play is that we provide parallel corpora for the training of the system of the systems.",
                    "label": 0
                },
                {
                    "sent": "As I said, we had a lot of news feeds from Dow Jones and rotors and we have quite some backstock of financial news.",
                    "label": 0
                },
                {
                    "sent": "I think we have 20 years of Dow Jones back stock.",
                    "label": 0
                },
                {
                    "sent": "Which is log data.",
                    "label": 0
                },
                {
                    "sent": "There are some problems with this, which I'll be coming back to you shortly because most news notes delivered as a multilingual sets.",
                    "label": 0
                },
                {
                    "sent": "So this is rather tricky.",
                    "label": 0
                },
                {
                    "sent": "And our goal of positioning participating in this project is to integrate translation into our new sentence websites that you sent both of you that I mentioned before.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is what it's approximately looks like.",
                    "label": 0
                },
                {
                    "sent": "I don't know life with this because it's still in progress.",
                    "label": 0
                },
                {
                    "sent": "Some of you visiting the website might be experiencing problems like receiving updates or something, so I took the safe side and some screenshots.",
                    "label": 0
                },
                {
                    "sent": "To see here on the left side of the screen is a few blocks that show several companies and several several colors in several sizes.",
                    "label": 0
                },
                {
                    "sent": "Sizes indicates the amount of news that was published about the company or the equity and the color, and it gets the sentiment.",
                    "label": 0
                },
                {
                    "sent": "So always on top is our companies that have been very positively reported on in the last three hours.",
                    "label": 0
                },
                {
                    "sent": "I think everything is a 3 hour average.",
                    "label": 0
                },
                {
                    "sent": "While the bottom ones show companies that have some issues.",
                    "label": 0
                },
                {
                    "sent": "On the right side you can see the actual events, so it's it's pretty small, could be able to see it from there as it shows the companies and the events that we've extracted.",
                    "label": 0
                },
                {
                    "sent": "So what happens is that you get a new message or say 200 words and we extract about two or three words from that sense showed the actual thing that's going on.",
                    "label": 0
                },
                {
                    "sent": "So for example picture is.",
                    "label": 0
                },
                {
                    "sent": "Some companies saying profit up, for example, company X profit up properly for Company X. CEO resigns.",
                    "label": 0
                },
                {
                    "sent": "That sort of thing obviously.",
                    "label": 0
                },
                {
                    "sent": "Profit up is a good thing and CEO resigns is a bad thing.",
                    "label": 0
                },
                {
                    "sent": "Now what we've been doing in this lesson 2 project is to integrate a translation function into this right in the left hand corner you can see a translate button.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So this is not online yet, this is just another test phase.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What happens when you click, for example, one of the events on the right hand side on it, some great.",
                    "label": 0
                },
                {
                    "sent": "Now you get the actual message there was that the event was extracted from and you get the option to translate into several languages.",
                    "label": 0
                },
                {
                    "sent": "This is just a mock up, so this doesn't work.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can select your language.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Little side of translating and then.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Results.",
                    "label": 0
                },
                {
                    "sent": "However, this is not live yet for a reason.",
                    "label": 0
                },
                {
                    "sent": "It was mentioned before today that machine translation with Cisco Machine translation is either surprisingly good or surprisingly bad.",
                    "label": 0
                },
                {
                    "sent": "Andy let some tedious project.",
                    "label": 0
                },
                {
                    "sent": "We've had surprisingly good results with with our test sets.",
                    "label": 0
                },
                {
                    "sent": "However, with the business and finance new sets we've had some problems and what we have done so now in our training data or training sets was not actually up to standards, so we could not publish this live yet.",
                    "label": 0
                },
                {
                    "sent": "It was actually surprisingly bad.",
                    "label": 0
                },
                {
                    "sent": "Now there are several reasons for that, so we'll go through that in the next slide.",
                    "label": 0
                },
                {
                    "sent": "1st, I'll tell you what we do with the empty on the new sensors website.",
                    "label": 0
                },
                {
                    "sent": "So on the one hand we use empty to translate the outputs.",
                    "label": 0
                },
                {
                    "sent": "Just very simple events like I showed in the slide before.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just to give our viewers another place that is a native English speaker, so some people might wonder Office pretty clear, but there are some terms in that are very specific and if you're not familiar with the English term, you might want to translate that into their own language.",
                    "label": 0
                },
                {
                    "sent": "So that's a service to our customers.",
                    "label": 0
                },
                {
                    "sent": "That's that's one of the reasons we're using this.",
                    "label": 0
                },
                {
                    "sent": "The other reason is.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And that's a bit more technical is that we would like to use other kinds of languages as inputs for training for semantic analysis.",
                    "label": 0
                },
                {
                    "sent": "So we've been doing now is using English language financial news.",
                    "label": 0
                },
                {
                    "sent": "Which covers most important activities in the world.",
                    "label": 0
                },
                {
                    "sent": "But if you're basically trading in China or in Russia, for example, you might want to be ahead of your competitors and get this news from the source.",
                    "label": 0
                },
                {
                    "sent": "In Russian, for example, not all news surfaces in Russian 1st and then English, but for the most important equities, the English one is actually first, but if you're dealing in smaller equities than might very well be that there is news in the local language about the company or surroundings of the company.",
                    "label": 0
                },
                {
                    "sent": "It's relevant to you.",
                    "label": 0
                },
                {
                    "sent": "It might give you a baton advantage towards your competitors.",
                    "label": 0
                },
                {
                    "sent": "So what we'd like to do is to slowly integrate several languages that we consider relevant for our customers into the system, and then translate them into English, and then submit these translations for semantic analysis.",
                    "label": 1
                },
                {
                    "sent": "Now, of course, we're all language experts, so I think you are noted problems in this sort of thing.",
                    "label": 0
                },
                {
                    "sent": "Semantic analysis or sentiment extraction is a pretty sensitive thing, and it is not entirely clear to us at least as normal language or not non translation experts.",
                    "label": 0
                },
                {
                    "sent": "If translation will lead to the right kind of event extraction, it might.",
                    "label": 0
                },
                {
                    "sent": "There might be subtleties in phrasings and news that leads to a lot of different translations.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Which might lead to problems for trailers.",
                    "label": 0
                },
                {
                    "sent": "So to get back to the standards slide.",
                    "label": 0
                },
                {
                    "sent": "We need several things I asked around in our consortium.",
                    "label": 0
                },
                {
                    "sent": "What is what is required?",
                    "label": 0
                },
                {
                    "sent": "What were the main problems that we run into?",
                    "label": 0
                },
                {
                    "sent": "One of us, one of the problems for us as a user, was the integration of the empty system.",
                    "label": 0
                },
                {
                    "sent": "We need some sort of standard API or several kinds of APIs.",
                    "label": 1
                },
                {
                    "sent": "I believe for this I heard among experts that's Google.",
                    "label": 0
                },
                {
                    "sent": "the Google APIs are pretty big API, but that does not live up to our expectations with regard to very specific SMT sets, such as specific finance and business news SMT system.",
                    "label": 0
                },
                {
                    "sent": "So there might be some more information added to it, and I think it's important for us as users of empty.",
                    "label": 0
                },
                {
                    "sent": "That's the MC community reaches some sort of standards to standard API that's, at least it involves a lot of things that are demanded by the outside the outside world.",
                    "label": 0
                },
                {
                    "sent": "Another big important problem that we run into value basis is the data collection.",
                    "label": 0
                },
                {
                    "sent": "So as I said we are providers of news and we have quite a lot of back stock on news.",
                    "label": 0
                },
                {
                    "sent": "But this news is not delivered as a as a parallel corpus.",
                    "label": 0
                },
                {
                    "sent": "So we got news in English and we have to just find the relevant use in Dutch.",
                    "label": 0
                },
                {
                    "sent": "And that proved to be so much work that we shifted our work to our attention to something else.",
                    "label": 0
                },
                {
                    "sent": "This is just more manageable.",
                    "label": 0
                },
                {
                    "sent": "Part of this project.",
                    "label": 0
                },
                {
                    "sent": "So what we did is we focused our attention on financial news reports.",
                    "label": 0
                },
                {
                    "sent": "These are annual reports, for example, that now then I published most big companies have these in several languages for the shareholders.",
                    "label": 0
                },
                {
                    "sent": "And these are usually published in English and in the native language of the company.",
                    "label": 0
                },
                {
                    "sent": "We thought this would be.",
                    "label": 0
                },
                {
                    "sent": "A very good source for parallel corpora.",
                    "label": 0
                },
                {
                    "sent": "Corpora, however, not all translations in these are equally useful for us.",
                    "label": 0
                },
                {
                    "sent": "They contain the right kind of information that contain the numbers.",
                    "label": 0
                },
                {
                    "sent": "What happens to the company that here, but turns out phrasing is rather different in some of these, some companies have a word by word translation, almost while others taken very free and make more of an interpretation of the text in English and then with normal language around.",
                    "label": 0
                },
                {
                    "sent": "And this turned out to be very problematic, and this, I think is the main reason why.",
                    "label": 0
                },
                {
                    "sent": "Find out some business news, translate some tea sets is not yet up to standards for us to use Santa presents for our customers.",
                    "label": 0
                },
                {
                    "sent": "So to wrap up, in general there are two kinds of things that I think are needed from the community.",
                    "label": 0
                },
                {
                    "sent": "Is the Accessibility of the whole thing, for example standard APIs or perhaps some standard website where we can find several kinds of language services?",
                    "label": 0
                },
                {
                    "sent": "'cause if you want Chinese now, it's kind of a haystack to find somebody who actually delivers a work in Chinese to English into system.",
                    "label": 0
                },
                {
                    "sent": "Another thing is the quality assurance tester with the lights out and provided.",
                    "label": 0
                },
                {
                    "sent": "How do you know whether dates are good?",
                    "label": 0
                },
                {
                    "sent": "Now that could be straight from work and I missed the point, but that's so actually use automatic scraping.",
                    "label": 0
                },
                {
                    "sent": "It could be from already empty translated text or from human translations.",
                    "label": 1
                },
                {
                    "sent": "There needs to be some sort of markup for that so that we can recognize what is quality data and was not.",
                    "label": 0
                },
                {
                    "sent": "This has been rehashed, so to speak.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's sorted.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'll be happy to answer all your questions later.",
                    "label": 0
                }
            ]
        }
    }
}