{
    "id": "6hrfyjsb4vszuyjhbabyzebo5nlbog6w",
    "title": "Automated Fine-grained Trust Assessment in Federated Knowledge Bases",
    "info": {
        "author": [
            "Andreas Nolle, Albstadt-Sigmaringen University"
        ],
        "published": "Nov. 28, 2017",
        "recorded": "October 2017",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2017_nolle_knowledge_bases/",
    "segmentation": [
        [
            "First I will introduce the."
        ],
        [
            "Context of our work, then I will explain how the conflict graph and the corresponding repair is generated according to our previous approach.",
            "After that I will explain in detail how the trust values are calculated at different levels of granularity.",
            "And before concluding the work, I will show some results of our evaluation, so they can't."
        ],
        [
            "Next level up, our work is Federated data or information integration over a set of distributed and hit your genius data sources.",
            "We apply a central schema that serves as a concept review and consequently comprises and extends the semantics of each integrated data source.",
            "Even though each integrated data source is sort of consistent, the more data sources are integrated, the higher the probability of inconsistency, right?"
        ],
        [
            "Federated Knowledge base can be formally defined as.",
            "Tee box part that comprised the Central tee box.",
            "And the key boxes of each integrate data source, and the consequent mediabox part is the union of all a boxes.",
            "A Federated assertion is simply the assertion itself plus an index indicating the data source in which the assertion is stated.",
            "And finally, our approach is based on delight A, which is specially designed for dealing efficiently with you J boxes.",
            "I don't want to go into any formal details, but it is worth to mention that.",
            "The box axioms come can be normalized such that we can only have an array or binary conflicts.",
            "So."
        ],
        [
            "The challenge is now to find a consistent state of the Federated Knowledge Base.",
            "In our previous work, we addressed the resolution of conflicts.",
            "But this always implies loss of information because we have to delete the assertions that are part of the repair.",
            "We now follow an alternative approach by data mining trust values for individual surgeons for the signature elements according to each integrated data source and for each indicated data source as well."
        ],
        [
            "Assigning trust values at these different levels of granularity enables the transformation of our knowledge base into a probabilistic one and consequently their representation of uncertain knowledge and the application of power consistent logics."
        ],
        [
            "So let me first introduce an example that is used through the whole presentation.",
            "So assume you have a central schema describing the domain of library science.",
            "So for example, we have books and papers that are disjoint, but both are publications and we have 4 examples.",
            "Light sets that are disjoint from publications and we have three distributed data sources A1A2 and A3, comprising some assertions that are.",
            "Produce some conflicts."
        ],
        [
            "So we assume that all tee box axioms are correct, so we are only interested in the a box part of the explanation for the inconsistency which we call minimal inconsistent consistency preserving sub box for short Meza.",
            "And here we have a conflict between FR3 and the surgeons, two and gamma 3.",
            "And below you will find the explanation for this inconsistency."
        ],
        [
            "He under conceit the conflict graph that is generated according to the mythos, so each assertion each conflict in a certain is represented by a node, and the conflicts between US surgeons is represented by an edge.",
            "To resolve these conflicts, we applied in our previous approach majority voting, which is based on the assumption that corrector surgeons or come more frequently.",
            "And as you can see above, the notes detached notes are part of the repair and resolve.",
            "Most of the conflicts, but there is no guarantee that all conflicts are resolved.",
            "So for example, better 8, 7 and gamma 8.",
            "And."
        ],
        [
            "We we could measure a high position of the calculated repair with up to 97%.",
            "Now use this statistical evidence that we gathered by our previous repair to generate or calculate the trust release.",
            "For that we divide the conflicting assertions into three categories.",
            "First is likely first assertions that are assertions part of the repair, then we have likely true as."
        ],
        [
            "Questions which are conflicting assertions that become conflict free by removing the repair, and we have always."
        ],
        [
            "Conflicting assertions."
        ],
        [
            "Further, we have correct assertions, which are assertions that are confirmed by another assertion.",
            "That is not involved in any conflict and stated by another data source."
        ],
        [
            "Now we can calculate the signature accuracy, which is roughly defined by 1 -- 2 ratio of incorrect assertions with respect to the total number of conflicting incorrect assertions.",
            "So we just use the number of likely first assertions plus the ratio of being true for all remaining conflicting assertions divided by the number of conflicting and correct decisions."
        ],
        [
            "So back to our example.",
            "The.",
            "Signature currency for the element paper in data source one is calculated by 1 -- 2, which is the number of likely false assertions divided by 4 number of.",
            "Conflict ING and correct the surgeons so we have a signature courtesy for the Element paper in data source, one or 50%.",
            "You can see the number of the the certain currency for all the remaining signature elements, and here we avoid the wording, trust or probability because later on we calculate the signature, trusts the signature currency just prior knowledge that we take to calculate the trust values.",
            "So to calculate the trust values, we can."
        ],
        [
            "Other conflict rough as a Markov network.",
            "We are.",
            "Each node is again represented representing in search and as a binary variable, which can be true or false.",
            "Then we have the conflicts again by represented edges.",
            "And we have a condition condition for each conflict such that only one assertion of a conflict can be true.",
            "To compute the marginal probabilities respectively the assertion trust for each assertion, we have to calculate the marginal probabilities in the network, which is time exponential in the number of nodes.",
            "So we use Gibbs sampling to approximate them.",
            "In Gibbs sampling, each node is sampled randomly and this state is changed according to the signature.",
            "Crazy that we calculated previously.",
            "And here you can see we only have the flipping if all neighbors which is in this case BX is false is if one of the neighbors is true or we cannot flip the state.",
            "And since we always already calculated repair with the high precision we used as starting point for the Gibbs sampling part.",
            "Plus a random repair for all remaining conflicts."
        ],
        [
            "After the sampling, the probability is simply calculated by the number of states in which an assertion is true divided by the number of samplings.",
            "So in our example, we initialize the Markov network according to the repair, then add a random repair for all the remaining parts.",
            "And starting by selecting the notes for example, I found three.",
            "The state won't be unchecked, will be unchanged because some neighbors are true and four."
        ],
        [
            "Example gamma Four, which can be changed according to the.",
            "Signature courtesy of the elements light set in data Source 3.",
            "And for example, we will get a flip of the of its state."
        ],
        [
            "After that we can calculate the accuracy of the surgeons.",
            "For example, for the search and I for one.",
            "By counting the number of states, which is would be could be for example, a 660 divided by the number of samples, 1000 will get their probability of 66% for the search and trust.",
            "As you can see above, the.",
            "Assertions that are declared as correct got a probability of 100% and we only have one assertion A8, which for which the trust value is undefined.",
            "Because I for eight is neither in conflict with any other research.",
            "Annoyed as confirmed by another.",
            "So it is not correct.",
            "For that, we now calculate the signature trust."
        ],
        [
            "Which is simply the average of all surgeons comprising the same signature element.",
            "So in our example, the signature trust for the Element paper in data source one is just the average of all assertion trusts for positions that use also the same signature element paper.",
            "So we gather signatures trust for paper of 63%.",
            "And we can now use this trust."
        ],
        [
            "For the.",
            "A certain A8 for which we won't have any certain trust.",
            "Now as you."
        ],
        [
            "That a one data source A1 comprising additional assertion.",
            "In this case I stated that I ate is a slight set since we not able to calculate the search and trust because this assertion is not involved in any conflict.",
            "Notice correct?",
            "We also not able to calculate the.",
            "Signature Trust because we only have one element for which we don't have trust value.",
            "So for that case we now calculate the data source trust, which is simply."
        ],
        [
            "Given by the the average of the weighted sum of signature trusts.",
            "So back to our example, we multiplied the signature, trust of paper by 5 because we have 5 statements stating some paper certain and we have three statements stating using the element is part of.",
            "So we got an average of 63% for data source A1.",
            "And we can now use this trust value for the signature element slide set and for the assertion Alpha X as well."
        ],
        [
            "In our evaluation, we use a data set out of the domain of library science, comprising 4 energy sources.",
            "The Federated Data Knowledge Base comprises 284 million assertions, and we our previous approach generates 80,000,000 meters for the inconsistency.",
            "Applying our approach of majority voting resource up to 40% of the conflicts but with a high position of 97%.",
            "Applying now.",
            "I'll"
        ],
        [
            "Approach of trust value calculation.",
            "We will get these trust values and having a detailed look.",
            "For example at data Source a four, we got a really high trust value so we can general trust data source a four but.",
            "Now, having a more detailed look at its signature trusts, we have two elements with a high trust, but one element with a really low trust so.",
            "We can trust I file for in general, but not in this special case."
        ],
        [
            "We have done some further analysis of the generated trust values.",
            "Here you can see the distribution of trust values assigned for on the assertions that are part of the repair.",
            "And.",
            "This since most of them got a really low trust value.",
            "This confirmed our previously measured precision of the repair of 97%, but we have 1% of the assertions that are part of the repair that gotta trust value greater than 50%.",
            "So what you have done is selecting 100 assertions out of the range of the trust value greater than 80% and evaluate them manually.",
            "For that we could measure precision of 81%."
        ],
        [
            "So we proposed a automated approach for fine grained trust assessment at different levels of granularity.",
            "By exploiting the conflict graph and the statistical evidence that we gathered by our previous approach of majority voting.",
            "And finally, we could measure a higher really high position of the calculated trust values.",
            "Our future work will also the consideration of entailment relations between the surgeons during the Gibbs sampling part.",
            "And we are still looking for some datasets for further evaluations.",
            "OK, thank you."
        ],
        [
            "I was thinking what is the mechanism?",
            "Have you any answer?",
            "What is the mechanism to decide whether something is a data source or not or if I as a data provider might decide to make my data set into three data sources or one and this might have an effect on how trustworthy they end up being.",
            "So is there effect of how big I make my data sources whether decide to split up into several or one?",
            "And whether or not I include a data source or not, or if you would make this system open and everybody could add data sources, would it somehow be able to break the system?",
            "I guess to some kind of cell questions, intermittent pick.",
            "One to answer.",
            "Thanks.",
            "So you mean with respect to the precision if we if we add more data sources we got a higher position for the calculated trust.",
            "Listen for the calculated repair.",
            "I mean, if you talk about trust and you're also assuming that there might be malicious players right?",
            "Also, or who just very low quality data to try to trust to somehow get into our way?",
            "Or is there not a scenario that you're considering the last question, please?",
            "Again.",
            "When it's about trust, it's often also that you have maybe players or data providers that are not playing by the rules may be right and try to game the system and.",
            "I know I have a data set that is not very good, but I kind of clone it 10 times and then it has high agreement with other datasets and then suddenly gets a good trust value.",
            "Could that happen?",
            "If you leave the system open and everybody can add an additional data source right, this could be a problem.",
            "In that case, how you do your thing?",
            "You can prevent the problem because you will have low precision, right, right?",
            "Right, and the position is calculated objectively, but if you add curb data source several times, you won't.",
            "You will trust in the data source in this corrupt data source, right?",
            "Because actually you can have subsets of the same data source and they will generate also the same problem, right?",
            "OK, in one of the earlier slides there was a step where you calculate this minimally absolutely certain subsets right now on contradicting substances measures, yes.",
            "Sit down and distribute away.",
            "Or does someone have to bring everything together and figure out what is non contradicting.",
            "Again, if you and question is to clearly all the question is how can they be calculated without bringing all the data together in one store and comparing them as we calculated in a distributed manner.",
            "You have to treat all data sources according to its potential to generate some conflicts.",
            "So if you have for example using.",
            "A signature element that cannot that it's not involved in any disjoint axiom.",
            "It can cannot be produced any.",
            "Any conflict, right?",
            "So we don't have to create these parts.",
            "I'm in a conflict, could be out of.",
            "Anything I mean?",
            "But OK, so there is no specific algorithm you're proposing gives us a figure out a way to find this minimal set, or is there something more specific in the paper?",
            "I don't get the question.",
            "Is there an algorithm for creating the Mrs, right?",
            "This is part of our previous approach.",
            "Refers in the background work OK, Yeah?"
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "First I will introduce the.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Context of our work, then I will explain how the conflict graph and the corresponding repair is generated according to our previous approach.",
                    "label": 1
                },
                {
                    "sent": "After that I will explain in detail how the trust values are calculated at different levels of granularity.",
                    "label": 0
                },
                {
                    "sent": "And before concluding the work, I will show some results of our evaluation, so they can't.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Next level up, our work is Federated data or information integration over a set of distributed and hit your genius data sources.",
                    "label": 1
                },
                {
                    "sent": "We apply a central schema that serves as a concept review and consequently comprises and extends the semantics of each integrated data source.",
                    "label": 1
                },
                {
                    "sent": "Even though each integrated data source is sort of consistent, the more data sources are integrated, the higher the probability of inconsistency, right?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Federated Knowledge base can be formally defined as.",
                    "label": 1
                },
                {
                    "sent": "Tee box part that comprised the Central tee box.",
                    "label": 0
                },
                {
                    "sent": "And the key boxes of each integrate data source, and the consequent mediabox part is the union of all a boxes.",
                    "label": 0
                },
                {
                    "sent": "A Federated assertion is simply the assertion itself plus an index indicating the data source in which the assertion is stated.",
                    "label": 0
                },
                {
                    "sent": "And finally, our approach is based on delight A, which is specially designed for dealing efficiently with you J boxes.",
                    "label": 1
                },
                {
                    "sent": "I don't want to go into any formal details, but it is worth to mention that.",
                    "label": 0
                },
                {
                    "sent": "The box axioms come can be normalized such that we can only have an array or binary conflicts.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The challenge is now to find a consistent state of the Federated Knowledge Base.",
                    "label": 1
                },
                {
                    "sent": "In our previous work, we addressed the resolution of conflicts.",
                    "label": 0
                },
                {
                    "sent": "But this always implies loss of information because we have to delete the assertions that are part of the repair.",
                    "label": 0
                },
                {
                    "sent": "We now follow an alternative approach by data mining trust values for individual surgeons for the signature elements according to each integrated data source and for each indicated data source as well.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Assigning trust values at these different levels of granularity enables the transformation of our knowledge base into a probabilistic one and consequently their representation of uncertain knowledge and the application of power consistent logics.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me first introduce an example that is used through the whole presentation.",
                    "label": 0
                },
                {
                    "sent": "So assume you have a central schema describing the domain of library science.",
                    "label": 1
                },
                {
                    "sent": "So for example, we have books and papers that are disjoint, but both are publications and we have 4 examples.",
                    "label": 0
                },
                {
                    "sent": "Light sets that are disjoint from publications and we have three distributed data sources A1A2 and A3, comprising some assertions that are.",
                    "label": 1
                },
                {
                    "sent": "Produce some conflicts.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we assume that all tee box axioms are correct, so we are only interested in the a box part of the explanation for the inconsistency which we call minimal inconsistent consistency preserving sub box for short Meza.",
                    "label": 1
                },
                {
                    "sent": "And here we have a conflict between FR3 and the surgeons, two and gamma 3.",
                    "label": 0
                },
                {
                    "sent": "And below you will find the explanation for this inconsistency.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "He under conceit the conflict graph that is generated according to the mythos, so each assertion each conflict in a certain is represented by a node, and the conflicts between US surgeons is represented by an edge.",
                    "label": 0
                },
                {
                    "sent": "To resolve these conflicts, we applied in our previous approach majority voting, which is based on the assumption that corrector surgeons or come more frequently.",
                    "label": 1
                },
                {
                    "sent": "And as you can see above, the notes detached notes are part of the repair and resolve.",
                    "label": 0
                },
                {
                    "sent": "Most of the conflicts, but there is no guarantee that all conflicts are resolved.",
                    "label": 1
                },
                {
                    "sent": "So for example, better 8, 7 and gamma 8.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We we could measure a high position of the calculated repair with up to 97%.",
                    "label": 0
                },
                {
                    "sent": "Now use this statistical evidence that we gathered by our previous repair to generate or calculate the trust release.",
                    "label": 0
                },
                {
                    "sent": "For that we divide the conflicting assertions into three categories.",
                    "label": 1
                },
                {
                    "sent": "First is likely first assertions that are assertions part of the repair, then we have likely true as.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Questions which are conflicting assertions that become conflict free by removing the repair, and we have always.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Conflicting assertions.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Further, we have correct assertions, which are assertions that are confirmed by another assertion.",
                    "label": 0
                },
                {
                    "sent": "That is not involved in any conflict and stated by another data source.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now we can calculate the signature accuracy, which is roughly defined by 1 -- 2 ratio of incorrect assertions with respect to the total number of conflicting incorrect assertions.",
                    "label": 0
                },
                {
                    "sent": "So we just use the number of likely first assertions plus the ratio of being true for all remaining conflicting assertions divided by the number of conflicting and correct decisions.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So back to our example.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Signature currency for the element paper in data source one is calculated by 1 -- 2, which is the number of likely false assertions divided by 4 number of.",
                    "label": 0
                },
                {
                    "sent": "Conflict ING and correct the surgeons so we have a signature courtesy for the Element paper in data source, one or 50%.",
                    "label": 0
                },
                {
                    "sent": "You can see the number of the the certain currency for all the remaining signature elements, and here we avoid the wording, trust or probability because later on we calculate the signature, trusts the signature currency just prior knowledge that we take to calculate the trust values.",
                    "label": 0
                },
                {
                    "sent": "So to calculate the trust values, we can.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Other conflict rough as a Markov network.",
                    "label": 1
                },
                {
                    "sent": "We are.",
                    "label": 0
                },
                {
                    "sent": "Each node is again represented representing in search and as a binary variable, which can be true or false.",
                    "label": 0
                },
                {
                    "sent": "Then we have the conflicts again by represented edges.",
                    "label": 0
                },
                {
                    "sent": "And we have a condition condition for each conflict such that only one assertion of a conflict can be true.",
                    "label": 0
                },
                {
                    "sent": "To compute the marginal probabilities respectively the assertion trust for each assertion, we have to calculate the marginal probabilities in the network, which is time exponential in the number of nodes.",
                    "label": 1
                },
                {
                    "sent": "So we use Gibbs sampling to approximate them.",
                    "label": 0
                },
                {
                    "sent": "In Gibbs sampling, each node is sampled randomly and this state is changed according to the signature.",
                    "label": 0
                },
                {
                    "sent": "Crazy that we calculated previously.",
                    "label": 0
                },
                {
                    "sent": "And here you can see we only have the flipping if all neighbors which is in this case BX is false is if one of the neighbors is true or we cannot flip the state.",
                    "label": 0
                },
                {
                    "sent": "And since we always already calculated repair with the high precision we used as starting point for the Gibbs sampling part.",
                    "label": 0
                },
                {
                    "sent": "Plus a random repair for all remaining conflicts.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "After the sampling, the probability is simply calculated by the number of states in which an assertion is true divided by the number of samplings.",
                    "label": 0
                },
                {
                    "sent": "So in our example, we initialize the Markov network according to the repair, then add a random repair for all the remaining parts.",
                    "label": 0
                },
                {
                    "sent": "And starting by selecting the notes for example, I found three.",
                    "label": 0
                },
                {
                    "sent": "The state won't be unchecked, will be unchanged because some neighbors are true and four.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Example gamma Four, which can be changed according to the.",
                    "label": 0
                },
                {
                    "sent": "Signature courtesy of the elements light set in data Source 3.",
                    "label": 0
                },
                {
                    "sent": "And for example, we will get a flip of the of its state.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "After that we can calculate the accuracy of the surgeons.",
                    "label": 0
                },
                {
                    "sent": "For example, for the search and I for one.",
                    "label": 0
                },
                {
                    "sent": "By counting the number of states, which is would be could be for example, a 660 divided by the number of samples, 1000 will get their probability of 66% for the search and trust.",
                    "label": 0
                },
                {
                    "sent": "As you can see above, the.",
                    "label": 0
                },
                {
                    "sent": "Assertions that are declared as correct got a probability of 100% and we only have one assertion A8, which for which the trust value is undefined.",
                    "label": 0
                },
                {
                    "sent": "Because I for eight is neither in conflict with any other research.",
                    "label": 0
                },
                {
                    "sent": "Annoyed as confirmed by another.",
                    "label": 0
                },
                {
                    "sent": "So it is not correct.",
                    "label": 0
                },
                {
                    "sent": "For that, we now calculate the signature trust.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which is simply the average of all surgeons comprising the same signature element.",
                    "label": 0
                },
                {
                    "sent": "So in our example, the signature trust for the Element paper in data source one is just the average of all assertion trusts for positions that use also the same signature element paper.",
                    "label": 0
                },
                {
                    "sent": "So we gather signatures trust for paper of 63%.",
                    "label": 0
                },
                {
                    "sent": "And we can now use this trust.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For the.",
                    "label": 0
                },
                {
                    "sent": "A certain A8 for which we won't have any certain trust.",
                    "label": 0
                },
                {
                    "sent": "Now as you.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That a one data source A1 comprising additional assertion.",
                    "label": 0
                },
                {
                    "sent": "In this case I stated that I ate is a slight set since we not able to calculate the search and trust because this assertion is not involved in any conflict.",
                    "label": 0
                },
                {
                    "sent": "Notice correct?",
                    "label": 0
                },
                {
                    "sent": "We also not able to calculate the.",
                    "label": 0
                },
                {
                    "sent": "Signature Trust because we only have one element for which we don't have trust value.",
                    "label": 0
                },
                {
                    "sent": "So for that case we now calculate the data source trust, which is simply.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Given by the the average of the weighted sum of signature trusts.",
                    "label": 0
                },
                {
                    "sent": "So back to our example, we multiplied the signature, trust of paper by 5 because we have 5 statements stating some paper certain and we have three statements stating using the element is part of.",
                    "label": 0
                },
                {
                    "sent": "So we got an average of 63% for data source A1.",
                    "label": 1
                },
                {
                    "sent": "And we can now use this trust value for the signature element slide set and for the assertion Alpha X as well.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In our evaluation, we use a data set out of the domain of library science, comprising 4 energy sources.",
                    "label": 0
                },
                {
                    "sent": "The Federated Data Knowledge Base comprises 284 million assertions, and we our previous approach generates 80,000,000 meters for the inconsistency.",
                    "label": 0
                },
                {
                    "sent": "Applying our approach of majority voting resource up to 40% of the conflicts but with a high position of 97%.",
                    "label": 0
                },
                {
                    "sent": "Applying now.",
                    "label": 0
                },
                {
                    "sent": "I'll",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Approach of trust value calculation.",
                    "label": 0
                },
                {
                    "sent": "We will get these trust values and having a detailed look.",
                    "label": 1
                },
                {
                    "sent": "For example at data Source a four, we got a really high trust value so we can general trust data source a four but.",
                    "label": 0
                },
                {
                    "sent": "Now, having a more detailed look at its signature trusts, we have two elements with a high trust, but one element with a really low trust so.",
                    "label": 0
                },
                {
                    "sent": "We can trust I file for in general, but not in this special case.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have done some further analysis of the generated trust values.",
                    "label": 0
                },
                {
                    "sent": "Here you can see the distribution of trust values assigned for on the assertions that are part of the repair.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "This since most of them got a really low trust value.",
                    "label": 0
                },
                {
                    "sent": "This confirmed our previously measured precision of the repair of 97%, but we have 1% of the assertions that are part of the repair that gotta trust value greater than 50%.",
                    "label": 0
                },
                {
                    "sent": "So what you have done is selecting 100 assertions out of the range of the trust value greater than 80% and evaluate them manually.",
                    "label": 0
                },
                {
                    "sent": "For that we could measure precision of 81%.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we proposed a automated approach for fine grained trust assessment at different levels of granularity.",
                    "label": 1
                },
                {
                    "sent": "By exploiting the conflict graph and the statistical evidence that we gathered by our previous approach of majority voting.",
                    "label": 1
                },
                {
                    "sent": "And finally, we could measure a higher really high position of the calculated trust values.",
                    "label": 0
                },
                {
                    "sent": "Our future work will also the consideration of entailment relations between the surgeons during the Gibbs sampling part.",
                    "label": 0
                },
                {
                    "sent": "And we are still looking for some datasets for further evaluations.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I was thinking what is the mechanism?",
                    "label": 0
                },
                {
                    "sent": "Have you any answer?",
                    "label": 0
                },
                {
                    "sent": "What is the mechanism to decide whether something is a data source or not or if I as a data provider might decide to make my data set into three data sources or one and this might have an effect on how trustworthy they end up being.",
                    "label": 0
                },
                {
                    "sent": "So is there effect of how big I make my data sources whether decide to split up into several or one?",
                    "label": 0
                },
                {
                    "sent": "And whether or not I include a data source or not, or if you would make this system open and everybody could add data sources, would it somehow be able to break the system?",
                    "label": 0
                },
                {
                    "sent": "I guess to some kind of cell questions, intermittent pick.",
                    "label": 0
                },
                {
                    "sent": "One to answer.",
                    "label": 0
                },
                {
                    "sent": "Thanks.",
                    "label": 0
                },
                {
                    "sent": "So you mean with respect to the precision if we if we add more data sources we got a higher position for the calculated trust.",
                    "label": 0
                },
                {
                    "sent": "Listen for the calculated repair.",
                    "label": 0
                },
                {
                    "sent": "I mean, if you talk about trust and you're also assuming that there might be malicious players right?",
                    "label": 0
                },
                {
                    "sent": "Also, or who just very low quality data to try to trust to somehow get into our way?",
                    "label": 0
                },
                {
                    "sent": "Or is there not a scenario that you're considering the last question, please?",
                    "label": 0
                },
                {
                    "sent": "Again.",
                    "label": 0
                },
                {
                    "sent": "When it's about trust, it's often also that you have maybe players or data providers that are not playing by the rules may be right and try to game the system and.",
                    "label": 0
                },
                {
                    "sent": "I know I have a data set that is not very good, but I kind of clone it 10 times and then it has high agreement with other datasets and then suddenly gets a good trust value.",
                    "label": 0
                },
                {
                    "sent": "Could that happen?",
                    "label": 0
                },
                {
                    "sent": "If you leave the system open and everybody can add an additional data source right, this could be a problem.",
                    "label": 0
                },
                {
                    "sent": "In that case, how you do your thing?",
                    "label": 0
                },
                {
                    "sent": "You can prevent the problem because you will have low precision, right, right?",
                    "label": 0
                },
                {
                    "sent": "Right, and the position is calculated objectively, but if you add curb data source several times, you won't.",
                    "label": 0
                },
                {
                    "sent": "You will trust in the data source in this corrupt data source, right?",
                    "label": 0
                },
                {
                    "sent": "Because actually you can have subsets of the same data source and they will generate also the same problem, right?",
                    "label": 0
                },
                {
                    "sent": "OK, in one of the earlier slides there was a step where you calculate this minimally absolutely certain subsets right now on contradicting substances measures, yes.",
                    "label": 0
                },
                {
                    "sent": "Sit down and distribute away.",
                    "label": 0
                },
                {
                    "sent": "Or does someone have to bring everything together and figure out what is non contradicting.",
                    "label": 0
                },
                {
                    "sent": "Again, if you and question is to clearly all the question is how can they be calculated without bringing all the data together in one store and comparing them as we calculated in a distributed manner.",
                    "label": 0
                },
                {
                    "sent": "You have to treat all data sources according to its potential to generate some conflicts.",
                    "label": 0
                },
                {
                    "sent": "So if you have for example using.",
                    "label": 0
                },
                {
                    "sent": "A signature element that cannot that it's not involved in any disjoint axiom.",
                    "label": 0
                },
                {
                    "sent": "It can cannot be produced any.",
                    "label": 0
                },
                {
                    "sent": "Any conflict, right?",
                    "label": 0
                },
                {
                    "sent": "So we don't have to create these parts.",
                    "label": 0
                },
                {
                    "sent": "I'm in a conflict, could be out of.",
                    "label": 0
                },
                {
                    "sent": "Anything I mean?",
                    "label": 0
                },
                {
                    "sent": "But OK, so there is no specific algorithm you're proposing gives us a figure out a way to find this minimal set, or is there something more specific in the paper?",
                    "label": 0
                },
                {
                    "sent": "I don't get the question.",
                    "label": 0
                },
                {
                    "sent": "Is there an algorithm for creating the Mrs, right?",
                    "label": 0
                },
                {
                    "sent": "This is part of our previous approach.",
                    "label": 0
                },
                {
                    "sent": "Refers in the background work OK, Yeah?",
                    "label": 0
                }
            ]
        }
    }
}