{
    "id": "6jvxnim56asnzt6k2qvmjnjq37pws6nk",
    "title": "Exponential Families in Feature Space",
    "info": {
        "author": [
            "S.V.N. Vishwanathan, Department of Computer Science, University of California Santa Cruz"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "February 2006",
        "category": [
            "Top->Computer Science->Machine Learning->Linear Models"
        ]
    },
    "url": "http://videolectures.net/mlss06au_vishwanathan_effs/",
    "segmentation": [
        [
            "For for years, officially and then as a as a frequent visitor for a year or two before then, and I think you came first.",
            "Machine Learning Summer school in camera.",
            "Yeah, I think in the second one and then I almost kill us the previous one.",
            "So this year, which is going to tell us basically about every single weird wonderful kernel he's produced for data that is other than just a vector of numbers.",
            "So we're going to learn cavities, filled methods on more structured and dynamic data.",
            "Thanks very much.",
            "So I was told that I have to give a 5 minute blurb about myself before I begin the talk, so I've been nicked.",
            "I am in fact the first employee of Nick to be technical employee of Nick by the way, and before that I got my PhD from ISC Indian Institute of Science and I got my Masters also from ISC and before that I worked for Microsoft for awhile and before that I got my bachelors from Ms University of Baroda.",
            "Since we know it's been a long while, what I'm generally interested in is kernel methods, and under the broad umbrella of kernel methods.",
            "I'm more interested in methods which produce outputs even when your data is not vectorial, so I'm interested in working with more structured data.",
            "And I also do a lot of other things.",
            "And optimization and double in quite a few things which are fun whatever I feel like fun I do.",
            "So yeah, that's about me.",
            "As for the slides that you have in your in your handouts, they're pretty much useless.",
            "These slides that I have are hot off the press.",
            "You can see them steaming.",
            "They they were, they were finished two minutes ago, so you're getting the latest and greatest version here, so hopefully this will be up for download on one of the in the.",
            "Machine Learning Summer School homepage so.",
            "You'll not lose much, so you just have to follow along.",
            "I'm sorry for that though.",
            "So before let's, let's have a quick look at."
        ],
        [
            "At what I'm going to talk about, so one of the.",
            "I mean you you have been hearing all about kernel methods when it has been talking about how nice they are, they have all these nice statistical properties and they have all these properties in from the learning theory point of view, and so on and so forth.",
            "And one thing that probably Bernard did mention was what is called the kernel trick, right?",
            "So the essential idea of the kernel trick is that.",
            "You can work with non vectorial data, it as long as you can define some level of meaningful similarity between non vector data.",
            "You can still work with them and you can still apply all your favorite kernel methods and you can still produce classifiers and do classification.",
            "So I'm not going to concentrate on how you're going to do classification or what you're going to do with the kernel.",
            "I'm going to concentrate on the 1st part.",
            "You're given data.",
            "The data is a dynamical system and you want to produce a kernel out of it and then we use that kernel in other algorithms.",
            "For instance, you have seen the support vector machines are one classic example.",
            "Gaussian processes are another example where you can use these kernels and do classification or regression or.",
            "Whatever else that you want to do, so in some sense, that's one of the advantages of collimators that they are these global black box methods.",
            "Today what I'll do is I'll talk mainly about dynamical systems.",
            "What do you mean by dynamical systems?",
            "Any kind of system which has dynamics that is evolves with time, right?",
            "And so you are able to sample this system at frequent time intervals, and you can figure out how this system is evolving.",
            "And then I'll talk a little bit about how you can define how you can look at trajectories and use noise models, and then how you use these ideas to define kernels on these dynamical systems.",
            "Then I'll move on to talk about some special cases.",
            "So basically there are three special cases of this big general framework that I'll talk about.",
            "The first one is where we look at continuous time series, and I'll show you how continuous linear time systems can.",
            "Be used to produce some kernels which are known before as what are called diffusion kernels on graphs, and these kernels fall out as special cases here.",
            "Then I'll move on to what are called Arma models.",
            "If you have a control theory background, people probably know these Kalman filters as well, and the other names by which it's known.",
            "And basically I'll talk a little bit about how Arma models can be used to model real life data, and then how it can be used to define kernels so they'll be 2 applications that are mainly talk about.",
            "One is classifying dynamic textures and the other is how to do drug response prediction.",
            "And then I'll move on and talk about.",
            "Random or graph kernels and I'll show by a systematic reduction that random walk graph kernels can actually be reduced to solving a Sylvester equation.",
            "And before this random walk graph kernels, the complexity of computing them was order of enter the six by the systematic reduction.",
            "We can reduce them to something called the Silver State equations and Sylvester equations can be solved in Ncube time, so this is.",
            "This is something that's very very.",
            "This is very recent work, and then I'll conclude.",
            "Feel free to interrupt me at any point of time to ask questions."
        ],
        [
            "Discuss if you if you don't understand something, raise your hand.",
            "I can explain it again.",
            "OK, so first of all, let's understand why do you need the kernel trick, right?",
            "So you can work with linear predictors and you can work with linear estimators in your normal space.",
            "So if you're given some data, you can use a linear predictor, or you can use a linear hyperplane to separate the data and then you can do all kinds of things with it, right?",
            "You can do regression.",
            "You can do estimation, you can do density estimation, all kinds of things with just linear functions.",
            "This is what's decisions have been doing for.",
            "Ages, I mean since the 1960s, if you look at a lot of statistical statistics literature you find all these different methods which use which use linear predictors.",
            "But then the problem is your data might not be separable by linear separator first of all and then second of all in some sense here over restricting your class of models, right?",
            "So you want to have a slightly richer class of models and at the same time you know that working with a linear classifier or with a linear hyperplane is actually quite useful because people have been working on this for so long, and you know that they have algorithms and they have developed methods to work with this.",
            "So one potential ideas what you could do is you could take the data and map it to some high dimensional space.",
            "And in that high dimensional space, if your data is linearly separable, then you're back in business, right?",
            "So you can say, well, I just take my data.",
            "I'm happy, too high dimensional space in the high dimensional space.",
            "I know how to do linear classification, linear regression, all my methods work and everything is fine.",
            "Now.",
            "There's one slight problem to this.",
            "The problem is that what?",
            "How do you come up with this mapping, right?",
            "So first of all, how do you come up with this mapping which makes data linear?",
            "Second of all, suppose you take the trick of, you know, let's take all kinds of possible combinations and put it in.",
            "It's going to be that your feature space in which you're working becomes very very high dimensional.",
            "So now instead of say if you had a 2D problem and you did this big kitchen sink set of features and you ended up with a 200 dimensional problem, so you have blown up the problem dimensions by 100 fold and so your methods are going to be 100 full slower.",
            "So the middle ground?",
            "Or what is a really nice way to solve this problem is to use what is called the kernel trick, right?",
            "This is a very engineering way of of sort of viewing kernels are completely beautiful mathematical theory on kernels, which is on the reproducing kernel Hilbert spaces and that the evaluation functional is continuous which are not going today but for the sake of this dog it's enough to understand kernels as as say as being dot products in some high dimensional space.",
            "So the kernel function is.",
            "Are these special kinds of functions such that if you evaluate them in the normal space in this space in which your input data live, it is equivalent to computing dot products in some high dimensional space, so it's as if you are doing the mapping to some high dimensional space, and then you are doing the dot product in that high dimensional space.",
            "OK, so this is a frequently called the kernel trick.",
            "I'm sure Bernard talked about this quite a lot.",
            "The good news is that a large variety of functions is admissible as kernels there.",
            "Things called immersive theorem that they have to satisfy, and so on and so forth, but but there is a large class of functions which you can verify that their kernels.",
            "And the big advantage of this whole thing, if you if you realize at no point in this slide did I ever mention that my data was vectorial.",
            "Right at no point of time did I say that X&X prime have to come from a vector space.",
            "They could be any arbitrary objects, as long as you know how to do this.",
            "Either you know how to do this mapping explicitly or implicitly through the kernel trick.",
            "You're fine, you're in business, right?",
            "As long as.",
            "There is a black box to which you feed two data points.",
            "They could be arbitrary data points from arbitrary domains, and as long as the black box produces you a number, a number which is meaningful in the sense that if the two data points are similar then it produces a low number high number, and if they are dissimilar it produces a low number.",
            "You're still in business."
        ],
        [
            "So then we ask the question OK, what kind of non vector data are interesting?",
            "There are a variety of non non vector data which is interesting, But the one that we will concentrate on for this talk is is these things called dynamical systems.",
            "So as I said dynamical systems are systems which evolve overtime so.",
            "To give you to give you an example, let's say you have some kind of of a video clip, so a video clip can be thought of as a dynamical system.",
            "Every time you have a frame and then the next time you have a new frame and then and so on and so on so as time progress is your video clip changes so it can be thought of as some kind of a dynamical system.",
            "Now the key idea are in some sense this is a take home message.",
            "I mean if you don't understand the rest of the gory mathematics, it's fine, but if you don't understand this slide, then there's something seriously wrong.",
            "So the basic idea is very simple.",
            "The basic ideas.",
            "You say, well, you know I can take a dynamical system and simulate it, so if I can simulate it, I can observe the trajectory so I can see how the system is evolving with time.",
            "As the system is evolving with time.",
            "I can I can figure out if I if I give you 2 systems and I say simulate them as the evolving with time if they're producing similar outputs, or in if their state spaces are evolving in the same way, then you might say, well, these two systems look similar, But then you just have one data point.",
            "You started with one initial condition and you simulated the system.",
            "You got it trajectory.",
            "You compared the trajectory and said they are similar.",
            "But what you might really want to do is not just simulate on one single data point.",
            "But take a few initial points.",
            "Similarly to systems, look at the trajectories and then make a decision on whether these systems are similar or not.",
            "So the basic posit or the basic assumption with which we always work with, is that if two systems are evolving with the same state space, or if they have similar trajectories, then these two systems are similar.",
            "Now you can use this.",
            "You can specialize this idea into two cases, right?",
            "So in the first case, what you can do is you can say.",
            "That if you give me a.",
            "A new point or you give me an initial point right?",
            "And I see both the systems with the same initial point, and then I look at the time evolution right?",
            "If the time evolution is the same then I can say that these two systems are similar.",
            "On the other hand, I can turn this idea around completely, and I say if I have two different initial points, how does the dynamical system behave for both these points?",
            "So I have one dynamical system, but now I have two.",
            "Initial points, so I similar the same dynamical system with two different initial points, and if both of them give me the same trajectory then maybe the two the two input points are they gave are similar, at least with respect to the dynamical system, so I can use this idea to specialize and give us two kernels.",
            "One is the kernels on the model parameters and one is the kernels on initial conditions.",
            "So given a dynamical system, I can do both.",
            "OK, so this is the basic idea.",
            "I mean this is the intuition so.",
            "I mean, if you if there any questions on this, please stop me and ask me because I mean the rest of it."
        ],
        [
            "Is a lot of mathematics.",
            "You'll see it, but this is something that you should take home.",
            "So let's start with some notation.",
            "Basically, what we say is that the state space in which the model is evolving is a reproducing kernel Hilbert space.",
            "Right, So what is the reproducing kernel Hilbert space?",
            "If that bothers you?",
            "If you if you don't want to think of reproducing kernel Hilbert space, and you think oh, this is, this is too much, just think of Euclidean space.",
            "So just assume that every time your model evolves and the state space is a Euclidean vector, right?",
            "So it's a it's a vector which says what is this state in which the system is.",
            "So the trajectory that you get is a sequence of vectors.",
            "The Dark Ages is just a technical assumption.",
            "I mean, it makes things pretty, but.",
            "It's not really necessary.",
            "And then we assume that you have a series of time evolution operators, so these are operators.",
            "Or you can think of them as dynamical systems, a set of dynamical systems which you can apply to your state space and you get the next time output.",
            "And the time can either be continuous or discrete based on how your system is evolving.",
            "I'll talk about both.",
            "So first I'll give you an example of a continuous time linear time system, and I'll also give you examples of linear times discrete time systems.",
            "And I also assume this is again for arterial see later that things need not necessarily converge and to ensure convergence you need some sort of a nice probability measure on your space.",
            "So you really need to be able to.",
            "Some things up and take expectations nicely, so you need a nice probability measure.",
            "That's why Nice is in emphasis.",
            "I mean, nice depends on your problem.",
            "For example, 11 kind of discounting factor that you might use is this exponential discounting factor.",
            "The other kind is this geometric discounting factor, so these are just examples.",
            "I mean you can use different discounting factors based on based on your problem.",
            "OK, and the kind of problems are the kind of dynamical systems we are studying are first of all characterized by a.",
            "So a is this time evolution operator and it is chosen from this whole set is a set of time evolution operators that we have.",
            "It is applied to the input X at time T and it produces the output or the state.",
            "SpaceX A at T. So this is just a very formal way of saying that every time you choose a dynamical system, you apply the input to it and you produce an output right?",
            "So this is just a very formal way of putting that."
        ],
        [
            "For the rest of the talk again, I mean you can do this with very general than with very general set of operators, but I'll not get into that in this talk for the rest of the talk, I'll restrict my attention only to a single operator, which is a linear operator, so this is a very very simple case.",
            "So what is happening is every time you have a linear operator, the linear operator is applied to your state space and you produce the next state and you keep going going on doing that.",
            "And it defines this operator trange.",
            "This strategy is basically the trajectory.",
            "So as I said, the initial idea that we had was that you have to associate the system with this trajectory and then you compare the trajectories so the operator trans is a formal way of saying that you're associating the system with this trajectory.",
            "So what it does is it says if you give me an input X which is the initial point, I will simulate the system over a period of time and as a simulate the system, whatever is the states that are being produced.",
            "Those states are basically the trajectory of their system starting from that initial point.",
            "And it turns out that if it is linear, you can show that strategy is also linear, so it's a linear operator.",
            "So now what do we do?",
            "We have this whole state space or which we have observed and now we want to define kernels or we want to define measures of similarity.",
            "So how do you do that?",
            "You take the trajectory of 1 system, which is a.",
            "You take the trajectory of another system, which is a prime.",
            "You start off the system A with an initial condition X.",
            "You start off a prime with an initial condition X prime and then you want to define a dot product.",
            "One way of defining this dot product is to say let's take the dot product of the individual states.",
            "Now you remember the assumption that I made before."
        ],
        [
            "Was that X is states is our cages.",
            "Because it's an art."
        ],
        [
            "Images are if you want to be simple and think about it.",
            "It has a dot product.",
            "It's a Euclidean space.",
            "It has a dot product because it has a dot product.",
            "I can compute this Copa of the individual states at certain points of time T. And then I take the expectation with time.",
            "So in other words, what I'm doing is that every time step I produce a new state.",
            "When I produce a new state, I take the dot product of the two states from the two systems an after having taken the DOT product, I sum them up in some sense, I take the average.",
            "So I take the expectation and that's why you need a measure mu.",
            "Now, why is this economy?",
            "You can show that this is a kernel and the reason it is a kernel is becausw.",
            "These couples are valid kernels.",
            "Taking an expectation is a convex operator in the sense it.",
            "What you're doing is you're given a set of points.",
            "When you take the expectation of this set of points, you're basically taking the convex Hull.",
            "Of that set of points.",
            "So because you're taking a convex Hull of a set of valid kernels, this is a kernel.",
            "OK, I mean this is just for the technical minded, otherwise you just have to believe me that these are kernels."
        ],
        [
            "Now there are two special cases that you can consider.",
            "The two special cases that I was I was talking about, right?",
            "So what you can do?",
            "Is you can take.",
            "The two systems and you can compare the trajectory for identical initial conditions.",
            "So here what I do is I tie the initial conditions, so I tie.",
            "X OK, but I leave the.",
            "Dynamical systems free so.",
            "The way to think of it is I have these two systems.",
            "I've simulated them both with the same input, right, and then I observe how they're evolving an as their evolving.",
            "I can define a kernel I can use that kernel to compare how similar they are, but as I say it again, you might not be interested in doing this for just one single data point, but you might be interested in doing this for a variety of data points, so when you do this for a variety of data points, you have to average and the averaging is this expectation operator.",
            "So you're taking expectations with respect to initial conditions.",
            "Anne.",
            "Inside your computing, the kernel on each each run of the dynamical system servicing.",
            "In contrast, you can do the exact opposite, right?",
            "You can tie your dynamical system so your fixed A and you can say.",
            "X&X prime are two different initial conditions to the same dynamical system, and I evolve the dynamical system with time and I take the kernel and I take again the average over a series of a.",
            "But why is this useful?",
            "This might be useful, for instance where you want to see it might be the two data points are not similar.",
            "If you just take, say, the Euclidean norm, or if you just take some metric on this space, but they might be very similar becausw if you simulate the same system with those two data points, the system very quickly converges to the same steady state.",
            "Right, so you might want to figure out which are the points in which the system converges to the same steady state, and so in this case these kind of kernels and initial conditions are quite useful."
        ],
        [
            "OK, now let's take as I promised there three different applications or three different special cases that I'll consider.",
            "And then I'll show you applications of each one of these cases as they as they go along."
        ],
        [
            "I mean, it is a.",
            "It is a reasonably equation dense talk.",
            "Unfortunately, there's not much I can do about it so.",
            "If OK before I continue, are there are there any questions?",
            "Questions, comments understood, didn't understand yes.",
            "Over 8.",
            "If you're given a bunch of operators.",
            "Yeah, you just someone, so that's why I had this."
        ],
        [
            "This is a.",
            "You have a series of time evolution."
        ],
        [
            "Definition of.",
            "So just take the trajectories and then you sum up over the trajectories and you take the expectation.",
            "Copper is the kernel on the state space.",
            "I'm going to tell us what the point of all this is.",
            "Yes, I'll show you three different applications, so I'll show you continuous time out models and graphics and show all these are useful.",
            "Definition of a slide.",
            "About the notation."
        ],
        [
            "So this is an operator that is actually applied on mix.",
            "Just this last equation X yes, so so the way to think of it is that you are applying a operator which is chosen from a class of operators.",
            "The script A is this class of operators from which you're choosing A and then you applying it to X, which is the initial conditions in the script.",
            "It's slightly different, it's a of T applied in X. Yeah, yeah, as I said these slides.",
            "In your handouts are not related slides.",
            "They're not, and they do have a few mistakes which are fixed, I don't.",
            "You don't apply at a.",
            "So A is a linear operator, right?",
            "So a takes from evolves with time.",
            "So every time basically what you're doing.",
            "OK, the way to think of it is.",
            "At time T, you choose an operator from your from your set scripta and you applied to X and that's that's what this notation is.",
            "Basically for, you choose an operator a from your set scripty and at time T, and you apply to X and whatever comes out is your X Ray of the, so you choose.",
            "Define.",
            "Yes, so far for instance.",
            "Yes, so for instance I."
        ],
        [
            "This week my attention just a single linear operator, so once I restrict my attention to single linear operator, there's no changing is just applying the same operator over and over again, but but this notation is too easy to say that I can choose if I wanted.",
            "I could choose from this set, but from the rest of the talk I will not.",
            "I'll just take one.",
            "Is there some sensible way?"
        ],
        [
            "It's funny and measure out of this place.",
            "Of operators.",
            "Yeah, this is a sensible way of defining.",
            "Yeah, yeah.",
            "So so.",
            "That's exactly what you're doing.",
            "You're defining.",
            "It's not a measure.",
            "Oh sorry, sorry, sorry, sorry.",
            "I wonder how you do that.",
            "This one.",
            "Think of this one, yeah.",
            "So for instance, if you have if you have a set of operators, you could have a probability distribution over them and then you just you just sum up with the probability of choosing that operator.",
            "So yeah.",
            "Are there any other questions?",
            "Questions, comments.",
            "Good, so let's take.",
            "Let's take the case of continuous linear time systems right?",
            "I want to show that."
        ],
        [
            "All this abstract mumbo jumbo that we're talking about actually makes sense.",
            "I mean, has has real life.",
            "Applications.",
            "So the kind of the kind of systems that we are looking at our our water called continuous time systems.",
            "They are governed by this differential equation, right?",
            "So that evolution is governed by this by this simple differential equation is an operator.",
            "Essay at Time T is is basically evaluating.",
            "This stage phase at time T time instance TA of teas and small additive constant and XI of T is basically a stochastic noise.",
            "So every time the system is evolving and you have a an additive function that's added to it and then you also have a noise term that's added to it.",
            "Oh, it's not, I mean so this.",
            "No, this is just a constant, so this is the.",
            "This is how the whole system evolves with time.",
            "Operator pay.",
            "Yeah, so you can think of this whole thing as so equals capital A plus little A plus size, yeah + and then all all evaluated at time T. But what I'll do is for simplicity and becausw just.",
            "I mean there's too many terms to handle otherwise, I'll just assume that this A of T is zero, and I'll also assume that safety is 0.",
            "OK, so if I made these two assumptions, these are just simplifying assumption.",
            "So what basically what are the implications of this two assumptions?",
            "The first implication if he says I have TO, you're saying that it's a noiseless model, so there is no noise.",
            "You're fully observing the model and the time evolution is completely governed by your differential equation.",
            "What does it mean to say FT is equal to 0?",
            "It just means that there is no offset or there is no additive offset in your model.",
            "So these are the two assumptions that I make.",
            "You don't lose too much generality by making this distinction.",
            "What happens is if you make these two assumptions this term, which is essentially a convolution term, disappears, and so your your time evolution basically just becomes XA at time T. Is the expectation exponential of 80 applied to your initial conditions, X not.",
            "So this is a matrix, is the expectation exponential of matrix, and then you're applying it to X, not OK so.",
            "Now we again say, OK, let's go back and do the thing that we all so now to answer Adams question.",
            "Once I make these two assumptions at A&IRO, then my my operator is just a.",
            "Thanks.",
            "Not excavating."
        ],
        [
            "So once I do that now I want to.",
            "I want to average over trajectories, so I want to say how does this system evolve over trajectories and the way I average that is by saying, OK, you know, you take the integration.",
            "Over the entire period of time.",
            "X0 transpose X1280.",
            "Transpose this term.",
            "Is this space of the first model?",
            "Expected expose a transpose a prime PX not prime this term.",
            "Is the state of your second model.",
            "You have a matrix W which couples the two states.",
            "So for instance W could be a matrix which defines the kernel on your space.",
            "So W is is such a matrix which couples your space and D mu.",
            "Is a measure, so you need that measure, because otherwise this integral might not converge or might not have closed form solutions.",
            "So to ensure that this entire integral is well defined and actually converges, you need a reasonably decent decaying measure.",
            "If, for instance, I just had the uniform measure on this space, then this this integral might not converge.",
            "And if this then so they kinda might not be defined.",
            "So I need an appropriately DK measure in order to be able to define this corner.",
            "So this is, this is crucial.",
            "OK, so one appropriate choice of of this measure is this exponentially decaying kernel.",
            "In some sense.",
            "If you think of it, it is.",
            "Intuitively it is intuitive because what happens is that if suppose you are weighing the trajectories.",
            "Equally, even after a a large time horizon, then in some sense you are saying that you know these things can just keep going on and on and on.",
            "But still I don't.",
            "Even if there are, you know, after say 1 million state evolutions, if the two if the two states don't match.",
            "I still give a lot of weight to that.",
            "But on the other hand, if you have a declining measure, what you're saying is the initial time evolutions are more important for me and then as time passes by, I'm not so worried about you know what happens after I've gone to some kind of studies.",
            "OK, so this is.",
            "This is what it means to say that you have an exponentially decaying measure.",
            "So if you do that, the amazing thing again, I'll spare you the gory details of demand, But basically you need to apply.",
            "The product integration rule if you go to my home page, there are papers which describe this.",
            "And with a little bit of handle cranking, it's basically algebra.",
            "You come out with this closed form solution for this corner, so this is the this is the in some sense.",
            "The nice thing about this whole this whole big machinery that we set up that in the end actually what comes out are closed form solutions.",
            "But these are solutions that you can evaluate on real life data.",
            "And even though you are doing a summation over infinite time and all that, you can still find custom solutions, so that's what is the fascinating thing, at least for me.",
            "And you can write out your kernel as X0, transpose M of XO prime.",
            "Now what is this?",
            "M This matrix M is found by what is called by solving what is called a silver situation.",
            "So if you are familiar with control theory.",
            "Basically, Sylvester equations are widely used there to study linear time invariant systems.",
            "So the kind of the form of these equations is.",
            "We'll talk more about this investigations later, but the form of the equations is something like X is as X U + T is the general form of the equations, and then you can shift things around and you get these kind of phones.",
            "But this is the general form of this investigation, and you need to solve for M. But it turns out that you can solve for M in cubic time in often M cubed time.",
            "So in of Ncube time you can actually compute this whole kernel in close form, where N is the dimension of you're a, so is assumed in and buy an operator."
        ],
        [
            "Now let's take a couple of special cases and then I'll show you that this whole thing actually relates to graphs and diffusion some graphs.",
            "If you suppose, for instance, take a snapshot at a time, so in other words, instead of taking a measure which is exponentially decaying, you have a point measure and measure which places all its mass at one single point an that is at time instant stuff.",
            "Then the kernel is basically just X, not.",
            "And the Xbox A but evaluated it out because your measure has no support anywhere else.",
            "WX buffet transfer stuff.",
            "This seems very very simple minded, but actually it turns out that this is closely related to diffusion some graphs.",
            "The other way is when you fix the initial conditions.",
            "So again as we did before, the same script which is you you tie in your dynamical system, so you tie in a in a transpose.",
            "Ann, you just.",
            "Use the same measure and now you go on and you solve.",
            "Add more simpler Sylvester equation.",
            "So here you have a form X M + M X is minus W this is this is simpler to solve then the full Silver State question.",
            "On the other hand, what you could do is you could say, let me take and let me go and fix the initial conditions so I can go and fix my X0X0 transfer prime, and now my kernel is basically just the trace of this matrix.",
            "In kind C&C, is this covariance covariance matrix.",
            "Is the covariance matrix which ties the initial conditions together.",
            "So if I have a distribution over the initial conditions, we covariance matrix, ties them together?"
        ],
        [
            "Now let's see how these things are related to diffusion kernels.",
            "This is, so far it has been so much of a of abstract mumbo jumbo.",
            "So basically what you do is you have a graph.",
            "So.",
            "You know that a graph can be characterized by its adjacency matrix.",
            "So what's the adjacency matrix of the graph?",
            "Let me quickly try it, so let's just take a simple graph.",
            "So let's let's just take.",
            "A simple graph on three nodes.",
            "Then the adjacency matrix is a three by three matrix.",
            "It tells you whether a node is connected.",
            "So the idea at entry tells you whether the idea of nodes are connected or not.",
            "So for instance, the entry 12 tells me that they are connected to.",
            "One says they're connected, 23 says.",
            "They're connected 3 threes.",
            "Is there connected in this result we do.",
            "Sorry 3.",
            "Two thanks.",
            "And if the graph is undirected, then this matrix is symmetric.",
            "If the graph is directed this graph, this need not be symmetric.",
            "So this matrix is called the adjacency matrix of the graph and.",
            "Suppose you have a graph and you know it's you know it's adjacency matrix.",
            "Then you can write out this matrix D. So what matrix D essentially is is the out degree of each node.",
            "So DI says how many nodes, how many edges are coming out of node I.",
            "So this is what the eyes.",
            "OK, and you can define what is called the graph Laplacian and you can define the notion of a normalized graph Laplacian.",
            "People either work with the graph Laplacian or with the normalized graph Laplacian.",
            "The advantage of working with the normalized graph Laplacian is that your eigen spectrum is bounded between zero and two and so either either one of these is what people normally work with.",
            "Now you can define a diffusion process, a continuous time diffusion process on this graph, right?",
            "And this diffusion process is now governed by this Laplacian.",
            "Either the Laplacian or the normalized graph Laplacian will not make the distinction, but you can.",
            "Whenever I say Laplacian, you can also plug in normalized graph Laplacian.",
            "Yes.",
            "Yeah, yeah, that's a typo.",
            "That's one of the problems of being part of this.",
            "Yeah it is nagia, I'm sorry.",
            "And so the diffusion process is governed by this graph Laplacian.",
            "So the graph Laplacian is a linear operator.",
            "You can apply it and you can use it to denote the diffusion process, right to to get it.",
            "Diffusion process I apologize.",
            "There's a issue it should go on and basically let me write out what I wanted to say.",
            "So what I basically wanted to say there is that.",
            "This.",
            "Expression is the idea at entry of the kernel matrix, and I'll explain this expression in a minute.",
            "So basically what you do is you say.",
            "I start at a node.",
            "I OK so EI is this vector which has a zero everywhere else and a one at the Hyatt position.",
            "So you say I start out at node I.",
            "On the other graph, I start out at node J, so EJ says.",
            "That you're starting out at node JS.",
            "You have a measure which has a point support, so the measure says that you take an instantaneous snapshot at time Tau.",
            "So basically what this is is that what is the probability?",
            "What the kernel measures is what is the probability that if I started from node I in one graph node I of the graph and node J of the same graph, what is the probability that I will diffuse from I to J through some node L?",
            "This is what.",
            "This this kind of measures so.",
            "Your graph is the same, so you have the same graph.",
            "You're running a diffusion process on the graph, and you're asking.",
            "The question if I run a diffusion process on this graph, what is the probability that at time instance Tao I will have diffused from node I to know J through some intermediate node.",
            "In other words, if you can diffuse a lot from no light and OJ, then you say the two nodes are are closely related and so they have a higher Colonel value.",
            "If they are too far away in the graph and it takes a long time for you to diffuse from I to J, you say that they have.",
            "They don't have such a strong correlation, and so we kind of value is low.",
            "Now what happens is that if you just apply this to a till now, I didn't make the distinction of whether these graphs that I was dealing with well directed or undirected, so I always had to work with this kind of with this kind of equation, but."
        ],
        [
            "If I know that my graphs are there's another type of the T should be a towel.",
            "I apologize for that, so the.",
            "Moment you say that your graphs are going to be.",
            "Corrected, you know that your adjacency matrix is symmetric, and because you're just in symmetric symmetric, it follows that your graph Laplacian is symmetric and so one cell is symmetric.",
            "You don't need to write.",
            "You can take these two terms, merge them together, and you just need to.",
            "You can write.",
            "This is Expo twice, L Tau.",
            "And for those of you who know about diffusion kernels on graphs.",
            "Proposed by Condor and Leopard in 2002.",
            "This is exactly the diffusion kernel on graphs.",
            "So this is a very very in some sense.",
            "It's a very, very roundabout way of getting there.",
            "But this shows that if you specialize this whole big framework that we have to a special case, you can recover useful things out of it.",
            "This is just an example to show that you can recover useful things out of this.",
            "OK, so again I'll break and pause for questions.",
            "Yes.",
            "Office.",
            "Population comes from the 1st.",
            "The first question.",
            "If you jump to the petition evolution, you could reposition this one.",
            "This one.",
            "Or unleaded later."
        ],
        [
            "Yeah, office.",
            "Your formulation comes from from this past exhibition, race condition and the window.",
            "If we have video.",
            "Keep going in person later.",
            "We don't know what's a pageant, and we don't know how it's going.",
            "How can I?",
            "How can I use this for video?",
            "I'll show you the next thing coming up is for video.",
            "The Arma models is for video.",
            "This is this doesn't apply to video because the time evolution is continuous here, right?",
            "So the time is not discrete in video you have discrete frames, so you're sampling at discrete points of time.",
            "So these guys can only be applied if we do.",
            "No, this is not applicable to video.",
            "The one that we apply to video comes now.",
            "I mean like the next ones.",
            "These are more models."
        ],
        [
            "Lovely couple.",
            "I'll also show you how to estimate parameters for the model that I mean in video.",
            "I'll show you a lot more.",
            "I mean, I'll show you how you can model it.",
            "I'll also show you how you can estimate the parameters of the model so.",
            "Visit answer patient.",
            "Any other questions?",
            "I see Nick completely confused there.",
            "If you have a question.",
            "Yes.",
            "What is the?",
            "The A is basically this guy.",
            "This guy."
        ],
        [
            "Coffee.",
            "Let's go, let's your time.",
            "The graph diffusion model.",
            "The special case?",
            "Yeah yeah.",
            "So the graph of the graph diffusion model is a special case because."
        ],
        [
            "That you're diffusing with it, L. So it's like you're going from the most Android and you're specializing.",
            "Yeah there is a yeah, I know it's it's.",
            "Yeah it's a bit of overload of medication.",
            "Yeah, yeah, I'm sorry there is a bit of overload of notation.",
            "I use a for the agency suspended.",
            "Any other question?",
            "OK, so now let's go on."
        ],
        [
            "To what I call our models, right?",
            "So these are these are discrete time models.",
            "People study them under various names in various fields.",
            "Especially in control theory, they also called common filters in in other parts of control theory they're called auto regressive, moving average models and so on and so forth.",
            "So I just stick with the name Arma models, but you can use whatever is your favorite feeling better if you have it.",
            "So the way these systems evolve is that you see in an output Whitey.",
            "Which is transform which is a transform form of some hidden variable XP.",
            "So Pfizer transformation which is applied to the hidden variable.",
            "There is some noise.",
            "And this evolves linearly with time.",
            "XT, which is the latent variable or the hidden variable itself also evolves linearly with time so XD.",
            "Just has a linear.",
            "Evolution, but we see is some noise.",
            "While where does this make sense?",
            "I mean what kind of models can be modeled with this and and and why does this make sense?",
            "Let me give you in real life example.",
            "Let's say I mean this is all very very idealized set up, but you can.",
            "You can roughly get the idea.",
            "Let's say you have a video of a tree, so you have a camera.",
            "You put it up there and the camera is recording a tree.",
            "There is some wind.",
            "And the wind causes the tree to sway.",
            "OK, so the camera is recording the swing of the of the tree.",
            "Now.",
            "Theoretically, theoretically, if I knew the 1st frame of the video, so if I knew what the tree look like in this normal ambient state, which is the 1st frame of the video, and I knew how the wind was blowing.",
            "So in other words, if I knew the velocity of the wind.",
            "An you know some other parameters related to the wind.",
            "I can simulate exactly the same video without actually knowing the video, so I can take the model of the tree.",
            "I can say this is how the wind was blowing.",
            "This is how it's going to affect it and this is how the video is going to be affected because this is how the tree shaking.",
            "OK, so this is a theoretical way of thinking about.",
            "Now what are you observing?",
            "You're observing a 480 by 6 or 640 by 480 frame every time, right?",
            "Because you are doing this video.",
            "But what is causing what you're observing?",
            "It is just one factor.",
            "The factor is the velocity of the wind, right?",
            "So what is happening is that you are observing something in a very high dimensional space which is 640 by 480.",
            "But the factor that governs it, or the factor that is causing it to happen is actually in a very low dimensional space.",
            "It turns out that this is not a single example.",
            "There are lots and lots of phenomena that you observe in real life where.",
            "The output is a very high dimensional space, but the input is in a reasonably low dimensional space.",
            "The actual evolution is happening in a low dimensional space.",
            "So these kind of models where this happens is called an auto regressive model, right?",
            "And auto regressive linear Gaussian model?",
            "A linear Arma model, for instance is 1, where these these?",
            "Five operators are linear, so in other words Whitey, which is your output variable, which is, which could be potentially very large or very high dimensional, is transfer transformation of your input variable by linear transform.",
            "Plus some noise which is added to it.",
            "While what is happening in the input space is that every time it is evolving by applying a linear operator, and then there's some noise added.",
            "So this is, this is just a simple simple example of a Gaussian model.",
            "And we generally go and demand that the scaling of the model should be fixed, because otherwise you could just arbitrary go and scale C and you can.",
            "You can muck around with the outputs so to fix that kind of a scaling you generally dim and that's it."
        ],
        [
            "C is identity, so in other words, you require.",
            "Let's see some kind of an orthogonal operator.",
            "OK, and then what we do is we want to define kernels on these are models, right?",
            "So what is the output that we're observing?",
            "We are observing the outputs YT from one system and why prime T from the other system?",
            "W is again a matrix in the middle which couples them.",
            "You have a measure which is E to the minus Lambda T and you sum up over Infinite Horizon.",
            "But now there is a complication, right?",
            "The complication is that.",
            "There was noise.",
            "Right, so both the models had noise.",
            "This is not a deterministic system.",
            "The system every time can produce a new output just because of the noise.",
            "So because of that, that inherent problem that you are producing noise what you need to do is you actually have to take expectations over noise and average it out.",
            "In other words, you need to you need to sum up over all possible noise realizations that you can get.",
            "And so this expectation over VMW says you sum up over all possible noise realizations that you can get.",
            "And.",
            "The kernel is basically now defined as the kernel between the initial step of.",
            "Between the initial state, the A&C operators and actually to be strictly speaking, you should also be putting in these Gaussian random variables which evolve so that your noise is evolving.",
            "So it's strictly speaking, X0A CR&Q.",
            "OK, but again, this is this.",
            "This looks like a daunting task is.",
            "So how am I supposed to be taking expectations over the entire realizations of the noise path?",
            "And how can I do that?",
            "But again, if you do a little bit of simple handle banking, it turns out that you can compute these things in close form, so again, this is the.",
            "This is the amazing thing that I am always fascinated about.",
            "That even though there's an infinite summation, there is an expectation over all possible realizations of the noise model.",
            "You can still compute this whole thing.",
            "In in in cubic time and in a close form.",
            "So again, how does the closed form solution look like?",
            "There is one term which is very similar to what we had in the continuous time case, and then there is the second term which which comes basically from the noise you remember that in the continuous time case, because we simplified things a lot, we actually just assume that the noise was nonexistent, so there was no noise, so there was no second term in that case.",
            "But here you can handle the noise gracefully and you actually have the second time which comes because of the noise evolution.",
            "And again you have to solve for two silvers decorations.",
            "The silver State equations again have the same form XSX U + T, so you see M is a transpose MA prime plus some.",
            "Some matrix and same with infidel.",
            "And it turns out that these again, MNM Twiddle can be computed in linear time as are in cubic time by solving what are known as silver state questions.",
            "Uh."
        ],
        [
            "I think this is a good point to take a two minute break before I go on to do the video stuff.",
            "Would you mind?"
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For for years, officially and then as a as a frequent visitor for a year or two before then, and I think you came first.",
                    "label": 0
                },
                {
                    "sent": "Machine Learning Summer school in camera.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I think in the second one and then I almost kill us the previous one.",
                    "label": 0
                },
                {
                    "sent": "So this year, which is going to tell us basically about every single weird wonderful kernel he's produced for data that is other than just a vector of numbers.",
                    "label": 0
                },
                {
                    "sent": "So we're going to learn cavities, filled methods on more structured and dynamic data.",
                    "label": 0
                },
                {
                    "sent": "Thanks very much.",
                    "label": 0
                },
                {
                    "sent": "So I was told that I have to give a 5 minute blurb about myself before I begin the talk, so I've been nicked.",
                    "label": 0
                },
                {
                    "sent": "I am in fact the first employee of Nick to be technical employee of Nick by the way, and before that I got my PhD from ISC Indian Institute of Science and I got my Masters also from ISC and before that I worked for Microsoft for awhile and before that I got my bachelors from Ms University of Baroda.",
                    "label": 0
                },
                {
                    "sent": "Since we know it's been a long while, what I'm generally interested in is kernel methods, and under the broad umbrella of kernel methods.",
                    "label": 0
                },
                {
                    "sent": "I'm more interested in methods which produce outputs even when your data is not vectorial, so I'm interested in working with more structured data.",
                    "label": 0
                },
                {
                    "sent": "And I also do a lot of other things.",
                    "label": 0
                },
                {
                    "sent": "And optimization and double in quite a few things which are fun whatever I feel like fun I do.",
                    "label": 0
                },
                {
                    "sent": "So yeah, that's about me.",
                    "label": 0
                },
                {
                    "sent": "As for the slides that you have in your in your handouts, they're pretty much useless.",
                    "label": 0
                },
                {
                    "sent": "These slides that I have are hot off the press.",
                    "label": 0
                },
                {
                    "sent": "You can see them steaming.",
                    "label": 0
                },
                {
                    "sent": "They they were, they were finished two minutes ago, so you're getting the latest and greatest version here, so hopefully this will be up for download on one of the in the.",
                    "label": 0
                },
                {
                    "sent": "Machine Learning Summer School homepage so.",
                    "label": 0
                },
                {
                    "sent": "You'll not lose much, so you just have to follow along.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry for that though.",
                    "label": 0
                },
                {
                    "sent": "So before let's, let's have a quick look at.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "At what I'm going to talk about, so one of the.",
                    "label": 0
                },
                {
                    "sent": "I mean you you have been hearing all about kernel methods when it has been talking about how nice they are, they have all these nice statistical properties and they have all these properties in from the learning theory point of view, and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "And one thing that probably Bernard did mention was what is called the kernel trick, right?",
                    "label": 0
                },
                {
                    "sent": "So the essential idea of the kernel trick is that.",
                    "label": 0
                },
                {
                    "sent": "You can work with non vectorial data, it as long as you can define some level of meaningful similarity between non vector data.",
                    "label": 0
                },
                {
                    "sent": "You can still work with them and you can still apply all your favorite kernel methods and you can still produce classifiers and do classification.",
                    "label": 0
                },
                {
                    "sent": "So I'm not going to concentrate on how you're going to do classification or what you're going to do with the kernel.",
                    "label": 0
                },
                {
                    "sent": "I'm going to concentrate on the 1st part.",
                    "label": 0
                },
                {
                    "sent": "You're given data.",
                    "label": 0
                },
                {
                    "sent": "The data is a dynamical system and you want to produce a kernel out of it and then we use that kernel in other algorithms.",
                    "label": 0
                },
                {
                    "sent": "For instance, you have seen the support vector machines are one classic example.",
                    "label": 0
                },
                {
                    "sent": "Gaussian processes are another example where you can use these kernels and do classification or regression or.",
                    "label": 0
                },
                {
                    "sent": "Whatever else that you want to do, so in some sense, that's one of the advantages of collimators that they are these global black box methods.",
                    "label": 0
                },
                {
                    "sent": "Today what I'll do is I'll talk mainly about dynamical systems.",
                    "label": 0
                },
                {
                    "sent": "What do you mean by dynamical systems?",
                    "label": 1
                },
                {
                    "sent": "Any kind of system which has dynamics that is evolves with time, right?",
                    "label": 0
                },
                {
                    "sent": "And so you are able to sample this system at frequent time intervals, and you can figure out how this system is evolving.",
                    "label": 0
                },
                {
                    "sent": "And then I'll talk a little bit about how you can define how you can look at trajectories and use noise models, and then how you use these ideas to define kernels on these dynamical systems.",
                    "label": 0
                },
                {
                    "sent": "Then I'll move on to talk about some special cases.",
                    "label": 0
                },
                {
                    "sent": "So basically there are three special cases of this big general framework that I'll talk about.",
                    "label": 0
                },
                {
                    "sent": "The first one is where we look at continuous time series, and I'll show you how continuous linear time systems can.",
                    "label": 1
                },
                {
                    "sent": "Be used to produce some kernels which are known before as what are called diffusion kernels on graphs, and these kernels fall out as special cases here.",
                    "label": 1
                },
                {
                    "sent": "Then I'll move on to what are called Arma models.",
                    "label": 0
                },
                {
                    "sent": "If you have a control theory background, people probably know these Kalman filters as well, and the other names by which it's known.",
                    "label": 0
                },
                {
                    "sent": "And basically I'll talk a little bit about how Arma models can be used to model real life data, and then how it can be used to define kernels so they'll be 2 applications that are mainly talk about.",
                    "label": 1
                },
                {
                    "sent": "One is classifying dynamic textures and the other is how to do drug response prediction.",
                    "label": 0
                },
                {
                    "sent": "And then I'll move on and talk about.",
                    "label": 0
                },
                {
                    "sent": "Random or graph kernels and I'll show by a systematic reduction that random walk graph kernels can actually be reduced to solving a Sylvester equation.",
                    "label": 1
                },
                {
                    "sent": "And before this random walk graph kernels, the complexity of computing them was order of enter the six by the systematic reduction.",
                    "label": 0
                },
                {
                    "sent": "We can reduce them to something called the Silver State equations and Sylvester equations can be solved in Ncube time, so this is.",
                    "label": 0
                },
                {
                    "sent": "This is something that's very very.",
                    "label": 0
                },
                {
                    "sent": "This is very recent work, and then I'll conclude.",
                    "label": 0
                },
                {
                    "sent": "Feel free to interrupt me at any point of time to ask questions.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Discuss if you if you don't understand something, raise your hand.",
                    "label": 0
                },
                {
                    "sent": "I can explain it again.",
                    "label": 0
                },
                {
                    "sent": "OK, so first of all, let's understand why do you need the kernel trick, right?",
                    "label": 0
                },
                {
                    "sent": "So you can work with linear predictors and you can work with linear estimators in your normal space.",
                    "label": 0
                },
                {
                    "sent": "So if you're given some data, you can use a linear predictor, or you can use a linear hyperplane to separate the data and then you can do all kinds of things with it, right?",
                    "label": 0
                },
                {
                    "sent": "You can do regression.",
                    "label": 0
                },
                {
                    "sent": "You can do estimation, you can do density estimation, all kinds of things with just linear functions.",
                    "label": 0
                },
                {
                    "sent": "This is what's decisions have been doing for.",
                    "label": 0
                },
                {
                    "sent": "Ages, I mean since the 1960s, if you look at a lot of statistical statistics literature you find all these different methods which use which use linear predictors.",
                    "label": 0
                },
                {
                    "sent": "But then the problem is your data might not be separable by linear separator first of all and then second of all in some sense here over restricting your class of models, right?",
                    "label": 0
                },
                {
                    "sent": "So you want to have a slightly richer class of models and at the same time you know that working with a linear classifier or with a linear hyperplane is actually quite useful because people have been working on this for so long, and you know that they have algorithms and they have developed methods to work with this.",
                    "label": 0
                },
                {
                    "sent": "So one potential ideas what you could do is you could take the data and map it to some high dimensional space.",
                    "label": 0
                },
                {
                    "sent": "And in that high dimensional space, if your data is linearly separable, then you're back in business, right?",
                    "label": 0
                },
                {
                    "sent": "So you can say, well, I just take my data.",
                    "label": 0
                },
                {
                    "sent": "I'm happy, too high dimensional space in the high dimensional space.",
                    "label": 0
                },
                {
                    "sent": "I know how to do linear classification, linear regression, all my methods work and everything is fine.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "There's one slight problem to this.",
                    "label": 0
                },
                {
                    "sent": "The problem is that what?",
                    "label": 1
                },
                {
                    "sent": "How do you come up with this mapping, right?",
                    "label": 0
                },
                {
                    "sent": "So first of all, how do you come up with this mapping which makes data linear?",
                    "label": 0
                },
                {
                    "sent": "Second of all, suppose you take the trick of, you know, let's take all kinds of possible combinations and put it in.",
                    "label": 0
                },
                {
                    "sent": "It's going to be that your feature space in which you're working becomes very very high dimensional.",
                    "label": 0
                },
                {
                    "sent": "So now instead of say if you had a 2D problem and you did this big kitchen sink set of features and you ended up with a 200 dimensional problem, so you have blown up the problem dimensions by 100 fold and so your methods are going to be 100 full slower.",
                    "label": 0
                },
                {
                    "sent": "So the middle ground?",
                    "label": 0
                },
                {
                    "sent": "Or what is a really nice way to solve this problem is to use what is called the kernel trick, right?",
                    "label": 0
                },
                {
                    "sent": "This is a very engineering way of of sort of viewing kernels are completely beautiful mathematical theory on kernels, which is on the reproducing kernel Hilbert spaces and that the evaluation functional is continuous which are not going today but for the sake of this dog it's enough to understand kernels as as say as being dot products in some high dimensional space.",
                    "label": 0
                },
                {
                    "sent": "So the kernel function is.",
                    "label": 0
                },
                {
                    "sent": "Are these special kinds of functions such that if you evaluate them in the normal space in this space in which your input data live, it is equivalent to computing dot products in some high dimensional space, so it's as if you are doing the mapping to some high dimensional space, and then you are doing the dot product in that high dimensional space.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is a frequently called the kernel trick.",
                    "label": 0
                },
                {
                    "sent": "I'm sure Bernard talked about this quite a lot.",
                    "label": 0
                },
                {
                    "sent": "The good news is that a large variety of functions is admissible as kernels there.",
                    "label": 0
                },
                {
                    "sent": "Things called immersive theorem that they have to satisfy, and so on and so forth, but but there is a large class of functions which you can verify that their kernels.",
                    "label": 1
                },
                {
                    "sent": "And the big advantage of this whole thing, if you if you realize at no point in this slide did I ever mention that my data was vectorial.",
                    "label": 0
                },
                {
                    "sent": "Right at no point of time did I say that X&X prime have to come from a vector space.",
                    "label": 0
                },
                {
                    "sent": "They could be any arbitrary objects, as long as you know how to do this.",
                    "label": 0
                },
                {
                    "sent": "Either you know how to do this mapping explicitly or implicitly through the kernel trick.",
                    "label": 0
                },
                {
                    "sent": "You're fine, you're in business, right?",
                    "label": 0
                },
                {
                    "sent": "As long as.",
                    "label": 0
                },
                {
                    "sent": "There is a black box to which you feed two data points.",
                    "label": 0
                },
                {
                    "sent": "They could be arbitrary data points from arbitrary domains, and as long as the black box produces you a number, a number which is meaningful in the sense that if the two data points are similar then it produces a low number high number, and if they are dissimilar it produces a low number.",
                    "label": 0
                },
                {
                    "sent": "You're still in business.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So then we ask the question OK, what kind of non vector data are interesting?",
                    "label": 0
                },
                {
                    "sent": "There are a variety of non non vector data which is interesting, But the one that we will concentrate on for this talk is is these things called dynamical systems.",
                    "label": 0
                },
                {
                    "sent": "So as I said dynamical systems are systems which evolve overtime so.",
                    "label": 0
                },
                {
                    "sent": "To give you to give you an example, let's say you have some kind of of a video clip, so a video clip can be thought of as a dynamical system.",
                    "label": 0
                },
                {
                    "sent": "Every time you have a frame and then the next time you have a new frame and then and so on and so on so as time progress is your video clip changes so it can be thought of as some kind of a dynamical system.",
                    "label": 0
                },
                {
                    "sent": "Now the key idea are in some sense this is a take home message.",
                    "label": 0
                },
                {
                    "sent": "I mean if you don't understand the rest of the gory mathematics, it's fine, but if you don't understand this slide, then there's something seriously wrong.",
                    "label": 0
                },
                {
                    "sent": "So the basic idea is very simple.",
                    "label": 1
                },
                {
                    "sent": "The basic ideas.",
                    "label": 0
                },
                {
                    "sent": "You say, well, you know I can take a dynamical system and simulate it, so if I can simulate it, I can observe the trajectory so I can see how the system is evolving with time.",
                    "label": 0
                },
                {
                    "sent": "As the system is evolving with time.",
                    "label": 0
                },
                {
                    "sent": "I can I can figure out if I if I give you 2 systems and I say simulate them as the evolving with time if they're producing similar outputs, or in if their state spaces are evolving in the same way, then you might say, well, these two systems look similar, But then you just have one data point.",
                    "label": 0
                },
                {
                    "sent": "You started with one initial condition and you simulated the system.",
                    "label": 0
                },
                {
                    "sent": "You got it trajectory.",
                    "label": 0
                },
                {
                    "sent": "You compared the trajectory and said they are similar.",
                    "label": 0
                },
                {
                    "sent": "But what you might really want to do is not just simulate on one single data point.",
                    "label": 0
                },
                {
                    "sent": "But take a few initial points.",
                    "label": 0
                },
                {
                    "sent": "Similarly to systems, look at the trajectories and then make a decision on whether these systems are similar or not.",
                    "label": 0
                },
                {
                    "sent": "So the basic posit or the basic assumption with which we always work with, is that if two systems are evolving with the same state space, or if they have similar trajectories, then these two systems are similar.",
                    "label": 0
                },
                {
                    "sent": "Now you can use this.",
                    "label": 0
                },
                {
                    "sent": "You can specialize this idea into two cases, right?",
                    "label": 0
                },
                {
                    "sent": "So in the first case, what you can do is you can say.",
                    "label": 0
                },
                {
                    "sent": "That if you give me a.",
                    "label": 0
                },
                {
                    "sent": "A new point or you give me an initial point right?",
                    "label": 0
                },
                {
                    "sent": "And I see both the systems with the same initial point, and then I look at the time evolution right?",
                    "label": 1
                },
                {
                    "sent": "If the time evolution is the same then I can say that these two systems are similar.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, I can turn this idea around completely, and I say if I have two different initial points, how does the dynamical system behave for both these points?",
                    "label": 0
                },
                {
                    "sent": "So I have one dynamical system, but now I have two.",
                    "label": 0
                },
                {
                    "sent": "Initial points, so I similar the same dynamical system with two different initial points, and if both of them give me the same trajectory then maybe the two the two input points are they gave are similar, at least with respect to the dynamical system, so I can use this idea to specialize and give us two kernels.",
                    "label": 0
                },
                {
                    "sent": "One is the kernels on the model parameters and one is the kernels on initial conditions.",
                    "label": 1
                },
                {
                    "sent": "So given a dynamical system, I can do both.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is the basic idea.",
                    "label": 0
                },
                {
                    "sent": "I mean this is the intuition so.",
                    "label": 0
                },
                {
                    "sent": "I mean, if you if there any questions on this, please stop me and ask me because I mean the rest of it.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is a lot of mathematics.",
                    "label": 0
                },
                {
                    "sent": "You'll see it, but this is something that you should take home.",
                    "label": 0
                },
                {
                    "sent": "So let's start with some notation.",
                    "label": 0
                },
                {
                    "sent": "Basically, what we say is that the state space in which the model is evolving is a reproducing kernel Hilbert space.",
                    "label": 0
                },
                {
                    "sent": "Right, So what is the reproducing kernel Hilbert space?",
                    "label": 0
                },
                {
                    "sent": "If that bothers you?",
                    "label": 0
                },
                {
                    "sent": "If you if you don't want to think of reproducing kernel Hilbert space, and you think oh, this is, this is too much, just think of Euclidean space.",
                    "label": 0
                },
                {
                    "sent": "So just assume that every time your model evolves and the state space is a Euclidean vector, right?",
                    "label": 0
                },
                {
                    "sent": "So it's a it's a vector which says what is this state in which the system is.",
                    "label": 0
                },
                {
                    "sent": "So the trajectory that you get is a sequence of vectors.",
                    "label": 0
                },
                {
                    "sent": "The Dark Ages is just a technical assumption.",
                    "label": 0
                },
                {
                    "sent": "I mean, it makes things pretty, but.",
                    "label": 0
                },
                {
                    "sent": "It's not really necessary.",
                    "label": 0
                },
                {
                    "sent": "And then we assume that you have a series of time evolution operators, so these are operators.",
                    "label": 0
                },
                {
                    "sent": "Or you can think of them as dynamical systems, a set of dynamical systems which you can apply to your state space and you get the next time output.",
                    "label": 1
                },
                {
                    "sent": "And the time can either be continuous or discrete based on how your system is evolving.",
                    "label": 0
                },
                {
                    "sent": "I'll talk about both.",
                    "label": 0
                },
                {
                    "sent": "So first I'll give you an example of a continuous time linear time system, and I'll also give you examples of linear times discrete time systems.",
                    "label": 0
                },
                {
                    "sent": "And I also assume this is again for arterial see later that things need not necessarily converge and to ensure convergence you need some sort of a nice probability measure on your space.",
                    "label": 1
                },
                {
                    "sent": "So you really need to be able to.",
                    "label": 0
                },
                {
                    "sent": "Some things up and take expectations nicely, so you need a nice probability measure.",
                    "label": 0
                },
                {
                    "sent": "That's why Nice is in emphasis.",
                    "label": 0
                },
                {
                    "sent": "I mean, nice depends on your problem.",
                    "label": 0
                },
                {
                    "sent": "For example, 11 kind of discounting factor that you might use is this exponential discounting factor.",
                    "label": 1
                },
                {
                    "sent": "The other kind is this geometric discounting factor, so these are just examples.",
                    "label": 0
                },
                {
                    "sent": "I mean you can use different discounting factors based on based on your problem.",
                    "label": 0
                },
                {
                    "sent": "OK, and the kind of problems are the kind of dynamical systems we are studying are first of all characterized by a.",
                    "label": 0
                },
                {
                    "sent": "So a is this time evolution operator and it is chosen from this whole set is a set of time evolution operators that we have.",
                    "label": 1
                },
                {
                    "sent": "It is applied to the input X at time T and it produces the output or the state.",
                    "label": 0
                },
                {
                    "sent": "SpaceX A at T. So this is just a very formal way of saying that every time you choose a dynamical system, you apply the input to it and you produce an output right?",
                    "label": 0
                },
                {
                    "sent": "So this is just a very formal way of putting that.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For the rest of the talk again, I mean you can do this with very general than with very general set of operators, but I'll not get into that in this talk for the rest of the talk, I'll restrict my attention only to a single operator, which is a linear operator, so this is a very very simple case.",
                    "label": 0
                },
                {
                    "sent": "So what is happening is every time you have a linear operator, the linear operator is applied to your state space and you produce the next state and you keep going going on doing that.",
                    "label": 0
                },
                {
                    "sent": "And it defines this operator trange.",
                    "label": 0
                },
                {
                    "sent": "This strategy is basically the trajectory.",
                    "label": 0
                },
                {
                    "sent": "So as I said, the initial idea that we had was that you have to associate the system with this trajectory and then you compare the trajectories so the operator trans is a formal way of saying that you're associating the system with this trajectory.",
                    "label": 1
                },
                {
                    "sent": "So what it does is it says if you give me an input X which is the initial point, I will simulate the system over a period of time and as a simulate the system, whatever is the states that are being produced.",
                    "label": 0
                },
                {
                    "sent": "Those states are basically the trajectory of their system starting from that initial point.",
                    "label": 0
                },
                {
                    "sent": "And it turns out that if it is linear, you can show that strategy is also linear, so it's a linear operator.",
                    "label": 1
                },
                {
                    "sent": "So now what do we do?",
                    "label": 0
                },
                {
                    "sent": "We have this whole state space or which we have observed and now we want to define kernels or we want to define measures of similarity.",
                    "label": 0
                },
                {
                    "sent": "So how do you do that?",
                    "label": 0
                },
                {
                    "sent": "You take the trajectory of 1 system, which is a.",
                    "label": 0
                },
                {
                    "sent": "You take the trajectory of another system, which is a prime.",
                    "label": 0
                },
                {
                    "sent": "You start off the system A with an initial condition X.",
                    "label": 0
                },
                {
                    "sent": "You start off a prime with an initial condition X prime and then you want to define a dot product.",
                    "label": 0
                },
                {
                    "sent": "One way of defining this dot product is to say let's take the dot product of the individual states.",
                    "label": 0
                },
                {
                    "sent": "Now you remember the assumption that I made before.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Was that X is states is our cages.",
                    "label": 0
                },
                {
                    "sent": "Because it's an art.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Images are if you want to be simple and think about it.",
                    "label": 0
                },
                {
                    "sent": "It has a dot product.",
                    "label": 0
                },
                {
                    "sent": "It's a Euclidean space.",
                    "label": 0
                },
                {
                    "sent": "It has a dot product because it has a dot product.",
                    "label": 0
                },
                {
                    "sent": "I can compute this Copa of the individual states at certain points of time T. And then I take the expectation with time.",
                    "label": 0
                },
                {
                    "sent": "So in other words, what I'm doing is that every time step I produce a new state.",
                    "label": 0
                },
                {
                    "sent": "When I produce a new state, I take the dot product of the two states from the two systems an after having taken the DOT product, I sum them up in some sense, I take the average.",
                    "label": 0
                },
                {
                    "sent": "So I take the expectation and that's why you need a measure mu.",
                    "label": 0
                },
                {
                    "sent": "Now, why is this economy?",
                    "label": 0
                },
                {
                    "sent": "You can show that this is a kernel and the reason it is a kernel is becausw.",
                    "label": 0
                },
                {
                    "sent": "These couples are valid kernels.",
                    "label": 0
                },
                {
                    "sent": "Taking an expectation is a convex operator in the sense it.",
                    "label": 0
                },
                {
                    "sent": "What you're doing is you're given a set of points.",
                    "label": 0
                },
                {
                    "sent": "When you take the expectation of this set of points, you're basically taking the convex Hull.",
                    "label": 0
                },
                {
                    "sent": "Of that set of points.",
                    "label": 0
                },
                {
                    "sent": "So because you're taking a convex Hull of a set of valid kernels, this is a kernel.",
                    "label": 0
                },
                {
                    "sent": "OK, I mean this is just for the technical minded, otherwise you just have to believe me that these are kernels.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now there are two special cases that you can consider.",
                    "label": 1
                },
                {
                    "sent": "The two special cases that I was I was talking about, right?",
                    "label": 0
                },
                {
                    "sent": "So what you can do?",
                    "label": 0
                },
                {
                    "sent": "Is you can take.",
                    "label": 0
                },
                {
                    "sent": "The two systems and you can compare the trajectory for identical initial conditions.",
                    "label": 0
                },
                {
                    "sent": "So here what I do is I tie the initial conditions, so I tie.",
                    "label": 0
                },
                {
                    "sent": "X OK, but I leave the.",
                    "label": 0
                },
                {
                    "sent": "Dynamical systems free so.",
                    "label": 0
                },
                {
                    "sent": "The way to think of it is I have these two systems.",
                    "label": 0
                },
                {
                    "sent": "I've simulated them both with the same input, right, and then I observe how they're evolving an as their evolving.",
                    "label": 0
                },
                {
                    "sent": "I can define a kernel I can use that kernel to compare how similar they are, but as I say it again, you might not be interested in doing this for just one single data point, but you might be interested in doing this for a variety of data points, so when you do this for a variety of data points, you have to average and the averaging is this expectation operator.",
                    "label": 0
                },
                {
                    "sent": "So you're taking expectations with respect to initial conditions.",
                    "label": 1
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Inside your computing, the kernel on each each run of the dynamical system servicing.",
                    "label": 0
                },
                {
                    "sent": "In contrast, you can do the exact opposite, right?",
                    "label": 0
                },
                {
                    "sent": "You can tie your dynamical system so your fixed A and you can say.",
                    "label": 0
                },
                {
                    "sent": "X&X prime are two different initial conditions to the same dynamical system, and I evolve the dynamical system with time and I take the kernel and I take again the average over a series of a.",
                    "label": 0
                },
                {
                    "sent": "But why is this useful?",
                    "label": 0
                },
                {
                    "sent": "This might be useful, for instance where you want to see it might be the two data points are not similar.",
                    "label": 0
                },
                {
                    "sent": "If you just take, say, the Euclidean norm, or if you just take some metric on this space, but they might be very similar becausw if you simulate the same system with those two data points, the system very quickly converges to the same steady state.",
                    "label": 0
                },
                {
                    "sent": "Right, so you might want to figure out which are the points in which the system converges to the same steady state, and so in this case these kind of kernels and initial conditions are quite useful.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, now let's take as I promised there three different applications or three different special cases that I'll consider.",
                    "label": 0
                },
                {
                    "sent": "And then I'll show you applications of each one of these cases as they as they go along.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I mean, it is a.",
                    "label": 0
                },
                {
                    "sent": "It is a reasonably equation dense talk.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, there's not much I can do about it so.",
                    "label": 0
                },
                {
                    "sent": "If OK before I continue, are there are there any questions?",
                    "label": 0
                },
                {
                    "sent": "Questions, comments understood, didn't understand yes.",
                    "label": 0
                },
                {
                    "sent": "Over 8.",
                    "label": 0
                },
                {
                    "sent": "If you're given a bunch of operators.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you just someone, so that's why I had this.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is a.",
                    "label": 0
                },
                {
                    "sent": "You have a series of time evolution.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Definition of.",
                    "label": 0
                },
                {
                    "sent": "So just take the trajectories and then you sum up over the trajectories and you take the expectation.",
                    "label": 0
                },
                {
                    "sent": "Copper is the kernel on the state space.",
                    "label": 0
                },
                {
                    "sent": "I'm going to tell us what the point of all this is.",
                    "label": 0
                },
                {
                    "sent": "Yes, I'll show you three different applications, so I'll show you continuous time out models and graphics and show all these are useful.",
                    "label": 0
                },
                {
                    "sent": "Definition of a slide.",
                    "label": 0
                },
                {
                    "sent": "About the notation.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is an operator that is actually applied on mix.",
                    "label": 0
                },
                {
                    "sent": "Just this last equation X yes, so so the way to think of it is that you are applying a operator which is chosen from a class of operators.",
                    "label": 0
                },
                {
                    "sent": "The script A is this class of operators from which you're choosing A and then you applying it to X, which is the initial conditions in the script.",
                    "label": 0
                },
                {
                    "sent": "It's slightly different, it's a of T applied in X. Yeah, yeah, as I said these slides.",
                    "label": 0
                },
                {
                    "sent": "In your handouts are not related slides.",
                    "label": 0
                },
                {
                    "sent": "They're not, and they do have a few mistakes which are fixed, I don't.",
                    "label": 0
                },
                {
                    "sent": "You don't apply at a.",
                    "label": 0
                },
                {
                    "sent": "So A is a linear operator, right?",
                    "label": 0
                },
                {
                    "sent": "So a takes from evolves with time.",
                    "label": 0
                },
                {
                    "sent": "So every time basically what you're doing.",
                    "label": 0
                },
                {
                    "sent": "OK, the way to think of it is.",
                    "label": 0
                },
                {
                    "sent": "At time T, you choose an operator from your from your set scripta and you applied to X and that's that's what this notation is.",
                    "label": 0
                },
                {
                    "sent": "Basically for, you choose an operator a from your set scripty and at time T, and you apply to X and whatever comes out is your X Ray of the, so you choose.",
                    "label": 0
                },
                {
                    "sent": "Define.",
                    "label": 0
                },
                {
                    "sent": "Yes, so far for instance.",
                    "label": 0
                },
                {
                    "sent": "Yes, so for instance I.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This week my attention just a single linear operator, so once I restrict my attention to single linear operator, there's no changing is just applying the same operator over and over again, but but this notation is too easy to say that I can choose if I wanted.",
                    "label": 1
                },
                {
                    "sent": "I could choose from this set, but from the rest of the talk I will not.",
                    "label": 0
                },
                {
                    "sent": "I'll just take one.",
                    "label": 0
                },
                {
                    "sent": "Is there some sensible way?",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's funny and measure out of this place.",
                    "label": 0
                },
                {
                    "sent": "Of operators.",
                    "label": 0
                },
                {
                    "sent": "Yeah, this is a sensible way of defining.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah.",
                    "label": 0
                },
                {
                    "sent": "So so.",
                    "label": 0
                },
                {
                    "sent": "That's exactly what you're doing.",
                    "label": 0
                },
                {
                    "sent": "You're defining.",
                    "label": 0
                },
                {
                    "sent": "It's not a measure.",
                    "label": 0
                },
                {
                    "sent": "Oh sorry, sorry, sorry, sorry.",
                    "label": 0
                },
                {
                    "sent": "I wonder how you do that.",
                    "label": 0
                },
                {
                    "sent": "This one.",
                    "label": 0
                },
                {
                    "sent": "Think of this one, yeah.",
                    "label": 0
                },
                {
                    "sent": "So for instance, if you have if you have a set of operators, you could have a probability distribution over them and then you just you just sum up with the probability of choosing that operator.",
                    "label": 0
                },
                {
                    "sent": "So yeah.",
                    "label": 0
                },
                {
                    "sent": "Are there any other questions?",
                    "label": 0
                },
                {
                    "sent": "Questions, comments.",
                    "label": 0
                },
                {
                    "sent": "Good, so let's take.",
                    "label": 0
                },
                {
                    "sent": "Let's take the case of continuous linear time systems right?",
                    "label": 0
                },
                {
                    "sent": "I want to show that.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "All this abstract mumbo jumbo that we're talking about actually makes sense.",
                    "label": 0
                },
                {
                    "sent": "I mean, has has real life.",
                    "label": 0
                },
                {
                    "sent": "Applications.",
                    "label": 0
                },
                {
                    "sent": "So the kind of the kind of systems that we are looking at our our water called continuous time systems.",
                    "label": 0
                },
                {
                    "sent": "They are governed by this differential equation, right?",
                    "label": 0
                },
                {
                    "sent": "So that evolution is governed by this by this simple differential equation is an operator.",
                    "label": 0
                },
                {
                    "sent": "Essay at Time T is is basically evaluating.",
                    "label": 0
                },
                {
                    "sent": "This stage phase at time T time instance TA of teas and small additive constant and XI of T is basically a stochastic noise.",
                    "label": 1
                },
                {
                    "sent": "So every time the system is evolving and you have a an additive function that's added to it and then you also have a noise term that's added to it.",
                    "label": 0
                },
                {
                    "sent": "Oh, it's not, I mean so this.",
                    "label": 0
                },
                {
                    "sent": "No, this is just a constant, so this is the.",
                    "label": 0
                },
                {
                    "sent": "This is how the whole system evolves with time.",
                    "label": 1
                },
                {
                    "sent": "Operator pay.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so you can think of this whole thing as so equals capital A plus little A plus size, yeah + and then all all evaluated at time T. But what I'll do is for simplicity and becausw just.",
                    "label": 0
                },
                {
                    "sent": "I mean there's too many terms to handle otherwise, I'll just assume that this A of T is zero, and I'll also assume that safety is 0.",
                    "label": 0
                },
                {
                    "sent": "OK, so if I made these two assumptions, these are just simplifying assumption.",
                    "label": 0
                },
                {
                    "sent": "So what basically what are the implications of this two assumptions?",
                    "label": 0
                },
                {
                    "sent": "The first implication if he says I have TO, you're saying that it's a noiseless model, so there is no noise.",
                    "label": 0
                },
                {
                    "sent": "You're fully observing the model and the time evolution is completely governed by your differential equation.",
                    "label": 0
                },
                {
                    "sent": "What does it mean to say FT is equal to 0?",
                    "label": 0
                },
                {
                    "sent": "It just means that there is no offset or there is no additive offset in your model.",
                    "label": 0
                },
                {
                    "sent": "So these are the two assumptions that I make.",
                    "label": 0
                },
                {
                    "sent": "You don't lose too much generality by making this distinction.",
                    "label": 0
                },
                {
                    "sent": "What happens is if you make these two assumptions this term, which is essentially a convolution term, disappears, and so your your time evolution basically just becomes XA at time T. Is the expectation exponential of 80 applied to your initial conditions, X not.",
                    "label": 1
                },
                {
                    "sent": "So this is a matrix, is the expectation exponential of matrix, and then you're applying it to X, not OK so.",
                    "label": 0
                },
                {
                    "sent": "Now we again say, OK, let's go back and do the thing that we all so now to answer Adams question.",
                    "label": 0
                },
                {
                    "sent": "Once I make these two assumptions at A&IRO, then my my operator is just a.",
                    "label": 0
                },
                {
                    "sent": "Thanks.",
                    "label": 0
                },
                {
                    "sent": "Not excavating.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So once I do that now I want to.",
                    "label": 0
                },
                {
                    "sent": "I want to average over trajectories, so I want to say how does this system evolve over trajectories and the way I average that is by saying, OK, you know, you take the integration.",
                    "label": 0
                },
                {
                    "sent": "Over the entire period of time.",
                    "label": 0
                },
                {
                    "sent": "X0 transpose X1280.",
                    "label": 0
                },
                {
                    "sent": "Transpose this term.",
                    "label": 0
                },
                {
                    "sent": "Is this space of the first model?",
                    "label": 0
                },
                {
                    "sent": "Expected expose a transpose a prime PX not prime this term.",
                    "label": 0
                },
                {
                    "sent": "Is the state of your second model.",
                    "label": 0
                },
                {
                    "sent": "You have a matrix W which couples the two states.",
                    "label": 0
                },
                {
                    "sent": "So for instance W could be a matrix which defines the kernel on your space.",
                    "label": 1
                },
                {
                    "sent": "So W is is such a matrix which couples your space and D mu.",
                    "label": 0
                },
                {
                    "sent": "Is a measure, so you need that measure, because otherwise this integral might not converge or might not have closed form solutions.",
                    "label": 0
                },
                {
                    "sent": "So to ensure that this entire integral is well defined and actually converges, you need a reasonably decent decaying measure.",
                    "label": 0
                },
                {
                    "sent": "If, for instance, I just had the uniform measure on this space, then this this integral might not converge.",
                    "label": 0
                },
                {
                    "sent": "And if this then so they kinda might not be defined.",
                    "label": 0
                },
                {
                    "sent": "So I need an appropriately DK measure in order to be able to define this corner.",
                    "label": 0
                },
                {
                    "sent": "So this is, this is crucial.",
                    "label": 0
                },
                {
                    "sent": "OK, so one appropriate choice of of this measure is this exponentially decaying kernel.",
                    "label": 0
                },
                {
                    "sent": "In some sense.",
                    "label": 0
                },
                {
                    "sent": "If you think of it, it is.",
                    "label": 0
                },
                {
                    "sent": "Intuitively it is intuitive because what happens is that if suppose you are weighing the trajectories.",
                    "label": 0
                },
                {
                    "sent": "Equally, even after a a large time horizon, then in some sense you are saying that you know these things can just keep going on and on and on.",
                    "label": 0
                },
                {
                    "sent": "But still I don't.",
                    "label": 0
                },
                {
                    "sent": "Even if there are, you know, after say 1 million state evolutions, if the two if the two states don't match.",
                    "label": 0
                },
                {
                    "sent": "I still give a lot of weight to that.",
                    "label": 0
                },
                {
                    "sent": "But on the other hand, if you have a declining measure, what you're saying is the initial time evolutions are more important for me and then as time passes by, I'm not so worried about you know what happens after I've gone to some kind of studies.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is.",
                    "label": 0
                },
                {
                    "sent": "This is what it means to say that you have an exponentially decaying measure.",
                    "label": 0
                },
                {
                    "sent": "So if you do that, the amazing thing again, I'll spare you the gory details of demand, But basically you need to apply.",
                    "label": 0
                },
                {
                    "sent": "The product integration rule if you go to my home page, there are papers which describe this.",
                    "label": 0
                },
                {
                    "sent": "And with a little bit of handle cranking, it's basically algebra.",
                    "label": 0
                },
                {
                    "sent": "You come out with this closed form solution for this corner, so this is the this is the in some sense.",
                    "label": 1
                },
                {
                    "sent": "The nice thing about this whole this whole big machinery that we set up that in the end actually what comes out are closed form solutions.",
                    "label": 0
                },
                {
                    "sent": "But these are solutions that you can evaluate on real life data.",
                    "label": 0
                },
                {
                    "sent": "And even though you are doing a summation over infinite time and all that, you can still find custom solutions, so that's what is the fascinating thing, at least for me.",
                    "label": 0
                },
                {
                    "sent": "And you can write out your kernel as X0, transpose M of XO prime.",
                    "label": 1
                },
                {
                    "sent": "Now what is this?",
                    "label": 0
                },
                {
                    "sent": "M This matrix M is found by what is called by solving what is called a silver situation.",
                    "label": 0
                },
                {
                    "sent": "So if you are familiar with control theory.",
                    "label": 0
                },
                {
                    "sent": "Basically, Sylvester equations are widely used there to study linear time invariant systems.",
                    "label": 0
                },
                {
                    "sent": "So the kind of the form of these equations is.",
                    "label": 0
                },
                {
                    "sent": "We'll talk more about this investigations later, but the form of the equations is something like X is as X U + T is the general form of the equations, and then you can shift things around and you get these kind of phones.",
                    "label": 1
                },
                {
                    "sent": "But this is the general form of this investigation, and you need to solve for M. But it turns out that you can solve for M in cubic time in often M cubed time.",
                    "label": 0
                },
                {
                    "sent": "So in of Ncube time you can actually compute this whole kernel in close form, where N is the dimension of you're a, so is assumed in and buy an operator.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now let's take a couple of special cases and then I'll show you that this whole thing actually relates to graphs and diffusion some graphs.",
                    "label": 0
                },
                {
                    "sent": "If you suppose, for instance, take a snapshot at a time, so in other words, instead of taking a measure which is exponentially decaying, you have a point measure and measure which places all its mass at one single point an that is at time instant stuff.",
                    "label": 0
                },
                {
                    "sent": "Then the kernel is basically just X, not.",
                    "label": 0
                },
                {
                    "sent": "And the Xbox A but evaluated it out because your measure has no support anywhere else.",
                    "label": 0
                },
                {
                    "sent": "WX buffet transfer stuff.",
                    "label": 0
                },
                {
                    "sent": "This seems very very simple minded, but actually it turns out that this is closely related to diffusion some graphs.",
                    "label": 0
                },
                {
                    "sent": "The other way is when you fix the initial conditions.",
                    "label": 0
                },
                {
                    "sent": "So again as we did before, the same script which is you you tie in your dynamical system, so you tie in a in a transpose.",
                    "label": 0
                },
                {
                    "sent": "Ann, you just.",
                    "label": 0
                },
                {
                    "sent": "Use the same measure and now you go on and you solve.",
                    "label": 0
                },
                {
                    "sent": "Add more simpler Sylvester equation.",
                    "label": 0
                },
                {
                    "sent": "So here you have a form X M + M X is minus W this is this is simpler to solve then the full Silver State question.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, what you could do is you could say, let me take and let me go and fix the initial conditions so I can go and fix my X0X0 transfer prime, and now my kernel is basically just the trace of this matrix.",
                    "label": 0
                },
                {
                    "sent": "In kind C&C, is this covariance covariance matrix.",
                    "label": 0
                },
                {
                    "sent": "Is the covariance matrix which ties the initial conditions together.",
                    "label": 1
                },
                {
                    "sent": "So if I have a distribution over the initial conditions, we covariance matrix, ties them together?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now let's see how these things are related to diffusion kernels.",
                    "label": 0
                },
                {
                    "sent": "This is, so far it has been so much of a of abstract mumbo jumbo.",
                    "label": 0
                },
                {
                    "sent": "So basically what you do is you have a graph.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "You know that a graph can be characterized by its adjacency matrix.",
                    "label": 0
                },
                {
                    "sent": "So what's the adjacency matrix of the graph?",
                    "label": 1
                },
                {
                    "sent": "Let me quickly try it, so let's just take a simple graph.",
                    "label": 0
                },
                {
                    "sent": "So let's let's just take.",
                    "label": 0
                },
                {
                    "sent": "A simple graph on three nodes.",
                    "label": 0
                },
                {
                    "sent": "Then the adjacency matrix is a three by three matrix.",
                    "label": 0
                },
                {
                    "sent": "It tells you whether a node is connected.",
                    "label": 0
                },
                {
                    "sent": "So the idea at entry tells you whether the idea of nodes are connected or not.",
                    "label": 0
                },
                {
                    "sent": "So for instance, the entry 12 tells me that they are connected to.",
                    "label": 0
                },
                {
                    "sent": "One says they're connected, 23 says.",
                    "label": 0
                },
                {
                    "sent": "They're connected 3 threes.",
                    "label": 0
                },
                {
                    "sent": "Is there connected in this result we do.",
                    "label": 0
                },
                {
                    "sent": "Sorry 3.",
                    "label": 0
                },
                {
                    "sent": "Two thanks.",
                    "label": 0
                },
                {
                    "sent": "And if the graph is undirected, then this matrix is symmetric.",
                    "label": 0
                },
                {
                    "sent": "If the graph is directed this graph, this need not be symmetric.",
                    "label": 0
                },
                {
                    "sent": "So this matrix is called the adjacency matrix of the graph and.",
                    "label": 0
                },
                {
                    "sent": "Suppose you have a graph and you know it's you know it's adjacency matrix.",
                    "label": 0
                },
                {
                    "sent": "Then you can write out this matrix D. So what matrix D essentially is is the out degree of each node.",
                    "label": 0
                },
                {
                    "sent": "So DI says how many nodes, how many edges are coming out of node I.",
                    "label": 0
                },
                {
                    "sent": "So this is what the eyes.",
                    "label": 0
                },
                {
                    "sent": "OK, and you can define what is called the graph Laplacian and you can define the notion of a normalized graph Laplacian.",
                    "label": 0
                },
                {
                    "sent": "People either work with the graph Laplacian or with the normalized graph Laplacian.",
                    "label": 0
                },
                {
                    "sent": "The advantage of working with the normalized graph Laplacian is that your eigen spectrum is bounded between zero and two and so either either one of these is what people normally work with.",
                    "label": 0
                },
                {
                    "sent": "Now you can define a diffusion process, a continuous time diffusion process on this graph, right?",
                    "label": 1
                },
                {
                    "sent": "And this diffusion process is now governed by this Laplacian.",
                    "label": 0
                },
                {
                    "sent": "Either the Laplacian or the normalized graph Laplacian will not make the distinction, but you can.",
                    "label": 0
                },
                {
                    "sent": "Whenever I say Laplacian, you can also plug in normalized graph Laplacian.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, that's a typo.",
                    "label": 0
                },
                {
                    "sent": "That's one of the problems of being part of this.",
                    "label": 0
                },
                {
                    "sent": "Yeah it is nagia, I'm sorry.",
                    "label": 1
                },
                {
                    "sent": "And so the diffusion process is governed by this graph Laplacian.",
                    "label": 0
                },
                {
                    "sent": "So the graph Laplacian is a linear operator.",
                    "label": 0
                },
                {
                    "sent": "You can apply it and you can use it to denote the diffusion process, right to to get it.",
                    "label": 0
                },
                {
                    "sent": "Diffusion process I apologize.",
                    "label": 0
                },
                {
                    "sent": "There's a issue it should go on and basically let me write out what I wanted to say.",
                    "label": 0
                },
                {
                    "sent": "So what I basically wanted to say there is that.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "Expression is the idea at entry of the kernel matrix, and I'll explain this expression in a minute.",
                    "label": 0
                },
                {
                    "sent": "So basically what you do is you say.",
                    "label": 0
                },
                {
                    "sent": "I start at a node.",
                    "label": 0
                },
                {
                    "sent": "I OK so EI is this vector which has a zero everywhere else and a one at the Hyatt position.",
                    "label": 0
                },
                {
                    "sent": "So you say I start out at node I.",
                    "label": 0
                },
                {
                    "sent": "On the other graph, I start out at node J, so EJ says.",
                    "label": 0
                },
                {
                    "sent": "That you're starting out at node JS.",
                    "label": 0
                },
                {
                    "sent": "You have a measure which has a point support, so the measure says that you take an instantaneous snapshot at time Tau.",
                    "label": 0
                },
                {
                    "sent": "So basically what this is is that what is the probability?",
                    "label": 0
                },
                {
                    "sent": "What the kernel measures is what is the probability that if I started from node I in one graph node I of the graph and node J of the same graph, what is the probability that I will diffuse from I to J through some node L?",
                    "label": 0
                },
                {
                    "sent": "This is what.",
                    "label": 0
                },
                {
                    "sent": "This this kind of measures so.",
                    "label": 0
                },
                {
                    "sent": "Your graph is the same, so you have the same graph.",
                    "label": 0
                },
                {
                    "sent": "You're running a diffusion process on the graph, and you're asking.",
                    "label": 0
                },
                {
                    "sent": "The question if I run a diffusion process on this graph, what is the probability that at time instance Tao I will have diffused from node I to know J through some intermediate node.",
                    "label": 1
                },
                {
                    "sent": "In other words, if you can diffuse a lot from no light and OJ, then you say the two nodes are are closely related and so they have a higher Colonel value.",
                    "label": 0
                },
                {
                    "sent": "If they are too far away in the graph and it takes a long time for you to diffuse from I to J, you say that they have.",
                    "label": 0
                },
                {
                    "sent": "They don't have such a strong correlation, and so we kind of value is low.",
                    "label": 0
                },
                {
                    "sent": "Now what happens is that if you just apply this to a till now, I didn't make the distinction of whether these graphs that I was dealing with well directed or undirected, so I always had to work with this kind of with this kind of equation, but.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If I know that my graphs are there's another type of the T should be a towel.",
                    "label": 0
                },
                {
                    "sent": "I apologize for that, so the.",
                    "label": 0
                },
                {
                    "sent": "Moment you say that your graphs are going to be.",
                    "label": 0
                },
                {
                    "sent": "Corrected, you know that your adjacency matrix is symmetric, and because you're just in symmetric symmetric, it follows that your graph Laplacian is symmetric and so one cell is symmetric.",
                    "label": 1
                },
                {
                    "sent": "You don't need to write.",
                    "label": 0
                },
                {
                    "sent": "You can take these two terms, merge them together, and you just need to.",
                    "label": 0
                },
                {
                    "sent": "You can write.",
                    "label": 0
                },
                {
                    "sent": "This is Expo twice, L Tau.",
                    "label": 0
                },
                {
                    "sent": "And for those of you who know about diffusion kernels on graphs.",
                    "label": 0
                },
                {
                    "sent": "Proposed by Condor and Leopard in 2002.",
                    "label": 0
                },
                {
                    "sent": "This is exactly the diffusion kernel on graphs.",
                    "label": 0
                },
                {
                    "sent": "So this is a very very in some sense.",
                    "label": 0
                },
                {
                    "sent": "It's a very, very roundabout way of getting there.",
                    "label": 0
                },
                {
                    "sent": "But this shows that if you specialize this whole big framework that we have to a special case, you can recover useful things out of it.",
                    "label": 0
                },
                {
                    "sent": "This is just an example to show that you can recover useful things out of this.",
                    "label": 0
                },
                {
                    "sent": "OK, so again I'll break and pause for questions.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Office.",
                    "label": 0
                },
                {
                    "sent": "Population comes from the 1st.",
                    "label": 0
                },
                {
                    "sent": "The first question.",
                    "label": 0
                },
                {
                    "sent": "If you jump to the petition evolution, you could reposition this one.",
                    "label": 0
                },
                {
                    "sent": "This one.",
                    "label": 0
                },
                {
                    "sent": "Or unleaded later.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, office.",
                    "label": 0
                },
                {
                    "sent": "Your formulation comes from from this past exhibition, race condition and the window.",
                    "label": 0
                },
                {
                    "sent": "If we have video.",
                    "label": 0
                },
                {
                    "sent": "Keep going in person later.",
                    "label": 0
                },
                {
                    "sent": "We don't know what's a pageant, and we don't know how it's going.",
                    "label": 0
                },
                {
                    "sent": "How can I?",
                    "label": 0
                },
                {
                    "sent": "How can I use this for video?",
                    "label": 0
                },
                {
                    "sent": "I'll show you the next thing coming up is for video.",
                    "label": 0
                },
                {
                    "sent": "The Arma models is for video.",
                    "label": 0
                },
                {
                    "sent": "This is this doesn't apply to video because the time evolution is continuous here, right?",
                    "label": 0
                },
                {
                    "sent": "So the time is not discrete in video you have discrete frames, so you're sampling at discrete points of time.",
                    "label": 0
                },
                {
                    "sent": "So these guys can only be applied if we do.",
                    "label": 0
                },
                {
                    "sent": "No, this is not applicable to video.",
                    "label": 0
                },
                {
                    "sent": "The one that we apply to video comes now.",
                    "label": 0
                },
                {
                    "sent": "I mean like the next ones.",
                    "label": 0
                },
                {
                    "sent": "These are more models.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Lovely couple.",
                    "label": 0
                },
                {
                    "sent": "I'll also show you how to estimate parameters for the model that I mean in video.",
                    "label": 0
                },
                {
                    "sent": "I'll show you a lot more.",
                    "label": 0
                },
                {
                    "sent": "I mean, I'll show you how you can model it.",
                    "label": 0
                },
                {
                    "sent": "I'll also show you how you can estimate the parameters of the model so.",
                    "label": 0
                },
                {
                    "sent": "Visit answer patient.",
                    "label": 0
                },
                {
                    "sent": "Any other questions?",
                    "label": 0
                },
                {
                    "sent": "I see Nick completely confused there.",
                    "label": 0
                },
                {
                    "sent": "If you have a question.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "What is the?",
                    "label": 0
                },
                {
                    "sent": "The A is basically this guy.",
                    "label": 0
                },
                {
                    "sent": "This guy.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Coffee.",
                    "label": 0
                },
                {
                    "sent": "Let's go, let's your time.",
                    "label": 0
                },
                {
                    "sent": "The graph diffusion model.",
                    "label": 0
                },
                {
                    "sent": "The special case?",
                    "label": 0
                },
                {
                    "sent": "Yeah yeah.",
                    "label": 0
                },
                {
                    "sent": "So the graph of the graph diffusion model is a special case because.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That you're diffusing with it, L. So it's like you're going from the most Android and you're specializing.",
                    "label": 0
                },
                {
                    "sent": "Yeah there is a yeah, I know it's it's.",
                    "label": 0
                },
                {
                    "sent": "Yeah it's a bit of overload of medication.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, I'm sorry there is a bit of overload of notation.",
                    "label": 0
                },
                {
                    "sent": "I use a for the agency suspended.",
                    "label": 0
                },
                {
                    "sent": "Any other question?",
                    "label": 0
                },
                {
                    "sent": "OK, so now let's go on.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To what I call our models, right?",
                    "label": 0
                },
                {
                    "sent": "So these are these are discrete time models.",
                    "label": 0
                },
                {
                    "sent": "People study them under various names in various fields.",
                    "label": 0
                },
                {
                    "sent": "Especially in control theory, they also called common filters in in other parts of control theory they're called auto regressive, moving average models and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "So I just stick with the name Arma models, but you can use whatever is your favorite feeling better if you have it.",
                    "label": 0
                },
                {
                    "sent": "So the way these systems evolve is that you see in an output Whitey.",
                    "label": 0
                },
                {
                    "sent": "Which is transform which is a transform form of some hidden variable XP.",
                    "label": 0
                },
                {
                    "sent": "So Pfizer transformation which is applied to the hidden variable.",
                    "label": 0
                },
                {
                    "sent": "There is some noise.",
                    "label": 0
                },
                {
                    "sent": "And this evolves linearly with time.",
                    "label": 0
                },
                {
                    "sent": "XT, which is the latent variable or the hidden variable itself also evolves linearly with time so XD.",
                    "label": 0
                },
                {
                    "sent": "Just has a linear.",
                    "label": 0
                },
                {
                    "sent": "Evolution, but we see is some noise.",
                    "label": 0
                },
                {
                    "sent": "While where does this make sense?",
                    "label": 0
                },
                {
                    "sent": "I mean what kind of models can be modeled with this and and and why does this make sense?",
                    "label": 0
                },
                {
                    "sent": "Let me give you in real life example.",
                    "label": 0
                },
                {
                    "sent": "Let's say I mean this is all very very idealized set up, but you can.",
                    "label": 0
                },
                {
                    "sent": "You can roughly get the idea.",
                    "label": 0
                },
                {
                    "sent": "Let's say you have a video of a tree, so you have a camera.",
                    "label": 0
                },
                {
                    "sent": "You put it up there and the camera is recording a tree.",
                    "label": 0
                },
                {
                    "sent": "There is some wind.",
                    "label": 0
                },
                {
                    "sent": "And the wind causes the tree to sway.",
                    "label": 0
                },
                {
                    "sent": "OK, so the camera is recording the swing of the of the tree.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "Theoretically, theoretically, if I knew the 1st frame of the video, so if I knew what the tree look like in this normal ambient state, which is the 1st frame of the video, and I knew how the wind was blowing.",
                    "label": 0
                },
                {
                    "sent": "So in other words, if I knew the velocity of the wind.",
                    "label": 0
                },
                {
                    "sent": "An you know some other parameters related to the wind.",
                    "label": 0
                },
                {
                    "sent": "I can simulate exactly the same video without actually knowing the video, so I can take the model of the tree.",
                    "label": 0
                },
                {
                    "sent": "I can say this is how the wind was blowing.",
                    "label": 0
                },
                {
                    "sent": "This is how it's going to affect it and this is how the video is going to be affected because this is how the tree shaking.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is a theoretical way of thinking about.",
                    "label": 0
                },
                {
                    "sent": "Now what are you observing?",
                    "label": 0
                },
                {
                    "sent": "You're observing a 480 by 6 or 640 by 480 frame every time, right?",
                    "label": 0
                },
                {
                    "sent": "Because you are doing this video.",
                    "label": 0
                },
                {
                    "sent": "But what is causing what you're observing?",
                    "label": 0
                },
                {
                    "sent": "It is just one factor.",
                    "label": 0
                },
                {
                    "sent": "The factor is the velocity of the wind, right?",
                    "label": 0
                },
                {
                    "sent": "So what is happening is that you are observing something in a very high dimensional space which is 640 by 480.",
                    "label": 0
                },
                {
                    "sent": "But the factor that governs it, or the factor that is causing it to happen is actually in a very low dimensional space.",
                    "label": 0
                },
                {
                    "sent": "It turns out that this is not a single example.",
                    "label": 0
                },
                {
                    "sent": "There are lots and lots of phenomena that you observe in real life where.",
                    "label": 0
                },
                {
                    "sent": "The output is a very high dimensional space, but the input is in a reasonably low dimensional space.",
                    "label": 0
                },
                {
                    "sent": "The actual evolution is happening in a low dimensional space.",
                    "label": 0
                },
                {
                    "sent": "So these kind of models where this happens is called an auto regressive model, right?",
                    "label": 0
                },
                {
                    "sent": "And auto regressive linear Gaussian model?",
                    "label": 1
                },
                {
                    "sent": "A linear Arma model, for instance is 1, where these these?",
                    "label": 0
                },
                {
                    "sent": "Five operators are linear, so in other words Whitey, which is your output variable, which is, which could be potentially very large or very high dimensional, is transfer transformation of your input variable by linear transform.",
                    "label": 0
                },
                {
                    "sent": "Plus some noise which is added to it.",
                    "label": 0
                },
                {
                    "sent": "While what is happening in the input space is that every time it is evolving by applying a linear operator, and then there's some noise added.",
                    "label": 0
                },
                {
                    "sent": "So this is, this is just a simple simple example of a Gaussian model.",
                    "label": 0
                },
                {
                    "sent": "And we generally go and demand that the scaling of the model should be fixed, because otherwise you could just arbitrary go and scale C and you can.",
                    "label": 0
                },
                {
                    "sent": "You can muck around with the outputs so to fix that kind of a scaling you generally dim and that's it.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "C is identity, so in other words, you require.",
                    "label": 0
                },
                {
                    "sent": "Let's see some kind of an orthogonal operator.",
                    "label": 0
                },
                {
                    "sent": "OK, and then what we do is we want to define kernels on these are models, right?",
                    "label": 1
                },
                {
                    "sent": "So what is the output that we're observing?",
                    "label": 0
                },
                {
                    "sent": "We are observing the outputs YT from one system and why prime T from the other system?",
                    "label": 0
                },
                {
                    "sent": "W is again a matrix in the middle which couples them.",
                    "label": 0
                },
                {
                    "sent": "You have a measure which is E to the minus Lambda T and you sum up over Infinite Horizon.",
                    "label": 0
                },
                {
                    "sent": "But now there is a complication, right?",
                    "label": 0
                },
                {
                    "sent": "The complication is that.",
                    "label": 0
                },
                {
                    "sent": "There was noise.",
                    "label": 0
                },
                {
                    "sent": "Right, so both the models had noise.",
                    "label": 0
                },
                {
                    "sent": "This is not a deterministic system.",
                    "label": 0
                },
                {
                    "sent": "The system every time can produce a new output just because of the noise.",
                    "label": 1
                },
                {
                    "sent": "So because of that, that inherent problem that you are producing noise what you need to do is you actually have to take expectations over noise and average it out.",
                    "label": 0
                },
                {
                    "sent": "In other words, you need to you need to sum up over all possible noise realizations that you can get.",
                    "label": 0
                },
                {
                    "sent": "And so this expectation over VMW says you sum up over all possible noise realizations that you can get.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "The kernel is basically now defined as the kernel between the initial step of.",
                    "label": 0
                },
                {
                    "sent": "Between the initial state, the A&C operators and actually to be strictly speaking, you should also be putting in these Gaussian random variables which evolve so that your noise is evolving.",
                    "label": 0
                },
                {
                    "sent": "So it's strictly speaking, X0A CR&Q.",
                    "label": 0
                },
                {
                    "sent": "OK, but again, this is this.",
                    "label": 0
                },
                {
                    "sent": "This looks like a daunting task is.",
                    "label": 0
                },
                {
                    "sent": "So how am I supposed to be taking expectations over the entire realizations of the noise path?",
                    "label": 0
                },
                {
                    "sent": "And how can I do that?",
                    "label": 0
                },
                {
                    "sent": "But again, if you do a little bit of simple handle banking, it turns out that you can compute these things in close form, so again, this is the.",
                    "label": 0
                },
                {
                    "sent": "This is the amazing thing that I am always fascinated about.",
                    "label": 0
                },
                {
                    "sent": "That even though there's an infinite summation, there is an expectation over all possible realizations of the noise model.",
                    "label": 0
                },
                {
                    "sent": "You can still compute this whole thing.",
                    "label": 0
                },
                {
                    "sent": "In in in cubic time and in a close form.",
                    "label": 0
                },
                {
                    "sent": "So again, how does the closed form solution look like?",
                    "label": 1
                },
                {
                    "sent": "There is one term which is very similar to what we had in the continuous time case, and then there is the second term which which comes basically from the noise you remember that in the continuous time case, because we simplified things a lot, we actually just assume that the noise was nonexistent, so there was no noise, so there was no second term in that case.",
                    "label": 0
                },
                {
                    "sent": "But here you can handle the noise gracefully and you actually have the second time which comes because of the noise evolution.",
                    "label": 0
                },
                {
                    "sent": "And again you have to solve for two silvers decorations.",
                    "label": 0
                },
                {
                    "sent": "The silver State equations again have the same form XSX U + T, so you see M is a transpose MA prime plus some.",
                    "label": 0
                },
                {
                    "sent": "Some matrix and same with infidel.",
                    "label": 0
                },
                {
                    "sent": "And it turns out that these again, MNM Twiddle can be computed in linear time as are in cubic time by solving what are known as silver state questions.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I think this is a good point to take a two minute break before I go on to do the video stuff.",
                    "label": 0
                },
                {
                    "sent": "Would you mind?",
                    "label": 0
                }
            ]
        }
    }
}