{
    "id": "6lvinuzn2zzzrfa44a35aa6l4gi74err",
    "title": "POWLA: Modeling Linguistic Corpora in OWL/DL",
    "info": {
        "author": [
            "Christian Chiarcos, University of Southern California"
        ],
        "published": "July 4, 2012",
        "recorded": "May 2012",
        "category": [
            "Top->Computer Science->Computational Linguistics",
            "Top->Computer Science->Semantic Web->OWL - Web Ontology Language",
            "Top->Computer Science->Semantic Web->RDF - Resource Description Framework"
        ]
    },
    "url": "http://videolectures.net/eswc2012_chiarcos_powla/",
    "segmentation": [
        [
            "The work I'm presenting here is not actually from ISI, where I'm at the moment it's from the University of Potsdam.",
            "It was developed at these unfortunates.",
            "Pi 360, Six 132, in the context of a collaborative Research Center where different linguistics projects were actually concerned with exchanging their data and developing a database.",
            "First, give some background information about."
        ],
        [
            "State of the art formats for the interoperable interoperable representation of corpora.",
            "Then introduce Paola and discuss some aspects of having corporate representatives linked data."
        ],
        [
            "Corpora a corpus in general speaking as a collection of text which is developed to analyze language and or to develop tools for this purpose, and usually corpora involve linguistic annotations, which can be a very different types.",
            "Also, different communities may be involved which maintain their own terminology which developed their own tools, and annotations can be applied to different languages.",
            "So there's a challenge of interoperability to establish interoperability between all these different corpora between annotations produced by different tools for the same text.",
            "And somehow we have to deal with that.",
            "Probability here includes two aspects.",
            "One is structural interoperability."
        ],
        [
            "This to choose a representation formalism that provides a unified access to and integration of information from different sources.",
            "So for example, you would like to query annotations from different annotation layers from the same corpus.",
            "The second aspect is conceptual interoperability, which means we would like to use the same vocabulary and different different resources, say different corpora, so that you can combine the information in an unrestricted way so it would be great if we could have equivalent part of speech definitions for different corpora, which is only part."
        ],
        [
            "Only the case today.",
            "I'm basically focusing on structural interoperability and with respect to this, the state of the art can be."
        ],
        [
            "Rust as follows.",
            "State of the art approaches are usually based on a graph based data model.",
            "So one example, the idea behind this is that labeled directed graphs are capable to generalize over any type of linguistic annotation.",
            "Since Bird and Lieberman this has been accepted more or less by the community at the moment.",
            "The standard approach to represent this would be by using standoff XML.",
            "A standard XML means that the primary data, say the text and the different annotation layers are all stored and physically separated XML files.",
            "And of course.",
            "Connections between these files have to be established, and this is usually done by means of X links pointer references.",
            "When I say this is the state of the art, then I should probably add that this is the basis for the currently developed standard ISO standard for linguistic annotation in the context of the linguistic annotation framework.",
            "This is how it looks like, so we have a sentence here.",
            "Doesn't and land was being divided."
        ],
        [
            "And this is represented in the text file.",
            "Then there's an XML file that defines a different segment, which is this history Greeks egg.",
            "Then there's a file with part of speech annotations is to recreate PT Doc, XML and another file with the syntax annotations, which points to the part of speech annotations.",
            "You can do this for syntax, but of course you can do the same for semantic annotations, and for this specific example we also have framed it annotations.",
            "This is interoperable and this is integrated because everything refers to the same segments and so you can formulate a query that addresses aspects of the semantic annotations and aspects of the syntactic annotations.",
            "The problem here is.",
            "Although."
        ],
        [
            "We have established interoperability, in principle at least.",
            "What should I do with this kind of data so you would have to develop some kind of database to query this, and one idea that people come up with first to use XML databases, which is really a bad idea for this kind of data, because your database is optimized for data structure that you don't use.",
            "And it has also been empirically shown.",
            "What people do instead is to use relational databases."
        ],
        [
            "And I think personally involved in the development of one of such databases and it works relatively well.",
            "It only has a few disadvantages for suspecta flexibility.",
            "So if you decide that you have to optimize your database scheme, then you need to integrate, introduce a new index, and then you have to reinitialize the whole database, which leads to long debugging cycles, limited interactivity, and from practical experiences we have seen that there's.",
            "A certain limits with respect to advance statistical analysis and inipi applications, if these.",
            "Relational databases that are currently developed for the needs of end users, that is, linguists are to be applied.",
            "Another proposal is to the graph database."
        ],
        [
            "Well, this is possible, but one issue here is that you don't have formal types, so if you want to validate your data in order to make sure, for example, that the same element is not used at one place for annotation at another place for some meta data, then you would have to develop your own means of validation.",
            "And of course, another idea would be."
        ],
        [
            "Is to use RDF.",
            "RDF has data model and underlying data model which is compatible to what standard XML is assuming so.",
            "Formalizes a label directed Multigraph.",
            "But as opposed to standard XML formats, it's come it comes with a certain infrastructure, so we have triple stores, query languages, and more over there some languages that allow to define your own vocabulary and to validate it.",
            "In particular only L. The approach here is to adopt an existing state of the art model for interoperable corpus representations."
        ],
        [
            "Which is polar.",
            "Then, to formalize this data model as an old DL entology?",
            "And then to convert string of XML specifications into RDF.",
            "So far converter has been implemented for to represent graph which is the format used by the ICE initiative to this polar.",
            "And in order to show that this is actually a suitable approach.",
            "Query language was implemented that was developed for querying multilayer corpora, and it could be I could show that it's relatively easy to do this by using sparkle macros.",
            "This is the polar on top."
        ],
        [
            "Elogy it's not quite complete, but the most important elements are here, so the top level element is the power element.",
            "And the two most important sub concepts are node and relation.",
            "Further, there are some classes for to represent corpus infrastructure.",
            "So we have the concept of a layer which corresponds to these colored background.",
            "As we have seen in the first image.",
            "And you have the concept of a document.",
            "And instances of layer and document are then linked with specific annotations.",
            "There are different subclasses of node, in particular non terminal and terminal where a terminal is an element directly pointing to the primary data, which does not have a more.",
            "Specific sub element and on terminal points to terminal or non terminal.",
            "Root element would be a terminal or a terminal.",
            "That would be a terminal or non terminal.",
            "That is, it does not have a parent.",
            "Anne.",
            "The number of object properties which describe the relation between nodes relations.",
            "And between different terminals, for example.",
            "And of course also the relation between these and the corpus infrastructure.",
            "And then there are a number of data properties.",
            "Um?",
            "Which is not quite complete, so we have had annotation.",
            "And basically every power element or every node or a nation can be assigned A has annotation.",
            "One predefined annotation is the hair string property, which points from terminals to strings.",
            "However, if one.",
            "Specific type of source data.",
            "Specifies a certain attribute.",
            "Then a new has annotation property would be introduced for this, which would consist of has and the name of the attribute name and the value.",
            "It then became the literal assigned.",
            "To the corresponding power element and the same exist for meta data which is.",
            "Approximately the same as has annotation, but only applied to layer and document.",
            "Here's a small fragment from the graph that we senior form, so we have a known phrase."
        ],
        [
            "Which is also subject which dominates an adjective.",
            "Then points to a segment which refers to the text by some time, and this is the idea of representation.",
            "So the NP node is a non terminal.",
            "He has cut corresponds to the to the attribute cut.",
            "With a literal corresponding to the value of this attribute.",
            "Has child corresponds to the dominant edge in graph graph?",
            "And then the adjective would also be a non terminal where the attribute is preserved accordingly and the pointing to the segment would be represented as another has child relation.",
            "The terminal is.",
            "The segment that directly points to the text and hasn't had spring attribute with the value by some time.",
            "So that."
        ],
        [
            "Well, looks like graphically the concept hierarchy.",
            "We have a number of individuals and as you might guess from a comparison of the structure of this subtree and this subtree.",
            "This is basically the same.",
            "This data structure of course can be easily queried."
        ],
        [
            "Sparkle, so for example, if we wanted to retrieve information about the adjective, we could just.",
            "Query for a node and then.",
            "Restrict.",
            "The street the matches to those that have the has MSJ property which is a sub property of his annotation with the valued AJ.",
            "And then further to those that have a child with a string value Valentine."
        ],
        [
            "Paula data can be trivially queried with sparkle, however it's a little bit verbose and that's why.",
            "One idea would be to use Sparkle macros instead, which can be, which can be expanded into sparkle.",
            "And I've done this for a query language for multilayer Corporal.",
            "Which is reconstructed as sparkle macros, so people can actually use a query language that they are already familiar with and this is automatically transferred into sparkle.",
            "Yes, this successful reconstruction of this query language, which is called unsquare, guarantees that no linguistic relevant information from the original standard format is lossed.",
            "The main aspects of the query language of the main operators of the query language of the following.",
            "So we have done."
        ],
        [
            "Operators say NP dominates inode dominance are known and this can be expanded into the into a query for a polar has child property, plus it's transitive closure of transitivity is required.",
            "Same for president for presidents before we have seen a property next which holds between different terminals.",
            "And again next could be.",
            "Or did not, as a symbol for next, could be expanded to next plus its transitive closure.",
            "Co extensionality is a little bit more complex.",
            "Co extensionality means that your query, whether two elements from two different annotation layers.",
            "Cover the same stretch of primary data.",
            "So for the example before we had this syntax annotation method."
        ],
        [
            "Semantic annotation and the coax tension allati could be used, for example, to retrieve an element from a syntax annotation.",
            "To say this NP which cause constant doesn't and land.",
            "Align that with another one from a semantic annotation, which could be this Fe poll."
        ],
        [
            "Co extensionality can be implemented by checking whether the left and right border are identical.",
            "There's a kind of approximative implementation, but it's.",
            "It's done that an existing system and existing systems and to implement this we can actually use the Sparkle Update language and.",
            "I've done this with “also, which also provides support for transitive for the transitive closure.",
            "To calculate Accessibility or to represent it, I introduced a new object property that links every node with the first and last terminal that is associated with this.",
            "The first and last terminal can be extrapolated from the has child properties and different from the polar next property so.",
            "Using these Sparkle update language expressions, you can establish new properties first terminal at last terminal and then define a replacement or a macro for the Co extensionality operator.",
            "So if RA is supposed to be coextensive, extensional with B, you can just query whether A is the first, has the first terminal C&A, has a last terminal D&B, has a first terminal, C&B has a last terminal D. Let's actually India."
        ],
        [
            "It's one of the advantages of using an RDF database as compared to relational database.",
            "So in case you need to pre compile fragments of your query on casing is to optimize your data structures.",
            "You can just do this by introducing new triples and without the need to reinitialize your database, which saves a lot of time."
        ],
        [
            "So far.",
            "With the polar as described so far, copper can be represented in RDF.",
            "It comes with a formal data model formalized in Odl.",
            "It allows the lossless representation of newest information and that is lossless can be shown by reconstr ability of an SQL in sparkle macros and its instructionally interoperable formalization of any kind of linguistic information.",
            "This is not actually a claim that I have to make here, but this is rather characteristics that is inherited from the underlying data model.",
            "I'm."
        ],
        [
            "Cause one advantage of having RDF specifications of linguistic corpora is that they can be linked with other data.",
            "For example, the data model can be grounded in other schemes, or the data can be linked to terminology repositories to lexical semantic networks.",
            "And of course, there's.",
            "We can hope that there's some kind of network effects.",
            "That arises by connecting different resources As for schemes, polar is with us.",
            "Back to the corpus organization.",
            "Paula is grounded in Dublin Core."
        ],
        [
            "So a polar layer is a data set in the sense that data is encoded in a defined structure here.",
            "Oppana document is a collection in the sense that it accumulates multiple instances of polar document layer.",
            "Oppana document layer means that for specific piece of text which is recognized as a document and receives an ID, one specific annotation syntax is annotated.",
            "And this is the basic organizational unit of polar.",
            "You might notice that there's no no such thing like text in polar, because taxes represented in string values.",
            "There are possibilities to establish ties between the text and the polar data structures, but polar is just concerned with the representation of the text in all its annotations in RDF.",
            "As for the linguistic annotations, there's a.",
            "Close relationship between Poland and if the interpreter."
        ],
        [
            "This format.",
            "How?",
            "The string and NIF is basically a polar node.",
            "The difference here is that the polar node can exist without being anchored in text, whereas in if string is always grounded in text.",
            "The property polar her string is very similar to an anchor of in if.",
            "They're very similar in the sense that they describe the same information.",
            "However, in polar has, spring is a property of terminals, and it's a defining property of terminals, whereas in if anchor off is obligatory for every string.",
            "So every node so there can be established ties between both notions, but want to develop some kind of generalization.",
            "Further, there's the notion of relation and power, which is not presented in if at the moment.",
            "Together with Dustin Hoffman, who's the one developing the end of the interchange format, currently working on a matter between Polnareff, which will basically be another member from Nefta Polar.",
            "So, but this is still ongoing work.",
            "So that much about schemas another."
        ],
        [
            "Checked where?",
            "Corporate can be linked with.",
            "Other resources would be to ground the corpus or to link it with the terminology repository.",
            "At the moment, a number of terminology repository's are in existence, so there's for example the general ontology of linguistic description, the goal ontology.",
            "There's ice occurred, registry developed or maintained by so that accumulates, for example, linguistic categories, and they also provide an RDF representation.",
            "Then there are further ontologies developed in either NLP or in typology.",
            "This architecture, the ontologies of linguistic description.",
            "Basically, formalizing relation between annotation.",
            "Schemes and these reference this existing terminology impostors by providing an intermediate level of representation, which is this so called reference model and different ontologies that represent annotation schemes, say pen for English and then map to this reference model and then further to the terminology repository's.",
            "If you have this kind of structure, it's relatively easy to establish a connection between your annotations that you have which are in polar represented as strings as literals and.",
            "Such an annotation model.",
            "So, given one particular polar individual and the information that the annotations of this individual match the annotations in a specific annotation model.",
            "So you have to know which has annotation property corresponds to which annotation model.",
            "Then you can declare that this polar individual is an instance of the corresponding earlier class.",
            "The linking here is established through subclass of relationships, so if these individual is then an instance of the audio class, you can infer that it's also an instance of the gold class at the ice o'clock class, which establishes interoperability between.",
            "Anything that points to gold or ice account.",
            "And that's what it looks like again, these."
        ],
        [
            "Those of fragments from the trio show before and the other one is the noun phrase and the lower one is the adjective.",
            "Instead of saying the adjective has the property has MSJ JJ.",
            "We now can say that this adjective is an adjective.",
            "The PEN Ontology is then linked through subclass of relationship to the earlier reference model, which says it's an adjective, and this again is fortling to gold, gold adjective, and to Isaac at, which is the data category 12:30.",
            "You can use this information now for querying corpora.",
            "So and instead of saying JJ is a note with this annotation, you just say DJ isn't all your adjective or a gold objective or whatever.",
            "By doing so, we achieve a level of conceptual interoperability, so it doesn't really matter which kind of string.",
            "Standing here as long as we know that this is a relationship is holding so it can define queries that are applicable to different corpora of different annotations.",
            "In a similar way, linguistic corpora can link can be linked with lexical semantic resources, for example word."
        ],
        [
            "You manually annotated sub couples that are used as example here.",
            "Also contains, for example, annotations, pertinent sensors.",
            "And if the syntactic annotations and they weren't, annotations are represented in a single graph document, which is something they work on at the moment.",
            "Then it can be just converted to polar like any other graph data structure.",
            "And then it's relatively trivial to write a transducer that replaces these string values with references to an RDF version of Word NET and in the end it would be absolutely analogously to the linking with the terminology repositories.",
            "The current."
        ],
        [
            "Let us in the ontology is available from this URL, and there's a kind of proof of principle implementation so far.",
            "Two datasets have been converted, one is the legal corpus, a German newspaper corpus annotated for syntax and Coreference, and the mass corpus which is an American corpus of American English which is jargon balanced and annotated on multiple annotation layers.",
            "As for tools, there are converters from target XML tapola from graph to Paula Ann from some proprietary formats and there's a query preprocessor for these sparkle macros and mentioned before, which is also available.",
            "What is soon to come is.",
            "Just last week I talked to people from the ISO which also behind the mask."
        ],
        [
            "Focus and the promise to provide space and probably a sparkle in point to distribute the mask and RDF version.",
            "And the URL would be this agency or mask.",
            "Further, I'm working on the conversion of additional datasets, namely Europol, which is corpus of EU documents.",
            "The judgment said multiple languages, and aligned with each other, so it's a different kind of data structure.",
            "To illustrate the flexibility of Poland.",
            "And of course, the current implementation is a straightforward implementation of the existing data model.",
            "And it would be desirable to perform some optimizations to make sure that it's also performed so for certain types of linguistic queries it needs to be optimized in a similar way as it goes down here for the Coke sensuality.",
            "Established a number of corporations."
        ],
        [
            "So I already have a longer cooperation with the people behind the enemy interchange format, and we're currently working on a matter between both formats.",
            "Some newer corporations are with the W3C Working Group on Open Annotation.",
            "That are interested in representing linguistic annotations.",
            "In the context of their framework and we just worked out a mapping between polar and the augmentation specifications, and further there is an alternative RDF nization of graph.",
            "The key difference between this idea of representation and polar is that it's focused on the under on the level of layer.",
            "So it does not provide an audio view of the entire document with all its annotations.",
            "And it also does not provide information about strings, so it just preserves the existing graph references to the text.",
            "Unfortunately, these don't have a well defined semantics in RDF terms, but working on that and I think.",
            "From a Corporation, some optimizations for queries will arise.",
            "To a certain extent, these corporations take place in the context of the open Linguistics working group."
        ],
        [
            "Um?",
            "Lots of working group of as part of the Open Knowledge Foundation that we founded in late 2010 and we try to promote the use of open resources in linguistics and several members are also interested in using RDF for their specific data and for different reasons.",
            "So for example, we have datasets from typology where people collect features of languages for a large number of languages, but without actually providing the data just recording your feature.",
            "So for example, a language has a passive construction, something like this.",
            "This is what you can find in Languedoc.",
            "Together with references to the bibliography.",
            "Something similar is provided by Foible, which is an inventory of phonologic phonological.",
            "Inventories of different languages.",
            "The World Atlas of linguistic structures.",
            "Records structures similar to this passive example I had before.",
            "Yes, let's go and linkboy our resources that are relatively unknown from the linked open data Cloud.",
            "I talked a bit about audio, the annotation models, and the reference model and also mentioned Golden Ice occurred.",
            "And these are there are shown in orange.",
            "Here are metadata in terminology repositories that are specific to linguistics.",
            "Of course, the more traditional class of resources that is actually also available to a certain extent from the League of Data Cloud is shown in green here, which includes lexical semantic resources.",
            "Including different instantiations of Wordnet.",
            "Burn it in different languages.",
            "For example, the Dutch word cornetto.",
            "But also audio versions of Wiktionary.",
            "The DB Pedia is an RDF version of the Wikipedia.",
            "And so on.",
            "And further we have the group of annotated corpora and schemes for the annotation, which is something that I'm specifically interested in.",
            "The opening was still working.",
            "Group is basically open to everyone interested in.",
            "Linguistic resources and all the publication under open licenses down here.",
            "And there's the URL linguistics dot OK and org slash NOD for this diagram.",
            "Yes, and having this kind of."
        ],
        [
            "Structure we actually observe the number of network effects between researchers behind different nodes in this diagram, so you might know DPS Spotlight, which takes text as input and assigns it different annotations.",
            "So for example, while by isn't online was divided, it generates different references to the pedia, including Byzantine Empire present on architecture.",
            "Pleasanton are with different probabilities.",
            "I just talked to to problem in Tesco implemented DPS Spotlight and he mentioned that his invalidation prob."
        ],
        [
            "Because it doesn't have manually annotated DPS sensors for anything.",
            "However, for this kind of diagram or with this kind of structure we can generate.",
            "Test data for DPS Spotlight.",
            "Assuming that we have a mapping between Vernon sensors and eupedia concepts, or Wikipedia pages, which is something something that people have been working on for the last few years, and several are available, then we can use the manual word annotations in a mass corpus.",
            "To verify whether word really refers to the DB Pedia concept that Peter Spotlight suggests.",
            "For the mascarpone concrete example for the sentence that we were discussing, is this this censky Byzantine 310 which pertains to Byzantine Empire 1:15, and so on.",
            "And of course this can be relatively unambiguously associated with the Pedia page for Byzantine Empire.",
            "So what we have at the moment and that we didn't have before is manually annotated, test and train data for DB pedia Spotlight."
        ],
        [
            "Thank you for your attention.",
            "I would also like to thank all the people involved with him working on polar honors and.",
            "The data models behind for almost 10 years, but also there's a large number of people involved can't be mentioned here.",
            "And I just wanted to mention that if you're interested in linked data in linguistics, we have a contributed."
        ],
        [
            "Volume.",
            "And we have this URL for the working group and at the moment I'm talking to different people that develop RDF specifications for NLP and corpora.",
            "And if you're interested in contributing to this, then just send me an email.",
            "Thank you.",
            "So thanks again for the talk, is more a command in the question, so obviously you have already tide link with nice and I think it's great progress because this topic is of crucial importance.",
            "So now we got power.",
            "We got nice.",
            "We got you next.",
            "So imagine already ontology lexica.",
            "It's a community group at Deborah See which means that everybody can participate.",
            "You don't have to be a double team member to be in and I think it's the right forearm to now.",
            "Get together and get a single specification.",
            "Simple to use clear use case applications and implementations.",
            "So let's gather to really push that into a standard.",
            "Now definitely actually I would like to add that I am in just not very active so far.",
            "And actually my at that I'm one of the organizers of the Community group.",
            "I think there are still that there still orthogonal issues.",
            "Here's easy as just saying, let's bring everything together, but we can discuss open for everything.",
            "Just want one question, so I think it's great progress to you know.",
            "See our RDF being applied to the modern corpora I'm.",
            "I tend to think about what story do we tell these people that in the last 10 years have been developing all these XML standoff models right?",
            "So what is our story?",
            "Is it I mean forget about what you've been doing in the last 10 years because we have better models, more flexible querying?",
            "Or are these two parallel universes that coexist?",
            "But what is your story?",
            "What you tell them?",
            "When you talk about these things, that's a very good point.",
            "Actually, I was to Eric last week and we had a number of presentations on Paola on earlier on the working group, and we also had a workshop that was organized by by Nancy I'd, which is behind the ice initiative and behind the graph format.",
            "So the state of the art and she's very open so.",
            "We keep talking to each other and at the moment my official position is that you would say we have all these efforts invested in standard XML into a certain extent.",
            "There are architectures available that can process standard XML.",
            "We have the understated base and Nancy has a project when in any pipeline is defined on the basis of graph, which is all reasonable efforts and also preserved.",
            "However, you might think of the existing format as being one serialization of a more abstract data model and then think of the RDF representation as another representation of this abstract data model.",
            "Actually, that's pretty much the same as people did for LMF&F is not indeed not an XML data model, it's an abstract data model which just a serialized in XML, and you could argue in the same in a similar way that RDF representations are.",
            "Essentially, implementations of element for specific infrastructures.",
            "So As for polar you might remember this other polar with AU.",
            "This is also instead of XML format and I would like to keep some isomorphic and mappable.",
            "So for different applications different formats and for querying RDF might be the weapon of choice.",
            "Speaker guess we ran out of time."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The work I'm presenting here is not actually from ISI, where I'm at the moment it's from the University of Potsdam.",
                    "label": 0
                },
                {
                    "sent": "It was developed at these unfortunates.",
                    "label": 0
                },
                {
                    "sent": "Pi 360, Six 132, in the context of a collaborative Research Center where different linguistics projects were actually concerned with exchanging their data and developing a database.",
                    "label": 0
                },
                {
                    "sent": "First, give some background information about.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "State of the art formats for the interoperable interoperable representation of corpora.",
                    "label": 0
                },
                {
                    "sent": "Then introduce Paola and discuss some aspects of having corporate representatives linked data.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Corpora a corpus in general speaking as a collection of text which is developed to analyze language and or to develop tools for this purpose, and usually corpora involve linguistic annotations, which can be a very different types.",
                    "label": 1
                },
                {
                    "sent": "Also, different communities may be involved which maintain their own terminology which developed their own tools, and annotations can be applied to different languages.",
                    "label": 0
                },
                {
                    "sent": "So there's a challenge of interoperability to establish interoperability between all these different corpora between annotations produced by different tools for the same text.",
                    "label": 0
                },
                {
                    "sent": "And somehow we have to deal with that.",
                    "label": 0
                },
                {
                    "sent": "Probability here includes two aspects.",
                    "label": 0
                },
                {
                    "sent": "One is structural interoperability.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This to choose a representation formalism that provides a unified access to and integration of information from different sources.",
                    "label": 1
                },
                {
                    "sent": "So for example, you would like to query annotations from different annotation layers from the same corpus.",
                    "label": 0
                },
                {
                    "sent": "The second aspect is conceptual interoperability, which means we would like to use the same vocabulary and different different resources, say different corpora, so that you can combine the information in an unrestricted way so it would be great if we could have equivalent part of speech definitions for different corpora, which is only part.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Only the case today.",
                    "label": 0
                },
                {
                    "sent": "I'm basically focusing on structural interoperability and with respect to this, the state of the art can be.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Rust as follows.",
                    "label": 0
                },
                {
                    "sent": "State of the art approaches are usually based on a graph based data model.",
                    "label": 1
                },
                {
                    "sent": "So one example, the idea behind this is that labeled directed graphs are capable to generalize over any type of linguistic annotation.",
                    "label": 1
                },
                {
                    "sent": "Since Bird and Lieberman this has been accepted more or less by the community at the moment.",
                    "label": 0
                },
                {
                    "sent": "The standard approach to represent this would be by using standoff XML.",
                    "label": 0
                },
                {
                    "sent": "A standard XML means that the primary data, say the text and the different annotation layers are all stored and physically separated XML files.",
                    "label": 0
                },
                {
                    "sent": "And of course.",
                    "label": 0
                },
                {
                    "sent": "Connections between these files have to be established, and this is usually done by means of X links pointer references.",
                    "label": 0
                },
                {
                    "sent": "When I say this is the state of the art, then I should probably add that this is the basis for the currently developed standard ISO standard for linguistic annotation in the context of the linguistic annotation framework.",
                    "label": 0
                },
                {
                    "sent": "This is how it looks like, so we have a sentence here.",
                    "label": 0
                },
                {
                    "sent": "Doesn't and land was being divided.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is represented in the text file.",
                    "label": 0
                },
                {
                    "sent": "Then there's an XML file that defines a different segment, which is this history Greeks egg.",
                    "label": 0
                },
                {
                    "sent": "Then there's a file with part of speech annotations is to recreate PT Doc, XML and another file with the syntax annotations, which points to the part of speech annotations.",
                    "label": 0
                },
                {
                    "sent": "You can do this for syntax, but of course you can do the same for semantic annotations, and for this specific example we also have framed it annotations.",
                    "label": 0
                },
                {
                    "sent": "This is interoperable and this is integrated because everything refers to the same segments and so you can formulate a query that addresses aspects of the semantic annotations and aspects of the syntactic annotations.",
                    "label": 0
                },
                {
                    "sent": "The problem here is.",
                    "label": 0
                },
                {
                    "sent": "Although.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have established interoperability, in principle at least.",
                    "label": 0
                },
                {
                    "sent": "What should I do with this kind of data so you would have to develop some kind of database to query this, and one idea that people come up with first to use XML databases, which is really a bad idea for this kind of data, because your database is optimized for data structure that you don't use.",
                    "label": 0
                },
                {
                    "sent": "And it has also been empirically shown.",
                    "label": 0
                },
                {
                    "sent": "What people do instead is to use relational databases.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I think personally involved in the development of one of such databases and it works relatively well.",
                    "label": 0
                },
                {
                    "sent": "It only has a few disadvantages for suspecta flexibility.",
                    "label": 0
                },
                {
                    "sent": "So if you decide that you have to optimize your database scheme, then you need to integrate, introduce a new index, and then you have to reinitialize the whole database, which leads to long debugging cycles, limited interactivity, and from practical experiences we have seen that there's.",
                    "label": 1
                },
                {
                    "sent": "A certain limits with respect to advance statistical analysis and inipi applications, if these.",
                    "label": 0
                },
                {
                    "sent": "Relational databases that are currently developed for the needs of end users, that is, linguists are to be applied.",
                    "label": 0
                },
                {
                    "sent": "Another proposal is to the graph database.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, this is possible, but one issue here is that you don't have formal types, so if you want to validate your data in order to make sure, for example, that the same element is not used at one place for annotation at another place for some meta data, then you would have to develop your own means of validation.",
                    "label": 0
                },
                {
                    "sent": "And of course, another idea would be.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is to use RDF.",
                    "label": 0
                },
                {
                    "sent": "RDF has data model and underlying data model which is compatible to what standard XML is assuming so.",
                    "label": 1
                },
                {
                    "sent": "Formalizes a label directed Multigraph.",
                    "label": 0
                },
                {
                    "sent": "But as opposed to standard XML formats, it's come it comes with a certain infrastructure, so we have triple stores, query languages, and more over there some languages that allow to define your own vocabulary and to validate it.",
                    "label": 1
                },
                {
                    "sent": "In particular only L. The approach here is to adopt an existing state of the art model for interoperable corpus representations.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Which is polar.",
                    "label": 0
                },
                {
                    "sent": "Then, to formalize this data model as an old DL entology?",
                    "label": 1
                },
                {
                    "sent": "And then to convert string of XML specifications into RDF.",
                    "label": 1
                },
                {
                    "sent": "So far converter has been implemented for to represent graph which is the format used by the ICE initiative to this polar.",
                    "label": 0
                },
                {
                    "sent": "And in order to show that this is actually a suitable approach.",
                    "label": 0
                },
                {
                    "sent": "Query language was implemented that was developed for querying multilayer corpora, and it could be I could show that it's relatively easy to do this by using sparkle macros.",
                    "label": 0
                },
                {
                    "sent": "This is the polar on top.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Elogy it's not quite complete, but the most important elements are here, so the top level element is the power element.",
                    "label": 0
                },
                {
                    "sent": "And the two most important sub concepts are node and relation.",
                    "label": 0
                },
                {
                    "sent": "Further, there are some classes for to represent corpus infrastructure.",
                    "label": 0
                },
                {
                    "sent": "So we have the concept of a layer which corresponds to these colored background.",
                    "label": 0
                },
                {
                    "sent": "As we have seen in the first image.",
                    "label": 0
                },
                {
                    "sent": "And you have the concept of a document.",
                    "label": 0
                },
                {
                    "sent": "And instances of layer and document are then linked with specific annotations.",
                    "label": 0
                },
                {
                    "sent": "There are different subclasses of node, in particular non terminal and terminal where a terminal is an element directly pointing to the primary data, which does not have a more.",
                    "label": 0
                },
                {
                    "sent": "Specific sub element and on terminal points to terminal or non terminal.",
                    "label": 0
                },
                {
                    "sent": "Root element would be a terminal or a terminal.",
                    "label": 0
                },
                {
                    "sent": "That would be a terminal or non terminal.",
                    "label": 0
                },
                {
                    "sent": "That is, it does not have a parent.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "The number of object properties which describe the relation between nodes relations.",
                    "label": 0
                },
                {
                    "sent": "And between different terminals, for example.",
                    "label": 0
                },
                {
                    "sent": "And of course also the relation between these and the corpus infrastructure.",
                    "label": 0
                },
                {
                    "sent": "And then there are a number of data properties.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Which is not quite complete, so we have had annotation.",
                    "label": 0
                },
                {
                    "sent": "And basically every power element or every node or a nation can be assigned A has annotation.",
                    "label": 0
                },
                {
                    "sent": "One predefined annotation is the hair string property, which points from terminals to strings.",
                    "label": 0
                },
                {
                    "sent": "However, if one.",
                    "label": 0
                },
                {
                    "sent": "Specific type of source data.",
                    "label": 0
                },
                {
                    "sent": "Specifies a certain attribute.",
                    "label": 0
                },
                {
                    "sent": "Then a new has annotation property would be introduced for this, which would consist of has and the name of the attribute name and the value.",
                    "label": 0
                },
                {
                    "sent": "It then became the literal assigned.",
                    "label": 0
                },
                {
                    "sent": "To the corresponding power element and the same exist for meta data which is.",
                    "label": 0
                },
                {
                    "sent": "Approximately the same as has annotation, but only applied to layer and document.",
                    "label": 0
                },
                {
                    "sent": "Here's a small fragment from the graph that we senior form, so we have a known phrase.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which is also subject which dominates an adjective.",
                    "label": 0
                },
                {
                    "sent": "Then points to a segment which refers to the text by some time, and this is the idea of representation.",
                    "label": 0
                },
                {
                    "sent": "So the NP node is a non terminal.",
                    "label": 0
                },
                {
                    "sent": "He has cut corresponds to the to the attribute cut.",
                    "label": 0
                },
                {
                    "sent": "With a literal corresponding to the value of this attribute.",
                    "label": 0
                },
                {
                    "sent": "Has child corresponds to the dominant edge in graph graph?",
                    "label": 0
                },
                {
                    "sent": "And then the adjective would also be a non terminal where the attribute is preserved accordingly and the pointing to the segment would be represented as another has child relation.",
                    "label": 0
                },
                {
                    "sent": "The terminal is.",
                    "label": 0
                },
                {
                    "sent": "The segment that directly points to the text and hasn't had spring attribute with the value by some time.",
                    "label": 0
                },
                {
                    "sent": "So that.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, looks like graphically the concept hierarchy.",
                    "label": 0
                },
                {
                    "sent": "We have a number of individuals and as you might guess from a comparison of the structure of this subtree and this subtree.",
                    "label": 0
                },
                {
                    "sent": "This is basically the same.",
                    "label": 0
                },
                {
                    "sent": "This data structure of course can be easily queried.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sparkle, so for example, if we wanted to retrieve information about the adjective, we could just.",
                    "label": 0
                },
                {
                    "sent": "Query for a node and then.",
                    "label": 0
                },
                {
                    "sent": "Restrict.",
                    "label": 0
                },
                {
                    "sent": "The street the matches to those that have the has MSJ property which is a sub property of his annotation with the valued AJ.",
                    "label": 0
                },
                {
                    "sent": "And then further to those that have a child with a string value Valentine.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Paula data can be trivially queried with sparkle, however it's a little bit verbose and that's why.",
                    "label": 0
                },
                {
                    "sent": "One idea would be to use Sparkle macros instead, which can be, which can be expanded into sparkle.",
                    "label": 0
                },
                {
                    "sent": "And I've done this for a query language for multilayer Corporal.",
                    "label": 1
                },
                {
                    "sent": "Which is reconstructed as sparkle macros, so people can actually use a query language that they are already familiar with and this is automatically transferred into sparkle.",
                    "label": 0
                },
                {
                    "sent": "Yes, this successful reconstruction of this query language, which is called unsquare, guarantees that no linguistic relevant information from the original standard format is lossed.",
                    "label": 1
                },
                {
                    "sent": "The main aspects of the query language of the main operators of the query language of the following.",
                    "label": 0
                },
                {
                    "sent": "So we have done.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Operators say NP dominates inode dominance are known and this can be expanded into the into a query for a polar has child property, plus it's transitive closure of transitivity is required.",
                    "label": 0
                },
                {
                    "sent": "Same for president for presidents before we have seen a property next which holds between different terminals.",
                    "label": 0
                },
                {
                    "sent": "And again next could be.",
                    "label": 0
                },
                {
                    "sent": "Or did not, as a symbol for next, could be expanded to next plus its transitive closure.",
                    "label": 0
                },
                {
                    "sent": "Co extensionality is a little bit more complex.",
                    "label": 1
                },
                {
                    "sent": "Co extensionality means that your query, whether two elements from two different annotation layers.",
                    "label": 1
                },
                {
                    "sent": "Cover the same stretch of primary data.",
                    "label": 0
                },
                {
                    "sent": "So for the example before we had this syntax annotation method.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Semantic annotation and the coax tension allati could be used, for example, to retrieve an element from a syntax annotation.",
                    "label": 0
                },
                {
                    "sent": "To say this NP which cause constant doesn't and land.",
                    "label": 0
                },
                {
                    "sent": "Align that with another one from a semantic annotation, which could be this Fe poll.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Co extensionality can be implemented by checking whether the left and right border are identical.",
                    "label": 1
                },
                {
                    "sent": "There's a kind of approximative implementation, but it's.",
                    "label": 0
                },
                {
                    "sent": "It's done that an existing system and existing systems and to implement this we can actually use the Sparkle Update language and.",
                    "label": 0
                },
                {
                    "sent": "I've done this with “also, which also provides support for transitive for the transitive closure.",
                    "label": 0
                },
                {
                    "sent": "To calculate Accessibility or to represent it, I introduced a new object property that links every node with the first and last terminal that is associated with this.",
                    "label": 1
                },
                {
                    "sent": "The first and last terminal can be extrapolated from the has child properties and different from the polar next property so.",
                    "label": 0
                },
                {
                    "sent": "Using these Sparkle update language expressions, you can establish new properties first terminal at last terminal and then define a replacement or a macro for the Co extensionality operator.",
                    "label": 0
                },
                {
                    "sent": "So if RA is supposed to be coextensive, extensional with B, you can just query whether A is the first, has the first terminal C&A, has a last terminal D&B, has a first terminal, C&B has a last terminal D. Let's actually India.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's one of the advantages of using an RDF database as compared to relational database.",
                    "label": 0
                },
                {
                    "sent": "So in case you need to pre compile fragments of your query on casing is to optimize your data structures.",
                    "label": 0
                },
                {
                    "sent": "You can just do this by introducing new triples and without the need to reinitialize your database, which saves a lot of time.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So far.",
                    "label": 0
                },
                {
                    "sent": "With the polar as described so far, copper can be represented in RDF.",
                    "label": 1
                },
                {
                    "sent": "It comes with a formal data model formalized in Odl.",
                    "label": 1
                },
                {
                    "sent": "It allows the lossless representation of newest information and that is lossless can be shown by reconstr ability of an SQL in sparkle macros and its instructionally interoperable formalization of any kind of linguistic information.",
                    "label": 0
                },
                {
                    "sent": "This is not actually a claim that I have to make here, but this is rather characteristics that is inherited from the underlying data model.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Cause one advantage of having RDF specifications of linguistic corpora is that they can be linked with other data.",
                    "label": 0
                },
                {
                    "sent": "For example, the data model can be grounded in other schemes, or the data can be linked to terminology repositories to lexical semantic networks.",
                    "label": 1
                },
                {
                    "sent": "And of course, there's.",
                    "label": 1
                },
                {
                    "sent": "We can hope that there's some kind of network effects.",
                    "label": 0
                },
                {
                    "sent": "That arises by connecting different resources As for schemes, polar is with us.",
                    "label": 0
                },
                {
                    "sent": "Back to the corpus organization.",
                    "label": 0
                },
                {
                    "sent": "Paula is grounded in Dublin Core.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So a polar layer is a data set in the sense that data is encoded in a defined structure here.",
                    "label": 1
                },
                {
                    "sent": "Oppana document is a collection in the sense that it accumulates multiple instances of polar document layer.",
                    "label": 0
                },
                {
                    "sent": "Oppana document layer means that for specific piece of text which is recognized as a document and receives an ID, one specific annotation syntax is annotated.",
                    "label": 0
                },
                {
                    "sent": "And this is the basic organizational unit of polar.",
                    "label": 1
                },
                {
                    "sent": "You might notice that there's no no such thing like text in polar, because taxes represented in string values.",
                    "label": 0
                },
                {
                    "sent": "There are possibilities to establish ties between the text and the polar data structures, but polar is just concerned with the representation of the text in all its annotations in RDF.",
                    "label": 0
                },
                {
                    "sent": "As for the linguistic annotations, there's a.",
                    "label": 0
                },
                {
                    "sent": "Close relationship between Poland and if the interpreter.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This format.",
                    "label": 0
                },
                {
                    "sent": "How?",
                    "label": 0
                },
                {
                    "sent": "The string and NIF is basically a polar node.",
                    "label": 0
                },
                {
                    "sent": "The difference here is that the polar node can exist without being anchored in text, whereas in if string is always grounded in text.",
                    "label": 1
                },
                {
                    "sent": "The property polar her string is very similar to an anchor of in if.",
                    "label": 0
                },
                {
                    "sent": "They're very similar in the sense that they describe the same information.",
                    "label": 0
                },
                {
                    "sent": "However, in polar has, spring is a property of terminals, and it's a defining property of terminals, whereas in if anchor off is obligatory for every string.",
                    "label": 0
                },
                {
                    "sent": "So every node so there can be established ties between both notions, but want to develop some kind of generalization.",
                    "label": 0
                },
                {
                    "sent": "Further, there's the notion of relation and power, which is not presented in if at the moment.",
                    "label": 0
                },
                {
                    "sent": "Together with Dustin Hoffman, who's the one developing the end of the interchange format, currently working on a matter between Polnareff, which will basically be another member from Nefta Polar.",
                    "label": 0
                },
                {
                    "sent": "So, but this is still ongoing work.",
                    "label": 0
                },
                {
                    "sent": "So that much about schemas another.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Checked where?",
                    "label": 0
                },
                {
                    "sent": "Corporate can be linked with.",
                    "label": 0
                },
                {
                    "sent": "Other resources would be to ground the corpus or to link it with the terminology repository.",
                    "label": 0
                },
                {
                    "sent": "At the moment, a number of terminology repository's are in existence, so there's for example the general ontology of linguistic description, the goal ontology.",
                    "label": 0
                },
                {
                    "sent": "There's ice occurred, registry developed or maintained by so that accumulates, for example, linguistic categories, and they also provide an RDF representation.",
                    "label": 0
                },
                {
                    "sent": "Then there are further ontologies developed in either NLP or in typology.",
                    "label": 0
                },
                {
                    "sent": "This architecture, the ontologies of linguistic description.",
                    "label": 1
                },
                {
                    "sent": "Basically, formalizing relation between annotation.",
                    "label": 0
                },
                {
                    "sent": "Schemes and these reference this existing terminology impostors by providing an intermediate level of representation, which is this so called reference model and different ontologies that represent annotation schemes, say pen for English and then map to this reference model and then further to the terminology repository's.",
                    "label": 0
                },
                {
                    "sent": "If you have this kind of structure, it's relatively easy to establish a connection between your annotations that you have which are in polar represented as strings as literals and.",
                    "label": 0
                },
                {
                    "sent": "Such an annotation model.",
                    "label": 1
                },
                {
                    "sent": "So, given one particular polar individual and the information that the annotations of this individual match the annotations in a specific annotation model.",
                    "label": 0
                },
                {
                    "sent": "So you have to know which has annotation property corresponds to which annotation model.",
                    "label": 0
                },
                {
                    "sent": "Then you can declare that this polar individual is an instance of the corresponding earlier class.",
                    "label": 1
                },
                {
                    "sent": "The linking here is established through subclass of relationships, so if these individual is then an instance of the audio class, you can infer that it's also an instance of the gold class at the ice o'clock class, which establishes interoperability between.",
                    "label": 0
                },
                {
                    "sent": "Anything that points to gold or ice account.",
                    "label": 0
                },
                {
                    "sent": "And that's what it looks like again, these.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Those of fragments from the trio show before and the other one is the noun phrase and the lower one is the adjective.",
                    "label": 0
                },
                {
                    "sent": "Instead of saying the adjective has the property has MSJ JJ.",
                    "label": 0
                },
                {
                    "sent": "We now can say that this adjective is an adjective.",
                    "label": 0
                },
                {
                    "sent": "The PEN Ontology is then linked through subclass of relationship to the earlier reference model, which says it's an adjective, and this again is fortling to gold, gold adjective, and to Isaac at, which is the data category 12:30.",
                    "label": 0
                },
                {
                    "sent": "You can use this information now for querying corpora.",
                    "label": 0
                },
                {
                    "sent": "So and instead of saying JJ is a note with this annotation, you just say DJ isn't all your adjective or a gold objective or whatever.",
                    "label": 0
                },
                {
                    "sent": "By doing so, we achieve a level of conceptual interoperability, so it doesn't really matter which kind of string.",
                    "label": 0
                },
                {
                    "sent": "Standing here as long as we know that this is a relationship is holding so it can define queries that are applicable to different corpora of different annotations.",
                    "label": 0
                },
                {
                    "sent": "In a similar way, linguistic corpora can link can be linked with lexical semantic resources, for example word.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You manually annotated sub couples that are used as example here.",
                    "label": 0
                },
                {
                    "sent": "Also contains, for example, annotations, pertinent sensors.",
                    "label": 0
                },
                {
                    "sent": "And if the syntactic annotations and they weren't, annotations are represented in a single graph document, which is something they work on at the moment.",
                    "label": 0
                },
                {
                    "sent": "Then it can be just converted to polar like any other graph data structure.",
                    "label": 0
                },
                {
                    "sent": "And then it's relatively trivial to write a transducer that replaces these string values with references to an RDF version of Word NET and in the end it would be absolutely analogously to the linking with the terminology repositories.",
                    "label": 1
                },
                {
                    "sent": "The current.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let us in the ontology is available from this URL, and there's a kind of proof of principle implementation so far.",
                    "label": 0
                },
                {
                    "sent": "Two datasets have been converted, one is the legal corpus, a German newspaper corpus annotated for syntax and Coreference, and the mass corpus which is an American corpus of American English which is jargon balanced and annotated on multiple annotation layers.",
                    "label": 0
                },
                {
                    "sent": "As for tools, there are converters from target XML tapola from graph to Paula Ann from some proprietary formats and there's a query preprocessor for these sparkle macros and mentioned before, which is also available.",
                    "label": 0
                },
                {
                    "sent": "What is soon to come is.",
                    "label": 0
                },
                {
                    "sent": "Just last week I talked to people from the ISO which also behind the mask.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Focus and the promise to provide space and probably a sparkle in point to distribute the mask and RDF version.",
                    "label": 0
                },
                {
                    "sent": "And the URL would be this agency or mask.",
                    "label": 0
                },
                {
                    "sent": "Further, I'm working on the conversion of additional datasets, namely Europol, which is corpus of EU documents.",
                    "label": 0
                },
                {
                    "sent": "The judgment said multiple languages, and aligned with each other, so it's a different kind of data structure.",
                    "label": 0
                },
                {
                    "sent": "To illustrate the flexibility of Poland.",
                    "label": 0
                },
                {
                    "sent": "And of course, the current implementation is a straightforward implementation of the existing data model.",
                    "label": 0
                },
                {
                    "sent": "And it would be desirable to perform some optimizations to make sure that it's also performed so for certain types of linguistic queries it needs to be optimized in a similar way as it goes down here for the Coke sensuality.",
                    "label": 0
                },
                {
                    "sent": "Established a number of corporations.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I already have a longer cooperation with the people behind the enemy interchange format, and we're currently working on a matter between both formats.",
                    "label": 0
                },
                {
                    "sent": "Some newer corporations are with the W3C Working Group on Open Annotation.",
                    "label": 1
                },
                {
                    "sent": "That are interested in representing linguistic annotations.",
                    "label": 1
                },
                {
                    "sent": "In the context of their framework and we just worked out a mapping between polar and the augmentation specifications, and further there is an alternative RDF nization of graph.",
                    "label": 0
                },
                {
                    "sent": "The key difference between this idea of representation and polar is that it's focused on the under on the level of layer.",
                    "label": 0
                },
                {
                    "sent": "So it does not provide an audio view of the entire document with all its annotations.",
                    "label": 0
                },
                {
                    "sent": "And it also does not provide information about strings, so it just preserves the existing graph references to the text.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, these don't have a well defined semantics in RDF terms, but working on that and I think.",
                    "label": 0
                },
                {
                    "sent": "From a Corporation, some optimizations for queries will arise.",
                    "label": 0
                },
                {
                    "sent": "To a certain extent, these corporations take place in the context of the open Linguistics working group.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Lots of working group of as part of the Open Knowledge Foundation that we founded in late 2010 and we try to promote the use of open resources in linguistics and several members are also interested in using RDF for their specific data and for different reasons.",
                    "label": 0
                },
                {
                    "sent": "So for example, we have datasets from typology where people collect features of languages for a large number of languages, but without actually providing the data just recording your feature.",
                    "label": 0
                },
                {
                    "sent": "So for example, a language has a passive construction, something like this.",
                    "label": 0
                },
                {
                    "sent": "This is what you can find in Languedoc.",
                    "label": 0
                },
                {
                    "sent": "Together with references to the bibliography.",
                    "label": 0
                },
                {
                    "sent": "Something similar is provided by Foible, which is an inventory of phonologic phonological.",
                    "label": 0
                },
                {
                    "sent": "Inventories of different languages.",
                    "label": 0
                },
                {
                    "sent": "The World Atlas of linguistic structures.",
                    "label": 0
                },
                {
                    "sent": "Records structures similar to this passive example I had before.",
                    "label": 0
                },
                {
                    "sent": "Yes, let's go and linkboy our resources that are relatively unknown from the linked open data Cloud.",
                    "label": 0
                },
                {
                    "sent": "I talked a bit about audio, the annotation models, and the reference model and also mentioned Golden Ice occurred.",
                    "label": 0
                },
                {
                    "sent": "And these are there are shown in orange.",
                    "label": 0
                },
                {
                    "sent": "Here are metadata in terminology repositories that are specific to linguistics.",
                    "label": 0
                },
                {
                    "sent": "Of course, the more traditional class of resources that is actually also available to a certain extent from the League of Data Cloud is shown in green here, which includes lexical semantic resources.",
                    "label": 0
                },
                {
                    "sent": "Including different instantiations of Wordnet.",
                    "label": 0
                },
                {
                    "sent": "Burn it in different languages.",
                    "label": 0
                },
                {
                    "sent": "For example, the Dutch word cornetto.",
                    "label": 0
                },
                {
                    "sent": "But also audio versions of Wiktionary.",
                    "label": 0
                },
                {
                    "sent": "The DB Pedia is an RDF version of the Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "And so on.",
                    "label": 0
                },
                {
                    "sent": "And further we have the group of annotated corpora and schemes for the annotation, which is something that I'm specifically interested in.",
                    "label": 0
                },
                {
                    "sent": "The opening was still working.",
                    "label": 0
                },
                {
                    "sent": "Group is basically open to everyone interested in.",
                    "label": 0
                },
                {
                    "sent": "Linguistic resources and all the publication under open licenses down here.",
                    "label": 0
                },
                {
                    "sent": "And there's the URL linguistics dot OK and org slash NOD for this diagram.",
                    "label": 0
                },
                {
                    "sent": "Yes, and having this kind of.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Structure we actually observe the number of network effects between researchers behind different nodes in this diagram, so you might know DPS Spotlight, which takes text as input and assigns it different annotations.",
                    "label": 1
                },
                {
                    "sent": "So for example, while by isn't online was divided, it generates different references to the pedia, including Byzantine Empire present on architecture.",
                    "label": 0
                },
                {
                    "sent": "Pleasanton are with different probabilities.",
                    "label": 0
                },
                {
                    "sent": "I just talked to to problem in Tesco implemented DPS Spotlight and he mentioned that his invalidation prob.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Because it doesn't have manually annotated DPS sensors for anything.",
                    "label": 0
                },
                {
                    "sent": "However, for this kind of diagram or with this kind of structure we can generate.",
                    "label": 0
                },
                {
                    "sent": "Test data for DPS Spotlight.",
                    "label": 0
                },
                {
                    "sent": "Assuming that we have a mapping between Vernon sensors and eupedia concepts, or Wikipedia pages, which is something something that people have been working on for the last few years, and several are available, then we can use the manual word annotations in a mass corpus.",
                    "label": 0
                },
                {
                    "sent": "To verify whether word really refers to the DB Pedia concept that Peter Spotlight suggests.",
                    "label": 1
                },
                {
                    "sent": "For the mascarpone concrete example for the sentence that we were discussing, is this this censky Byzantine 310 which pertains to Byzantine Empire 1:15, and so on.",
                    "label": 0
                },
                {
                    "sent": "And of course this can be relatively unambiguously associated with the Pedia page for Byzantine Empire.",
                    "label": 0
                },
                {
                    "sent": "So what we have at the moment and that we didn't have before is manually annotated, test and train data for DB pedia Spotlight.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you for your attention.",
                    "label": 0
                },
                {
                    "sent": "I would also like to thank all the people involved with him working on polar honors and.",
                    "label": 0
                },
                {
                    "sent": "The data models behind for almost 10 years, but also there's a large number of people involved can't be mentioned here.",
                    "label": 0
                },
                {
                    "sent": "And I just wanted to mention that if you're interested in linked data in linguistics, we have a contributed.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Volume.",
                    "label": 0
                },
                {
                    "sent": "And we have this URL for the working group and at the moment I'm talking to different people that develop RDF specifications for NLP and corpora.",
                    "label": 1
                },
                {
                    "sent": "And if you're interested in contributing to this, then just send me an email.",
                    "label": 1
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "So thanks again for the talk, is more a command in the question, so obviously you have already tide link with nice and I think it's great progress because this topic is of crucial importance.",
                    "label": 0
                },
                {
                    "sent": "So now we got power.",
                    "label": 0
                },
                {
                    "sent": "We got nice.",
                    "label": 0
                },
                {
                    "sent": "We got you next.",
                    "label": 0
                },
                {
                    "sent": "So imagine already ontology lexica.",
                    "label": 0
                },
                {
                    "sent": "It's a community group at Deborah See which means that everybody can participate.",
                    "label": 0
                },
                {
                    "sent": "You don't have to be a double team member to be in and I think it's the right forearm to now.",
                    "label": 0
                },
                {
                    "sent": "Get together and get a single specification.",
                    "label": 0
                },
                {
                    "sent": "Simple to use clear use case applications and implementations.",
                    "label": 0
                },
                {
                    "sent": "So let's gather to really push that into a standard.",
                    "label": 0
                },
                {
                    "sent": "Now definitely actually I would like to add that I am in just not very active so far.",
                    "label": 0
                },
                {
                    "sent": "And actually my at that I'm one of the organizers of the Community group.",
                    "label": 0
                },
                {
                    "sent": "I think there are still that there still orthogonal issues.",
                    "label": 0
                },
                {
                    "sent": "Here's easy as just saying, let's bring everything together, but we can discuss open for everything.",
                    "label": 0
                },
                {
                    "sent": "Just want one question, so I think it's great progress to you know.",
                    "label": 0
                },
                {
                    "sent": "See our RDF being applied to the modern corpora I'm.",
                    "label": 0
                },
                {
                    "sent": "I tend to think about what story do we tell these people that in the last 10 years have been developing all these XML standoff models right?",
                    "label": 0
                },
                {
                    "sent": "So what is our story?",
                    "label": 0
                },
                {
                    "sent": "Is it I mean forget about what you've been doing in the last 10 years because we have better models, more flexible querying?",
                    "label": 0
                },
                {
                    "sent": "Or are these two parallel universes that coexist?",
                    "label": 0
                },
                {
                    "sent": "But what is your story?",
                    "label": 0
                },
                {
                    "sent": "What you tell them?",
                    "label": 0
                },
                {
                    "sent": "When you talk about these things, that's a very good point.",
                    "label": 0
                },
                {
                    "sent": "Actually, I was to Eric last week and we had a number of presentations on Paola on earlier on the working group, and we also had a workshop that was organized by by Nancy I'd, which is behind the ice initiative and behind the graph format.",
                    "label": 0
                },
                {
                    "sent": "So the state of the art and she's very open so.",
                    "label": 0
                },
                {
                    "sent": "We keep talking to each other and at the moment my official position is that you would say we have all these efforts invested in standard XML into a certain extent.",
                    "label": 0
                },
                {
                    "sent": "There are architectures available that can process standard XML.",
                    "label": 0
                },
                {
                    "sent": "We have the understated base and Nancy has a project when in any pipeline is defined on the basis of graph, which is all reasonable efforts and also preserved.",
                    "label": 0
                },
                {
                    "sent": "However, you might think of the existing format as being one serialization of a more abstract data model and then think of the RDF representation as another representation of this abstract data model.",
                    "label": 0
                },
                {
                    "sent": "Actually, that's pretty much the same as people did for LMF&F is not indeed not an XML data model, it's an abstract data model which just a serialized in XML, and you could argue in the same in a similar way that RDF representations are.",
                    "label": 0
                },
                {
                    "sent": "Essentially, implementations of element for specific infrastructures.",
                    "label": 0
                },
                {
                    "sent": "So As for polar you might remember this other polar with AU.",
                    "label": 0
                },
                {
                    "sent": "This is also instead of XML format and I would like to keep some isomorphic and mappable.",
                    "label": 0
                },
                {
                    "sent": "So for different applications different formats and for querying RDF might be the weapon of choice.",
                    "label": 0
                },
                {
                    "sent": "Speaker guess we ran out of time.",
                    "label": 0
                }
            ]
        }
    }
}