{
    "id": "6qgfuibeygggtv72vx7n65z5qy5zfhfk",
    "title": "Building the Knowledge base for Climate Change Governance in the SEE",
    "info": {
        "author": [
            "Dr. Miroslav Polzer, Austrian Science and Research Liaison Office Ljubljana"
        ],
        "published": "June 21, 2010",
        "recorded": "May 2010",
        "category": [
            "Top->Environment->Climate Change"
        ]
    },
    "url": "http://videolectures.net/ccandun2010_polzer_bkbc/",
    "segmentation": [
        [
            "I would like to introduce me to support are meeting the knowledge base for climate change.",
            "Governance is southeastern Europe.",
            "Thank you very much ruuska.",
            "So my name is Miroslav Ports and I'm head of Austrian science and research liaison office Ljubljana, and in this capacity I'm also one of the organizers of today's event.",
            "This."
        ],
        [
            "Presentation I would like to.",
            "Raised awareness regarding the importance of innovative ways of knowledge management related to global challenges and especially climate change in Southeastern Europe.",
            "Presented some of the activities that we have already implemented that we are implementing now and that we are planning as the US Ljubljana.",
            "As well as our Center for social innovation in Vienna, which is our career organization, absolute Planner has no status of a legal person.",
            "We are just some kind of Department of the Center for Social Innovation in Vienna which is.",
            "Has a contract with the Austrian Federal Ministry of Science regarding operational of our office.",
            "And then there's a third institution that I'm involved in.",
            "This that's the International Association for the Advancement of Innovative Approaches to global challenges, and I will briefly introduce also some of our activities in this context and.",
            "Want to extend the invitation to those of you who are interested to get involved in our activities?",
            "Entanet?"
        ],
        [
            "Work with us so the starting point is the Austin Research Liaison Office, Ljubljana.",
            "Who are we?",
            "This office has been established 20 years ago.",
            "An instrument of Austrian science policy to support the transition of Slovenia which was at that time is the part of Yugoslavia, but also other neighboring East Central East European countries which have been in the process of political and economic transition, and the scientists had very little financial resources and also little Contacts to Austria and other Western European countries, and so at that time it has been established, established.",
            "And since 2004, we have this focus on the Southeastern Europe.",
            "We are promoting international cyantific operation of Austria, Slovenia and with the South Eastern European countries with a focus on so-called Western Balkan countries.",
            "That means the South Eastern European countries that are not yet members of the European Union and I'm head of as Ljubljana since 1996.",
            "And now to the topic."
        ],
        [
            "While talking about the knowledge base for climate change governance, it's we've heard in several representations that is a very complex issue that there are so many stakeholders and the issue is how to get coherence of the activities and coordination between all the stakeholders and key element in this coordination processes is knowledge, and if we look at why we should.",
            "Focus, especially on global changes.",
            "It's because the global challenges and especially climate change becoming more and more important for the prospects for our life.",
            "For the quality of our life.",
            "And there is a mismatch nowadays.",
            "Between the importance and impact, the potential impact of these global changes and the scientific capacities and the time and resources that we are inventing in investing in working in this area.",
            "And we have to look at what competence is.",
            "Are there in southeastern Europe.",
            "And my conclusion when looking at this from my years of experience in our celebrant is that more action is needed and more coordinated efforts are needed.",
            "And as has been said today or the about this.",
            "Furman Sciences, but also traditional knowledge, is that we need to look also at additional sources of knowledge, not only into science if we want to have a comprehensive look on the knowledge base of the relevant knowledge that has to be put together to address climate change and from our work we have then came to the conclusion together with such nice people like Michael Plaza, that Austria could play.",
            "Leading role and as a pioneer at the point of crystallization for this kind of activities in the region, we have a good strong argument as Austria is host of the UN headquarters.",
            "The biggest UN headquarters, of course in New York.",
            "Then the second one in Geneva and the third is a Vienna, and we have a long tradition of cooperation with South Eastern European countries and central European countries, and therefore we have started this regional center in Southeastern European Colloquium Series about capacity building on global governance and the UN system, and our vision is that we would establish some kind of Southeastern European, regional, global challenges or global governance.",
            "Knowledge management and social innovation.",
            "Competence center in Ljubljana, Slovenia and if possible also with a link to the United Nations University.",
            "But I have to add that this is my personal vision.",
            "More or less.",
            "It's not yet endorsed by our Ministry of Science, but we are working in this direction and also events like today's one is aimed at."
        ],
        [
            "Seeing where the potentials are, where the interests are, and to get more comprehensive understanding what is possible and what is feasible, we have developed graph building the knowledge base for global governance.",
            "We we have them, the global governance stakeholders.",
            "The initial approach has been that global challenges or the climate change is something for international organizations and for national governments.",
            "But we see more and more that this is not enough.",
            "We have to involve business sector.",
            "We have to involve civil society organizations and more and more, especially with regard to climate change.",
            "We see we have to involve each individual because each individual is contributing with its consumption patterns, energy consumption patterns to the climate change program and we have to.",
            "Change the behaviors and attitudes and by building this knowledge base order with them.",
            "But on the other hand, there's also regarding the providers of intellectual resources.",
            "We have research institutes with higher education institutions.",
            "We have business sector, but we have also civil society and each individual citizen with his knowledge and also potential ideas for social innovations.",
            "And we have really to think outside the box and have to look for innovative ways of.",
            "Organizing this manage organizing communication channels that this knowledge from each global citizens comes to center stage and can then be replicated, identified as a good solution if it's if it is and then to be replicated and then we have providers of financial resources for this kind of knowledge management.",
            "We have a public authorities which used to be the focus of research and other knowledge management activities related to global change.",
            "But increasingly also with the UN Global Compact and other initiatives, business sector is being.",
            "Addressed to financially contribute to this kind of endeavors and also the philantrophy sector is in sector."
        ],
        [
            "Which could be.",
            "Address stronger and our Australian science and Research Liaison Office had in Summer 2008 workshop with Academic Council in the United Nations System about building the knowledge base for global governance.",
            "There we have also started our cooperation with Michael and then we've had in June 2008.",
            "During your presidency, a conference about global philanthropists, partners for knowledge based response to climate change and there was a looker has been.",
            "One of our speakers.",
            "We've organized this together with the European Umbrella Organization of Foundations.",
            "It's the European Foundation Center, also with buffoon and Slovenian, UNESCO Commission and we have had also a link to IPCC at that time."
        ],
        [
            "We have organized in March 2008 conference about four site and knowledge based governance responses to climate change.",
            "I don't know if you're familiar with the concept of four side, it's participatory, knowledge based and action oriented way of getting a shared understanding of future developments and also shared a vision of where we as a society want to come too.",
            "And it involves scientists.",
            "Business Sector Public Administration, civil society organizations and more.",
            "Kind of such a future oriented thinking are needed and we are trying to contribute to this with our partnership with Blade form on Europe and we have each year or so far said training seminars for Southeastern European."
        ],
        [
            "Expert then we have been partners of the first regional colloquium on UN studies.",
            "Can the United Nations be taught which was had at the Diplomatic Academy in Vienna?",
            "Michael was the father of this initiative model.",
            "As you can see here.",
            "Also the.",
            "Title of the title page.",
            "Cover page of the proceedings.",
            "The proceedings can be downloaded."
        ],
        [
            "From our home page, if you want.",
            "And with me, let's talk about from Regional Cooperation Council.",
            "We have also discussed recently that we could try perhaps to initiate something in the context of the Danube Strategy of the European Union and also having this knowledge triangle in mind, which you have also found in your brochure for this conference.",
            "It's research, education and innovation have to be brought together new.",
            "The ways of linking these edges of the knowledge triangle and based on the good information, clear communication technology infrastructure have to be used and then they are the pillars of coordination of research and technology, logical development policies and programs in the region.",
            "Information infrastructure pillar with interoperability of environmental information systems in Southeastern Europe and Education, pillar and governance.",
            "Innovation pillars.",
            "We're there regarding this.",
            "Also in good contact with the Center for E Governance Development which is based in Ljubljana Center for E Governance Development in Southeastern Europe.",
            "And this."
        ],
        [
            "The activities we also partners of the end where conference of Annual meeting of the Academic Council on the UN system, which will be held June 3rd to 5th in Vienna.",
            "We have facilitated also the invitation to the President of the Republic of Slovenia, Danilo Turk, who will be the keynote speaker.",
            "Slovenia is one of the partners, the government of Slovenia is part of the event and so we are trying to raise the aware."
        ],
        [
            "This regarding these issues and bid alliances around this and then is 1 relatively new and we hope innovative way of.",
            "Facilitating this change of attitudes and behavior and with a focus on southeastern Europe and this we're doing with the International Association for the Advancement of Innovative Approaches to global challenges.",
            "And this is globeleq can use global changes.",
            "Song World Cup, you know, Global an vicon have bile is the same part of the word.",
            "And then there's also the word can.",
            "Of course, the youth from the back end.",
            "Can contribute to addressing global challenges and one way through which we want to facilitate this is.",
            "Song World Cup.",
            "We have had first round of such a global changes Song World Cup last year with the climate Global Climate Protection campaignsounder50.org and we have with us the winner of the last year's contest contest.",
            "It's Mariano Colunga and he will play today at the reception or is and we have submitted such a proposal now for original Song World Cup.",
            "Within the Alliance of Civilizations, southeastern European Regional Strategy and Intercultural Dialogue and cooperation and also the UNESCO Associated Schools Project Network in Paris, the international coordinators had have said they would be interested to see how we could produce educational materials to include music into education for sustainable development.",
            "And I think that this could be quite interesting for the future.",
            "And further planned activities.",
            "Are there social innovation information system becausw?",
            "In addition to the technological innovations that are needed, we also need social innovations.",
            "Innovations in the way our society is organized.",
            "Our communication is organized the way how we deliver certain services with less material and energy input.",
            "And we have had first.",
            "Discussions with Austrian Energy Agency and we want to prepare pilot within the Austrian Climate Research program through our carrier organization in Vienna and with UNESCO.",
            "Department for Ethics in Science and technology.",
            "We are planning in Autumn Workshop on worst case climate change scenarios and their ethical implications because also this knowledge about ethics and ethics as a key element of our society is a very important and perhaps also one of the leverage is how we can bring about."
        ],
        [
            "Change and the division.",
            "As I said it would be to have really in the long run, some kind of Southeast European or South East European and Central European Regional Center Competence Centre or Center of Excellence.",
            "About global challenges.",
            "Global governance, knowledge management and social innovation in Ljubljana with link to Vienna and Capitals in the region."
        ],
        [
            "And that's it.",
            "Thank you for attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I would like to introduce me to support are meeting the knowledge base for climate change.",
                    "label": 1
                },
                {
                    "sent": "Governance is southeastern Europe.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much ruuska.",
                    "label": 1
                },
                {
                    "sent": "So my name is Miroslav Ports and I'm head of Austrian science and research liaison office Ljubljana, and in this capacity I'm also one of the organizers of today's event.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Presentation I would like to.",
                    "label": 0
                },
                {
                    "sent": "Raised awareness regarding the importance of innovative ways of knowledge management related to global challenges and especially climate change in Southeastern Europe.",
                    "label": 0
                },
                {
                    "sent": "Presented some of the activities that we have already implemented that we are implementing now and that we are planning as the US Ljubljana.",
                    "label": 0
                },
                {
                    "sent": "As well as our Center for social innovation in Vienna, which is our career organization, absolute Planner has no status of a legal person.",
                    "label": 0
                },
                {
                    "sent": "We are just some kind of Department of the Center for Social Innovation in Vienna which is.",
                    "label": 0
                },
                {
                    "sent": "Has a contract with the Austrian Federal Ministry of Science regarding operational of our office.",
                    "label": 0
                },
                {
                    "sent": "And then there's a third institution that I'm involved in.",
                    "label": 0
                },
                {
                    "sent": "This that's the International Association for the Advancement of Innovative Approaches to global challenges, and I will briefly introduce also some of our activities in this context and.",
                    "label": 1
                },
                {
                    "sent": "Want to extend the invitation to those of you who are interested to get involved in our activities?",
                    "label": 0
                },
                {
                    "sent": "Entanet?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Work with us so the starting point is the Austin Research Liaison Office, Ljubljana.",
                    "label": 1
                },
                {
                    "sent": "Who are we?",
                    "label": 0
                },
                {
                    "sent": "This office has been established 20 years ago.",
                    "label": 0
                },
                {
                    "sent": "An instrument of Austrian science policy to support the transition of Slovenia which was at that time is the part of Yugoslavia, but also other neighboring East Central East European countries which have been in the process of political and economic transition, and the scientists had very little financial resources and also little Contacts to Austria and other Western European countries, and so at that time it has been established, established.",
                    "label": 0
                },
                {
                    "sent": "And since 2004, we have this focus on the Southeastern Europe.",
                    "label": 0
                },
                {
                    "sent": "We are promoting international cyantific operation of Austria, Slovenia and with the South Eastern European countries with a focus on so-called Western Balkan countries.",
                    "label": 0
                },
                {
                    "sent": "That means the South Eastern European countries that are not yet members of the European Union and I'm head of as Ljubljana since 1996.",
                    "label": 0
                },
                {
                    "sent": "And now to the topic.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "While talking about the knowledge base for climate change governance, it's we've heard in several representations that is a very complex issue that there are so many stakeholders and the issue is how to get coherence of the activities and coordination between all the stakeholders and key element in this coordination processes is knowledge, and if we look at why we should.",
                    "label": 0
                },
                {
                    "sent": "Focus, especially on global changes.",
                    "label": 0
                },
                {
                    "sent": "It's because the global challenges and especially climate change becoming more and more important for the prospects for our life.",
                    "label": 0
                },
                {
                    "sent": "For the quality of our life.",
                    "label": 0
                },
                {
                    "sent": "And there is a mismatch nowadays.",
                    "label": 0
                },
                {
                    "sent": "Between the importance and impact, the potential impact of these global changes and the scientific capacities and the time and resources that we are inventing in investing in working in this area.",
                    "label": 0
                },
                {
                    "sent": "And we have to look at what competence is.",
                    "label": 0
                },
                {
                    "sent": "Are there in southeastern Europe.",
                    "label": 0
                },
                {
                    "sent": "And my conclusion when looking at this from my years of experience in our celebrant is that more action is needed and more coordinated efforts are needed.",
                    "label": 1
                },
                {
                    "sent": "And as has been said today or the about this.",
                    "label": 0
                },
                {
                    "sent": "Furman Sciences, but also traditional knowledge, is that we need to look also at additional sources of knowledge, not only into science if we want to have a comprehensive look on the knowledge base of the relevant knowledge that has to be put together to address climate change and from our work we have then came to the conclusion together with such nice people like Michael Plaza, that Austria could play.",
                    "label": 0
                },
                {
                    "sent": "Leading role and as a pioneer at the point of crystallization for this kind of activities in the region, we have a good strong argument as Austria is host of the UN headquarters.",
                    "label": 0
                },
                {
                    "sent": "The biggest UN headquarters, of course in New York.",
                    "label": 1
                },
                {
                    "sent": "Then the second one in Geneva and the third is a Vienna, and we have a long tradition of cooperation with South Eastern European countries and central European countries, and therefore we have started this regional center in Southeastern European Colloquium Series about capacity building on global governance and the UN system, and our vision is that we would establish some kind of Southeastern European, regional, global challenges or global governance.",
                    "label": 0
                },
                {
                    "sent": "Knowledge management and social innovation.",
                    "label": 0
                },
                {
                    "sent": "Competence center in Ljubljana, Slovenia and if possible also with a link to the United Nations University.",
                    "label": 0
                },
                {
                    "sent": "But I have to add that this is my personal vision.",
                    "label": 0
                },
                {
                    "sent": "More or less.",
                    "label": 0
                },
                {
                    "sent": "It's not yet endorsed by our Ministry of Science, but we are working in this direction and also events like today's one is aimed at.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Seeing where the potentials are, where the interests are, and to get more comprehensive understanding what is possible and what is feasible, we have developed graph building the knowledge base for global governance.",
                    "label": 0
                },
                {
                    "sent": "We we have them, the global governance stakeholders.",
                    "label": 0
                },
                {
                    "sent": "The initial approach has been that global challenges or the climate change is something for international organizations and for national governments.",
                    "label": 0
                },
                {
                    "sent": "But we see more and more that this is not enough.",
                    "label": 0
                },
                {
                    "sent": "We have to involve business sector.",
                    "label": 0
                },
                {
                    "sent": "We have to involve civil society organizations and more and more, especially with regard to climate change.",
                    "label": 0
                },
                {
                    "sent": "We see we have to involve each individual because each individual is contributing with its consumption patterns, energy consumption patterns to the climate change program and we have to.",
                    "label": 0
                },
                {
                    "sent": "Change the behaviors and attitudes and by building this knowledge base order with them.",
                    "label": 0
                },
                {
                    "sent": "But on the other hand, there's also regarding the providers of intellectual resources.",
                    "label": 0
                },
                {
                    "sent": "We have research institutes with higher education institutions.",
                    "label": 0
                },
                {
                    "sent": "We have business sector, but we have also civil society and each individual citizen with his knowledge and also potential ideas for social innovations.",
                    "label": 0
                },
                {
                    "sent": "And we have really to think outside the box and have to look for innovative ways of.",
                    "label": 0
                },
                {
                    "sent": "Organizing this manage organizing communication channels that this knowledge from each global citizens comes to center stage and can then be replicated, identified as a good solution if it's if it is and then to be replicated and then we have providers of financial resources for this kind of knowledge management.",
                    "label": 0
                },
                {
                    "sent": "We have a public authorities which used to be the focus of research and other knowledge management activities related to global change.",
                    "label": 0
                },
                {
                    "sent": "But increasingly also with the UN Global Compact and other initiatives, business sector is being.",
                    "label": 0
                },
                {
                    "sent": "Addressed to financially contribute to this kind of endeavors and also the philantrophy sector is in sector.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which could be.",
                    "label": 0
                },
                {
                    "sent": "Address stronger and our Australian science and Research Liaison Office had in Summer 2008 workshop with Academic Council in the United Nations System about building the knowledge base for global governance.",
                    "label": 0
                },
                {
                    "sent": "There we have also started our cooperation with Michael and then we've had in June 2008.",
                    "label": 0
                },
                {
                    "sent": "During your presidency, a conference about global philanthropists, partners for knowledge based response to climate change and there was a looker has been.",
                    "label": 0
                },
                {
                    "sent": "One of our speakers.",
                    "label": 0
                },
                {
                    "sent": "We've organized this together with the European Umbrella Organization of Foundations.",
                    "label": 0
                },
                {
                    "sent": "It's the European Foundation Center, also with buffoon and Slovenian, UNESCO Commission and we have had also a link to IPCC at that time.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have organized in March 2008 conference about four site and knowledge based governance responses to climate change.",
                    "label": 0
                },
                {
                    "sent": "I don't know if you're familiar with the concept of four side, it's participatory, knowledge based and action oriented way of getting a shared understanding of future developments and also shared a vision of where we as a society want to come too.",
                    "label": 0
                },
                {
                    "sent": "And it involves scientists.",
                    "label": 0
                },
                {
                    "sent": "Business Sector Public Administration, civil society organizations and more.",
                    "label": 0
                },
                {
                    "sent": "Kind of such a future oriented thinking are needed and we are trying to contribute to this with our partnership with Blade form on Europe and we have each year or so far said training seminars for Southeastern European.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Expert then we have been partners of the first regional colloquium on UN studies.",
                    "label": 0
                },
                {
                    "sent": "Can the United Nations be taught which was had at the Diplomatic Academy in Vienna?",
                    "label": 0
                },
                {
                    "sent": "Michael was the father of this initiative model.",
                    "label": 0
                },
                {
                    "sent": "As you can see here.",
                    "label": 0
                },
                {
                    "sent": "Also the.",
                    "label": 0
                },
                {
                    "sent": "Title of the title page.",
                    "label": 0
                },
                {
                    "sent": "Cover page of the proceedings.",
                    "label": 1
                },
                {
                    "sent": "The proceedings can be downloaded.",
                    "label": 1
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From our home page, if you want.",
                    "label": 0
                },
                {
                    "sent": "And with me, let's talk about from Regional Cooperation Council.",
                    "label": 0
                },
                {
                    "sent": "We have also discussed recently that we could try perhaps to initiate something in the context of the Danube Strategy of the European Union and also having this knowledge triangle in mind, which you have also found in your brochure for this conference.",
                    "label": 0
                },
                {
                    "sent": "It's research, education and innovation have to be brought together new.",
                    "label": 0
                },
                {
                    "sent": "The ways of linking these edges of the knowledge triangle and based on the good information, clear communication technology infrastructure have to be used and then they are the pillars of coordination of research and technology, logical development policies and programs in the region.",
                    "label": 0
                },
                {
                    "sent": "Information infrastructure pillar with interoperability of environmental information systems in Southeastern Europe and Education, pillar and governance.",
                    "label": 0
                },
                {
                    "sent": "Innovation pillars.",
                    "label": 0
                },
                {
                    "sent": "We're there regarding this.",
                    "label": 0
                },
                {
                    "sent": "Also in good contact with the Center for E Governance Development which is based in Ljubljana Center for E Governance Development in Southeastern Europe.",
                    "label": 0
                },
                {
                    "sent": "And this.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The activities we also partners of the end where conference of Annual meeting of the Academic Council on the UN system, which will be held June 3rd to 5th in Vienna.",
                    "label": 0
                },
                {
                    "sent": "We have facilitated also the invitation to the President of the Republic of Slovenia, Danilo Turk, who will be the keynote speaker.",
                    "label": 0
                },
                {
                    "sent": "Slovenia is one of the partners, the government of Slovenia is part of the event and so we are trying to raise the aware.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This regarding these issues and bid alliances around this and then is 1 relatively new and we hope innovative way of.",
                    "label": 0
                },
                {
                    "sent": "Facilitating this change of attitudes and behavior and with a focus on southeastern Europe and this we're doing with the International Association for the Advancement of Innovative Approaches to global challenges.",
                    "label": 0
                },
                {
                    "sent": "And this is globeleq can use global changes.",
                    "label": 0
                },
                {
                    "sent": "Song World Cup, you know, Global an vicon have bile is the same part of the word.",
                    "label": 0
                },
                {
                    "sent": "And then there's also the word can.",
                    "label": 0
                },
                {
                    "sent": "Of course, the youth from the back end.",
                    "label": 0
                },
                {
                    "sent": "Can contribute to addressing global challenges and one way through which we want to facilitate this is.",
                    "label": 0
                },
                {
                    "sent": "Song World Cup.",
                    "label": 0
                },
                {
                    "sent": "We have had first round of such a global changes Song World Cup last year with the climate Global Climate Protection campaignsounder50.org and we have with us the winner of the last year's contest contest.",
                    "label": 0
                },
                {
                    "sent": "It's Mariano Colunga and he will play today at the reception or is and we have submitted such a proposal now for original Song World Cup.",
                    "label": 0
                },
                {
                    "sent": "Within the Alliance of Civilizations, southeastern European Regional Strategy and Intercultural Dialogue and cooperation and also the UNESCO Associated Schools Project Network in Paris, the international coordinators had have said they would be interested to see how we could produce educational materials to include music into education for sustainable development.",
                    "label": 0
                },
                {
                    "sent": "And I think that this could be quite interesting for the future.",
                    "label": 0
                },
                {
                    "sent": "And further planned activities.",
                    "label": 0
                },
                {
                    "sent": "Are there social innovation information system becausw?",
                    "label": 0
                },
                {
                    "sent": "In addition to the technological innovations that are needed, we also need social innovations.",
                    "label": 0
                },
                {
                    "sent": "Innovations in the way our society is organized.",
                    "label": 0
                },
                {
                    "sent": "Our communication is organized the way how we deliver certain services with less material and energy input.",
                    "label": 0
                },
                {
                    "sent": "And we have had first.",
                    "label": 0
                },
                {
                    "sent": "Discussions with Austrian Energy Agency and we want to prepare pilot within the Austrian Climate Research program through our carrier organization in Vienna and with UNESCO.",
                    "label": 0
                },
                {
                    "sent": "Department for Ethics in Science and technology.",
                    "label": 0
                },
                {
                    "sent": "We are planning in Autumn Workshop on worst case climate change scenarios and their ethical implications because also this knowledge about ethics and ethics as a key element of our society is a very important and perhaps also one of the leverage is how we can bring about.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Change and the division.",
                    "label": 0
                },
                {
                    "sent": "As I said it would be to have really in the long run, some kind of Southeast European or South East European and Central European Regional Center Competence Centre or Center of Excellence.",
                    "label": 0
                },
                {
                    "sent": "About global challenges.",
                    "label": 0
                },
                {
                    "sent": "Global governance, knowledge management and social innovation in Ljubljana with link to Vienna and Capitals in the region.",
                    "label": 1
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that's it.",
                    "label": 0
                },
                {
                    "sent": "Thank you for attention.",
                    "label": 0
                }
            ]
        }
    }
}