{
    "id": "6s3iaki4t77l5f2jjwt4zooxketddxpg",
    "title": "Machine Learning, OER and Data Science Jobs",
    "info": {
        "author": [
            "Marko Grobelnik, Artificial Intelligence Laboratory, Jožef Stefan Institute"
        ],
        "published": "Dec. 15, 2017",
        "recorded": "September 2017",
        "category": [
            "Top->Social Sciences->Society",
            "Top->Social Sciences->Education",
            "Top->Technology"
        ]
    },
    "url": "http://videolectures.net/oercongress2017_grobelnik_data_science_jobs/",
    "segmentation": [
        [
            "OK, I'm also from your Stephanie shooters in I am also part of this European Data Science Academy project so but my partner presentation will be more like telling you a little bit more about data science itself and AI and what's happening there and what this is actually so.",
            "So."
        ],
        [
            "Starting with this.",
            "Premise, which everybody agrees I guess.",
            "Also here in the room data science being sexy as drops right of 21st century.",
            "So this was this.",
            "Famous title of the article from Harvard Business Review, analyzing the every bit of this status right and now first, is it true?",
            "It's likely that it's true.",
            "You're not 100% sure there might be something more appealing appearing anytime soon, but.",
            "Not nothing is insight at the moment.",
            "Joke.",
            "And one more serious question, why why data science could be right?",
            "Very appealing and fast growing job for now and for the near future.",
            "1st The World changed a lot, right?",
            "So in science technology from, let's say late 80s or early 90s when everything was very much top down driven.",
            "Politics was top down driven.",
            "Science will stop down, so was model driven and so on.",
            "So, and this, let's say if you go through 90s and early 2000s still now the whole landscape is changing slowly towards this data driven.",
            "Why?",
            "Because now we can measure, observe, collect data and analyze data right?",
            "And so this.",
            "Reflecting many aspects of our life, this can be medicine right in the old times.",
            "Doctor has a model of a disease in his head.",
            "He checked.",
            "The patient may be measured, checked a bit, and then he decided this is.",
            "This is the diagnosis right now.",
            "Now pretty much the machines.",
            "It's not entirely true, but mostly things are changing this direction that machines are measuring the patient, and machines almost decide what was what's wrong with the person, right?",
            "Science changed a lot, specially computer science and many others, so everything is becoming more data driven.",
            "I'm not saying that everything is data driven, but many things are way, way more data driven as in the past, right?",
            "So in this requires skills, how to handle the data, not just how to collect?",
            "Also how to curate, how to analyze and also how to decide based on the data.",
            "And so this is what being data science scientists about.",
            "And these are Sciences, very horizontal area, which touches many, many aspects of our life.",
            "So I will go a little bit deeper in some of these issues on next slides.",
            "If I'm boring, tell me so I can stop."
        ],
        [
            "1st first one quick question where data is actually coming from.",
            "So what changed in this last ten 2030 years?",
            "So here are two pictures which might might explain some some part of this not not entirely.",
            "So the world has roughly.",
            "Uh, 7.5 billion people right now.",
            "Internet users based on this recent counting.",
            "This is like 2017 research is like half half of the people.",
            "Roughly are connected to Internet in one or the other way.",
            "Maybe some are connected just a little bit.",
            "Maybe some are not even aware and there are some which are like me, constantly connected.",
            "So this is just Internet users right?",
            "And then if you narrow down, let's say, social media users, so where you actually share your social life and Internet.",
            "It's amazingly high number, right?",
            "Maybe sounds a bit high, but actually it's not.",
            "So Facebook is reporting just number of Facebook users around 2 billion, and then if you count other social media then you can you come easily to 2.7 billion which is like one sort of the world, right is connected to social media.",
            "One of the other way this means maybe some of these users or good portion of these users is probably just maybe logged in once and never came back right?",
            "So this is always like this, but still will see from this other slide it actually it's in the range of 1 billion per day.",
            "It's we can easily say that one billion per day of people.",
            "Connects to social media so this number is pretty relevant, right?",
            "Mobile users.",
            "5 billion high number probably is true, right?",
            "People you agree.",
            "Yep.",
            "So for this one idea I was not sure I wanted to check.",
            "An active mobile social users is also pretty high, so most of the social social media users are actually so every single person here generates data, but not just people.",
            "Also machines right which I didn't mishear.",
            "Now what happens within one minute?",
            "In the world, so again, this is graph which is pretty much updated every.",
            "Year so I took the recent most recent one.",
            "Let's check just a couple of things, right?",
            "Let's say linked in one of the social media.",
            "So 120 new accounts created every minute.",
            "OK, not very interesting.",
            "Let's say how much money is being spent online every minute.",
            "Let's say in the range of 1,000,000, so.",
            "If you move, check how many millions, how many minutes they has red.",
            "So we come to few billion rent per day.",
            "What else?",
            "2.5 million searches search queries on Google every minute, right?",
            "So this means?",
            "Like a few 100,000 per second, which is roughly true.",
            "Facebook before I said so roughly 1 million 1 million people log in on Facebook every minute.",
            "So again, this would come easily to 1 billion per project.",
            "And what else is relevant?",
            "Tinder yeah so almost 1 million swipes per per minute.",
            "So 1,000,000 for the people who don't know what Tinder is.",
            "So dating sites.",
            "So one 1 million times per minute.",
            "People decide whether some of these good match for him or not.",
            "So this is.",
            "Good example, so this generates data, right?",
            "I didn't even touch areas like Io T machine to machine and many other errors.",
            "OK, now all this data has is first it's collected somewhere.",
            "I won't touch this issue, so how the price of the disk space went down and price of CPU and so on.",
            "All this happened in the meantime as well, but this data is somewhere stored and this data has value in many ways and we just now the question is we want to extract the value from from the data.",
            "And of course for this we need data scientists so This is why I'm explaining this.",
            "So something else happen."
        ],
        [
            "Also in the meantime.",
            "Artificial intelligence, so this is like mother area over data science would be typically part of or.",
            "It's a big overlap between artificial intelligence and.",
            "Data science, let's say if you take mobile phone today, it's full of collecting.",
            "It's collecting data in so many ways, and artificial intelligence is generating the services like speech, recognition of face recognition.",
            "Sensory information by health.",
            "Everything is kind of collected and analyzed, so AI is more like the analysis part.",
            "What happened in the last 18 months, which is sort of even for us working in AI.",
            "Surprising so the amount of investments.",
            "So this is the venture capital map of AI went enormously up.",
            "It has never been like this ever right?",
            "So AI exists like maybe 5060 years, 50 maybe years.",
            "And so this.",
            "Uptake is.",
            "Huge right?",
            "And as a consequence, all the people which at least claim that they do AI or data science they all take.",
            "This is.",
            "One important detail.",
            "Another view to data science and AI."
        ],
        [
            "Some of you might know this Gartner hype hype cycle, so.",
            "You know?",
            "OK, OK, let's analyze them.",
            "The graphs just for the one for the people who don't know.",
            "So Gartner actually publishes like hundred 120 hype cycles per year.",
            "So, and this is just one of them, I think the most relevant one this is hype cycle for emerging technologies.",
            "Other hype cycles are way more narrow, narrowing down particular technology so.",
            "Lifecycle for emergent Technologies puts all the let's say, new technologies on the map and classifieds them along like this horizontal axis like 3 five main categories.",
            "So on the left side being innovation.",
            "Three or so technologies which are coming right which are appearing, and some of them you might not even know that they exist.",
            "But there is a typically community of people which actually do something that's with something with this.",
            "Of technologies like smart dust, 4D printing and so on probably never hurt for some of them.",
            "But you heard for personal analytics and for machine learning and for blockchain and so which are up here.",
            "And this is like inflated expectations.",
            "Blockchain obviously inflated cannot be more right and many others.",
            "And then you know after you're happy and so on.",
            "And after drinking party you have hangovers.",
            "So this is the hangover area and then you wake up and some of some of these technologies actually survive it.",
            "Yeah so this is how you read this.",
            "The party starts the peak of the party and an angle.",
            "So now if you look through all these technologies which are put on the so this is the last the last.",
            "Hype Cycle Gartner published, so it's always published for one year back, right?",
            "So this year they publish it for 2016.",
            "You see that at least half of these technologies is AI and data science in one or the other way.",
            "So this is 1 one possible view, which I think is relevant.",
            "Oh then one more air."
        ],
        [
            "Yeah, which just touch which areas are affected by AI and data science.",
            "So pretty much everything so healthcare so the one which are more like in red right?",
            "So they are more saturated, the ones which are more like light colors are.",
            "Not that saturated, so let's say healthcare, Commerce, IoT and so on.",
            "These are all pretty saturated and very using this AI technologies alot, while the lower ones, let's say a little bit less like real estate.",
            "Government regulators, right physical security, agriculture and so on.",
            "So these are areas that travel and so on.",
            "These are still coming and needs to be filled with this technology.",
            "I mean I'm working in this area and somehow I'm seeing that actually sports.",
            "For instance port is very hot area nowadays in data science, so analyzing everything right.",
            "So every movement every.",
            "Boss of the ball so.",
            "This is happening OK, this is just another view.",
            "What's also relevant I guess."
        ],
        [
            "What about European Commission, right?",
            "So now?",
            "Probably many of you are working on new projects and so you need to decide every 2 three years for new work program and there's a long discussion.",
            "Typically let's a year, year and a half right, and then they come up with the topics and they assign the budget to it.",
            "Now if you look at this.",
            "This still draft, but now in a few weeks this will come official document if you look.",
            "What kind of topics are being funded right?",
            "For 2018, nineteen and 20?",
            "So for the next three years it's I would say more than half is big data.",
            "So data science and AI, and even in this next generation Internet Internet, which is the new term coined by.",
            "Open Commission you see AI right?",
            "So this is so in the next three years you can expect lots of new projects.",
            "In the area OK?",
            "Now, if I have still some time, I can wait.",
            "Yeah so.",
            "I made the quick summary from what?"
        ],
        [
            "Data science area actually is, and what was the job job market?",
            "What are the figures right?",
            "The numbers?",
            "So This is why."
        ],
        [
            "Recent research made by IBM, which is I think.",
            "Pretty well done, so quite believable.",
            "So they're claiming so.",
            "This is just the summary slide and then I will go through some of the components.",
            "So in 2015 they claimed they were like 2.5 million data science and analytics jobs by 2020.",
            "This will go up 15%, which is kind of decent number, right?",
            "So for like 300,000.",
            "Now, not just for data scientist, but also for data engineer.",
            "So data related people.",
            "So the growth is expected around 40%, and so there's some estimate.",
            "I don't know how relevant it is that for this type of job on average would wait a little bit longer to get a job to get fulfilled.",
            "Trees are OK.",
            "They are is our average is like 80,000, which is kind of hired, say, but again, not too hard, but along different.",
            "If now will split this concept of data science."
        ],
        [
            "And analytics into several.",
            "Oh categories which not sure how well you see this.",
            "So if you talk about data science analytics that it would be 2 clusters of jobs, right?",
            "So one is this analytics enabled jobs and data science type of jobs, right?",
            "And this is the math.",
            "You see.",
            "There is very high demand on this analytics.",
            "Able jobs across different industries like finance, health information, manufacturing and so on.",
            "And on the other side you have small demand for this.",
            "What is being called data scientists, advance analysts, but these are.",
            "These are the most so.",
            "So these are really the complete vertical people.",
            "So at the end you want to have this kind of people in your company because they can do everything from.",
            "From from decision making to implementation practically or technical implementation, this would be more like vertical people, domain specific and so they are easier to get their lower Peyton so.",
            "So this is roughly 111 possible view."
        ],
        [
            "Oh OK, here just the proof.",
            "What I just said.",
            "Like if you have data scientists right so here.",
            "Basically, data scientists have all the skills, domain knowledge, visualization, data governance, engineering management and olitical and approaches and machine learning.",
            "Well, let's see if you have.",
            "Data driven decision makers which are technically CEO Cto's and then so on, right so they really need to be specialized and they don't need.",
            "They don't need all the technologies.",
            "So these are kind of easier to get compared to this ones.",
            "Or maybe these two are harder to get and the middle ones are a little bit easier to get."
        ],
        [
            "OK, we saw already.",
            "There are several categories of data science jobs.",
            "I won't go too much into the details here from data scientists, analysts down to decision makers, right?",
            "So these are two sides of the of this job spectrum.",
            "So one side you really want somebody who can crash.",
            "The problem on the other side, you want somebody who can decide upon the solution.",
            "So it is active sites.",
            "No, just to go.",
            "Just to show you a few more graphs."
        ],
        [
            "And then I'm more less finished.",
            "You see that the salaries read for this for the two sides of the spectrum at the highest.",
            "Here and here.",
            "So what are kind of skills this includes, right?",
            "So if we talk about data, science is not always just artificial intelligence."
        ],
        [
            "This.",
            "Magic coming from machine learning and so on.",
            "But of course you need lots of engineering as well, so still so the postings.",
            "This is like for two years ago, so this is traditional data science like squares or the underlying knowing the language.",
            "Right analysis is just the usual statistics and so on and couple of tools.",
            "This is nothing compared to today's data science, right?",
            "Today's data science is way more."
        ],
        [
            "Like this, so if you have like 3 profiles, data scientist, data engineer and OK Finance risk analytics.",
            "So this is the traditional skills baseline skills right?",
            "But these ones are the ones which you really.",
            "Are hyping skills today.",
            "And maybe it's not even true anymore, because today there is a email showing before Tensorflow and there are a couple of other tools which actually would be even more better phase which are not here on the.",
            "This park is already very old to like 2 years, you know.",
            "It's a joke.",
            "It's kind of funny.",
            "This part really appeared not so long time ago, and it's already considered as a standard tool, right?",
            "Compared to, let's say, tools like sauce which is around for I don't know 3040 years right?",
            "Which is still there, right?",
            "OK, and which industries are?"
        ],
        [
            "Demand, I mean the which industries have higher demand for data science and analytics skills, so finance for sure right?",
            "I see I mean.",
            "In our group we have a good portion of portfolio in finance industry.",
            "Then professional cyantific technical services obviously information, so this is it.",
            "And so on.",
            "And then management, manufacturing Beccaria right here would be IP and everything goes and then a couple of other more traditional industries which does mean that actually they don't have needs or money, they're just slower.",
            "I mean in my mind, my understanding that public administration is, well, it's full of opportunities for data science is just that it's.",
            "Typically so slow, and that's why it's only 7% and could easily be way higher.",
            "OK, so this is the last slide.",
            "Any questions so I didn't have any demos and nothing very interesting, but.",
            "I think just wanted to explain that this data science area actually is happening.",
            "It's happening right now.",
            "So and even for us being in the area, we're surprised how fast it develops.",
            "The question why I mean I gave some conceptual, uy data science is happening now in this period of history, right?",
            "But there are a couple of more.",
            "Concrete reasons why it's happening now because there were few.",
            "Breakthroughs in artificial intelligence, which let's say this Tensorflow again, which email was mentioning is.",
            "An example of this, right?",
            "So it's a set of techniques which made computers being able to see to listen to understand many other things which let's say five years ago were just not possible.",
            "And this is one of very very micro reasons why things are happening now.",
            "Not let's say three years ago or somewhere in the future, right?",
            "And this huge gap of talent on the market.",
            "So if you pretty much sum up every every everybody who is already working in the industry, everybody who is in the process of education and everybody who's expected to be educated, it's still not enough.",
            "Based on the demands.",
            "So this is this is the equation which.",
            "Needs to be understood, friend.",
            "Now just to wrap right?",
            "So going back to this open education resources.",
            "Today it was we mentioned already this.",
            "Videolectures.net, right, so this is a good example of.",
            "So.",
            "Office service which.",
            "Which covers data science and machine learning.",
            "So alot thread so we have like over 20,000.",
            "You see, we covered so far.",
            "I mean why I'm saying be because my group is doing this or our group so we covered over 2000 events.",
            "Event can be huge events like.",
            "With few 100 presentations and so on, or small workshop like this, right?",
            "So it can be everything.",
            "We have 15,000 authors over 23,000 videos, so with strong bias over that official intelligence machine learning data science, but many other areas, right?",
            "So here on the left you see I mean just live picture of how this works.",
            "What are people watching right now?",
            "This moment, right?",
            "So how you read this?",
            "Deep learning this is this area which I said that made huge change in.",
            "Data science in the last couple of years.",
            "So deep learning summer school so searching people are watching this moment deep learning materials from deep learning summer school.",
            "Generative models this kind of belongs to this neural networks.",
            "Again the same topic.",
            "Theoretical neuroscience.",
            "Socrates doesn't belong here, or maybe just a bit.",
            "OK, this one I don't know.",
            "So this is the actual picture of what is current interests.",
            "So everybody wants to know this right?",
            "Because there's such a demand on the market and this is this was seen from what you know showing before.",
            "Here we see the live picture of people actually learning this so that they can get a job.",
            "OK, so.",
            "I was showing these video lectures basically because of this because whenever I open it, this is so safe.",
            "Guess whenever I open this deep learning will will will be up here for.",
            "Huh?",
            "OK, thanks if there's any questions I'm happy to answer."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, I'm also from your Stephanie shooters in I am also part of this European Data Science Academy project so but my partner presentation will be more like telling you a little bit more about data science itself and AI and what's happening there and what this is actually so.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Starting with this.",
                    "label": 0
                },
                {
                    "sent": "Premise, which everybody agrees I guess.",
                    "label": 0
                },
                {
                    "sent": "Also here in the room data science being sexy as drops right of 21st century.",
                    "label": 1
                },
                {
                    "sent": "So this was this.",
                    "label": 0
                },
                {
                    "sent": "Famous title of the article from Harvard Business Review, analyzing the every bit of this status right and now first, is it true?",
                    "label": 1
                },
                {
                    "sent": "It's likely that it's true.",
                    "label": 0
                },
                {
                    "sent": "You're not 100% sure there might be something more appealing appearing anytime soon, but.",
                    "label": 0
                },
                {
                    "sent": "Not nothing is insight at the moment.",
                    "label": 0
                },
                {
                    "sent": "Joke.",
                    "label": 0
                },
                {
                    "sent": "And one more serious question, why why data science could be right?",
                    "label": 1
                },
                {
                    "sent": "Very appealing and fast growing job for now and for the near future.",
                    "label": 0
                },
                {
                    "sent": "1st The World changed a lot, right?",
                    "label": 1
                },
                {
                    "sent": "So in science technology from, let's say late 80s or early 90s when everything was very much top down driven.",
                    "label": 0
                },
                {
                    "sent": "Politics was top down driven.",
                    "label": 1
                },
                {
                    "sent": "Science will stop down, so was model driven and so on.",
                    "label": 0
                },
                {
                    "sent": "So, and this, let's say if you go through 90s and early 2000s still now the whole landscape is changing slowly towards this data driven.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because now we can measure, observe, collect data and analyze data right?",
                    "label": 0
                },
                {
                    "sent": "And so this.",
                    "label": 0
                },
                {
                    "sent": "Reflecting many aspects of our life, this can be medicine right in the old times.",
                    "label": 0
                },
                {
                    "sent": "Doctor has a model of a disease in his head.",
                    "label": 0
                },
                {
                    "sent": "He checked.",
                    "label": 0
                },
                {
                    "sent": "The patient may be measured, checked a bit, and then he decided this is.",
                    "label": 0
                },
                {
                    "sent": "This is the diagnosis right now.",
                    "label": 0
                },
                {
                    "sent": "Now pretty much the machines.",
                    "label": 0
                },
                {
                    "sent": "It's not entirely true, but mostly things are changing this direction that machines are measuring the patient, and machines almost decide what was what's wrong with the person, right?",
                    "label": 0
                },
                {
                    "sent": "Science changed a lot, specially computer science and many others, so everything is becoming more data driven.",
                    "label": 0
                },
                {
                    "sent": "I'm not saying that everything is data driven, but many things are way, way more data driven as in the past, right?",
                    "label": 1
                },
                {
                    "sent": "So in this requires skills, how to handle the data, not just how to collect?",
                    "label": 0
                },
                {
                    "sent": "Also how to curate, how to analyze and also how to decide based on the data.",
                    "label": 0
                },
                {
                    "sent": "And so this is what being data science scientists about.",
                    "label": 0
                },
                {
                    "sent": "And these are Sciences, very horizontal area, which touches many, many aspects of our life.",
                    "label": 0
                },
                {
                    "sent": "So I will go a little bit deeper in some of these issues on next slides.",
                    "label": 0
                },
                {
                    "sent": "If I'm boring, tell me so I can stop.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "1st first one quick question where data is actually coming from.",
                    "label": 0
                },
                {
                    "sent": "So what changed in this last ten 2030 years?",
                    "label": 0
                },
                {
                    "sent": "So here are two pictures which might might explain some some part of this not not entirely.",
                    "label": 0
                },
                {
                    "sent": "So the world has roughly.",
                    "label": 0
                },
                {
                    "sent": "Uh, 7.5 billion people right now.",
                    "label": 0
                },
                {
                    "sent": "Internet users based on this recent counting.",
                    "label": 0
                },
                {
                    "sent": "This is like 2017 research is like half half of the people.",
                    "label": 0
                },
                {
                    "sent": "Roughly are connected to Internet in one or the other way.",
                    "label": 0
                },
                {
                    "sent": "Maybe some are connected just a little bit.",
                    "label": 0
                },
                {
                    "sent": "Maybe some are not even aware and there are some which are like me, constantly connected.",
                    "label": 0
                },
                {
                    "sent": "So this is just Internet users right?",
                    "label": 0
                },
                {
                    "sent": "And then if you narrow down, let's say, social media users, so where you actually share your social life and Internet.",
                    "label": 0
                },
                {
                    "sent": "It's amazingly high number, right?",
                    "label": 0
                },
                {
                    "sent": "Maybe sounds a bit high, but actually it's not.",
                    "label": 0
                },
                {
                    "sent": "So Facebook is reporting just number of Facebook users around 2 billion, and then if you count other social media then you can you come easily to 2.7 billion which is like one sort of the world, right is connected to social media.",
                    "label": 0
                },
                {
                    "sent": "One of the other way this means maybe some of these users or good portion of these users is probably just maybe logged in once and never came back right?",
                    "label": 0
                },
                {
                    "sent": "So this is always like this, but still will see from this other slide it actually it's in the range of 1 billion per day.",
                    "label": 0
                },
                {
                    "sent": "It's we can easily say that one billion per day of people.",
                    "label": 0
                },
                {
                    "sent": "Connects to social media so this number is pretty relevant, right?",
                    "label": 0
                },
                {
                    "sent": "Mobile users.",
                    "label": 0
                },
                {
                    "sent": "5 billion high number probably is true, right?",
                    "label": 0
                },
                {
                    "sent": "People you agree.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "So for this one idea I was not sure I wanted to check.",
                    "label": 0
                },
                {
                    "sent": "An active mobile social users is also pretty high, so most of the social social media users are actually so every single person here generates data, but not just people.",
                    "label": 0
                },
                {
                    "sent": "Also machines right which I didn't mishear.",
                    "label": 0
                },
                {
                    "sent": "Now what happens within one minute?",
                    "label": 0
                },
                {
                    "sent": "In the world, so again, this is graph which is pretty much updated every.",
                    "label": 0
                },
                {
                    "sent": "Year so I took the recent most recent one.",
                    "label": 0
                },
                {
                    "sent": "Let's check just a couple of things, right?",
                    "label": 0
                },
                {
                    "sent": "Let's say linked in one of the social media.",
                    "label": 0
                },
                {
                    "sent": "So 120 new accounts created every minute.",
                    "label": 0
                },
                {
                    "sent": "OK, not very interesting.",
                    "label": 0
                },
                {
                    "sent": "Let's say how much money is being spent online every minute.",
                    "label": 0
                },
                {
                    "sent": "Let's say in the range of 1,000,000, so.",
                    "label": 0
                },
                {
                    "sent": "If you move, check how many millions, how many minutes they has red.",
                    "label": 0
                },
                {
                    "sent": "So we come to few billion rent per day.",
                    "label": 0
                },
                {
                    "sent": "What else?",
                    "label": 0
                },
                {
                    "sent": "2.5 million searches search queries on Google every minute, right?",
                    "label": 0
                },
                {
                    "sent": "So this means?",
                    "label": 0
                },
                {
                    "sent": "Like a few 100,000 per second, which is roughly true.",
                    "label": 0
                },
                {
                    "sent": "Facebook before I said so roughly 1 million 1 million people log in on Facebook every minute.",
                    "label": 0
                },
                {
                    "sent": "So again, this would come easily to 1 billion per project.",
                    "label": 0
                },
                {
                    "sent": "And what else is relevant?",
                    "label": 0
                },
                {
                    "sent": "Tinder yeah so almost 1 million swipes per per minute.",
                    "label": 0
                },
                {
                    "sent": "So 1,000,000 for the people who don't know what Tinder is.",
                    "label": 0
                },
                {
                    "sent": "So dating sites.",
                    "label": 0
                },
                {
                    "sent": "So one 1 million times per minute.",
                    "label": 0
                },
                {
                    "sent": "People decide whether some of these good match for him or not.",
                    "label": 0
                },
                {
                    "sent": "So this is.",
                    "label": 0
                },
                {
                    "sent": "Good example, so this generates data, right?",
                    "label": 0
                },
                {
                    "sent": "I didn't even touch areas like Io T machine to machine and many other errors.",
                    "label": 0
                },
                {
                    "sent": "OK, now all this data has is first it's collected somewhere.",
                    "label": 0
                },
                {
                    "sent": "I won't touch this issue, so how the price of the disk space went down and price of CPU and so on.",
                    "label": 0
                },
                {
                    "sent": "All this happened in the meantime as well, but this data is somewhere stored and this data has value in many ways and we just now the question is we want to extract the value from from the data.",
                    "label": 0
                },
                {
                    "sent": "And of course for this we need data scientists so This is why I'm explaining this.",
                    "label": 0
                },
                {
                    "sent": "So something else happen.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also in the meantime.",
                    "label": 0
                },
                {
                    "sent": "Artificial intelligence, so this is like mother area over data science would be typically part of or.",
                    "label": 0
                },
                {
                    "sent": "It's a big overlap between artificial intelligence and.",
                    "label": 0
                },
                {
                    "sent": "Data science, let's say if you take mobile phone today, it's full of collecting.",
                    "label": 0
                },
                {
                    "sent": "It's collecting data in so many ways, and artificial intelligence is generating the services like speech, recognition of face recognition.",
                    "label": 0
                },
                {
                    "sent": "Sensory information by health.",
                    "label": 0
                },
                {
                    "sent": "Everything is kind of collected and analyzed, so AI is more like the analysis part.",
                    "label": 0
                },
                {
                    "sent": "What happened in the last 18 months, which is sort of even for us working in AI.",
                    "label": 0
                },
                {
                    "sent": "Surprising so the amount of investments.",
                    "label": 0
                },
                {
                    "sent": "So this is the venture capital map of AI went enormously up.",
                    "label": 0
                },
                {
                    "sent": "It has never been like this ever right?",
                    "label": 0
                },
                {
                    "sent": "So AI exists like maybe 5060 years, 50 maybe years.",
                    "label": 0
                },
                {
                    "sent": "And so this.",
                    "label": 0
                },
                {
                    "sent": "Uptake is.",
                    "label": 0
                },
                {
                    "sent": "Huge right?",
                    "label": 0
                },
                {
                    "sent": "And as a consequence, all the people which at least claim that they do AI or data science they all take.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "One important detail.",
                    "label": 0
                },
                {
                    "sent": "Another view to data science and AI.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some of you might know this Gartner hype hype cycle, so.",
                    "label": 0
                },
                {
                    "sent": "You know?",
                    "label": 0
                },
                {
                    "sent": "OK, OK, let's analyze them.",
                    "label": 0
                },
                {
                    "sent": "The graphs just for the one for the people who don't know.",
                    "label": 0
                },
                {
                    "sent": "So Gartner actually publishes like hundred 120 hype cycles per year.",
                    "label": 0
                },
                {
                    "sent": "So, and this is just one of them, I think the most relevant one this is hype cycle for emerging technologies.",
                    "label": 1
                },
                {
                    "sent": "Other hype cycles are way more narrow, narrowing down particular technology so.",
                    "label": 0
                },
                {
                    "sent": "Lifecycle for emergent Technologies puts all the let's say, new technologies on the map and classifieds them along like this horizontal axis like 3 five main categories.",
                    "label": 0
                },
                {
                    "sent": "So on the left side being innovation.",
                    "label": 0
                },
                {
                    "sent": "Three or so technologies which are coming right which are appearing, and some of them you might not even know that they exist.",
                    "label": 0
                },
                {
                    "sent": "But there is a typically community of people which actually do something that's with something with this.",
                    "label": 0
                },
                {
                    "sent": "Of technologies like smart dust, 4D printing and so on probably never hurt for some of them.",
                    "label": 0
                },
                {
                    "sent": "But you heard for personal analytics and for machine learning and for blockchain and so which are up here.",
                    "label": 0
                },
                {
                    "sent": "And this is like inflated expectations.",
                    "label": 0
                },
                {
                    "sent": "Blockchain obviously inflated cannot be more right and many others.",
                    "label": 0
                },
                {
                    "sent": "And then you know after you're happy and so on.",
                    "label": 0
                },
                {
                    "sent": "And after drinking party you have hangovers.",
                    "label": 0
                },
                {
                    "sent": "So this is the hangover area and then you wake up and some of some of these technologies actually survive it.",
                    "label": 0
                },
                {
                    "sent": "Yeah so this is how you read this.",
                    "label": 0
                },
                {
                    "sent": "The party starts the peak of the party and an angle.",
                    "label": 0
                },
                {
                    "sent": "So now if you look through all these technologies which are put on the so this is the last the last.",
                    "label": 0
                },
                {
                    "sent": "Hype Cycle Gartner published, so it's always published for one year back, right?",
                    "label": 0
                },
                {
                    "sent": "So this year they publish it for 2016.",
                    "label": 0
                },
                {
                    "sent": "You see that at least half of these technologies is AI and data science in one or the other way.",
                    "label": 0
                },
                {
                    "sent": "So this is 1 one possible view, which I think is relevant.",
                    "label": 0
                },
                {
                    "sent": "Oh then one more air.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, which just touch which areas are affected by AI and data science.",
                    "label": 0
                },
                {
                    "sent": "So pretty much everything so healthcare so the one which are more like in red right?",
                    "label": 0
                },
                {
                    "sent": "So they are more saturated, the ones which are more like light colors are.",
                    "label": 0
                },
                {
                    "sent": "Not that saturated, so let's say healthcare, Commerce, IoT and so on.",
                    "label": 0
                },
                {
                    "sent": "These are all pretty saturated and very using this AI technologies alot, while the lower ones, let's say a little bit less like real estate.",
                    "label": 0
                },
                {
                    "sent": "Government regulators, right physical security, agriculture and so on.",
                    "label": 0
                },
                {
                    "sent": "So these are areas that travel and so on.",
                    "label": 0
                },
                {
                    "sent": "These are still coming and needs to be filled with this technology.",
                    "label": 0
                },
                {
                    "sent": "I mean I'm working in this area and somehow I'm seeing that actually sports.",
                    "label": 0
                },
                {
                    "sent": "For instance port is very hot area nowadays in data science, so analyzing everything right.",
                    "label": 0
                },
                {
                    "sent": "So every movement every.",
                    "label": 0
                },
                {
                    "sent": "Boss of the ball so.",
                    "label": 0
                },
                {
                    "sent": "This is happening OK, this is just another view.",
                    "label": 0
                },
                {
                    "sent": "What's also relevant I guess.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What about European Commission, right?",
                    "label": 0
                },
                {
                    "sent": "So now?",
                    "label": 0
                },
                {
                    "sent": "Probably many of you are working on new projects and so you need to decide every 2 three years for new work program and there's a long discussion.",
                    "label": 0
                },
                {
                    "sent": "Typically let's a year, year and a half right, and then they come up with the topics and they assign the budget to it.",
                    "label": 0
                },
                {
                    "sent": "Now if you look at this.",
                    "label": 0
                },
                {
                    "sent": "This still draft, but now in a few weeks this will come official document if you look.",
                    "label": 0
                },
                {
                    "sent": "What kind of topics are being funded right?",
                    "label": 0
                },
                {
                    "sent": "For 2018, nineteen and 20?",
                    "label": 0
                },
                {
                    "sent": "So for the next three years it's I would say more than half is big data.",
                    "label": 0
                },
                {
                    "sent": "So data science and AI, and even in this next generation Internet Internet, which is the new term coined by.",
                    "label": 0
                },
                {
                    "sent": "Open Commission you see AI right?",
                    "label": 0
                },
                {
                    "sent": "So this is so in the next three years you can expect lots of new projects.",
                    "label": 0
                },
                {
                    "sent": "In the area OK?",
                    "label": 0
                },
                {
                    "sent": "Now, if I have still some time, I can wait.",
                    "label": 0
                },
                {
                    "sent": "Yeah so.",
                    "label": 0
                },
                {
                    "sent": "I made the quick summary from what?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Data science area actually is, and what was the job job market?",
                    "label": 1
                },
                {
                    "sent": "What are the figures right?",
                    "label": 0
                },
                {
                    "sent": "The numbers?",
                    "label": 0
                },
                {
                    "sent": "So This is why.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Recent research made by IBM, which is I think.",
                    "label": 0
                },
                {
                    "sent": "Pretty well done, so quite believable.",
                    "label": 0
                },
                {
                    "sent": "So they're claiming so.",
                    "label": 0
                },
                {
                    "sent": "This is just the summary slide and then I will go through some of the components.",
                    "label": 0
                },
                {
                    "sent": "So in 2015 they claimed they were like 2.5 million data science and analytics jobs by 2020.",
                    "label": 0
                },
                {
                    "sent": "This will go up 15%, which is kind of decent number, right?",
                    "label": 0
                },
                {
                    "sent": "So for like 300,000.",
                    "label": 0
                },
                {
                    "sent": "Now, not just for data scientist, but also for data engineer.",
                    "label": 0
                },
                {
                    "sent": "So data related people.",
                    "label": 0
                },
                {
                    "sent": "So the growth is expected around 40%, and so there's some estimate.",
                    "label": 0
                },
                {
                    "sent": "I don't know how relevant it is that for this type of job on average would wait a little bit longer to get a job to get fulfilled.",
                    "label": 0
                },
                {
                    "sent": "Trees are OK.",
                    "label": 0
                },
                {
                    "sent": "They are is our average is like 80,000, which is kind of hired, say, but again, not too hard, but along different.",
                    "label": 0
                },
                {
                    "sent": "If now will split this concept of data science.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And analytics into several.",
                    "label": 0
                },
                {
                    "sent": "Oh categories which not sure how well you see this.",
                    "label": 0
                },
                {
                    "sent": "So if you talk about data science analytics that it would be 2 clusters of jobs, right?",
                    "label": 1
                },
                {
                    "sent": "So one is this analytics enabled jobs and data science type of jobs, right?",
                    "label": 1
                },
                {
                    "sent": "And this is the math.",
                    "label": 0
                },
                {
                    "sent": "You see.",
                    "label": 0
                },
                {
                    "sent": "There is very high demand on this analytics.",
                    "label": 0
                },
                {
                    "sent": "Able jobs across different industries like finance, health information, manufacturing and so on.",
                    "label": 1
                },
                {
                    "sent": "And on the other side you have small demand for this.",
                    "label": 0
                },
                {
                    "sent": "What is being called data scientists, advance analysts, but these are.",
                    "label": 0
                },
                {
                    "sent": "These are the most so.",
                    "label": 0
                },
                {
                    "sent": "So these are really the complete vertical people.",
                    "label": 0
                },
                {
                    "sent": "So at the end you want to have this kind of people in your company because they can do everything from.",
                    "label": 0
                },
                {
                    "sent": "From from decision making to implementation practically or technical implementation, this would be more like vertical people, domain specific and so they are easier to get their lower Peyton so.",
                    "label": 0
                },
                {
                    "sent": "So this is roughly 111 possible view.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Oh OK, here just the proof.",
                    "label": 0
                },
                {
                    "sent": "What I just said.",
                    "label": 0
                },
                {
                    "sent": "Like if you have data scientists right so here.",
                    "label": 0
                },
                {
                    "sent": "Basically, data scientists have all the skills, domain knowledge, visualization, data governance, engineering management and olitical and approaches and machine learning.",
                    "label": 0
                },
                {
                    "sent": "Well, let's see if you have.",
                    "label": 0
                },
                {
                    "sent": "Data driven decision makers which are technically CEO Cto's and then so on, right so they really need to be specialized and they don't need.",
                    "label": 0
                },
                {
                    "sent": "They don't need all the technologies.",
                    "label": 0
                },
                {
                    "sent": "So these are kind of easier to get compared to this ones.",
                    "label": 0
                },
                {
                    "sent": "Or maybe these two are harder to get and the middle ones are a little bit easier to get.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, we saw already.",
                    "label": 0
                },
                {
                    "sent": "There are several categories of data science jobs.",
                    "label": 1
                },
                {
                    "sent": "I won't go too much into the details here from data scientists, analysts down to decision makers, right?",
                    "label": 0
                },
                {
                    "sent": "So these are two sides of the of this job spectrum.",
                    "label": 0
                },
                {
                    "sent": "So one side you really want somebody who can crash.",
                    "label": 0
                },
                {
                    "sent": "The problem on the other side, you want somebody who can decide upon the solution.",
                    "label": 0
                },
                {
                    "sent": "So it is active sites.",
                    "label": 0
                },
                {
                    "sent": "No, just to go.",
                    "label": 0
                },
                {
                    "sent": "Just to show you a few more graphs.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then I'm more less finished.",
                    "label": 0
                },
                {
                    "sent": "You see that the salaries read for this for the two sides of the spectrum at the highest.",
                    "label": 0
                },
                {
                    "sent": "Here and here.",
                    "label": 0
                },
                {
                    "sent": "So what are kind of skills this includes, right?",
                    "label": 0
                },
                {
                    "sent": "So if we talk about data, science is not always just artificial intelligence.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "Magic coming from machine learning and so on.",
                    "label": 0
                },
                {
                    "sent": "But of course you need lots of engineering as well, so still so the postings.",
                    "label": 0
                },
                {
                    "sent": "This is like for two years ago, so this is traditional data science like squares or the underlying knowing the language.",
                    "label": 0
                },
                {
                    "sent": "Right analysis is just the usual statistics and so on and couple of tools.",
                    "label": 0
                },
                {
                    "sent": "This is nothing compared to today's data science, right?",
                    "label": 0
                },
                {
                    "sent": "Today's data science is way more.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Like this, so if you have like 3 profiles, data scientist, data engineer and OK Finance risk analytics.",
                    "label": 0
                },
                {
                    "sent": "So this is the traditional skills baseline skills right?",
                    "label": 0
                },
                {
                    "sent": "But these ones are the ones which you really.",
                    "label": 0
                },
                {
                    "sent": "Are hyping skills today.",
                    "label": 0
                },
                {
                    "sent": "And maybe it's not even true anymore, because today there is a email showing before Tensorflow and there are a couple of other tools which actually would be even more better phase which are not here on the.",
                    "label": 0
                },
                {
                    "sent": "This park is already very old to like 2 years, you know.",
                    "label": 0
                },
                {
                    "sent": "It's a joke.",
                    "label": 0
                },
                {
                    "sent": "It's kind of funny.",
                    "label": 0
                },
                {
                    "sent": "This part really appeared not so long time ago, and it's already considered as a standard tool, right?",
                    "label": 0
                },
                {
                    "sent": "Compared to, let's say, tools like sauce which is around for I don't know 3040 years right?",
                    "label": 0
                },
                {
                    "sent": "Which is still there, right?",
                    "label": 0
                },
                {
                    "sent": "OK, and which industries are?",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Demand, I mean the which industries have higher demand for data science and analytics skills, so finance for sure right?",
                    "label": 0
                },
                {
                    "sent": "I see I mean.",
                    "label": 0
                },
                {
                    "sent": "In our group we have a good portion of portfolio in finance industry.",
                    "label": 0
                },
                {
                    "sent": "Then professional cyantific technical services obviously information, so this is it.",
                    "label": 0
                },
                {
                    "sent": "And so on.",
                    "label": 0
                },
                {
                    "sent": "And then management, manufacturing Beccaria right here would be IP and everything goes and then a couple of other more traditional industries which does mean that actually they don't have needs or money, they're just slower.",
                    "label": 0
                },
                {
                    "sent": "I mean in my mind, my understanding that public administration is, well, it's full of opportunities for data science is just that it's.",
                    "label": 0
                },
                {
                    "sent": "Typically so slow, and that's why it's only 7% and could easily be way higher.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is the last slide.",
                    "label": 0
                },
                {
                    "sent": "Any questions so I didn't have any demos and nothing very interesting, but.",
                    "label": 0
                },
                {
                    "sent": "I think just wanted to explain that this data science area actually is happening.",
                    "label": 0
                },
                {
                    "sent": "It's happening right now.",
                    "label": 0
                },
                {
                    "sent": "So and even for us being in the area, we're surprised how fast it develops.",
                    "label": 0
                },
                {
                    "sent": "The question why I mean I gave some conceptual, uy data science is happening now in this period of history, right?",
                    "label": 0
                },
                {
                    "sent": "But there are a couple of more.",
                    "label": 0
                },
                {
                    "sent": "Concrete reasons why it's happening now because there were few.",
                    "label": 0
                },
                {
                    "sent": "Breakthroughs in artificial intelligence, which let's say this Tensorflow again, which email was mentioning is.",
                    "label": 0
                },
                {
                    "sent": "An example of this, right?",
                    "label": 0
                },
                {
                    "sent": "So it's a set of techniques which made computers being able to see to listen to understand many other things which let's say five years ago were just not possible.",
                    "label": 0
                },
                {
                    "sent": "And this is one of very very micro reasons why things are happening now.",
                    "label": 0
                },
                {
                    "sent": "Not let's say three years ago or somewhere in the future, right?",
                    "label": 0
                },
                {
                    "sent": "And this huge gap of talent on the market.",
                    "label": 0
                },
                {
                    "sent": "So if you pretty much sum up every every everybody who is already working in the industry, everybody who is in the process of education and everybody who's expected to be educated, it's still not enough.",
                    "label": 0
                },
                {
                    "sent": "Based on the demands.",
                    "label": 0
                },
                {
                    "sent": "So this is this is the equation which.",
                    "label": 0
                },
                {
                    "sent": "Needs to be understood, friend.",
                    "label": 0
                },
                {
                    "sent": "Now just to wrap right?",
                    "label": 0
                },
                {
                    "sent": "So going back to this open education resources.",
                    "label": 0
                },
                {
                    "sent": "Today it was we mentioned already this.",
                    "label": 0
                },
                {
                    "sent": "Videolectures.net, right, so this is a good example of.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Office service which.",
                    "label": 0
                },
                {
                    "sent": "Which covers data science and machine learning.",
                    "label": 0
                },
                {
                    "sent": "So alot thread so we have like over 20,000.",
                    "label": 0
                },
                {
                    "sent": "You see, we covered so far.",
                    "label": 0
                },
                {
                    "sent": "I mean why I'm saying be because my group is doing this or our group so we covered over 2000 events.",
                    "label": 0
                },
                {
                    "sent": "Event can be huge events like.",
                    "label": 0
                },
                {
                    "sent": "With few 100 presentations and so on, or small workshop like this, right?",
                    "label": 0
                },
                {
                    "sent": "So it can be everything.",
                    "label": 0
                },
                {
                    "sent": "We have 15,000 authors over 23,000 videos, so with strong bias over that official intelligence machine learning data science, but many other areas, right?",
                    "label": 0
                },
                {
                    "sent": "So here on the left you see I mean just live picture of how this works.",
                    "label": 0
                },
                {
                    "sent": "What are people watching right now?",
                    "label": 0
                },
                {
                    "sent": "This moment, right?",
                    "label": 0
                },
                {
                    "sent": "So how you read this?",
                    "label": 0
                },
                {
                    "sent": "Deep learning this is this area which I said that made huge change in.",
                    "label": 0
                },
                {
                    "sent": "Data science in the last couple of years.",
                    "label": 0
                },
                {
                    "sent": "So deep learning summer school so searching people are watching this moment deep learning materials from deep learning summer school.",
                    "label": 0
                },
                {
                    "sent": "Generative models this kind of belongs to this neural networks.",
                    "label": 0
                },
                {
                    "sent": "Again the same topic.",
                    "label": 0
                },
                {
                    "sent": "Theoretical neuroscience.",
                    "label": 0
                },
                {
                    "sent": "Socrates doesn't belong here, or maybe just a bit.",
                    "label": 0
                },
                {
                    "sent": "OK, this one I don't know.",
                    "label": 0
                },
                {
                    "sent": "So this is the actual picture of what is current interests.",
                    "label": 0
                },
                {
                    "sent": "So everybody wants to know this right?",
                    "label": 0
                },
                {
                    "sent": "Because there's such a demand on the market and this is this was seen from what you know showing before.",
                    "label": 0
                },
                {
                    "sent": "Here we see the live picture of people actually learning this so that they can get a job.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "I was showing these video lectures basically because of this because whenever I open it, this is so safe.",
                    "label": 0
                },
                {
                    "sent": "Guess whenever I open this deep learning will will will be up here for.",
                    "label": 0
                },
                {
                    "sent": "Huh?",
                    "label": 0
                },
                {
                    "sent": "OK, thanks if there's any questions I'm happy to answer.",
                    "label": 0
                }
            ]
        }
    }
}