{
    "id": "6sbqvf7ubdsrrupjglikyfhhuq3f2r45",
    "title": "Keynote Speech",
    "info": {
        "author": [
            "Ryan Merkley, Creative Commons"
        ],
        "published": "Oct. 12, 2017",
        "recorded": "September 2017",
        "category": [
            "Top->Social Sciences->Education",
            "Top->Social Sciences->Society",
            "Top->Technology"
        ]
    },
    "url": "http://videolectures.net/oercongress2017_merkley_keynote_speech/",
    "segmentation": [
        [
            "I am from Canada, though my badge says United States and I'm very very happy to be here with all of you today and thank you for waking up this morning to be here for the keynote."
        ],
        [
            "I want to open an.",
            "I want to close with gratitude.",
            "It's one of the core values of what Cece believes in.",
            "So first of all, thank you to our hosts and to our event organizers.",
            "the Republic of Slovenia, UNESCO and the O ER chairs.",
            "the Commonwealth of Learning and the William and Flora Hewlett Foundation.",
            "And all of the civil society organizations that have made this second we are Congress possible.",
            "Thank you very much.",
            "This is an important time for the open movement, both to celebrate what we've accomplished already and then here to set very ambitious goals for what will come next.",
            "And I hope that we will challenge each other, and that I perhaps will challenge you this morning.",
            "I want to provide special thanks to all of the national governments who are joining us here in Slovenia.",
            "The Ministers of education and your delegations.",
            "You have made time for this.",
            "It's important and thank you for being here and for engaging with all of us.",
            "CCS director of Open education cable.",
            "Green, who's down here on my right and I are looking forward to speaking with you and to helping you in your work so please do find us if there's a way we can be helpful.",
            "I also want to acknowledge my friends and colleagues in the Open education movement.",
            "I want to single out members of Creative Commons affiliates who all over the World League country teams, especially the team right here in Slovenia's are Slovenian team here.",
            "Put trans up there they are.",
            "Thank you.",
            "I would also like to acknowledge members of Communion who are here Communion is the Association that Creative Commons works in here in Europe, and they have been very, very active on Copyright reform here over the last year, poring over thousands of amendments and trying to advance our cause at the policy level.",
            "Now the CC global movement is much part of a much larger open movement.",
            "We're just one piece of it, and I see many of you here today and is a joy for me to be here to talk to you about our work, but also to find an opportunity for all of us to come together and move this work forward.",
            "Finally, to our Slovenian hosts.",
            "A little over a year ago I was in Berlin.",
            "We were hosting an all staff meeting.",
            "Our team is all over the world and we come together a couple of times a year.",
            "In order to do strategy and planning.",
            "So after our long day of planning we found our way to a little German wine bar and were settling in for a drink and then the host came by and he informed us on this night that they were only serving Slovenian wine.",
            "Now eventually one of us had the courage to ask.",
            "They make wine in Slovenia.",
            "Oh yes, they do.",
            "They actually make spectacular wine here in Slovenia, which some of you may have discovered last evening.",
            "But I learned yesterday or learned at that time.",
            "Never underestimate Slovenia and perhaps the Serbian national basketball team learned that very recently as well.",
            "Perhaps not unlike Canada, where I'm from Slovenia's many accomplishments can sometimes be overshadowed by its more, shall we say, boisterous neighbors who are nearby.",
            "But there is greatness, and there is ambition, and there is beauty here, and I'm very, very grateful for this perfect place for such a meeting.",
            "So thank you to our Slovenian host for bringing us here and for hosting us so well.",
            "So our."
        ],
        [
            "Under today, we're going to talk about open knowledge.",
            "I'm going to talk about collective action.",
            "How everyone loves a parade?",
            "And the big open.",
            "We have only a brief time here together, so we'll try to cover all of that ground with just enough time for a few questions.",
            "But if we miss anything, I'm happy to meet folks for a glass of wine when this is all over.",
            "Now first let's start with some of the basics about CC Now."
        ],
        [
            "CC is a global non-profit that produces the CC open licenses which you all know.",
            "The license suite is the international standard for sharing openly with minimal restrictions.",
            "The licenses are simple.",
            "They are standardized and they have been designed to comply with international Copyright laws and treaties all over the world.",
            "They're simple.",
            "Terms have been translated into over 35 languages around the world, and they were supported by a community of chapters in over 85 countries.",
            "Now we didn't change Copyright.",
            "We hacked it.",
            "We built on top of it.",
            "We enabled.",
            "We created what we call a release valve, a free legal suite of tools that anyone could use to share under simple terms.",
            "Attribution sharealike, noncommercial no derivatives but also our public domain dedication CC zero.",
            "No restrictions whatsoever.",
            "We went from All rights reserved to some rights reserved.",
            "Now the license is backed up by international Copyright are made up of three parts, the legal code.",
            "The simple terms are what we call the human readable deed.",
            "And the license metadata, which is actual code.",
            "That allows them to be read by humans and by lawyers and by machines.",
            "If you'd like to debate whether lawyers are a subset of humans or whether they are a separate set of humans, we can take that to sign.",
            "We integrated the licenses into the most popular platforms in the world, put them in the workflows of where people were creating things platforms at the time, like Flickr, like YouTube, like Wikipedia and more recently medium and we help communities and creators use them.",
            "However they needed in order to advance their work.",
            "Photos, music, video, open educational resources, and we did it together.",
            "Millions of craters all over the world.",
            "Now, 15 years later, Creativecommons is much more than that and this is the part of us that you might not know.",
            "We're fortunate to be one of the leading organizations in the open movement due in large part to the global network of experts and affiliates.",
            "Now we provide essential infrastructure through the licenses, but we're also building new infrastructure and new tools like CC search which will add a fourth layer to the license is a database and a registry license backed by software.",
            "And we actively work to grow and strengthen the movement with convenings and training, mentorship and education, including our own CC Summit, which we held in Toronto last year and will be returning next year in April to Toronto again now early next year.",
            "Will launch the CC certificate, which is an education program including specializations for librarians, for government and for educators.",
            "We are literally writing the book on CC and it will be the most comprehensive training program and Creative Commons that we've ever.",
            "Reduced and will obviously be entirely made of ovr so that anyone can translate, adapt, remix and reuse it.",
            "So today is CC puts the open in ovr that CC licenses and public domain tools unlock those educational resource is from Copyright so that anyone can pick up that work, reuse it, remix it and adapt it as needed.",
            "The key distinguishing characteristic of an open educational resource over other materials is it's open license and the way it was made collaboratively.",
            "The single simple legal permissions that the license grants to the public to read, copy, use, reuse, retain and share.",
            "Nothing educational resource is not clearly marked with an open license like one of the CC licenses.",
            "It is not oh we are.",
            "The most common way to openly license those works to turn them into LDR is to add a CC license.",
            "And when authors do this to their work, they keep their Copyright, but they share it under those permissive terms.",
            "So anyone can use them as agreed ovr equals the permissions to modify and free access.",
            "Those two things are essential to talk more about the permissions later.",
            "So while the CC tools are built on top of Copyright, today's Copyright laws, which affect everything that we do in education, have not remotely kept up with the times today's laws were first written at a time when creators were rare and were printing, presses were even more rare, and our laws failed to reflect today's technology.",
            "And the way that we share and make content every single day.",
            "With the web should have enabled.",
            "A world of sharing and permissive uses.",
            "We instead got more restrictive Copyright and less freedom to use even the content we supposedly own as smartphones became ubiquitous.",
            "As the web became a series of connected databases and API's, and as broadband prices continued to fall, we illuminated Copyright registration so that everyone became a creator of Copyright.",
            "But there was no single registry for these works to be found.",
            "Or were used effectively?",
            "Now, Lawrence Lessig, our Founders Book Free Culture he wrote ours is a less and less free society.",
            "This is the reality in creativity and knowledge, large rights holders and traditional publishers set the terms for how we access knowledge and culture.",
            "Even though they built their empires on top of freely available art music.",
            "Publicly funded science, data research, music, art, culture, folklore and more.",
            "Let's look at it in his book.",
            "The past always tries.",
            "To control the creativity that builds upon it.",
            "The past is doing pretty well at this job so far.",
            "Now to work in open education now means that you need to be an arm chair Copyright expert.",
            "From fair use to fairdealing to library uses and copying to education, exceptions and limitations to user generated content, we ask so much too much.",
            "I might add of authors and educators who simply want to teach and share knowledge and spend their time dealing with rights, clearances and the fear of being sued for using a work incorrectly.",
            "With Copyright reform on the table today in the European Commission in Canada and Australia, and with content industries tie, trying to push for secret IP terms in half a dozen to international trade agreement agreements including TPP minus 11 or TPP 11, which is really just TP minus the US and NAFTA, we're constantly playing defense against more restrictive regimes trying to find their way in through any door possible.",
            "You might think that something as simple as giving access to the blind for works would be a moral imperative and easy to negotiate.",
            "You would be wrong.",
            "Now by and large, past has used its influence to ensure that Copyright laws restrict access to creativity and knowledge from those who wanted, no matter how deserving or how needy they may be."
        ],
        [
            "So let's talk about collective action.",
            "I believe in Creative Commons believes that we should aspire to something greater than meticulously regulating monopolistic access for large rights holders.",
            "We should seek to share knowledge and lift other people up.",
            "The Commons is humanity's greatest collective act.",
            "It is the grand sum of human knowledge shared widely and nearly without restriction to enable innovation, discovery and advancement.",
            "To create a more equitable world.",
            "To alleviate suffering, to advance the cause of humanity.",
            "A Creative Commons is just one small part of this global Commons that's made up of all kinds of materials well beyond just the things shared under CC license.",
            "Yes, open educational resources are in there, but also 3D models, open software movements, data, and more.",
            "the Commons is a platform for sharing and collaborating, and it belongs to all of us, and it is a public good.",
            "Now education is also a public good, at least it's supposed to be, but over the past 50 years I think we've lost our grip on this core value in education.",
            "An educated child can overcome great challenges and find new opportunities to rise above their constraints of poverty or class structures.",
            "An educated community can create prosperity, innovation and a diverse economy.",
            "An educated citizenry elects just governments and is resilient in the face of misinformation propaganda and prejudice.",
            "But in recent years, we've allowed that narrative to shift.",
            "So that the primary beneficiary of education is seen to be the individual.",
            "The ideal has allowed the kind of inequality and debt and exclusion that we see to see today to take root and to grow.",
            "That kind of disparity that now requires SDG, four in the first place.",
            "Today's educational business models contribute to that.",
            "From this false belief in individual benefits taking precedence over investments in the public good.",
            "If education was seen as a public good, we would ask ourselves how we should martial our collective wealth to ensure that it was accessible to everyone, not just those who could pay.",
            "Today, trillions of dollars in public money are spent on grants to produce materials that we must purchase time and time again.",
            "More recently, in response to these complaints about the high cost of materials publishers, instead, Lisa's DRM protected educational resource is so students lose actors access at some not so far into the future time.",
            "The content is locked down in proprietary systems with no permissions for teachers to revise, localise, customize or translate to meet student needs.",
            "We pay less, but we get less for what we pay and in the end we don't own anything.",
            "Today most public education and research grants still allow the grantee to keep their oil reserves.",
            "All rights reserved.",
            "Copyright with the public funds they've received.",
            "They then exploit that public investment for their private benefit, the result the public does not have access to what it paid for, and has to pay again for the same resource over and over again.",
            "We absolutely cannot keep this up.",
            "The model is unsustainable, and it is unjust.",
            "I don't need to tell the people in this room that budgets and education are tight.",
            "So why are we spending them on things we can't own?",
            "That we can't modify and we can't share to our unique needs.",
            "We have more than enough money.",
            "We just need to choose to spend it in ways that meet our educational goals first.",
            "So let me be clear, publicly funded resource is should be openly licensed resources.",
            "We heard that at the open of this session and we should keep saying it until it is true everywhere.",
            "The public should have access to what the public paid for.",
            "We need to decide what benefits we want to create with our education investments and then ensure that we get them through our policies and practices.",
            "As advocates, we need to learn lean firmly into this moral case.",
            "We have a right as a community or as a country to act together to build things that we all benefit from at the minimum reasonable cost shared by everyone to our mutual and collective good.",
            "This, in fact, is exactly what government was for.",
            "Now everybody knows that the learning resource is and models we need must respond, respect and reflect our national and local cultures and history.",
            "But that's just the beginning of the inclusion story.",
            "We have to acknowledge that as we transition to models that are more open.",
            "That it require working openly and sharing openly that working this way is a privilege that many of us do not have.",
            "Sometimes that's because their institution doesn't support those activities yet.",
            "Because they need the revenues that come from selling their textbooks, because that's the model they operate under today.",
            "Sometimes, because it's about training or skills and developing these resources, and sometimes the technical barriers are much simpler, but still meaningful and restrictive.",
            "For those who don't have the skills or the devices, or that bandwidth that I talked about earlier.",
            "Either way, we cannot ignore that.",
            "Working openly is a privilege, else we allow we are to become an activity only of rich companies.",
            "The rich countries from the Global North, led by established career professionals who can afford to take it on and can afford the hit to their careers if we don't consider the structures and cultures that support creation, adoption and maintenance of affective.",
            "Oh, we are.",
            "We will never build a broad based, inclusive, truly global community.",
            "Suggest isn't about only free access.",
            "Free is not the most powerful thing about oh, we are.",
            "It's the enabling permissions.",
            "The permissions are the secret sauce mentioned that earlier.",
            "Here's why the permissions are important.",
            "Too many students go without access to relevant updated materials that reflect their lived experience.",
            "Yet we know that that creates better student outcomes.",
            "Too many teachers use materials that can't modify, update, or enhance to meet the needs of their learners.",
            "And too many governments are struggling to find the needed resources to stay competitive in a global market.",
            "There's anything I want us to focus on.",
            "It's how we put the power of open at the center of every project, first by building community.",
            "Second, by focusing on collaboration with partners in a global movement and 3rd by creating cultures of gratitude and by building resilience and engagement.",
            "You are the experts in education, but I also know that you're under enormous pressure.",
            "You know that today's models are unsustainable and are failing to achieve the student outcomes we need.",
            "If we keep spending money, public money, the way we always have, we will never have the opportunity to invest our resources for better outcomes.",
            "Now obviously, are we ourselves for this and don't take my word for it.",
            "Some of the leading advocates and experts in O ER right here in this room, and you've been meeting with them and you're going to hear from them over this event.",
            "We mean to transform education globally.",
            "But it will require your leadership and your resolve along the way.",
            "You will disrupt traditional business models that are based on artificial scarcity.",
            "You will agitate old empires.",
            "But when you create new models that are based on this kind of abundance that we can have, you will also make education better and open up new opportunities for students.",
            "For teachers, yes also for businesses and for the public good.",
            "That I would argue should be our focus, not protecting old business models from the inevitable.",
            "You collectively have trillions of dollars of investment in your departments and ministries of education with a mandate to modernize, innovate, and most importantly, educate the current and future generations of your citizens.",
            "And you have millions of educators, librarians, academics and creators at the ready to help you from all over the world.",
            "They're just waiting for the opportunity.",
            "These are our public education systems left to their own devices.",
            "Existing market actors will continue to build the future out of the past.",
            "Creating digital versions of printed textbooks, importing advertising and data surveillance models into education tools and using false scarcity to extract resources from students and school boards.",
            "Without your leadership, we will continue to use old procurement structures to spend public funds on these antiquated models.",
            "This is about our collective power to act globally across borders in no other room in the world with no other group of leaders, is there more potential to have impact?"
        ],
        [
            "Can we talk about how everybody loves a parade?",
            "Before I was asked to leave Creative Commons, I worked in Mesa.",
            "Municipal government spent seven years as a political adviser, Anna policy maker in both Toronto and in Vancouver, and the first rule when advising my political boss was find a parade."
        ],
        [
            "Stand in front of it.",
            "And the parade is here right in front of you.",
            "And it is marching along a global path.",
            "This is my Prime Minister may recognize him at the Pride parade in Vancouver.",
            "Open education is not just about innovation, it is market transformation.",
            "It will change the way learners learn the way teachers teach.",
            "The way knowledge is created and funded an shared and is not an old idea of made new again.",
            "It is a realization of the potential of collaboration of the Internet.",
            "If we're brave enough to do it.",
            "There is huge momentum already underway for open education and the development adoption of open educational policies and practices.",
            "Communities have realized this potential governments have seen this potential.",
            "And the value of this investment.",
            "My other favorite saying in politics was that the public gives us permission to act.",
            "I believe that more and more people are frustrated with the existing structures and want to see governments adopt innovative solutions that respond to student needs.",
            "I believe they are behind you.",
            "If you are able to act.",
            "Now around this room around this world and in your own communities, the Ovr movement is going mainstream.",
            "We're seeing this growth 10 years after Cape Town Declaration and five years after the Paris Ovr Declaration.",
            "We've seen incredible innovation, experimentation, and adoption, and I want to acknowledge all of my colleagues who join us here today who inspired and LED this movement and turned it into a global reality.",
            "It is a pleasure to work with all of you, and we're so proud to be part of this movement with you.",
            "This is your invitation.",
            "The people who built this parade some from before the phrase ovr was even coined, some of which are in this room.",
            "We're all here to help you, educators, academics, researchers, librarians, coders, lawyers, nonprofits, IGO's, foundations and governments."
        ],
        [
            "So let's talk about the big open.",
            "That's all of us together working globally.",
            "You must be asking you."
        ],
        [
            "Self, what can I do right now?",
            "Well, I'm glad that you asked.",
            "Here are five things."
        ],
        [
            "That you could do right now.",
            "First create a national open education strategy, master plan or an open licensing policy.",
            "Start small if you have to, but require all publicly funded resource is to be openly licensed.",
            "If you need help, ask us will help you and we've done it all around the world with departments and governments everywhere.",
            "Secondly, check out the Cape Town plus 10 cards highlighting key themes in the future of ovr, and there's a book if you haven't seen it, it's fantastic.",
            "Produced by a community.",
            "Check these out.",
            "This is where we need to go next.",
            "3rd join us at the CC Summit in 2018 April 13th to 15th.",
            "In Toronto, where will bring our community together and a broader community of collaborators around many issues, especially open education, and we've seen massive growth in our online community, and we encourage you to join it there.",
            "Over 425 leading participants from around the world.",
            "Joining us online there and you can find cable if you'd like to join that or find us online.",
            "4th support national and regional Copyright reform efforts that increase fair use or fair dealing for education and resource resource is, as I said, Copyright now has a huge part to play in our ability to execute an open education.",
            "We need your help there.",
            "At a minimum, we just need your voice to support our work.",
            "And finally, support the creation and implementation of a new UNESCO instrument that further supports open education in UNESCO Member states.",
            "It's a big lift, but we think that there is merit here in pursuing this idea."
        ],
        [
            "So let me wrap up.",
            "We're all here because we dream of an education system that is just.",
            "We set an ambitious goal with SDG four and to achieve it these old models are not going to service service us.",
            "We're going to have to innovate and we already are starting to do it.",
            "Some businesses will evolve and others won't, and our focus has to be on improving student outcomes, not protecting old models.",
            "A recent study published in the Public Library of Science showed that when you teach children, the most common ways to where an argument is misrepresented.",
            "They are less likely to fall for it when they see it again in the media.",
            "This is the solution to fake news.",
            "It's not an algorithm, it's not regulation.",
            "It's not an app.",
            "There isn't a way to code our way out of fake news.",
            "Education is the way out of fake news.",
            "Critical thinking.",
            "This is what we need and this is what we're doing by spreading education widely.",
            "We all understand how vital an informed, engaged, critical citizenry can be in creating a more equitable, accessible just society.",
            "So I said that I wanted to open and close with gratitude.",
            "We need you.",
            "We need your work, your ingenuity, your courageous leadership.",
            "To paraphrase Darren Walker from the Ford Foundation.",
            "Thank you for your energy and for your commitment and for being here to be in this conversation.",
            "I know I speak for the entire global open movement when I tell you that we all stand ready to help in every single way that we can.",
            "Thank you for listening."
        ],
        [
            "There is a huge Copyright reform taking place right now in Europe.",
            "Is it still time to act and what should be done?",
            "Thank you.",
            "It is absolutely still time to act.",
            "So for those of the those of you that are following this, there are a myriad of committees where a variety of recommendations are making their way through, and there have been thousands of amendments.",
            "We're still knee deep in the process where the leading committees have still not finalized their recommendations, but where there are some really disturbing issues on the table, and there are also some opportunities.",
            "So there is an education exception being.",
            "Proposed, but the question is, will it make it through and will it be usable?",
            "There are issues of things like text and data mining, the ability to Marshall the resource is of massive computers to read information like it was data and if we want to explore innovation and discovery and science we need to unlock that.",
            "There are issues around user generated content, but there are also issues that will in my opinion break the Internet and provide new rights that are unnecessary.",
            "They're being advocated.",
            "4 by publishers.",
            "So to answer your question.",
            "You know, I would check out organizations like Communion.",
            "CC works very closely with communion.",
            "In the EU were an active partner, an many of the community members are here and look for an opportunity to see where we are at.",
            "In that process.",
            "We don't expect the vote to come forward until probably next year, but there's still lots of activism on the ground.",
            "Lots of opportunity to engage your MPs and to look at where the issues are playing out.",
            "And then once it's actually approved by the Commission.",
            "It still has to be implemented by every Member State, and there are plenty of ways for that to go well or badly.",
            "And so yeah, the fight is only just beginning and I have to give enormous credit to Tim Vollmer on our team.",
            "Who does that work but also the community members.",
            "It is thankless line by line work that they do on our behalf to try and keep track of all of these amendments and make sure that bad things don't get through.",
            "Thanks for the question.",
            "Thank you very much.",
            "Anymore question yes.",
            "Just with my mic.",
            "Thank you.",
            "Just in respect of guarding against plagiarism.",
            "Obviously whatever resources are made available as open education resources.",
            "Are there any norms or standards business processes in terms of development of open education resources that would assist us to guard against that kind of?",
            "Negative.",
            "Feedback in terms of what has been put on is actually plagiarized, and that if we convert that to print material for learners that we are not taken to the court.",
            "So is there any standards that have been put in place?",
            "Guidance, thank you.",
            "Yeah, I mean, Creative Commons tools are built on top of Copyright and so they also inherit all the challenges of copyrighted materials, so there's nothing in a CC license or in All rights reserved that will protect you from plagiarism.",
            "About actor is going to act badly.",
            "It's the same question.",
            "I get all the time about how I don't want to share my research openly because someone will distort my results.",
            "I promise you, if someone wants to distort your results or promote propaganda, respecting Copyright is not the thing.",
            "They're worried about.",
            "The thing they're worried.",
            "You know they're going to do it anyway.",
            "I think we need to do a better job of making it easier for people to use those resources and to mark them so that you can follow the thread.",
            "So one of the things that I think is powerful about CC licenses is that every one of them requires Attribution, and at its basic level, Attribution is the name of the author, the title of the work, a link to its original source, and a linked to the D that make sure that you know what the terms are that link to source is vital because it means that I can follow the thread back and find out.",
            "Original work was did and did you.",
            "How did you use it?",
            "Did you change it?",
            "So we think that that's really important.",
            "I also will be really honest.",
            "I think we need to do better on our end to make that easier.",
            "I think Attribution should be automatic.",
            "I think when you touch a work there should be a digital service that does that for you that you can modify.",
            "If you need to.",
            "But then we automate that.",
            "And we've launched a tool in February called CC Search which starts to do that.",
            "So if you visit our tool on our website at ccsearch.creativecommons.org.",
            "We've indexed about 1% of the Commons there, and it includes a one click Attribution tool.",
            "Now just uses photos.",
            "At this point will expand to other content type soon, but the idea is that you just click and you get preformatted Attribution that you can paste into your work so you don't have to guess.",
            "But how to do it.",
            "What we'd eventually like to do is and what we're planning to do, and I mentioned very briefly the idea of a license back by software is that there would be a registry in an API that would allow you depending on what platform you were working in to have it automatically generate.",
            "That Attribution for you and place it on the page.",
            "Thanks very much.",
            "Any questions yes.",
            "You will get the mic from behind.",
            "Hello Sir, thank you for your wonderful presentation.",
            "My name is Sarah.",
            "I'm from Bangladesh.",
            "A trait of Prime Minister selfish.",
            "So I'm seeking your advice for one of our ICT in education initiatives that is teachers portal.",
            "We have developed a teachers portal where more than 250,000 teachers are collaborating and Co creating content and there are more than 120,000 contents there.",
            "So teachers are using their content reusing.",
            "Distribute and redistribute, though we did not make all the contents, and declared as OEI.",
            "So my question is that if we want to declare this content as O ER under CC license, what we need to do.",
            "If you please kindly suggest us.",
            "Thank you very much.",
            "That's a great question.",
            "I'll give you the simple answer quickly and then the more complicated question we can take offline and we're happy to help you with it.",
            "The Copyright is held by the creator, and so depending on how you've enabled all of that sharing, you may have huge group of authors, each of whom holds individual Copyright.",
            "And if they haven't shared under the terms that enable that, you have to ask them, and so you may need to find a way to go back and make sure that those works are licensed and then marked correctly so that anyone can use them.",
            "So I think that's the fundamental piece, and So what we would recommend going forward is that you set that standard upfront.",
            "And established how you would do that through a policy.",
            "And there are bunch of different ways that you can do that, and you may also wish to integrate the CC licensed tools into whatever platform you're using so that the marking is simple so that people don't have to go to a website and guess and figure it out.",
            "You can really simplify that process for people, but we're happy to talk to you offline about different ways you can do that with your own group and then just the last piece I think is.",
            "The licenses I think don't really work without community, and it's a part of the license that we don't talk about a lot.",
            "And I have a lot of conversations with people saying, well, you know this thing happened and it's really difficult.",
            "Maybe you could modify the license to exclude this and that, and the truth is, we'll never be able to write a perfect license that responds to every single issue.",
            "I can never legal code my way out of that, but the thing that almost always works to get out of that stuff is community.",
            "When people enter into this idea with goodwill and the intention of sharing and collaborating.",
            "They're mostly always work it out.",
            "It's why there aren't a long list of legal cases around CC licenses, 'cause when those people come to us mostly, we say, well, can you work it out together and mostly they do now.",
            "Yes, the licenses hold up under legal scrutiny, and in most of the cases, and you can find them on our sites.",
            "You know the story is that the license terms held up, but the licenses work best when people choose to work together.",
            "That was the point they were meant to be an enabling function for people who want to share.",
            "So building community amongst those.",
            "Educators helping them understand the value of working together and what they get from each other and giving gratitude to each other for what they've each shared goes a very, very long way in illuminating the little conflicts that can come up all the time.",
            "Thank you very much.",
            "Anymore questions, yes.",
            "That would be probably the last question we can answer, but just just wait for the microphone, but it's coming.",
            "First of all, thank you for your really inspiring presentation and my question is related to the practice we are confronting everyday and in our everyday life.",
            "We often find the content.",
            "The different rights and licenses.",
            "For example, we have situation that the researcher transferred Copyright to the publisher at the same time the same researcher deposited the same.",
            "Piece of work in the repository with Creative Commons license, which we are, by the way promoting very strongly in our country.",
            "So how how to deal with such situations?",
            "Yeah, first of all, thank you for your work.",
            "As I said earlier that the challenges of Copyright and the challenges of CC licenses are similar because one is built on the other an where rights are not indicated clearly can be a real challenge.",
            "I don't have a great answer for you right now in terms of what you do when those rights statements are unclear other than going to the author and trying to clear that up.",
            "And we see tons of that going on.",
            "It's why we advocate for me.",
            "That's why we created a tool that has intended to have clear simple marking is to alleviate that.",
            "But even with that.",
            "There's complexity and we answer those questions all the time.",
            "One of the reasons we're building a project we call the open Ledger, which is just database that contains every openly licensed work, its location on the web and its associated metadata, and an API or a piece of software to talk to.",
            "That database is because we want to be able to help solve that problem because there are 1.2 billion licensed works in the world, and there's no way to find them all, and there's no front door, and so I feel your pain, and we're doing what we can.",
            "To help you, the project is underway, but we're a little ways off.",
            "So thank you very much, Miss Merkley, or regarding your Hungary citizenship.",
            "I think our Minister of Education is is the right address.",
            "She actually granted three months ago Nextra nationality to American basketball player, and he is European champion now, so.",
            "So Slovenia is probably the best gateway for Americans or Canadians or everybody outside Europe to become European champion.",
            "So I have to join the national cycling team.",
            "Is that what you're saying?",
            "Big apt?",
            "I have to join the national cycling team.",
            "That's all.",
            "Yes, that's much.",
            "You should be very, very good in cycling because we have we have a guy who actually wanna stage at Tour de France this year.",
            "So and and we'll chat.",
            "So it's thank you very much.",
            "Pretty much good cyclist here.",
            "Thank you very much Mr. Merkley.",
            "It's really.",
            "Great."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I am from Canada, though my badge says United States and I'm very very happy to be here with all of you today and thank you for waking up this morning to be here for the keynote.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I want to open an.",
                    "label": 0
                },
                {
                    "sent": "I want to close with gratitude.",
                    "label": 0
                },
                {
                    "sent": "It's one of the core values of what Cece believes in.",
                    "label": 0
                },
                {
                    "sent": "So first of all, thank you to our hosts and to our event organizers.",
                    "label": 0
                },
                {
                    "sent": "the Republic of Slovenia, UNESCO and the O ER chairs.",
                    "label": 0
                },
                {
                    "sent": "the Commonwealth of Learning and the William and Flora Hewlett Foundation.",
                    "label": 0
                },
                {
                    "sent": "And all of the civil society organizations that have made this second we are Congress possible.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "This is an important time for the open movement, both to celebrate what we've accomplished already and then here to set very ambitious goals for what will come next.",
                    "label": 0
                },
                {
                    "sent": "And I hope that we will challenge each other, and that I perhaps will challenge you this morning.",
                    "label": 0
                },
                {
                    "sent": "I want to provide special thanks to all of the national governments who are joining us here in Slovenia.",
                    "label": 0
                },
                {
                    "sent": "The Ministers of education and your delegations.",
                    "label": 0
                },
                {
                    "sent": "You have made time for this.",
                    "label": 0
                },
                {
                    "sent": "It's important and thank you for being here and for engaging with all of us.",
                    "label": 0
                },
                {
                    "sent": "CCS director of Open education cable.",
                    "label": 0
                },
                {
                    "sent": "Green, who's down here on my right and I are looking forward to speaking with you and to helping you in your work so please do find us if there's a way we can be helpful.",
                    "label": 0
                },
                {
                    "sent": "I also want to acknowledge my friends and colleagues in the Open education movement.",
                    "label": 0
                },
                {
                    "sent": "I want to single out members of Creative Commons affiliates who all over the World League country teams, especially the team right here in Slovenia's are Slovenian team here.",
                    "label": 0
                },
                {
                    "sent": "Put trans up there they are.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "I would also like to acknowledge members of Communion who are here Communion is the Association that Creative Commons works in here in Europe, and they have been very, very active on Copyright reform here over the last year, poring over thousands of amendments and trying to advance our cause at the policy level.",
                    "label": 0
                },
                {
                    "sent": "Now the CC global movement is much part of a much larger open movement.",
                    "label": 0
                },
                {
                    "sent": "We're just one piece of it, and I see many of you here today and is a joy for me to be here to talk to you about our work, but also to find an opportunity for all of us to come together and move this work forward.",
                    "label": 0
                },
                {
                    "sent": "Finally, to our Slovenian hosts.",
                    "label": 0
                },
                {
                    "sent": "A little over a year ago I was in Berlin.",
                    "label": 0
                },
                {
                    "sent": "We were hosting an all staff meeting.",
                    "label": 0
                },
                {
                    "sent": "Our team is all over the world and we come together a couple of times a year.",
                    "label": 0
                },
                {
                    "sent": "In order to do strategy and planning.",
                    "label": 0
                },
                {
                    "sent": "So after our long day of planning we found our way to a little German wine bar and were settling in for a drink and then the host came by and he informed us on this night that they were only serving Slovenian wine.",
                    "label": 0
                },
                {
                    "sent": "Now eventually one of us had the courage to ask.",
                    "label": 0
                },
                {
                    "sent": "They make wine in Slovenia.",
                    "label": 0
                },
                {
                    "sent": "Oh yes, they do.",
                    "label": 0
                },
                {
                    "sent": "They actually make spectacular wine here in Slovenia, which some of you may have discovered last evening.",
                    "label": 0
                },
                {
                    "sent": "But I learned yesterday or learned at that time.",
                    "label": 0
                },
                {
                    "sent": "Never underestimate Slovenia and perhaps the Serbian national basketball team learned that very recently as well.",
                    "label": 0
                },
                {
                    "sent": "Perhaps not unlike Canada, where I'm from Slovenia's many accomplishments can sometimes be overshadowed by its more, shall we say, boisterous neighbors who are nearby.",
                    "label": 0
                },
                {
                    "sent": "But there is greatness, and there is ambition, and there is beauty here, and I'm very, very grateful for this perfect place for such a meeting.",
                    "label": 0
                },
                {
                    "sent": "So thank you to our Slovenian host for bringing us here and for hosting us so well.",
                    "label": 0
                },
                {
                    "sent": "So our.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Under today, we're going to talk about open knowledge.",
                    "label": 0
                },
                {
                    "sent": "I'm going to talk about collective action.",
                    "label": 0
                },
                {
                    "sent": "How everyone loves a parade?",
                    "label": 1
                },
                {
                    "sent": "And the big open.",
                    "label": 0
                },
                {
                    "sent": "We have only a brief time here together, so we'll try to cover all of that ground with just enough time for a few questions.",
                    "label": 0
                },
                {
                    "sent": "But if we miss anything, I'm happy to meet folks for a glass of wine when this is all over.",
                    "label": 0
                },
                {
                    "sent": "Now first let's start with some of the basics about CC Now.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "CC is a global non-profit that produces the CC open licenses which you all know.",
                    "label": 0
                },
                {
                    "sent": "The license suite is the international standard for sharing openly with minimal restrictions.",
                    "label": 0
                },
                {
                    "sent": "The licenses are simple.",
                    "label": 0
                },
                {
                    "sent": "They are standardized and they have been designed to comply with international Copyright laws and treaties all over the world.",
                    "label": 0
                },
                {
                    "sent": "They're simple.",
                    "label": 0
                },
                {
                    "sent": "Terms have been translated into over 35 languages around the world, and they were supported by a community of chapters in over 85 countries.",
                    "label": 0
                },
                {
                    "sent": "Now we didn't change Copyright.",
                    "label": 0
                },
                {
                    "sent": "We hacked it.",
                    "label": 0
                },
                {
                    "sent": "We built on top of it.",
                    "label": 0
                },
                {
                    "sent": "We enabled.",
                    "label": 0
                },
                {
                    "sent": "We created what we call a release valve, a free legal suite of tools that anyone could use to share under simple terms.",
                    "label": 0
                },
                {
                    "sent": "Attribution sharealike, noncommercial no derivatives but also our public domain dedication CC zero.",
                    "label": 0
                },
                {
                    "sent": "No restrictions whatsoever.",
                    "label": 0
                },
                {
                    "sent": "We went from All rights reserved to some rights reserved.",
                    "label": 0
                },
                {
                    "sent": "Now the license is backed up by international Copyright are made up of three parts, the legal code.",
                    "label": 0
                },
                {
                    "sent": "The simple terms are what we call the human readable deed.",
                    "label": 0
                },
                {
                    "sent": "And the license metadata, which is actual code.",
                    "label": 0
                },
                {
                    "sent": "That allows them to be read by humans and by lawyers and by machines.",
                    "label": 0
                },
                {
                    "sent": "If you'd like to debate whether lawyers are a subset of humans or whether they are a separate set of humans, we can take that to sign.",
                    "label": 0
                },
                {
                    "sent": "We integrated the licenses into the most popular platforms in the world, put them in the workflows of where people were creating things platforms at the time, like Flickr, like YouTube, like Wikipedia and more recently medium and we help communities and creators use them.",
                    "label": 0
                },
                {
                    "sent": "However they needed in order to advance their work.",
                    "label": 0
                },
                {
                    "sent": "Photos, music, video, open educational resources, and we did it together.",
                    "label": 0
                },
                {
                    "sent": "Millions of craters all over the world.",
                    "label": 0
                },
                {
                    "sent": "Now, 15 years later, Creativecommons is much more than that and this is the part of us that you might not know.",
                    "label": 0
                },
                {
                    "sent": "We're fortunate to be one of the leading organizations in the open movement due in large part to the global network of experts and affiliates.",
                    "label": 0
                },
                {
                    "sent": "Now we provide essential infrastructure through the licenses, but we're also building new infrastructure and new tools like CC search which will add a fourth layer to the license is a database and a registry license backed by software.",
                    "label": 0
                },
                {
                    "sent": "And we actively work to grow and strengthen the movement with convenings and training, mentorship and education, including our own CC Summit, which we held in Toronto last year and will be returning next year in April to Toronto again now early next year.",
                    "label": 0
                },
                {
                    "sent": "Will launch the CC certificate, which is an education program including specializations for librarians, for government and for educators.",
                    "label": 0
                },
                {
                    "sent": "We are literally writing the book on CC and it will be the most comprehensive training program and Creative Commons that we've ever.",
                    "label": 0
                },
                {
                    "sent": "Reduced and will obviously be entirely made of ovr so that anyone can translate, adapt, remix and reuse it.",
                    "label": 0
                },
                {
                    "sent": "So today is CC puts the open in ovr that CC licenses and public domain tools unlock those educational resource is from Copyright so that anyone can pick up that work, reuse it, remix it and adapt it as needed.",
                    "label": 0
                },
                {
                    "sent": "The key distinguishing characteristic of an open educational resource over other materials is it's open license and the way it was made collaboratively.",
                    "label": 0
                },
                {
                    "sent": "The single simple legal permissions that the license grants to the public to read, copy, use, reuse, retain and share.",
                    "label": 0
                },
                {
                    "sent": "Nothing educational resource is not clearly marked with an open license like one of the CC licenses.",
                    "label": 0
                },
                {
                    "sent": "It is not oh we are.",
                    "label": 0
                },
                {
                    "sent": "The most common way to openly license those works to turn them into LDR is to add a CC license.",
                    "label": 0
                },
                {
                    "sent": "And when authors do this to their work, they keep their Copyright, but they share it under those permissive terms.",
                    "label": 0
                },
                {
                    "sent": "So anyone can use them as agreed ovr equals the permissions to modify and free access.",
                    "label": 0
                },
                {
                    "sent": "Those two things are essential to talk more about the permissions later.",
                    "label": 0
                },
                {
                    "sent": "So while the CC tools are built on top of Copyright, today's Copyright laws, which affect everything that we do in education, have not remotely kept up with the times today's laws were first written at a time when creators were rare and were printing, presses were even more rare, and our laws failed to reflect today's technology.",
                    "label": 0
                },
                {
                    "sent": "And the way that we share and make content every single day.",
                    "label": 0
                },
                {
                    "sent": "With the web should have enabled.",
                    "label": 0
                },
                {
                    "sent": "A world of sharing and permissive uses.",
                    "label": 0
                },
                {
                    "sent": "We instead got more restrictive Copyright and less freedom to use even the content we supposedly own as smartphones became ubiquitous.",
                    "label": 0
                },
                {
                    "sent": "As the web became a series of connected databases and API's, and as broadband prices continued to fall, we illuminated Copyright registration so that everyone became a creator of Copyright.",
                    "label": 0
                },
                {
                    "sent": "But there was no single registry for these works to be found.",
                    "label": 0
                },
                {
                    "sent": "Or were used effectively?",
                    "label": 0
                },
                {
                    "sent": "Now, Lawrence Lessig, our Founders Book Free Culture he wrote ours is a less and less free society.",
                    "label": 0
                },
                {
                    "sent": "This is the reality in creativity and knowledge, large rights holders and traditional publishers set the terms for how we access knowledge and culture.",
                    "label": 0
                },
                {
                    "sent": "Even though they built their empires on top of freely available art music.",
                    "label": 0
                },
                {
                    "sent": "Publicly funded science, data research, music, art, culture, folklore and more.",
                    "label": 0
                },
                {
                    "sent": "Let's look at it in his book.",
                    "label": 0
                },
                {
                    "sent": "The past always tries.",
                    "label": 0
                },
                {
                    "sent": "To control the creativity that builds upon it.",
                    "label": 0
                },
                {
                    "sent": "The past is doing pretty well at this job so far.",
                    "label": 0
                },
                {
                    "sent": "Now to work in open education now means that you need to be an arm chair Copyright expert.",
                    "label": 0
                },
                {
                    "sent": "From fair use to fairdealing to library uses and copying to education, exceptions and limitations to user generated content, we ask so much too much.",
                    "label": 0
                },
                {
                    "sent": "I might add of authors and educators who simply want to teach and share knowledge and spend their time dealing with rights, clearances and the fear of being sued for using a work incorrectly.",
                    "label": 0
                },
                {
                    "sent": "With Copyright reform on the table today in the European Commission in Canada and Australia, and with content industries tie, trying to push for secret IP terms in half a dozen to international trade agreement agreements including TPP minus 11 or TPP 11, which is really just TP minus the US and NAFTA, we're constantly playing defense against more restrictive regimes trying to find their way in through any door possible.",
                    "label": 0
                },
                {
                    "sent": "You might think that something as simple as giving access to the blind for works would be a moral imperative and easy to negotiate.",
                    "label": 0
                },
                {
                    "sent": "You would be wrong.",
                    "label": 0
                },
                {
                    "sent": "Now by and large, past has used its influence to ensure that Copyright laws restrict access to creativity and knowledge from those who wanted, no matter how deserving or how needy they may be.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let's talk about collective action.",
                    "label": 1
                },
                {
                    "sent": "I believe in Creative Commons believes that we should aspire to something greater than meticulously regulating monopolistic access for large rights holders.",
                    "label": 0
                },
                {
                    "sent": "We should seek to share knowledge and lift other people up.",
                    "label": 0
                },
                {
                    "sent": "The Commons is humanity's greatest collective act.",
                    "label": 0
                },
                {
                    "sent": "It is the grand sum of human knowledge shared widely and nearly without restriction to enable innovation, discovery and advancement.",
                    "label": 0
                },
                {
                    "sent": "To create a more equitable world.",
                    "label": 0
                },
                {
                    "sent": "To alleviate suffering, to advance the cause of humanity.",
                    "label": 0
                },
                {
                    "sent": "A Creative Commons is just one small part of this global Commons that's made up of all kinds of materials well beyond just the things shared under CC license.",
                    "label": 0
                },
                {
                    "sent": "Yes, open educational resources are in there, but also 3D models, open software movements, data, and more.",
                    "label": 0
                },
                {
                    "sent": "the Commons is a platform for sharing and collaborating, and it belongs to all of us, and it is a public good.",
                    "label": 0
                },
                {
                    "sent": "Now education is also a public good, at least it's supposed to be, but over the past 50 years I think we've lost our grip on this core value in education.",
                    "label": 0
                },
                {
                    "sent": "An educated child can overcome great challenges and find new opportunities to rise above their constraints of poverty or class structures.",
                    "label": 0
                },
                {
                    "sent": "An educated community can create prosperity, innovation and a diverse economy.",
                    "label": 0
                },
                {
                    "sent": "An educated citizenry elects just governments and is resilient in the face of misinformation propaganda and prejudice.",
                    "label": 0
                },
                {
                    "sent": "But in recent years, we've allowed that narrative to shift.",
                    "label": 0
                },
                {
                    "sent": "So that the primary beneficiary of education is seen to be the individual.",
                    "label": 0
                },
                {
                    "sent": "The ideal has allowed the kind of inequality and debt and exclusion that we see to see today to take root and to grow.",
                    "label": 0
                },
                {
                    "sent": "That kind of disparity that now requires SDG, four in the first place.",
                    "label": 0
                },
                {
                    "sent": "Today's educational business models contribute to that.",
                    "label": 0
                },
                {
                    "sent": "From this false belief in individual benefits taking precedence over investments in the public good.",
                    "label": 0
                },
                {
                    "sent": "If education was seen as a public good, we would ask ourselves how we should martial our collective wealth to ensure that it was accessible to everyone, not just those who could pay.",
                    "label": 0
                },
                {
                    "sent": "Today, trillions of dollars in public money are spent on grants to produce materials that we must purchase time and time again.",
                    "label": 0
                },
                {
                    "sent": "More recently, in response to these complaints about the high cost of materials publishers, instead, Lisa's DRM protected educational resource is so students lose actors access at some not so far into the future time.",
                    "label": 0
                },
                {
                    "sent": "The content is locked down in proprietary systems with no permissions for teachers to revise, localise, customize or translate to meet student needs.",
                    "label": 0
                },
                {
                    "sent": "We pay less, but we get less for what we pay and in the end we don't own anything.",
                    "label": 0
                },
                {
                    "sent": "Today most public education and research grants still allow the grantee to keep their oil reserves.",
                    "label": 0
                },
                {
                    "sent": "All rights reserved.",
                    "label": 0
                },
                {
                    "sent": "Copyright with the public funds they've received.",
                    "label": 0
                },
                {
                    "sent": "They then exploit that public investment for their private benefit, the result the public does not have access to what it paid for, and has to pay again for the same resource over and over again.",
                    "label": 0
                },
                {
                    "sent": "We absolutely cannot keep this up.",
                    "label": 0
                },
                {
                    "sent": "The model is unsustainable, and it is unjust.",
                    "label": 0
                },
                {
                    "sent": "I don't need to tell the people in this room that budgets and education are tight.",
                    "label": 0
                },
                {
                    "sent": "So why are we spending them on things we can't own?",
                    "label": 0
                },
                {
                    "sent": "That we can't modify and we can't share to our unique needs.",
                    "label": 0
                },
                {
                    "sent": "We have more than enough money.",
                    "label": 0
                },
                {
                    "sent": "We just need to choose to spend it in ways that meet our educational goals first.",
                    "label": 0
                },
                {
                    "sent": "So let me be clear, publicly funded resource is should be openly licensed resources.",
                    "label": 0
                },
                {
                    "sent": "We heard that at the open of this session and we should keep saying it until it is true everywhere.",
                    "label": 0
                },
                {
                    "sent": "The public should have access to what the public paid for.",
                    "label": 0
                },
                {
                    "sent": "We need to decide what benefits we want to create with our education investments and then ensure that we get them through our policies and practices.",
                    "label": 0
                },
                {
                    "sent": "As advocates, we need to learn lean firmly into this moral case.",
                    "label": 0
                },
                {
                    "sent": "We have a right as a community or as a country to act together to build things that we all benefit from at the minimum reasonable cost shared by everyone to our mutual and collective good.",
                    "label": 0
                },
                {
                    "sent": "This, in fact, is exactly what government was for.",
                    "label": 0
                },
                {
                    "sent": "Now everybody knows that the learning resource is and models we need must respond, respect and reflect our national and local cultures and history.",
                    "label": 0
                },
                {
                    "sent": "But that's just the beginning of the inclusion story.",
                    "label": 0
                },
                {
                    "sent": "We have to acknowledge that as we transition to models that are more open.",
                    "label": 0
                },
                {
                    "sent": "That it require working openly and sharing openly that working this way is a privilege that many of us do not have.",
                    "label": 0
                },
                {
                    "sent": "Sometimes that's because their institution doesn't support those activities yet.",
                    "label": 0
                },
                {
                    "sent": "Because they need the revenues that come from selling their textbooks, because that's the model they operate under today.",
                    "label": 0
                },
                {
                    "sent": "Sometimes, because it's about training or skills and developing these resources, and sometimes the technical barriers are much simpler, but still meaningful and restrictive.",
                    "label": 0
                },
                {
                    "sent": "For those who don't have the skills or the devices, or that bandwidth that I talked about earlier.",
                    "label": 0
                },
                {
                    "sent": "Either way, we cannot ignore that.",
                    "label": 0
                },
                {
                    "sent": "Working openly is a privilege, else we allow we are to become an activity only of rich companies.",
                    "label": 0
                },
                {
                    "sent": "The rich countries from the Global North, led by established career professionals who can afford to take it on and can afford the hit to their careers if we don't consider the structures and cultures that support creation, adoption and maintenance of affective.",
                    "label": 0
                },
                {
                    "sent": "Oh, we are.",
                    "label": 0
                },
                {
                    "sent": "We will never build a broad based, inclusive, truly global community.",
                    "label": 0
                },
                {
                    "sent": "Suggest isn't about only free access.",
                    "label": 0
                },
                {
                    "sent": "Free is not the most powerful thing about oh, we are.",
                    "label": 0
                },
                {
                    "sent": "It's the enabling permissions.",
                    "label": 0
                },
                {
                    "sent": "The permissions are the secret sauce mentioned that earlier.",
                    "label": 0
                },
                {
                    "sent": "Here's why the permissions are important.",
                    "label": 0
                },
                {
                    "sent": "Too many students go without access to relevant updated materials that reflect their lived experience.",
                    "label": 0
                },
                {
                    "sent": "Yet we know that that creates better student outcomes.",
                    "label": 0
                },
                {
                    "sent": "Too many teachers use materials that can't modify, update, or enhance to meet the needs of their learners.",
                    "label": 0
                },
                {
                    "sent": "And too many governments are struggling to find the needed resources to stay competitive in a global market.",
                    "label": 0
                },
                {
                    "sent": "There's anything I want us to focus on.",
                    "label": 0
                },
                {
                    "sent": "It's how we put the power of open at the center of every project, first by building community.",
                    "label": 0
                },
                {
                    "sent": "Second, by focusing on collaboration with partners in a global movement and 3rd by creating cultures of gratitude and by building resilience and engagement.",
                    "label": 0
                },
                {
                    "sent": "You are the experts in education, but I also know that you're under enormous pressure.",
                    "label": 0
                },
                {
                    "sent": "You know that today's models are unsustainable and are failing to achieve the student outcomes we need.",
                    "label": 0
                },
                {
                    "sent": "If we keep spending money, public money, the way we always have, we will never have the opportunity to invest our resources for better outcomes.",
                    "label": 0
                },
                {
                    "sent": "Now obviously, are we ourselves for this and don't take my word for it.",
                    "label": 0
                },
                {
                    "sent": "Some of the leading advocates and experts in O ER right here in this room, and you've been meeting with them and you're going to hear from them over this event.",
                    "label": 0
                },
                {
                    "sent": "We mean to transform education globally.",
                    "label": 0
                },
                {
                    "sent": "But it will require your leadership and your resolve along the way.",
                    "label": 0
                },
                {
                    "sent": "You will disrupt traditional business models that are based on artificial scarcity.",
                    "label": 0
                },
                {
                    "sent": "You will agitate old empires.",
                    "label": 0
                },
                {
                    "sent": "But when you create new models that are based on this kind of abundance that we can have, you will also make education better and open up new opportunities for students.",
                    "label": 0
                },
                {
                    "sent": "For teachers, yes also for businesses and for the public good.",
                    "label": 0
                },
                {
                    "sent": "That I would argue should be our focus, not protecting old business models from the inevitable.",
                    "label": 0
                },
                {
                    "sent": "You collectively have trillions of dollars of investment in your departments and ministries of education with a mandate to modernize, innovate, and most importantly, educate the current and future generations of your citizens.",
                    "label": 0
                },
                {
                    "sent": "And you have millions of educators, librarians, academics and creators at the ready to help you from all over the world.",
                    "label": 0
                },
                {
                    "sent": "They're just waiting for the opportunity.",
                    "label": 0
                },
                {
                    "sent": "These are our public education systems left to their own devices.",
                    "label": 0
                },
                {
                    "sent": "Existing market actors will continue to build the future out of the past.",
                    "label": 0
                },
                {
                    "sent": "Creating digital versions of printed textbooks, importing advertising and data surveillance models into education tools and using false scarcity to extract resources from students and school boards.",
                    "label": 0
                },
                {
                    "sent": "Without your leadership, we will continue to use old procurement structures to spend public funds on these antiquated models.",
                    "label": 0
                },
                {
                    "sent": "This is about our collective power to act globally across borders in no other room in the world with no other group of leaders, is there more potential to have impact?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Can we talk about how everybody loves a parade?",
                    "label": 1
                },
                {
                    "sent": "Before I was asked to leave Creative Commons, I worked in Mesa.",
                    "label": 0
                },
                {
                    "sent": "Municipal government spent seven years as a political adviser, Anna policy maker in both Toronto and in Vancouver, and the first rule when advising my political boss was find a parade.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Stand in front of it.",
                    "label": 0
                },
                {
                    "sent": "And the parade is here right in front of you.",
                    "label": 0
                },
                {
                    "sent": "And it is marching along a global path.",
                    "label": 0
                },
                {
                    "sent": "This is my Prime Minister may recognize him at the Pride parade in Vancouver.",
                    "label": 1
                },
                {
                    "sent": "Open education is not just about innovation, it is market transformation.",
                    "label": 0
                },
                {
                    "sent": "It will change the way learners learn the way teachers teach.",
                    "label": 0
                },
                {
                    "sent": "The way knowledge is created and funded an shared and is not an old idea of made new again.",
                    "label": 0
                },
                {
                    "sent": "It is a realization of the potential of collaboration of the Internet.",
                    "label": 0
                },
                {
                    "sent": "If we're brave enough to do it.",
                    "label": 0
                },
                {
                    "sent": "There is huge momentum already underway for open education and the development adoption of open educational policies and practices.",
                    "label": 0
                },
                {
                    "sent": "Communities have realized this potential governments have seen this potential.",
                    "label": 0
                },
                {
                    "sent": "And the value of this investment.",
                    "label": 0
                },
                {
                    "sent": "My other favorite saying in politics was that the public gives us permission to act.",
                    "label": 0
                },
                {
                    "sent": "I believe that more and more people are frustrated with the existing structures and want to see governments adopt innovative solutions that respond to student needs.",
                    "label": 0
                },
                {
                    "sent": "I believe they are behind you.",
                    "label": 0
                },
                {
                    "sent": "If you are able to act.",
                    "label": 0
                },
                {
                    "sent": "Now around this room around this world and in your own communities, the Ovr movement is going mainstream.",
                    "label": 0
                },
                {
                    "sent": "We're seeing this growth 10 years after Cape Town Declaration and five years after the Paris Ovr Declaration.",
                    "label": 0
                },
                {
                    "sent": "We've seen incredible innovation, experimentation, and adoption, and I want to acknowledge all of my colleagues who join us here today who inspired and LED this movement and turned it into a global reality.",
                    "label": 0
                },
                {
                    "sent": "It is a pleasure to work with all of you, and we're so proud to be part of this movement with you.",
                    "label": 0
                },
                {
                    "sent": "This is your invitation.",
                    "label": 0
                },
                {
                    "sent": "The people who built this parade some from before the phrase ovr was even coined, some of which are in this room.",
                    "label": 0
                },
                {
                    "sent": "We're all here to help you, educators, academics, researchers, librarians, coders, lawyers, nonprofits, IGO's, foundations and governments.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let's talk about the big open.",
                    "label": 1
                },
                {
                    "sent": "That's all of us together working globally.",
                    "label": 0
                },
                {
                    "sent": "You must be asking you.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Self, what can I do right now?",
                    "label": 1
                },
                {
                    "sent": "Well, I'm glad that you asked.",
                    "label": 0
                },
                {
                    "sent": "Here are five things.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That you could do right now.",
                    "label": 0
                },
                {
                    "sent": "First create a national open education strategy, master plan or an open licensing policy.",
                    "label": 0
                },
                {
                    "sent": "Start small if you have to, but require all publicly funded resource is to be openly licensed.",
                    "label": 0
                },
                {
                    "sent": "If you need help, ask us will help you and we've done it all around the world with departments and governments everywhere.",
                    "label": 0
                },
                {
                    "sent": "Secondly, check out the Cape Town plus 10 cards highlighting key themes in the future of ovr, and there's a book if you haven't seen it, it's fantastic.",
                    "label": 0
                },
                {
                    "sent": "Produced by a community.",
                    "label": 0
                },
                {
                    "sent": "Check these out.",
                    "label": 0
                },
                {
                    "sent": "This is where we need to go next.",
                    "label": 0
                },
                {
                    "sent": "3rd join us at the CC Summit in 2018 April 13th to 15th.",
                    "label": 0
                },
                {
                    "sent": "In Toronto, where will bring our community together and a broader community of collaborators around many issues, especially open education, and we've seen massive growth in our online community, and we encourage you to join it there.",
                    "label": 0
                },
                {
                    "sent": "Over 425 leading participants from around the world.",
                    "label": 0
                },
                {
                    "sent": "Joining us online there and you can find cable if you'd like to join that or find us online.",
                    "label": 0
                },
                {
                    "sent": "4th support national and regional Copyright reform efforts that increase fair use or fair dealing for education and resource resource is, as I said, Copyright now has a huge part to play in our ability to execute an open education.",
                    "label": 0
                },
                {
                    "sent": "We need your help there.",
                    "label": 0
                },
                {
                    "sent": "At a minimum, we just need your voice to support our work.",
                    "label": 0
                },
                {
                    "sent": "And finally, support the creation and implementation of a new UNESCO instrument that further supports open education in UNESCO Member states.",
                    "label": 1
                },
                {
                    "sent": "It's a big lift, but we think that there is merit here in pursuing this idea.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me wrap up.",
                    "label": 0
                },
                {
                    "sent": "We're all here because we dream of an education system that is just.",
                    "label": 0
                },
                {
                    "sent": "We set an ambitious goal with SDG four and to achieve it these old models are not going to service service us.",
                    "label": 0
                },
                {
                    "sent": "We're going to have to innovate and we already are starting to do it.",
                    "label": 0
                },
                {
                    "sent": "Some businesses will evolve and others won't, and our focus has to be on improving student outcomes, not protecting old models.",
                    "label": 0
                },
                {
                    "sent": "A recent study published in the Public Library of Science showed that when you teach children, the most common ways to where an argument is misrepresented.",
                    "label": 0
                },
                {
                    "sent": "They are less likely to fall for it when they see it again in the media.",
                    "label": 0
                },
                {
                    "sent": "This is the solution to fake news.",
                    "label": 0
                },
                {
                    "sent": "It's not an algorithm, it's not regulation.",
                    "label": 0
                },
                {
                    "sent": "It's not an app.",
                    "label": 0
                },
                {
                    "sent": "There isn't a way to code our way out of fake news.",
                    "label": 0
                },
                {
                    "sent": "Education is the way out of fake news.",
                    "label": 0
                },
                {
                    "sent": "Critical thinking.",
                    "label": 0
                },
                {
                    "sent": "This is what we need and this is what we're doing by spreading education widely.",
                    "label": 0
                },
                {
                    "sent": "We all understand how vital an informed, engaged, critical citizenry can be in creating a more equitable, accessible just society.",
                    "label": 0
                },
                {
                    "sent": "So I said that I wanted to open and close with gratitude.",
                    "label": 0
                },
                {
                    "sent": "We need you.",
                    "label": 0
                },
                {
                    "sent": "We need your work, your ingenuity, your courageous leadership.",
                    "label": 0
                },
                {
                    "sent": "To paraphrase Darren Walker from the Ford Foundation.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your energy and for your commitment and for being here to be in this conversation.",
                    "label": 0
                },
                {
                    "sent": "I know I speak for the entire global open movement when I tell you that we all stand ready to help in every single way that we can.",
                    "label": 0
                },
                {
                    "sent": "Thank you for listening.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There is a huge Copyright reform taking place right now in Europe.",
                    "label": 0
                },
                {
                    "sent": "Is it still time to act and what should be done?",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "It is absolutely still time to act.",
                    "label": 0
                },
                {
                    "sent": "So for those of the those of you that are following this, there are a myriad of committees where a variety of recommendations are making their way through, and there have been thousands of amendments.",
                    "label": 0
                },
                {
                    "sent": "We're still knee deep in the process where the leading committees have still not finalized their recommendations, but where there are some really disturbing issues on the table, and there are also some opportunities.",
                    "label": 0
                },
                {
                    "sent": "So there is an education exception being.",
                    "label": 0
                },
                {
                    "sent": "Proposed, but the question is, will it make it through and will it be usable?",
                    "label": 0
                },
                {
                    "sent": "There are issues of things like text and data mining, the ability to Marshall the resource is of massive computers to read information like it was data and if we want to explore innovation and discovery and science we need to unlock that.",
                    "label": 0
                },
                {
                    "sent": "There are issues around user generated content, but there are also issues that will in my opinion break the Internet and provide new rights that are unnecessary.",
                    "label": 0
                },
                {
                    "sent": "They're being advocated.",
                    "label": 0
                },
                {
                    "sent": "4 by publishers.",
                    "label": 0
                },
                {
                    "sent": "So to answer your question.",
                    "label": 0
                },
                {
                    "sent": "You know, I would check out organizations like Communion.",
                    "label": 0
                },
                {
                    "sent": "CC works very closely with communion.",
                    "label": 0
                },
                {
                    "sent": "In the EU were an active partner, an many of the community members are here and look for an opportunity to see where we are at.",
                    "label": 0
                },
                {
                    "sent": "In that process.",
                    "label": 0
                },
                {
                    "sent": "We don't expect the vote to come forward until probably next year, but there's still lots of activism on the ground.",
                    "label": 0
                },
                {
                    "sent": "Lots of opportunity to engage your MPs and to look at where the issues are playing out.",
                    "label": 0
                },
                {
                    "sent": "And then once it's actually approved by the Commission.",
                    "label": 0
                },
                {
                    "sent": "It still has to be implemented by every Member State, and there are plenty of ways for that to go well or badly.",
                    "label": 0
                },
                {
                    "sent": "And so yeah, the fight is only just beginning and I have to give enormous credit to Tim Vollmer on our team.",
                    "label": 0
                },
                {
                    "sent": "Who does that work but also the community members.",
                    "label": 0
                },
                {
                    "sent": "It is thankless line by line work that they do on our behalf to try and keep track of all of these amendments and make sure that bad things don't get through.",
                    "label": 0
                },
                {
                    "sent": "Thanks for the question.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Anymore question yes.",
                    "label": 0
                },
                {
                    "sent": "Just with my mic.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Just in respect of guarding against plagiarism.",
                    "label": 0
                },
                {
                    "sent": "Obviously whatever resources are made available as open education resources.",
                    "label": 0
                },
                {
                    "sent": "Are there any norms or standards business processes in terms of development of open education resources that would assist us to guard against that kind of?",
                    "label": 0
                },
                {
                    "sent": "Negative.",
                    "label": 0
                },
                {
                    "sent": "Feedback in terms of what has been put on is actually plagiarized, and that if we convert that to print material for learners that we are not taken to the court.",
                    "label": 0
                },
                {
                    "sent": "So is there any standards that have been put in place?",
                    "label": 0
                },
                {
                    "sent": "Guidance, thank you.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I mean, Creative Commons tools are built on top of Copyright and so they also inherit all the challenges of copyrighted materials, so there's nothing in a CC license or in All rights reserved that will protect you from plagiarism.",
                    "label": 0
                },
                {
                    "sent": "About actor is going to act badly.",
                    "label": 0
                },
                {
                    "sent": "It's the same question.",
                    "label": 0
                },
                {
                    "sent": "I get all the time about how I don't want to share my research openly because someone will distort my results.",
                    "label": 0
                },
                {
                    "sent": "I promise you, if someone wants to distort your results or promote propaganda, respecting Copyright is not the thing.",
                    "label": 0
                },
                {
                    "sent": "They're worried about.",
                    "label": 0
                },
                {
                    "sent": "The thing they're worried.",
                    "label": 0
                },
                {
                    "sent": "You know they're going to do it anyway.",
                    "label": 0
                },
                {
                    "sent": "I think we need to do a better job of making it easier for people to use those resources and to mark them so that you can follow the thread.",
                    "label": 0
                },
                {
                    "sent": "So one of the things that I think is powerful about CC licenses is that every one of them requires Attribution, and at its basic level, Attribution is the name of the author, the title of the work, a link to its original source, and a linked to the D that make sure that you know what the terms are that link to source is vital because it means that I can follow the thread back and find out.",
                    "label": 0
                },
                {
                    "sent": "Original work was did and did you.",
                    "label": 0
                },
                {
                    "sent": "How did you use it?",
                    "label": 0
                },
                {
                    "sent": "Did you change it?",
                    "label": 0
                },
                {
                    "sent": "So we think that that's really important.",
                    "label": 0
                },
                {
                    "sent": "I also will be really honest.",
                    "label": 0
                },
                {
                    "sent": "I think we need to do better on our end to make that easier.",
                    "label": 0
                },
                {
                    "sent": "I think Attribution should be automatic.",
                    "label": 0
                },
                {
                    "sent": "I think when you touch a work there should be a digital service that does that for you that you can modify.",
                    "label": 0
                },
                {
                    "sent": "If you need to.",
                    "label": 0
                },
                {
                    "sent": "But then we automate that.",
                    "label": 0
                },
                {
                    "sent": "And we've launched a tool in February called CC Search which starts to do that.",
                    "label": 0
                },
                {
                    "sent": "So if you visit our tool on our website at ccsearch.creativecommons.org.",
                    "label": 0
                },
                {
                    "sent": "We've indexed about 1% of the Commons there, and it includes a one click Attribution tool.",
                    "label": 0
                },
                {
                    "sent": "Now just uses photos.",
                    "label": 0
                },
                {
                    "sent": "At this point will expand to other content type soon, but the idea is that you just click and you get preformatted Attribution that you can paste into your work so you don't have to guess.",
                    "label": 0
                },
                {
                    "sent": "But how to do it.",
                    "label": 0
                },
                {
                    "sent": "What we'd eventually like to do is and what we're planning to do, and I mentioned very briefly the idea of a license back by software is that there would be a registry in an API that would allow you depending on what platform you were working in to have it automatically generate.",
                    "label": 0
                },
                {
                    "sent": "That Attribution for you and place it on the page.",
                    "label": 0
                },
                {
                    "sent": "Thanks very much.",
                    "label": 0
                },
                {
                    "sent": "Any questions yes.",
                    "label": 0
                },
                {
                    "sent": "You will get the mic from behind.",
                    "label": 0
                },
                {
                    "sent": "Hello Sir, thank you for your wonderful presentation.",
                    "label": 0
                },
                {
                    "sent": "My name is Sarah.",
                    "label": 0
                },
                {
                    "sent": "I'm from Bangladesh.",
                    "label": 0
                },
                {
                    "sent": "A trait of Prime Minister selfish.",
                    "label": 0
                },
                {
                    "sent": "So I'm seeking your advice for one of our ICT in education initiatives that is teachers portal.",
                    "label": 0
                },
                {
                    "sent": "We have developed a teachers portal where more than 250,000 teachers are collaborating and Co creating content and there are more than 120,000 contents there.",
                    "label": 0
                },
                {
                    "sent": "So teachers are using their content reusing.",
                    "label": 0
                },
                {
                    "sent": "Distribute and redistribute, though we did not make all the contents, and declared as OEI.",
                    "label": 0
                },
                {
                    "sent": "So my question is that if we want to declare this content as O ER under CC license, what we need to do.",
                    "label": 0
                },
                {
                    "sent": "If you please kindly suggest us.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "That's a great question.",
                    "label": 0
                },
                {
                    "sent": "I'll give you the simple answer quickly and then the more complicated question we can take offline and we're happy to help you with it.",
                    "label": 0
                },
                {
                    "sent": "The Copyright is held by the creator, and so depending on how you've enabled all of that sharing, you may have huge group of authors, each of whom holds individual Copyright.",
                    "label": 0
                },
                {
                    "sent": "And if they haven't shared under the terms that enable that, you have to ask them, and so you may need to find a way to go back and make sure that those works are licensed and then marked correctly so that anyone can use them.",
                    "label": 0
                },
                {
                    "sent": "So I think that's the fundamental piece, and So what we would recommend going forward is that you set that standard upfront.",
                    "label": 0
                },
                {
                    "sent": "And established how you would do that through a policy.",
                    "label": 0
                },
                {
                    "sent": "And there are bunch of different ways that you can do that, and you may also wish to integrate the CC licensed tools into whatever platform you're using so that the marking is simple so that people don't have to go to a website and guess and figure it out.",
                    "label": 0
                },
                {
                    "sent": "You can really simplify that process for people, but we're happy to talk to you offline about different ways you can do that with your own group and then just the last piece I think is.",
                    "label": 0
                },
                {
                    "sent": "The licenses I think don't really work without community, and it's a part of the license that we don't talk about a lot.",
                    "label": 0
                },
                {
                    "sent": "And I have a lot of conversations with people saying, well, you know this thing happened and it's really difficult.",
                    "label": 0
                },
                {
                    "sent": "Maybe you could modify the license to exclude this and that, and the truth is, we'll never be able to write a perfect license that responds to every single issue.",
                    "label": 0
                },
                {
                    "sent": "I can never legal code my way out of that, but the thing that almost always works to get out of that stuff is community.",
                    "label": 0
                },
                {
                    "sent": "When people enter into this idea with goodwill and the intention of sharing and collaborating.",
                    "label": 0
                },
                {
                    "sent": "They're mostly always work it out.",
                    "label": 0
                },
                {
                    "sent": "It's why there aren't a long list of legal cases around CC licenses, 'cause when those people come to us mostly, we say, well, can you work it out together and mostly they do now.",
                    "label": 0
                },
                {
                    "sent": "Yes, the licenses hold up under legal scrutiny, and in most of the cases, and you can find them on our sites.",
                    "label": 0
                },
                {
                    "sent": "You know the story is that the license terms held up, but the licenses work best when people choose to work together.",
                    "label": 0
                },
                {
                    "sent": "That was the point they were meant to be an enabling function for people who want to share.",
                    "label": 0
                },
                {
                    "sent": "So building community amongst those.",
                    "label": 0
                },
                {
                    "sent": "Educators helping them understand the value of working together and what they get from each other and giving gratitude to each other for what they've each shared goes a very, very long way in illuminating the little conflicts that can come up all the time.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Anymore questions, yes.",
                    "label": 0
                },
                {
                    "sent": "That would be probably the last question we can answer, but just just wait for the microphone, but it's coming.",
                    "label": 0
                },
                {
                    "sent": "First of all, thank you for your really inspiring presentation and my question is related to the practice we are confronting everyday and in our everyday life.",
                    "label": 0
                },
                {
                    "sent": "We often find the content.",
                    "label": 0
                },
                {
                    "sent": "The different rights and licenses.",
                    "label": 0
                },
                {
                    "sent": "For example, we have situation that the researcher transferred Copyright to the publisher at the same time the same researcher deposited the same.",
                    "label": 0
                },
                {
                    "sent": "Piece of work in the repository with Creative Commons license, which we are, by the way promoting very strongly in our country.",
                    "label": 0
                },
                {
                    "sent": "So how how to deal with such situations?",
                    "label": 0
                },
                {
                    "sent": "Yeah, first of all, thank you for your work.",
                    "label": 0
                },
                {
                    "sent": "As I said earlier that the challenges of Copyright and the challenges of CC licenses are similar because one is built on the other an where rights are not indicated clearly can be a real challenge.",
                    "label": 0
                },
                {
                    "sent": "I don't have a great answer for you right now in terms of what you do when those rights statements are unclear other than going to the author and trying to clear that up.",
                    "label": 0
                },
                {
                    "sent": "And we see tons of that going on.",
                    "label": 0
                },
                {
                    "sent": "It's why we advocate for me.",
                    "label": 0
                },
                {
                    "sent": "That's why we created a tool that has intended to have clear simple marking is to alleviate that.",
                    "label": 0
                },
                {
                    "sent": "But even with that.",
                    "label": 0
                },
                {
                    "sent": "There's complexity and we answer those questions all the time.",
                    "label": 0
                },
                {
                    "sent": "One of the reasons we're building a project we call the open Ledger, which is just database that contains every openly licensed work, its location on the web and its associated metadata, and an API or a piece of software to talk to.",
                    "label": 0
                },
                {
                    "sent": "That database is because we want to be able to help solve that problem because there are 1.2 billion licensed works in the world, and there's no way to find them all, and there's no front door, and so I feel your pain, and we're doing what we can.",
                    "label": 0
                },
                {
                    "sent": "To help you, the project is underway, but we're a little ways off.",
                    "label": 0
                },
                {
                    "sent": "So thank you very much, Miss Merkley, or regarding your Hungary citizenship.",
                    "label": 0
                },
                {
                    "sent": "I think our Minister of Education is is the right address.",
                    "label": 0
                },
                {
                    "sent": "She actually granted three months ago Nextra nationality to American basketball player, and he is European champion now, so.",
                    "label": 0
                },
                {
                    "sent": "So Slovenia is probably the best gateway for Americans or Canadians or everybody outside Europe to become European champion.",
                    "label": 0
                },
                {
                    "sent": "So I have to join the national cycling team.",
                    "label": 0
                },
                {
                    "sent": "Is that what you're saying?",
                    "label": 0
                },
                {
                    "sent": "Big apt?",
                    "label": 0
                },
                {
                    "sent": "I have to join the national cycling team.",
                    "label": 0
                },
                {
                    "sent": "That's all.",
                    "label": 0
                },
                {
                    "sent": "Yes, that's much.",
                    "label": 0
                },
                {
                    "sent": "You should be very, very good in cycling because we have we have a guy who actually wanna stage at Tour de France this year.",
                    "label": 0
                },
                {
                    "sent": "So and and we'll chat.",
                    "label": 0
                },
                {
                    "sent": "So it's thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Pretty much good cyclist here.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much Mr. Merkley.",
                    "label": 0
                },
                {
                    "sent": "It's really.",
                    "label": 0
                },
                {
                    "sent": "Great.",
                    "label": 0
                }
            ]
        }
    }
}