{
    "id": "6usybpg57h2rsx5njskebxjobccc25dp",
    "title": "Supporting Collaborative Ontology Development in Protege",
    "info": {
        "author": [
            "Tania Tudorache, Stanford Center for Biomedical Informatics Research"
        ],
        "published": "Nov. 24, 2008",
        "recorded": "October 2008",
        "category": [
            "Top->Computer Science->Semantic Web->Ontologies"
        ]
    },
    "url": "http://videolectures.net/iswc08_tudarache_scodp/",
    "segmentation": [
        [
            "I'm going to talk a little bit about the work that we have been done.",
            "We have been doing in the Protege group at Stanford for supporting collaborative ontology development in Precision."
        ],
        [
            "In recent years we have seen some dramatic changes happening in the way that people develop ontologies.",
            "As ontologies become very common in many scientific domains and especially in biomedicine, we see that ontologies are now being developed more and more by larger group of domain.",
            "Actually, so far we've seen a lot of ontology experts being involved in the ontology development, but now we see more domain experts being involved in this development process.",
            "We have also seen that ontologies, at least the ones in the biomedical domain become larger and larger, so it is harder and harder for a single group or for one user to develop the ontology by themselves users.",
            "Another trend that we have seen is that users are becoming more and more familiar with all this.",
            "Collaboration features social features and so on, and people are used to user contribue."
        ],
        [
            "It content.",
            "Actually, with this dramatic changes in the way that ontologies are developed, we do need better tools, support for collaboration.",
            "Ideally an ontology environment should have this collaboration support integrated in the tool itself.",
            "So what we have done, we have looked.",
            "We have tried to find what are the main requirements for supporting collaborative ontology development, what we have done.",
            "We have looked at different biomedical projects that develop larger ontologies in collaboration and we have also looked at CKC challenge, the collaborative construction of structured knowledge that ran at the workshop at the www.conferenceinbanff.",
            "Where users users were given tools for collaborative construction of structured knowledge and they they had a task of building some small ontology or something to to use the tool to build a common model and it was not a competition between the tools but mostly it was the competition between the users to encourage the participation.",
            "So the biomedical projects that we have looked at our."
        ],
        [
            "The gene Ontology, the National Cancer Institute Disorders bio majeti.",
            "The International Classification of Diseases and I will show you just an example of such a collaborative development process, just."
        ],
        [
            "That you get a better idea what I'm talking about.",
            "So the National Cancer Institute develops a reference ontology for cancer biology, translational science and clinical ontology called the NCIS.",
            "Or is the way that they they are around 20 full-time editors that are making changes to a common ontology stored on a server using protege clients.",
            "Each approximately each month they have a baseline version that is published through the community at large, then in the next month this editors added this common copy of the ontology at the end of this development cycle, a curator or leads editor is inspecting changes that have been done by the by the editors and approves or rejects the changes, and then a new baseline is.",
            "Published so this is one of one of the type of collaborative workflows that we have been looking at.",
            "All the projects that we have met that I have mentioned before have very different collaborative processes that this is also something very important that we have seen.",
            "No two projects actually use the same collaboration features or collaboration processes."
        ],
        [
            "So some of the main tool requirements that we have identified after studying this use cases and after conducting the CKC challenge where the following.",
            "So first people do need tools for discussion and reaching consensus.",
            "So as you know building ontologies is not easy.",
            "There are many contention items.",
            "Many times people tend to discuss a lot use mailing lists get very excited about everything.",
            "The problem is that this thing happened on a mailing list or somewhere in a forum and this discussion mostly get lost so.",
            "That's why people would like to have a way to see this comment and recording this design rationale in the context of an ontology and be like, for example, a class or property and, say, have all the discussion somehow directly linked to that.",
            "Then of course, people want to see what are the history of changes.",
            "See who did what and if it was right or wrong.",
            "Provenance and Trust is a very important topic too.",
            "If somebody did a change, you want to know who did it so that you know who's responsible for it.",
            "Then many users in in the CKC challenge expressed the need for having personal views of ontologies very often with large ontologies is very hard.",
            "People lose the overview on the ontology, so people like to say oh, I'm just interested in this tree.",
            "Can you give me a tree of the Ncit source?",
            "I'm just interested in jeans.",
            "This is very common.",
            "So they would like to have some kind of personalized views based on the levels of expertise, roles, task and so on."
        ],
        [
            "Of course, in an in a collaborative process you do have to have user roles an access control.",
            "So for example, some users are allowed to make changes, others are only allowed to browse, some are allowed to start proposals for changes.",
            "All the people is allowed to vote and things like that, and what we have seen from the use cases that we have analyzed this user roles and access control is totally different from project to project.",
            "They they all have different user roles.",
            "Just by we have been working pretty closely with the National Cancer Institute and they have like around 20 policies access policies defined and I think 2020 rolls or something.",
            "And because all of these use cases, we have looked at, we were thinking that flexible workflow support is also very important because people they start the collaboration process.",
            "But they often change it.",
            "So they say oh, actually it would be good to have interesting one more step in this workflow.",
            "So we do want to have a way to support flexible workflow so not to have them hard coded in the tools, because then something changes you need to change the code, that's bad.",
            "Then people also need support for different levels of expressiveness of ontology.",
            "Some people just want to edit classes.",
            "Some people want are just interested in instances, for example.",
            "And of course any ontology framework for collaboration should be scalable, reliable people don't like to lose data and."
        ],
        [
            "Robust.",
            "This is a project editor, the Classical One.",
            "This is the project 3.",
            "It produces an open source Android development environment with a pretty strong user community."
        ],
        [
            "And we have extended project to support collaboration and the extension is called Collaborative Protege and it is actually a plug into the project system.",
            "Which supports annotation of ontology components.",
            "For example classes, properties and so on, or changes in the ontology.",
            "It allows users to create discussion threads related to a class.",
            "For example.",
            "It also supports proposals and voting, searching and filtering in this annotations body and also defining user groups and policies.",
            "Currently it only works in the previous three environment in all the back end supported by the tool is so in our LAN in frames and.",
            "Whatever else is there are DFS.",
            "And it is meant to be used with the multi user mode of production and it is distributed with a pre installation for a year already."
        ],
        [
            "Just to give an idea what I'm talking about when I'm saying.",
            "The collaborative project.",
            "So what you see on the left side is just the whatever the common protege view you see the Class 3 on the left side in the middle is some class details and the right side is actually the collaboration support that we have added.",
            "If sometimes it can be annoying if it takes too much space, you can always collapse it.",
            "You see on the top there the collaborative tabs how we call them and you see a little icon next to the domain concept which notifies the user that there are some discussions related to that ontology class and what you see there.",
            "You see some comments added by myself in the Pizza Ontology.",
            "And this you see this little C icon.",
            "This annotations are typed.",
            "We have defined ontology of annotations in which we define these types of annotations that users can use on on different ontology components and changes and for example see their stands for comment and then below there's an East.",
            "Let's explanation.",
            "So each type of each type of annotation has its own icon there just to help the user understand this.",
            "What you see on the bottom side of the screen is actually the annotation details, so I made it look like like an email, almost because it's more familiar to the users.",
            "You can see who did it an when these are filled in automatically by the system.",
            "It has a subject and then there is a body of the annotation where you can use this HTML styles and you can also include.",
            "This was a very nice feature that people requested.",
            "They would they wanted to include links to other classes or entities in the oncology.",
            "So what you see there that link it's a link to the pizza class so you can just insert an internal link and then when somebody else looks at the annotation he can just click on that link and then the new window would come up with the definition of pizza."
        ],
        [
            "So what is behind this collaboration supporting Protege?",
            "It's actually very easy.",
            "Users added deontologist before in the procedure client.",
            "What we have added and excuse me a second.",
            "So what we have added we have added so next to the domain ontology like that could be the NCI tease or as we have added a knowledge base of changes and annotations which stores as instances the annotations that are attached to the ontology components that you have seen.",
            "So two classes.",
            "So I'm going to go into details, little bit.",
            "Or maybe I can talk here a bit about it.",
            "So for example, if when a user creates a class in the client, what is what is happening is that.",
            "That change will go in the domain ontology.",
            "Meanwhile, change tracking component will also add an instance of a change to the changes.",
            "An annotation knowledge base.",
            "So each change is also an instance in this change is an annotation ontology.",
            "This means that user can also comment on changes because they are also there are ified objects, so you can address that."
        ],
        [
            "Change.",
            "Actually, the whole collaborative support is guided by some set of ontologies we have developed.",
            "We have another set on very little ontology of ontology components and axioms that just said that in an ontology you have ontology classes, properties, individuals.",
            "It's kind of very lightweight, metamodel over language.",
            "Then we have an ontology for discussions and proposals which defines the annotation types.",
            "For example, we have extended the annotation annotation types with comment.",
            "See also example proposal and so on.",
            "We have an ontology about representing changes in which you have classes like create class, created, domain change and all these things and we also have an ontology for representing workflows, collaborative workflows, and another small ontology for representing roles, users and policies.",
            "So actually it's.",
            "This allows us to change pretty.",
            "It's very flexible architecture that allows you to configure the environment in many ways."
        ],
        [
            "Just to give you a quick overview how the changes at annotation Ontology looks like.",
            "So what you see on the right hand side is the annotation annotation class which has certain properties like the title, author, created, modified and so on and the subclasses proposal, explanation, advice and so on.",
            "This so we define probably less than 10 annotation types.",
            "What we have seen our experiments people use only common because there's the default.",
            "Foundation type that comes up in the UI so we will see how useful this differentiation is or not, but actually it is important that people can add their own annotation types.",
            "So if a project has a certain structure for annotations, you just add a subclass and tool picks up that automatically.",
            "And then the the changes representation.",
            "You can see we have class changes, property changes and so on and so forth.",
            "It's just a little."
        ],
        [
            "Heart showed here.",
            "So what is the collaboration framework?",
            "This is actually you can think a bit of it, like on the server side.",
            "So we have this ontologies on that which I talked about before that guide.",
            "The entire collaboration support.",
            "Then we have an API access layer that gives access to the changes, annotations, work flows and so on.",
            "We have generated this API's from the ontologies which was also very nice feature and dangerous if you change the ontologies your.",
            "Your software and compiled after that your code once compared to that and there are also ontology repositories and we use the API to access this ontologies.",
            "We also have, so this collaborative framework is shown here on the back."
        ],
        [
            "Side and we have two clients that currently work with this collaboration framework.",
            "We have the collaborative protege have shown before the user interface and we also have a web client of Protege that accesses the same collaboration framework and there you should see that they are synchronized, meaning that you can edit the same ontology either in the in the rich client or in the web client and the changes are seen immediately.",
            "So if some users just.",
            "Want to browse and create some classes?",
            "Do some lightweight editing.",
            "They do it in the web version of Protege an for more complicated editing they can use the rich client, but the changes are seen immediately."
        ],
        [
            "A little bit about the annotations and discussion thread.",
            "So as I have mentioned before, annotations are linked to ontology components, and ontology component can be a class or property and individual, and we do have these different types of annotations which can be extended and actually in our evaluation we needed this and was a very important feature, and users may undertake classes, properties, individuals or the ontology as a whole.",
            "And we also have support for filtering and searching based on different criteria.",
            "Here what you see here on the right hand side the screenshot.",
            "This is an example of a discussion thread that was done in our evaluation of the tool in the development of the National Cancer Institute Thesaurus.",
            "So you see that most of them are just comments.",
            "They'll see.",
            "There's also a little e.g that stands, for example, and so on.",
            "Then there is another tab, so so far I've been looking at the annotation that a discussion thread step the changes to."
        ],
        [
            "Allows you to see the change history of a certain concept so you see there probably that there's an annotation added.",
            "The class was saved.",
            "This is also from the environment that NCI is using, and as you can see there's a like a little comment attached to the last change of attached to the class."
        ],
        [
            "We also have a chat tab that is integrated in the framework where people can exchange life messages and they also can send internal links in the ontology.",
            "So when users speak about a certain class they can just insert a link to that internal class and the other user can just click on that and he would go directly to the definition of that class and this distinguishes this chat client from other."
        ],
        [
            "Other chat clients.",
            "I'm going to talk very, very briefly about Web protege, which is a web client for Protege and for collaborative project.",
            "It is mainly intended for browsing ontologies on the web and for doing lightweight ontology editing.",
            "We have just released the first Alpha version.",
            "And it is used.",
            "It is designed using a portal metaphor.",
            "The user interface is composed of little reusable components called portlets that people that users can arrange on the user interface and it is extensible.",
            "We try to also use a kind of a plug-in infrastructure so that projects can build their own."
        ],
        [
            "Widgets, so this is how it looks.",
            "This is the entities or as it's right now it looks very much like the rich client with the difference that here you can actually drag drag and drop things on the screen and rearrange and resize and this inner browser.",
            "We have used the Google Web Toolkit to develop the web client and which is very efficient tool.",
            "You develop the code in Java and then is compiled in very optimized and optimized.",
            "JavaScript by the GWT compile."
        ],
        [
            "We performed evaluation in the Athena DSS project.",
            "It's a clinical decision support system that generates guidelines recommendations.",
            "We had three editors evaluate that tool for one month without prior training.",
            "We did point them to the.",
            "Users guide, but I'm pretty sure they didn't look at it.",
            "No, the way that they use the tool that we had to clinicians and one ontology expert where helping with with the ontology development.",
            "What we've seen is that people use mostly comments on instances because they're mainly focusing on instances rather than classes.",
            "And they use discussions, for example, to ask questions to the clinicians were asking questions.",
            "The ontology expert.",
            "How should I model this thing?",
            "What's the best way to model?",
            "We have also seen that people don't like to add annotations to change is probably there too abstract in a way they like to add comments to the classes or instances.",
            "So they did that.",
            "They used it.",
            "They used annotations to document the narrative description of a guide."
        ],
        [
            "And a set of quality parameters.",
            "What we had to do.",
            "They said, OK, I want to attach an annotation to this specific guideline, but it has to be attached not to this just this guideline instance, but it should be attached also to all other related instances.",
            "So we had to develop a specific annotation type.",
            "The guideline comment and have their own structure and forms.",
            "And it was very nice to see that we were able to do this other uses.",
            "Of the annotations.",
            "Where to record the design rationale or explain modeling approaches or this is this didn't happen yet, but they suggested that a good way of educating you.",
            "Users who had to develop this ontology some."
        ],
        [
            "Future directions.",
            "We do want to include a more flexible workflow support in our collaboration framework.",
            "We do have a proof of concept implementation, but we still have a lot to be done.",
            "In this implementation, we have off the shelf workflow engine integrated in the collaboration framework and you can define your workflow.",
            "Your collaboration workflow in terms of instances of and work on teologi.",
            "Then we would also like to support synchronous and asynchronous editing modes.",
            "Right now all the changes are seen immediately by all the users, but some people prefer the SVN type access where people check out a part of ontology check back in.",
            "We do want to make more usability studies and improvements.",
            "And we got some good ideas from from other evaluations that we have already done, like to integrate this with an issue tracker, or to have RSS feeds of changes have a calendar for scheduling appointments.",
            "This was used in another evaluation that we did with the NCI tesouros where people were actually using the this annotation say oh we should discuss this at the next meeting.",
            "Things like that and very soon we would like to pour this collaborative framework to work with Project 4.",
            "And please come see, the demo will have a post render demo later today.",
            "Thank you very much.",
            "Quick."
        ],
        [
            "Question, yeah.",
            "So in databases we have transactions when people need to anything editing the same thing, you can roll back.",
            "What is this a possibility or options in ontology development when you have some people saying the same thing you're saying if you have SVN and then if somebody raises a class and somebody adds it, how is that synchronization going to be right?",
            "So we already have this transaction support in the prodigious 3 back end it is using the database, so the ontologies are stored in a database and it is using the transaction.",
            "Part of the databases and all the operations are also happening in a in series on the server side, so if there if there are no way there, it's not easy to create data corruption, but what might happen is that the second user who did a change I didn't get in time the update of the first user, his change will fail, but in our in our experience so far we didn't have such cases, so they're not dead.",
            "Close, click away or milliseconds away.",
            "The changes that we had such problems.",
            "But yes, we are aware that this might be an issue.",
            "Thank you.",
            "We have used.",
            "Right now you can start in different relational databases.",
            "We have our own database schema that we are using.",
            "And so far we have been testing with my SQL Postgres SQL Server, Oracle I think.",
            "But mostly my SQL with we test mostly with my SQL.",
            "I've seen that you have the possibility to comment on auto logical entities that concept and so did.",
            "You also consider about discussing on axioms.",
            "Actually, because things like this A&B are disjoined and so on.",
            "So how do you think that it's using the case here?",
            "Yes, that's a very good point.",
            "Thank you very much.",
            "So right now this is important for three, which is a very entity based system because it is built on top of a frame system.",
            "So as we go to Project 4 and the our API there, everything is an axiom, so we will have a meta model representation of these axioms and then yes you will be able to comment on the axioms themselves, right?",
            "We don't have that yet, so right now it's not that granular level.",
            "Thank you.",
            "Hi there, I'm I'm curious about this study that you did with those three individuals.",
            "Leaving aside the ontology engineer these two clinicians, how much did they understand about what an ontology was, what it was for, and why did they want to make 1?",
            "Maybe you should have them.",
            "Serious question, but I actually mean it seriously.",
            "What was their motivation for creating this ontology and did they understand why they ought to do it or what they would get out of it, right?",
            "So I don't know all the details of this project, but I know that they have been using ontologies for I think 20 years or so.",
            "Maybe Mark can correct me if I'm wrong 10 years.",
            "I'm sorry.",
            "Yes, so I think they knew what they were doing.",
            "And yes.",
            "Not really, so I think there are more, so I think the way that it happened was that the class level was developed by the ontology expert at some point and then actually the the clinician just filled in instances and values and if something they couldn't do then they said oh can you please add this or do this for us somehow?",
            "Yes, I can elaborate.",
            "Thank you.",
            "The clinicians involved are concerned with the development of decision support systems that assist other doctors in the care of patients, and they view the knowledge base of these guidelines that define best practices as sort of their stock in trade in terms of how to make sure that patients are treated and they view these knowledge bases conceptually as a machine encoding of their guidelines, and so they have a good understanding of the instance data, mainly how a particular guideline is represented, they have less understanding of the classes in the ontology which are more generic.",
            "But they do understand when they can't encode the instances that they need for a particular kind of guideline, there's a breakdown and then they can identify a potential problem in the overall guidelines.",
            "So there are obviously not doctors taken off the street, but they are at the same time not what you would consider trained ontologic engineers.",
            "Somebody over there.",
            "In the process of editing the ontology and collaborating editing dollars, does this process also highlight some problems in the.",
            "In the knowledge that they want to specify, I mean so that the revise not only the ontology, but they the previous knowledge that they want to.",
            "In code, so like the guidelines for something like this.",
            "I don't know.",
            "I don't know that whether they were able to find problems in their own guidelines or not.",
            "I cannot answer that.",
            "Sorry, yes.",
            "Yes.",
            "Not really, no.",
            "Because we have this high level so we have this.",
            "The annotations are actually attached to something called an annotatable thing, and then whatever the language metamodel will be subclasses of that annotatable thing, so it should be pretty flexible if things will.",
            "Be added or delete or whatever changed, which it shouldn't require.",
            "Code changes.",
            "But we will have to build or not to build or to reuse an owl two metamodel.",
            "Yes, we don't have that yet.",
            "OK, one final question for ya.",
            "You sense a lot.",
            "So you can do some of that based on what users providing same time, right?",
            "Using log file, right?",
            "So how do you?",
            "How do you combine?",
            "So what is the question?",
            "Right?",
            "You combine this.",
            "So right now what?",
            "So right now we have a change tracking component that is kind of structured log of all the changes and we do plan to analyze those changes, for example to identify higher level operations that the users understand.",
            "Like for example, a refactor is made up of maybe 10 changes, but you don't really see that in the log because they're just changes individual changes.",
            "So we are able to analyze.",
            "And we have some tools actually that were developed for the NCI to look at all the changes and say accept reject changes.",
            "So there are ways of analyzing that, but I don't know how we're going to use that for generating views.",
            "That's something we have to think about.",
            "OK.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm going to talk a little bit about the work that we have been done.",
                    "label": 0
                },
                {
                    "sent": "We have been doing in the Protege group at Stanford for supporting collaborative ontology development in Precision.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In recent years we have seen some dramatic changes happening in the way that people develop ontologies.",
                    "label": 0
                },
                {
                    "sent": "As ontologies become very common in many scientific domains and especially in biomedicine, we see that ontologies are now being developed more and more by larger group of domain.",
                    "label": 1
                },
                {
                    "sent": "Actually, so far we've seen a lot of ontology experts being involved in the ontology development, but now we see more domain experts being involved in this development process.",
                    "label": 0
                },
                {
                    "sent": "We have also seen that ontologies, at least the ones in the biomedical domain become larger and larger, so it is harder and harder for a single group or for one user to develop the ontology by themselves users.",
                    "label": 0
                },
                {
                    "sent": "Another trend that we have seen is that users are becoming more and more familiar with all this.",
                    "label": 1
                },
                {
                    "sent": "Collaboration features social features and so on, and people are used to user contribue.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It content.",
                    "label": 0
                },
                {
                    "sent": "Actually, with this dramatic changes in the way that ontologies are developed, we do need better tools, support for collaboration.",
                    "label": 0
                },
                {
                    "sent": "Ideally an ontology environment should have this collaboration support integrated in the tool itself.",
                    "label": 0
                },
                {
                    "sent": "So what we have done, we have looked.",
                    "label": 0
                },
                {
                    "sent": "We have tried to find what are the main requirements for supporting collaborative ontology development, what we have done.",
                    "label": 0
                },
                {
                    "sent": "We have looked at different biomedical projects that develop larger ontologies in collaboration and we have also looked at CKC challenge, the collaborative construction of structured knowledge that ran at the workshop at the www.conferenceinbanff.",
                    "label": 0
                },
                {
                    "sent": "Where users users were given tools for collaborative construction of structured knowledge and they they had a task of building some small ontology or something to to use the tool to build a common model and it was not a competition between the tools but mostly it was the competition between the users to encourage the participation.",
                    "label": 1
                },
                {
                    "sent": "So the biomedical projects that we have looked at our.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The gene Ontology, the National Cancer Institute Disorders bio majeti.",
                    "label": 0
                },
                {
                    "sent": "The International Classification of Diseases and I will show you just an example of such a collaborative development process, just.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That you get a better idea what I'm talking about.",
                    "label": 0
                },
                {
                    "sent": "So the National Cancer Institute develops a reference ontology for cancer biology, translational science and clinical ontology called the NCIS.",
                    "label": 0
                },
                {
                    "sent": "Or is the way that they they are around 20 full-time editors that are making changes to a common ontology stored on a server using protege clients.",
                    "label": 0
                },
                {
                    "sent": "Each approximately each month they have a baseline version that is published through the community at large, then in the next month this editors added this common copy of the ontology at the end of this development cycle, a curator or leads editor is inspecting changes that have been done by the by the editors and approves or rejects the changes, and then a new baseline is.",
                    "label": 0
                },
                {
                    "sent": "Published so this is one of one of the type of collaborative workflows that we have been looking at.",
                    "label": 0
                },
                {
                    "sent": "All the projects that we have met that I have mentioned before have very different collaborative processes that this is also something very important that we have seen.",
                    "label": 0
                },
                {
                    "sent": "No two projects actually use the same collaboration features or collaboration processes.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So some of the main tool requirements that we have identified after studying this use cases and after conducting the CKC challenge where the following.",
                    "label": 0
                },
                {
                    "sent": "So first people do need tools for discussion and reaching consensus.",
                    "label": 1
                },
                {
                    "sent": "So as you know building ontologies is not easy.",
                    "label": 0
                },
                {
                    "sent": "There are many contention items.",
                    "label": 0
                },
                {
                    "sent": "Many times people tend to discuss a lot use mailing lists get very excited about everything.",
                    "label": 0
                },
                {
                    "sent": "The problem is that this thing happened on a mailing list or somewhere in a forum and this discussion mostly get lost so.",
                    "label": 0
                },
                {
                    "sent": "That's why people would like to have a way to see this comment and recording this design rationale in the context of an ontology and be like, for example, a class or property and, say, have all the discussion somehow directly linked to that.",
                    "label": 0
                },
                {
                    "sent": "Then of course, people want to see what are the history of changes.",
                    "label": 0
                },
                {
                    "sent": "See who did what and if it was right or wrong.",
                    "label": 1
                },
                {
                    "sent": "Provenance and Trust is a very important topic too.",
                    "label": 0
                },
                {
                    "sent": "If somebody did a change, you want to know who did it so that you know who's responsible for it.",
                    "label": 0
                },
                {
                    "sent": "Then many users in in the CKC challenge expressed the need for having personal views of ontologies very often with large ontologies is very hard.",
                    "label": 0
                },
                {
                    "sent": "People lose the overview on the ontology, so people like to say oh, I'm just interested in this tree.",
                    "label": 0
                },
                {
                    "sent": "Can you give me a tree of the Ncit source?",
                    "label": 0
                },
                {
                    "sent": "I'm just interested in jeans.",
                    "label": 0
                },
                {
                    "sent": "This is very common.",
                    "label": 0
                },
                {
                    "sent": "So they would like to have some kind of personalized views based on the levels of expertise, roles, task and so on.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course, in an in a collaborative process you do have to have user roles an access control.",
                    "label": 0
                },
                {
                    "sent": "So for example, some users are allowed to make changes, others are only allowed to browse, some are allowed to start proposals for changes.",
                    "label": 0
                },
                {
                    "sent": "All the people is allowed to vote and things like that, and what we have seen from the use cases that we have analyzed this user roles and access control is totally different from project to project.",
                    "label": 0
                },
                {
                    "sent": "They they all have different user roles.",
                    "label": 0
                },
                {
                    "sent": "Just by we have been working pretty closely with the National Cancer Institute and they have like around 20 policies access policies defined and I think 2020 rolls or something.",
                    "label": 0
                },
                {
                    "sent": "And because all of these use cases, we have looked at, we were thinking that flexible workflow support is also very important because people they start the collaboration process.",
                    "label": 0
                },
                {
                    "sent": "But they often change it.",
                    "label": 0
                },
                {
                    "sent": "So they say oh, actually it would be good to have interesting one more step in this workflow.",
                    "label": 0
                },
                {
                    "sent": "So we do want to have a way to support flexible workflow so not to have them hard coded in the tools, because then something changes you need to change the code, that's bad.",
                    "label": 0
                },
                {
                    "sent": "Then people also need support for different levels of expressiveness of ontology.",
                    "label": 0
                },
                {
                    "sent": "Some people just want to edit classes.",
                    "label": 0
                },
                {
                    "sent": "Some people want are just interested in instances, for example.",
                    "label": 0
                },
                {
                    "sent": "And of course any ontology framework for collaboration should be scalable, reliable people don't like to lose data and.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Robust.",
                    "label": 0
                },
                {
                    "sent": "This is a project editor, the Classical One.",
                    "label": 0
                },
                {
                    "sent": "This is the project 3.",
                    "label": 0
                },
                {
                    "sent": "It produces an open source Android development environment with a pretty strong user community.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we have extended project to support collaboration and the extension is called Collaborative Protege and it is actually a plug into the project system.",
                    "label": 0
                },
                {
                    "sent": "Which supports annotation of ontology components.",
                    "label": 0
                },
                {
                    "sent": "For example classes, properties and so on, or changes in the ontology.",
                    "label": 0
                },
                {
                    "sent": "It allows users to create discussion threads related to a class.",
                    "label": 0
                },
                {
                    "sent": "For example.",
                    "label": 0
                },
                {
                    "sent": "It also supports proposals and voting, searching and filtering in this annotations body and also defining user groups and policies.",
                    "label": 0
                },
                {
                    "sent": "Currently it only works in the previous three environment in all the back end supported by the tool is so in our LAN in frames and.",
                    "label": 0
                },
                {
                    "sent": "Whatever else is there are DFS.",
                    "label": 0
                },
                {
                    "sent": "And it is meant to be used with the multi user mode of production and it is distributed with a pre installation for a year already.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just to give an idea what I'm talking about when I'm saying.",
                    "label": 0
                },
                {
                    "sent": "The collaborative project.",
                    "label": 0
                },
                {
                    "sent": "So what you see on the left side is just the whatever the common protege view you see the Class 3 on the left side in the middle is some class details and the right side is actually the collaboration support that we have added.",
                    "label": 0
                },
                {
                    "sent": "If sometimes it can be annoying if it takes too much space, you can always collapse it.",
                    "label": 0
                },
                {
                    "sent": "You see on the top there the collaborative tabs how we call them and you see a little icon next to the domain concept which notifies the user that there are some discussions related to that ontology class and what you see there.",
                    "label": 0
                },
                {
                    "sent": "You see some comments added by myself in the Pizza Ontology.",
                    "label": 0
                },
                {
                    "sent": "And this you see this little C icon.",
                    "label": 0
                },
                {
                    "sent": "This annotations are typed.",
                    "label": 0
                },
                {
                    "sent": "We have defined ontology of annotations in which we define these types of annotations that users can use on on different ontology components and changes and for example see their stands for comment and then below there's an East.",
                    "label": 0
                },
                {
                    "sent": "Let's explanation.",
                    "label": 0
                },
                {
                    "sent": "So each type of each type of annotation has its own icon there just to help the user understand this.",
                    "label": 0
                },
                {
                    "sent": "What you see on the bottom side of the screen is actually the annotation details, so I made it look like like an email, almost because it's more familiar to the users.",
                    "label": 0
                },
                {
                    "sent": "You can see who did it an when these are filled in automatically by the system.",
                    "label": 0
                },
                {
                    "sent": "It has a subject and then there is a body of the annotation where you can use this HTML styles and you can also include.",
                    "label": 0
                },
                {
                    "sent": "This was a very nice feature that people requested.",
                    "label": 0
                },
                {
                    "sent": "They would they wanted to include links to other classes or entities in the oncology.",
                    "label": 0
                },
                {
                    "sent": "So what you see there that link it's a link to the pizza class so you can just insert an internal link and then when somebody else looks at the annotation he can just click on that link and then the new window would come up with the definition of pizza.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what is behind this collaboration supporting Protege?",
                    "label": 0
                },
                {
                    "sent": "It's actually very easy.",
                    "label": 0
                },
                {
                    "sent": "Users added deontologist before in the procedure client.",
                    "label": 0
                },
                {
                    "sent": "What we have added and excuse me a second.",
                    "label": 0
                },
                {
                    "sent": "So what we have added we have added so next to the domain ontology like that could be the NCI tease or as we have added a knowledge base of changes and annotations which stores as instances the annotations that are attached to the ontology components that you have seen.",
                    "label": 0
                },
                {
                    "sent": "So two classes.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to go into details, little bit.",
                    "label": 0
                },
                {
                    "sent": "Or maybe I can talk here a bit about it.",
                    "label": 0
                },
                {
                    "sent": "So for example, if when a user creates a class in the client, what is what is happening is that.",
                    "label": 0
                },
                {
                    "sent": "That change will go in the domain ontology.",
                    "label": 0
                },
                {
                    "sent": "Meanwhile, change tracking component will also add an instance of a change to the changes.",
                    "label": 0
                },
                {
                    "sent": "An annotation knowledge base.",
                    "label": 0
                },
                {
                    "sent": "So each change is also an instance in this change is an annotation ontology.",
                    "label": 0
                },
                {
                    "sent": "This means that user can also comment on changes because they are also there are ified objects, so you can address that.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Change.",
                    "label": 0
                },
                {
                    "sent": "Actually, the whole collaborative support is guided by some set of ontologies we have developed.",
                    "label": 0
                },
                {
                    "sent": "We have another set on very little ontology of ontology components and axioms that just said that in an ontology you have ontology classes, properties, individuals.",
                    "label": 1
                },
                {
                    "sent": "It's kind of very lightweight, metamodel over language.",
                    "label": 0
                },
                {
                    "sent": "Then we have an ontology for discussions and proposals which defines the annotation types.",
                    "label": 0
                },
                {
                    "sent": "For example, we have extended the annotation annotation types with comment.",
                    "label": 0
                },
                {
                    "sent": "See also example proposal and so on.",
                    "label": 0
                },
                {
                    "sent": "We have an ontology about representing changes in which you have classes like create class, created, domain change and all these things and we also have an ontology for representing workflows, collaborative workflows, and another small ontology for representing roles, users and policies.",
                    "label": 0
                },
                {
                    "sent": "So actually it's.",
                    "label": 0
                },
                {
                    "sent": "This allows us to change pretty.",
                    "label": 0
                },
                {
                    "sent": "It's very flexible architecture that allows you to configure the environment in many ways.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just to give you a quick overview how the changes at annotation Ontology looks like.",
                    "label": 1
                },
                {
                    "sent": "So what you see on the right hand side is the annotation annotation class which has certain properties like the title, author, created, modified and so on and the subclasses proposal, explanation, advice and so on.",
                    "label": 0
                },
                {
                    "sent": "This so we define probably less than 10 annotation types.",
                    "label": 0
                },
                {
                    "sent": "What we have seen our experiments people use only common because there's the default.",
                    "label": 0
                },
                {
                    "sent": "Foundation type that comes up in the UI so we will see how useful this differentiation is or not, but actually it is important that people can add their own annotation types.",
                    "label": 0
                },
                {
                    "sent": "So if a project has a certain structure for annotations, you just add a subclass and tool picks up that automatically.",
                    "label": 0
                },
                {
                    "sent": "And then the the changes representation.",
                    "label": 0
                },
                {
                    "sent": "You can see we have class changes, property changes and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "It's just a little.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Heart showed here.",
                    "label": 0
                },
                {
                    "sent": "So what is the collaboration framework?",
                    "label": 0
                },
                {
                    "sent": "This is actually you can think a bit of it, like on the server side.",
                    "label": 0
                },
                {
                    "sent": "So we have this ontologies on that which I talked about before that guide.",
                    "label": 0
                },
                {
                    "sent": "The entire collaboration support.",
                    "label": 0
                },
                {
                    "sent": "Then we have an API access layer that gives access to the changes, annotations, work flows and so on.",
                    "label": 0
                },
                {
                    "sent": "We have generated this API's from the ontologies which was also very nice feature and dangerous if you change the ontologies your.",
                    "label": 0
                },
                {
                    "sent": "Your software and compiled after that your code once compared to that and there are also ontology repositories and we use the API to access this ontologies.",
                    "label": 0
                },
                {
                    "sent": "We also have, so this collaborative framework is shown here on the back.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Side and we have two clients that currently work with this collaboration framework.",
                    "label": 0
                },
                {
                    "sent": "We have the collaborative protege have shown before the user interface and we also have a web client of Protege that accesses the same collaboration framework and there you should see that they are synchronized, meaning that you can edit the same ontology either in the in the rich client or in the web client and the changes are seen immediately.",
                    "label": 0
                },
                {
                    "sent": "So if some users just.",
                    "label": 0
                },
                {
                    "sent": "Want to browse and create some classes?",
                    "label": 0
                },
                {
                    "sent": "Do some lightweight editing.",
                    "label": 0
                },
                {
                    "sent": "They do it in the web version of Protege an for more complicated editing they can use the rich client, but the changes are seen immediately.",
                    "label": 1
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A little bit about the annotations and discussion thread.",
                    "label": 1
                },
                {
                    "sent": "So as I have mentioned before, annotations are linked to ontology components, and ontology component can be a class or property and individual, and we do have these different types of annotations which can be extended and actually in our evaluation we needed this and was a very important feature, and users may undertake classes, properties, individuals or the ontology as a whole.",
                    "label": 1
                },
                {
                    "sent": "And we also have support for filtering and searching based on different criteria.",
                    "label": 0
                },
                {
                    "sent": "Here what you see here on the right hand side the screenshot.",
                    "label": 0
                },
                {
                    "sent": "This is an example of a discussion thread that was done in our evaluation of the tool in the development of the National Cancer Institute Thesaurus.",
                    "label": 0
                },
                {
                    "sent": "So you see that most of them are just comments.",
                    "label": 0
                },
                {
                    "sent": "They'll see.",
                    "label": 0
                },
                {
                    "sent": "There's also a little e.g that stands, for example, and so on.",
                    "label": 0
                },
                {
                    "sent": "Then there is another tab, so so far I've been looking at the annotation that a discussion thread step the changes to.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Allows you to see the change history of a certain concept so you see there probably that there's an annotation added.",
                    "label": 1
                },
                {
                    "sent": "The class was saved.",
                    "label": 0
                },
                {
                    "sent": "This is also from the environment that NCI is using, and as you can see there's a like a little comment attached to the last change of attached to the class.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We also have a chat tab that is integrated in the framework where people can exchange life messages and they also can send internal links in the ontology.",
                    "label": 0
                },
                {
                    "sent": "So when users speak about a certain class they can just insert a link to that internal class and the other user can just click on that and he would go directly to the definition of that class and this distinguishes this chat client from other.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Other chat clients.",
                    "label": 0
                },
                {
                    "sent": "I'm going to talk very, very briefly about Web protege, which is a web client for Protege and for collaborative project.",
                    "label": 0
                },
                {
                    "sent": "It is mainly intended for browsing ontologies on the web and for doing lightweight ontology editing.",
                    "label": 0
                },
                {
                    "sent": "We have just released the first Alpha version.",
                    "label": 0
                },
                {
                    "sent": "And it is used.",
                    "label": 0
                },
                {
                    "sent": "It is designed using a portal metaphor.",
                    "label": 0
                },
                {
                    "sent": "The user interface is composed of little reusable components called portlets that people that users can arrange on the user interface and it is extensible.",
                    "label": 0
                },
                {
                    "sent": "We try to also use a kind of a plug-in infrastructure so that projects can build their own.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Widgets, so this is how it looks.",
                    "label": 0
                },
                {
                    "sent": "This is the entities or as it's right now it looks very much like the rich client with the difference that here you can actually drag drag and drop things on the screen and rearrange and resize and this inner browser.",
                    "label": 0
                },
                {
                    "sent": "We have used the Google Web Toolkit to develop the web client and which is very efficient tool.",
                    "label": 0
                },
                {
                    "sent": "You develop the code in Java and then is compiled in very optimized and optimized.",
                    "label": 0
                },
                {
                    "sent": "JavaScript by the GWT compile.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We performed evaluation in the Athena DSS project.",
                    "label": 1
                },
                {
                    "sent": "It's a clinical decision support system that generates guidelines recommendations.",
                    "label": 1
                },
                {
                    "sent": "We had three editors evaluate that tool for one month without prior training.",
                    "label": 0
                },
                {
                    "sent": "We did point them to the.",
                    "label": 0
                },
                {
                    "sent": "Users guide, but I'm pretty sure they didn't look at it.",
                    "label": 0
                },
                {
                    "sent": "No, the way that they use the tool that we had to clinicians and one ontology expert where helping with with the ontology development.",
                    "label": 0
                },
                {
                    "sent": "What we've seen is that people use mostly comments on instances because they're mainly focusing on instances rather than classes.",
                    "label": 0
                },
                {
                    "sent": "And they use discussions, for example, to ask questions to the clinicians were asking questions.",
                    "label": 0
                },
                {
                    "sent": "The ontology expert.",
                    "label": 0
                },
                {
                    "sent": "How should I model this thing?",
                    "label": 0
                },
                {
                    "sent": "What's the best way to model?",
                    "label": 0
                },
                {
                    "sent": "We have also seen that people don't like to add annotations to change is probably there too abstract in a way they like to add comments to the classes or instances.",
                    "label": 0
                },
                {
                    "sent": "So they did that.",
                    "label": 0
                },
                {
                    "sent": "They used it.",
                    "label": 0
                },
                {
                    "sent": "They used annotations to document the narrative description of a guide.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And a set of quality parameters.",
                    "label": 1
                },
                {
                    "sent": "What we had to do.",
                    "label": 0
                },
                {
                    "sent": "They said, OK, I want to attach an annotation to this specific guideline, but it has to be attached not to this just this guideline instance, but it should be attached also to all other related instances.",
                    "label": 1
                },
                {
                    "sent": "So we had to develop a specific annotation type.",
                    "label": 0
                },
                {
                    "sent": "The guideline comment and have their own structure and forms.",
                    "label": 0
                },
                {
                    "sent": "And it was very nice to see that we were able to do this other uses.",
                    "label": 0
                },
                {
                    "sent": "Of the annotations.",
                    "label": 1
                },
                {
                    "sent": "Where to record the design rationale or explain modeling approaches or this is this didn't happen yet, but they suggested that a good way of educating you.",
                    "label": 0
                },
                {
                    "sent": "Users who had to develop this ontology some.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Future directions.",
                    "label": 0
                },
                {
                    "sent": "We do want to include a more flexible workflow support in our collaboration framework.",
                    "label": 1
                },
                {
                    "sent": "We do have a proof of concept implementation, but we still have a lot to be done.",
                    "label": 1
                },
                {
                    "sent": "In this implementation, we have off the shelf workflow engine integrated in the collaboration framework and you can define your workflow.",
                    "label": 0
                },
                {
                    "sent": "Your collaboration workflow in terms of instances of and work on teologi.",
                    "label": 1
                },
                {
                    "sent": "Then we would also like to support synchronous and asynchronous editing modes.",
                    "label": 0
                },
                {
                    "sent": "Right now all the changes are seen immediately by all the users, but some people prefer the SVN type access where people check out a part of ontology check back in.",
                    "label": 0
                },
                {
                    "sent": "We do want to make more usability studies and improvements.",
                    "label": 0
                },
                {
                    "sent": "And we got some good ideas from from other evaluations that we have already done, like to integrate this with an issue tracker, or to have RSS feeds of changes have a calendar for scheduling appointments.",
                    "label": 0
                },
                {
                    "sent": "This was used in another evaluation that we did with the NCI tesouros where people were actually using the this annotation say oh we should discuss this at the next meeting.",
                    "label": 0
                },
                {
                    "sent": "Things like that and very soon we would like to pour this collaborative framework to work with Project 4.",
                    "label": 0
                },
                {
                    "sent": "And please come see, the demo will have a post render demo later today.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Quick.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Question, yeah.",
                    "label": 0
                },
                {
                    "sent": "So in databases we have transactions when people need to anything editing the same thing, you can roll back.",
                    "label": 0
                },
                {
                    "sent": "What is this a possibility or options in ontology development when you have some people saying the same thing you're saying if you have SVN and then if somebody raises a class and somebody adds it, how is that synchronization going to be right?",
                    "label": 0
                },
                {
                    "sent": "So we already have this transaction support in the prodigious 3 back end it is using the database, so the ontologies are stored in a database and it is using the transaction.",
                    "label": 0
                },
                {
                    "sent": "Part of the databases and all the operations are also happening in a in series on the server side, so if there if there are no way there, it's not easy to create data corruption, but what might happen is that the second user who did a change I didn't get in time the update of the first user, his change will fail, but in our in our experience so far we didn't have such cases, so they're not dead.",
                    "label": 0
                },
                {
                    "sent": "Close, click away or milliseconds away.",
                    "label": 0
                },
                {
                    "sent": "The changes that we had such problems.",
                    "label": 0
                },
                {
                    "sent": "But yes, we are aware that this might be an issue.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "We have used.",
                    "label": 0
                },
                {
                    "sent": "Right now you can start in different relational databases.",
                    "label": 0
                },
                {
                    "sent": "We have our own database schema that we are using.",
                    "label": 0
                },
                {
                    "sent": "And so far we have been testing with my SQL Postgres SQL Server, Oracle I think.",
                    "label": 0
                },
                {
                    "sent": "But mostly my SQL with we test mostly with my SQL.",
                    "label": 0
                },
                {
                    "sent": "I've seen that you have the possibility to comment on auto logical entities that concept and so did.",
                    "label": 0
                },
                {
                    "sent": "You also consider about discussing on axioms.",
                    "label": 0
                },
                {
                    "sent": "Actually, because things like this A&B are disjoined and so on.",
                    "label": 0
                },
                {
                    "sent": "So how do you think that it's using the case here?",
                    "label": 0
                },
                {
                    "sent": "Yes, that's a very good point.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "So right now this is important for three, which is a very entity based system because it is built on top of a frame system.",
                    "label": 0
                },
                {
                    "sent": "So as we go to Project 4 and the our API there, everything is an axiom, so we will have a meta model representation of these axioms and then yes you will be able to comment on the axioms themselves, right?",
                    "label": 0
                },
                {
                    "sent": "We don't have that yet, so right now it's not that granular level.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Hi there, I'm I'm curious about this study that you did with those three individuals.",
                    "label": 0
                },
                {
                    "sent": "Leaving aside the ontology engineer these two clinicians, how much did they understand about what an ontology was, what it was for, and why did they want to make 1?",
                    "label": 0
                },
                {
                    "sent": "Maybe you should have them.",
                    "label": 0
                },
                {
                    "sent": "Serious question, but I actually mean it seriously.",
                    "label": 0
                },
                {
                    "sent": "What was their motivation for creating this ontology and did they understand why they ought to do it or what they would get out of it, right?",
                    "label": 0
                },
                {
                    "sent": "So I don't know all the details of this project, but I know that they have been using ontologies for I think 20 years or so.",
                    "label": 0
                },
                {
                    "sent": "Maybe Mark can correct me if I'm wrong 10 years.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry.",
                    "label": 0
                },
                {
                    "sent": "Yes, so I think they knew what they were doing.",
                    "label": 0
                },
                {
                    "sent": "And yes.",
                    "label": 0
                },
                {
                    "sent": "Not really, so I think there are more, so I think the way that it happened was that the class level was developed by the ontology expert at some point and then actually the the clinician just filled in instances and values and if something they couldn't do then they said oh can you please add this or do this for us somehow?",
                    "label": 0
                },
                {
                    "sent": "Yes, I can elaborate.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "The clinicians involved are concerned with the development of decision support systems that assist other doctors in the care of patients, and they view the knowledge base of these guidelines that define best practices as sort of their stock in trade in terms of how to make sure that patients are treated and they view these knowledge bases conceptually as a machine encoding of their guidelines, and so they have a good understanding of the instance data, mainly how a particular guideline is represented, they have less understanding of the classes in the ontology which are more generic.",
                    "label": 0
                },
                {
                    "sent": "But they do understand when they can't encode the instances that they need for a particular kind of guideline, there's a breakdown and then they can identify a potential problem in the overall guidelines.",
                    "label": 0
                },
                {
                    "sent": "So there are obviously not doctors taken off the street, but they are at the same time not what you would consider trained ontologic engineers.",
                    "label": 0
                },
                {
                    "sent": "Somebody over there.",
                    "label": 0
                },
                {
                    "sent": "In the process of editing the ontology and collaborating editing dollars, does this process also highlight some problems in the.",
                    "label": 0
                },
                {
                    "sent": "In the knowledge that they want to specify, I mean so that the revise not only the ontology, but they the previous knowledge that they want to.",
                    "label": 0
                },
                {
                    "sent": "In code, so like the guidelines for something like this.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "I don't know that whether they were able to find problems in their own guidelines or not.",
                    "label": 0
                },
                {
                    "sent": "I cannot answer that.",
                    "label": 0
                },
                {
                    "sent": "Sorry, yes.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Not really, no.",
                    "label": 0
                },
                {
                    "sent": "Because we have this high level so we have this.",
                    "label": 0
                },
                {
                    "sent": "The annotations are actually attached to something called an annotatable thing, and then whatever the language metamodel will be subclasses of that annotatable thing, so it should be pretty flexible if things will.",
                    "label": 0
                },
                {
                    "sent": "Be added or delete or whatever changed, which it shouldn't require.",
                    "label": 0
                },
                {
                    "sent": "Code changes.",
                    "label": 0
                },
                {
                    "sent": "But we will have to build or not to build or to reuse an owl two metamodel.",
                    "label": 0
                },
                {
                    "sent": "Yes, we don't have that yet.",
                    "label": 0
                },
                {
                    "sent": "OK, one final question for ya.",
                    "label": 0
                },
                {
                    "sent": "You sense a lot.",
                    "label": 0
                },
                {
                    "sent": "So you can do some of that based on what users providing same time, right?",
                    "label": 0
                },
                {
                    "sent": "Using log file, right?",
                    "label": 0
                },
                {
                    "sent": "So how do you?",
                    "label": 0
                },
                {
                    "sent": "How do you combine?",
                    "label": 0
                },
                {
                    "sent": "So what is the question?",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "You combine this.",
                    "label": 0
                },
                {
                    "sent": "So right now what?",
                    "label": 0
                },
                {
                    "sent": "So right now we have a change tracking component that is kind of structured log of all the changes and we do plan to analyze those changes, for example to identify higher level operations that the users understand.",
                    "label": 0
                },
                {
                    "sent": "Like for example, a refactor is made up of maybe 10 changes, but you don't really see that in the log because they're just changes individual changes.",
                    "label": 0
                },
                {
                    "sent": "So we are able to analyze.",
                    "label": 0
                },
                {
                    "sent": "And we have some tools actually that were developed for the NCI to look at all the changes and say accept reject changes.",
                    "label": 0
                },
                {
                    "sent": "So there are ways of analyzing that, but I don't know how we're going to use that for generating views.",
                    "label": 0
                },
                {
                    "sent": "That's something we have to think about.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}