{
    "id": "6vhckjrtq7d6rvvpchczpojnd57t6ira",
    "title": "Proxima Utopia",
    "info": {
        "author": [
            "Mika Savela, Selim Projects"
        ],
        "published": "March 3, 2017",
        "recorded": "February 2017",
        "category": [
            "Top->Architecture",
            "Top->Arts->Visual Arts->Design"
        ]
    },
    "url": "http://videolectures.net/matchmaking2017_savela_proxima_utopia/",
    "segmentation": [
        [
            "OK hello everyone, greetings from Helsinki and thanks to to the Museum of Architecture and Design for inviting us here.",
            "I'm Mika Savela and my.",
            "Partner in Salim is Hendrick, who is also present here, but I will do that.",
            "I will do the talking so.",
            "About the future of architecture, somehow the Utopia topic feels like a bit naive.",
            "Waited to come back to it, but we thought about it in a particular setting, so I'm just going to go into this simple questions that we proposed.",
            "Um?"
        ],
        [
            "What is the future state of utopias in a way this was also referenced by level checked this morning?",
            "That what is the hope than you hope that that we're kind of craving for as a kind of a liberal left, for instance, what are they saying?",
            "Or what are they giving?",
            "And the second question is that do these utopias?",
            "That might be the future utopias, reflect the current or the past state of the world?",
            "Which in a way is an interesting question."
        ],
        [
            "If we think about the past utopias and the sort of embodied ideologies that are involved in this modernist ways of housing, or or providing for people like really saying how they we should all live our lives.",
            "This is 1 from 1959 for instance.",
            "In a way, we're kind of fascinated by these types of images, but at the same time.",
            "There is a question that who to whom did these utopias were designed to?",
            "Who is left out of them?",
            "Did it become like exactly like this?",
            "Or is this still guiding our designs?",
            "Or are planning in this some projects?",
            "Presented here today.",
            "We could see that, for instance, on the suburbian settings, things really didn't go as planned as we learned."
        ],
        [
            "And then, as we've heard so many times already, that how the world is changing, and somehow I would like to quote kind of Marshall Berman.",
            "Stating that modernity as adaptation to change, so in a way how the world is changing, should define our visions for the future.",
            "And just saying Hello World is a kind of a way to.",
            "Embrace that development, but then also to ask whether those future is bleak or bright and to whom it is designed for, and perhaps some of the.",
            "Forces that are in taking place are not anymore up to us to decide whether the future will be this or future will be that it is.",
            "Up to us to sort of like adapt to that and produce new modern maternities.",
            "I."
        ],
        [
            "I also like to kind of go back to.",
            "Pair of words by Jack this morning that that these kind of future is whether they're future of positive or bleak.",
            "Are kind of like equally hopeful, which is a weird quality of utopias that here is a afrofuturism that it was being kind of like brought to our consciousness by the Black Lives Matter movement.",
            "And then North Korean propaganda artists kind of like propagating how China is developing.",
            "As an example of how weirdly similar utopias."
        ],
        [
            "Look like.",
            "And we asked like how can we address this particular topic?",
            "And one thing that kind of was an interesting medium to somehow look at the state of the world.",
            "Was this old style of Maps like medieval European mapping or cartography, like in these into these mappemonde ease with which were kind of like telling us everything that we know of the world like where everything is and they have everything displayed an everything represented.",
            "In in the detail that was possible.",
            "And wherever they didn't know what was there, then they just left it out or were depicted."
        ],
        [
            "Something else.",
            "And another sort of more evolved format became the Atlas or the descriptive way of describing the world, and in a way.",
            "Almost like like a kind of a project for the Enlightenment an.",
            "For modernity, that that when you learn about the world from this book where it is described then you really learn everything that is almost like a virtuous past time that that we will know everything about the world."
        ],
        [
            "Of course, there have been past.",
            "Atlas is also as as a more artistic representations and practices such as Aby Warburg's name assign Atlas or Gathright's Atlas Project.",
            "But they also look at the past.",
            "They sort of like tried to reiterate and reorganize the past in a different way, that then we're used to seeing the world.",
            "So in a way they also suggest the question of what what is where is the Atlas for the future?",
            "Or is this even possible?",
            "And if we look at Maps or culture?"
        ],
        [
            "Graffiti or Atlas?",
            "Is it also sort of like there's a history there, or kind of a tendency to rationalize to turn everything into pictures to measurements to code it symbols instead of future rising?",
            "Even though we have kind of the technology to futurize see."
        ],
        [
            "So then our project in away builds from these ideas.",
            "That what if there is a Atlas of the future?",
            "And what if there is a map on Monday?",
            "That kind of describes a future that that could happen or or has components in it that that adapt to the world in a different way than that are modern?",
            "History suggests."
        ],
        [
            "So we created for instance these some of the I'm just going to show you briefly like some of the cases or small things that we've picked up as topics which there can be many other ones just to kind of a take on.",
            "Trying to offer some psychadelia into the Mapa Mundi format."
        ],
        [
            "One of them is related to basically just that.",
            "About basic directions.",
            "When we think about Maps and how they sort of how we read the world and how we see the world usually represented.",
            "Of course in world Maps and in all kinds of places, they suggest already many things like what is North or the South, what is East of here or West of here and what is expected in these locations.",
            "And we're kind of thinking that.",
            "Perhaps the future is really somewhere totally elsewhere, maybe.",
            "Projects that we don't expect to be happen in the so called South, for instance, or will have a huge significance."
        ],
        [
            "Another take on the map for Monday.",
            "Rhetorik is these here be Dragons here relyance that was often written in the edges of the known world.",
            "And the idea that we are they were they were sea monsters, potentially lurking in the edges of the world.",
            "Whereas now we're kind of facing the ecological.",
            "Changes where the sea turns into a monster and somehow the edges between periphery's and centralities are sort of equalized in that ASP."
        ],
        [
            "Act another scenario.",
            "We're kind of basically coming up with snappy names is that.",
            "That perhaps are sort of like keen interest on the eco cities or the technical technological clusters, or or Apple's new campuses or something in a way is also a very particular kind of a look on the future, and we're not really know yet that whether they will be with the Silicone Valley will be turned into a silicone Valley in the end."
        ],
        [
            "In the era of Trumpism, of course, or if that is a word, there are already many dreams and many utopias that point to all kinds of sort of like almost like negative.",
            "Outcomes of societies that are taking place and we're finding weird allies who are kind of into building monuments into surveillance into.",
            "Into showing power into showing.",
            "Control over others with still titling that as family values, for instance."
        ],
        [
            "In a kind of a throwback to one of the earlier presentations is that these kind of pass modernities, such as protego or.",
            "It's distraction.",
            "In a way is repeating itself.",
            "We think about urban China and the new new projects that have been taking place.",
            "There.",
            "They are to be coming in the future equally.",
            "In the under plates, in a way like we're we're handling them in a similar way that we're making a project about.",
            "Why did Pruitt Igoe fail today?",
            "Urban China still seems the somewhat futuristic's futuristic with but in a way it has the also the tendency that.",
            "Given enough time, we will kind of objectify or make it into an object of study as well.",
            "So these were just kind of like."
        ],
        [
            "Topics that come from the athletes that we're currently building up and in what formats could this be displayed?",
            "Well, we're potentially looking into a producing as some kind of a printed object, such as an actual Atlas or or kind of at least a large.",
            "Set of prints are.",
            "Maybe even producing the protego demolition demolition person wear or urban China collection.",
            "Looking at past Utopia documents, perhaps all kinds of ephemera that might come from from measuring the world or building up potentially.",
            "Small models, so it's a bit like up for grabs."
        ],
        [
            "So thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK hello everyone, greetings from Helsinki and thanks to to the Museum of Architecture and Design for inviting us here.",
                    "label": 0
                },
                {
                    "sent": "I'm Mika Savela and my.",
                    "label": 0
                },
                {
                    "sent": "Partner in Salim is Hendrick, who is also present here, but I will do that.",
                    "label": 0
                },
                {
                    "sent": "I will do the talking so.",
                    "label": 0
                },
                {
                    "sent": "About the future of architecture, somehow the Utopia topic feels like a bit naive.",
                    "label": 0
                },
                {
                    "sent": "Waited to come back to it, but we thought about it in a particular setting, so I'm just going to go into this simple questions that we proposed.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What is the future state of utopias in a way this was also referenced by level checked this morning?",
                    "label": 0
                },
                {
                    "sent": "That what is the hope than you hope that that we're kind of craving for as a kind of a liberal left, for instance, what are they saying?",
                    "label": 0
                },
                {
                    "sent": "Or what are they giving?",
                    "label": 0
                },
                {
                    "sent": "And the second question is that do these utopias?",
                    "label": 0
                },
                {
                    "sent": "That might be the future utopias, reflect the current or the past state of the world?",
                    "label": 0
                },
                {
                    "sent": "Which in a way is an interesting question.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If we think about the past utopias and the sort of embodied ideologies that are involved in this modernist ways of housing, or or providing for people like really saying how they we should all live our lives.",
                    "label": 0
                },
                {
                    "sent": "This is 1 from 1959 for instance.",
                    "label": 0
                },
                {
                    "sent": "In a way, we're kind of fascinated by these types of images, but at the same time.",
                    "label": 0
                },
                {
                    "sent": "There is a question that who to whom did these utopias were designed to?",
                    "label": 0
                },
                {
                    "sent": "Who is left out of them?",
                    "label": 0
                },
                {
                    "sent": "Did it become like exactly like this?",
                    "label": 0
                },
                {
                    "sent": "Or is this still guiding our designs?",
                    "label": 0
                },
                {
                    "sent": "Or are planning in this some projects?",
                    "label": 0
                },
                {
                    "sent": "Presented here today.",
                    "label": 0
                },
                {
                    "sent": "We could see that, for instance, on the suburbian settings, things really didn't go as planned as we learned.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then, as we've heard so many times already, that how the world is changing, and somehow I would like to quote kind of Marshall Berman.",
                    "label": 0
                },
                {
                    "sent": "Stating that modernity as adaptation to change, so in a way how the world is changing, should define our visions for the future.",
                    "label": 0
                },
                {
                    "sent": "And just saying Hello World is a kind of a way to.",
                    "label": 0
                },
                {
                    "sent": "Embrace that development, but then also to ask whether those future is bleak or bright and to whom it is designed for, and perhaps some of the.",
                    "label": 0
                },
                {
                    "sent": "Forces that are in taking place are not anymore up to us to decide whether the future will be this or future will be that it is.",
                    "label": 0
                },
                {
                    "sent": "Up to us to sort of like adapt to that and produce new modern maternities.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I also like to kind of go back to.",
                    "label": 0
                },
                {
                    "sent": "Pair of words by Jack this morning that that these kind of future is whether they're future of positive or bleak.",
                    "label": 0
                },
                {
                    "sent": "Are kind of like equally hopeful, which is a weird quality of utopias that here is a afrofuturism that it was being kind of like brought to our consciousness by the Black Lives Matter movement.",
                    "label": 0
                },
                {
                    "sent": "And then North Korean propaganda artists kind of like propagating how China is developing.",
                    "label": 0
                },
                {
                    "sent": "As an example of how weirdly similar utopias.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Look like.",
                    "label": 0
                },
                {
                    "sent": "And we asked like how can we address this particular topic?",
                    "label": 0
                },
                {
                    "sent": "And one thing that kind of was an interesting medium to somehow look at the state of the world.",
                    "label": 0
                },
                {
                    "sent": "Was this old style of Maps like medieval European mapping or cartography, like in these into these mappemonde ease with which were kind of like telling us everything that we know of the world like where everything is and they have everything displayed an everything represented.",
                    "label": 0
                },
                {
                    "sent": "In in the detail that was possible.",
                    "label": 0
                },
                {
                    "sent": "And wherever they didn't know what was there, then they just left it out or were depicted.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Something else.",
                    "label": 0
                },
                {
                    "sent": "And another sort of more evolved format became the Atlas or the descriptive way of describing the world, and in a way.",
                    "label": 0
                },
                {
                    "sent": "Almost like like a kind of a project for the Enlightenment an.",
                    "label": 0
                },
                {
                    "sent": "For modernity, that that when you learn about the world from this book where it is described then you really learn everything that is almost like a virtuous past time that that we will know everything about the world.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of course, there have been past.",
                    "label": 0
                },
                {
                    "sent": "Atlas is also as as a more artistic representations and practices such as Aby Warburg's name assign Atlas or Gathright's Atlas Project.",
                    "label": 0
                },
                {
                    "sent": "But they also look at the past.",
                    "label": 0
                },
                {
                    "sent": "They sort of like tried to reiterate and reorganize the past in a different way, that then we're used to seeing the world.",
                    "label": 0
                },
                {
                    "sent": "So in a way they also suggest the question of what what is where is the Atlas for the future?",
                    "label": 1
                },
                {
                    "sent": "Or is this even possible?",
                    "label": 0
                },
                {
                    "sent": "And if we look at Maps or culture?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Graffiti or Atlas?",
                    "label": 0
                },
                {
                    "sent": "Is it also sort of like there's a history there, or kind of a tendency to rationalize to turn everything into pictures to measurements to code it symbols instead of future rising?",
                    "label": 0
                },
                {
                    "sent": "Even though we have kind of the technology to futurize see.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So then our project in away builds from these ideas.",
                    "label": 0
                },
                {
                    "sent": "That what if there is a Atlas of the future?",
                    "label": 0
                },
                {
                    "sent": "And what if there is a map on Monday?",
                    "label": 0
                },
                {
                    "sent": "That kind of describes a future that that could happen or or has components in it that that adapt to the world in a different way than that are modern?",
                    "label": 0
                },
                {
                    "sent": "History suggests.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we created for instance these some of the I'm just going to show you briefly like some of the cases or small things that we've picked up as topics which there can be many other ones just to kind of a take on.",
                    "label": 0
                },
                {
                    "sent": "Trying to offer some psychadelia into the Mapa Mundi format.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One of them is related to basically just that.",
                    "label": 0
                },
                {
                    "sent": "About basic directions.",
                    "label": 0
                },
                {
                    "sent": "When we think about Maps and how they sort of how we read the world and how we see the world usually represented.",
                    "label": 0
                },
                {
                    "sent": "Of course in world Maps and in all kinds of places, they suggest already many things like what is North or the South, what is East of here or West of here and what is expected in these locations.",
                    "label": 0
                },
                {
                    "sent": "And we're kind of thinking that.",
                    "label": 0
                },
                {
                    "sent": "Perhaps the future is really somewhere totally elsewhere, maybe.",
                    "label": 0
                },
                {
                    "sent": "Projects that we don't expect to be happen in the so called South, for instance, or will have a huge significance.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another take on the map for Monday.",
                    "label": 0
                },
                {
                    "sent": "Rhetorik is these here be Dragons here relyance that was often written in the edges of the known world.",
                    "label": 0
                },
                {
                    "sent": "And the idea that we are they were they were sea monsters, potentially lurking in the edges of the world.",
                    "label": 0
                },
                {
                    "sent": "Whereas now we're kind of facing the ecological.",
                    "label": 0
                },
                {
                    "sent": "Changes where the sea turns into a monster and somehow the edges between periphery's and centralities are sort of equalized in that ASP.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Act another scenario.",
                    "label": 0
                },
                {
                    "sent": "We're kind of basically coming up with snappy names is that.",
                    "label": 0
                },
                {
                    "sent": "That perhaps are sort of like keen interest on the eco cities or the technical technological clusters, or or Apple's new campuses or something in a way is also a very particular kind of a look on the future, and we're not really know yet that whether they will be with the Silicone Valley will be turned into a silicone Valley in the end.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the era of Trumpism, of course, or if that is a word, there are already many dreams and many utopias that point to all kinds of sort of like almost like negative.",
                    "label": 0
                },
                {
                    "sent": "Outcomes of societies that are taking place and we're finding weird allies who are kind of into building monuments into surveillance into.",
                    "label": 0
                },
                {
                    "sent": "Into showing power into showing.",
                    "label": 0
                },
                {
                    "sent": "Control over others with still titling that as family values, for instance.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In a kind of a throwback to one of the earlier presentations is that these kind of pass modernities, such as protego or.",
                    "label": 0
                },
                {
                    "sent": "It's distraction.",
                    "label": 0
                },
                {
                    "sent": "In a way is repeating itself.",
                    "label": 0
                },
                {
                    "sent": "We think about urban China and the new new projects that have been taking place.",
                    "label": 0
                },
                {
                    "sent": "There.",
                    "label": 0
                },
                {
                    "sent": "They are to be coming in the future equally.",
                    "label": 0
                },
                {
                    "sent": "In the under plates, in a way like we're we're handling them in a similar way that we're making a project about.",
                    "label": 0
                },
                {
                    "sent": "Why did Pruitt Igoe fail today?",
                    "label": 0
                },
                {
                    "sent": "Urban China still seems the somewhat futuristic's futuristic with but in a way it has the also the tendency that.",
                    "label": 0
                },
                {
                    "sent": "Given enough time, we will kind of objectify or make it into an object of study as well.",
                    "label": 0
                },
                {
                    "sent": "So these were just kind of like.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Topics that come from the athletes that we're currently building up and in what formats could this be displayed?",
                    "label": 0
                },
                {
                    "sent": "Well, we're potentially looking into a producing as some kind of a printed object, such as an actual Atlas or or kind of at least a large.",
                    "label": 0
                },
                {
                    "sent": "Set of prints are.",
                    "label": 0
                },
                {
                    "sent": "Maybe even producing the protego demolition demolition person wear or urban China collection.",
                    "label": 0
                },
                {
                    "sent": "Looking at past Utopia documents, perhaps all kinds of ephemera that might come from from measuring the world or building up potentially.",
                    "label": 0
                },
                {
                    "sent": "Small models, so it's a bit like up for grabs.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So thank you.",
                    "label": 0
                }
            ]
        }
    }
}