{
    "id": "6zb5fpfhgfikqir26xzlyg2zptq66fed",
    "title": "Cultural Activities: Which Challenge for Economics?",
    "info": {
        "introducer": [
            "Marco Acri, Univerza v Novi Gorici"
        ],
        "author": [
            "Xavier Greffe, Université Paris 1 Panthéon-Sorbonne"
        ],
        "published": "April 17, 2018",
        "recorded": "April 2018",
        "category": [
            "Top->Social Sciences->Economics",
            "Top->Social Sciences->Culturology"
        ]
    },
    "url": "http://videolectures.net/zv_greffe_cultural_activities/",
    "segmentation": [
        [
            "Good evening everyone.",
            "Distinguished guests, dear colleagues and students.",
            "Welcome to the scientific evening tonight of the University of Nevada.",
            "Written it is my distinct pleasure, an honor to give the warmest welcome to and introduced today's guest speaker, Professor Savvy Graph.",
            "Let me say that our University, and in particular teachers, researchers and students of the doctoral program in heritage studies, at the privilege to work with Professor Graph.",
            "Since the establishment of the Essay Act Program in 2005.",
            "At that time our course was one of the initiators of the studies attempting to merge economics with architecture, engineering, and landscape.",
            "Since then, through many joint teaching research projects and mentorship activities, we have learned and explored many ways on why and how heritage and culture can be crucial.",
            "Factors for social and economic innovation.",
            "It is important to_that professors graphs work.",
            "His trainer and mentor has been critical in shaping the careers of young researchers, including me.",
            "By reconsidering redefining the importance of culture, bring it back to the frontline of territorial development through sustainability.",
            "So let me take this occasion to thank Professor graph for these precious contribution in shaping and innovating our doctoral course.",
            "It is worth summarizing his career that started at University of Paris.",
            "Parilla short bond, where he currently holds the title of Ameritas, Professor of Economics and Manage, is the Doctorate program in Economics of Arts.",
            "He is also associate professor at the Graduate Research Institute for Policy Studies in Tokyo.",
            "Before he held a number of professorships around the world, and in particular at Uccle Los Angeles, Paris has energy, is member of the Scientific Board of the Louvre in Paris.",
            "For many years he worked with the Friends administration when he was director of New Technologies in the Department of National Education, Director of the Academy of Early on Tour, Director of training and apprenticeship in the Department of Labor and Employment, Record Collector of the Academy of Party is published on an enormous number of publications and we I will just mention the most recent one arts and artists from an economic perspective.",
            "French cultural.",
            "Policy.",
            "He still in the same place as creative, as Arthur Mercado Letras elitism limits on send do Patrimonio cultural.",
            "Culture, creativity and city Oikonomia artistic creative.",
            "The artist Enterprise in a digital age and arts erzhan I do not want to take professors podium, so I can't leave item two addresses lectures.",
            "So thank you very much.",
            "Thank you.",
            "OK, good evening, let me first say that I am very happy to be there and thank you for your welcome and your invitation.",
            "And it's a pleasure to work with you since 205 I did not remember which I knew it was a long time ago, but time is very short.",
            "In fact, therefore it was never a pain to do that.",
            "And the guy asked me to speak to you tonight about the relationship between culture and economics.",
            "It's not very easy subject.",
            "I am very conscious of that, therefore I will not try to be too long on to let as much time as possible for the discussion and but it is a very relevant subject to the all over the world.",
            "No, not only in European countries for very specific reasons, but to find those same issues in Azure a lot in China, for example when they said that they want to create 5 serves on the museum is the next 10 years.",
            "Which is a big program.",
            "Naturally, you find that in Oceania because it's a main resource to music, and on the 4th floor of these communities is very well recognized all over the world.",
            "Do you find that in other parts of the world?",
            "Then and therefore.",
            "Not only we see the facts, but we interpret them on here.",
            "Start the discussion, be cause for some people.",
            "On some economies, but not only economy, so politicians too they consider that culture can be a driver for the economic development.",
            "That sense that the development of museums, the developments of movie industry or for you visual of series and so on and so forth, can be a source of growth.",
            "Bringing new jobs on recording our Dragon added value.",
            "To the national product.",
            "But in the other sense, we see many failures on the.",
            "I just want to give you 2 examples of this success on these failures.",
            "When somebody that you know probably or Lucas families director over Star Wars.",
            "So this company to Disney sort this company for four billions of dollars for billions from Lucas only.",
            "So it's not for the.",
            "For the other people it was for one man after 10 years of creating the Siri.",
            "Of Star Wars on the new ones are not done anymore by Lucas is still advisor, but they are done by Disney's probably, you know.",
            "But if I take for example, the case of Europe, we know that we have approximately certified 1000 museum do that are not very precise because it's always very difficult to design exactly what is a museum.",
            "But according to the equal moves well, more or less with the 35,000 museums on almost 200 die every year, the small ones naturally not the biggest one, not the Guggenheim, not the rule.",
            "#1 not the National Gallery, but not only we have two or three 100 that die every year, but we know that you have approximately 20% of these.",
            "That means almost it's almost 7000 that are in the situation of.",
            "But in Asia.",
            "Because there is no more money.",
            "On their clothes, more and more their clothes.",
            "The the month that turned on the summer months and after they are closed all the months and so on.",
            "So fast and naturally.",
            "You can imagine that the sense of a museum.",
            "It means the conservation is no more existing.",
            "Therefore we have this challenge.",
            "And before starting on explaining to do what I am going to try to show to you, I would like to make 2 remarks.",
            "The first one.",
            "Maybe it's semantic remarks.",
            "Culture is it's something very wide culture.",
            "It's the set of values that we have that inspire our behaviors, our actions, and so on and so forth on many things contribute to culture.",
            "The education actually is fundamental.",
            "The heritage, with their attorneys already yards in more or less the region sometimes, but the art on the authors of a very, very specific consumer, all in producing culture becausw it is the activity that is fundamentally organized.",
            "2.",
            "We present on design some values and the values that is that inspired.",
            "In this sense, our way of life.",
            "Therefore I could use the word artistic activities here because I am not going to speak to you about religion tour about education, we can come back if you want and.",
            "In this sort of discussion, but we when we say culture on the IT is a very frequent overlapping.",
            "You know, in the literature, in the scientific literature, to when we say culture, we may need, say arts, art in a wide sense.",
            "It means that by arts I start with naturally do the traditional core of the Arthur Visual Arts, and after you have your life, are the cultural industries.",
            "On today I will come back on that point later on the creative industries.",
            "OK.",
            "There is a second point that I want to stress in order for you to."
        ],
        [
            "The standard difficulty of the problem, it is the different fundamental difference.",
            "Between I take Voluntary Leader world aesthetics on economics, very curious thing that is never quoted.",
            "I have to save you.",
            "You will not find that very frequently.",
            "It is that these two field of scientific fields and fields of research are almost have almost appear in the same period of time.",
            "At the end of the 18th century, many in Europe at that time after it.",
            "But in other countries static existed, but.",
            "Under the classification, if I can think either.",
            "But it is interesting to remember these birth of the two connected field of research.",
            "Why?",
            "Because the principle of aesthetics it was to understand the value of something exceptional.",
            "Something unique.",
            "The famous I don't know what of account for example.",
            "On the principle of economics, it is exactly the opposite.",
            "Is this to merge or hours feelings?",
            "All our values are subjective values in a common denominator.",
            "The moon a more or less.",
            "Therefore, the two field are.",
            "Almost, I don't know if I can see orthogonal.",
            "It means they they they they are not at all.",
            "They detect two very different directions on Tuesday when we are looking very precisely at the recommendations, for example, or to manage a museum or to benefit from a festival, or to create a cultural product like wine for example.",
            "Or something else.",
            "Here we have this tension.",
            "Between the exceptional from one side.",
            "Which is very well represented by the theory of yesterday's and the common judgment from the other side, which is very well represented by the fact that on the market I don't want to know your feelings, I just want to know what you are going to pay for that.",
            "On you you don't want baby to know the feeling of the produce, so this is a little different but you know you want to know what is a scheme for you in terms of money.",
            "Therefore this is very important to understand that there will be always between the Economist and the people of the words.",
            "I said the words of Ontario arts.",
            "I don't have no position but.",
            "Difficulty, difficulty because they have not at all.",
            "They don't start with the same references, but after that you need to live together and This is why Windows story starts.",
            "OK, I."
        ],
        [
            "Would like to.",
            "If you do three steps of this presentation, you know in the first time I would like to explain to you.",
            "It's a little kind of Genesis of history, but it is a very important why in Europe.",
            "We've started with the ID that cultural activities or artistic artistic activities matter for economic growth and development on why today.",
            "We have arrived at the conclusion according to which we should.",
            "We should be investing culture to make development more sustainable.",
            "This is the right on after I will come under two other steps.",
            "The second step would be to explain to you what we see at the world level.",
            "The difference between the global cultural flows on the local culture, hard flows on the 3rd and final step will be to know are we connected.",
            "This flows through what we could do.",
            "Very famous expression to the in our field of research.",
            "The creative placemaking.",
            "Of the creative economy making on the journey to win the whole of the local governments.",
            "OK, let's start first with the very important."
        ],
        [
            "The evolution of the debate.",
            "Let me tell you first, but I don't want to stay too long on that because I have no time and it will be too much academic.",
            "That The Economist never spoke about culture until these recent years when Jesus entered this recent 50 years.",
            "OK.",
            "There was some study on the whole of economics and culture on the link between culture and economy, but it was mainly done by sociologist on the best example was naturally Max Weber because makes lability decembrie feminist analysis not only on the Protestant easement, many religions he did this study to show all the origin which is South of culture can have an effect on the.",
            "Economic development, but the economy did not speak even even our father.",
            "If I can speak like that.",
            "Adam Smith, because it is considered as the father of The Economist.",
            "He spoke a little about culture, only said something very, very interesting that is forgotten.",
            "Know he was asking why do the artist?",
            "Try to be artist when they know that probably they will not sell their pieces of arts or they will not sell well.",
            "There pieces of art on he said it is becausw the arts.",
            "It's not like a market.",
            "It is like a lottery.",
            "It means that you like to get to play in the sense.",
            "Or maybe you like what you do enough to take the risk of not selling it, and he said something very interesting because it explains a lot of things today in Europe after he says.",
            "They do when you when you make a lottery.",
            "If you want to win, you don't take only one ticket, you try to make a lot of tickets.",
            "On the two value lot of tickets with me and then he said then the artist will try to make a lot of pieces of art, even if they don't sell them and use that.",
            "That interpretation to explain why many artists could not survive it was at that time and this analysis stage.",
            "Little, but it was exceptions.",
            "What the pins?",
            "What was important it was.",
            "In the second part of the 20th century.",
            "Why?",
            "Because many traditional industries disappeared and to understand better, discussed you have this all over Europe, but probably the best example is the United Kingdom.",
            "Many traditional industries disappear, shipyards, steel industry, coal mining, so on and so forth.",
            "And then many city where the despaired.",
            "Remember that for example, Manchester, that is known today as a very important city on very brilliant city in Europe.",
            "As the rate of employment of almost 30% at that time.",
            "On at that time there was a movement not only in India in the UK, but but mainly in UK to consider that if some traditional industries disappear.",
            "We have to try something else.",
            "We've tried to valorize.",
            "To create the market starting from some resources that you have on what are the resources that everybody is?",
            "It is the eritage.",
            "I can see the artistic creation, but at that time it was more irritating.",
            "And if they come back on the example of Manchester for example, the first investment that the City of Manchester did because they had no any opportunity of investment, they had some money, but there was no project they were new in the product, it was to rehabilitate the old railway station.",
            "It was the first investment of the new Age of Manchester.",
            "And at that time many people started to think that.",
            "You have always won results.",
            "What they will do territory, whatever the city, whatever the rural space it is, is cultural heritage.",
            "It can be an material, tangible heritage.",
            "Monuments.",
            "Runescape but landscape is very difficult because on Skype if you want to change your landscape it takes a lot of time and therefore it escapes a little too.",
            "The prospects of the traditional economic analysis and, Moreover, the financial analysis.",
            "Oh, it can be intangible.",
            "The music at that time not so much to get thrown on me, but the music before cloud Dancer.",
            "This movement developed a lot unnaturally.",
            "Exploit they know the link is the link between culture and crash on.",
            "At between cultural, because me between heritage on arts between Eric Taylor because you create starting partly from the right edge on.",
            "As soon as this is created it becomes it becomes a part of the heritage for the future.",
            "Therefore we weather very big confidence.",
            "Indies.",
            "Trent on many people.",
            "Maybe you know the name, but I don't know.",
            "I don't want to make too much academic presentation.",
            "Many people wrote on this program, but at the same time.",
            "At the same time.",
            "Other people say, OK, it's very very very good, but we see that it's not that easy.",
            "And we see that manageing, for example, a theater, is not so easy.",
            "Even producing a movie at that time is not so fruitful.",
            "Then other in the same time some economies say oh culture can be a good place for the development.",
            "But in the same time, other people say, you know it's very risky.",
            "On two very big interpretation appeared at the time, the first one on the second one I take in this order.",
            "The first one is very well known, but I will not explain to merge because first it's not so evident and it is not so much demonstrated, even if it let's play you're very political role.",
            "It is what we call the cost disease of the artistic production.",
            "On the second one will be too.",
            "I digre of uncertainty of the artistic production already take 2 one after the other.",
            "OK, because this is it was a disease that was both appeared in the US Embassy here in the US.",
            "The cause disease was a disease.",
            "It was done by a very famous American economist, William Beaumont.",
            "Maybe some of you know on essays, very shortly very shortly.",
            "To give you an example to be very short, you have the director of the automobile companies on you.",
            "You under director of the theater, in front of the automobile company, you have a starting price, one price for the automobile on one price for the entrance of the theater.",
            "OK, one year after.",
            "In the automobile company you have what we call productivity gains.",
            "It means that you can make a better division of Labor.",
            "You can reduce the quantity of Labor, or maybe you can save a lot of materials because we have what we call economies of scale.",
            "Maybe you can understand that intuitively and then at the end of the year you can either use this margin that appears either to pay better.",
            "The wagers.",
            "Or to reduce the price for the consumers and attract more consumers.",
            "Oh, to pay the dividends for the shareholders.",
            "But you were in the theater.",
            "You cannot make productivity gains if you have to play.",
            "You have to make A to give a performance.",
            "We still actors or 20 musicians.",
            "So 15 dancers.",
            "You have to do always.",
            "You have to make always do something more or less with the same time and with the same number of people and the same results.",
            "Therefore you don't make any.",
            "Productivity gains.",
            "It means that you cannot increase.",
            "The weight of the artist or you cannot reduce the costs for attracting new consumers.",
            "Oh my, I don't speak about the dividends for this yet because it would be early Turner anxious.",
            "OK, then it means that not maybe the first year, but one year after the order you have a kind of discrepancy between the future of the automobile industry on the future of the artistic activities and probably the cost relatively.",
            "You have always to make a comparison.",
            "This is a difficulty in economics.",
            "We never speak in absolute terms.",
            "We have always to make a comparison and arbitrage.",
            "Therefore it means that from yesteryears your cost will be higher and probably the salary of the artist will be much lower than the salaries of the automobile workers and so on and so forth.",
            "Then he says.",
            "The only solution.",
            "Would be too correct.",
            "That on there two things to correct.",
            "The first one is what everybody does today.",
            "It is to reduce the number of actors.",
            "Or to the number of musician.",
            "It's more difficult, but you know when you see adaptation when you see a dictation in the literary program, it's always, but it's always very likely you can think that it is an advantage.",
            "It will reduce the number of actor in other Shakespeare drama that were the two six hours with 100 people know that it's two hours between 6:00 and 8:00 with 10 people.",
            "But it's like that anyway.",
            "I don't know it's linear, but then you have these.",
            "He said, OK, there is an economic deficit, but maybe you can fight against the economy deficit by an aesthetic deficit.",
            "You reduce the quality of the play innocence.",
            "Or you can do something else you can ask to somebody to pay.",
            "And you are going to ask to do government.",
            "To subsidize and, since the situation is more and more difficult, you have to be subsidized more and more on.",
            "Then we have added at that time on it's still very active in some countries not everywhere.",
            "But if you look at the report of the European Union, you will find that many pages.",
            "You have the idea according to which the artistic sector may create jobs, maybe may contribute to the GDP famous GDP through the product national product, but only if there are subsidies.",
            "Which is which is a problem, at least for the public funding, finance and for the government OK?",
            "This this is I have to tell you is not so well verified today and even though the person that invented that from you that are formulated as formulated these days is say that it should not be taken so much.",
            "But anyway it shows that it is not that evident to manage in a sustainable way artistic activities.",
            "But there was another interpretation by another economist very well known when the lesson, which is number 3, I think very important gives, and he said the problem on I want just to explain to you that because it will shorten the presentation after.",
            "The problem of the cultural good it is that there is a very I digre of uncertainties.",
            "Nickel mix.",
            "Normally.",
            "When you buy a computer, for example, why isn't that frequent?",
            "But if you buy your computer, you know before.",
            "What you are going to buy?",
            "You have the information.",
            "We have the most to hear of the other people that have this kind of equipment.",
            "You have a lot of description of the performances of the device and so on.",
            "Then the main argument would be the price.",
            "Between my cookie dough, the relationship between the quality and the price OK. On we call this kind of goods.",
            "And information would be 'cause it relies mainly on the information you have the information and then the price would be determinant.",
            "If I go to the theater, it will be a little different.",
            "Because even if I know the play, even if I know the actors.",
            "I don't know this evening.",
            "What they would find?",
            "Or this morning, if there is anything, I will make an experience.",
            "The work experience is fundamental here because it will.",
            "It will make a bridge between economics and aesthetics after.",
            "I will make an experience.",
            "But I don't know the value.",
            "Before making this experience.",
            "After attending the performance.",
            "Oh, after looking at the movie.",
            "I will know if I am a pure node, if it has some value for me or not, but before I cannot know.",
            "There is a price.",
            "But I don't know the quality.",
            "Then he just gives it the specificity of the culture of the artistic boots.",
            "It is that.",
            "You don't know how to decide.",
            "Your behavior, the behavior of the consumer.",
            "Is uncertain.",
            "If I have my bird on the face, sell this computer.",
            "I don't know 500 euros, which is not the case.",
            "I know that I will sell a lot, but if I sell these two and 2500 euros, I know that they will not sell this kind of computers, but at the theater you don't know because the consumer if the place for entering is 30 or 40 or 50 euro.",
            "I don't know.",
            "You don't know what is the value we would know after.",
            "And he said.",
            "The uncertainty of the consumer.",
            "Transform itself in an uncertain T for the producer.",
            "If the consumer doesn't know the producer cannot know how many consumer will attend, and then it creates a very big risk.",
            "Under artistic production.",
            "Therefore, these two interpretation.",
            "Explain excuse me because I speak too much."
        ],
        [
            "Yet these two interpretation explain why could you not only.",
            "My culture is important, but mainly why they face a lot of difficulties on why, which is still a very common idea in many countries in Europe.",
            "Less in America, but but a little too well.",
            "Not at all in Asia.",
            "Why the governments are mobilized to sustain this sector, OK?",
            "Anne.",
            "When we do that, we can tell you tell me you told us where do may be important.",
            "What is important?",
            "We know that inside the countries it's approximately between 2 and 2.5% in the European countries.",
            "In terms of employment on of jobs on in terms of product.",
            "Well, I don't want to insist too much on that, but I put a statistic after you."
        ],
        [
            "But it's difficult to read.",
            "Excuse me here, but you will if you want.",
            "You will find it.",
            "You can look it."
        ],
        [
            "It's it's a summary.",
            "Recent summary of the European Union, able to share of their employment on the product OK.",
            "I have to tell you.",
            "That since 20 years I started with the end of the 20th century.",
            "No, I am in the 21 century.",
            "6 have credited the change.",
            "And significantly change.",
            "It does change first because the economic theory is change first.",
            "It's a long movement, but if you wanted to switch and I can come back.",
            "Clinician and when the Economix Deacon is explained, the development of an area of a territory.",
            "Country of a region of the world they say.",
            "For developing.",
            "You have to value your own resources for the others.",
            "It means that, for example, you have to create the product that you can sell out of your territory.",
            "On since you produce you create this product and you sell it, you can import the product that you don't have, but that you need.",
            "It's what we call the exergy news growth theorem.",
            "It's a pretty famous, you know.",
            "The only one of the big economies we didn't do that it's marks because he considered it the you have to take the value on the worker, but it's it's a different theory approach, OK?",
            "Do they do economics have changed a lot looking at the effects.",
            "Of education.",
            "On creativity on the economy and they say.",
            "There is another.",
            "Foundation for the growth on the development.",
            "It is to better use.",
            "I will own resources.",
            "What does it mean?",
            "It means that, for example, before when I told you we create museum we create.",
            "We have theaters where possible it was to attract the tourists.",
            "The visitors on at that time we just define.",
            "The importance of the culture, not so much by the economic importance of a culture, not so much by the benefits.",
            "For the local inhabitants, but by the fact that you attract the tourists on that, the tourist bring their money.",
            "The fortress is a kind of exploitation.",
            "The only difference with the traditional exploitation it is that it is the consumer that moves.",
            "It's not the product that moves, OK?",
            "On then they said, but if we can valorize our human resources.",
            "That exists on the.",
            "Territory.",
            "By making them more creative.",
            "Bite a by having better connection between local people on not only local people, but naturally with out with other people too.",
            "Naturally it's not.",
            "It's crazy we can create very, very under genius growth approach.",
            "It means that here we need not to know what is important to sell outside with have to know what is important to do.",
            "Inside on at.",
            "No, yes on that.",
            "Then at that time.",
            "We can see that what was very important, it was to make people more on more.",
            "Create education was naturally a very, very big driver that since everyone this is not new in a sense.",
            "But at that time, Arts was considered more considered more and more as a driver for that.",
            "For example, if I take.",
            "The museum and museum can welcome children to visit the museum on the curator can expect only that they leave the soon as possible, but they combat that they come back with their parents or their grandparents.",
            "It's a very famous approach of the management of the museums, but it's not very useful this, but you can make the visit of the museum for the young people by making by offering them for freedom.",
            "OK, now using.",
            "The experience of using some objects.",
            "On making The Apprentice isheep.",
            "Of the creation of an object.",
            "Why does this object has been created?",
            "In which context for which region?",
            "And so on and so forth.",
            "On then you a claim you make a kind of act limitation.",
            "Of the creativeness inside this paper, you make the young, the young you expect.",
            "It's your hope.",
            "You make them more project oriented on more active in this and in the search of the solution on this approach becomes more and more important because it was both in connection with the development of economic theory, but it was too in connection with what happens in many.",
            "Cultural places, because when you have one success for us yet for a movie etc grave there is room for very famous intention or you would you have 9 failures.",
            "No, no, not all the museum can leave on the tourist.",
            "You have not enough to reach for for the museum, but you have users but you have potential users of the museum on this potential.",
            "Users of the museum can be the local population.",
            "As fair as you organize the visit of the museum in the visit, the use of the museum in that direction.",
            "On then we have a very, very important movement that we can count from arts to creativity.",
            "You know when the word creativity is used everywhere today interviews everywhere and there is another debate, by the way.",
            "But if you want in the question between artistic creativity and scientific creativity, but I don't want to open it right now.",
            "It is everywhere on naturally.",
            "When we tried to delineate what are the creative industry with other creative sectors know many countries of its own system.",
            "There was a very famous definition at the beginning in the UK and UK played a big role at that time.",
            "But no, this definition is completely thrown out.",
            "It's not a problem, but when you look at when you join creativity on Earth you mean.",
            "Essentially, that art is a driver for creativity and creativity is a driver for economy.",
            "This does not suppress the first interpretation.",
            "Art can attract people from outside, but it gives.",
            "At the core of the process, another interpretation when we do that, this is very important.",
            "I think the example of the of the young people.",
            "You can tell me yes, but you are very nice.",
            "It's very nice to tell these things.",
            "But what they will do is static value in the famous static value.",
            "What about the emotion?",
            "What they build, the emotional experience of all these words that are used very rightly to try to describe what is an artistic experience.",
            "No, you tell us.",
            "OK, we can use arts to make the young people better on their son.",
            "With.",
            "These are creative process I can take.",
            "I can take the same.",
            "The same example in the hospital.",
            "Not exactly the same but another example in the hospitals I can say in many places in Europe today, in order to postpone alsheimer.",
            "Disease you make aging people than so.",
            "Redeeming plaguing and things like that.",
            "This is very important.",
            "Therefore we see that we had from one side the aesthetic value that traditional city value, which they had the core of the process.",
            "But we have what we call the instrumental benefits of arts and culture on these instrumental benefits.",
            "Today the main shop of The Economist Innocence in that sense that they say, OK, OK, you better do the you all know the Florida taxes?",
            "Well, we don't know but today we don't speak anymore on this.",
            "This is because it has been very controversial and very not confirmed from the econometric or point of view.",
            "But he said OK if you put very big museum, very big cafe concert very big.",
            "In the city or the clever people will come.",
            "This is an instrumental use of the culture.",
            "It's not an aesthetic use of the culture.",
            "It's therefore we have all these all these things.",
            "But it doesn't interest.",
            "It shows that the we should not speak of the artistic sector.",
            "We can speak of the artistic sector as the source of the activities, but the activities activities may appear all over the society.",
            "There is no more, only a specific sector for the artistic consumption.",
            "Not only one anyway, OK, I should go back because I have to go OK.",
            "Finally just here when you remember the first one I."
        ],
        [
            "Would you say that the share was approaching when I took this approach at that time, it was between the 60s on the 2000 approximately we said that the share of the artistic activities was between 2:00 on 2.5% in every, uh, no."
        ],
        [
            "The fear of the artistic activities when we consider this extension on behalf of creativeness, it is between 5 to 10% under champion.",
            "Here is the United States under statistic, but it's a very it's very curious, but it's not, it's.",
            "It could be predicted because they have very strong cultural industries and very brilliant performing arts and very very big them and so on.",
            "But they have two, the.",
            "Then in the US, the account, the people who sing in the temples or in their churches on Sunday as artist.",
            "Therefore it makes a lot of people too.",
            "Even if you try to reduce a little the number.",
            "Because if you think 2 hours of the week, it's not enough, but you have very big data and OK, I can come back on that.",
            "But I don't want because they have many things to tell you."
        ],
        [
            "OK. And now I have to go first.",
            "Excuse me, I hope I am not too much time.",
            "5 minutes."
        ],
        [
            "OK.",
            "It's terrible.",
            "I am sorry OK, the second point was to know I know you have 5 minutes.",
            "I will take them because.",
            "The second thing I want to tell you, it's to explain to you what is what are the roots of the debates.",
            "No, I want to tell you what do we see?",
            "We see that.",
            "When we look about culture hearts, we have flows that are global.",
            "On flows that are local.",
            "Fuck.",
            "The flows that are local."
        ],
        [
            "I'm deeply, very big over.",
            "This, for example Netflix, Spotify, Amazon Live Nation definition please are over here in it's a bigger organizer over performing arts.",
            "Yeah, I don't know if they're in Slovenia or not.",
            "You know, these are those who have invented the pass.",
            "That cost approximately 750 euro per year and you can go everywhere in the world to see their performance.",
            "With this bus.",
            "You know it gives you an idea of the of the way culture is working and many with young people where young people that have money naturally.",
            "Always OK.",
            "These cultural flows first don't believe they are so strong.",
            "They are very important and Netflix is about no more than.",
            "I don't remember the number exactly there.",
            "More than 600 millions or something like that of a viewers, but they rammed up there, but they're very inducted like Amazon for example.",
            "They are indebted.",
            "They have 1 billion of debt for for Netflix.",
            "Therefore it gives you an idea that it's not because you are big, that you cannot fail the famous expression too big to fail.",
            "It's it's.",
            "It's finished, OK?",
            "And this naturally.",
            "You know I could have added here.",
            "I don't want to do that because it's a little controversial goodnight for example.",
            "Created from cheese all over the world, more or less successful because maybe the vast majority of them have been unsuccessful, but it shows that they try to be really all over the world, OK?",
            "These are the global flows.",
            "OK, I am obliged to go fast, but but it's written.",
            "I can send you.",
            "I am richer writing the text.",
            "I need it.",
            "I can send it to you.",
            "It's a report, OK?"
        ],
        [
            "In in front of these very global flows.",
            "That can be interpreted as backed.",
            "By the leisure activities you know, probably you make an experience when you look at Netflix.",
            "But probably.",
            "You you spend your leisure time.",
            "On you spend more your leisure time that you make really an experience that makes you creative.",
            "But it's up to everybody to do to make its own conclusion.",
            "Local control flows.",
            "It's the flows that are more at the local level naturally, and usually this flows are more related to the experience they try to.",
            "To make people starting from an emotion having an experience connecting with the orders, creating a community on Sonos, the famous expression of the categories of the Greeks, is there its underlying.",
            "We can find new, very, very modern expression.",
            "But it is like that.",
            "And.",
            "The problem of these fruits?",
            "Look this blowing kiss me by opposition to the first one that dies told you before it is that they are very fragile because very often they are.",
            "Undertaken by.",
            "Vast majority of small enterprise.",
            "If I have time, I can give you the precise that.",
            "And these are small enterprise.",
            "We see that.",
            "They are very turbulent.",
            "It means that the happy for one project and sometimes they disappear as soon as the project is done.",
            "Sometimes they can do, from they can go from one to two to three projects.",
            "It may happen, but the proportion is very low is very low.",
            "In the within time and we can explain that they should OK. Unnaturally these tubulin's.",
            "Of the small good show on enterprise.",
            "Create a turbulence for the artist.",
            "This is not new because you know that the 19th century we were speaking about the Bohemians about the romantic, which was not very very good because at that time the romantic on the Bohemians were coming by from family that very often at some resource is there for your vision.",
            "If you are necessary of us, you know that probably much better than me, but but today we know that they are usually under regulated and we're very precise.",
            "Statistics at the warm level.",
            "We know that in average the artist of the performing arts, but they just this one.",
            "The visual artist is very difficult to the visibility of the visual artists.",
            "It's much more difficult to do.",
            "But for the performing arts, because they're in enterprise, they are paid 80% of the average remuneration in their respective countries.",
            "We do that very easily with AI taken art is that as many as three years of study I take.",
            "I don't know an economy that meant three years of studies and they compile the weights 10 years after on AC 20s as well.",
            "So just so he could make cooking, don't worry about that.",
            "It's it's not so difficult.",
            "Today we see that in fact the situation of many artists is not so bad.",
            "Unless for the dancers that answer to get us through for them because they have the ID face that I use risk.",
            "Physical risk, low demand and so on and so forth.",
            "But why is this situation relatively better?",
            "Becausw becausw?",
            "I spoke able to use of the artist in the schools in the hospitals, in the human design and everywhere therefore.",
            "Some if I can speak like that.",
            "Maybe you will not like this expression.",
            "Some new markets appear for them.",
            "Some new markets appear for them, which would create the problem because they can say that we are instrumentalized.",
            "We are no more musician, but we are a social worker in the hospital that playing music to reduce the stress of the children, which is very well socially, but with artistically.",
            "Maybe it's not very interesting for me.",
            "It's so kind of debate that we have everywhere right now in the world.",
            "But I have to tell you something that even if their remuneration is relatively better than it used to be, maybe 40 or 50 years ago.",
            "Their access to the social services on the pensions is still very, very bad.",
            "He still very, very bad.",
            "The fact that they're underpaid is no more.",
            "The most horrible encrypted area and the access to social service onto pension is meant to serve.",
            "I come to this server, therefore I do."
        ],
        [
            "Speaking about the museum OK?"
        ],
        [
            "What they would like to tell you is it when we try to understand.",
            "Who we can have Assistant able artistic ecosystem?",
            "We have to care about 1C.",
            "More and more people are.",
            "Accessing to the global flows.",
            "More and more local flows are franchised.",
            "If we, but if the financial resources.",
            "Reg they do global level.",
            "The skills the tenants, the references are produced by the local River, then we have to connect.",
            "Both on or can we connect both with where to connect these both types of loader global under record?",
            "By making creative place.",
            "Vaporizing local flavors.",
            "Biclustering, intrinsic and instrumental benefits on by considering governments as brokers.",
            "Here I am four slides, but I have no time to make this light.",
            "I will just take maybe the two first one."
        ],
        [
            "Or do you see this one?",
            "OK, the expression making creative place.",
            "I have to tell you it's a very famous expression.",
            "No, it has been invented in two 12 by the National Endowment for Arts in the US.",
            "And it means that.",
            "If we really want to to potential eyes.",
            "The effect of the heart.",
            "Not only for the market, but for the development which is different.",
            "It means further for the for the quality of life, for the for everything.",
            "We have absolutely.",
            "To make.",
            "If each territory created it, can can be a city can be Metro police.",
            "It can be a rural area.",
            "OK, on Mexico City creative.",
            "It's not only Mexico City attractive.",
            "Because make a city attractive it so need to attract the famous people that are better, more that are.",
            "Well, when we speak honestly when we speak about the attractivity of the city, we speak about the very well educated people, the people who say that don't speak about the immigrants and it has to be clear, OK?",
            "But we have not only to marketing the city where we need to engage the local people around the artistic project.",
            "On to make them cross the references they can a from the global flows with the experience that in an F with the local flows OK. After I put a lot of things I just want to give you another small example.",
            "The issue of festival because it's a very important trend in Europe we have a lot of festivals in Europe I don't speak pretty stable.",
            "So vinyon Leslie I don't know enough to speak about.",
            "Who do you have at the football game if you want but not not disrespect?",
            "And when we look at the festival, we know that.",
            "The festival were very, very brilliant at the time and attract a lot of visitors.",
            "But it was a problem on the conflict with the local people because sometimes the local visitor did not benefit from the festival.",
            "Then what we try to do and you have a lot of examples for that.",
            "It is to say to the organizer of the official.",
            "OK, you are there.",
            "You come every year which maybe we subsidize you.",
            "But you are going to organize permanent activities all along the year.",
            "I know City in Europe for example.",
            "Where to start with the Festival of Music three weeks or year or no.",
            "You have schools of music all along the year.",
            "Workshop of music.",
            "On even enterprise, that fabric manufacturer in music instruments and the last .4, maybe I will not go further.",
            "It is what we call creative tourism.",
            "Here I just want 'cause I didn't speak too much about Turin, but I know that for many people it is the Alpha and Omega maybe not sure activities.",
            "When we speak about creative treatment, women, women that we stress that there exist some tourists that want to not only to visit monuments, but really to connect with the people on live with the local people on this exchange.",
            "Naturally between local residents and.",
            "Outward people innocence can be very useful to becausw even if we are obliged to organize the.",
            "Cultural policy at the local level and with the local government.",
            "It has not actually to be across policy.",
            "That would be a terrible then I have other slides but I will stop there.",
            "It's."
        ],
        [
            "Because the on the next."
        ],
        [
            "Next, when they speak about wine, but I'm sorry it's it's OK.",
            "Thank you for your attention, because I believe that that I have to sort.",
            "Maybe because you showed us also with all these informations that are behind our complex, is the actually the field going through the history of cultural economics?",
            "How it started at the beginning and how complex it is at the moment in the sense that we have received also for me also new informations.",
            "Or now the shift was between the beginning.",
            "I mean our artists were actually promoted in the market.",
            "And now it's the shift is going through.",
            "Through Education 1st and then creativity.",
            "So before I of course I have questions myself.",
            "I do know somebody from the crowd is interested to make any question to Professor graph, some deepening's or.",
            "Some other specific topics.",
            "Concerning the fact that.",
            "Yeah, so you distinguish the different kind of creativity.",
            "So I mean to flux of economy related to creativity is one that comes from outside.",
            "So we can, I don't know, say tourism.",
            "They had to simplify and wonders internal that is able to create better.",
            "Human qualities in one community for which that community can be more productive somehow at the end.",
            "So it's quite easy probably to quantify the fluxes of tourists, but there are there any instruments to understand how investment in internal.",
            "So you called probably instrumental benefits.",
            "If I remember the term.",
            "So are there any?",
            "Possibility to measure how investment in this kind of development can really.",
            "Yeah, evaluated and so to see if that kind of message was meaningful or not to create conditions for internal development of that communities.",
            "Yes, yes.",
            "These types of measures exist.",
            "You see the need a lot under the European Union too, but it is very difficult.",
            "Because it's very easy to see.",
            "For example, you take the young ones that go 2 hours a week in the workshop in the museum.",
            "On those who don't go on, you can see at the end of the year if there is a different issue there in the results.",
            "Or Windows skills of the same for those things, But the problem is very often that.",
            "That is not the only factor.",
            "Let me drive to this result.",
            "You can say OK, I have benefits.",
            "At the end the level of the skills as increased.",
            "Or maybe the rest of the people with Alsheimer will be lower at the age of 70 or 75, or things like that.",
            "But after to say that it is exactly the result of a specific relationship.",
            "Between the artistic activity.",
            "On the earth or the educational result it's more difficult, but it exists, it exists.",
            "We will be kind of major, but I have to say that it is very difficult.",
            "But it exists in the literature, mainly DCDS under load, because on the you know they did a lot of comparison.",
            "I don't know if Slovenia was inside or not.",
            "Compilation on the performance of the educational system on the try to.",
            "SS.",
            "The effect of those who follow artistic activities.",
            "By opposition to those who don't follow artistic activity.",
            "But after the program is to know what is the rule.",
            "For example, we know that those who go further, just.",
            "We know that those who follow artistic activities as better result.",
            "But after we know too, that those who follow artistic activities come sometimes from family that have a bit very strong artistic background.",
            "Therefore we can see what is the determining factor.",
            "Is it the background of the family or is it the time spent in the artistic workshop?",
            "I have a customer question.",
            "I'm pretty interested in that.",
            "So you said that there is a shift.",
            "There was a shift actually from from importance of arts and now the importance of creativity instead.",
            "And this is through education and in the in your.",
            "In your speech you would also mention in several times that.",
            "I mean, these creative process in Asia at the moment is quite clear, much more than in other countries and I've read that the the the scale of for example, the educational systems in some countries like Korea and China is higher because they are they have introduced.",
            "Creative process is inside the schools.",
            "Is this the reason?",
            "I it's difficult.",
            "First I want to maybe to correct an impression.",
            "I have no time, therefore I took the example of education, but I can take another example.",
            "I can take the example of prisons and prisoners.",
            "For example.",
            "We know that it's what we do in my country for the big museum.",
            "We know that when some prisoner entering the prison, we must assume thing.",
            "To the time they will go out.",
            "Maybe five years after, 10 years after on Wednesday, we have no more family or no more really socially something like that.",
            "Therefore we use the artistic activities, many literature on growing.",
            "So I have to say if I go into music, sometimes that it's more difficult already.",
            "You use these artistic activities to maintain a kind of self confidence.",
            "Of people in themselves.",
            "In order that it will not give them a job when you dig out, well, maybe I don't know, but not.",
            "It's not very frequent, but it happens, it happens.",
            "But these to show to you that the instrumental what we could do instrumental dimension is not only an education, it may be on hospitals, it may be on search of employment job search for example, for the people that are unemployed on mainly the long term in employing people.",
            "On it maybe like prison before for you for your answer.",
            "I did not understand the Asian the Asian.",
            "Is that they are much more aware on this creative process than in other countries.",
            "And but there is a problem in.",
            "China, not only in China, in Asia it is that maybe you know that the world Arts did not exist in the Asian languages and for example in the in Japan the World Arts as appeared after the Meiji Revolution.",
            "Only when there was the opening of the country, because the arts were totally integrated in the current life.",
            "Totally integrated.",
            "On this explained the the I didn't speak about craft, it is on the slides.",
            "You will find them through an Internet but this explains alot of things.",
            "OK therefore they have always had more integrated vision.",
            "I should've arbiter of the artistic activities in connection with education.",
            "Would they have not be system?",
            "I cannot speak even for Slovenia, but I can speak for little more for Italy and much more for France or Spain.",
            "And you got when we have infect the retailer of the Romanticism innocence we've created the system of arts.",
            "That was no more the system that was existing before the 19th century.",
            "In a sense, it was a progressive creation, but we design a very strong, very strong.",
            "It was fragile, but very formal system of us.",
            "We schools with academies with national institution and so on and so forth, and naturally.",
            "I don't see that.",
            "Yeah these were pre Peiser notices them because they have no date.",
            "It would be so stupid but the view was focused on that system on what changed.",
            "In the European countries, this is the fact that we consider that no, we have no reason to consider the arts belong only to one sector as to be produced only in the same place and delivered in the same places.",
            "But I think that you write in urgent this there was not the same, but imagine they were certain me.",
            "Another thing that we get is a difference of words between the people too.",
            "I ask one question, then and then I will give you the yes.",
            "The current economic crisis actually calls for radical rethinking of the role of economy and social Sciences.",
            "They were actually blamed that they have social Sciences and economy have elaborated very complex answers, wrong questions.",
            "So when the question is wrong, there is a disastrous consequences for the stakeholders.",
            "So is economy as a science rethinking its fundamentals?",
            "And how is changing?",
            "OK yeah.",
            "What is the future role of economics?",
            "Big question.",
            "No, I just answered through the end of the question because the beginning of a discussion that you write an.",
            "When we summarize economics by saying and This is why I started by by the 1st remark.",
            "As the science it it could be said that.",
            "I would not say that, but it could be said that economic is only but the science of the market.",
            "On you would not be wrong by saying that.",
            "It was not exactly that at the beginning, economics was the science of the development.",
            "Because the main question that we had in the 18th century was the starting point, it was.",
            "Why does Netherland develop on England does not develop.",
            "It was like that that start the first big treaties of the modern economy.",
            "And it was a reflection about them, the development.",
            "But the problem is that we focused on the market.",
            "Which may be a solution.",
            "But we know too that the market.",
            "Brings very important solution on create very significant problems and probably.",
            "The economic science.",
            "As more concentrated on the 1st aspect.",
            "Then on the second one.",
            "We try not to read what we called the market failures, but even the term of market figures, it means that our scope is the market.",
            "I think that you right.",
            "We should have a much wider view on come back, maybe to a debate in the 18 on the beginning of the 19th century, economics was not different from politics and philosophy on the first big book of economics where philosophical books.",
            "Therefore it was, it was very we should come back.",
            "More on that.",
            "What makes those things difficult today?",
            "I think it's it's.",
            "It's first the fact that the economies don't take enough this way.",
            "On the second point is that many.",
            "Contestation of economics.",
            "See.",
            "Every all the difficulty come from the market there is no any advantage in a sense.",
            "And this is a little dirty, but that we have.",
            "A critique of the new liberalism into this is that if you say market your new liberal and neoliberal, you are bad.",
            "But which is maybe true, so it's up to you.",
            "It's a political judgment after, but you can very well say, OK, I want to see, oh, the system can create a development what we used to call the expression is disappearing.",
            "It's disappearing in scripture only by the ecology, but it is appearing.",
            "What is a sustainable economy on then to see what should be the fabric of the regulation inside.",
            "But the question should be open.",
            "Another question, if I am I getting you right that actually the problem between GDP and the contribution of culture to the GDP could be also just the problem of definition of the GDP.",
            "Should we go for maybe rather for the for an alternative dash definition like fitoussi, Amartya Sen or Gross National Happiness?",
            "You can see that you you took the right is 239, but the problem is that it is still the only system that is operating because you know there is 1 country you know the boot on families boot and they invented this accounting and they suppress it last year or two years ago.",
            "And then it was a. Happiness nation.",
            "Girl yes.",
            "National penis that we come back exactly at the point of aesthetics and economix.",
            "You know it's very difficult to, but it's a good way.",
            "But it is very difficult to make enter benefit appear everywhere in the center.",
            "In the same system of assessment, the best would be to need.",
            "Probably the GDP is not a very significant.",
            "Indicator.",
            "Yeah, I would agree on that data.",
            "Not a very significant and you know what is the use of the GDP in Europe?",
            "Do you know if you respect the Treaty of Mr. Donut?",
            "Only you you see the GD after you have classification.",
            "With this classification you know you can make China is bigger than it's just gone.",
            "Nation of the world and in 10 years it will be before US and you can say that.",
            "But this is not so interesting.",
            "We know that we know that the economic power is fantastic.",
            "But they are you right?",
            "Other questions.",
            "Session.",
            "No, it's not the slider, but it's it's there.",
            "It's there, it's there.",
            "No, I I said the problem is that when we try to connect the global on the local flows, you have natural need to give a very strong flavor to the local flow.",
            "Undo it to come back to what was said before in the sense you have really to see.",
            "What are the resources?",
            "That can give you an identity.",
            "But an identity not to say I am the best or wherever I am better than the neighbor or so, but an identity to make the local people convert innocence, cooperate, and so on and so forth.",
            "Therefore, I use 2 words, the word terroir.",
            "It's a French word, but it is using English.",
            "I am sorry, therefore I use it here.",
            "Which is because it's very significant that there were.",
            "It's really the type of land that produced the that gives a specific wine.",
            "Therefore it's when we sit there, one we if there isn't there right now that there is a specific city in a sense on the iPad after the 20 vernacular rated landscape, music, crafts and gastronomy because.",
            "Very often we speak with an accurate that only in terms of architecture which is not more totally number, but you have the order of the natural resources and you have to take them.",
            "Yeah, I had no time but I wanted to show you that here you have to consider that everything is not the point of arrival, but the point of departure.",
            "On that in this point on the voucher you have no more to make the distinction between tangible and intangible.",
            "This is a very the UNESCO is created is exacerbated.",
            "This distinction.",
            "No.",
            "They tried to.",
            "Do upset desert attention, but I think that everything is a game between.",
            "Tangible and intangible.",
            "They both recently, but with the wines.",
            "Isn't that?",
            "So thank you very much for this introductory, let's say lecture to economic culture, economics so."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good evening everyone.",
                    "label": 0
                },
                {
                    "sent": "Distinguished guests, dear colleagues and students.",
                    "label": 0
                },
                {
                    "sent": "Welcome to the scientific evening tonight of the University of Nevada.",
                    "label": 1
                },
                {
                    "sent": "Written it is my distinct pleasure, an honor to give the warmest welcome to and introduced today's guest speaker, Professor Savvy Graph.",
                    "label": 0
                },
                {
                    "sent": "Let me say that our University, and in particular teachers, researchers and students of the doctoral program in heritage studies, at the privilege to work with Professor Graph.",
                    "label": 0
                },
                {
                    "sent": "Since the establishment of the Essay Act Program in 2005.",
                    "label": 0
                },
                {
                    "sent": "At that time our course was one of the initiators of the studies attempting to merge economics with architecture, engineering, and landscape.",
                    "label": 0
                },
                {
                    "sent": "Since then, through many joint teaching research projects and mentorship activities, we have learned and explored many ways on why and how heritage and culture can be crucial.",
                    "label": 0
                },
                {
                    "sent": "Factors for social and economic innovation.",
                    "label": 0
                },
                {
                    "sent": "It is important to_that professors graphs work.",
                    "label": 0
                },
                {
                    "sent": "His trainer and mentor has been critical in shaping the careers of young researchers, including me.",
                    "label": 0
                },
                {
                    "sent": "By reconsidering redefining the importance of culture, bring it back to the frontline of territorial development through sustainability.",
                    "label": 0
                },
                {
                    "sent": "So let me take this occasion to thank Professor graph for these precious contribution in shaping and innovating our doctoral course.",
                    "label": 0
                },
                {
                    "sent": "It is worth summarizing his career that started at University of Paris.",
                    "label": 0
                },
                {
                    "sent": "Parilla short bond, where he currently holds the title of Ameritas, Professor of Economics and Manage, is the Doctorate program in Economics of Arts.",
                    "label": 0
                },
                {
                    "sent": "He is also associate professor at the Graduate Research Institute for Policy Studies in Tokyo.",
                    "label": 0
                },
                {
                    "sent": "Before he held a number of professorships around the world, and in particular at Uccle Los Angeles, Paris has energy, is member of the Scientific Board of the Louvre in Paris.",
                    "label": 0
                },
                {
                    "sent": "For many years he worked with the Friends administration when he was director of New Technologies in the Department of National Education, Director of the Academy of Early on Tour, Director of training and apprenticeship in the Department of Labor and Employment, Record Collector of the Academy of Party is published on an enormous number of publications and we I will just mention the most recent one arts and artists from an economic perspective.",
                    "label": 0
                },
                {
                    "sent": "French cultural.",
                    "label": 0
                },
                {
                    "sent": "Policy.",
                    "label": 0
                },
                {
                    "sent": "He still in the same place as creative, as Arthur Mercado Letras elitism limits on send do Patrimonio cultural.",
                    "label": 0
                },
                {
                    "sent": "Culture, creativity and city Oikonomia artistic creative.",
                    "label": 0
                },
                {
                    "sent": "The artist Enterprise in a digital age and arts erzhan I do not want to take professors podium, so I can't leave item two addresses lectures.",
                    "label": 0
                },
                {
                    "sent": "So thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "OK, good evening, let me first say that I am very happy to be there and thank you for your welcome and your invitation.",
                    "label": 0
                },
                {
                    "sent": "And it's a pleasure to work with you since 205 I did not remember which I knew it was a long time ago, but time is very short.",
                    "label": 0
                },
                {
                    "sent": "In fact, therefore it was never a pain to do that.",
                    "label": 0
                },
                {
                    "sent": "And the guy asked me to speak to you tonight about the relationship between culture and economics.",
                    "label": 0
                },
                {
                    "sent": "It's not very easy subject.",
                    "label": 0
                },
                {
                    "sent": "I am very conscious of that, therefore I will not try to be too long on to let as much time as possible for the discussion and but it is a very relevant subject to the all over the world.",
                    "label": 0
                },
                {
                    "sent": "No, not only in European countries for very specific reasons, but to find those same issues in Azure a lot in China, for example when they said that they want to create 5 serves on the museum is the next 10 years.",
                    "label": 0
                },
                {
                    "sent": "Which is a big program.",
                    "label": 0
                },
                {
                    "sent": "Naturally, you find that in Oceania because it's a main resource to music, and on the 4th floor of these communities is very well recognized all over the world.",
                    "label": 0
                },
                {
                    "sent": "Do you find that in other parts of the world?",
                    "label": 0
                },
                {
                    "sent": "Then and therefore.",
                    "label": 0
                },
                {
                    "sent": "Not only we see the facts, but we interpret them on here.",
                    "label": 0
                },
                {
                    "sent": "Start the discussion, be cause for some people.",
                    "label": 0
                },
                {
                    "sent": "On some economies, but not only economy, so politicians too they consider that culture can be a driver for the economic development.",
                    "label": 0
                },
                {
                    "sent": "That sense that the development of museums, the developments of movie industry or for you visual of series and so on and so forth, can be a source of growth.",
                    "label": 0
                },
                {
                    "sent": "Bringing new jobs on recording our Dragon added value.",
                    "label": 0
                },
                {
                    "sent": "To the national product.",
                    "label": 0
                },
                {
                    "sent": "But in the other sense, we see many failures on the.",
                    "label": 0
                },
                {
                    "sent": "I just want to give you 2 examples of this success on these failures.",
                    "label": 0
                },
                {
                    "sent": "When somebody that you know probably or Lucas families director over Star Wars.",
                    "label": 0
                },
                {
                    "sent": "So this company to Disney sort this company for four billions of dollars for billions from Lucas only.",
                    "label": 0
                },
                {
                    "sent": "So it's not for the.",
                    "label": 0
                },
                {
                    "sent": "For the other people it was for one man after 10 years of creating the Siri.",
                    "label": 0
                },
                {
                    "sent": "Of Star Wars on the new ones are not done anymore by Lucas is still advisor, but they are done by Disney's probably, you know.",
                    "label": 0
                },
                {
                    "sent": "But if I take for example, the case of Europe, we know that we have approximately certified 1000 museum do that are not very precise because it's always very difficult to design exactly what is a museum.",
                    "label": 0
                },
                {
                    "sent": "But according to the equal moves well, more or less with the 35,000 museums on almost 200 die every year, the small ones naturally not the biggest one, not the Guggenheim, not the rule.",
                    "label": 0
                },
                {
                    "sent": "#1 not the National Gallery, but not only we have two or three 100 that die every year, but we know that you have approximately 20% of these.",
                    "label": 0
                },
                {
                    "sent": "That means almost it's almost 7000 that are in the situation of.",
                    "label": 0
                },
                {
                    "sent": "But in Asia.",
                    "label": 0
                },
                {
                    "sent": "Because there is no more money.",
                    "label": 0
                },
                {
                    "sent": "On their clothes, more and more their clothes.",
                    "label": 0
                },
                {
                    "sent": "The the month that turned on the summer months and after they are closed all the months and so on.",
                    "label": 0
                },
                {
                    "sent": "So fast and naturally.",
                    "label": 0
                },
                {
                    "sent": "You can imagine that the sense of a museum.",
                    "label": 0
                },
                {
                    "sent": "It means the conservation is no more existing.",
                    "label": 0
                },
                {
                    "sent": "Therefore we have this challenge.",
                    "label": 0
                },
                {
                    "sent": "And before starting on explaining to do what I am going to try to show to you, I would like to make 2 remarks.",
                    "label": 0
                },
                {
                    "sent": "The first one.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's semantic remarks.",
                    "label": 0
                },
                {
                    "sent": "Culture is it's something very wide culture.",
                    "label": 0
                },
                {
                    "sent": "It's the set of values that we have that inspire our behaviors, our actions, and so on and so forth on many things contribute to culture.",
                    "label": 0
                },
                {
                    "sent": "The education actually is fundamental.",
                    "label": 0
                },
                {
                    "sent": "The heritage, with their attorneys already yards in more or less the region sometimes, but the art on the authors of a very, very specific consumer, all in producing culture becausw it is the activity that is fundamentally organized.",
                    "label": 0
                },
                {
                    "sent": "2.",
                    "label": 0
                },
                {
                    "sent": "We present on design some values and the values that is that inspired.",
                    "label": 0
                },
                {
                    "sent": "In this sense, our way of life.",
                    "label": 0
                },
                {
                    "sent": "Therefore I could use the word artistic activities here because I am not going to speak to you about religion tour about education, we can come back if you want and.",
                    "label": 0
                },
                {
                    "sent": "In this sort of discussion, but we when we say culture on the IT is a very frequent overlapping.",
                    "label": 0
                },
                {
                    "sent": "You know, in the literature, in the scientific literature, to when we say culture, we may need, say arts, art in a wide sense.",
                    "label": 0
                },
                {
                    "sent": "It means that by arts I start with naturally do the traditional core of the Arthur Visual Arts, and after you have your life, are the cultural industries.",
                    "label": 0
                },
                {
                    "sent": "On today I will come back on that point later on the creative industries.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "There is a second point that I want to stress in order for you to.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The standard difficulty of the problem, it is the different fundamental difference.",
                    "label": 0
                },
                {
                    "sent": "Between I take Voluntary Leader world aesthetics on economics, very curious thing that is never quoted.",
                    "label": 0
                },
                {
                    "sent": "I have to save you.",
                    "label": 0
                },
                {
                    "sent": "You will not find that very frequently.",
                    "label": 0
                },
                {
                    "sent": "It is that these two field of scientific fields and fields of research are almost have almost appear in the same period of time.",
                    "label": 0
                },
                {
                    "sent": "At the end of the 18th century, many in Europe at that time after it.",
                    "label": 1
                },
                {
                    "sent": "But in other countries static existed, but.",
                    "label": 0
                },
                {
                    "sent": "Under the classification, if I can think either.",
                    "label": 0
                },
                {
                    "sent": "But it is interesting to remember these birth of the two connected field of research.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 1
                },
                {
                    "sent": "Because the principle of aesthetics it was to understand the value of something exceptional.",
                    "label": 0
                },
                {
                    "sent": "Something unique.",
                    "label": 0
                },
                {
                    "sent": "The famous I don't know what of account for example.",
                    "label": 0
                },
                {
                    "sent": "On the principle of economics, it is exactly the opposite.",
                    "label": 1
                },
                {
                    "sent": "Is this to merge or hours feelings?",
                    "label": 0
                },
                {
                    "sent": "All our values are subjective values in a common denominator.",
                    "label": 0
                },
                {
                    "sent": "The moon a more or less.",
                    "label": 0
                },
                {
                    "sent": "Therefore, the two field are.",
                    "label": 0
                },
                {
                    "sent": "Almost, I don't know if I can see orthogonal.",
                    "label": 0
                },
                {
                    "sent": "It means they they they they are not at all.",
                    "label": 0
                },
                {
                    "sent": "They detect two very different directions on Tuesday when we are looking very precisely at the recommendations, for example, or to manage a museum or to benefit from a festival, or to create a cultural product like wine for example.",
                    "label": 0
                },
                {
                    "sent": "Or something else.",
                    "label": 0
                },
                {
                    "sent": "Here we have this tension.",
                    "label": 0
                },
                {
                    "sent": "Between the exceptional from one side.",
                    "label": 0
                },
                {
                    "sent": "Which is very well represented by the theory of yesterday's and the common judgment from the other side, which is very well represented by the fact that on the market I don't want to know your feelings, I just want to know what you are going to pay for that.",
                    "label": 0
                },
                {
                    "sent": "On you you don't want baby to know the feeling of the produce, so this is a little different but you know you want to know what is a scheme for you in terms of money.",
                    "label": 0
                },
                {
                    "sent": "Therefore this is very important to understand that there will be always between the Economist and the people of the words.",
                    "label": 0
                },
                {
                    "sent": "I said the words of Ontario arts.",
                    "label": 0
                },
                {
                    "sent": "I don't have no position but.",
                    "label": 0
                },
                {
                    "sent": "Difficulty, difficulty because they have not at all.",
                    "label": 0
                },
                {
                    "sent": "They don't start with the same references, but after that you need to live together and This is why Windows story starts.",
                    "label": 0
                },
                {
                    "sent": "OK, I.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Would like to.",
                    "label": 0
                },
                {
                    "sent": "If you do three steps of this presentation, you know in the first time I would like to explain to you.",
                    "label": 0
                },
                {
                    "sent": "It's a little kind of Genesis of history, but it is a very important why in Europe.",
                    "label": 0
                },
                {
                    "sent": "We've started with the ID that cultural activities or artistic artistic activities matter for economic growth and development on why today.",
                    "label": 0
                },
                {
                    "sent": "We have arrived at the conclusion according to which we should.",
                    "label": 0
                },
                {
                    "sent": "We should be investing culture to make development more sustainable.",
                    "label": 0
                },
                {
                    "sent": "This is the right on after I will come under two other steps.",
                    "label": 0
                },
                {
                    "sent": "The second step would be to explain to you what we see at the world level.",
                    "label": 0
                },
                {
                    "sent": "The difference between the global cultural flows on the local culture, hard flows on the 3rd and final step will be to know are we connected.",
                    "label": 0
                },
                {
                    "sent": "This flows through what we could do.",
                    "label": 0
                },
                {
                    "sent": "Very famous expression to the in our field of research.",
                    "label": 0
                },
                {
                    "sent": "The creative placemaking.",
                    "label": 0
                },
                {
                    "sent": "Of the creative economy making on the journey to win the whole of the local governments.",
                    "label": 1
                },
                {
                    "sent": "OK, let's start first with the very important.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The evolution of the debate.",
                    "label": 0
                },
                {
                    "sent": "Let me tell you first, but I don't want to stay too long on that because I have no time and it will be too much academic.",
                    "label": 0
                },
                {
                    "sent": "That The Economist never spoke about culture until these recent years when Jesus entered this recent 50 years.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "There was some study on the whole of economics and culture on the link between culture and economy, but it was mainly done by sociologist on the best example was naturally Max Weber because makes lability decembrie feminist analysis not only on the Protestant easement, many religions he did this study to show all the origin which is South of culture can have an effect on the.",
                    "label": 0
                },
                {
                    "sent": "Economic development, but the economy did not speak even even our father.",
                    "label": 0
                },
                {
                    "sent": "If I can speak like that.",
                    "label": 0
                },
                {
                    "sent": "Adam Smith, because it is considered as the father of The Economist.",
                    "label": 0
                },
                {
                    "sent": "He spoke a little about culture, only said something very, very interesting that is forgotten.",
                    "label": 0
                },
                {
                    "sent": "Know he was asking why do the artist?",
                    "label": 0
                },
                {
                    "sent": "Try to be artist when they know that probably they will not sell their pieces of arts or they will not sell well.",
                    "label": 0
                },
                {
                    "sent": "There pieces of art on he said it is becausw the arts.",
                    "label": 0
                },
                {
                    "sent": "It's not like a market.",
                    "label": 0
                },
                {
                    "sent": "It is like a lottery.",
                    "label": 0
                },
                {
                    "sent": "It means that you like to get to play in the sense.",
                    "label": 0
                },
                {
                    "sent": "Or maybe you like what you do enough to take the risk of not selling it, and he said something very interesting because it explains a lot of things today in Europe after he says.",
                    "label": 0
                },
                {
                    "sent": "They do when you when you make a lottery.",
                    "label": 0
                },
                {
                    "sent": "If you want to win, you don't take only one ticket, you try to make a lot of tickets.",
                    "label": 0
                },
                {
                    "sent": "On the two value lot of tickets with me and then he said then the artist will try to make a lot of pieces of art, even if they don't sell them and use that.",
                    "label": 0
                },
                {
                    "sent": "That interpretation to explain why many artists could not survive it was at that time and this analysis stage.",
                    "label": 0
                },
                {
                    "sent": "Little, but it was exceptions.",
                    "label": 0
                },
                {
                    "sent": "What the pins?",
                    "label": 0
                },
                {
                    "sent": "What was important it was.",
                    "label": 0
                },
                {
                    "sent": "In the second part of the 20th century.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because many traditional industries disappeared and to understand better, discussed you have this all over Europe, but probably the best example is the United Kingdom.",
                    "label": 0
                },
                {
                    "sent": "Many traditional industries disappear, shipyards, steel industry, coal mining, so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "And then many city where the despaired.",
                    "label": 0
                },
                {
                    "sent": "Remember that for example, Manchester, that is known today as a very important city on very brilliant city in Europe.",
                    "label": 0
                },
                {
                    "sent": "As the rate of employment of almost 30% at that time.",
                    "label": 0
                },
                {
                    "sent": "On at that time there was a movement not only in India in the UK, but but mainly in UK to consider that if some traditional industries disappear.",
                    "label": 0
                },
                {
                    "sent": "We have to try something else.",
                    "label": 0
                },
                {
                    "sent": "We've tried to valorize.",
                    "label": 0
                },
                {
                    "sent": "To create the market starting from some resources that you have on what are the resources that everybody is?",
                    "label": 0
                },
                {
                    "sent": "It is the eritage.",
                    "label": 0
                },
                {
                    "sent": "I can see the artistic creation, but at that time it was more irritating.",
                    "label": 0
                },
                {
                    "sent": "And if they come back on the example of Manchester for example, the first investment that the City of Manchester did because they had no any opportunity of investment, they had some money, but there was no project they were new in the product, it was to rehabilitate the old railway station.",
                    "label": 0
                },
                {
                    "sent": "It was the first investment of the new Age of Manchester.",
                    "label": 0
                },
                {
                    "sent": "And at that time many people started to think that.",
                    "label": 0
                },
                {
                    "sent": "You have always won results.",
                    "label": 0
                },
                {
                    "sent": "What they will do territory, whatever the city, whatever the rural space it is, is cultural heritage.",
                    "label": 0
                },
                {
                    "sent": "It can be an material, tangible heritage.",
                    "label": 0
                },
                {
                    "sent": "Monuments.",
                    "label": 0
                },
                {
                    "sent": "Runescape but landscape is very difficult because on Skype if you want to change your landscape it takes a lot of time and therefore it escapes a little too.",
                    "label": 0
                },
                {
                    "sent": "The prospects of the traditional economic analysis and, Moreover, the financial analysis.",
                    "label": 0
                },
                {
                    "sent": "Oh, it can be intangible.",
                    "label": 0
                },
                {
                    "sent": "The music at that time not so much to get thrown on me, but the music before cloud Dancer.",
                    "label": 0
                },
                {
                    "sent": "This movement developed a lot unnaturally.",
                    "label": 0
                },
                {
                    "sent": "Exploit they know the link is the link between culture and crash on.",
                    "label": 0
                },
                {
                    "sent": "At between cultural, because me between heritage on arts between Eric Taylor because you create starting partly from the right edge on.",
                    "label": 0
                },
                {
                    "sent": "As soon as this is created it becomes it becomes a part of the heritage for the future.",
                    "label": 0
                },
                {
                    "sent": "Therefore we weather very big confidence.",
                    "label": 0
                },
                {
                    "sent": "Indies.",
                    "label": 0
                },
                {
                    "sent": "Trent on many people.",
                    "label": 0
                },
                {
                    "sent": "Maybe you know the name, but I don't know.",
                    "label": 0
                },
                {
                    "sent": "I don't want to make too much academic presentation.",
                    "label": 0
                },
                {
                    "sent": "Many people wrote on this program, but at the same time.",
                    "label": 0
                },
                {
                    "sent": "At the same time.",
                    "label": 0
                },
                {
                    "sent": "Other people say, OK, it's very very very good, but we see that it's not that easy.",
                    "label": 0
                },
                {
                    "sent": "And we see that manageing, for example, a theater, is not so easy.",
                    "label": 0
                },
                {
                    "sent": "Even producing a movie at that time is not so fruitful.",
                    "label": 0
                },
                {
                    "sent": "Then other in the same time some economies say oh culture can be a good place for the development.",
                    "label": 0
                },
                {
                    "sent": "But in the same time, other people say, you know it's very risky.",
                    "label": 0
                },
                {
                    "sent": "On two very big interpretation appeared at the time, the first one on the second one I take in this order.",
                    "label": 0
                },
                {
                    "sent": "The first one is very well known, but I will not explain to merge because first it's not so evident and it is not so much demonstrated, even if it let's play you're very political role.",
                    "label": 0
                },
                {
                    "sent": "It is what we call the cost disease of the artistic production.",
                    "label": 0
                },
                {
                    "sent": "On the second one will be too.",
                    "label": 0
                },
                {
                    "sent": "I digre of uncertainty of the artistic production already take 2 one after the other.",
                    "label": 0
                },
                {
                    "sent": "OK, because this is it was a disease that was both appeared in the US Embassy here in the US.",
                    "label": 0
                },
                {
                    "sent": "The cause disease was a disease.",
                    "label": 0
                },
                {
                    "sent": "It was done by a very famous American economist, William Beaumont.",
                    "label": 0
                },
                {
                    "sent": "Maybe some of you know on essays, very shortly very shortly.",
                    "label": 0
                },
                {
                    "sent": "To give you an example to be very short, you have the director of the automobile companies on you.",
                    "label": 0
                },
                {
                    "sent": "You under director of the theater, in front of the automobile company, you have a starting price, one price for the automobile on one price for the entrance of the theater.",
                    "label": 0
                },
                {
                    "sent": "OK, one year after.",
                    "label": 0
                },
                {
                    "sent": "In the automobile company you have what we call productivity gains.",
                    "label": 0
                },
                {
                    "sent": "It means that you can make a better division of Labor.",
                    "label": 0
                },
                {
                    "sent": "You can reduce the quantity of Labor, or maybe you can save a lot of materials because we have what we call economies of scale.",
                    "label": 0
                },
                {
                    "sent": "Maybe you can understand that intuitively and then at the end of the year you can either use this margin that appears either to pay better.",
                    "label": 0
                },
                {
                    "sent": "The wagers.",
                    "label": 0
                },
                {
                    "sent": "Or to reduce the price for the consumers and attract more consumers.",
                    "label": 0
                },
                {
                    "sent": "Oh, to pay the dividends for the shareholders.",
                    "label": 0
                },
                {
                    "sent": "But you were in the theater.",
                    "label": 0
                },
                {
                    "sent": "You cannot make productivity gains if you have to play.",
                    "label": 0
                },
                {
                    "sent": "You have to make A to give a performance.",
                    "label": 0
                },
                {
                    "sent": "We still actors or 20 musicians.",
                    "label": 0
                },
                {
                    "sent": "So 15 dancers.",
                    "label": 0
                },
                {
                    "sent": "You have to do always.",
                    "label": 0
                },
                {
                    "sent": "You have to make always do something more or less with the same time and with the same number of people and the same results.",
                    "label": 0
                },
                {
                    "sent": "Therefore you don't make any.",
                    "label": 0
                },
                {
                    "sent": "Productivity gains.",
                    "label": 0
                },
                {
                    "sent": "It means that you cannot increase.",
                    "label": 0
                },
                {
                    "sent": "The weight of the artist or you cannot reduce the costs for attracting new consumers.",
                    "label": 0
                },
                {
                    "sent": "Oh my, I don't speak about the dividends for this yet because it would be early Turner anxious.",
                    "label": 0
                },
                {
                    "sent": "OK, then it means that not maybe the first year, but one year after the order you have a kind of discrepancy between the future of the automobile industry on the future of the artistic activities and probably the cost relatively.",
                    "label": 0
                },
                {
                    "sent": "You have always to make a comparison.",
                    "label": 0
                },
                {
                    "sent": "This is a difficulty in economics.",
                    "label": 0
                },
                {
                    "sent": "We never speak in absolute terms.",
                    "label": 0
                },
                {
                    "sent": "We have always to make a comparison and arbitrage.",
                    "label": 0
                },
                {
                    "sent": "Therefore it means that from yesteryears your cost will be higher and probably the salary of the artist will be much lower than the salaries of the automobile workers and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "Then he says.",
                    "label": 0
                },
                {
                    "sent": "The only solution.",
                    "label": 0
                },
                {
                    "sent": "Would be too correct.",
                    "label": 0
                },
                {
                    "sent": "That on there two things to correct.",
                    "label": 0
                },
                {
                    "sent": "The first one is what everybody does today.",
                    "label": 0
                },
                {
                    "sent": "It is to reduce the number of actors.",
                    "label": 0
                },
                {
                    "sent": "Or to the number of musician.",
                    "label": 0
                },
                {
                    "sent": "It's more difficult, but you know when you see adaptation when you see a dictation in the literary program, it's always, but it's always very likely you can think that it is an advantage.",
                    "label": 0
                },
                {
                    "sent": "It will reduce the number of actor in other Shakespeare drama that were the two six hours with 100 people know that it's two hours between 6:00 and 8:00 with 10 people.",
                    "label": 0
                },
                {
                    "sent": "But it's like that anyway.",
                    "label": 0
                },
                {
                    "sent": "I don't know it's linear, but then you have these.",
                    "label": 0
                },
                {
                    "sent": "He said, OK, there is an economic deficit, but maybe you can fight against the economy deficit by an aesthetic deficit.",
                    "label": 0
                },
                {
                    "sent": "You reduce the quality of the play innocence.",
                    "label": 0
                },
                {
                    "sent": "Or you can do something else you can ask to somebody to pay.",
                    "label": 0
                },
                {
                    "sent": "And you are going to ask to do government.",
                    "label": 0
                },
                {
                    "sent": "To subsidize and, since the situation is more and more difficult, you have to be subsidized more and more on.",
                    "label": 0
                },
                {
                    "sent": "Then we have added at that time on it's still very active in some countries not everywhere.",
                    "label": 0
                },
                {
                    "sent": "But if you look at the report of the European Union, you will find that many pages.",
                    "label": 0
                },
                {
                    "sent": "You have the idea according to which the artistic sector may create jobs, maybe may contribute to the GDP famous GDP through the product national product, but only if there are subsidies.",
                    "label": 0
                },
                {
                    "sent": "Which is which is a problem, at least for the public funding, finance and for the government OK?",
                    "label": 0
                },
                {
                    "sent": "This this is I have to tell you is not so well verified today and even though the person that invented that from you that are formulated as formulated these days is say that it should not be taken so much.",
                    "label": 0
                },
                {
                    "sent": "But anyway it shows that it is not that evident to manage in a sustainable way artistic activities.",
                    "label": 0
                },
                {
                    "sent": "But there was another interpretation by another economist very well known when the lesson, which is number 3, I think very important gives, and he said the problem on I want just to explain to you that because it will shorten the presentation after.",
                    "label": 0
                },
                {
                    "sent": "The problem of the cultural good it is that there is a very I digre of uncertainties.",
                    "label": 0
                },
                {
                    "sent": "Nickel mix.",
                    "label": 0
                },
                {
                    "sent": "Normally.",
                    "label": 0
                },
                {
                    "sent": "When you buy a computer, for example, why isn't that frequent?",
                    "label": 0
                },
                {
                    "sent": "But if you buy your computer, you know before.",
                    "label": 0
                },
                {
                    "sent": "What you are going to buy?",
                    "label": 0
                },
                {
                    "sent": "You have the information.",
                    "label": 0
                },
                {
                    "sent": "We have the most to hear of the other people that have this kind of equipment.",
                    "label": 0
                },
                {
                    "sent": "You have a lot of description of the performances of the device and so on.",
                    "label": 0
                },
                {
                    "sent": "Then the main argument would be the price.",
                    "label": 0
                },
                {
                    "sent": "Between my cookie dough, the relationship between the quality and the price OK. On we call this kind of goods.",
                    "label": 0
                },
                {
                    "sent": "And information would be 'cause it relies mainly on the information you have the information and then the price would be determinant.",
                    "label": 0
                },
                {
                    "sent": "If I go to the theater, it will be a little different.",
                    "label": 0
                },
                {
                    "sent": "Because even if I know the play, even if I know the actors.",
                    "label": 0
                },
                {
                    "sent": "I don't know this evening.",
                    "label": 0
                },
                {
                    "sent": "What they would find?",
                    "label": 0
                },
                {
                    "sent": "Or this morning, if there is anything, I will make an experience.",
                    "label": 0
                },
                {
                    "sent": "The work experience is fundamental here because it will.",
                    "label": 0
                },
                {
                    "sent": "It will make a bridge between economics and aesthetics after.",
                    "label": 0
                },
                {
                    "sent": "I will make an experience.",
                    "label": 0
                },
                {
                    "sent": "But I don't know the value.",
                    "label": 0
                },
                {
                    "sent": "Before making this experience.",
                    "label": 0
                },
                {
                    "sent": "After attending the performance.",
                    "label": 0
                },
                {
                    "sent": "Oh, after looking at the movie.",
                    "label": 0
                },
                {
                    "sent": "I will know if I am a pure node, if it has some value for me or not, but before I cannot know.",
                    "label": 0
                },
                {
                    "sent": "There is a price.",
                    "label": 0
                },
                {
                    "sent": "But I don't know the quality.",
                    "label": 0
                },
                {
                    "sent": "Then he just gives it the specificity of the culture of the artistic boots.",
                    "label": 0
                },
                {
                    "sent": "It is that.",
                    "label": 0
                },
                {
                    "sent": "You don't know how to decide.",
                    "label": 0
                },
                {
                    "sent": "Your behavior, the behavior of the consumer.",
                    "label": 0
                },
                {
                    "sent": "Is uncertain.",
                    "label": 0
                },
                {
                    "sent": "If I have my bird on the face, sell this computer.",
                    "label": 0
                },
                {
                    "sent": "I don't know 500 euros, which is not the case.",
                    "label": 0
                },
                {
                    "sent": "I know that I will sell a lot, but if I sell these two and 2500 euros, I know that they will not sell this kind of computers, but at the theater you don't know because the consumer if the place for entering is 30 or 40 or 50 euro.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "You don't know what is the value we would know after.",
                    "label": 0
                },
                {
                    "sent": "And he said.",
                    "label": 0
                },
                {
                    "sent": "The uncertainty of the consumer.",
                    "label": 0
                },
                {
                    "sent": "Transform itself in an uncertain T for the producer.",
                    "label": 0
                },
                {
                    "sent": "If the consumer doesn't know the producer cannot know how many consumer will attend, and then it creates a very big risk.",
                    "label": 0
                },
                {
                    "sent": "Under artistic production.",
                    "label": 0
                },
                {
                    "sent": "Therefore, these two interpretation.",
                    "label": 0
                },
                {
                    "sent": "Explain excuse me because I speak too much.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yet these two interpretation explain why could you not only.",
                    "label": 0
                },
                {
                    "sent": "My culture is important, but mainly why they face a lot of difficulties on why, which is still a very common idea in many countries in Europe.",
                    "label": 0
                },
                {
                    "sent": "Less in America, but but a little too well.",
                    "label": 0
                },
                {
                    "sent": "Not at all in Asia.",
                    "label": 0
                },
                {
                    "sent": "Why the governments are mobilized to sustain this sector, OK?",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "When we do that, we can tell you tell me you told us where do may be important.",
                    "label": 0
                },
                {
                    "sent": "What is important?",
                    "label": 0
                },
                {
                    "sent": "We know that inside the countries it's approximately between 2 and 2.5% in the European countries.",
                    "label": 1
                },
                {
                    "sent": "In terms of employment on of jobs on in terms of product.",
                    "label": 1
                },
                {
                    "sent": "Well, I don't want to insist too much on that, but I put a statistic after you.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But it's difficult to read.",
                    "label": 0
                },
                {
                    "sent": "Excuse me here, but you will if you want.",
                    "label": 0
                },
                {
                    "sent": "You will find it.",
                    "label": 0
                },
                {
                    "sent": "You can look it.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's it's a summary.",
                    "label": 0
                },
                {
                    "sent": "Recent summary of the European Union, able to share of their employment on the product OK.",
                    "label": 0
                },
                {
                    "sent": "I have to tell you.",
                    "label": 0
                },
                {
                    "sent": "That since 20 years I started with the end of the 20th century.",
                    "label": 0
                },
                {
                    "sent": "No, I am in the 21 century.",
                    "label": 0
                },
                {
                    "sent": "6 have credited the change.",
                    "label": 1
                },
                {
                    "sent": "And significantly change.",
                    "label": 0
                },
                {
                    "sent": "It does change first because the economic theory is change first.",
                    "label": 1
                },
                {
                    "sent": "It's a long movement, but if you wanted to switch and I can come back.",
                    "label": 0
                },
                {
                    "sent": "Clinician and when the Economix Deacon is explained, the development of an area of a territory.",
                    "label": 0
                },
                {
                    "sent": "Country of a region of the world they say.",
                    "label": 0
                },
                {
                    "sent": "For developing.",
                    "label": 0
                },
                {
                    "sent": "You have to value your own resources for the others.",
                    "label": 0
                },
                {
                    "sent": "It means that, for example, you have to create the product that you can sell out of your territory.",
                    "label": 0
                },
                {
                    "sent": "On since you produce you create this product and you sell it, you can import the product that you don't have, but that you need.",
                    "label": 0
                },
                {
                    "sent": "It's what we call the exergy news growth theorem.",
                    "label": 0
                },
                {
                    "sent": "It's a pretty famous, you know.",
                    "label": 0
                },
                {
                    "sent": "The only one of the big economies we didn't do that it's marks because he considered it the you have to take the value on the worker, but it's it's a different theory approach, OK?",
                    "label": 0
                },
                {
                    "sent": "Do they do economics have changed a lot looking at the effects.",
                    "label": 0
                },
                {
                    "sent": "Of education.",
                    "label": 0
                },
                {
                    "sent": "On creativity on the economy and they say.",
                    "label": 0
                },
                {
                    "sent": "There is another.",
                    "label": 0
                },
                {
                    "sent": "Foundation for the growth on the development.",
                    "label": 0
                },
                {
                    "sent": "It is to better use.",
                    "label": 0
                },
                {
                    "sent": "I will own resources.",
                    "label": 0
                },
                {
                    "sent": "What does it mean?",
                    "label": 0
                },
                {
                    "sent": "It means that, for example, before when I told you we create museum we create.",
                    "label": 0
                },
                {
                    "sent": "We have theaters where possible it was to attract the tourists.",
                    "label": 0
                },
                {
                    "sent": "The visitors on at that time we just define.",
                    "label": 0
                },
                {
                    "sent": "The importance of the culture, not so much by the economic importance of a culture, not so much by the benefits.",
                    "label": 0
                },
                {
                    "sent": "For the local inhabitants, but by the fact that you attract the tourists on that, the tourist bring their money.",
                    "label": 0
                },
                {
                    "sent": "The fortress is a kind of exploitation.",
                    "label": 0
                },
                {
                    "sent": "The only difference with the traditional exploitation it is that it is the consumer that moves.",
                    "label": 0
                },
                {
                    "sent": "It's not the product that moves, OK?",
                    "label": 0
                },
                {
                    "sent": "On then they said, but if we can valorize our human resources.",
                    "label": 0
                },
                {
                    "sent": "That exists on the.",
                    "label": 0
                },
                {
                    "sent": "Territory.",
                    "label": 0
                },
                {
                    "sent": "By making them more creative.",
                    "label": 0
                },
                {
                    "sent": "Bite a by having better connection between local people on not only local people, but naturally with out with other people too.",
                    "label": 0
                },
                {
                    "sent": "Naturally it's not.",
                    "label": 0
                },
                {
                    "sent": "It's crazy we can create very, very under genius growth approach.",
                    "label": 0
                },
                {
                    "sent": "It means that here we need not to know what is important to sell outside with have to know what is important to do.",
                    "label": 0
                },
                {
                    "sent": "Inside on at.",
                    "label": 0
                },
                {
                    "sent": "No, yes on that.",
                    "label": 0
                },
                {
                    "sent": "Then at that time.",
                    "label": 0
                },
                {
                    "sent": "We can see that what was very important, it was to make people more on more.",
                    "label": 0
                },
                {
                    "sent": "Create education was naturally a very, very big driver that since everyone this is not new in a sense.",
                    "label": 0
                },
                {
                    "sent": "But at that time, Arts was considered more considered more and more as a driver for that.",
                    "label": 0
                },
                {
                    "sent": "For example, if I take.",
                    "label": 0
                },
                {
                    "sent": "The museum and museum can welcome children to visit the museum on the curator can expect only that they leave the soon as possible, but they combat that they come back with their parents or their grandparents.",
                    "label": 0
                },
                {
                    "sent": "It's a very famous approach of the management of the museums, but it's not very useful this, but you can make the visit of the museum for the young people by making by offering them for freedom.",
                    "label": 0
                },
                {
                    "sent": "OK, now using.",
                    "label": 0
                },
                {
                    "sent": "The experience of using some objects.",
                    "label": 1
                },
                {
                    "sent": "On making The Apprentice isheep.",
                    "label": 0
                },
                {
                    "sent": "Of the creation of an object.",
                    "label": 0
                },
                {
                    "sent": "Why does this object has been created?",
                    "label": 0
                },
                {
                    "sent": "In which context for which region?",
                    "label": 0
                },
                {
                    "sent": "And so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "On then you a claim you make a kind of act limitation.",
                    "label": 0
                },
                {
                    "sent": "Of the creativeness inside this paper, you make the young, the young you expect.",
                    "label": 0
                },
                {
                    "sent": "It's your hope.",
                    "label": 0
                },
                {
                    "sent": "You make them more project oriented on more active in this and in the search of the solution on this approach becomes more and more important because it was both in connection with the development of economic theory, but it was too in connection with what happens in many.",
                    "label": 0
                },
                {
                    "sent": "Cultural places, because when you have one success for us yet for a movie etc grave there is room for very famous intention or you would you have 9 failures.",
                    "label": 0
                },
                {
                    "sent": "No, no, not all the museum can leave on the tourist.",
                    "label": 0
                },
                {
                    "sent": "You have not enough to reach for for the museum, but you have users but you have potential users of the museum on this potential.",
                    "label": 0
                },
                {
                    "sent": "Users of the museum can be the local population.",
                    "label": 0
                },
                {
                    "sent": "As fair as you organize the visit of the museum in the visit, the use of the museum in that direction.",
                    "label": 0
                },
                {
                    "sent": "On then we have a very, very important movement that we can count from arts to creativity.",
                    "label": 0
                },
                {
                    "sent": "You know when the word creativity is used everywhere today interviews everywhere and there is another debate, by the way.",
                    "label": 0
                },
                {
                    "sent": "But if you want in the question between artistic creativity and scientific creativity, but I don't want to open it right now.",
                    "label": 0
                },
                {
                    "sent": "It is everywhere on naturally.",
                    "label": 0
                },
                {
                    "sent": "When we tried to delineate what are the creative industry with other creative sectors know many countries of its own system.",
                    "label": 0
                },
                {
                    "sent": "There was a very famous definition at the beginning in the UK and UK played a big role at that time.",
                    "label": 0
                },
                {
                    "sent": "But no, this definition is completely thrown out.",
                    "label": 0
                },
                {
                    "sent": "It's not a problem, but when you look at when you join creativity on Earth you mean.",
                    "label": 0
                },
                {
                    "sent": "Essentially, that art is a driver for creativity and creativity is a driver for economy.",
                    "label": 0
                },
                {
                    "sent": "This does not suppress the first interpretation.",
                    "label": 0
                },
                {
                    "sent": "Art can attract people from outside, but it gives.",
                    "label": 0
                },
                {
                    "sent": "At the core of the process, another interpretation when we do that, this is very important.",
                    "label": 0
                },
                {
                    "sent": "I think the example of the of the young people.",
                    "label": 0
                },
                {
                    "sent": "You can tell me yes, but you are very nice.",
                    "label": 0
                },
                {
                    "sent": "It's very nice to tell these things.",
                    "label": 0
                },
                {
                    "sent": "But what they will do is static value in the famous static value.",
                    "label": 0
                },
                {
                    "sent": "What about the emotion?",
                    "label": 0
                },
                {
                    "sent": "What they build, the emotional experience of all these words that are used very rightly to try to describe what is an artistic experience.",
                    "label": 0
                },
                {
                    "sent": "No, you tell us.",
                    "label": 0
                },
                {
                    "sent": "OK, we can use arts to make the young people better on their son.",
                    "label": 0
                },
                {
                    "sent": "With.",
                    "label": 0
                },
                {
                    "sent": "These are creative process I can take.",
                    "label": 0
                },
                {
                    "sent": "I can take the same.",
                    "label": 0
                },
                {
                    "sent": "The same example in the hospital.",
                    "label": 0
                },
                {
                    "sent": "Not exactly the same but another example in the hospitals I can say in many places in Europe today, in order to postpone alsheimer.",
                    "label": 0
                },
                {
                    "sent": "Disease you make aging people than so.",
                    "label": 0
                },
                {
                    "sent": "Redeeming plaguing and things like that.",
                    "label": 0
                },
                {
                    "sent": "This is very important.",
                    "label": 0
                },
                {
                    "sent": "Therefore we see that we had from one side the aesthetic value that traditional city value, which they had the core of the process.",
                    "label": 0
                },
                {
                    "sent": "But we have what we call the instrumental benefits of arts and culture on these instrumental benefits.",
                    "label": 0
                },
                {
                    "sent": "Today the main shop of The Economist Innocence in that sense that they say, OK, OK, you better do the you all know the Florida taxes?",
                    "label": 0
                },
                {
                    "sent": "Well, we don't know but today we don't speak anymore on this.",
                    "label": 0
                },
                {
                    "sent": "This is because it has been very controversial and very not confirmed from the econometric or point of view.",
                    "label": 0
                },
                {
                    "sent": "But he said OK if you put very big museum, very big cafe concert very big.",
                    "label": 0
                },
                {
                    "sent": "In the city or the clever people will come.",
                    "label": 0
                },
                {
                    "sent": "This is an instrumental use of the culture.",
                    "label": 0
                },
                {
                    "sent": "It's not an aesthetic use of the culture.",
                    "label": 0
                },
                {
                    "sent": "It's therefore we have all these all these things.",
                    "label": 0
                },
                {
                    "sent": "But it doesn't interest.",
                    "label": 0
                },
                {
                    "sent": "It shows that the we should not speak of the artistic sector.",
                    "label": 0
                },
                {
                    "sent": "We can speak of the artistic sector as the source of the activities, but the activities activities may appear all over the society.",
                    "label": 0
                },
                {
                    "sent": "There is no more, only a specific sector for the artistic consumption.",
                    "label": 0
                },
                {
                    "sent": "Not only one anyway, OK, I should go back because I have to go OK.",
                    "label": 0
                },
                {
                    "sent": "Finally just here when you remember the first one I.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Would you say that the share was approaching when I took this approach at that time, it was between the 60s on the 2000 approximately we said that the share of the artistic activities was between 2:00 on 2.5% in every, uh, no.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The fear of the artistic activities when we consider this extension on behalf of creativeness, it is between 5 to 10% under champion.",
                    "label": 1
                },
                {
                    "sent": "Here is the United States under statistic, but it's a very it's very curious, but it's not, it's.",
                    "label": 0
                },
                {
                    "sent": "It could be predicted because they have very strong cultural industries and very brilliant performing arts and very very big them and so on.",
                    "label": 0
                },
                {
                    "sent": "But they have two, the.",
                    "label": 0
                },
                {
                    "sent": "Then in the US, the account, the people who sing in the temples or in their churches on Sunday as artist.",
                    "label": 0
                },
                {
                    "sent": "Therefore it makes a lot of people too.",
                    "label": 0
                },
                {
                    "sent": "Even if you try to reduce a little the number.",
                    "label": 0
                },
                {
                    "sent": "Because if you think 2 hours of the week, it's not enough, but you have very big data and OK, I can come back on that.",
                    "label": 0
                },
                {
                    "sent": "But I don't want because they have many things to tell you.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK. And now I have to go first.",
                    "label": 0
                },
                {
                    "sent": "Excuse me, I hope I am not too much time.",
                    "label": 0
                },
                {
                    "sent": "5 minutes.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "It's terrible.",
                    "label": 0
                },
                {
                    "sent": "I am sorry OK, the second point was to know I know you have 5 minutes.",
                    "label": 0
                },
                {
                    "sent": "I will take them because.",
                    "label": 0
                },
                {
                    "sent": "The second thing I want to tell you, it's to explain to you what is what are the roots of the debates.",
                    "label": 0
                },
                {
                    "sent": "No, I want to tell you what do we see?",
                    "label": 0
                },
                {
                    "sent": "We see that.",
                    "label": 0
                },
                {
                    "sent": "When we look about culture hearts, we have flows that are global.",
                    "label": 0
                },
                {
                    "sent": "On flows that are local.",
                    "label": 0
                },
                {
                    "sent": "Fuck.",
                    "label": 0
                },
                {
                    "sent": "The flows that are local.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm deeply, very big over.",
                    "label": 0
                },
                {
                    "sent": "This, for example Netflix, Spotify, Amazon Live Nation definition please are over here in it's a bigger organizer over performing arts.",
                    "label": 1
                },
                {
                    "sent": "Yeah, I don't know if they're in Slovenia or not.",
                    "label": 0
                },
                {
                    "sent": "You know, these are those who have invented the pass.",
                    "label": 0
                },
                {
                    "sent": "That cost approximately 750 euro per year and you can go everywhere in the world to see their performance.",
                    "label": 0
                },
                {
                    "sent": "With this bus.",
                    "label": 0
                },
                {
                    "sent": "You know it gives you an idea of the of the way culture is working and many with young people where young people that have money naturally.",
                    "label": 0
                },
                {
                    "sent": "Always OK.",
                    "label": 0
                },
                {
                    "sent": "These cultural flows first don't believe they are so strong.",
                    "label": 0
                },
                {
                    "sent": "They are very important and Netflix is about no more than.",
                    "label": 0
                },
                {
                    "sent": "I don't remember the number exactly there.",
                    "label": 0
                },
                {
                    "sent": "More than 600 millions or something like that of a viewers, but they rammed up there, but they're very inducted like Amazon for example.",
                    "label": 0
                },
                {
                    "sent": "They are indebted.",
                    "label": 0
                },
                {
                    "sent": "They have 1 billion of debt for for Netflix.",
                    "label": 0
                },
                {
                    "sent": "Therefore it gives you an idea that it's not because you are big, that you cannot fail the famous expression too big to fail.",
                    "label": 0
                },
                {
                    "sent": "It's it's.",
                    "label": 0
                },
                {
                    "sent": "It's finished, OK?",
                    "label": 0
                },
                {
                    "sent": "And this naturally.",
                    "label": 0
                },
                {
                    "sent": "You know I could have added here.",
                    "label": 0
                },
                {
                    "sent": "I don't want to do that because it's a little controversial goodnight for example.",
                    "label": 0
                },
                {
                    "sent": "Created from cheese all over the world, more or less successful because maybe the vast majority of them have been unsuccessful, but it shows that they try to be really all over the world, OK?",
                    "label": 0
                },
                {
                    "sent": "These are the global flows.",
                    "label": 0
                },
                {
                    "sent": "OK, I am obliged to go fast, but but it's written.",
                    "label": 0
                },
                {
                    "sent": "I can send you.",
                    "label": 0
                },
                {
                    "sent": "I am richer writing the text.",
                    "label": 0
                },
                {
                    "sent": "I need it.",
                    "label": 0
                },
                {
                    "sent": "I can send it to you.",
                    "label": 0
                },
                {
                    "sent": "It's a report, OK?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In in front of these very global flows.",
                    "label": 0
                },
                {
                    "sent": "That can be interpreted as backed.",
                    "label": 0
                },
                {
                    "sent": "By the leisure activities you know, probably you make an experience when you look at Netflix.",
                    "label": 0
                },
                {
                    "sent": "But probably.",
                    "label": 0
                },
                {
                    "sent": "You you spend your leisure time.",
                    "label": 0
                },
                {
                    "sent": "On you spend more your leisure time that you make really an experience that makes you creative.",
                    "label": 0
                },
                {
                    "sent": "But it's up to everybody to do to make its own conclusion.",
                    "label": 0
                },
                {
                    "sent": "Local control flows.",
                    "label": 0
                },
                {
                    "sent": "It's the flows that are more at the local level naturally, and usually this flows are more related to the experience they try to.",
                    "label": 0
                },
                {
                    "sent": "To make people starting from an emotion having an experience connecting with the orders, creating a community on Sonos, the famous expression of the categories of the Greeks, is there its underlying.",
                    "label": 0
                },
                {
                    "sent": "We can find new, very, very modern expression.",
                    "label": 0
                },
                {
                    "sent": "But it is like that.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "The problem of these fruits?",
                    "label": 0
                },
                {
                    "sent": "Look this blowing kiss me by opposition to the first one that dies told you before it is that they are very fragile because very often they are.",
                    "label": 0
                },
                {
                    "sent": "Undertaken by.",
                    "label": 0
                },
                {
                    "sent": "Vast majority of small enterprise.",
                    "label": 0
                },
                {
                    "sent": "If I have time, I can give you the precise that.",
                    "label": 0
                },
                {
                    "sent": "And these are small enterprise.",
                    "label": 0
                },
                {
                    "sent": "We see that.",
                    "label": 0
                },
                {
                    "sent": "They are very turbulent.",
                    "label": 0
                },
                {
                    "sent": "It means that the happy for one project and sometimes they disappear as soon as the project is done.",
                    "label": 0
                },
                {
                    "sent": "Sometimes they can do, from they can go from one to two to three projects.",
                    "label": 0
                },
                {
                    "sent": "It may happen, but the proportion is very low is very low.",
                    "label": 0
                },
                {
                    "sent": "In the within time and we can explain that they should OK. Unnaturally these tubulin's.",
                    "label": 0
                },
                {
                    "sent": "Of the small good show on enterprise.",
                    "label": 0
                },
                {
                    "sent": "Create a turbulence for the artist.",
                    "label": 0
                },
                {
                    "sent": "This is not new because you know that the 19th century we were speaking about the Bohemians about the romantic, which was not very very good because at that time the romantic on the Bohemians were coming by from family that very often at some resource is there for your vision.",
                    "label": 0
                },
                {
                    "sent": "If you are necessary of us, you know that probably much better than me, but but today we know that they are usually under regulated and we're very precise.",
                    "label": 0
                },
                {
                    "sent": "Statistics at the warm level.",
                    "label": 0
                },
                {
                    "sent": "We know that in average the artist of the performing arts, but they just this one.",
                    "label": 0
                },
                {
                    "sent": "The visual artist is very difficult to the visibility of the visual artists.",
                    "label": 0
                },
                {
                    "sent": "It's much more difficult to do.",
                    "label": 0
                },
                {
                    "sent": "But for the performing arts, because they're in enterprise, they are paid 80% of the average remuneration in their respective countries.",
                    "label": 0
                },
                {
                    "sent": "We do that very easily with AI taken art is that as many as three years of study I take.",
                    "label": 0
                },
                {
                    "sent": "I don't know an economy that meant three years of studies and they compile the weights 10 years after on AC 20s as well.",
                    "label": 0
                },
                {
                    "sent": "So just so he could make cooking, don't worry about that.",
                    "label": 0
                },
                {
                    "sent": "It's it's not so difficult.",
                    "label": 0
                },
                {
                    "sent": "Today we see that in fact the situation of many artists is not so bad.",
                    "label": 0
                },
                {
                    "sent": "Unless for the dancers that answer to get us through for them because they have the ID face that I use risk.",
                    "label": 0
                },
                {
                    "sent": "Physical risk, low demand and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "But why is this situation relatively better?",
                    "label": 0
                },
                {
                    "sent": "Becausw becausw?",
                    "label": 0
                },
                {
                    "sent": "I spoke able to use of the artist in the schools in the hospitals, in the human design and everywhere therefore.",
                    "label": 0
                },
                {
                    "sent": "Some if I can speak like that.",
                    "label": 0
                },
                {
                    "sent": "Maybe you will not like this expression.",
                    "label": 0
                },
                {
                    "sent": "Some new markets appear for them.",
                    "label": 0
                },
                {
                    "sent": "Some new markets appear for them, which would create the problem because they can say that we are instrumentalized.",
                    "label": 0
                },
                {
                    "sent": "We are no more musician, but we are a social worker in the hospital that playing music to reduce the stress of the children, which is very well socially, but with artistically.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's not very interesting for me.",
                    "label": 0
                },
                {
                    "sent": "It's so kind of debate that we have everywhere right now in the world.",
                    "label": 0
                },
                {
                    "sent": "But I have to tell you something that even if their remuneration is relatively better than it used to be, maybe 40 or 50 years ago.",
                    "label": 0
                },
                {
                    "sent": "Their access to the social services on the pensions is still very, very bad.",
                    "label": 0
                },
                {
                    "sent": "He still very, very bad.",
                    "label": 0
                },
                {
                    "sent": "The fact that they're underpaid is no more.",
                    "label": 0
                },
                {
                    "sent": "The most horrible encrypted area and the access to social service onto pension is meant to serve.",
                    "label": 0
                },
                {
                    "sent": "I come to this server, therefore I do.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Speaking about the museum OK?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What they would like to tell you is it when we try to understand.",
                    "label": 0
                },
                {
                    "sent": "Who we can have Assistant able artistic ecosystem?",
                    "label": 0
                },
                {
                    "sent": "We have to care about 1C.",
                    "label": 0
                },
                {
                    "sent": "More and more people are.",
                    "label": 0
                },
                {
                    "sent": "Accessing to the global flows.",
                    "label": 0
                },
                {
                    "sent": "More and more local flows are franchised.",
                    "label": 0
                },
                {
                    "sent": "If we, but if the financial resources.",
                    "label": 0
                },
                {
                    "sent": "Reg they do global level.",
                    "label": 0
                },
                {
                    "sent": "The skills the tenants, the references are produced by the local River, then we have to connect.",
                    "label": 0
                },
                {
                    "sent": "Both on or can we connect both with where to connect these both types of loader global under record?",
                    "label": 0
                },
                {
                    "sent": "By making creative place.",
                    "label": 0
                },
                {
                    "sent": "Vaporizing local flavors.",
                    "label": 0
                },
                {
                    "sent": "Biclustering, intrinsic and instrumental benefits on by considering governments as brokers.",
                    "label": 1
                },
                {
                    "sent": "Here I am four slides, but I have no time to make this light.",
                    "label": 0
                },
                {
                    "sent": "I will just take maybe the two first one.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or do you see this one?",
                    "label": 0
                },
                {
                    "sent": "OK, the expression making creative place.",
                    "label": 0
                },
                {
                    "sent": "I have to tell you it's a very famous expression.",
                    "label": 0
                },
                {
                    "sent": "No, it has been invented in two 12 by the National Endowment for Arts in the US.",
                    "label": 0
                },
                {
                    "sent": "And it means that.",
                    "label": 0
                },
                {
                    "sent": "If we really want to to potential eyes.",
                    "label": 0
                },
                {
                    "sent": "The effect of the heart.",
                    "label": 0
                },
                {
                    "sent": "Not only for the market, but for the development which is different.",
                    "label": 0
                },
                {
                    "sent": "It means further for the for the quality of life, for the for everything.",
                    "label": 0
                },
                {
                    "sent": "We have absolutely.",
                    "label": 0
                },
                {
                    "sent": "To make.",
                    "label": 0
                },
                {
                    "sent": "If each territory created it, can can be a city can be Metro police.",
                    "label": 0
                },
                {
                    "sent": "It can be a rural area.",
                    "label": 0
                },
                {
                    "sent": "OK, on Mexico City creative.",
                    "label": 0
                },
                {
                    "sent": "It's not only Mexico City attractive.",
                    "label": 0
                },
                {
                    "sent": "Because make a city attractive it so need to attract the famous people that are better, more that are.",
                    "label": 0
                },
                {
                    "sent": "Well, when we speak honestly when we speak about the attractivity of the city, we speak about the very well educated people, the people who say that don't speak about the immigrants and it has to be clear, OK?",
                    "label": 0
                },
                {
                    "sent": "But we have not only to marketing the city where we need to engage the local people around the artistic project.",
                    "label": 0
                },
                {
                    "sent": "On to make them cross the references they can a from the global flows with the experience that in an F with the local flows OK. After I put a lot of things I just want to give you another small example.",
                    "label": 0
                },
                {
                    "sent": "The issue of festival because it's a very important trend in Europe we have a lot of festivals in Europe I don't speak pretty stable.",
                    "label": 1
                },
                {
                    "sent": "So vinyon Leslie I don't know enough to speak about.",
                    "label": 0
                },
                {
                    "sent": "Who do you have at the football game if you want but not not disrespect?",
                    "label": 0
                },
                {
                    "sent": "And when we look at the festival, we know that.",
                    "label": 0
                },
                {
                    "sent": "The festival were very, very brilliant at the time and attract a lot of visitors.",
                    "label": 0
                },
                {
                    "sent": "But it was a problem on the conflict with the local people because sometimes the local visitor did not benefit from the festival.",
                    "label": 0
                },
                {
                    "sent": "Then what we try to do and you have a lot of examples for that.",
                    "label": 0
                },
                {
                    "sent": "It is to say to the organizer of the official.",
                    "label": 0
                },
                {
                    "sent": "OK, you are there.",
                    "label": 0
                },
                {
                    "sent": "You come every year which maybe we subsidize you.",
                    "label": 0
                },
                {
                    "sent": "But you are going to organize permanent activities all along the year.",
                    "label": 0
                },
                {
                    "sent": "I know City in Europe for example.",
                    "label": 0
                },
                {
                    "sent": "Where to start with the Festival of Music three weeks or year or no.",
                    "label": 0
                },
                {
                    "sent": "You have schools of music all along the year.",
                    "label": 0
                },
                {
                    "sent": "Workshop of music.",
                    "label": 0
                },
                {
                    "sent": "On even enterprise, that fabric manufacturer in music instruments and the last .4, maybe I will not go further.",
                    "label": 0
                },
                {
                    "sent": "It is what we call creative tourism.",
                    "label": 0
                },
                {
                    "sent": "Here I just want 'cause I didn't speak too much about Turin, but I know that for many people it is the Alpha and Omega maybe not sure activities.",
                    "label": 0
                },
                {
                    "sent": "When we speak about creative treatment, women, women that we stress that there exist some tourists that want to not only to visit monuments, but really to connect with the people on live with the local people on this exchange.",
                    "label": 0
                },
                {
                    "sent": "Naturally between local residents and.",
                    "label": 0
                },
                {
                    "sent": "Outward people innocence can be very useful to becausw even if we are obliged to organize the.",
                    "label": 0
                },
                {
                    "sent": "Cultural policy at the local level and with the local government.",
                    "label": 0
                },
                {
                    "sent": "It has not actually to be across policy.",
                    "label": 0
                },
                {
                    "sent": "That would be a terrible then I have other slides but I will stop there.",
                    "label": 0
                },
                {
                    "sent": "It's.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Because the on the next.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Next, when they speak about wine, but I'm sorry it's it's OK.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your attention, because I believe that that I have to sort.",
                    "label": 0
                },
                {
                    "sent": "Maybe because you showed us also with all these informations that are behind our complex, is the actually the field going through the history of cultural economics?",
                    "label": 0
                },
                {
                    "sent": "How it started at the beginning and how complex it is at the moment in the sense that we have received also for me also new informations.",
                    "label": 0
                },
                {
                    "sent": "Or now the shift was between the beginning.",
                    "label": 0
                },
                {
                    "sent": "I mean our artists were actually promoted in the market.",
                    "label": 0
                },
                {
                    "sent": "And now it's the shift is going through.",
                    "label": 0
                },
                {
                    "sent": "Through Education 1st and then creativity.",
                    "label": 0
                },
                {
                    "sent": "So before I of course I have questions myself.",
                    "label": 0
                },
                {
                    "sent": "I do know somebody from the crowd is interested to make any question to Professor graph, some deepening's or.",
                    "label": 0
                },
                {
                    "sent": "Some other specific topics.",
                    "label": 0
                },
                {
                    "sent": "Concerning the fact that.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so you distinguish the different kind of creativity.",
                    "label": 0
                },
                {
                    "sent": "So I mean to flux of economy related to creativity is one that comes from outside.",
                    "label": 0
                },
                {
                    "sent": "So we can, I don't know, say tourism.",
                    "label": 0
                },
                {
                    "sent": "They had to simplify and wonders internal that is able to create better.",
                    "label": 0
                },
                {
                    "sent": "Human qualities in one community for which that community can be more productive somehow at the end.",
                    "label": 0
                },
                {
                    "sent": "So it's quite easy probably to quantify the fluxes of tourists, but there are there any instruments to understand how investment in internal.",
                    "label": 0
                },
                {
                    "sent": "So you called probably instrumental benefits.",
                    "label": 0
                },
                {
                    "sent": "If I remember the term.",
                    "label": 0
                },
                {
                    "sent": "So are there any?",
                    "label": 0
                },
                {
                    "sent": "Possibility to measure how investment in this kind of development can really.",
                    "label": 0
                },
                {
                    "sent": "Yeah, evaluated and so to see if that kind of message was meaningful or not to create conditions for internal development of that communities.",
                    "label": 0
                },
                {
                    "sent": "Yes, yes.",
                    "label": 0
                },
                {
                    "sent": "These types of measures exist.",
                    "label": 0
                },
                {
                    "sent": "You see the need a lot under the European Union too, but it is very difficult.",
                    "label": 0
                },
                {
                    "sent": "Because it's very easy to see.",
                    "label": 0
                },
                {
                    "sent": "For example, you take the young ones that go 2 hours a week in the workshop in the museum.",
                    "label": 0
                },
                {
                    "sent": "On those who don't go on, you can see at the end of the year if there is a different issue there in the results.",
                    "label": 0
                },
                {
                    "sent": "Or Windows skills of the same for those things, But the problem is very often that.",
                    "label": 0
                },
                {
                    "sent": "That is not the only factor.",
                    "label": 0
                },
                {
                    "sent": "Let me drive to this result.",
                    "label": 0
                },
                {
                    "sent": "You can say OK, I have benefits.",
                    "label": 0
                },
                {
                    "sent": "At the end the level of the skills as increased.",
                    "label": 0
                },
                {
                    "sent": "Or maybe the rest of the people with Alsheimer will be lower at the age of 70 or 75, or things like that.",
                    "label": 0
                },
                {
                    "sent": "But after to say that it is exactly the result of a specific relationship.",
                    "label": 0
                },
                {
                    "sent": "Between the artistic activity.",
                    "label": 0
                },
                {
                    "sent": "On the earth or the educational result it's more difficult, but it exists, it exists.",
                    "label": 0
                },
                {
                    "sent": "We will be kind of major, but I have to say that it is very difficult.",
                    "label": 0
                },
                {
                    "sent": "But it exists in the literature, mainly DCDS under load, because on the you know they did a lot of comparison.",
                    "label": 0
                },
                {
                    "sent": "I don't know if Slovenia was inside or not.",
                    "label": 0
                },
                {
                    "sent": "Compilation on the performance of the educational system on the try to.",
                    "label": 0
                },
                {
                    "sent": "SS.",
                    "label": 0
                },
                {
                    "sent": "The effect of those who follow artistic activities.",
                    "label": 0
                },
                {
                    "sent": "By opposition to those who don't follow artistic activity.",
                    "label": 0
                },
                {
                    "sent": "But after the program is to know what is the rule.",
                    "label": 0
                },
                {
                    "sent": "For example, we know that those who go further, just.",
                    "label": 0
                },
                {
                    "sent": "We know that those who follow artistic activities as better result.",
                    "label": 0
                },
                {
                    "sent": "But after we know too, that those who follow artistic activities come sometimes from family that have a bit very strong artistic background.",
                    "label": 0
                },
                {
                    "sent": "Therefore we can see what is the determining factor.",
                    "label": 0
                },
                {
                    "sent": "Is it the background of the family or is it the time spent in the artistic workshop?",
                    "label": 0
                },
                {
                    "sent": "I have a customer question.",
                    "label": 0
                },
                {
                    "sent": "I'm pretty interested in that.",
                    "label": 0
                },
                {
                    "sent": "So you said that there is a shift.",
                    "label": 0
                },
                {
                    "sent": "There was a shift actually from from importance of arts and now the importance of creativity instead.",
                    "label": 0
                },
                {
                    "sent": "And this is through education and in the in your.",
                    "label": 0
                },
                {
                    "sent": "In your speech you would also mention in several times that.",
                    "label": 0
                },
                {
                    "sent": "I mean, these creative process in Asia at the moment is quite clear, much more than in other countries and I've read that the the the scale of for example, the educational systems in some countries like Korea and China is higher because they are they have introduced.",
                    "label": 0
                },
                {
                    "sent": "Creative process is inside the schools.",
                    "label": 0
                },
                {
                    "sent": "Is this the reason?",
                    "label": 0
                },
                {
                    "sent": "I it's difficult.",
                    "label": 0
                },
                {
                    "sent": "First I want to maybe to correct an impression.",
                    "label": 0
                },
                {
                    "sent": "I have no time, therefore I took the example of education, but I can take another example.",
                    "label": 0
                },
                {
                    "sent": "I can take the example of prisons and prisoners.",
                    "label": 0
                },
                {
                    "sent": "For example.",
                    "label": 0
                },
                {
                    "sent": "We know that it's what we do in my country for the big museum.",
                    "label": 0
                },
                {
                    "sent": "We know that when some prisoner entering the prison, we must assume thing.",
                    "label": 0
                },
                {
                    "sent": "To the time they will go out.",
                    "label": 0
                },
                {
                    "sent": "Maybe five years after, 10 years after on Wednesday, we have no more family or no more really socially something like that.",
                    "label": 0
                },
                {
                    "sent": "Therefore we use the artistic activities, many literature on growing.",
                    "label": 0
                },
                {
                    "sent": "So I have to say if I go into music, sometimes that it's more difficult already.",
                    "label": 0
                },
                {
                    "sent": "You use these artistic activities to maintain a kind of self confidence.",
                    "label": 0
                },
                {
                    "sent": "Of people in themselves.",
                    "label": 0
                },
                {
                    "sent": "In order that it will not give them a job when you dig out, well, maybe I don't know, but not.",
                    "label": 0
                },
                {
                    "sent": "It's not very frequent, but it happens, it happens.",
                    "label": 0
                },
                {
                    "sent": "But these to show to you that the instrumental what we could do instrumental dimension is not only an education, it may be on hospitals, it may be on search of employment job search for example, for the people that are unemployed on mainly the long term in employing people.",
                    "label": 0
                },
                {
                    "sent": "On it maybe like prison before for you for your answer.",
                    "label": 0
                },
                {
                    "sent": "I did not understand the Asian the Asian.",
                    "label": 0
                },
                {
                    "sent": "Is that they are much more aware on this creative process than in other countries.",
                    "label": 0
                },
                {
                    "sent": "And but there is a problem in.",
                    "label": 0
                },
                {
                    "sent": "China, not only in China, in Asia it is that maybe you know that the world Arts did not exist in the Asian languages and for example in the in Japan the World Arts as appeared after the Meiji Revolution.",
                    "label": 0
                },
                {
                    "sent": "Only when there was the opening of the country, because the arts were totally integrated in the current life.",
                    "label": 0
                },
                {
                    "sent": "Totally integrated.",
                    "label": 0
                },
                {
                    "sent": "On this explained the the I didn't speak about craft, it is on the slides.",
                    "label": 0
                },
                {
                    "sent": "You will find them through an Internet but this explains alot of things.",
                    "label": 0
                },
                {
                    "sent": "OK therefore they have always had more integrated vision.",
                    "label": 0
                },
                {
                    "sent": "I should've arbiter of the artistic activities in connection with education.",
                    "label": 0
                },
                {
                    "sent": "Would they have not be system?",
                    "label": 0
                },
                {
                    "sent": "I cannot speak even for Slovenia, but I can speak for little more for Italy and much more for France or Spain.",
                    "label": 0
                },
                {
                    "sent": "And you got when we have infect the retailer of the Romanticism innocence we've created the system of arts.",
                    "label": 0
                },
                {
                    "sent": "That was no more the system that was existing before the 19th century.",
                    "label": 0
                },
                {
                    "sent": "In a sense, it was a progressive creation, but we design a very strong, very strong.",
                    "label": 0
                },
                {
                    "sent": "It was fragile, but very formal system of us.",
                    "label": 0
                },
                {
                    "sent": "We schools with academies with national institution and so on and so forth, and naturally.",
                    "label": 0
                },
                {
                    "sent": "I don't see that.",
                    "label": 0
                },
                {
                    "sent": "Yeah these were pre Peiser notices them because they have no date.",
                    "label": 0
                },
                {
                    "sent": "It would be so stupid but the view was focused on that system on what changed.",
                    "label": 0
                },
                {
                    "sent": "In the European countries, this is the fact that we consider that no, we have no reason to consider the arts belong only to one sector as to be produced only in the same place and delivered in the same places.",
                    "label": 0
                },
                {
                    "sent": "But I think that you write in urgent this there was not the same, but imagine they were certain me.",
                    "label": 0
                },
                {
                    "sent": "Another thing that we get is a difference of words between the people too.",
                    "label": 0
                },
                {
                    "sent": "I ask one question, then and then I will give you the yes.",
                    "label": 0
                },
                {
                    "sent": "The current economic crisis actually calls for radical rethinking of the role of economy and social Sciences.",
                    "label": 0
                },
                {
                    "sent": "They were actually blamed that they have social Sciences and economy have elaborated very complex answers, wrong questions.",
                    "label": 0
                },
                {
                    "sent": "So when the question is wrong, there is a disastrous consequences for the stakeholders.",
                    "label": 0
                },
                {
                    "sent": "So is economy as a science rethinking its fundamentals?",
                    "label": 0
                },
                {
                    "sent": "And how is changing?",
                    "label": 0
                },
                {
                    "sent": "OK yeah.",
                    "label": 0
                },
                {
                    "sent": "What is the future role of economics?",
                    "label": 0
                },
                {
                    "sent": "Big question.",
                    "label": 0
                },
                {
                    "sent": "No, I just answered through the end of the question because the beginning of a discussion that you write an.",
                    "label": 0
                },
                {
                    "sent": "When we summarize economics by saying and This is why I started by by the 1st remark.",
                    "label": 0
                },
                {
                    "sent": "As the science it it could be said that.",
                    "label": 0
                },
                {
                    "sent": "I would not say that, but it could be said that economic is only but the science of the market.",
                    "label": 0
                },
                {
                    "sent": "On you would not be wrong by saying that.",
                    "label": 0
                },
                {
                    "sent": "It was not exactly that at the beginning, economics was the science of the development.",
                    "label": 0
                },
                {
                    "sent": "Because the main question that we had in the 18th century was the starting point, it was.",
                    "label": 0
                },
                {
                    "sent": "Why does Netherland develop on England does not develop.",
                    "label": 0
                },
                {
                    "sent": "It was like that that start the first big treaties of the modern economy.",
                    "label": 0
                },
                {
                    "sent": "And it was a reflection about them, the development.",
                    "label": 0
                },
                {
                    "sent": "But the problem is that we focused on the market.",
                    "label": 0
                },
                {
                    "sent": "Which may be a solution.",
                    "label": 0
                },
                {
                    "sent": "But we know too that the market.",
                    "label": 0
                },
                {
                    "sent": "Brings very important solution on create very significant problems and probably.",
                    "label": 0
                },
                {
                    "sent": "The economic science.",
                    "label": 0
                },
                {
                    "sent": "As more concentrated on the 1st aspect.",
                    "label": 0
                },
                {
                    "sent": "Then on the second one.",
                    "label": 0
                },
                {
                    "sent": "We try not to read what we called the market failures, but even the term of market figures, it means that our scope is the market.",
                    "label": 0
                },
                {
                    "sent": "I think that you right.",
                    "label": 0
                },
                {
                    "sent": "We should have a much wider view on come back, maybe to a debate in the 18 on the beginning of the 19th century, economics was not different from politics and philosophy on the first big book of economics where philosophical books.",
                    "label": 0
                },
                {
                    "sent": "Therefore it was, it was very we should come back.",
                    "label": 0
                },
                {
                    "sent": "More on that.",
                    "label": 0
                },
                {
                    "sent": "What makes those things difficult today?",
                    "label": 0
                },
                {
                    "sent": "I think it's it's.",
                    "label": 0
                },
                {
                    "sent": "It's first the fact that the economies don't take enough this way.",
                    "label": 0
                },
                {
                    "sent": "On the second point is that many.",
                    "label": 0
                },
                {
                    "sent": "Contestation of economics.",
                    "label": 0
                },
                {
                    "sent": "See.",
                    "label": 0
                },
                {
                    "sent": "Every all the difficulty come from the market there is no any advantage in a sense.",
                    "label": 0
                },
                {
                    "sent": "And this is a little dirty, but that we have.",
                    "label": 0
                },
                {
                    "sent": "A critique of the new liberalism into this is that if you say market your new liberal and neoliberal, you are bad.",
                    "label": 0
                },
                {
                    "sent": "But which is maybe true, so it's up to you.",
                    "label": 0
                },
                {
                    "sent": "It's a political judgment after, but you can very well say, OK, I want to see, oh, the system can create a development what we used to call the expression is disappearing.",
                    "label": 0
                },
                {
                    "sent": "It's disappearing in scripture only by the ecology, but it is appearing.",
                    "label": 0
                },
                {
                    "sent": "What is a sustainable economy on then to see what should be the fabric of the regulation inside.",
                    "label": 0
                },
                {
                    "sent": "But the question should be open.",
                    "label": 0
                },
                {
                    "sent": "Another question, if I am I getting you right that actually the problem between GDP and the contribution of culture to the GDP could be also just the problem of definition of the GDP.",
                    "label": 0
                },
                {
                    "sent": "Should we go for maybe rather for the for an alternative dash definition like fitoussi, Amartya Sen or Gross National Happiness?",
                    "label": 0
                },
                {
                    "sent": "You can see that you you took the right is 239, but the problem is that it is still the only system that is operating because you know there is 1 country you know the boot on families boot and they invented this accounting and they suppress it last year or two years ago.",
                    "label": 0
                },
                {
                    "sent": "And then it was a. Happiness nation.",
                    "label": 0
                },
                {
                    "sent": "Girl yes.",
                    "label": 0
                },
                {
                    "sent": "National penis that we come back exactly at the point of aesthetics and economix.",
                    "label": 0
                },
                {
                    "sent": "You know it's very difficult to, but it's a good way.",
                    "label": 0
                },
                {
                    "sent": "But it is very difficult to make enter benefit appear everywhere in the center.",
                    "label": 0
                },
                {
                    "sent": "In the same system of assessment, the best would be to need.",
                    "label": 0
                },
                {
                    "sent": "Probably the GDP is not a very significant.",
                    "label": 0
                },
                {
                    "sent": "Indicator.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I would agree on that data.",
                    "label": 0
                },
                {
                    "sent": "Not a very significant and you know what is the use of the GDP in Europe?",
                    "label": 0
                },
                {
                    "sent": "Do you know if you respect the Treaty of Mr. Donut?",
                    "label": 0
                },
                {
                    "sent": "Only you you see the GD after you have classification.",
                    "label": 0
                },
                {
                    "sent": "With this classification you know you can make China is bigger than it's just gone.",
                    "label": 0
                },
                {
                    "sent": "Nation of the world and in 10 years it will be before US and you can say that.",
                    "label": 0
                },
                {
                    "sent": "But this is not so interesting.",
                    "label": 0
                },
                {
                    "sent": "We know that we know that the economic power is fantastic.",
                    "label": 0
                },
                {
                    "sent": "But they are you right?",
                    "label": 0
                },
                {
                    "sent": "Other questions.",
                    "label": 0
                },
                {
                    "sent": "Session.",
                    "label": 0
                },
                {
                    "sent": "No, it's not the slider, but it's it's there.",
                    "label": 0
                },
                {
                    "sent": "It's there, it's there.",
                    "label": 0
                },
                {
                    "sent": "No, I I said the problem is that when we try to connect the global on the local flows, you have natural need to give a very strong flavor to the local flow.",
                    "label": 0
                },
                {
                    "sent": "Undo it to come back to what was said before in the sense you have really to see.",
                    "label": 0
                },
                {
                    "sent": "What are the resources?",
                    "label": 0
                },
                {
                    "sent": "That can give you an identity.",
                    "label": 0
                },
                {
                    "sent": "But an identity not to say I am the best or wherever I am better than the neighbor or so, but an identity to make the local people convert innocence, cooperate, and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "Therefore, I use 2 words, the word terroir.",
                    "label": 0
                },
                {
                    "sent": "It's a French word, but it is using English.",
                    "label": 0
                },
                {
                    "sent": "I am sorry, therefore I use it here.",
                    "label": 0
                },
                {
                    "sent": "Which is because it's very significant that there were.",
                    "label": 0
                },
                {
                    "sent": "It's really the type of land that produced the that gives a specific wine.",
                    "label": 0
                },
                {
                    "sent": "Therefore it's when we sit there, one we if there isn't there right now that there is a specific city in a sense on the iPad after the 20 vernacular rated landscape, music, crafts and gastronomy because.",
                    "label": 0
                },
                {
                    "sent": "Very often we speak with an accurate that only in terms of architecture which is not more totally number, but you have the order of the natural resources and you have to take them.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I had no time but I wanted to show you that here you have to consider that everything is not the point of arrival, but the point of departure.",
                    "label": 0
                },
                {
                    "sent": "On that in this point on the voucher you have no more to make the distinction between tangible and intangible.",
                    "label": 0
                },
                {
                    "sent": "This is a very the UNESCO is created is exacerbated.",
                    "label": 0
                },
                {
                    "sent": "This distinction.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "They tried to.",
                    "label": 0
                },
                {
                    "sent": "Do upset desert attention, but I think that everything is a game between.",
                    "label": 0
                },
                {
                    "sent": "Tangible and intangible.",
                    "label": 0
                },
                {
                    "sent": "They both recently, but with the wines.",
                    "label": 0
                },
                {
                    "sent": "Isn't that?",
                    "label": 0
                },
                {
                    "sent": "So thank you very much for this introductory, let's say lecture to economic culture, economics so.",
                    "label": 0
                }
            ]
        }
    }
}