{
    "id": "73rtjzoohtof5d3kz43d5pq3aggznjv7",
    "title": "Archive in Fine Arts and Literature",
    "info": {
        "presenter": [
            "Aleš Vaupotič, University of Nova Gorica"
        ],
        "published": "July 13, 2018",
        "recorded": "July 2018",
        "category": [
            "Top->Social Sciences->Education",
            "Top->Technology",
            "Top->Computers->Digital Media"
        ]
    },
    "url": "http://videolectures.net/educationdesign2018_vaupotic_fine_arts/",
    "segmentation": [
        [
            "OK, so thank you for.",
            "Give me a place to speak here so my project is the archive in Fine Arts and literature.",
            "Let me introduce myself first.",
            "I am a professor of literature at the School of Humanities here at the University of Margarita and my most recent project is to develop program study program in digital humanities, which is an interdisciplinary program.",
            "And of course it involves the use of new media in culture and in the humanities, and this was basically the main reason that I started to be.",
            "Interested in the.",
            "Demetric program one open education.",
            "Because this is one of the key issues that.",
            "Is also very problematic and at the same time interesting for me.",
            "So in what way does do the humanities changed?",
            "And also how do the?",
            "Information exchange.",
            "How is it transformed by the new media and of course education is something in the middle of all this.",
            "Let me tell you something about my background.",
            "Apart from being a literary scholar, I was a freelance new media artist for many years, so I'm also interested in developing the communication technologies, experimenting with new media and so on.",
            "So I must say I was quite lucky with my.",
            "Open minded mentors because I wanted to question the way.",
            "Open.",
            "Elearning course is developed so.",
            "As a background, the title, archiving, Fine Arts, and literature.",
            "This is a course that I developed for the Masters program in Digital Humanities, but I wanted to explore in what way I could take a course from the normal University curriculum.",
            "Into an open environment."
        ],
        [
            "So my presentation will go through this three steps."
        ],
        [
            "And basically first is I want to work on a PhD level course, which means that I want my students and the people taking part in this course to read original research text.",
            "So basically I do not want to prepare explanations of different authors, but I the idea is here to learn the students how to actually.",
            "Of course, read and of course critically evaluate what they read in books, but also on the."
        ],
        [
            "In it.",
            "So.",
            "For this reason, what I want to focus on is an idea of."
        ],
        [
            "I think an E learning community.",
            "So in the call for the mentoring program.",
            "There were the words that I found the most interesting is supposed to open E learning course and also that it is that we're really invited to.",
            "Apply with."
        ],
        [
            "The courses in different languages.",
            "I think this is a really important issue.",
            "For humanities, it is completely unacceptable for everything to like.",
            "Just shift from local languages to English.",
            "Basically, I think that language is such an important defining moment in human that actually I am really skeptical about doing PhD in foreign languages if there are no specific circumstances involved, maybe hear a specific focus is also my.",
            "Study domain literature because in literature basically it is really difficult to get a feeling for a foreign language on the same language, same level as a mother tongue where you basically understand the nuances of meaning.",
            "Of course, as a literary scholar, I'm a comparative literature style student.",
            "So basically I do not believe in national literature, so that's the defining moment of comparative literature.",
            "So basically, I also do not suggest the return to the National History, of course."
        ],
        [
            "So.",
            "Here basically what was for me starting point is basically a learning course in my idea and I was a teacher for.",
            "Like yeah before come even to the this University.",
            "Many years, and basically a course for me it would be a process that I went through with the students.",
            "And so for me I was in the sense surprise that.",
            "I would not think of myself of somebody I didn't think about making a resource which is in a sense a possibility, sort of material that can be reused.",
            "What I wanted basically is to establish interaction and from this interaction basically to judge this interaction only by the results.",
            "Basically what my students achieve.",
            "So if my students are successful then basically I have.",
            "Told them something, so of course I think this is really an important thing to think.",
            "Distinguishes wise, of course, that we can produce open educational resource.",
            "It is a problem on the PhD level, of course, because they're supposed to study original scientific articles, so I think.",
            "Yeah, I don't.",
            "I couldn't see myself doing extra.",
            "Explanatory material.",
            "So another thing, another term that I would like to explain is basically the question about the notions of open and free.",
            "This comes from experience because I was presenting European project and the head of the.",
            "In your language Institute from Ljubljana asked me when I just presenting this project.",
            "If when I was saying that we have this open archive of literary receptions, if it is really open, or whether it is free.",
            "So I was presenting database of the receptions of women writers in throughout European literature, literary systems.",
            "So basically you would have information of.",
            "Who read, who were, and The thing is that so it was a database in the background, whereas our project was of course to transform this database into virtual research environment.",
            "So basically it was an environment where this.",
            "Actually facilitate the compilation of this database so the database was not fixed.",
            "It was not the publication of a corpus, but a tool to develop the database.",
            "So I was I was using the term yet basically our virtual research environment is an open platform, but for this professor he was of course really important in the dictionary making for this live in like the standard living language and also others.",
            "For that for him, like the open, would refer like to the open software.",
            "So basically you can actually take all the content and download it to your computer and then you analyze the whole corpus.",
            "Whereas in our case this was not in our little research environment, this was obviously not the case.",
            "You could not download the whole database that we have collected, so of course it was free to use in a sense that is free to use in as Google is free to use.",
            "Of course you don't have the access to the database is in the background, so yeah, but.",
            "On another level, of course, our virtual research environment software was open source.",
            "So I was actually right to use the term open, but of course.",
            "The extra content was just free to use.",
            "So basically, what is another aspect that I want to emphasize is here.",
            "Of course, the difference between the course and the material, and so if you can imagine recorded lecture by a professor at the University and so on.",
            "Basically, you are actually.",
            "This is the standard that you need to like.",
            "Get to this level.",
            "Of course live you have to capture students imagination, but when you do a video recording of stand up, for instance in this case stand up performance.",
            "It's a film, so the competence is that the professor has a good professor that can teach.",
            "Are basically never the same as a film Director TV director who can actually provide a captivating.",
            "Like the Stand up special as you have them so the same is like jazz performance in where you improvise.",
            "Or this was one of my school friends painter.",
            "He was a photorealist painter and when he was told he destroyed all his paint believes not always actually.",
            "Yep.",
            "Basically, at certain point he transformed all of his paintings into video performances, so we have to distinguish these two levels.",
            "Basically the actual interaction between people and actually the statement the.",
            "Video textbook I don't know."
        ],
        [
            "Something like that.",
            "So what I propose is.",
            "Start thinking about developing the course.",
            "What would be the reference?",
            "And for me the important reference and like big.",
            "Archive of possible examples is the in 2004 they started.",
            "At the arse Elektronika festival in Linz, they started the category in the competition for the Golden Nikka Nice.",
            "The digital humanities in the first winner was Wikipedia, and this year's winner was Bellingcat.",
            "So this is what I took from the website.",
            "Basically what you have here, it uses open source and social media investigation too.",
            "Actually explore different.",
            "I don't know Mexican drug Lords and so on.",
            "Basically and this.",
            "Online platform obviously brings together a community, but what was important always important in when they defined the digital communities category and drought is basically that's what you want to achieve.",
            "What is the result here is not like software, just I don't know.",
            "Interactive system, but what you want to actually develop is new community and this community.",
            "This is one of the criteria for this category is that it has to last.",
            "And of course, as we can see, Wikipedia lasted.",
            "So if you recall, those that recall wiki software used to be initially software actually added the code of the web page.",
            "And of course the first thing that you could do is to delete how code.",
            "Of the website, so we would have it anymore.",
            "Wikipedia, Wikimedia software, of course, introduced them history of the changes, and Additionally, of course the different levels of editing, which of course facilitated the growth.",
            "So what we have here is not just basically, there was a possibility of course, to open to make it like available to anybody to change the appearance of a website.",
            "But of course you would have to.",
            "Find some way to provide Español shit in his theory of cybertext would say the netiquette.",
            "So basically the rules of how you behave in this.",
            "Community in the SoC.",
            "Micro society."
        ],
        [
            "So.",
            "Basically, if we want to develop.",
            "Yeah, OK.",
            "The.",
            "This community of learning basically working on different aspects in the field or in one of the aspects that this course deals with.",
            "Of course you have to somehow.",
            "Manage the intensity of effort that people have actually put into their work.",
            "So if you have students, if they don't read the text that you have given them to read.",
            "Basically you cannot do anything is interactively in the classroom, so there's a measurement of activity of the users.",
            "This is used in many such solutions for digital communities.",
            "Of course, the rating is also another aspect."
        ],
        [
            "So.",
            "Again, how to another aspect?",
            "That's very important.",
            "Of course you have to have some sort of infrastructure teleconferencing.",
            "Of course model with additional functionality, of course, but there's another issue involved.",
            "I remember when I was a freelance artist and I was teaching at the.",
            "School of design.",
            "Of course, you know my.",
            "Head of the partner would want to take my.",
            "Teaching materials I will be paid by the hour and then they would take take my teaching material.",
            "So this is quite an important issue that has to be taken into account in what way a teacher is reimbursed and the other.",
            "On the other hand, of course the collaboration between students and all other aspects are of course really important."
        ],
        [
            "So this is the website that I prepared.",
            "I'm used Vicki versity.",
            "Website I'm using this for all my courses and the reason for that is that I don't need to do any introduction to the students that everybody knows how to use it, so actually it makes it much easier for me to progress."
        ],
        [
            "And now how I wanted to structure this course.",
            "I wanted to do a certain automatic accents and I called the research questions so around which I would develop modules."
        ],
        [
            "And so here are different questions, and I've worked only on the first one.",
            "What are the batch of using for Quinn?",
            "We call methodology.",
            "So basically do we is are the works by Michel Foucault still relevant in the.",
            "Contemporary humanities, so this is a question that is not only that I think could be relevant to literary history or history.",
            "Students at the PhD level, but also a question that I can of course answer by writing a book.",
            "Whether what I think about football, studying the state of the art, but on the other hand, I think it's an interesting aspect that you can address."
        ],
        [
            "Group so.",
            "Basically how I managed imagine this and I actually initiated this by asking one of my students to start working with this, and then I hope this will grow basically to take a text that of course I choose and then basically take from this structure and then try to like learn the basic terms and then of course critically reevaluate them and that would be like the main goal that I would like to do.",
            "Get from the students from this."
        ],
        [
            "Communities, so this is my last slide.",
            "So basically with the.",
            "Open.",
            "Elearning course there's a.",
            "Of course, the issue of how to actually sustain it, how to provide the teachers, how to provide student housing, provide interest.",
            "Also, the infrastructure is the infrastructure does disappear.",
            "I can tell you that I can tell you this from experience.",
            "I have websites that couldn't go on because of some.",
            "Could be also trivial, but still happen that people turn off servers.",
            "Of course, infotainment and advertising is learning an advertisement for the universities, yes or no?",
            "The other thing that I believe in is that universities should reach out, and this is one of the things basically.",
            "I am full fully employed teacher now and of course the University needs to give something back into the environment.",
            "So this is another model that I wanted to speak about, like Reading Group.",
            "Dora Garcia is one of my favorite contemporary artists and she did this video.",
            "It's one hour video that was presented at the Venice Biennial in 2013, but she was also the script break the monster with a different project so it's like super famous artist.",
            "She did video on a group of people that it is reading Finnegans Wake by James Joyce.",
            "And they read it.",
            "I don't know.",
            "They meet once a week and then read it sentence by sentence and then discuss they discuss those sentences and when they finish the book, they start from the beginning.",
            "And so there doing this for decades now people grow old in this.",
            "So what I like here is this intensity of like engagement with the text that is mysterious still to all of us.",
            "So thank you, thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so thank you for.",
                    "label": 0
                },
                {
                    "sent": "Give me a place to speak here so my project is the archive in Fine Arts and literature.",
                    "label": 1
                },
                {
                    "sent": "Let me introduce myself first.",
                    "label": 1
                },
                {
                    "sent": "I am a professor of literature at the School of Humanities here at the University of Margarita and my most recent project is to develop program study program in digital humanities, which is an interdisciplinary program.",
                    "label": 0
                },
                {
                    "sent": "And of course it involves the use of new media in culture and in the humanities, and this was basically the main reason that I started to be.",
                    "label": 1
                },
                {
                    "sent": "Interested in the.",
                    "label": 0
                },
                {
                    "sent": "Demetric program one open education.",
                    "label": 0
                },
                {
                    "sent": "Because this is one of the key issues that.",
                    "label": 0
                },
                {
                    "sent": "Is also very problematic and at the same time interesting for me.",
                    "label": 0
                },
                {
                    "sent": "So in what way does do the humanities changed?",
                    "label": 0
                },
                {
                    "sent": "And also how do the?",
                    "label": 0
                },
                {
                    "sent": "Information exchange.",
                    "label": 0
                },
                {
                    "sent": "How is it transformed by the new media and of course education is something in the middle of all this.",
                    "label": 0
                },
                {
                    "sent": "Let me tell you something about my background.",
                    "label": 0
                },
                {
                    "sent": "Apart from being a literary scholar, I was a freelance new media artist for many years, so I'm also interested in developing the communication technologies, experimenting with new media and so on.",
                    "label": 0
                },
                {
                    "sent": "So I must say I was quite lucky with my.",
                    "label": 0
                },
                {
                    "sent": "Open minded mentors because I wanted to question the way.",
                    "label": 0
                },
                {
                    "sent": "Open.",
                    "label": 0
                },
                {
                    "sent": "Elearning course is developed so.",
                    "label": 0
                },
                {
                    "sent": "As a background, the title, archiving, Fine Arts, and literature.",
                    "label": 0
                },
                {
                    "sent": "This is a course that I developed for the Masters program in Digital Humanities, but I wanted to explore in what way I could take a course from the normal University curriculum.",
                    "label": 0
                },
                {
                    "sent": "Into an open environment.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So my presentation will go through this three steps.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And basically first is I want to work on a PhD level course, which means that I want my students and the people taking part in this course to read original research text.",
                    "label": 0
                },
                {
                    "sent": "So basically I do not want to prepare explanations of different authors, but I the idea is here to learn the students how to actually.",
                    "label": 0
                },
                {
                    "sent": "Of course, read and of course critically evaluate what they read in books, but also on the.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In it.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "For this reason, what I want to focus on is an idea of.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I think an E learning community.",
                    "label": 1
                },
                {
                    "sent": "So in the call for the mentoring program.",
                    "label": 0
                },
                {
                    "sent": "There were the words that I found the most interesting is supposed to open E learning course and also that it is that we're really invited to.",
                    "label": 0
                },
                {
                    "sent": "Apply with.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The courses in different languages.",
                    "label": 0
                },
                {
                    "sent": "I think this is a really important issue.",
                    "label": 0
                },
                {
                    "sent": "For humanities, it is completely unacceptable for everything to like.",
                    "label": 0
                },
                {
                    "sent": "Just shift from local languages to English.",
                    "label": 0
                },
                {
                    "sent": "Basically, I think that language is such an important defining moment in human that actually I am really skeptical about doing PhD in foreign languages if there are no specific circumstances involved, maybe hear a specific focus is also my.",
                    "label": 0
                },
                {
                    "sent": "Study domain literature because in literature basically it is really difficult to get a feeling for a foreign language on the same language, same level as a mother tongue where you basically understand the nuances of meaning.",
                    "label": 0
                },
                {
                    "sent": "Of course, as a literary scholar, I'm a comparative literature style student.",
                    "label": 0
                },
                {
                    "sent": "So basically I do not believe in national literature, so that's the defining moment of comparative literature.",
                    "label": 0
                },
                {
                    "sent": "So basically, I also do not suggest the return to the National History, of course.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Here basically what was for me starting point is basically a learning course in my idea and I was a teacher for.",
                    "label": 0
                },
                {
                    "sent": "Like yeah before come even to the this University.",
                    "label": 0
                },
                {
                    "sent": "Many years, and basically a course for me it would be a process that I went through with the students.",
                    "label": 0
                },
                {
                    "sent": "And so for me I was in the sense surprise that.",
                    "label": 0
                },
                {
                    "sent": "I would not think of myself of somebody I didn't think about making a resource which is in a sense a possibility, sort of material that can be reused.",
                    "label": 0
                },
                {
                    "sent": "What I wanted basically is to establish interaction and from this interaction basically to judge this interaction only by the results.",
                    "label": 0
                },
                {
                    "sent": "Basically what my students achieve.",
                    "label": 0
                },
                {
                    "sent": "So if my students are successful then basically I have.",
                    "label": 0
                },
                {
                    "sent": "Told them something, so of course I think this is really an important thing to think.",
                    "label": 0
                },
                {
                    "sent": "Distinguishes wise, of course, that we can produce open educational resource.",
                    "label": 0
                },
                {
                    "sent": "It is a problem on the PhD level, of course, because they're supposed to study original scientific articles, so I think.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I don't.",
                    "label": 0
                },
                {
                    "sent": "I couldn't see myself doing extra.",
                    "label": 0
                },
                {
                    "sent": "Explanatory material.",
                    "label": 0
                },
                {
                    "sent": "So another thing, another term that I would like to explain is basically the question about the notions of open and free.",
                    "label": 0
                },
                {
                    "sent": "This comes from experience because I was presenting European project and the head of the.",
                    "label": 0
                },
                {
                    "sent": "In your language Institute from Ljubljana asked me when I just presenting this project.",
                    "label": 0
                },
                {
                    "sent": "If when I was saying that we have this open archive of literary receptions, if it is really open, or whether it is free.",
                    "label": 0
                },
                {
                    "sent": "So I was presenting database of the receptions of women writers in throughout European literature, literary systems.",
                    "label": 0
                },
                {
                    "sent": "So basically you would have information of.",
                    "label": 0
                },
                {
                    "sent": "Who read, who were, and The thing is that so it was a database in the background, whereas our project was of course to transform this database into virtual research environment.",
                    "label": 0
                },
                {
                    "sent": "So basically it was an environment where this.",
                    "label": 0
                },
                {
                    "sent": "Actually facilitate the compilation of this database so the database was not fixed.",
                    "label": 0
                },
                {
                    "sent": "It was not the publication of a corpus, but a tool to develop the database.",
                    "label": 0
                },
                {
                    "sent": "So I was I was using the term yet basically our virtual research environment is an open platform, but for this professor he was of course really important in the dictionary making for this live in like the standard living language and also others.",
                    "label": 0
                },
                {
                    "sent": "For that for him, like the open, would refer like to the open software.",
                    "label": 0
                },
                {
                    "sent": "So basically you can actually take all the content and download it to your computer and then you analyze the whole corpus.",
                    "label": 0
                },
                {
                    "sent": "Whereas in our case this was not in our little research environment, this was obviously not the case.",
                    "label": 0
                },
                {
                    "sent": "You could not download the whole database that we have collected, so of course it was free to use in a sense that is free to use in as Google is free to use.",
                    "label": 0
                },
                {
                    "sent": "Of course you don't have the access to the database is in the background, so yeah, but.",
                    "label": 0
                },
                {
                    "sent": "On another level, of course, our virtual research environment software was open source.",
                    "label": 0
                },
                {
                    "sent": "So I was actually right to use the term open, but of course.",
                    "label": 0
                },
                {
                    "sent": "The extra content was just free to use.",
                    "label": 0
                },
                {
                    "sent": "So basically, what is another aspect that I want to emphasize is here.",
                    "label": 0
                },
                {
                    "sent": "Of course, the difference between the course and the material, and so if you can imagine recorded lecture by a professor at the University and so on.",
                    "label": 0
                },
                {
                    "sent": "Basically, you are actually.",
                    "label": 0
                },
                {
                    "sent": "This is the standard that you need to like.",
                    "label": 0
                },
                {
                    "sent": "Get to this level.",
                    "label": 0
                },
                {
                    "sent": "Of course live you have to capture students imagination, but when you do a video recording of stand up, for instance in this case stand up performance.",
                    "label": 0
                },
                {
                    "sent": "It's a film, so the competence is that the professor has a good professor that can teach.",
                    "label": 0
                },
                {
                    "sent": "Are basically never the same as a film Director TV director who can actually provide a captivating.",
                    "label": 0
                },
                {
                    "sent": "Like the Stand up special as you have them so the same is like jazz performance in where you improvise.",
                    "label": 0
                },
                {
                    "sent": "Or this was one of my school friends painter.",
                    "label": 0
                },
                {
                    "sent": "He was a photorealist painter and when he was told he destroyed all his paint believes not always actually.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "Basically, at certain point he transformed all of his paintings into video performances, so we have to distinguish these two levels.",
                    "label": 0
                },
                {
                    "sent": "Basically the actual interaction between people and actually the statement the.",
                    "label": 0
                },
                {
                    "sent": "Video textbook I don't know.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Something like that.",
                    "label": 0
                },
                {
                    "sent": "So what I propose is.",
                    "label": 0
                },
                {
                    "sent": "Start thinking about developing the course.",
                    "label": 0
                },
                {
                    "sent": "What would be the reference?",
                    "label": 0
                },
                {
                    "sent": "And for me the important reference and like big.",
                    "label": 0
                },
                {
                    "sent": "Archive of possible examples is the in 2004 they started.",
                    "label": 0
                },
                {
                    "sent": "At the arse Elektronika festival in Linz, they started the category in the competition for the Golden Nikka Nice.",
                    "label": 0
                },
                {
                    "sent": "The digital humanities in the first winner was Wikipedia, and this year's winner was Bellingcat.",
                    "label": 0
                },
                {
                    "sent": "So this is what I took from the website.",
                    "label": 0
                },
                {
                    "sent": "Basically what you have here, it uses open source and social media investigation too.",
                    "label": 0
                },
                {
                    "sent": "Actually explore different.",
                    "label": 0
                },
                {
                    "sent": "I don't know Mexican drug Lords and so on.",
                    "label": 0
                },
                {
                    "sent": "Basically and this.",
                    "label": 0
                },
                {
                    "sent": "Online platform obviously brings together a community, but what was important always important in when they defined the digital communities category and drought is basically that's what you want to achieve.",
                    "label": 0
                },
                {
                    "sent": "What is the result here is not like software, just I don't know.",
                    "label": 0
                },
                {
                    "sent": "Interactive system, but what you want to actually develop is new community and this community.",
                    "label": 0
                },
                {
                    "sent": "This is one of the criteria for this category is that it has to last.",
                    "label": 0
                },
                {
                    "sent": "And of course, as we can see, Wikipedia lasted.",
                    "label": 0
                },
                {
                    "sent": "So if you recall, those that recall wiki software used to be initially software actually added the code of the web page.",
                    "label": 0
                },
                {
                    "sent": "And of course the first thing that you could do is to delete how code.",
                    "label": 0
                },
                {
                    "sent": "Of the website, so we would have it anymore.",
                    "label": 0
                },
                {
                    "sent": "Wikipedia, Wikimedia software, of course, introduced them history of the changes, and Additionally, of course the different levels of editing, which of course facilitated the growth.",
                    "label": 0
                },
                {
                    "sent": "So what we have here is not just basically, there was a possibility of course, to open to make it like available to anybody to change the appearance of a website.",
                    "label": 0
                },
                {
                    "sent": "But of course you would have to.",
                    "label": 0
                },
                {
                    "sent": "Find some way to provide Español shit in his theory of cybertext would say the netiquette.",
                    "label": 0
                },
                {
                    "sent": "So basically the rules of how you behave in this.",
                    "label": 0
                },
                {
                    "sent": "Community in the SoC.",
                    "label": 0
                },
                {
                    "sent": "Micro society.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Basically, if we want to develop.",
                    "label": 0
                },
                {
                    "sent": "Yeah, OK.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "This community of learning basically working on different aspects in the field or in one of the aspects that this course deals with.",
                    "label": 0
                },
                {
                    "sent": "Of course you have to somehow.",
                    "label": 0
                },
                {
                    "sent": "Manage the intensity of effort that people have actually put into their work.",
                    "label": 0
                },
                {
                    "sent": "So if you have students, if they don't read the text that you have given them to read.",
                    "label": 0
                },
                {
                    "sent": "Basically you cannot do anything is interactively in the classroom, so there's a measurement of activity of the users.",
                    "label": 0
                },
                {
                    "sent": "This is used in many such solutions for digital communities.",
                    "label": 0
                },
                {
                    "sent": "Of course, the rating is also another aspect.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Again, how to another aspect?",
                    "label": 0
                },
                {
                    "sent": "That's very important.",
                    "label": 0
                },
                {
                    "sent": "Of course you have to have some sort of infrastructure teleconferencing.",
                    "label": 0
                },
                {
                    "sent": "Of course model with additional functionality, of course, but there's another issue involved.",
                    "label": 0
                },
                {
                    "sent": "I remember when I was a freelance artist and I was teaching at the.",
                    "label": 0
                },
                {
                    "sent": "School of design.",
                    "label": 0
                },
                {
                    "sent": "Of course, you know my.",
                    "label": 0
                },
                {
                    "sent": "Head of the partner would want to take my.",
                    "label": 0
                },
                {
                    "sent": "Teaching materials I will be paid by the hour and then they would take take my teaching material.",
                    "label": 0
                },
                {
                    "sent": "So this is quite an important issue that has to be taken into account in what way a teacher is reimbursed and the other.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, of course the collaboration between students and all other aspects are of course really important.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is the website that I prepared.",
                    "label": 0
                },
                {
                    "sent": "I'm used Vicki versity.",
                    "label": 0
                },
                {
                    "sent": "Website I'm using this for all my courses and the reason for that is that I don't need to do any introduction to the students that everybody knows how to use it, so actually it makes it much easier for me to progress.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And now how I wanted to structure this course.",
                    "label": 0
                },
                {
                    "sent": "I wanted to do a certain automatic accents and I called the research questions so around which I would develop modules.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so here are different questions, and I've worked only on the first one.",
                    "label": 0
                },
                {
                    "sent": "What are the batch of using for Quinn?",
                    "label": 0
                },
                {
                    "sent": "We call methodology.",
                    "label": 0
                },
                {
                    "sent": "So basically do we is are the works by Michel Foucault still relevant in the.",
                    "label": 0
                },
                {
                    "sent": "Contemporary humanities, so this is a question that is not only that I think could be relevant to literary history or history.",
                    "label": 0
                },
                {
                    "sent": "Students at the PhD level, but also a question that I can of course answer by writing a book.",
                    "label": 0
                },
                {
                    "sent": "Whether what I think about football, studying the state of the art, but on the other hand, I think it's an interesting aspect that you can address.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Group so.",
                    "label": 0
                },
                {
                    "sent": "Basically how I managed imagine this and I actually initiated this by asking one of my students to start working with this, and then I hope this will grow basically to take a text that of course I choose and then basically take from this structure and then try to like learn the basic terms and then of course critically reevaluate them and that would be like the main goal that I would like to do.",
                    "label": 0
                },
                {
                    "sent": "Get from the students from this.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Communities, so this is my last slide.",
                    "label": 0
                },
                {
                    "sent": "So basically with the.",
                    "label": 0
                },
                {
                    "sent": "Open.",
                    "label": 0
                },
                {
                    "sent": "Elearning course there's a.",
                    "label": 0
                },
                {
                    "sent": "Of course, the issue of how to actually sustain it, how to provide the teachers, how to provide student housing, provide interest.",
                    "label": 0
                },
                {
                    "sent": "Also, the infrastructure is the infrastructure does disappear.",
                    "label": 0
                },
                {
                    "sent": "I can tell you that I can tell you this from experience.",
                    "label": 0
                },
                {
                    "sent": "I have websites that couldn't go on because of some.",
                    "label": 0
                },
                {
                    "sent": "Could be also trivial, but still happen that people turn off servers.",
                    "label": 0
                },
                {
                    "sent": "Of course, infotainment and advertising is learning an advertisement for the universities, yes or no?",
                    "label": 0
                },
                {
                    "sent": "The other thing that I believe in is that universities should reach out, and this is one of the things basically.",
                    "label": 0
                },
                {
                    "sent": "I am full fully employed teacher now and of course the University needs to give something back into the environment.",
                    "label": 0
                },
                {
                    "sent": "So this is another model that I wanted to speak about, like Reading Group.",
                    "label": 0
                },
                {
                    "sent": "Dora Garcia is one of my favorite contemporary artists and she did this video.",
                    "label": 0
                },
                {
                    "sent": "It's one hour video that was presented at the Venice Biennial in 2013, but she was also the script break the monster with a different project so it's like super famous artist.",
                    "label": 0
                },
                {
                    "sent": "She did video on a group of people that it is reading Finnegans Wake by James Joyce.",
                    "label": 0
                },
                {
                    "sent": "And they read it.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "They meet once a week and then read it sentence by sentence and then discuss they discuss those sentences and when they finish the book, they start from the beginning.",
                    "label": 0
                },
                {
                    "sent": "And so there doing this for decades now people grow old in this.",
                    "label": 0
                },
                {
                    "sent": "So what I like here is this intensity of like engagement with the text that is mysterious still to all of us.",
                    "label": 0
                },
                {
                    "sent": "So thank you, thank you.",
                    "label": 0
                }
            ]
        }
    }
}