{
    "id": "77n67weolttkztaezc4wsmosng3yjc3y",
    "title": "Architecture for Refugees: Open Source Online Platform",
    "info": {
        "author": [
            "Bence Komlósi, dotlinearchitects"
        ],
        "published": "March 21, 2016",
        "recorded": "February 2016",
        "category": [
            "Top->Architecture",
            "Top->Arts->Visual Arts->Design"
        ]
    },
    "url": "http://videolectures.net/matchmaking2016_komlosi_ideas/",
    "segmentation": [
        [
            "I am Ben succumb Lucy.",
            "I'm going to tell it the story of the architecture for refugees, which is architecture four vivid and by refugees, actually."
        ],
        [
            "What is this?",
            "It's an open source online platform to collect and share knowledge on refugee architecture."
        ],
        [
            "Who we are.",
            "In one hand we are the users, so everybody who is who is dealing with this question as a user is is kind of part of this story and we are now four architects for organizing this platform.",
            "Dennis, Henrik, Sophie and me.",
            "We are four people from three different countries living in three different countries.",
            "So actually we are migrants or Luckily not refugees."
        ],
        [
            "About refugees are very few data like around the world.",
            "There are about or more than 60 million refugees, which is, let's say not a huge number.",
            "If you compare it to the 6 billion people.",
            "But it's a very scattered community, so it's very hard to deal with their problems on a global scale.",
            "You have to really deal with their problems on a very local scale.",
            "That's why we."
        ],
        [
            "We tried to to introduce this doing together.",
            "As Richard Sennett says, it's very hard to leave together to work together and collaborate.",
            "It requires new skills so we try to to introduce these new skills to architects as well.",
            "To understand how to how to deal with questions."
        ],
        [
            "Like working together, what do we do?",
            "In one hand, the question mark is about the problems dealing with refugee crisis and in other hand.",
            "Escalation Mark is dealing with the potential solutions or the design ideas already exist and we are.",
            "Let's say that the plus between the questions and the answers.",
            "So we try to contact them."
        ],
        [
            "We started to deal with this, absolutely not new Phantom Manor in in 2005 in September in Budapest, Becausw.",
            "We realizing that time that refugee crisis is is.",
            "It's about us.",
            "It's about it's about our lives and all of them could be those people who are there and I just realized that one of the guy looked like my brother.",
            "So this was the moment really, really like.",
            "Realize that it's it's it's.",
            "Crucial, so we try to do something as architects.",
            "So it's our profession.",
            "So let's do something."
        ],
        [
            "What was the most important or interesting that information is?",
            "Then you eastern you basic need for them for these people as the Maslow's hierarchy diagram shows.",
            "Like food, water, shelter and warmth are the basic, but actually now it's the information, so information and the tool of Wi-Fi and electricity is the new basic."
        ],
        [
            "Need.",
            "So as the Kaplans and Robert Ryan says, information is the new money.",
            "So information is really what drives our word."
        ],
        [
            "So we try to, we started to deal with information.",
            "First of all we write.",
            "We wrote an article calling architects from Hungary to deal with this problem.",
            "So the architecture society has to has to deal with this question because it's not only about about social problems in economics, but also a built environment."
        ],
        [
            "We organize two workshop."
        ],
        [
            "It's dealing with with the question or with this problem, and this was again this situation where we when we realized that the private shelter is one thing the public infrastructure is another thing.",
            "But this information and organization is that the third element that connects.",
            "These"
        ],
        [
            "Is very fragmented part.",
            "We started also sharing.",
            "We created a small exhibition in Budapest dealing with architecture and refugees."
        ],
        [
            "We had a proposal for the Hungarian population in Venice.",
            "We didn't win, but it was a good process to think about it then."
        ],
        [
            "Also had a proposal for the Trional in Oslo dealing with this question problem."
        ],
        [
            "And then we also started collecting know how knowledge so this drawing is for example from Luca Lucas from from England, who had this idea to do self build design."
        ],
        [
            "So in one hand he implemented this design, so he built some shelters.",
            "In Cali, in the Cali refugee camp and another."
        ],
        [
            "And he just spread the drawings.",
            "So refugees could also build their own shelters in the camp."
        ],
        [
            "What is our goal?",
            "We want to be a refugee oriented based, so focused on and on their basic needs and their problems.",
            "We would like to generate and empower collaboration between all the stakeholders.",
            "We would like to collect and to share the existing information and knowledge that is already somewhere in the world.",
            "We want to connect people think on a global scale and then act on a local scale.",
            "We believe that there is already a lot of knowledge around the world, so we just have to collect them, get to know it and then try to use it on a local scale.",
            "We want to be a long term influence, so a newspapers and TV programs they are dealing with this question for a few days and then then it's over it because it's not new anymore.",
            "We want to have a long, long term influence and mostly on the architecture of society.",
            "If you want to also we would like also to raise money fundings for for this project and we would like to build up a community.",
            "Who is dealing with this?",
            "Quest."
        ],
        [
            "And problem what is the what is going on now?",
            "So these are the these are the things that are the stake holders in the project and there are some connections but very few."
        ],
        [
            "And with this open source online platform, we would like to create.",
            "A platform where every everywhere where everything is available anytime for everybody."
        ],
        [
            "How does it work?",
            "We have that's that's the, let's say, small parts.",
            "We want to do."
        ],
        [
            "This is our Organigram.",
            "Let's say first of all you the user or the someone bring your idea or your problem then you share it on this platform and then you find your potential collaborators partners and we are doing the management.",
            "So we have the community.",
            "We support it.",
            "We give advice is and we also try to take actions with the game."
        ],
        [
            "Knowledge.",
            "And we already have a Facebook page, so please feel free to follow us."
        ],
        [
            "We have a public group where anyone can discuss or the problems or questions."
        ],
        [
            "We have a Twitter as well where we can also try to expand this kind of community we tried."
        ],
        [
            "Build up, we want to organize meetups where people can discuss problem."
        ],
        [
            "And we want to have a web page."
        ],
        [
            "Age, which deals with on site stories from NGOs from refugees from designers."
        ],
        [
            "Questions and answer."
        ],
        [
            "Call for competition call for Project Call for funding."
        ],
        [
            "And we want to have a collection of projects."
        ],
        [
            "Texts, articles, books."
        ],
        [
            "Videos, in one hand, it's going to be like a pool of information, so we're not going to be organized at all.",
            "And in other hand, it's going to be organized and it's going to be.",
            "Somehow?",
            "Cricket is going to create a best practice."
        ],
        [
            "There are going to be also events that you if you if you want.",
            "If you have something you can share it here, or if you would like to go somewhere dealing with this topic, you can find it here."
        ],
        [
            "We want to have also basic data so.",
            "It's very important to understand this whole refugee crisis.",
            "It's not only about architecture, it's about SoC.",
            "About money, about a lot of things."
        ],
        [
            "And we would like to connect institutes dealing with refugee architecture, emergency architecture and things very similar topics."
        ],
        [
            "And we also have a question mark, which is still an open question.",
            "What is the next that has to be on this list?"
        ],
        [
            "Some examples that we have like models, architecture for humanity.",
            "I think you all know Wikipedia, Khalid Khalid Paideia or Facebook are like some examples that something like we want to do."
        ],
        [
            "Oroshi Nacht is also something like what we want to do is kind of collection of diverse things dealing with architecture.",
            "We really would like to focus on the refugee architecture."
        ],
        [
            "And that's kind of 1st proposal for our website.",
            "Really like a draft."
        ],
        [
            "With all the above mentioned stories and."
        ],
        [
            "Questions and about the future.",
            "2016 is the future.",
            "Very close feature for us.",
            "the Venice be an ally is going to deal with this question or with this topic, which is very good at the the German and Austrian Pavilion.",
            "Both are going to deal with refugees and architecture.",
            "the German pavilion project called making home."
        ],
        [
            "And the Austrian is places for people."
        ],
        [
            "And then also there is going to be the trional in in autumn.",
            "It's on five different locations going to deal with architecture and refugees and their work together."
        ],
        [
            "Next steps, yeah, we already have these Facebook.",
            "We already have Twitter and we started the promotion and we are still looking for partners potential people who can collaborate with us or we can collaborate with them and we would like to build up this web page and start meetups."
        ],
        [
            "And and yeah, fundraise alot of money which could help this development.",
            "And we also like to build up this culture of care.",
            "As Sally Ventro says, actively breaking breaking the law in Link makes us feel less guilty.",
            "It creates the culture of UN care.",
            "So we try to build up again and connect this loving links between refugees, architects and different stakeholders to realize that care is very important cultural aspect."
        ],
        [
            "And we would like to call any of you for collaboration.",
            "Even a small share is it's it's.",
            "It's a huge thing so there or or whatever type of collaboration."
        ],
        [
            "And at last, but not least, we are super happy and we are really waiting for this whole year with this future lecture platform, because it's going to be something very hopefully or very interesting, thanks."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I am Ben succumb Lucy.",
                    "label": 0
                },
                {
                    "sent": "I'm going to tell it the story of the architecture for refugees, which is architecture four vivid and by refugees, actually.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What is this?",
                    "label": 0
                },
                {
                    "sent": "It's an open source online platform to collect and share knowledge on refugee architecture.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Who we are.",
                    "label": 0
                },
                {
                    "sent": "In one hand we are the users, so everybody who is who is dealing with this question as a user is is kind of part of this story and we are now four architects for organizing this platform.",
                    "label": 0
                },
                {
                    "sent": "Dennis, Henrik, Sophie and me.",
                    "label": 0
                },
                {
                    "sent": "We are four people from three different countries living in three different countries.",
                    "label": 0
                },
                {
                    "sent": "So actually we are migrants or Luckily not refugees.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About refugees are very few data like around the world.",
                    "label": 0
                },
                {
                    "sent": "There are about or more than 60 million refugees, which is, let's say not a huge number.",
                    "label": 0
                },
                {
                    "sent": "If you compare it to the 6 billion people.",
                    "label": 0
                },
                {
                    "sent": "But it's a very scattered community, so it's very hard to deal with their problems on a global scale.",
                    "label": 0
                },
                {
                    "sent": "You have to really deal with their problems on a very local scale.",
                    "label": 0
                },
                {
                    "sent": "That's why we.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We tried to to introduce this doing together.",
                    "label": 0
                },
                {
                    "sent": "As Richard Sennett says, it's very hard to leave together to work together and collaborate.",
                    "label": 0
                },
                {
                    "sent": "It requires new skills so we try to to introduce these new skills to architects as well.",
                    "label": 0
                },
                {
                    "sent": "To understand how to how to deal with questions.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Like working together, what do we do?",
                    "label": 0
                },
                {
                    "sent": "In one hand, the question mark is about the problems dealing with refugee crisis and in other hand.",
                    "label": 0
                },
                {
                    "sent": "Escalation Mark is dealing with the potential solutions or the design ideas already exist and we are.",
                    "label": 0
                },
                {
                    "sent": "Let's say that the plus between the questions and the answers.",
                    "label": 0
                },
                {
                    "sent": "So we try to contact them.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We started to deal with this, absolutely not new Phantom Manor in in 2005 in September in Budapest, Becausw.",
                    "label": 0
                },
                {
                    "sent": "We realizing that time that refugee crisis is is.",
                    "label": 0
                },
                {
                    "sent": "It's about us.",
                    "label": 0
                },
                {
                    "sent": "It's about it's about our lives and all of them could be those people who are there and I just realized that one of the guy looked like my brother.",
                    "label": 0
                },
                {
                    "sent": "So this was the moment really, really like.",
                    "label": 0
                },
                {
                    "sent": "Realize that it's it's it's.",
                    "label": 0
                },
                {
                    "sent": "Crucial, so we try to do something as architects.",
                    "label": 0
                },
                {
                    "sent": "So it's our profession.",
                    "label": 0
                },
                {
                    "sent": "So let's do something.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What was the most important or interesting that information is?",
                    "label": 0
                },
                {
                    "sent": "Then you eastern you basic need for them for these people as the Maslow's hierarchy diagram shows.",
                    "label": 0
                },
                {
                    "sent": "Like food, water, shelter and warmth are the basic, but actually now it's the information, so information and the tool of Wi-Fi and electricity is the new basic.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Need.",
                    "label": 0
                },
                {
                    "sent": "So as the Kaplans and Robert Ryan says, information is the new money.",
                    "label": 1
                },
                {
                    "sent": "So information is really what drives our word.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we try to, we started to deal with information.",
                    "label": 0
                },
                {
                    "sent": "First of all we write.",
                    "label": 0
                },
                {
                    "sent": "We wrote an article calling architects from Hungary to deal with this problem.",
                    "label": 0
                },
                {
                    "sent": "So the architecture society has to has to deal with this question because it's not only about about social problems in economics, but also a built environment.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We organize two workshop.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's dealing with with the question or with this problem, and this was again this situation where we when we realized that the private shelter is one thing the public infrastructure is another thing.",
                    "label": 0
                },
                {
                    "sent": "But this information and organization is that the third element that connects.",
                    "label": 0
                },
                {
                    "sent": "These",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is very fragmented part.",
                    "label": 0
                },
                {
                    "sent": "We started also sharing.",
                    "label": 0
                },
                {
                    "sent": "We created a small exhibition in Budapest dealing with architecture and refugees.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We had a proposal for the Hungarian population in Venice.",
                    "label": 0
                },
                {
                    "sent": "We didn't win, but it was a good process to think about it then.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also had a proposal for the Trional in Oslo dealing with this question problem.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we also started collecting know how knowledge so this drawing is for example from Luca Lucas from from England, who had this idea to do self build design.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in one hand he implemented this design, so he built some shelters.",
                    "label": 0
                },
                {
                    "sent": "In Cali, in the Cali refugee camp and another.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And he just spread the drawings.",
                    "label": 0
                },
                {
                    "sent": "So refugees could also build their own shelters in the camp.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What is our goal?",
                    "label": 0
                },
                {
                    "sent": "We want to be a refugee oriented based, so focused on and on their basic needs and their problems.",
                    "label": 0
                },
                {
                    "sent": "We would like to generate and empower collaboration between all the stakeholders.",
                    "label": 1
                },
                {
                    "sent": "We would like to collect and to share the existing information and knowledge that is already somewhere in the world.",
                    "label": 1
                },
                {
                    "sent": "We want to connect people think on a global scale and then act on a local scale.",
                    "label": 0
                },
                {
                    "sent": "We believe that there is already a lot of knowledge around the world, so we just have to collect them, get to know it and then try to use it on a local scale.",
                    "label": 0
                },
                {
                    "sent": "We want to be a long term influence, so a newspapers and TV programs they are dealing with this question for a few days and then then it's over it because it's not new anymore.",
                    "label": 1
                },
                {
                    "sent": "We want to have a long, long term influence and mostly on the architecture of society.",
                    "label": 0
                },
                {
                    "sent": "If you want to also we would like also to raise money fundings for for this project and we would like to build up a community.",
                    "label": 0
                },
                {
                    "sent": "Who is dealing with this?",
                    "label": 0
                },
                {
                    "sent": "Quest.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And problem what is the what is going on now?",
                    "label": 0
                },
                {
                    "sent": "So these are the these are the things that are the stake holders in the project and there are some connections but very few.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And with this open source online platform, we would like to create.",
                    "label": 0
                },
                {
                    "sent": "A platform where every everywhere where everything is available anytime for everybody.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How does it work?",
                    "label": 0
                },
                {
                    "sent": "We have that's that's the, let's say, small parts.",
                    "label": 0
                },
                {
                    "sent": "We want to do.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is our Organigram.",
                    "label": 0
                },
                {
                    "sent": "Let's say first of all you the user or the someone bring your idea or your problem then you share it on this platform and then you find your potential collaborators partners and we are doing the management.",
                    "label": 0
                },
                {
                    "sent": "So we have the community.",
                    "label": 0
                },
                {
                    "sent": "We support it.",
                    "label": 0
                },
                {
                    "sent": "We give advice is and we also try to take actions with the game.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Knowledge.",
                    "label": 0
                },
                {
                    "sent": "And we already have a Facebook page, so please feel free to follow us.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have a public group where anyone can discuss or the problems or questions.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have a Twitter as well where we can also try to expand this kind of community we tried.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Build up, we want to organize meetups where people can discuss problem.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we want to have a web page.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Age, which deals with on site stories from NGOs from refugees from designers.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Questions and answer.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Call for competition call for Project Call for funding.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we want to have a collection of projects.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Texts, articles, books.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Videos, in one hand, it's going to be like a pool of information, so we're not going to be organized at all.",
                    "label": 0
                },
                {
                    "sent": "And in other hand, it's going to be organized and it's going to be.",
                    "label": 0
                },
                {
                    "sent": "Somehow?",
                    "label": 0
                },
                {
                    "sent": "Cricket is going to create a best practice.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There are going to be also events that you if you if you want.",
                    "label": 0
                },
                {
                    "sent": "If you have something you can share it here, or if you would like to go somewhere dealing with this topic, you can find it here.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We want to have also basic data so.",
                    "label": 0
                },
                {
                    "sent": "It's very important to understand this whole refugee crisis.",
                    "label": 0
                },
                {
                    "sent": "It's not only about architecture, it's about SoC.",
                    "label": 0
                },
                {
                    "sent": "About money, about a lot of things.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we would like to connect institutes dealing with refugee architecture, emergency architecture and things very similar topics.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we also have a question mark, which is still an open question.",
                    "label": 0
                },
                {
                    "sent": "What is the next that has to be on this list?",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some examples that we have like models, architecture for humanity.",
                    "label": 0
                },
                {
                    "sent": "I think you all know Wikipedia, Khalid Khalid Paideia or Facebook are like some examples that something like we want to do.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Oroshi Nacht is also something like what we want to do is kind of collection of diverse things dealing with architecture.",
                    "label": 0
                },
                {
                    "sent": "We really would like to focus on the refugee architecture.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that's kind of 1st proposal for our website.",
                    "label": 0
                },
                {
                    "sent": "Really like a draft.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With all the above mentioned stories and.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Questions and about the future.",
                    "label": 0
                },
                {
                    "sent": "2016 is the future.",
                    "label": 0
                },
                {
                    "sent": "Very close feature for us.",
                    "label": 0
                },
                {
                    "sent": "the Venice be an ally is going to deal with this question or with this topic, which is very good at the the German and Austrian Pavilion.",
                    "label": 0
                },
                {
                    "sent": "Both are going to deal with refugees and architecture.",
                    "label": 0
                },
                {
                    "sent": "the German pavilion project called making home.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the Austrian is places for people.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then also there is going to be the trional in in autumn.",
                    "label": 0
                },
                {
                    "sent": "It's on five different locations going to deal with architecture and refugees and their work together.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Next steps, yeah, we already have these Facebook.",
                    "label": 0
                },
                {
                    "sent": "We already have Twitter and we started the promotion and we are still looking for partners potential people who can collaborate with us or we can collaborate with them and we would like to build up this web page and start meetups.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And and yeah, fundraise alot of money which could help this development.",
                    "label": 0
                },
                {
                    "sent": "And we also like to build up this culture of care.",
                    "label": 0
                },
                {
                    "sent": "As Sally Ventro says, actively breaking breaking the law in Link makes us feel less guilty.",
                    "label": 1
                },
                {
                    "sent": "It creates the culture of UN care.",
                    "label": 0
                },
                {
                    "sent": "So we try to build up again and connect this loving links between refugees, architects and different stakeholders to realize that care is very important cultural aspect.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we would like to call any of you for collaboration.",
                    "label": 0
                },
                {
                    "sent": "Even a small share is it's it's.",
                    "label": 0
                },
                {
                    "sent": "It's a huge thing so there or or whatever type of collaboration.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And at last, but not least, we are super happy and we are really waiting for this whole year with this future lecture platform, because it's going to be something very hopefully or very interesting, thanks.",
                    "label": 0
                }
            ]
        }
    }
}