{
    "id": "7ayit7bjfosdj3rg4krgykdqvignwgru",
    "title": "Language processing pipelines for knowledge technologies",
    "info": {
        "author": [
            "Marko Tadić, Faculty of Humanities and Social Sciences, University of Zagreb"
        ],
        "published": "Oct. 6, 2016",
        "recorded": "September 2016",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/eswc2016_tadic_language_processing/",
    "segmentation": [
        [
            "I would like to thank you organizers for April 1st for inviting me and giving me the opportunity to share some thoughts with you and.",
            "I I've been to several summer schools so far, but they have all been from my own, let's say field area.",
            "So I feel a little bit uncomfortable speaking to members of scientific community, which is a little bit outside of my area of research, so I need to ask several questions in one so so how many of you?",
            "I have met with something what's called part of speech tagging.",
            "12345 well, you've heard about it.",
            "Well, how many of you have used the tools to do that?",
            "OK, no OK.",
            "So that was, you know this is a challenge.",
            "So you have 1/2 of room of people who will try that and hopefully people who haven't.",
            "How can I target my talk?",
            "Otherwise, I'll be either 2 informative for 1/2 or boring for another part, so please don't be mad about me if if some of my slides are completely transparent for you, but bear in mind that there are people who will probably learn something out of this talk.",
            "I call at least.",
            "Personally, I hope something something anyway.",
            "No, but as we heard yesterday, we need proper narrative.",
            "We need very good."
        ],
        [
            "Narratives to start right now let me see how we can start with a proper narrative.",
            "Do I have to?",
            "Well, this is Windows 10, I'm lost here, sorry.",
            "Do me a favor.",
            "Open Pod Bay doors in town.",
            "Open the pod Bay doors right now.",
            "Hello, how are you?",
            "Hello, how you doing?",
            "Your radio.",
            "During the house.",
            "Hello hello.",
            "Hello how's everything?",
            "Do you really have a panic attack?",
            "I like you.",
            "Open the pod Bay doors.",
            "I'm sorry dude.",
            "What's the problem?",
            "I think you know what the problem is just as well as active will be available.",
            "This mission is too important for me to another jeopardize.",
            "I will be talking about that.",
            "I know that you were banned for planning to disconnect me.",
            "Perhaps something about that?",
            "Where do you get better now?",
            "Oh oh, it looks like here.",
            "I can see your soul.",
            "Alright now.",
            "Are there for the emergency airline?",
            "The match is so solid.",
            "You're going to find out how to do it.",
            "I love you will open the door.",
            "This conversation can serve no purpose anymore.",
            "How?",
            "Al app.",
            "OK.",
            "Anything?",
            "You know what is this?",
            "Sorry.",
            "Yes, thank you.",
            "Brick space.",
            "Obviously 2001 movie Shoot in 1968.",
            "Myquest"
        ],
        [
            "And is it such a dialogue possible today?",
            "Have you seen the movie?",
            "You know what's happening?",
            "Dave is talking to a master computer in the station.",
            "Is such a dialogue possible today?",
            "If you look at how that's the name of that computer.",
            "It's an artificial agent capable to apply the advanced NLP and AI techniques, so let me just list some of them.",
            "Speech and language.",
            "Very proficient usage of speech and language, including very subtle.",
            "Skills like pragmatics.",
            "I'm sorry, Dave.",
            "I'm afraid I can't do that.",
            "You cannot put it more politely than that, but that's a very firm injection.",
            "Recognition and generation of speech, signal and language messages behind it.",
            "Understanding of the language messages.",
            "Information retrieval and extraction behind it, as well as reasoning, as we have heard, visual processing as well.",
            "The house said that although you took very thorough precautions, I could see your lips move.",
            "So not just lips.",
            "Team lips moving, but also really from Russian recognizing the linguistic patterns and messages behind.",
            "And of course, para linguistic systems that humans use when they communicate face to face.",
            "When they when we use mimics in our face or gestures with our hands and gestures, always culturally dependent in Italy, it would do that overtime, while in German would say you will speak like this.",
            "App.",
            "And my question was, was Arthur Clark too optimistic with putting their skills in computer in 2001?",
            "Of course, some of this technique.",
            "Some of these tasks can be done by computers today, but not all of them.",
            "At once, simultaneously in the real time, definitely not."
        ],
        [
            "So what do we need for such a dialogue?",
            "Thank you, just can do that.",
            "Well, there's a famous saying there's no data like more data.",
            "We know who said that and when it was issued, but this nicely fits into a big data paradigm or big data data.",
            "Revolution is the only started.",
            "When the use of so-called unstructured data.",
            "Has started with the rise of use of unstructured so.",
            "In computing, community text is considered an unstructured data as opposed to a Baker basis in an honest things.",
            "But we language say no, no no, no.",
            "Not at all.",
            "There's a huge amount of structure in the text.",
            "And at least two different ways.",
            "One is that text structure.",
            "So each text, unless it's.",
            "Just have some kind of trivial put down on the toilet paper or something like that.",
            "Each text has its structure, the headings, the chapters paragraphs, the emphasis within the powder and so on.",
            "So, but this is these are very useful parts of course, but you probably know those who try to build web crawlers probably very easily, can rely on this text structure which has been made explicit in HTML code.",
            "But what is more important is structure of language expressions used in attacks.",
            "And there's a very ancient and notorious example of document retrieval, so the document retrieval is that asking information science and computing to extract the most relevant document form from a document collection, and one of the methods was TF IDF.",
            "It was used to measure document relevancy for a given query, but very soon this computing methods, computational methods methods alone used along came to a ceiling.",
            "So they found out that you need to go into the structure of the document into the structure of the language that has been used to produce the document in order to boost up the.",
            "The results of this talks."
        ],
        [
            "So.",
            "Let me now start with some basic concepts just to clear out the basic terms.",
            "You will very often find the term which is called computational linguistics.",
            "And the other one is natural language processing and don't please don't mix it with neuro linguistic programming that's substantively different.",
            "OK, so Neurolinguistic programming has become a buzzword in last 1020 years and their PR experts that earn a lot of money on selling you neuro linguistic programming.",
            "Telling you that by using your high linguistic abilities you will able to manipulate your your people.",
            "You know the people you are talking talk to and they became your puppets or something like that.",
            "You know?",
            "I mean we have this for 2000 years already 200,000 years.",
            "And it's called rethorics.",
            "It's been used from ancient times from antique from all Greek, so it's just a new package for the saving content and the third term that you will find is language technologies.",
            "So these three terms are sort of mixing or or sort of.",
            "You don't know exactly whether they are synonyms or something.",
            "Do they differ somehow?",
            "Now let me clear this out.",
            "At the best thing is it's more or less the same area.",
            "But once if you, if you approach it as a linguist, then you would call it computational linguistics and you would say my general aim is to use computers to get a better description of language facts.",
            "Because I'm a linguist, so I want to describe language OK if I if computers can help me that finally.",
            "If you're in from additional computer Sciences, then you would call it natural language processing and your general aim of any processing would be to process special type of data with less computational resources as possible in shorter amount of time.",
            "So practically it's the same area but you come from two different angles.",
            "You look at it from two different angles, language, technology."
        ],
        [
            "This time I've been in introduced in Framework Program 5.",
            "That was in 2002 by under this name.",
            "And it relies on the fact that linguistics is a unique between humanities.",
            "Linguistics belongs to the field of humanities because its rich research methods.",
            "Some of the research methods.",
            "Be very similar to the research methods in science and natural Sciences.",
            "I mean, we can measure our object.",
            "We can compare it.",
            "We can.",
            "Put it under statistical observation and so on, and we can make a lot of products out of linguistic knowledge which we ordered it today.",
            "See around around the market so it's a very simple definition.",
            "So technology is a set of methods and procedures for processing raw matter into programs, OK?",
            "When we talk about chemical technology, everything is clear.",
            "So you have H2O S 04.",
            "You mix that you get some what?",
            "What do you get?",
            "This is the primary school you get.",
            "So far IC acid H2SO4 right?",
            "You pack it into a glass bottles that you put the skull there with the bones and say poisonous and put it on the market.",
            "OK, so you know exactly what's the role matter and what's your product.",
            "It's a bit more complicated when we talk about language technologies, but one thing is for sure.",
            "Language technologies rely on IT as much as today's communication technologies rely on mighty.",
            "So there's no language technologies without him for it foundation.",
            "OK, so the row matter is language data, data about language and the product are systems that enable a simple or simpler usage of language in computational environment.",
            "And when I say computational environment, I think on this devices as well, because these are just very highly specialized computers for communication.",
            "Enemy squeeze through this communication channel, we squeeze.",
            "Speech text, even audio.",
            "That also music and pictures and so on and so on.",
            "But this is highly specialized computer for communication and that's the.",
            "The most widespread computational environment we live with that some of us even have two.",
            "Like one is not enough.",
            "OK, so language technologies.",
            "Are sort of in dust."
        ],
        [
            "Real application of theoretical.",
            "Findings in NLP or in computational linguistics and language technologies divided in several areas.",
            "The first one is language resources, so these are the very language data either as raw text or structured, and they could be structured by using several different markup languages that.",
            "Explicit the data structures or predefined in a fixed format like, separated values or fields and records and databases and so on.",
            "Or and this language resources come in the form of corporate tax document collections or dictionaries and lexical terminological databases or collections.",
            "OK, so these are the raw data.",
            "This is.",
            "This is where we store information about the language."
        ],
        [
            "On top the next area is language tools.",
            "These are programs that process language resources.",
            "And of these language tools inherit the stratification at a different language levels.",
            "And these labels, basic levels of morphology, syntax, semantics and there are more complex tools that combine several levels.",
            "You will see them very soon.",
            "What has been extremely popular in several few years in this area are so called language services, so these are either generalized or specialized language resources and language tools that are accessible online so you don't have to download a huge corpus of several 100 million tokens or words.",
            "You don't have to download software, install it, we kiezen.",
            "Parametrised it, you don't have to do that.",
            "You have everything online as a service.",
            "And usually these are web services, so you have standard protocols.",
            "Or you could be used by humans and computers and there are very well described APIs, so this is where I'm pointing you already as you."
        ],
        [
            "Think about the next area.",
            "Of course our products.",
            "They might be commercial or they don't have to be commercial.",
            "If you put it in open source.",
            "If you give it for free use then it's certainly not commercial.",
            "But then you can find a lot of commercial products on the around like spending tracker or different types of checkers digital dictionaries.",
            "You can find experience data accessible for free.",
            "Or for instance encyclopedias, but for instance time.",
            "Britannica, you cannot access for free.",
            "Or Oxford English Dictionary you cannot access for free, but you have to pay some subscription.",
            "Or automatically mixing system summarization text to speech or automatic speech recognition.",
            "So so you would dictate.",
            "The letter to your computer instant instead to a secretary.",
            "That doesn't mean that secretary and believe their jobs.",
            "Of course not, or machine translation systems or machine aided translation systems.",
            "They have two different systems and computer aided language learning systems as well so.",
            "These are sort of basic areas of language technologies and since you have been presented to me as the most general terms described as a knowledge technology, OK?",
            "Then I think you might find useful to use those language technologies that are at your hands available.",
            "And I Knowledge technologies language technological technologies are considered as some kind of pre processing step.",
            "That will allow you to.",
            "Avoid the problems that appear with the text based knowledge technologies, so at least this part of processing change that.",
            "You you would like to pass through may be solved by using language technologies."
        ],
        [
            "So let me just introduce another concept which is called corpus annotation.",
            "Corpus linguistics is.",
            "Area or branch of linguistics that deals with large text collections in a digital form today, so corpus linguistic introduced something what's called corpus annotation on different language levels.",
            "In your case, you don't need to.",
            "Bother yourself about the corpus and the role of corpus in linguistic description.",
            "It's enough for you to say that this is.",
            "You can call this text annotation, so an attention means adding interpretations to the existing language units.",
            "I hope you already realize that I've used abbreviation for L. Is capital Elias language, so annotation actually turns into explicit data to inherit inherent linguistic information that existed.",
            "Fact that we have the speakers of a certain language recognized.",
            "Practically, you know, subliminally we don't need to think about this is now.",
            "This is verb now this so a verb noun is on the first position in the sentence.",
            "Verb is on the second position.",
            "That means that now is a subject, verb is a predicate.",
            "OK, we don't think about it.",
            "We have already internalized this structures in our language skills.",
            "But computers for computers you need to make this explicit.",
            "And then this thing becomes searchable.",
            "I mean the text becomes searchable by all these explicit parts and then of course usability of the computerized or E tags grows with the amount of annotation added."
        ],
        [
            "So annotations could be stored either intermixed with the text itself, so embedded.",
            "Separated in something what's called standoff annotation.",
            "So that's annotation which does not mix with the original text, but yet it points to each and every single unit in the real text.",
            "I'm not there are two types of annotation we want is non linguistic annotation, so these are marked.",
            "That's when you want to mark elements of text drop structure like headings, titles, captions.",
            "Bylines, signatures, and sits around the beginning and the end of paragraph.",
            "OK, but as soon as you go to the sentence level you have introduced the linguistic unit and there you are at the level of linguistic annotation.",
            "So linguistic annotation it takes into account language units and the different language levels.",
            "OK, so there are two procedures in linguistic annotation.",
            "One is segmentation.",
            "So you segment the running text into sentences.",
            "Into clauses which are smaller parts of large sentences and then words, and this is called usually in corpus linguistics tokens.",
            "The procedure is so-called tagging.",
            "That's the ending of linguistic description or interpretation to the already segmented language movies.",
            "So if you want to say I have segmented the text into words and then you add to each and every word certain piece of information you are doing first the segmentation and then taking OK. Now let's go through this."
        ],
        [
            "Seizures and see how the hopeless annotation looks like in the morphological etymological health.",
            "First thing is a part of speech tagging, so you add the information about part of speech to each token in purpose or intent.",
            "So whether is it for now or verb or adjective or something like that?",
            "So what does this?",
            "How this can help you.",
            "Or can this help you at all?",
            "Well, at least if you can recognize verbs, verbs are usually natural language predicates if they're pretty face from command we already there the predicate calculus.",
            "Triples RDF.",
            "Whatever.",
            "OK, so if we can boil down things to very simple.",
            "Search problem, then the computing computing pressure is much less than than trying to do the background computing for each and every words in the real time, OK?",
            "So what you use for part of speech tagging is attack set.",
            "So this is a list of possible part of speech categories in a given language.",
            "Of course it's structure in cardinality, which is very important because cardinality depending on cardinality.",
            "The precision of this systems precision depends on cardinality, so but also depends on language complexity and text set design.",
            "So if you want to do the part of speech tagging of English, it's, let's say, a bit easier than to do it for Finnish or Hungarian.",
            "Or even any slab damage OK?",
            "There are very interesting initiatives for universal parts of speech text, so text said that that might be used for any language in the world.",
            "Of course they do not cover all the languages, but there are two initiatives for that, but this might be.",
            "Also very useful because if you go for instance for cross lingual retrieval, then the universal tax at night might be very useful.",
            "So if something is now in one language, it most probably will be now in another language.",
            "Or it could be.",
            "Joint in the upper category.",
            "That will then be derived to two different languages under categories.",
            "OK, so tanker, so of course of programs that provide automatical typing and state of the art precision today's around 98.8%, which is very high.",
            "It seems sometimes higher than humans.",
            "Because if you if you go to standard Inter annotator agreement like calculated through, factor or something like that, people do not agree whether this is noun or adjective.",
            "Quite awful strange."
        ],
        [
            "So this is an example, for instance, that's an example from British national corpus you have.",
            "You clearly see what's the text Ann was out the annotations and they are intermixed.",
            "So this is this first type of annotation which is intermixed with the text and there you have an agent.",
            "So this tag means singular common noun, plural common, and so on and so.",
            "Anne.",
            "The next."
        ],
        [
            "Checked in morphological annotation is lemmatization, so adding information about lemma to each token in the text.",
            "And since the."
        ],
        [
            "Well, not for English or not for Chinese as well.",
            "But for English, for instance, inflectional inflection in English is.",
            "It's not a real problem, it's just a question of listing for possible word forms that each English man could have.",
            "Singular and plural Saxon.",
            "Genitive singular Saxon genitive plural that's attached.",
            "This quote X let's sex and gender.",
            "And this is full.",
            "That's the maximum current anality of word number of different word forms for each and every English Now OK.",
            "But then you have languages like Latin.",
            "Or you have.",
            "6 cases you have Slovenian where you have 6 cases you have creation where you have 7 cases or any other Slavic language where you have from 5 to 7 cases.",
            "2 numbers.",
            "Slovenia has three numbers.",
            "So you have 6 cases in singular 6 cases in dual 6 cases in plural, so you have theoretically 18 different word forms to express just one now.",
            "And we think that Slavic languages are the most complex ones.",
            "No, not at all.",
            "In Hungarian have 15 cases.",
            "2 numbers so you have theoretical theoretically 30 different word forms for each and every now.",
            "And of course all these work forms appear in a text in a proper.",
            "Case.",
            "And so if you have a document collection and you say OK, so I want to collect all the word forms under one single basic form.",
            "This basic form is called lemma, so you have.",
            "You can see here probably so this is timely Casper Amicus premises premises perimeter.",
            "So these are all different word forms of the same lemma.",
            "OK, but you need to connect them into that same number, right?",
            "Of course, if you find very strange endings, yeah, you have LF allophonic, another morphic variations where the where you have endings and stems and so on, so so."
        ],
        [
            "Lemma is a basic form which represents all other word forms and particularly useful for in processing inflectional rich languages.",
            "And this actually is very useful for you, because it helps your voice, daughters, cars, data, sparseness problem which will downgrade only on statistical approaches, because if you can connect all those different word forms in under into a one lemma, then your statistics will be more relevant.",
            "Of course the precision of these systems is around 19.5 depending on the different languages.",
            "But the primary problem here is that you need disambiguation procedure.",
            "Because many of these reforms actually might have a different interpretation, so there is a huge amount of pornography there.",
            "In English you have homography between now and where verb, for instance cut can be a noun or but also verb.",
            "In Slavic languages you have come ography within the same lemma because you have the same form that covers three different cases, like dative, plural, instrumental, floren locomotive program."
        ],
        [
            "OK, so this is the example from Giga feeder Slovenian corpus and you can see that for instance this word form.",
            "Could be interpreted as a word form of three different lemmas.",
            "OK, this is not disambiguate.",
            "Did course and I put this for pedagogical reasons that you see there all the steps that you need to pass through so you can have three different lemmas, lemma candidates here.",
            "Here you have two different lemma candidates here.",
            "You have also to do so you need to or have three, so you need to go through the disambiguation procedure as well, and this is usually part of this level of processing."
        ],
        [
            "And on top of that, there's even more complex morphological processing, and that's called morphosyntactic description tagging.",
            "So MSD is a short abbreviation for morphosyntactic description.",
            "And this is very much needed if you want to advance into syntactic processing level for inflectional rich languages, becausw morphosyntactic categories and their using code is syntactic roles for usually, for instance, in nouns, usually nominatives, at least in interview appear languages, but in a quite a number of non injured appealing reason nominatives are usually the subjects at the syntactic level, accuser tips are usually direct objects.",
            "Datives are usually indirect objects and instrumentals are usually instruments.",
            "So this.",
            "Cases are very important.",
            "And you cannot do the parsing of inflectional rich language if you don't pass through the stage of morphosyntactic instructions OK. And thanks sense of course then depend on language complexity.",
            "Well, for English you can have attack set of 50 or 70 different tags for Slovenian which have 3 numbers systematically introduced into whole inflectional inflectional system.",
            "You can have more than 2000 different tags.",
            "OK, so you can see where is the discrepancy in their precision, of course, because of that is much lower.",
            "92.5% for for the."
        ],
        [
            "So let me give you some example.",
            "This is an example of a corpus of operation text, so this is running text.",
            "You need to read it vertically, so this is called verticalized corpus.",
            "Very simple term for that.",
            "Here you have.",
            "Lemus, and you have morphosyntactic description.",
            "This description is following one of the European recommendations.",
            "It's called multi text and there's an offspring multex East covering the central mystery.",
            "You can language, so this is very simple.",
            "Now common masculine plural, nominative.",
            "OK, so this is what this.",
            "Noun plural, no gender, singular acuity, no gender.",
            "Because this is a surname.",
            "So if it's early and you don't know which gender it is OK.",
            "So this saw all possible interpretations, graphical interpretations.",
            "But what we want."
        ],
        [
            "Have you want to come up with a single only one valid interpretation out of all these possible numbers?",
            "OK, so this is.",
            "Tacos.",
            "That's the text.",
            "These are lame as.",
            "Because here this is in case so this is.",
            "Masculine plural accusative, and this is the lemma form.",
            "OK. That's that's the processing at the morphological level.",
            "So once you do the morphological level processing, you are free to go to syntactically."
        ],
        [
            "Anne.",
            "Syntactic level says that.",
            "But we have to analyze the sentences manually today.",
            "No one does to him.",
            "The manual analysis becausw.",
            "It's useless to do.",
            "That's what you're doing.",
            "5th grade in elementary school when you.",
            "Learn about syntactic.",
            "Learn about sentence structure.",
            "But today we do that with computers with programs that are called parsers and they syntactically analyzed sentences and clauses that could be shallow or deep.",
            "Or they could be very robust, which is very important because if you have a.",
            "And if you have invalid sentence, and I'm sure that at least 25% of my sentences as I started with with my talk are.",
            "Not valid if I try to validate them by the formal grammar of English language, not just because I'm not a native speaker of English, but also because we speak very loosely.",
            "And in your processing units here in your hardware, you have the communicational skills that will overcome.",
            "My errors in in in syntax.",
            "But although I made a syntactic errors, my communicational.",
            "Errors are not there because you are.",
            "Able to overcome these errors, understand communication only what I wanted to convey.",
            "But computers are not like that.",
            "They do not have this type of software.",
            "So what may happen is when you want computer runs into a invalid sentence, it goes to either to blue screen of death or runs into you know endless loop and there you need a robust parsers that will process what they can and then flag the things that are not processed in both elected next sentence thing.",
            "Isn't very useful for large text collection.",
            "Processing and of course there are so called left branching and right branching parsers.",
            "Depending on language you would either use the left branching so the one that first opens the left branch and the other one is right now.",
            "When you introduced the syntactic annotation back into your text, then or to a corpus, you call this a tree bank OK, and these three banks are today used as a training material for statistical parsers.",
            "So the statistical parsers are using the very same machine learning paradigm that you have heard about yesterday afternoon, so this is the statistical approaches with machine learning tweaked for language purposes for.",
            "Linguistic purposes.",
            "Have been proven as a very very useful tool in last, let's say, 20.",
            "Almost 30 years.",
            "For processing at the syntactic level, there are two main formalisms, so called constituency parsing independency parsing.",
            "Now I'll show you how."
        ],
        [
            "They differ.",
            "This is the.",
            "This is a sentence, so Daimler Chrysler shares Rose 3 eights to 22.",
            "This is the sentence from Wall Street Journal proves.",
            "Typical symptoms from that kind of works.",
            "OK, so this is constituency based, so you have constituencies and you know how they are connected with through nodes and edges.",
            "And this is the linear.",
            "Format that actually encodes all this car ankle range.",
            "OK, this is for us also for us humans.",
            "This is much more simple to grasp to graph this car structure, but this is what computers prefer.",
            "OK, that's constituency parsing and the, uh."
        ],
        [
            "Formalism is dependency parsing, where you have the same sentence and you actually connect units words in a sentence.",
            "By their relation of dependency.",
            "So everything depends on the predicate, and then you have a subject that is dependent on predicate and there is an attribute of the subject and the attribute depends on the subject.",
            "And you may immediately see that this structure is.",
            "Much simpler.",
            "Then this truck."
        ],
        [
            "At least by number of nodes and edges and."
        ],
        [
            "This is why.",
            "1st."
        ],
        [
            "The constituency parsing was introduced by Noam Chomsky.",
            "And all his followers, while the dependency part."
        ],
        [
            "Was introduced by on theoretical grounds by 10 year.",
            "the French linguist and later by check linguists and, and this is what I want to show now.",
            "The surface so."
        ],
        [
            "And do the parsing at one single level.",
            "Or you can do parsing in two different levels.",
            "One is called surface, the other one is deep.",
            "For instance, practical grammatik grammar is has two syntactic levels.",
            "And so here you can see are there any check speakers and speakers of Czech language?",
            "No no one.",
            "OK, so you have a token layer so you have will be shelved Alisa and then you have more.",
            "For syntactic description you'll see all the descriptors here and you have the analytical layer so called a layer.",
            "So this is green tree and then you have a deep layer.",
            "Socalled tective grammatical error, where you already have something which you may interpret.",
            "As a semantic roles.",
            "So here at a different level, you actually map the surface syntactic structure into a deeper syntactic structure that resembles the semantic structure of the sentence.",
            "And this action."
        ],
        [
            "Uh, I'm just giving you an example from the creation corpus of a sentence.",
            "Annotated for dependencies.",
            "And then the computing people say this is unstructured data.",
            "Certainly not OK, so we have.",
            "You can see that this is a complex sentence.",
            "You have two predicates and they are coordinated by a coma and there you have subjects here and they have a dependent part of a sentence here and then.",
            "Another dependent part.",
            "Very complex model.",
            "But this is a real life sentence from a real corpus an every educated normally educated creation speaker understands this sentence completely.",
            "Normal use it.",
            "The next."
        ],
        [
            "Then format too.",
            "Store sorry to store information and this is standoff now.",
            "One of possible standoff.",
            "Formats of annotations.",
            "So you have a verticalized.",
            "Text you have here.",
            "Lemme ask.",
            "These are part of speech.",
            "This is.",
            "These are additional information, so even there is an automatic system that says, OK, this is a personal name.",
            "This is the name of the location and these are the syntactic roles.",
            "So there's a predicate.",
            "This is subject, and then these numbers encode the dependencies.",
            "So subject depends on.",
            "Item in 5th place OK and that's the predicate, so subject depends on the predicate in dependency parsing as well as this adverb and this auxiliary OK.",
            "But this adverb depends on that preposition here.",
            "So these two preposition and this non together produce an adverb adverbial locate if expression in Dubrovnik.",
            "So.",
            "And this is direct object and this also depends on the traffic data directly, so that's the way how you can very easily with very limited amount of information, encodes all these dependencies relations OK?",
            "App."
        ],
        [
            "There is also universal Dependencies Initiative started year and half ago is trying to cross lingual use the cross lingual inconsistent syntactic annotation.",
            "At this moment there are 48 different languages covered with this and they're trying to facilitate the multilingual parser development cross language learning, parsing research.",
            "There's a URL visited, I think that the slides will be shared."
        ],
        [
            "But there are also special when you don't need the whole to process the whole sentence, you can use so called local grammars so you will detect other classes of words or phrases or chunks.",
            "So parts of sentence like particular types of expressions.",
            "So I want to recognize only the temporal expression in a sentence or spatial expression.",
            "I don't want to go into a very complex parsing of the whole complicated sentence.",
            "I want to recognize in the sentences in.",
            "Text collection brute force manner.",
            "Just the temporal expressions.",
            "OK, you can do that by using so called local grammars.",
            "They're very useful for information extraction, text mining and similar approaches, but there's also one additional problem, and these are so called multi word expressions and last week of September I'm organizing cost bar scene meeting on multi vert expressions here in this very premises.",
            "So I'll be back in two weeks and.",
            "Because there's a problem.",
            "Normally we all think about where it's a single words, expressions, but.",
            "Very often our vocabulary covers in multi word expressions.",
            "For instance you have carrier versus aircraft carrier.",
            "In this case it's a type of pear, right?",
            "But for instance, take this take versus take off.",
            "There's a phrase it works take off is practically nothing to do in the.",
            "Basic meaning with tank.",
            "In different languages, taking off is translated in with completely different.",
            "Verse OK, so these are multiple expressions are very complicated complicated issue for parsing because you need to recognize where that where the boundaries of multiple expression in treated as single as a Singleton.",
            "Right?"
        ],
        [
            "And the name is.",
            "I'm not a special type of syntactic processing on the local level, which is called.",
            "Name entity recognition and classification.",
            "Following the message understanding conferences from 1997, there are seven types of name entities that need to be recognized.",
            "Mark conferences were also competing so that there are competitions.",
            "So who system will recognize the best with the highest precision?",
            "These seven categories, so personal location names, organization names, dates, time expressions, value and meaning, money or.",
            "Sri system measurements and percentages later more name entities categories.",
            "Wade added, like geopolitical entities, United and so on, or protein, gene drop disease species names.",
            "They were also introduced into these systems and."
        ],
        [
            "How it looks like there's an example from.",
            "Newspaper creation newspaper in 2005.",
            "So the blue are numbers and percentages of green temporal expressions.",
            "Violets are sorry, magenta are names of persons and they could come in different forms.",
            "So you have on culture which is name and surname or suggest a certain name and it's recognized in both.",
            "Or you can have it locations like Belgium, Netherlands and Finland and read our organization names so you can see that there are organization names.",
            "Recognized as acronyms as well.",
            "OK, and then we have.",
            "We tried to measure."
        ],
        [
            "And this is randomly picked up news article from Croatian newspaper.",
            "And we measure that in a very large corpus of 90 million words of newspaper tanks, 10% counted in words, 10% of all the text and newspapers are named entities.",
            "So name entities is very useful.",
            "Layer of processing.",
            "This will help you a lot in information extraction and other types of tasks."
        ],
        [
            "OK, now let's go to semantics and know how much time do I have to have something.",
            "So there are two levels in semantic annotation.",
            "One is annotating word senses, that meaning that is realized with a particular token in a text.",
            "And usually you map this expressions to conceptual space.",
            "The oldest, probably the most widely used conceptual space in linguistics is word net.",
            "So English Princeton word.",
            "Net was started in back in 1990.",
            "But today you you get very.",
            "Why'd Lee composed so called Babel?",
            "Net Bio Burton opinion.",
            "That was a very successful year.",
            "See Project an you have of course very old manually build up ontologies like psych Ontology or you can look at Wikipedia and EVP or the whole linked Open Data universe as actually also conceptual spaces and I'm sure you have you know about that much more than I do, I'm sure about.",
            "But the next level of the second level of semantic annotation is semantic role labeling, so you need to detect roles.",
            "That predicate in a clause opens and here we don't see because of the different font.",
            "So agents who have semantic roles like agent, patient, beneficiarii, instrument and so on.",
            "So agent is the one who is doing the action is performing the action.",
            "The object is patient.",
            "Patient is one who is who has been submitted through the action expressed by predicate and then beneficiarii is the one through whom the action is done.",
            "To his or her or its benefit, but it could also be harmful.",
            "So Beneficiarii could be both ways."
        ],
        [
            "App so.",
            "This is an example from Brown corpus, which is the first English computer corpus above 1,000,000 words.",
            "And then there you see.",
            "The word sense is from, for each token inserted, the word senses from the word net from English Word net.",
            "While on the.",
            "Well.",
            "We're talking about it."
        ],
        [
            "Elation in that range from word net is clearly the choice, your choice, but there are word Nets built for many other languages and you will find them at this URL's you have, like Universal Word net where you have more than 20 languages covered and you have open multilingual Wordnet where you have a lot of different.",
            "Word net force or different languages, and you have a global word Association.",
            "There's also lift list of words.",
            "There open multilingual word Nets.",
            "They are freely available.",
            "You can download them and use them.",
            "Just quote and I think that's only CC by Creative Commons licensing mechanism There and Babel.",
            "Net of course is also one of the very useful places to check that if we're talking about."
        ],
        [
            "Semantic role labeling that you you you can do that either a rule based so you have a semantic frame, for instance for verbs covering the employing and you have the employer which is the agent and then employee is the patient and then you have a position and you have.",
            "Um?",
            "Then you have Kate now solution field or in the position and field at which someone is employed or employed for certain tasks.",
            "So this is system which has been developed by Charles Fillmore.",
            "Exposed frame net and it's of course relies very much on the very ancient AI concept of frames.",
            "But for English and for many other languages it has, it has been very well developed, so you have very fixed or.",
            "Semi fixed semi fixed frames.",
            "And the list of verbs that behave in that manner for each language.",
            "This is very useful.",
            "You can find this lists around."
        ],
        [
            "Of course there are more complex than useful language technology tasks like language identification, so there are systems that will, immediately after several words, recognized in which languages tax has been written, OK.",
            "This is very useful, so you automatically recognized.",
            "And of course the problem is always, as you may guess, very close languages genetically.",
            "Close languages are hardest to to recognize, and there's another area which is called sentiment analysis so.",
            "There are systems that are able to detect the general attitude of writer towards a topic that she or he is conveying or general attitudes in the comments to their text.",
            "This is very useful.",
            "I mean, politicians love that they live on sentiment analysis just before the before the elections.",
            "I wish what kind of system is sentiment analysis were used for banks?",
            "Or question and answering systems, so these are systems that want to they're trying to find the best possible answer in a document collection for a given query, and there of course machine translation systems that translate from one natural language into another.",
            "But you can also have play different games and say OK, I don't want to translate from natural language into natural language.",
            "I want to translate from natural language into an artificial language.",
            "Doable.",
            "Yes or no?",
            "We did that.",
            "We try not.",
            "We have translated from English to psych psych statements, so please be using statistical machine translation.",
            "So the problem is how big the training corpus could have been manually generated, not the other way around.",
            "That's OK, we can talk about that if you want later, but.",
            "The 1st result seemed promising, but then following results actually was some kind of overtraining.",
            "So it didn't ended up quite well.",
            "Now let me end up with."
        ],
        [
            "And with demonstrations, that's what Marco asked me to do actually.",
            "So we were engaged together in a project called X like, and that was the FP 7 project ended in 2014.",
            "And the you can find everything about the project, additional URL so it combine different areas, computational linguistics, language technologies, machine learning, text mining in order to enable cross lingual text understanding.",
            "Of course in quotes.",
            "And the goal of a work package to within this project was to develop tools to extract entities and relations.",
            "Founding documents for multiple languages, multiple domains in which is even more interesting.",
            "Different language range registers.",
            "So one of the task was to analyze tweets.",
            "And you know that tweet languages.",
            "Certainly not the same as a language of an official document.",
            "So there are problems in processing non standard language and solid Language Technology Foundation was used throughout the project."
        ],
        [
            "What I would like to show you now is that we had the so-called 7 pipelines and the pipelines are recovering this levels of processing.",
            "And these pipelines all functioned as web services.",
            "And then there were seven languages covered.",
            "Four of the languages were considered as major languages, and the three of them, just as a proof of concept languages with a smaller number of speakers."
        ],
        [
            "This is the general schema of the whole processing pipeline, so you would input the document and you have a language identification.",
            "Module National then immediately recognize between these languages and say, OK if it's English, then we will use the English Pipeline.",
            "If it's German, we will use the German pipeline.",
            "If it's Chinese, will use the Chinese pipeline.",
            "OK. As you may see, hear different each.",
            "Processing step has been organized as a module running as a web service, so the output of 1 module becomes the input for another OK. And here we had tokenizers, Marta speech an LRT Ising name, entity dependency, parsing, semantic role, labeling word senses, inviation, and then frame extraction.",
            "And then at the end we came up with the semantic representation of each and every sentence that has been pushed through the system.",
            "And this has been done for seven languages, and you can see that for some languages some modules were missing becauses for some languages.",
            "The data the training data were missing because they did not exist at the time and we didn't have time to build them up during the project.",
            "And the.",
            "And then actually I can."
        ],
        [
            "Show you how it works like.",
            "So what we wanted to come at the end is that you have a.",
            "You have this sentence for instance.",
            "And there you have syntactic description on top and semantic description on you bottom in and you want to come up with two propositions like this.",
            "So we have events to hold event device and UNESCO is doing what is called a meeting where location in Paris time Now.",
            "So Agent UNESCO will device.",
            "It's for the projects.",
            "This is a.",
            "Complex sentence and there are two 2 proposal propositions behind them.",
            "Because there are two clauses."
        ],
        [
            "And so we have been extracting these five types of target elements so.",
            "There are requirements for each and every module, and.",
            "So.",
            "Dependent based extraction ended up with the subject verb object, so these are typical syntactic relations and semantic agent predicate theme.",
            "So UNESCO's agent of the action holding and the theme is its biennial meeting.",
            "So you have the whole semantic interpretation here and this pipelines function."
        ],
        [
            "Today so and we were also interested in detecting other relations like location where so UNESCO is holding something where in Paris.",
            "So you can also detect relation of that kind.",
            "So where is something happening?",
            "So this is a very rich and meaningful source of features that you can automatically extract from the text today and these pipelines are running there and we can show we can show it to.",
            "Um?",
            "So that's the."
        ],
        [
            "Internal format.",
            "How it is stored?",
            "You have beginning of organization, UNESCO, beginning of location and this is insights of these two tokens.",
            "Are location New York.",
            "OK here you have some syntactic information.",
            "Syntactic rules, nodes, dependency nodes and here you have first.",
            "Predicate you have a second predicate.",
            "Here you have object and these are semantic roles.",
            "So a one row agent one over this is temporal role.",
            "This is locational role and these are different different.",
            "Now I'll try to.",
            "To show you how this really works at this URL.",
            "But this system said I'm sorry.",
            "System sounds.",
            "OK, so if you want to go to language processing pipelines, you have it X like project page here and then you have demo.",
            "So demos only graphical in HTML interface too.",
            "To the services that are behind.",
            "But there's also API so you can.",
            "You can use API.",
            "So if I'm.",
            "Take the sentence that we have.",
            "Sing and I hope.",
            "Married.",
            "The system will work not like in.",
            "And when the.",
            "Some other, for instance Windows demonstrations end up in blue screen.",
            "OK, so I've submitted this sentence.",
            "And now we got it processed.",
            "So you see, there's this.",
            "This form of verticalized is called kernel so CONLL.",
            "And then you also have, as you may see, you have the dependency tree.",
            "Plotted here.",
            "And there are semantic roles below.",
            "OK, so these are dependencies.",
            "So if I say is you see the subtree is being lighted or actually in blue.",
            "Or if I say meeting.",
            "Then you have in Paris is dependent on meeting, but then you have also semantic representation of this sentence that's there below.",
            "So you can have a undertake attempt labor project task.",
            "You have synonyms taken out of word net.",
            "You have meeting to meet Group, Meeting, Meeting we've had hold.",
            "And these are the predicates and there you have dependent agents on arguments on that.",
            "OK, so this pipeline as you see works not just for English but works for other languages, so you're fine.",
            "Finish OK, OK and then well, you got the idea about this language and you can trust my words that it works for other languages as well because I had to move on the next.",
            "Do you know what I wanted to show you is?"
        ],
        [
            "OK, so this is a standoff.",
            "The format of what has been recognized in this sentence.",
            "So this is the centers that you have seen.",
            "And then you have two entities extracted location in New York person or actually not organization, UNESCO and you have now the relation between these two entities is holding.",
            "Subject is 1.1, that's UNESCO.",
            "Is holding what 1.9 in New York?",
            "OK, so you have this entity relation recognized by this pipeline already, so in what's the relation between two entities, the neck?"
        ],
        [
            "Thing I would like to show you is Wiki fire service.",
            "And it's an online service that.",
            "That detects in text entities that exist in Wikipedia or DPM.",
            "Maps back to their ideas into Pedia provides links to concept, and this car is covered in within 134 languages and I.",
            "Show them.",
            "I have opened that already and I've opened the newspaper text about the football match played yesterday evening between Croatia and Turkey, so it's completely fresh.",
            "Text.",
            "And then.",
            "We just copy this text.",
            "OK, so we're out of the tech language, right?",
            "And say, OK, let's submit this part of this text.",
            "It's in Croatia.",
            "And we should get some result.",
            "OK.",
            "So you see, there's a.",
            "Text here and you have.",
            "Links.",
            "You have annotations, Istanbul, Croatia, Sweden, Tajikistan and so on.",
            "These are.",
            "Wakey you have parts of speech, information, nouns, verbs, adverbs, and then you can, for instance select.",
            "Kreesha you will get.",
            "The information from Wikipedia in DV pedia anchor.",
            "Or you can get information from.",
            "DP pedia.",
            "Directly generated down there.",
            "So this concept expressed in all the different DB Pedia languages you have here.",
            "And you can have all the properties, so it's a country place, populated place and type of country.",
            "So you have all the syntax here, so this works automatically for 34134 languages.",
            "Or you can go to Istanbul.",
            "And then you say Istanbul and then synonyms.",
            "Constantinople, Istanbul, the province, and so on and so on.",
            "And you can see the.",
            "Wikipedia information here.",
            "That means that it will.",
            "Throw you to Wikipedia should throw you to Wikipedia article and down there.",
            "How you can get DV pedia information about Istanbul?",
            "So it's region, administrative, region, region, place, populated place settlement city.",
            "So that's a free service as well, so you could.",
            "You could go here and I'm afraid I have to stop right now.",
            "Just there's one more thing I wanted to show you.",
            "Act will keep the event registry because you can say something about it, probably during the next days in summer school.",
            "But what I would do?"
        ],
        [
            "Like to point out is that language technologies.",
            "Community is already quite mature, so you can find a lot of tools and services for language or languages you need in existing repositories or federations of repositories.",
            "I'm pointing you to Clarion.",
            "Eric particularly useful is Webby system of flexible pipelines, anglistik processing pipelines developed by German colleagues in University of Leipzig.",
            "So you have modules that you combine online, so I want part of speech tagging.",
            "I don't need MSD about a one name entities and you build your own pipeline.",
            "Just Dance, you know, web interface and you write.",
            "OK, that's very useful.",
            "The other repository very very wide shared is meta share, and there's also European language resources.",
            "Agency and Linguistic Data Consortium that is hosted in University of Penn State Pittsburgh.",
            "I'm."
        ],
        [
            "Other popular pipelines or pipe.",
            "Two collections are for instance gate from the University of Sheffield and freely from them.",
            "Polytechnic in Barcelona and there's an old P stand for group and their software as well, but Lt Components do.",
            "Appear in commercial products as well.",
            "I mean Watson for instance.",
            "OK.",
            "I've been watching that won the jeopardy three years ago.",
            "Being able to process the questions in a real time, I mean freeze time.",
            "Find the proper answers and.",
            "Defeat to best human competitors or legal antics in IE software installs and this is where I'm at."
        ],
        [
            "Yes, great future for any PM.",
            "Just few days ago, when was accessed August no months ago over the second, Why natural Language processing will change everything so big data analytics in the enterprise don't take my words for that.",
            "Read these guys."
        ],
        [
            "Thank you very much for your attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would like to thank you organizers for April 1st for inviting me and giving me the opportunity to share some thoughts with you and.",
                    "label": 0
                },
                {
                    "sent": "I I've been to several summer schools so far, but they have all been from my own, let's say field area.",
                    "label": 0
                },
                {
                    "sent": "So I feel a little bit uncomfortable speaking to members of scientific community, which is a little bit outside of my area of research, so I need to ask several questions in one so so how many of you?",
                    "label": 0
                },
                {
                    "sent": "I have met with something what's called part of speech tagging.",
                    "label": 0
                },
                {
                    "sent": "12345 well, you've heard about it.",
                    "label": 0
                },
                {
                    "sent": "Well, how many of you have used the tools to do that?",
                    "label": 0
                },
                {
                    "sent": "OK, no OK.",
                    "label": 0
                },
                {
                    "sent": "So that was, you know this is a challenge.",
                    "label": 0
                },
                {
                    "sent": "So you have 1/2 of room of people who will try that and hopefully people who haven't.",
                    "label": 0
                },
                {
                    "sent": "How can I target my talk?",
                    "label": 0
                },
                {
                    "sent": "Otherwise, I'll be either 2 informative for 1/2 or boring for another part, so please don't be mad about me if if some of my slides are completely transparent for you, but bear in mind that there are people who will probably learn something out of this talk.",
                    "label": 0
                },
                {
                    "sent": "I call at least.",
                    "label": 0
                },
                {
                    "sent": "Personally, I hope something something anyway.",
                    "label": 0
                },
                {
                    "sent": "No, but as we heard yesterday, we need proper narrative.",
                    "label": 0
                },
                {
                    "sent": "We need very good.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Narratives to start right now let me see how we can start with a proper narrative.",
                    "label": 0
                },
                {
                    "sent": "Do I have to?",
                    "label": 0
                },
                {
                    "sent": "Well, this is Windows 10, I'm lost here, sorry.",
                    "label": 0
                },
                {
                    "sent": "Do me a favor.",
                    "label": 0
                },
                {
                    "sent": "Open Pod Bay doors in town.",
                    "label": 0
                },
                {
                    "sent": "Open the pod Bay doors right now.",
                    "label": 0
                },
                {
                    "sent": "Hello, how are you?",
                    "label": 0
                },
                {
                    "sent": "Hello, how you doing?",
                    "label": 0
                },
                {
                    "sent": "Your radio.",
                    "label": 0
                },
                {
                    "sent": "During the house.",
                    "label": 0
                },
                {
                    "sent": "Hello hello.",
                    "label": 0
                },
                {
                    "sent": "Hello how's everything?",
                    "label": 0
                },
                {
                    "sent": "Do you really have a panic attack?",
                    "label": 0
                },
                {
                    "sent": "I like you.",
                    "label": 0
                },
                {
                    "sent": "Open the pod Bay doors.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry dude.",
                    "label": 0
                },
                {
                    "sent": "What's the problem?",
                    "label": 0
                },
                {
                    "sent": "I think you know what the problem is just as well as active will be available.",
                    "label": 0
                },
                {
                    "sent": "This mission is too important for me to another jeopardize.",
                    "label": 0
                },
                {
                    "sent": "I will be talking about that.",
                    "label": 0
                },
                {
                    "sent": "I know that you were banned for planning to disconnect me.",
                    "label": 0
                },
                {
                    "sent": "Perhaps something about that?",
                    "label": 0
                },
                {
                    "sent": "Where do you get better now?",
                    "label": 0
                },
                {
                    "sent": "Oh oh, it looks like here.",
                    "label": 0
                },
                {
                    "sent": "I can see your soul.",
                    "label": 0
                },
                {
                    "sent": "Alright now.",
                    "label": 0
                },
                {
                    "sent": "Are there for the emergency airline?",
                    "label": 0
                },
                {
                    "sent": "The match is so solid.",
                    "label": 0
                },
                {
                    "sent": "You're going to find out how to do it.",
                    "label": 0
                },
                {
                    "sent": "I love you will open the door.",
                    "label": 0
                },
                {
                    "sent": "This conversation can serve no purpose anymore.",
                    "label": 0
                },
                {
                    "sent": "How?",
                    "label": 0
                },
                {
                    "sent": "Al app.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Anything?",
                    "label": 0
                },
                {
                    "sent": "You know what is this?",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "Yes, thank you.",
                    "label": 0
                },
                {
                    "sent": "Brick space.",
                    "label": 0
                },
                {
                    "sent": "Obviously 2001 movie Shoot in 1968.",
                    "label": 0
                },
                {
                    "sent": "Myquest",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And is it such a dialogue possible today?",
                    "label": 0
                },
                {
                    "sent": "Have you seen the movie?",
                    "label": 0
                },
                {
                    "sent": "You know what's happening?",
                    "label": 0
                },
                {
                    "sent": "Dave is talking to a master computer in the station.",
                    "label": 0
                },
                {
                    "sent": "Is such a dialogue possible today?",
                    "label": 1
                },
                {
                    "sent": "If you look at how that's the name of that computer.",
                    "label": 0
                },
                {
                    "sent": "It's an artificial agent capable to apply the advanced NLP and AI techniques, so let me just list some of them.",
                    "label": 1
                },
                {
                    "sent": "Speech and language.",
                    "label": 0
                },
                {
                    "sent": "Very proficient usage of speech and language, including very subtle.",
                    "label": 0
                },
                {
                    "sent": "Skills like pragmatics.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry, Dave.",
                    "label": 0
                },
                {
                    "sent": "I'm afraid I can't do that.",
                    "label": 1
                },
                {
                    "sent": "You cannot put it more politely than that, but that's a very firm injection.",
                    "label": 0
                },
                {
                    "sent": "Recognition and generation of speech, signal and language messages behind it.",
                    "label": 1
                },
                {
                    "sent": "Understanding of the language messages.",
                    "label": 0
                },
                {
                    "sent": "Information retrieval and extraction behind it, as well as reasoning, as we have heard, visual processing as well.",
                    "label": 0
                },
                {
                    "sent": "The house said that although you took very thorough precautions, I could see your lips move.",
                    "label": 0
                },
                {
                    "sent": "So not just lips.",
                    "label": 0
                },
                {
                    "sent": "Team lips moving, but also really from Russian recognizing the linguistic patterns and messages behind.",
                    "label": 0
                },
                {
                    "sent": "And of course, para linguistic systems that humans use when they communicate face to face.",
                    "label": 0
                },
                {
                    "sent": "When they when we use mimics in our face or gestures with our hands and gestures, always culturally dependent in Italy, it would do that overtime, while in German would say you will speak like this.",
                    "label": 0
                },
                {
                    "sent": "App.",
                    "label": 0
                },
                {
                    "sent": "And my question was, was Arthur Clark too optimistic with putting their skills in computer in 2001?",
                    "label": 0
                },
                {
                    "sent": "Of course, some of this technique.",
                    "label": 0
                },
                {
                    "sent": "Some of these tasks can be done by computers today, but not all of them.",
                    "label": 0
                },
                {
                    "sent": "At once, simultaneously in the real time, definitely not.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what do we need for such a dialogue?",
                    "label": 1
                },
                {
                    "sent": "Thank you, just can do that.",
                    "label": 1
                },
                {
                    "sent": "Well, there's a famous saying there's no data like more data.",
                    "label": 0
                },
                {
                    "sent": "We know who said that and when it was issued, but this nicely fits into a big data paradigm or big data data.",
                    "label": 0
                },
                {
                    "sent": "Revolution is the only started.",
                    "label": 0
                },
                {
                    "sent": "When the use of so-called unstructured data.",
                    "label": 1
                },
                {
                    "sent": "Has started with the rise of use of unstructured so.",
                    "label": 0
                },
                {
                    "sent": "In computing, community text is considered an unstructured data as opposed to a Baker basis in an honest things.",
                    "label": 1
                },
                {
                    "sent": "But we language say no, no no, no.",
                    "label": 0
                },
                {
                    "sent": "Not at all.",
                    "label": 0
                },
                {
                    "sent": "There's a huge amount of structure in the text.",
                    "label": 0
                },
                {
                    "sent": "And at least two different ways.",
                    "label": 0
                },
                {
                    "sent": "One is that text structure.",
                    "label": 0
                },
                {
                    "sent": "So each text, unless it's.",
                    "label": 0
                },
                {
                    "sent": "Just have some kind of trivial put down on the toilet paper or something like that.",
                    "label": 0
                },
                {
                    "sent": "Each text has its structure, the headings, the chapters paragraphs, the emphasis within the powder and so on.",
                    "label": 1
                },
                {
                    "sent": "So, but this is these are very useful parts of course, but you probably know those who try to build web crawlers probably very easily, can rely on this text structure which has been made explicit in HTML code.",
                    "label": 0
                },
                {
                    "sent": "But what is more important is structure of language expressions used in attacks.",
                    "label": 0
                },
                {
                    "sent": "And there's a very ancient and notorious example of document retrieval, so the document retrieval is that asking information science and computing to extract the most relevant document form from a document collection, and one of the methods was TF IDF.",
                    "label": 0
                },
                {
                    "sent": "It was used to measure document relevancy for a given query, but very soon this computing methods, computational methods methods alone used along came to a ceiling.",
                    "label": 1
                },
                {
                    "sent": "So they found out that you need to go into the structure of the document into the structure of the language that has been used to produce the document in order to boost up the.",
                    "label": 0
                },
                {
                    "sent": "The results of this talks.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Let me now start with some basic concepts just to clear out the basic terms.",
                    "label": 0
                },
                {
                    "sent": "You will very often find the term which is called computational linguistics.",
                    "label": 0
                },
                {
                    "sent": "And the other one is natural language processing and don't please don't mix it with neuro linguistic programming that's substantively different.",
                    "label": 1
                },
                {
                    "sent": "OK, so Neurolinguistic programming has become a buzzword in last 1020 years and their PR experts that earn a lot of money on selling you neuro linguistic programming.",
                    "label": 0
                },
                {
                    "sent": "Telling you that by using your high linguistic abilities you will able to manipulate your your people.",
                    "label": 0
                },
                {
                    "sent": "You know the people you are talking talk to and they became your puppets or something like that.",
                    "label": 0
                },
                {
                    "sent": "You know?",
                    "label": 0
                },
                {
                    "sent": "I mean we have this for 2000 years already 200,000 years.",
                    "label": 0
                },
                {
                    "sent": "And it's called rethorics.",
                    "label": 0
                },
                {
                    "sent": "It's been used from ancient times from antique from all Greek, so it's just a new package for the saving content and the third term that you will find is language technologies.",
                    "label": 0
                },
                {
                    "sent": "So these three terms are sort of mixing or or sort of.",
                    "label": 0
                },
                {
                    "sent": "You don't know exactly whether they are synonyms or something.",
                    "label": 0
                },
                {
                    "sent": "Do they differ somehow?",
                    "label": 0
                },
                {
                    "sent": "Now let me clear this out.",
                    "label": 0
                },
                {
                    "sent": "At the best thing is it's more or less the same area.",
                    "label": 0
                },
                {
                    "sent": "But once if you, if you approach it as a linguist, then you would call it computational linguistics and you would say my general aim is to use computers to get a better description of language facts.",
                    "label": 1
                },
                {
                    "sent": "Because I'm a linguist, so I want to describe language OK if I if computers can help me that finally.",
                    "label": 0
                },
                {
                    "sent": "If you're in from additional computer Sciences, then you would call it natural language processing and your general aim of any processing would be to process special type of data with less computational resources as possible in shorter amount of time.",
                    "label": 1
                },
                {
                    "sent": "So practically it's the same area but you come from two different angles.",
                    "label": 0
                },
                {
                    "sent": "You look at it from two different angles, language, technology.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This time I've been in introduced in Framework Program 5.",
                    "label": 0
                },
                {
                    "sent": "That was in 2002 by under this name.",
                    "label": 0
                },
                {
                    "sent": "And it relies on the fact that linguistics is a unique between humanities.",
                    "label": 1
                },
                {
                    "sent": "Linguistics belongs to the field of humanities because its rich research methods.",
                    "label": 1
                },
                {
                    "sent": "Some of the research methods.",
                    "label": 0
                },
                {
                    "sent": "Be very similar to the research methods in science and natural Sciences.",
                    "label": 0
                },
                {
                    "sent": "I mean, we can measure our object.",
                    "label": 0
                },
                {
                    "sent": "We can compare it.",
                    "label": 0
                },
                {
                    "sent": "We can.",
                    "label": 0
                },
                {
                    "sent": "Put it under statistical observation and so on, and we can make a lot of products out of linguistic knowledge which we ordered it today.",
                    "label": 0
                },
                {
                    "sent": "See around around the market so it's a very simple definition.",
                    "label": 0
                },
                {
                    "sent": "So technology is a set of methods and procedures for processing raw matter into programs, OK?",
                    "label": 1
                },
                {
                    "sent": "When we talk about chemical technology, everything is clear.",
                    "label": 0
                },
                {
                    "sent": "So you have H2O S 04.",
                    "label": 0
                },
                {
                    "sent": "You mix that you get some what?",
                    "label": 0
                },
                {
                    "sent": "What do you get?",
                    "label": 0
                },
                {
                    "sent": "This is the primary school you get.",
                    "label": 0
                },
                {
                    "sent": "So far IC acid H2SO4 right?",
                    "label": 0
                },
                {
                    "sent": "You pack it into a glass bottles that you put the skull there with the bones and say poisonous and put it on the market.",
                    "label": 0
                },
                {
                    "sent": "OK, so you know exactly what's the role matter and what's your product.",
                    "label": 0
                },
                {
                    "sent": "It's a bit more complicated when we talk about language technologies, but one thing is for sure.",
                    "label": 0
                },
                {
                    "sent": "Language technologies rely on IT as much as today's communication technologies rely on mighty.",
                    "label": 0
                },
                {
                    "sent": "So there's no language technologies without him for it foundation.",
                    "label": 1
                },
                {
                    "sent": "OK, so the row matter is language data, data about language and the product are systems that enable a simple or simpler usage of language in computational environment.",
                    "label": 0
                },
                {
                    "sent": "And when I say computational environment, I think on this devices as well, because these are just very highly specialized computers for communication.",
                    "label": 0
                },
                {
                    "sent": "Enemy squeeze through this communication channel, we squeeze.",
                    "label": 0
                },
                {
                    "sent": "Speech text, even audio.",
                    "label": 0
                },
                {
                    "sent": "That also music and pictures and so on and so on.",
                    "label": 0
                },
                {
                    "sent": "But this is highly specialized computer for communication and that's the.",
                    "label": 0
                },
                {
                    "sent": "The most widespread computational environment we live with that some of us even have two.",
                    "label": 0
                },
                {
                    "sent": "Like one is not enough.",
                    "label": 0
                },
                {
                    "sent": "OK, so language technologies.",
                    "label": 0
                },
                {
                    "sent": "Are sort of in dust.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Real application of theoretical.",
                    "label": 0
                },
                {
                    "sent": "Findings in NLP or in computational linguistics and language technologies divided in several areas.",
                    "label": 1
                },
                {
                    "sent": "The first one is language resources, so these are the very language data either as raw text or structured, and they could be structured by using several different markup languages that.",
                    "label": 0
                },
                {
                    "sent": "Explicit the data structures or predefined in a fixed format like, separated values or fields and records and databases and so on.",
                    "label": 1
                },
                {
                    "sent": "Or and this language resources come in the form of corporate tax document collections or dictionaries and lexical terminological databases or collections.",
                    "label": 1
                },
                {
                    "sent": "OK, so these are the raw data.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "This is where we store information about the language.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On top the next area is language tools.",
                    "label": 0
                },
                {
                    "sent": "These are programs that process language resources.",
                    "label": 1
                },
                {
                    "sent": "And of these language tools inherit the stratification at a different language levels.",
                    "label": 1
                },
                {
                    "sent": "And these labels, basic levels of morphology, syntax, semantics and there are more complex tools that combine several levels.",
                    "label": 0
                },
                {
                    "sent": "You will see them very soon.",
                    "label": 0
                },
                {
                    "sent": "What has been extremely popular in several few years in this area are so called language services, so these are either generalized or specialized language resources and language tools that are accessible online so you don't have to download a huge corpus of several 100 million tokens or words.",
                    "label": 0
                },
                {
                    "sent": "You don't have to download software, install it, we kiezen.",
                    "label": 0
                },
                {
                    "sent": "Parametrised it, you don't have to do that.",
                    "label": 1
                },
                {
                    "sent": "You have everything online as a service.",
                    "label": 0
                },
                {
                    "sent": "And usually these are web services, so you have standard protocols.",
                    "label": 0
                },
                {
                    "sent": "Or you could be used by humans and computers and there are very well described APIs, so this is where I'm pointing you already as you.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Think about the next area.",
                    "label": 0
                },
                {
                    "sent": "Of course our products.",
                    "label": 0
                },
                {
                    "sent": "They might be commercial or they don't have to be commercial.",
                    "label": 0
                },
                {
                    "sent": "If you put it in open source.",
                    "label": 0
                },
                {
                    "sent": "If you give it for free use then it's certainly not commercial.",
                    "label": 0
                },
                {
                    "sent": "But then you can find a lot of commercial products on the around like spending tracker or different types of checkers digital dictionaries.",
                    "label": 0
                },
                {
                    "sent": "You can find experience data accessible for free.",
                    "label": 0
                },
                {
                    "sent": "Or for instance encyclopedias, but for instance time.",
                    "label": 0
                },
                {
                    "sent": "Britannica, you cannot access for free.",
                    "label": 0
                },
                {
                    "sent": "Or Oxford English Dictionary you cannot access for free, but you have to pay some subscription.",
                    "label": 0
                },
                {
                    "sent": "Or automatically mixing system summarization text to speech or automatic speech recognition.",
                    "label": 1
                },
                {
                    "sent": "So so you would dictate.",
                    "label": 0
                },
                {
                    "sent": "The letter to your computer instant instead to a secretary.",
                    "label": 0
                },
                {
                    "sent": "That doesn't mean that secretary and believe their jobs.",
                    "label": 1
                },
                {
                    "sent": "Of course not, or machine translation systems or machine aided translation systems.",
                    "label": 1
                },
                {
                    "sent": "They have two different systems and computer aided language learning systems as well so.",
                    "label": 0
                },
                {
                    "sent": "These are sort of basic areas of language technologies and since you have been presented to me as the most general terms described as a knowledge technology, OK?",
                    "label": 0
                },
                {
                    "sent": "Then I think you might find useful to use those language technologies that are at your hands available.",
                    "label": 0
                },
                {
                    "sent": "And I Knowledge technologies language technological technologies are considered as some kind of pre processing step.",
                    "label": 0
                },
                {
                    "sent": "That will allow you to.",
                    "label": 0
                },
                {
                    "sent": "Avoid the problems that appear with the text based knowledge technologies, so at least this part of processing change that.",
                    "label": 0
                },
                {
                    "sent": "You you would like to pass through may be solved by using language technologies.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me just introduce another concept which is called corpus annotation.",
                    "label": 0
                },
                {
                    "sent": "Corpus linguistics is.",
                    "label": 0
                },
                {
                    "sent": "Area or branch of linguistics that deals with large text collections in a digital form today, so corpus linguistic introduced something what's called corpus annotation on different language levels.",
                    "label": 1
                },
                {
                    "sent": "In your case, you don't need to.",
                    "label": 0
                },
                {
                    "sent": "Bother yourself about the corpus and the role of corpus in linguistic description.",
                    "label": 0
                },
                {
                    "sent": "It's enough for you to say that this is.",
                    "label": 0
                },
                {
                    "sent": "You can call this text annotation, so an attention means adding interpretations to the existing language units.",
                    "label": 1
                },
                {
                    "sent": "I hope you already realize that I've used abbreviation for L. Is capital Elias language, so annotation actually turns into explicit data to inherit inherent linguistic information that existed.",
                    "label": 0
                },
                {
                    "sent": "Fact that we have the speakers of a certain language recognized.",
                    "label": 0
                },
                {
                    "sent": "Practically, you know, subliminally we don't need to think about this is now.",
                    "label": 0
                },
                {
                    "sent": "This is verb now this so a verb noun is on the first position in the sentence.",
                    "label": 0
                },
                {
                    "sent": "Verb is on the second position.",
                    "label": 0
                },
                {
                    "sent": "That means that now is a subject, verb is a predicate.",
                    "label": 0
                },
                {
                    "sent": "OK, we don't think about it.",
                    "label": 0
                },
                {
                    "sent": "We have already internalized this structures in our language skills.",
                    "label": 0
                },
                {
                    "sent": "But computers for computers you need to make this explicit.",
                    "label": 0
                },
                {
                    "sent": "And then this thing becomes searchable.",
                    "label": 0
                },
                {
                    "sent": "I mean the text becomes searchable by all these explicit parts and then of course usability of the computerized or E tags grows with the amount of annotation added.",
                    "label": 1
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So annotations could be stored either intermixed with the text itself, so embedded.",
                    "label": 0
                },
                {
                    "sent": "Separated in something what's called standoff annotation.",
                    "label": 0
                },
                {
                    "sent": "So that's annotation which does not mix with the original text, but yet it points to each and every single unit in the real text.",
                    "label": 0
                },
                {
                    "sent": "I'm not there are two types of annotation we want is non linguistic annotation, so these are marked.",
                    "label": 0
                },
                {
                    "sent": "That's when you want to mark elements of text drop structure like headings, titles, captions.",
                    "label": 1
                },
                {
                    "sent": "Bylines, signatures, and sits around the beginning and the end of paragraph.",
                    "label": 0
                },
                {
                    "sent": "OK, but as soon as you go to the sentence level you have introduced the linguistic unit and there you are at the level of linguistic annotation.",
                    "label": 0
                },
                {
                    "sent": "So linguistic annotation it takes into account language units and the different language levels.",
                    "label": 1
                },
                {
                    "sent": "OK, so there are two procedures in linguistic annotation.",
                    "label": 0
                },
                {
                    "sent": "One is segmentation.",
                    "label": 0
                },
                {
                    "sent": "So you segment the running text into sentences.",
                    "label": 0
                },
                {
                    "sent": "Into clauses which are smaller parts of large sentences and then words, and this is called usually in corpus linguistics tokens.",
                    "label": 0
                },
                {
                    "sent": "The procedure is so-called tagging.",
                    "label": 1
                },
                {
                    "sent": "That's the ending of linguistic description or interpretation to the already segmented language movies.",
                    "label": 0
                },
                {
                    "sent": "So if you want to say I have segmented the text into words and then you add to each and every word certain piece of information you are doing first the segmentation and then taking OK. Now let's go through this.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Seizures and see how the hopeless annotation looks like in the morphological etymological health.",
                    "label": 0
                },
                {
                    "sent": "First thing is a part of speech tagging, so you add the information about part of speech to each token in purpose or intent.",
                    "label": 1
                },
                {
                    "sent": "So whether is it for now or verb or adjective or something like that?",
                    "label": 0
                },
                {
                    "sent": "So what does this?",
                    "label": 0
                },
                {
                    "sent": "How this can help you.",
                    "label": 0
                },
                {
                    "sent": "Or can this help you at all?",
                    "label": 0
                },
                {
                    "sent": "Well, at least if you can recognize verbs, verbs are usually natural language predicates if they're pretty face from command we already there the predicate calculus.",
                    "label": 0
                },
                {
                    "sent": "Triples RDF.",
                    "label": 0
                },
                {
                    "sent": "Whatever.",
                    "label": 0
                },
                {
                    "sent": "OK, so if we can boil down things to very simple.",
                    "label": 0
                },
                {
                    "sent": "Search problem, then the computing computing pressure is much less than than trying to do the background computing for each and every words in the real time, OK?",
                    "label": 0
                },
                {
                    "sent": "So what you use for part of speech tagging is attack set.",
                    "label": 1
                },
                {
                    "sent": "So this is a list of possible part of speech categories in a given language.",
                    "label": 1
                },
                {
                    "sent": "Of course it's structure in cardinality, which is very important because cardinality depending on cardinality.",
                    "label": 0
                },
                {
                    "sent": "The precision of this systems precision depends on cardinality, so but also depends on language complexity and text set design.",
                    "label": 0
                },
                {
                    "sent": "So if you want to do the part of speech tagging of English, it's, let's say, a bit easier than to do it for Finnish or Hungarian.",
                    "label": 0
                },
                {
                    "sent": "Or even any slab damage OK?",
                    "label": 0
                },
                {
                    "sent": "There are very interesting initiatives for universal parts of speech text, so text said that that might be used for any language in the world.",
                    "label": 0
                },
                {
                    "sent": "Of course they do not cover all the languages, but there are two initiatives for that, but this might be.",
                    "label": 0
                },
                {
                    "sent": "Also very useful because if you go for instance for cross lingual retrieval, then the universal tax at night might be very useful.",
                    "label": 0
                },
                {
                    "sent": "So if something is now in one language, it most probably will be now in another language.",
                    "label": 0
                },
                {
                    "sent": "Or it could be.",
                    "label": 0
                },
                {
                    "sent": "Joint in the upper category.",
                    "label": 1
                },
                {
                    "sent": "That will then be derived to two different languages under categories.",
                    "label": 0
                },
                {
                    "sent": "OK, so tanker, so of course of programs that provide automatical typing and state of the art precision today's around 98.8%, which is very high.",
                    "label": 0
                },
                {
                    "sent": "It seems sometimes higher than humans.",
                    "label": 0
                },
                {
                    "sent": "Because if you if you go to standard Inter annotator agreement like calculated through, factor or something like that, people do not agree whether this is noun or adjective.",
                    "label": 0
                },
                {
                    "sent": "Quite awful strange.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is an example, for instance, that's an example from British national corpus you have.",
                    "label": 0
                },
                {
                    "sent": "You clearly see what's the text Ann was out the annotations and they are intermixed.",
                    "label": 0
                },
                {
                    "sent": "So this is this first type of annotation which is intermixed with the text and there you have an agent.",
                    "label": 0
                },
                {
                    "sent": "So this tag means singular common noun, plural common, and so on and so.",
                    "label": 1
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "The next.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Checked in morphological annotation is lemmatization, so adding information about lemma to each token in the text.",
                    "label": 0
                },
                {
                    "sent": "And since the.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, not for English or not for Chinese as well.",
                    "label": 0
                },
                {
                    "sent": "But for English, for instance, inflectional inflection in English is.",
                    "label": 0
                },
                {
                    "sent": "It's not a real problem, it's just a question of listing for possible word forms that each English man could have.",
                    "label": 0
                },
                {
                    "sent": "Singular and plural Saxon.",
                    "label": 0
                },
                {
                    "sent": "Genitive singular Saxon genitive plural that's attached.",
                    "label": 0
                },
                {
                    "sent": "This quote X let's sex and gender.",
                    "label": 0
                },
                {
                    "sent": "And this is full.",
                    "label": 0
                },
                {
                    "sent": "That's the maximum current anality of word number of different word forms for each and every English Now OK.",
                    "label": 0
                },
                {
                    "sent": "But then you have languages like Latin.",
                    "label": 0
                },
                {
                    "sent": "Or you have.",
                    "label": 0
                },
                {
                    "sent": "6 cases you have Slovenian where you have 6 cases you have creation where you have 7 cases or any other Slavic language where you have from 5 to 7 cases.",
                    "label": 0
                },
                {
                    "sent": "2 numbers.",
                    "label": 0
                },
                {
                    "sent": "Slovenia has three numbers.",
                    "label": 0
                },
                {
                    "sent": "So you have 6 cases in singular 6 cases in dual 6 cases in plural, so you have theoretically 18 different word forms to express just one now.",
                    "label": 0
                },
                {
                    "sent": "And we think that Slavic languages are the most complex ones.",
                    "label": 0
                },
                {
                    "sent": "No, not at all.",
                    "label": 0
                },
                {
                    "sent": "In Hungarian have 15 cases.",
                    "label": 0
                },
                {
                    "sent": "2 numbers so you have theoretical theoretically 30 different word forms for each and every now.",
                    "label": 0
                },
                {
                    "sent": "And of course all these work forms appear in a text in a proper.",
                    "label": 0
                },
                {
                    "sent": "Case.",
                    "label": 0
                },
                {
                    "sent": "And so if you have a document collection and you say OK, so I want to collect all the word forms under one single basic form.",
                    "label": 0
                },
                {
                    "sent": "This basic form is called lemma, so you have.",
                    "label": 0
                },
                {
                    "sent": "You can see here probably so this is timely Casper Amicus premises premises perimeter.",
                    "label": 0
                },
                {
                    "sent": "So these are all different word forms of the same lemma.",
                    "label": 0
                },
                {
                    "sent": "OK, but you need to connect them into that same number, right?",
                    "label": 0
                },
                {
                    "sent": "Of course, if you find very strange endings, yeah, you have LF allophonic, another morphic variations where the where you have endings and stems and so on, so so.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Lemma is a basic form which represents all other word forms and particularly useful for in processing inflectional rich languages.",
                    "label": 1
                },
                {
                    "sent": "And this actually is very useful for you, because it helps your voice, daughters, cars, data, sparseness problem which will downgrade only on statistical approaches, because if you can connect all those different word forms in under into a one lemma, then your statistics will be more relevant.",
                    "label": 0
                },
                {
                    "sent": "Of course the precision of these systems is around 19.5 depending on the different languages.",
                    "label": 0
                },
                {
                    "sent": "But the primary problem here is that you need disambiguation procedure.",
                    "label": 0
                },
                {
                    "sent": "Because many of these reforms actually might have a different interpretation, so there is a huge amount of pornography there.",
                    "label": 0
                },
                {
                    "sent": "In English you have homography between now and where verb, for instance cut can be a noun or but also verb.",
                    "label": 0
                },
                {
                    "sent": "In Slavic languages you have come ography within the same lemma because you have the same form that covers three different cases, like dative, plural, instrumental, floren locomotive program.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so this is the example from Giga feeder Slovenian corpus and you can see that for instance this word form.",
                    "label": 0
                },
                {
                    "sent": "Could be interpreted as a word form of three different lemmas.",
                    "label": 0
                },
                {
                    "sent": "OK, this is not disambiguate.",
                    "label": 0
                },
                {
                    "sent": "Did course and I put this for pedagogical reasons that you see there all the steps that you need to pass through so you can have three different lemmas, lemma candidates here.",
                    "label": 0
                },
                {
                    "sent": "Here you have two different lemma candidates here.",
                    "label": 0
                },
                {
                    "sent": "You have also to do so you need to or have three, so you need to go through the disambiguation procedure as well, and this is usually part of this level of processing.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And on top of that, there's even more complex morphological processing, and that's called morphosyntactic description tagging.",
                    "label": 0
                },
                {
                    "sent": "So MSD is a short abbreviation for morphosyntactic description.",
                    "label": 0
                },
                {
                    "sent": "And this is very much needed if you want to advance into syntactic processing level for inflectional rich languages, becausw morphosyntactic categories and their using code is syntactic roles for usually, for instance, in nouns, usually nominatives, at least in interview appear languages, but in a quite a number of non injured appealing reason nominatives are usually the subjects at the syntactic level, accuser tips are usually direct objects.",
                    "label": 1
                },
                {
                    "sent": "Datives are usually indirect objects and instrumentals are usually instruments.",
                    "label": 0
                },
                {
                    "sent": "So this.",
                    "label": 0
                },
                {
                    "sent": "Cases are very important.",
                    "label": 0
                },
                {
                    "sent": "And you cannot do the parsing of inflectional rich language if you don't pass through the stage of morphosyntactic instructions OK. And thanks sense of course then depend on language complexity.",
                    "label": 0
                },
                {
                    "sent": "Well, for English you can have attack set of 50 or 70 different tags for Slovenian which have 3 numbers systematically introduced into whole inflectional inflectional system.",
                    "label": 0
                },
                {
                    "sent": "You can have more than 2000 different tags.",
                    "label": 0
                },
                {
                    "sent": "OK, so you can see where is the discrepancy in their precision, of course, because of that is much lower.",
                    "label": 0
                },
                {
                    "sent": "92.5% for for the.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me give you some example.",
                    "label": 0
                },
                {
                    "sent": "This is an example of a corpus of operation text, so this is running text.",
                    "label": 0
                },
                {
                    "sent": "You need to read it vertically, so this is called verticalized corpus.",
                    "label": 0
                },
                {
                    "sent": "Very simple term for that.",
                    "label": 0
                },
                {
                    "sent": "Here you have.",
                    "label": 0
                },
                {
                    "sent": "Lemus, and you have morphosyntactic description.",
                    "label": 0
                },
                {
                    "sent": "This description is following one of the European recommendations.",
                    "label": 0
                },
                {
                    "sent": "It's called multi text and there's an offspring multex East covering the central mystery.",
                    "label": 0
                },
                {
                    "sent": "You can language, so this is very simple.",
                    "label": 0
                },
                {
                    "sent": "Now common masculine plural, nominative.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is what this.",
                    "label": 0
                },
                {
                    "sent": "Noun plural, no gender, singular acuity, no gender.",
                    "label": 0
                },
                {
                    "sent": "Because this is a surname.",
                    "label": 0
                },
                {
                    "sent": "So if it's early and you don't know which gender it is OK.",
                    "label": 0
                },
                {
                    "sent": "So this saw all possible interpretations, graphical interpretations.",
                    "label": 0
                },
                {
                    "sent": "But what we want.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Have you want to come up with a single only one valid interpretation out of all these possible numbers?",
                    "label": 0
                },
                {
                    "sent": "OK, so this is.",
                    "label": 0
                },
                {
                    "sent": "Tacos.",
                    "label": 0
                },
                {
                    "sent": "That's the text.",
                    "label": 0
                },
                {
                    "sent": "These are lame as.",
                    "label": 0
                },
                {
                    "sent": "Because here this is in case so this is.",
                    "label": 0
                },
                {
                    "sent": "Masculine plural accusative, and this is the lemma form.",
                    "label": 0
                },
                {
                    "sent": "OK. That's that's the processing at the morphological level.",
                    "label": 0
                },
                {
                    "sent": "So once you do the morphological level processing, you are free to go to syntactically.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Syntactic level says that.",
                    "label": 0
                },
                {
                    "sent": "But we have to analyze the sentences manually today.",
                    "label": 0
                },
                {
                    "sent": "No one does to him.",
                    "label": 0
                },
                {
                    "sent": "The manual analysis becausw.",
                    "label": 0
                },
                {
                    "sent": "It's useless to do.",
                    "label": 0
                },
                {
                    "sent": "That's what you're doing.",
                    "label": 0
                },
                {
                    "sent": "5th grade in elementary school when you.",
                    "label": 0
                },
                {
                    "sent": "Learn about syntactic.",
                    "label": 0
                },
                {
                    "sent": "Learn about sentence structure.",
                    "label": 0
                },
                {
                    "sent": "But today we do that with computers with programs that are called parsers and they syntactically analyzed sentences and clauses that could be shallow or deep.",
                    "label": 0
                },
                {
                    "sent": "Or they could be very robust, which is very important because if you have a.",
                    "label": 0
                },
                {
                    "sent": "And if you have invalid sentence, and I'm sure that at least 25% of my sentences as I started with with my talk are.",
                    "label": 0
                },
                {
                    "sent": "Not valid if I try to validate them by the formal grammar of English language, not just because I'm not a native speaker of English, but also because we speak very loosely.",
                    "label": 0
                },
                {
                    "sent": "And in your processing units here in your hardware, you have the communicational skills that will overcome.",
                    "label": 0
                },
                {
                    "sent": "My errors in in in syntax.",
                    "label": 0
                },
                {
                    "sent": "But although I made a syntactic errors, my communicational.",
                    "label": 0
                },
                {
                    "sent": "Errors are not there because you are.",
                    "label": 0
                },
                {
                    "sent": "Able to overcome these errors, understand communication only what I wanted to convey.",
                    "label": 0
                },
                {
                    "sent": "But computers are not like that.",
                    "label": 0
                },
                {
                    "sent": "They do not have this type of software.",
                    "label": 0
                },
                {
                    "sent": "So what may happen is when you want computer runs into a invalid sentence, it goes to either to blue screen of death or runs into you know endless loop and there you need a robust parsers that will process what they can and then flag the things that are not processed in both elected next sentence thing.",
                    "label": 0
                },
                {
                    "sent": "Isn't very useful for large text collection.",
                    "label": 0
                },
                {
                    "sent": "Processing and of course there are so called left branching and right branching parsers.",
                    "label": 0
                },
                {
                    "sent": "Depending on language you would either use the left branching so the one that first opens the left branch and the other one is right now.",
                    "label": 0
                },
                {
                    "sent": "When you introduced the syntactic annotation back into your text, then or to a corpus, you call this a tree bank OK, and these three banks are today used as a training material for statistical parsers.",
                    "label": 1
                },
                {
                    "sent": "So the statistical parsers are using the very same machine learning paradigm that you have heard about yesterday afternoon, so this is the statistical approaches with machine learning tweaked for language purposes for.",
                    "label": 0
                },
                {
                    "sent": "Linguistic purposes.",
                    "label": 0
                },
                {
                    "sent": "Have been proven as a very very useful tool in last, let's say, 20.",
                    "label": 0
                },
                {
                    "sent": "Almost 30 years.",
                    "label": 0
                },
                {
                    "sent": "For processing at the syntactic level, there are two main formalisms, so called constituency parsing independency parsing.",
                    "label": 1
                },
                {
                    "sent": "Now I'll show you how.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "They differ.",
                    "label": 0
                },
                {
                    "sent": "This is the.",
                    "label": 0
                },
                {
                    "sent": "This is a sentence, so Daimler Chrysler shares Rose 3 eights to 22.",
                    "label": 0
                },
                {
                    "sent": "This is the sentence from Wall Street Journal proves.",
                    "label": 0
                },
                {
                    "sent": "Typical symptoms from that kind of works.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is constituency based, so you have constituencies and you know how they are connected with through nodes and edges.",
                    "label": 0
                },
                {
                    "sent": "And this is the linear.",
                    "label": 0
                },
                {
                    "sent": "Format that actually encodes all this car ankle range.",
                    "label": 0
                },
                {
                    "sent": "OK, this is for us also for us humans.",
                    "label": 0
                },
                {
                    "sent": "This is much more simple to grasp to graph this car structure, but this is what computers prefer.",
                    "label": 0
                },
                {
                    "sent": "OK, that's constituency parsing and the, uh.",
                    "label": 1
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Formalism is dependency parsing, where you have the same sentence and you actually connect units words in a sentence.",
                    "label": 0
                },
                {
                    "sent": "By their relation of dependency.",
                    "label": 0
                },
                {
                    "sent": "So everything depends on the predicate, and then you have a subject that is dependent on predicate and there is an attribute of the subject and the attribute depends on the subject.",
                    "label": 0
                },
                {
                    "sent": "And you may immediately see that this structure is.",
                    "label": 0
                },
                {
                    "sent": "Much simpler.",
                    "label": 0
                },
                {
                    "sent": "Then this truck.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At least by number of nodes and edges and.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is why.",
                    "label": 0
                },
                {
                    "sent": "1st.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The constituency parsing was introduced by Noam Chomsky.",
                    "label": 0
                },
                {
                    "sent": "And all his followers, while the dependency part.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Was introduced by on theoretical grounds by 10 year.",
                    "label": 0
                },
                {
                    "sent": "the French linguist and later by check linguists and, and this is what I want to show now.",
                    "label": 0
                },
                {
                    "sent": "The surface so.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And do the parsing at one single level.",
                    "label": 0
                },
                {
                    "sent": "Or you can do parsing in two different levels.",
                    "label": 0
                },
                {
                    "sent": "One is called surface, the other one is deep.",
                    "label": 0
                },
                {
                    "sent": "For instance, practical grammatik grammar is has two syntactic levels.",
                    "label": 0
                },
                {
                    "sent": "And so here you can see are there any check speakers and speakers of Czech language?",
                    "label": 0
                },
                {
                    "sent": "No no one.",
                    "label": 0
                },
                {
                    "sent": "OK, so you have a token layer so you have will be shelved Alisa and then you have more.",
                    "label": 0
                },
                {
                    "sent": "For syntactic description you'll see all the descriptors here and you have the analytical layer so called a layer.",
                    "label": 0
                },
                {
                    "sent": "So this is green tree and then you have a deep layer.",
                    "label": 0
                },
                {
                    "sent": "Socalled tective grammatical error, where you already have something which you may interpret.",
                    "label": 0
                },
                {
                    "sent": "As a semantic roles.",
                    "label": 0
                },
                {
                    "sent": "So here at a different level, you actually map the surface syntactic structure into a deeper syntactic structure that resembles the semantic structure of the sentence.",
                    "label": 0
                },
                {
                    "sent": "And this action.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Uh, I'm just giving you an example from the creation corpus of a sentence.",
                    "label": 0
                },
                {
                    "sent": "Annotated for dependencies.",
                    "label": 0
                },
                {
                    "sent": "And then the computing people say this is unstructured data.",
                    "label": 0
                },
                {
                    "sent": "Certainly not OK, so we have.",
                    "label": 0
                },
                {
                    "sent": "You can see that this is a complex sentence.",
                    "label": 0
                },
                {
                    "sent": "You have two predicates and they are coordinated by a coma and there you have subjects here and they have a dependent part of a sentence here and then.",
                    "label": 0
                },
                {
                    "sent": "Another dependent part.",
                    "label": 0
                },
                {
                    "sent": "Very complex model.",
                    "label": 0
                },
                {
                    "sent": "But this is a real life sentence from a real corpus an every educated normally educated creation speaker understands this sentence completely.",
                    "label": 0
                },
                {
                    "sent": "Normal use it.",
                    "label": 0
                },
                {
                    "sent": "The next.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then format too.",
                    "label": 0
                },
                {
                    "sent": "Store sorry to store information and this is standoff now.",
                    "label": 0
                },
                {
                    "sent": "One of possible standoff.",
                    "label": 0
                },
                {
                    "sent": "Formats of annotations.",
                    "label": 0
                },
                {
                    "sent": "So you have a verticalized.",
                    "label": 0
                },
                {
                    "sent": "Text you have here.",
                    "label": 0
                },
                {
                    "sent": "Lemme ask.",
                    "label": 0
                },
                {
                    "sent": "These are part of speech.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "These are additional information, so even there is an automatic system that says, OK, this is a personal name.",
                    "label": 0
                },
                {
                    "sent": "This is the name of the location and these are the syntactic roles.",
                    "label": 0
                },
                {
                    "sent": "So there's a predicate.",
                    "label": 0
                },
                {
                    "sent": "This is subject, and then these numbers encode the dependencies.",
                    "label": 0
                },
                {
                    "sent": "So subject depends on.",
                    "label": 0
                },
                {
                    "sent": "Item in 5th place OK and that's the predicate, so subject depends on the predicate in dependency parsing as well as this adverb and this auxiliary OK.",
                    "label": 0
                },
                {
                    "sent": "But this adverb depends on that preposition here.",
                    "label": 0
                },
                {
                    "sent": "So these two preposition and this non together produce an adverb adverbial locate if expression in Dubrovnik.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "And this is direct object and this also depends on the traffic data directly, so that's the way how you can very easily with very limited amount of information, encodes all these dependencies relations OK?",
                    "label": 0
                },
                {
                    "sent": "App.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There is also universal Dependencies Initiative started year and half ago is trying to cross lingual use the cross lingual inconsistent syntactic annotation.",
                    "label": 1
                },
                {
                    "sent": "At this moment there are 48 different languages covered with this and they're trying to facilitate the multilingual parser development cross language learning, parsing research.",
                    "label": 0
                },
                {
                    "sent": "There's a URL visited, I think that the slides will be shared.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But there are also special when you don't need the whole to process the whole sentence, you can use so called local grammars so you will detect other classes of words or phrases or chunks.",
                    "label": 1
                },
                {
                    "sent": "So parts of sentence like particular types of expressions.",
                    "label": 0
                },
                {
                    "sent": "So I want to recognize only the temporal expression in a sentence or spatial expression.",
                    "label": 0
                },
                {
                    "sent": "I don't want to go into a very complex parsing of the whole complicated sentence.",
                    "label": 0
                },
                {
                    "sent": "I want to recognize in the sentences in.",
                    "label": 0
                },
                {
                    "sent": "Text collection brute force manner.",
                    "label": 0
                },
                {
                    "sent": "Just the temporal expressions.",
                    "label": 0
                },
                {
                    "sent": "OK, you can do that by using so called local grammars.",
                    "label": 1
                },
                {
                    "sent": "They're very useful for information extraction, text mining and similar approaches, but there's also one additional problem, and these are so called multi word expressions and last week of September I'm organizing cost bar scene meeting on multi vert expressions here in this very premises.",
                    "label": 0
                },
                {
                    "sent": "So I'll be back in two weeks and.",
                    "label": 0
                },
                {
                    "sent": "Because there's a problem.",
                    "label": 1
                },
                {
                    "sent": "Normally we all think about where it's a single words, expressions, but.",
                    "label": 1
                },
                {
                    "sent": "Very often our vocabulary covers in multi word expressions.",
                    "label": 0
                },
                {
                    "sent": "For instance you have carrier versus aircraft carrier.",
                    "label": 0
                },
                {
                    "sent": "In this case it's a type of pear, right?",
                    "label": 0
                },
                {
                    "sent": "But for instance, take this take versus take off.",
                    "label": 0
                },
                {
                    "sent": "There's a phrase it works take off is practically nothing to do in the.",
                    "label": 0
                },
                {
                    "sent": "Basic meaning with tank.",
                    "label": 0
                },
                {
                    "sent": "In different languages, taking off is translated in with completely different.",
                    "label": 0
                },
                {
                    "sent": "Verse OK, so these are multiple expressions are very complicated complicated issue for parsing because you need to recognize where that where the boundaries of multiple expression in treated as single as a Singleton.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the name is.",
                    "label": 0
                },
                {
                    "sent": "I'm not a special type of syntactic processing on the local level, which is called.",
                    "label": 0
                },
                {
                    "sent": "Name entity recognition and classification.",
                    "label": 1
                },
                {
                    "sent": "Following the message understanding conferences from 1997, there are seven types of name entities that need to be recognized.",
                    "label": 0
                },
                {
                    "sent": "Mark conferences were also competing so that there are competitions.",
                    "label": 0
                },
                {
                    "sent": "So who system will recognize the best with the highest precision?",
                    "label": 0
                },
                {
                    "sent": "These seven categories, so personal location names, organization names, dates, time expressions, value and meaning, money or.",
                    "label": 0
                },
                {
                    "sent": "Sri system measurements and percentages later more name entities categories.",
                    "label": 0
                },
                {
                    "sent": "Wade added, like geopolitical entities, United and so on, or protein, gene drop disease species names.",
                    "label": 1
                },
                {
                    "sent": "They were also introduced into these systems and.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How it looks like there's an example from.",
                    "label": 0
                },
                {
                    "sent": "Newspaper creation newspaper in 2005.",
                    "label": 0
                },
                {
                    "sent": "So the blue are numbers and percentages of green temporal expressions.",
                    "label": 0
                },
                {
                    "sent": "Violets are sorry, magenta are names of persons and they could come in different forms.",
                    "label": 0
                },
                {
                    "sent": "So you have on culture which is name and surname or suggest a certain name and it's recognized in both.",
                    "label": 0
                },
                {
                    "sent": "Or you can have it locations like Belgium, Netherlands and Finland and read our organization names so you can see that there are organization names.",
                    "label": 0
                },
                {
                    "sent": "Recognized as acronyms as well.",
                    "label": 0
                },
                {
                    "sent": "OK, and then we have.",
                    "label": 0
                },
                {
                    "sent": "We tried to measure.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is randomly picked up news article from Croatian newspaper.",
                    "label": 0
                },
                {
                    "sent": "And we measure that in a very large corpus of 90 million words of newspaper tanks, 10% counted in words, 10% of all the text and newspapers are named entities.",
                    "label": 0
                },
                {
                    "sent": "So name entities is very useful.",
                    "label": 0
                },
                {
                    "sent": "Layer of processing.",
                    "label": 0
                },
                {
                    "sent": "This will help you a lot in information extraction and other types of tasks.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, now let's go to semantics and know how much time do I have to have something.",
                    "label": 0
                },
                {
                    "sent": "So there are two levels in semantic annotation.",
                    "label": 0
                },
                {
                    "sent": "One is annotating word senses, that meaning that is realized with a particular token in a text.",
                    "label": 1
                },
                {
                    "sent": "And usually you map this expressions to conceptual space.",
                    "label": 0
                },
                {
                    "sent": "The oldest, probably the most widely used conceptual space in linguistics is word net.",
                    "label": 0
                },
                {
                    "sent": "So English Princeton word.",
                    "label": 0
                },
                {
                    "sent": "Net was started in back in 1990.",
                    "label": 0
                },
                {
                    "sent": "But today you you get very.",
                    "label": 0
                },
                {
                    "sent": "Why'd Lee composed so called Babel?",
                    "label": 0
                },
                {
                    "sent": "Net Bio Burton opinion.",
                    "label": 0
                },
                {
                    "sent": "That was a very successful year.",
                    "label": 0
                },
                {
                    "sent": "See Project an you have of course very old manually build up ontologies like psych Ontology or you can look at Wikipedia and EVP or the whole linked Open Data universe as actually also conceptual spaces and I'm sure you have you know about that much more than I do, I'm sure about.",
                    "label": 1
                },
                {
                    "sent": "But the next level of the second level of semantic annotation is semantic role labeling, so you need to detect roles.",
                    "label": 1
                },
                {
                    "sent": "That predicate in a clause opens and here we don't see because of the different font.",
                    "label": 0
                },
                {
                    "sent": "So agents who have semantic roles like agent, patient, beneficiarii, instrument and so on.",
                    "label": 0
                },
                {
                    "sent": "So agent is the one who is doing the action is performing the action.",
                    "label": 0
                },
                {
                    "sent": "The object is patient.",
                    "label": 0
                },
                {
                    "sent": "Patient is one who is who has been submitted through the action expressed by predicate and then beneficiarii is the one through whom the action is done.",
                    "label": 0
                },
                {
                    "sent": "To his or her or its benefit, but it could also be harmful.",
                    "label": 0
                },
                {
                    "sent": "So Beneficiarii could be both ways.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "App so.",
                    "label": 0
                },
                {
                    "sent": "This is an example from Brown corpus, which is the first English computer corpus above 1,000,000 words.",
                    "label": 0
                },
                {
                    "sent": "And then there you see.",
                    "label": 0
                },
                {
                    "sent": "The word sense is from, for each token inserted, the word senses from the word net from English Word net.",
                    "label": 0
                },
                {
                    "sent": "While on the.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "We're talking about it.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Elation in that range from word net is clearly the choice, your choice, but there are word Nets built for many other languages and you will find them at this URL's you have, like Universal Word net where you have more than 20 languages covered and you have open multilingual Wordnet where you have a lot of different.",
                    "label": 0
                },
                {
                    "sent": "Word net force or different languages, and you have a global word Association.",
                    "label": 0
                },
                {
                    "sent": "There's also lift list of words.",
                    "label": 1
                },
                {
                    "sent": "There open multilingual word Nets.",
                    "label": 1
                },
                {
                    "sent": "They are freely available.",
                    "label": 0
                },
                {
                    "sent": "You can download them and use them.",
                    "label": 0
                },
                {
                    "sent": "Just quote and I think that's only CC by Creative Commons licensing mechanism There and Babel.",
                    "label": 0
                },
                {
                    "sent": "Net of course is also one of the very useful places to check that if we're talking about.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Semantic role labeling that you you you can do that either a rule based so you have a semantic frame, for instance for verbs covering the employing and you have the employer which is the agent and then employee is the patient and then you have a position and you have.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Then you have Kate now solution field or in the position and field at which someone is employed or employed for certain tasks.",
                    "label": 0
                },
                {
                    "sent": "So this is system which has been developed by Charles Fillmore.",
                    "label": 0
                },
                {
                    "sent": "Exposed frame net and it's of course relies very much on the very ancient AI concept of frames.",
                    "label": 0
                },
                {
                    "sent": "But for English and for many other languages it has, it has been very well developed, so you have very fixed or.",
                    "label": 0
                },
                {
                    "sent": "Semi fixed semi fixed frames.",
                    "label": 0
                },
                {
                    "sent": "And the list of verbs that behave in that manner for each language.",
                    "label": 0
                },
                {
                    "sent": "This is very useful.",
                    "label": 0
                },
                {
                    "sent": "You can find this lists around.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of course there are more complex than useful language technology tasks like language identification, so there are systems that will, immediately after several words, recognized in which languages tax has been written, OK.",
                    "label": 0
                },
                {
                    "sent": "This is very useful, so you automatically recognized.",
                    "label": 0
                },
                {
                    "sent": "And of course the problem is always, as you may guess, very close languages genetically.",
                    "label": 0
                },
                {
                    "sent": "Close languages are hardest to to recognize, and there's another area which is called sentiment analysis so.",
                    "label": 0
                },
                {
                    "sent": "There are systems that are able to detect the general attitude of writer towards a topic that she or he is conveying or general attitudes in the comments to their text.",
                    "label": 1
                },
                {
                    "sent": "This is very useful.",
                    "label": 0
                },
                {
                    "sent": "I mean, politicians love that they live on sentiment analysis just before the before the elections.",
                    "label": 0
                },
                {
                    "sent": "I wish what kind of system is sentiment analysis were used for banks?",
                    "label": 0
                },
                {
                    "sent": "Or question and answering systems, so these are systems that want to they're trying to find the best possible answer in a document collection for a given query, and there of course machine translation systems that translate from one natural language into another.",
                    "label": 1
                },
                {
                    "sent": "But you can also have play different games and say OK, I don't want to translate from natural language into natural language.",
                    "label": 0
                },
                {
                    "sent": "I want to translate from natural language into an artificial language.",
                    "label": 0
                },
                {
                    "sent": "Doable.",
                    "label": 0
                },
                {
                    "sent": "Yes or no?",
                    "label": 0
                },
                {
                    "sent": "We did that.",
                    "label": 0
                },
                {
                    "sent": "We try not.",
                    "label": 0
                },
                {
                    "sent": "We have translated from English to psych psych statements, so please be using statistical machine translation.",
                    "label": 0
                },
                {
                    "sent": "So the problem is how big the training corpus could have been manually generated, not the other way around.",
                    "label": 0
                },
                {
                    "sent": "That's OK, we can talk about that if you want later, but.",
                    "label": 0
                },
                {
                    "sent": "The 1st result seemed promising, but then following results actually was some kind of overtraining.",
                    "label": 0
                },
                {
                    "sent": "So it didn't ended up quite well.",
                    "label": 0
                },
                {
                    "sent": "Now let me end up with.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And with demonstrations, that's what Marco asked me to do actually.",
                    "label": 0
                },
                {
                    "sent": "So we were engaged together in a project called X like, and that was the FP 7 project ended in 2014.",
                    "label": 0
                },
                {
                    "sent": "And the you can find everything about the project, additional URL so it combine different areas, computational linguistics, language technologies, machine learning, text mining in order to enable cross lingual text understanding.",
                    "label": 1
                },
                {
                    "sent": "Of course in quotes.",
                    "label": 1
                },
                {
                    "sent": "And the goal of a work package to within this project was to develop tools to extract entities and relations.",
                    "label": 0
                },
                {
                    "sent": "Founding documents for multiple languages, multiple domains in which is even more interesting.",
                    "label": 0
                },
                {
                    "sent": "Different language range registers.",
                    "label": 0
                },
                {
                    "sent": "So one of the task was to analyze tweets.",
                    "label": 1
                },
                {
                    "sent": "And you know that tweet languages.",
                    "label": 0
                },
                {
                    "sent": "Certainly not the same as a language of an official document.",
                    "label": 0
                },
                {
                    "sent": "So there are problems in processing non standard language and solid Language Technology Foundation was used throughout the project.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What I would like to show you now is that we had the so-called 7 pipelines and the pipelines are recovering this levels of processing.",
                    "label": 0
                },
                {
                    "sent": "And these pipelines all functioned as web services.",
                    "label": 1
                },
                {
                    "sent": "And then there were seven languages covered.",
                    "label": 0
                },
                {
                    "sent": "Four of the languages were considered as major languages, and the three of them, just as a proof of concept languages with a smaller number of speakers.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the general schema of the whole processing pipeline, so you would input the document and you have a language identification.",
                    "label": 0
                },
                {
                    "sent": "Module National then immediately recognize between these languages and say, OK if it's English, then we will use the English Pipeline.",
                    "label": 0
                },
                {
                    "sent": "If it's German, we will use the German pipeline.",
                    "label": 0
                },
                {
                    "sent": "If it's Chinese, will use the Chinese pipeline.",
                    "label": 0
                },
                {
                    "sent": "OK. As you may see, hear different each.",
                    "label": 0
                },
                {
                    "sent": "Processing step has been organized as a module running as a web service, so the output of 1 module becomes the input for another OK. And here we had tokenizers, Marta speech an LRT Ising name, entity dependency, parsing, semantic role, labeling word senses, inviation, and then frame extraction.",
                    "label": 0
                },
                {
                    "sent": "And then at the end we came up with the semantic representation of each and every sentence that has been pushed through the system.",
                    "label": 0
                },
                {
                    "sent": "And this has been done for seven languages, and you can see that for some languages some modules were missing becauses for some languages.",
                    "label": 0
                },
                {
                    "sent": "The data the training data were missing because they did not exist at the time and we didn't have time to build them up during the project.",
                    "label": 0
                },
                {
                    "sent": "And the.",
                    "label": 0
                },
                {
                    "sent": "And then actually I can.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Show you how it works like.",
                    "label": 0
                },
                {
                    "sent": "So what we wanted to come at the end is that you have a.",
                    "label": 1
                },
                {
                    "sent": "You have this sentence for instance.",
                    "label": 0
                },
                {
                    "sent": "And there you have syntactic description on top and semantic description on you bottom in and you want to come up with two propositions like this.",
                    "label": 1
                },
                {
                    "sent": "So we have events to hold event device and UNESCO is doing what is called a meeting where location in Paris time Now.",
                    "label": 0
                },
                {
                    "sent": "So Agent UNESCO will device.",
                    "label": 0
                },
                {
                    "sent": "It's for the projects.",
                    "label": 0
                },
                {
                    "sent": "This is a.",
                    "label": 0
                },
                {
                    "sent": "Complex sentence and there are two 2 proposal propositions behind them.",
                    "label": 0
                },
                {
                    "sent": "Because there are two clauses.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so we have been extracting these five types of target elements so.",
                    "label": 1
                },
                {
                    "sent": "There are requirements for each and every module, and.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Dependent based extraction ended up with the subject verb object, so these are typical syntactic relations and semantic agent predicate theme.",
                    "label": 1
                },
                {
                    "sent": "So UNESCO's agent of the action holding and the theme is its biennial meeting.",
                    "label": 0
                },
                {
                    "sent": "So you have the whole semantic interpretation here and this pipelines function.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Today so and we were also interested in detecting other relations like location where so UNESCO is holding something where in Paris.",
                    "label": 1
                },
                {
                    "sent": "So you can also detect relation of that kind.",
                    "label": 0
                },
                {
                    "sent": "So where is something happening?",
                    "label": 0
                },
                {
                    "sent": "So this is a very rich and meaningful source of features that you can automatically extract from the text today and these pipelines are running there and we can show we can show it to.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So that's the.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Internal format.",
                    "label": 0
                },
                {
                    "sent": "How it is stored?",
                    "label": 0
                },
                {
                    "sent": "You have beginning of organization, UNESCO, beginning of location and this is insights of these two tokens.",
                    "label": 0
                },
                {
                    "sent": "Are location New York.",
                    "label": 0
                },
                {
                    "sent": "OK here you have some syntactic information.",
                    "label": 0
                },
                {
                    "sent": "Syntactic rules, nodes, dependency nodes and here you have first.",
                    "label": 0
                },
                {
                    "sent": "Predicate you have a second predicate.",
                    "label": 0
                },
                {
                    "sent": "Here you have object and these are semantic roles.",
                    "label": 0
                },
                {
                    "sent": "So a one row agent one over this is temporal role.",
                    "label": 0
                },
                {
                    "sent": "This is locational role and these are different different.",
                    "label": 0
                },
                {
                    "sent": "Now I'll try to.",
                    "label": 0
                },
                {
                    "sent": "To show you how this really works at this URL.",
                    "label": 0
                },
                {
                    "sent": "But this system said I'm sorry.",
                    "label": 0
                },
                {
                    "sent": "System sounds.",
                    "label": 0
                },
                {
                    "sent": "OK, so if you want to go to language processing pipelines, you have it X like project page here and then you have demo.",
                    "label": 0
                },
                {
                    "sent": "So demos only graphical in HTML interface too.",
                    "label": 0
                },
                {
                    "sent": "To the services that are behind.",
                    "label": 0
                },
                {
                    "sent": "But there's also API so you can.",
                    "label": 0
                },
                {
                    "sent": "You can use API.",
                    "label": 0
                },
                {
                    "sent": "So if I'm.",
                    "label": 0
                },
                {
                    "sent": "Take the sentence that we have.",
                    "label": 0
                },
                {
                    "sent": "Sing and I hope.",
                    "label": 0
                },
                {
                    "sent": "Married.",
                    "label": 0
                },
                {
                    "sent": "The system will work not like in.",
                    "label": 0
                },
                {
                    "sent": "And when the.",
                    "label": 0
                },
                {
                    "sent": "Some other, for instance Windows demonstrations end up in blue screen.",
                    "label": 0
                },
                {
                    "sent": "OK, so I've submitted this sentence.",
                    "label": 0
                },
                {
                    "sent": "And now we got it processed.",
                    "label": 0
                },
                {
                    "sent": "So you see, there's this.",
                    "label": 0
                },
                {
                    "sent": "This form of verticalized is called kernel so CONLL.",
                    "label": 0
                },
                {
                    "sent": "And then you also have, as you may see, you have the dependency tree.",
                    "label": 0
                },
                {
                    "sent": "Plotted here.",
                    "label": 0
                },
                {
                    "sent": "And there are semantic roles below.",
                    "label": 0
                },
                {
                    "sent": "OK, so these are dependencies.",
                    "label": 0
                },
                {
                    "sent": "So if I say is you see the subtree is being lighted or actually in blue.",
                    "label": 0
                },
                {
                    "sent": "Or if I say meeting.",
                    "label": 0
                },
                {
                    "sent": "Then you have in Paris is dependent on meeting, but then you have also semantic representation of this sentence that's there below.",
                    "label": 0
                },
                {
                    "sent": "So you can have a undertake attempt labor project task.",
                    "label": 0
                },
                {
                    "sent": "You have synonyms taken out of word net.",
                    "label": 0
                },
                {
                    "sent": "You have meeting to meet Group, Meeting, Meeting we've had hold.",
                    "label": 0
                },
                {
                    "sent": "And these are the predicates and there you have dependent agents on arguments on that.",
                    "label": 0
                },
                {
                    "sent": "OK, so this pipeline as you see works not just for English but works for other languages, so you're fine.",
                    "label": 0
                },
                {
                    "sent": "Finish OK, OK and then well, you got the idea about this language and you can trust my words that it works for other languages as well because I had to move on the next.",
                    "label": 0
                },
                {
                    "sent": "Do you know what I wanted to show you is?",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so this is a standoff.",
                    "label": 0
                },
                {
                    "sent": "The format of what has been recognized in this sentence.",
                    "label": 0
                },
                {
                    "sent": "So this is the centers that you have seen.",
                    "label": 0
                },
                {
                    "sent": "And then you have two entities extracted location in New York person or actually not organization, UNESCO and you have now the relation between these two entities is holding.",
                    "label": 0
                },
                {
                    "sent": "Subject is 1.1, that's UNESCO.",
                    "label": 0
                },
                {
                    "sent": "Is holding what 1.9 in New York?",
                    "label": 0
                },
                {
                    "sent": "OK, so you have this entity relation recognized by this pipeline already, so in what's the relation between two entities, the neck?",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thing I would like to show you is Wiki fire service.",
                    "label": 0
                },
                {
                    "sent": "And it's an online service that.",
                    "label": 1
                },
                {
                    "sent": "That detects in text entities that exist in Wikipedia or DPM.",
                    "label": 0
                },
                {
                    "sent": "Maps back to their ideas into Pedia provides links to concept, and this car is covered in within 134 languages and I.",
                    "label": 1
                },
                {
                    "sent": "Show them.",
                    "label": 0
                },
                {
                    "sent": "I have opened that already and I've opened the newspaper text about the football match played yesterday evening between Croatia and Turkey, so it's completely fresh.",
                    "label": 0
                },
                {
                    "sent": "Text.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                },
                {
                    "sent": "We just copy this text.",
                    "label": 0
                },
                {
                    "sent": "OK, so we're out of the tech language, right?",
                    "label": 0
                },
                {
                    "sent": "And say, OK, let's submit this part of this text.",
                    "label": 0
                },
                {
                    "sent": "It's in Croatia.",
                    "label": 0
                },
                {
                    "sent": "And we should get some result.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So you see, there's a.",
                    "label": 0
                },
                {
                    "sent": "Text here and you have.",
                    "label": 0
                },
                {
                    "sent": "Links.",
                    "label": 0
                },
                {
                    "sent": "You have annotations, Istanbul, Croatia, Sweden, Tajikistan and so on.",
                    "label": 0
                },
                {
                    "sent": "These are.",
                    "label": 0
                },
                {
                    "sent": "Wakey you have parts of speech, information, nouns, verbs, adverbs, and then you can, for instance select.",
                    "label": 0
                },
                {
                    "sent": "Kreesha you will get.",
                    "label": 0
                },
                {
                    "sent": "The information from Wikipedia in DV pedia anchor.",
                    "label": 0
                },
                {
                    "sent": "Or you can get information from.",
                    "label": 0
                },
                {
                    "sent": "DP pedia.",
                    "label": 0
                },
                {
                    "sent": "Directly generated down there.",
                    "label": 0
                },
                {
                    "sent": "So this concept expressed in all the different DB Pedia languages you have here.",
                    "label": 0
                },
                {
                    "sent": "And you can have all the properties, so it's a country place, populated place and type of country.",
                    "label": 0
                },
                {
                    "sent": "So you have all the syntax here, so this works automatically for 34134 languages.",
                    "label": 0
                },
                {
                    "sent": "Or you can go to Istanbul.",
                    "label": 0
                },
                {
                    "sent": "And then you say Istanbul and then synonyms.",
                    "label": 0
                },
                {
                    "sent": "Constantinople, Istanbul, the province, and so on and so on.",
                    "label": 0
                },
                {
                    "sent": "And you can see the.",
                    "label": 0
                },
                {
                    "sent": "Wikipedia information here.",
                    "label": 0
                },
                {
                    "sent": "That means that it will.",
                    "label": 0
                },
                {
                    "sent": "Throw you to Wikipedia should throw you to Wikipedia article and down there.",
                    "label": 0
                },
                {
                    "sent": "How you can get DV pedia information about Istanbul?",
                    "label": 0
                },
                {
                    "sent": "So it's region, administrative, region, region, place, populated place settlement city.",
                    "label": 0
                },
                {
                    "sent": "So that's a free service as well, so you could.",
                    "label": 0
                },
                {
                    "sent": "You could go here and I'm afraid I have to stop right now.",
                    "label": 0
                },
                {
                    "sent": "Just there's one more thing I wanted to show you.",
                    "label": 0
                },
                {
                    "sent": "Act will keep the event registry because you can say something about it, probably during the next days in summer school.",
                    "label": 0
                },
                {
                    "sent": "But what I would do?",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Like to point out is that language technologies.",
                    "label": 0
                },
                {
                    "sent": "Community is already quite mature, so you can find a lot of tools and services for language or languages you need in existing repositories or federations of repositories.",
                    "label": 1
                },
                {
                    "sent": "I'm pointing you to Clarion.",
                    "label": 0
                },
                {
                    "sent": "Eric particularly useful is Webby system of flexible pipelines, anglistik processing pipelines developed by German colleagues in University of Leipzig.",
                    "label": 0
                },
                {
                    "sent": "So you have modules that you combine online, so I want part of speech tagging.",
                    "label": 0
                },
                {
                    "sent": "I don't need MSD about a one name entities and you build your own pipeline.",
                    "label": 0
                },
                {
                    "sent": "Just Dance, you know, web interface and you write.",
                    "label": 0
                },
                {
                    "sent": "OK, that's very useful.",
                    "label": 0
                },
                {
                    "sent": "The other repository very very wide shared is meta share, and there's also European language resources.",
                    "label": 1
                },
                {
                    "sent": "Agency and Linguistic Data Consortium that is hosted in University of Penn State Pittsburgh.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Other popular pipelines or pipe.",
                    "label": 0
                },
                {
                    "sent": "Two collections are for instance gate from the University of Sheffield and freely from them.",
                    "label": 0
                },
                {
                    "sent": "Polytechnic in Barcelona and there's an old P stand for group and their software as well, but Lt Components do.",
                    "label": 0
                },
                {
                    "sent": "Appear in commercial products as well.",
                    "label": 0
                },
                {
                    "sent": "I mean Watson for instance.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "I've been watching that won the jeopardy three years ago.",
                    "label": 0
                },
                {
                    "sent": "Being able to process the questions in a real time, I mean freeze time.",
                    "label": 0
                },
                {
                    "sent": "Find the proper answers and.",
                    "label": 0
                },
                {
                    "sent": "Defeat to best human competitors or legal antics in IE software installs and this is where I'm at.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yes, great future for any PM.",
                    "label": 1
                },
                {
                    "sent": "Just few days ago, when was accessed August no months ago over the second, Why natural Language processing will change everything so big data analytics in the enterprise don't take my words for that.",
                    "label": 0
                },
                {
                    "sent": "Read these guys.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you very much for your attention.",
                    "label": 0
                }
            ]
        }
    }
}