{
    "id": "7bbl2lrvbrgevs455jmubqsnqe43cl3t",
    "title": "Measurement of aerosolized black carbon: Health and climate - two birds and one stone",
    "info": {
        "author": [
            "Griša Močnik, Aerosol d.o.o."
        ],
        "published": "Jan. 15, 2013",
        "recorded": "November 2012",
        "category": [
            "Top->Chemistry",
            "Top->Environment",
            "Top->Health Sciences->Public Health"
        ]
    },
    "url": "http://videolectures.net/kolokviji_mocnik_carbon/",
    "segmentation": [
        [
            "Health and climate change are the topics that we are supposed to kill.",
            "Two birds with one stone and the result.",
            "The result that I will show is that.",
            "Will show that this is this is possible, but.",
            "Every each time that one tries to do two things at once, there are some challenges that need to be overcome which are not that trivial.",
            "I would first."
        ],
        [
            "I'd like to thank all my coworkers, especially people that work with me at our soul and the Funding Agency which made possible the research.",
            "It I will show here cause."
        ],
        [
            "Once we finished talking about what black Carbon really is, I'll move on to why it's important how we measure it.",
            "Then I'll spend just a little bit of time on measurement of sources where we focus on how much black carbon is emitted from a single type of source.",
            "And I'll move on, move on to ambient measurements in, especially in urban areas.",
            "Where we want to know what is the exposure of the population to air pollution?",
            "The Holy Grail of such measurements is determination of sources.",
            "It's called source apportionment of air pollution, which means that by making measurements.",
            "Ambient measurements at the station somewhere in Louisiana, for instance we.",
            "We determine how much of the air pollutants are contributed by different sources, and especially by traffic and domestic heating with wood, that's something that is quite important recently in terms of abatement of air pollution in.",
            "Europe and broader.",
            "And I will finish up with measurements which are relevant for regional and global climate change becausw.",
            "Black Carbon is one of the major players in the anthropogenic influences on the climate."
        ],
        [
            "Black Carbon is a.",
            "Product of incomplete combustion and it can.",
            "This can be either from mobile sources from industrial stationary sources or from wildfires, and wildfires are usually attributed to nature but 90% of wildfires are in fact on top of genic, either intentional or non intentional.",
            "As a primary product, the interesting feature is that it is very stable in the atmosphere.",
            "And it is removed from the atmosphere only by the position or by precipitation.",
            "And the lifetime of black carbon in the atmosphere is measured in days to weeks.",
            "That is relevant."
        ],
        [
            "For climate effects.",
            "The difference between black carbon and for instance CO2 is that.",
            "Both are emitted when we combust the fuel that contains carbon.",
            "We can easily calculate how much carbon dioxide we emit from the amount of fuel that is burned, but black carbon depends on the efficiency of combustion and as such cannot be calculated because we have 45 orders of magnitude difference between between emissions from the same type of sources.",
            "For instance, diesel cars are typical example.",
            "And we have to measure we have to measure black carbon concentrations rather than calculate.",
            "And this is one of the reasons why there's a big difference between models and measurements, and if the models and measurements match to a factor of three, this is a quite good result.",
            "Black carbon from different sources can have different properties and as black carbon edges from the this fractal chains of little onions of graphitic material.",
            "First this this change will collapse and then they get mixed with other pollutants, usually secondary aerosols which are generated within the atmosphere.",
            "And that's the difference between black carbon and all particulate matter, which is, I realized, is that black carbon is a primary pollutant.",
            "While while.",
            "What we measure as particulate mass in the atmosphere is a mixture of primary and secondary aerosols."
        ],
        [
            "The relevance."
        ],
        [
            "This is the main relevance, that's why, particularly in the era regulated is the impact of particles on health, and this is an optimistic scenario which was calculated in 2000 which shows what will happen with the parameter, which is called statistical loss of life, which means how soon are we die statistically in Europe?",
            "In this case because of air pollution and the base, the base situation in 2012.",
            "Such that in certain places in Europe like the poor Valley, Benelux and certain parts of Poland, Hungary, we had a statistical loss of life which was greater than three years due to air pollution.",
            "And the scenarios which were used to regulate the air pollution were supposed to bring us to situations something like this in eight years, where the statistical loss of life was still almost half a year for the whole average population in Europe."
        ],
        [
            "And this is relevant not only from the social social point of view, but also from the economic point of view.",
            "Recently the paper was published, which statistically compared black carbon and.",
            "All particles smaller than 10 micrometers to health impacts of air pollution, and it was shown that black carbon is more statistically linked to chronic and.",
            "And.",
            "Other health impacts.",
            "Such as in admissions, in hospitals, and typically it is the stronger the strongest statistical Association is between pulmonary diseases and cardiovascular diseases, and that's big cause when we breathe particles in the enter our bloodstream and cause inflammation.",
            "Black carbon is also relevant for climate change and the question which one should answer is if there is only one.",
            "Parts per thousand as much black carbon emitted as CO2.",
            "You know?",
            "Why is it relevant at all?",
            "And also the lifetime of black carbon is very small.",
            "It is measured in days to weeks while while.",
            "CO2 lifetime is measured in decades.",
            "So why is it so important there is?"
        ],
        [
            "It is because it absorbs sunlight.",
            "Which means that it absorbs not only the radiation as it comes to Earth from sun, but also the radiation which is reflected from earth and 1 gram of aerosolized black carbon absorbs approximately as much as 10 umbrellas on which means that for a dirty track.",
            "There is one umbrella open for each kilometer driven.",
            "And."
        ],
        [
            "That is relevant for, especially for places like India or China or Southeast China Becausw.",
            "If we calculate the forcing at the top of the atmosphere.",
            "The CO2 absorbs infrared light, so we have a contribution in the atmosphere and we have a contribution close to the ground.",
            "Both are positive.",
            "They add up to about one to just over 1 1/2 volts per square meter.",
            "Black carbon is also lies so it absorbs light in the atmosphere.",
            "It hits the atmosphere but it cools the surface because it casts a shadow.",
            "When we look at the net contribution, it's about.",
            "In over India, it's about 60% of that of carbon dioxide.",
            "This is very spatially heterogeneous, so the real contribution is between 20 and 40%.",
            "Because this is a phenomenon that occurs in the atmosphere it impacts.",
            "Whether it impacts the formation of clouds and it impacts the precipitation and North of China is becoming is getting less precipitation whereas South is getting more rapid events in storms in India it has been shown that black carbon is associated with change in timing of the monsoon."
        ],
        [
            "And this is of a picture of New Delhi here from an airplane and we don't see the city at all because of the air pollution in New Delhi.",
            "More people have asked more than the whole population of Slovenia.",
            "So it's not just the impact on the environment, it's also the impact on the."
        ],
        [
            "On the people who live there.",
            "And recently it has been shown that becausw, the lifetime of black carbon and also methane, which are called short term short term.",
            "Climate forcers we can deley the effects.",
            "That are relevant for Earth.",
            "For instance, if we set a limit to two degrees Centigrade, we can buy some time by implementing measures that limit the emissions of black carbon and by buying time we can develop the technologies that will increase the efficiency of combustion and reduce the emissions of CO2 or develop carbon storage and sequestration technologies which will store the CO2 emitted.",
            "Underground, for instance because the measures 4 for limiting the emissions of black carbon exists.",
            "While US measures for storage, for instance of carbon dioxide's have yet still to be developed.",
            "And they have quantified this reductions of black carbon.",
            "In terms of.",
            "Premature death that would be avoided, and their greatest in India and China because the population is exposed to very high pollution.",
            "Air pollution there.",
            "But when we look at this normalized to essentially the population, we see that Southeast Asia and Africa will benefit most in terms of health in terms of climate, we, in the long term, we really don't gain anything.",
            "But we do get a 20% twenty year window where we can do something about CO2."
        ],
        [
            "We measure black carbon with optical technologies.",
            "That's why we call it Black.",
            "And the advantage is that it's instantaneous.",
            "It doesn't do anything to the sample, so the sample is in principle available for chemical analysis.",
            "Afterwards, the instrument is smallish.",
            "And as such, portable, we have very high time resolution measured in minutes and because we use a light, we get an added dimension of wavelength, which is very useful when we want to determine what the sources of air pollution are."
        ],
        [
            "And a thermometer, which is the instrument that we developed and we make in at aerosole.",
            "It's samples air through a coarse filter.",
            "We shine then light through this filter and we detect it with two detectors, one underneath the part of the filter where the sample is collected and one under a reference part of sample of the filter where we have no sample.",
            "We calculate the attenuation of light due to the sample collected on the filter and from the change of attenuation in a measurement period we can calculate the absorption due to error source collected on the filter during this.",
            "And this.",
            "Can be measured in minutes or seconds.",
            "We convert absorption to mass by dividing absorption with a mass absorption cross section which is specific to black carbon.",
            "It's it's about 3 orders of magnitude larger than anything else that can be found aerosolized in this size of aerosoles."
        ],
        [
            "This is the instrument that we make.",
            "Later I'll show the new instrument which we developed recently and have commercialized this here.",
            "This is the quartz filter with the spots of aerosoles, each sampled for several hours usually.",
            "And."
        ],
        [
            "Our instruments are usually installed in measurement sites such as these in London, in silhouettes, in or somewhere in China.",
            "Aura."
        ],
        [
            "In the remote places such as this installation in the Tibet.",
            "Where the Chinese are measuring air pollution coming from India."
        ],
        [
            "In the middle of the Californian desert."
        ],
        [
            "In Sub Saharan Africa."
        ],
        [
            "Or in the Antarctic."
        ],
        [
            "And all of these measurements are there because we want to measure how much pollution there is, but.",
            "Before we do, we make the ambient measurements.",
            "We also want to measure the source."
        ],
        [
            "And I'll show an example of measurements from mobile sources which were made by our.",
            "Another is Coca, which is a rough equivalent of a PhD student financed by the government in Slovenia.",
            "In Verona score this is a test text test track which is used to train drivers.",
            "We met, we measured blooms of cars passing mobile measurements, stationary measurements, site or we chased the cars with the.",
            "A car packed full of instruments including our newest kilometre."
        ],
        [
            "We measured three different cars and this is the results of five laps laps on this on this track we see that there is a big there is a big difference between different drivers, the.",
            "Professional drivers drive much more consistently than.",
            "I do for instance.",
            "And we see that the emission factors are not a single number, but our distribution which can be have a very long tail towards high emissions.",
            "And this is a relevant in terms of modeling cause the models usually take a single number and then they take into account certain percentage of the cars super polluters, which means which emit 23 orders of magnitude larger amounts of black carbon than other cars.",
            "But that's not true, we have.",
            "Distribution of emissions from each vehicles depending on the driving, driving, driving conditions."
        ],
        [
            "And then we want to extrapolate these measurements to ambient measure."
        ],
        [
            "And the first example I will show is from Milano.",
            "Milano is megacity in a very polluted part of Italy.",
            "90,000 vehicles enter into the city centre.",
            "Uganda also has about the same order of magnitude of cars entering the city, but they are distributed over the whole city.",
            "Here it's 90,000 within an area that is rather."
        ],
        [
            "Small.",
            "This is just three kilometers 4 kilometers across.",
            "And 'cause they had excessive air pollution inside the central city center.",
            "They have instituted traffic measures.",
            "And they have two measurement sites.",
            "One inside this area and one outside this area.",
            "Particular measurements, which is particles smaller than 10 micrometers which are aerosolized.",
            "The two measurements eyes showed no differences.",
            "So this turned into a large public debate, and what we did is we measured the both particles and black carbon in three different radial.",
            "Directions from the pedestrian area through this area with limited traffic to the area where there is no limits on the traffic and we."
        ],
        [
            "We have shown that there are no differences between coarser or finer particles between outside inside the low emission zone or inside the pedestrian area.",
            "But when we measured black carbon, we saw a huge difference of a factor of three between these three sides.",
            "So we can say that the air the traffic restrictions have improved air quality within.",
            "The city centre Becausw suit, or black carbon, is more closely associated with health effects, so we have done something for people who do live or work inside the city center.",
            "It's just a matter of taking the right parameter."
        ],
        [
            "I will move on to Slovenia and Austria and I'll show some.",
            "Examples, especially from logarithm zagoria, but also from Maryborough, Ensaladas."
        ],
        [
            "And we have conducted a campaign in 2010 in algorithm and when you one plots a time series you get you know.",
            "These are I would not call this results because it's hard to interpret them, but."
        ],
        [
            "When one digests this into a diurnal profile, one sees that we observe a morning peak during work days, which is most probably associated with traffic because it happens between.",
            "6:00 and 9:00 AM.",
            "And we have an afternoon pick which we cannot apportion only to traffic 'cause it it appears too late in the day.",
            "And there is also one on Sundays which is slightly smaller but still quite large."
        ],
        [
            "So first what we did we look will observe the the traffic counts and we see that yes, the morning peak is traffic.",
            "But again we have this tale of the afternoon pick which is cannot be explained by traffic."
        ],
        [
            "That this large reduction of concentrations during the day can be explained by atmospheric mixing.",
            "There is a significant increase in wind during this."
        ],
        [
            "But still we want to know what the sources are."
        ],
        [
            "And now we go from a black and white picture to a colored one."
        ],
        [
            "We have we have measurements at 7 wavelengths.",
            "And especially what we're interested is would because it's a sustainable fuel, trees, recycling CO2 and would is being promoted as a sustainable fuel in terms of carbon dioxide in Slovenia, 52% of households use wood to hit houses.",
            "And they do this with varying degrees of combustion efficiency."
        ],
        [
            "And what we see here is that we can get extreme emissions of particulate matter from a single from a single house, essentially."
        ],
        [
            "This is not true not only for for small villages, but it is also true for towns like in Paris, where there is an estimation of that 20% of fine particulate matter comes from burning wood and getting over it 35% in Milano.",
            "It's also between 1/3 and 1/4.",
            "And."
        ],
        [
            "We want to quantify how much pollution comes from traffic and how much from wood conversion, and we can parameterized the dependence of absorption coefficient on the wavelength of light.",
            "With a.",
            "With with a one over wavelength on an exponent which is called the awesome exponent and for black particles this awesome exponent is 1 and these are measurements which will be done in Switzerland.",
            "We see that.",
            "Very tame dependence on the absorption from diesel and significant increase in absorption at low wavelengths in blue and UV due to aromatic compounds which are present in wood smoke."
        ],
        [
            "And one can plot the Exponent's calculated from the Ethel Ometer measurements and we see this significant dip when the major contributor to air pollution.",
            "Traffic.",
            "Which is consistent because one would expect this to be one for diesel.",
            "And."
        ],
        [
            "And we can.",
            "We can make a two component model now where we measure the total absorption which is composed of two contributions, one from wood combustion, one from fossil conversion and we know the wavelength dependence of these two different sources.",
            "So we have four equations and we can decouple."
        ],
        [
            "And we can calculate the contributions to black carbon concentrations from fossil fuel and from wood combustion."
        ],
        [
            "And this is the same.",
            "In Nova Goritsy.",
            "We can decouple this.",
            "And of course the."
        ],
        [
            "Most interesting part is when we when we decouple this in terms of dialogue profiles and we see that for black carbon about 3/4 of black carbon comes from fossil fuel combustion, which means from traffic usually.",
            "And about 1/4 to 1/3 from combustion of wood.",
            "And we see that there is a difference between algorithms or in terms of the relations of these two morning and evening picks.",
            "The evening pick for wood combustion is much more prominent in the glory.",
            "We can extend this model to all carbonaceous aerosols and this is important because black carbon is a primary pollutant, which means this is essentially what is emitted by the car or any other type of combustion engine carbonaceous aerosols.",
            "Can be either primary error source which are emitted from the source or they can be generated in the atmosphere due to condensation of of compounds which are emitted in gas phase, or they can be changed by photochemistry or physical processes in the atmosphere.",
            "And if we look at the oil carbonaceous aerosols, we see that the situation is reversed.",
            "About 3/4 of of carbonaceous matter is emitted or is caused by burning wood and about 1/4 from traffic emissions.",
            "So the major contributor to air pollution in terms of mass of particles which we measure in the air is wood combustion."
        ],
        [
            "And this is not relevant only for outside air, but also for inside there.",
            "And we have performed measurements in a primary school in Turbo via.",
            "Where?"
        ],
        [
            "We have shown that the concentrations outside of here we are.",
            "I'm showing again black carbon concentration, about half of them come from fossil fuel combustion, about half from wood combustion and the and the same is true for air which is measured inside the classroom.",
            "So the composition is the same.",
            "And the concentrations are the same.",
            "Also becausw inside the air we measure about 90% of concentrations outside."
        ],
        [
            "When we validate the model, we want to correlate the results of our model.",
            "Results.",
            "Is black arborwood compassion to tracer of wood combustion, which is determined by a chemical chemical method and this is labeled.",
            "Glucose is strange type of sugar which is.",
            "Generated when you burn cellulose and we see that in both knowledge reasons agori we get a really nice regression lines the slope of these two regression lines is different than we attribute this to different types of wood being combusted and these are some rough emission inventories where one can assume that the majority of Woods burned in algorithm is log would, while in the gory it's wood chips and wood pellets which are burned.",
            "And the Holy Grail of source apportionment is something that goes mass closure where we want to reconstruct the measurements, which are made for all particulate matter for all particles which we measure in the air.",
            "And here we add the measurements made from filter analysis at the environmental Agency in Slovenia to our determination of all combinations, method, and we see that.",
            "Until we add woodsmoke into the picture, we don't really describe the particulate matter very well, so would smoke is a major major contributor to air pollution, especially in places like the area where we have a base in which is closed in winter with an inversion.",
            "Black carbon is not regulated, so the weather 1 measures is or not or not depends on the goodwill of the municipality and the available funding.",
            "Polyaromatic hydrocarbons, on the other hand, are regulated and benzo a. Pyrene is considered genic.",
            "Compound with a limit of 1 nanogram, which is this value?",
            "But a cubic meter.",
            "As an annual average.",
            "And what we wanted to know is whether we can determine what are the sources of benzo a pyrene.",
            "And when will plot a regression between benzopyrene and black carbon.",
            "We don't see any pattern.",
            "However, when we plot the regression line between black carbon from wood combustion benzopyrene, we get a linear regression line with the.",
            "Small intercept, this tells us that, at least in the Gloria but.",
            "We found this afterwards also in other places.",
            "Poly rheumatic hydrocarbons are emitted by wood combustion.",
            "Which means that people who burn Woods to hit homes are poisoning their kids.",
            "Which is a strong statement, but it's true.",
            "We have, I'll skip over this, or maybe I won't.",
            "We have done a similar XX campaign in Maribor.",
            "But here we have a pair of station in the city center and outside and we see the outside.",
            "The contribution of Woodsmoke, which is in green, is completely at outweighs contributions from traffic in inside the city.",
            "This is about 2:00 to 1:00 and the really interesting thing is now to compare the concentrations which we have measured inside the city to the ones measured outside the city.",
            "And if you plot a ratio of concentrations which are supposed to change over the day inside the city, normalized to the concentrations outside, we see that there is a strong increase of concentrations inside the city compared to outside during the day.",
            "That's because the measurement side in the city center in Marable is right next to a very busy St.",
            "However, would smoke.",
            "Doesn't change all that much.",
            "It's about between it's between 60 and 80% of those outside the city.",
            "And.",
            "This plot is important because it shows that if you regulate traffic, you can regulate local air pollution, while as woodsmoke which is.",
            "Which contributes 2/3 of air pollution of carbonaceous particles inside the city and the majority outside the city is very homogeneous, so any abatement measures that you want to implement needs to be original, not local.",
            "And Maribor in particular is is very well positioned because their their Department for the environment is not only a municipal Department for the environment is an Inter municipal Department for their model.",
            "Environment and comprises several counties of around Marable.",
            "So this is a place to watch for regulating woodsmoke.",
            "So if we."
        ],
        [
            "Move from local air pollution to regional and global climate change."
        ],
        [
            "The first thing that I want to show you are the vertical profiles over Milano, which we did with the balloon, which was a standard balloon.",
            "It was on very thin rope.",
            "The rope was about this thick and we raise it to about 500 meters.",
            "Several times during today's and we measured profiles something like this.",
            "We see a very polluted layer of air immediately next to the ground.",
            "And the reason is because this is this was next to a quite busy St and we have a relatively homogeneous layer of air.",
            "And then above the mixing layer, the concentrations drop significantly.",
            "And."
        ],
        [
            "Then we parameterized this with a with a very simple model, and what this model shows is that a city can be considered as a regional source of air pollution.",
            "And.",
            "One can model this in as you know, by factor of less of less than two when compared when you compare the models and the measured air pollution on the site which is.",
            "2000 meters above the city or the region that you consider your source of air pollution."
        ],
        [
            "The real really interesting measurements, original measurements and these are very rare because they are expensive.",
            "This year material energy has flown around the world with this aircraft.",
            "And we have instrumented the aircraft with the prototype kilometre, which sampled the air from an inlet on the wing, and the instrument was inside the cockpit.",
            "Material has flow."
        ],
        [
            "Around the world.",
            "In a little over three months and we have identified regions of higher air pollution in Africa, Americas and in Asia.",
            "And the interesting."
        ],
        [
            "Thing about this areas is that sometimes one measures this blooms which are usually identified with a very well defined source."
        ],
        [
            "The same.",
            "Cannot be said for Southeast Asia where we measured much more spatially homogeneous concentrations."
        ],
        [
            "Africa is a little bit special case because we have a combination of both.",
            "India is very interesting."
        ],
        [
            "I will come back to this so this is an example of a point source over Mexico.",
            "It's a power plant burning.",
            "Some some sort of some sort of desire or distributed sources over Nepal where each of these houses has a kitchen where they burn biomes to cook."
        ],
        [
            "And these pollution can then be transported over large differences because it is very well.",
            "Straps in layers of air and this is an example from over Malaysia, Malaysia and one from over Congo in Africa.",
            "And one can measure this blooms of pollution.",
            "At the altitude of three kilometers.",
            "So this is exactly the Heights where the majority of weather.",
            "Occurs most of the phenomena, cloud formation and things like that.",
            "Occur also at this altitude.",
            "And one can identify these blooms of air pollution as biomes from the from the exponent which was calculated from this same measurements and we can see that we measure a plume and we see an increase of of the awesome experience which indicates that this plume is Biome."
        ],
        [
            "Yes, and this is true not only for measurements in Southeast Asia, but also from."
        ],
        [
            "Agents over India where we have also calculated back trajectories.",
            "So this is the site of the measurement and this is the back trajectory of the air which ended up at this location when we measured it.",
            "And it was.",
            "It originated at about 1500 meters in Iran, and then it was turned.",
            "It raised and it dropped.",
            "Over India somewhere in Gujarat and then it raised to about 3 1/2 kilometers where this air parcel was measured by.",
            "It's inside the plane."
        ],
        [
            "The just before the landing at about seven 700 meters above ground level, we measured another.",
            "We calculate another back trajectory which originated in the approximately the same part where we think that the."
        ],
        [
            "This big trajectory picked up air pollution cause it went really close to the ground."
        ],
        [
            "And then it went next to the next to the next to the coast, to the measurement side, and we see that wild concentrations change.",
            "The angstrom exponent is very homogeneous, and we interpret this as the whole India being covered by a Brown cloud.",
            "Which is very homogeneous in terms of composition.",
            "And the sources are biomes being burned all over India."
        ],
        [
            "This is a picture of the inlet where we sucked air in to our sampling system and then to the instrument and we see that we see this.",
            "Significant the position of particulars on the airplane because the air was so dirty."
        ],
        [
            "Now I want to show you know this is a more commercial oriented part of the talk.",
            "This is the new instrument that we developed in the past three years and we commercialized it this year.",
            "It was a Eureka type project where we collaborated with Swiss very large Swiss Institute.",
            "In the measurements we made."
        ],
        [
            "These are the results of the measurements from the instrument correlated with post processing.",
            "The results from our traditional legacy instruments, and we saw we see a very nice regression line with a slope of one and a very very small intersect."
        ],
        [
            "And because the time resolution of this measurement is 1 second, we can use it in mobile measurements and these are measurements from Switzerland where the driver drove around the around a highway and we can show them from these measurements that you know it is nice to live downwind, not downwind, but upwind of the highway, because the concentrations on this side of the highway are much higher than on this side of the highway.",
            "What we also did with tried to characterize the type of air pollution observed in this, but this is still work in progress."
        ],
        [
            "To sum up.",
            "Black carbon is relevant for both health and climate.",
            "We can measure it anywhere because we can miniaturize the methodology, which uses on a filter on a quartz piece of filter and an optical analysis, and we can put it in small airplanes and not only we can we measure, but you can also determine the sources of air pollution with an instrument which is made in Slovenia by now.",
            "12 people.",
            "Across the city in Louisiana.",
            "With this I would like to conclude and.",
            "Ask you for questions.",
            "Holly Matic regulator.",
            "Colelction Bayless turning ugly capybara viani, sadistic retail stratosfear Oh yeah.",
            "Picasso and Ruben.",
            "And under present axiom.",
            "Me small mirrors, no.",
            "Today is not real little.",
            "It's not really Italian or any drugs, Viro quote district capital, Zune.",
            "In provision polluters, Roca is not a cabin.",
            "AS little Junie Ritter, Clara impress teams filter and that filter in regards to this and maybe bacteria and viruses not recombinant Shirley, I'm at this current system provider publish and Zach is not recommended.",
            "In terminal, across America means no trail attalla curing.",
            "In the search business leader provisional credit Rule italic is minimal concentrated Zune that the static allometry into intact and attack an attacker Merito is San Francisco, New York.",
            "Caring as a cheat code campaign, opponent's Roca voices within this May mirror the token retrieval gas.",
            "Electrons can apply a. Construct is a low heat rope ladder.",
            "Equal peers at nanogram, Monokuma trickery is Resolume Alo, not Chicago kennels, midnight permitting she little ish vormetric.",
            "Mass V2, but with more provision.",
            "Yeah, that Cohen factored 3 into server since let Allah this was not reinstated.",
            "Curatorial Attila pred little on bottom ribbon trim and camera in.",
            "Delicio put Nivea so team is here poem in the Tucker is julians kid just take a journey Rubraca dial she Skechers.",
            "The.",
            "Trachea metry.",
            "Here's a causes star, a separate sleigh or Bleacher Niconico Hydrophila.",
            "Be naked, refill and plush.",
            "Supporting Roddenberry inside his parents atmosphere is redness and visual design.",
            "Balance 2K rugby, possum, omolo, Sadia, Veneman, utip, Oviedo.",
            "It'll matter in black carbon, Merritt over Slovenia, Vista, Saginaw Valley to chase, necessitating hoarseness at Cosmo.",
            "Game is constitute get to Crabtree.",
            "Very skittish.",
            "Delivers Lawrence Berkeley laboratory am across EMEA studio.",
            "Supervisors cupino in small there is discovered.",
            "Delaval Ina prefetto donis.",
            "Tommy Resnick Ritala Metra grieshop obj.",
            "Check bonus little Coco Stark's mascot mattress cover.",
            "Let's see how to cheat atmospherics, Cocomero, Berkeley, Brazoria Bill, the loss animal, black Carbon Turner Blixen you, Villanova said or done dances.",
            "Predmore Chadwick late possibly personality Deborah PF America nikolica pray circles of edema, Izium and Razvoj in Slack or some other silly.",
            "Digraph Slovenia not chosen obesity or minimal permission of local to the the Samish beaches.",
            "Namastey koala.",
            "Yes, I'm assume Italia telemeter."
        ],
        [
            "Doing your hands not supposed to pick America tackles in business register burkleo Impala nikolic's never Slovenie says Good Bus which is a pallet code smokes.",
            "Keys there, so quiet as it is, why I means.",
            "Please would not take instrumental in planning.",
            "At Marshall in I am watching tournament Glico.",
            "Subservient equation chemical yeah there mark actionable stay within our political power she know.",
            "Making their so called so sigh.",
            "Sigh Moseley Cupertino primary of is the Western Union in.",
            "Is experimental cure some miracle?",
            "Give some mineral absorbs here.",
            "Dell servers Raccoon is supposed to premiere Real Richmond vanished.",
            "Romanticism merely sees wreck.",
            "English the neuter.",
            "Malaysia knicker Alyssa Grevena Malpas.",
            "Experiment is not the component, say lack laughner's new organs, Kiss movie, sprouses Delta overprints.",
            "Cosm commended Putin instrument, concussion in Nash, Khymir Cosa del Cinnabarinum filter if necessary.",
            "Nikki Silverstein, a filter computer in multi factor into Arabic.",
            "The Celma heavily quemener filter cut tiki Myrna Valley commuters rock breasting at the new Darian this Castle Castle.",
            "Yeah the.",
            "Said Cucina Bahani is Maisha carpool mean.",
            "The Mogu channel did DLC key so."
        ],
        [
            "Ground Operational Spoke Association Premier is the.",
            "We should do a card.",
            "Nicole and Nick, Nick Nick Nick na silts.",
            "Dell service available.",
            "Mechanism.",
            "Deal so necessary so slow computer running in realtime or experimental.",
            "Your children.",
            "Delta.",
            "So tonight will try experiments.",
            "The new Durham in Super Super cars all the tested DLC kinematic newer ganske.",
            "Screen which car so evil Drow Nikki Michelle programming is specialty Morocco, experimental and Arian.",
            "Around in the clarner.",
            "Who is Rocko?",
            "Could appreciate just so little.",
            "Bush.",
            "Mckinneys new people, so Nittany Interleukin mishek filter.",
            "Kiki.",
            "So we need a new mechanism.",
            "It is ticket this provision in the district Key.",
            "Zach Yep, 2 trees to this on average per surgical is there are in that or mechanism key provider duty?",
            "So nervous about this new leak.",
            "To 6:20 to six romantic here.",
            "Slow process linear at disco.",
            "Please visit us as a drag.",
            "Parameter posits.",
            "Does experimentalism.",
            "How much money?",
            "Set lobster.",
            "Yeah, but it is yellow.",
            "Good about global accounts for schools going over Cosette planets.",
            "Yep, reset."
        ],
        [
            "This is a bug.",
            "This kind of near Morris Agreement perversione.",
            "In the stylish approver, Sheena Turner Glick clip over Sheena.",
            "The talker interested as measured.",
            "Live.",
            "Redeemer is not yet experiment demo colonized by September.",
            "Apparel North America.",
            "Is Ratchet Prostor in support tickets Mill Blue 0 so little ski?",
            "Temperature.",
            "Perversion interessee particular deals that took out beer.",
            "Journal click click deeper.",
            "She know that crap, Sorbera said.",
            "Lobo San Jose Lobo, atmospheric ambac professional Claudia atmosphere up a cigarette.",
            "You know?",
            "Sarah Sugriva, Bill category Cody exit.",
            "Some little junkie mine.",
            "She's a talker.",
            "Chino.",
            "To buy them Victor.",
            "The group has a trip to become material.",
            "Look carefully.",
            "Cost is Italiana, Kataram Wiederin Kozilek extrapolation discussion normally come and go to Standard Opium, an adverb opposed to set some potential inability to trust machine.",
            "Filter keys new problem, also filtering kissable as it is a million PM this it is just as long as you can see Nick Dokie Matco Magna Prison Warden.",
            "Instrumental Zune like email anymore promotional email.",
            "Znga DLC Sylviane today and it did not have Lackner Sticklen, Alpha, Caccia Vander Waals Museum.",
            "Peters filtering is aware of those low, making it Delta.",
            "Yep, so far as licking it puts me feel tree in.",
            "Because you pressure.",
            "Climate is concurrent with tremendous slapstick, gnashing in Terminal 3 percentage, also bigger.",
            "But it'll metrohm problem question filter Alpha.",
            "Filter is stay clicking so put him or plus Chinese at the forum.",
            "And we are more practical schedule.",
            "So doesn't Ristic magic problem near the SMPS in the Tucker.",
            "Roshanak I lock them quickly set in animate response measures.",
            "Sophisticated instrument rubbish that there is measure.",
            "Could.",
            "Is Christic filter area the lowest?",
            "Yeah, so problem.",
            "Problem absolutely filtered through the reality filter or HEPA filter keys on them in an air conditioner in terms of standard in the unit code.",
            "Discover more super Delta kisses the law, the law mania.",
            "Departure really costs."
        ],
        [
            "Inga task assist angadi laveaga.",
            "Yeah, racist nanometer attachable tagra fee to input M Another attack a very cost deals are curious Mermelstein instrumented but typically not Amit awesome.",
            "Set passcode based Nano Metro the switch design.",
            "Motion for Sonia.",
            "His dossantos accounts proposed to victory Casino Manoso.",
            "My lacoy implicates Rosner, Rosner, Toyota owners, Nirvana News, Bureau squadrons, biomass and apprentice trainee among your cats.",
            "And their gear.",
            "But we're standing out with money.",
            "It's probably not worth it.",
            "Does go digital partial guy put him with Gore put?",
            "Why yes, there is some slow professionality for million in.",
            "Neighbors you probably saw the Nikki Kirby steamer BC Gravel, so he."
        ],
        [
            "Upstyle Nchini Colonel Esaki searching committee.",
            "In Kinepolis, Roger Missy problem your team into problem, problem, custom ability, it all the.",
            "In on the browser, even he she.",
            "It was discovered Napa is it should be hot.",
            "Let it see mostly any racial problems and IMMA be more under apparently Escargot River in the City Hotel codes.",
            "Coca terrorism, or the Java hot Logical Lotus Events MA, DMD security system and biomass 2 minute resume not to say CPG in parameters does not.",
            "Improve problem.",
            "Which is a minimal separate channel?",
            "Is the hip which is business lead?",
            "Pusheen couple in their native artist needs knee grieving analysing you down here.",
            "Nellis so kudos rush impossibility so the the nieciecza filter on your knowledge technical standard is Alyssa Peachy.",
            "Net regular error MSE deals are doctors who don't make their intentions are individual issues, so the wall magnetic and it Reba prevalent and Democratic leader in cattle.",
            "It is merged Nazmi remiss your Delta.",
            "Let me see this.",
            "In the motel also care my arm originating sorption correct paper it's pranami there is Michelle Team Winner Deal dinner Dear Sistema keep your gravel Dylan Mr Inview Proble Massa input immigrant visas infrastructure possibilities, sprouted Doppler RADA individually huge problem therapist operator that infrastructure dragon.",
            "Ljubljana, Mesecher Mamata Plot number Asia Keebler pathology Pretzel dogs catiria sapona Miley mineral primer coat Grill was a grineer vermist into a Redeemer, tacticians, global spare hook you tryba.",
            "The career climber dealer unplug the list given Izuna Lubrani, Drago with Asahi my auto system.",
            "I'm a colleague is against it so clear prior the apashe this minimal problems.",
            "Melissa McBride work, the two crit or patched snail.",
            "Least you put in to see less.",
            "Need goes us block.",
            "It is practicians stone.",
            "In problem alternative, could annulus IO team the Tony Carey Trainer did submission era that or the the probabilities nail glitter talk with an equal economic or an economic problem.",
            "Agreed and to cry?",
            "Very simple proposal shall swarm was driving South drivers license, Salem.",
            "Nope, spider."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Health and climate change are the topics that we are supposed to kill.",
                    "label": 0
                },
                {
                    "sent": "Two birds with one stone and the result.",
                    "label": 1
                },
                {
                    "sent": "The result that I will show is that.",
                    "label": 0
                },
                {
                    "sent": "Will show that this is this is possible, but.",
                    "label": 0
                },
                {
                    "sent": "Every each time that one tries to do two things at once, there are some challenges that need to be overcome which are not that trivial.",
                    "label": 0
                },
                {
                    "sent": "I would first.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'd like to thank all my coworkers, especially people that work with me at our soul and the Funding Agency which made possible the research.",
                    "label": 0
                },
                {
                    "sent": "It I will show here cause.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Once we finished talking about what black Carbon really is, I'll move on to why it's important how we measure it.",
                    "label": 0
                },
                {
                    "sent": "Then I'll spend just a little bit of time on measurement of sources where we focus on how much black carbon is emitted from a single type of source.",
                    "label": 0
                },
                {
                    "sent": "And I'll move on, move on to ambient measurements in, especially in urban areas.",
                    "label": 0
                },
                {
                    "sent": "Where we want to know what is the exposure of the population to air pollution?",
                    "label": 0
                },
                {
                    "sent": "The Holy Grail of such measurements is determination of sources.",
                    "label": 0
                },
                {
                    "sent": "It's called source apportionment of air pollution, which means that by making measurements.",
                    "label": 0
                },
                {
                    "sent": "Ambient measurements at the station somewhere in Louisiana, for instance we.",
                    "label": 0
                },
                {
                    "sent": "We determine how much of the air pollutants are contributed by different sources, and especially by traffic and domestic heating with wood, that's something that is quite important recently in terms of abatement of air pollution in.",
                    "label": 0
                },
                {
                    "sent": "Europe and broader.",
                    "label": 0
                },
                {
                    "sent": "And I will finish up with measurements which are relevant for regional and global climate change becausw.",
                    "label": 0
                },
                {
                    "sent": "Black Carbon is one of the major players in the anthropogenic influences on the climate.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Black Carbon is a.",
                    "label": 0
                },
                {
                    "sent": "Product of incomplete combustion and it can.",
                    "label": 0
                },
                {
                    "sent": "This can be either from mobile sources from industrial stationary sources or from wildfires, and wildfires are usually attributed to nature but 90% of wildfires are in fact on top of genic, either intentional or non intentional.",
                    "label": 0
                },
                {
                    "sent": "As a primary product, the interesting feature is that it is very stable in the atmosphere.",
                    "label": 0
                },
                {
                    "sent": "And it is removed from the atmosphere only by the position or by precipitation.",
                    "label": 0
                },
                {
                    "sent": "And the lifetime of black carbon in the atmosphere is measured in days to weeks.",
                    "label": 0
                },
                {
                    "sent": "That is relevant.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For climate effects.",
                    "label": 0
                },
                {
                    "sent": "The difference between black carbon and for instance CO2 is that.",
                    "label": 0
                },
                {
                    "sent": "Both are emitted when we combust the fuel that contains carbon.",
                    "label": 0
                },
                {
                    "sent": "We can easily calculate how much carbon dioxide we emit from the amount of fuel that is burned, but black carbon depends on the efficiency of combustion and as such cannot be calculated because we have 45 orders of magnitude difference between between emissions from the same type of sources.",
                    "label": 0
                },
                {
                    "sent": "For instance, diesel cars are typical example.",
                    "label": 0
                },
                {
                    "sent": "And we have to measure we have to measure black carbon concentrations rather than calculate.",
                    "label": 0
                },
                {
                    "sent": "And this is one of the reasons why there's a big difference between models and measurements, and if the models and measurements match to a factor of three, this is a quite good result.",
                    "label": 0
                },
                {
                    "sent": "Black carbon from different sources can have different properties and as black carbon edges from the this fractal chains of little onions of graphitic material.",
                    "label": 0
                },
                {
                    "sent": "First this this change will collapse and then they get mixed with other pollutants, usually secondary aerosols which are generated within the atmosphere.",
                    "label": 0
                },
                {
                    "sent": "And that's the difference between black carbon and all particulate matter, which is, I realized, is that black carbon is a primary pollutant.",
                    "label": 0
                },
                {
                    "sent": "While while.",
                    "label": 0
                },
                {
                    "sent": "What we measure as particulate mass in the atmosphere is a mixture of primary and secondary aerosols.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The relevance.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is the main relevance, that's why, particularly in the era regulated is the impact of particles on health, and this is an optimistic scenario which was calculated in 2000 which shows what will happen with the parameter, which is called statistical loss of life, which means how soon are we die statistically in Europe?",
                    "label": 0
                },
                {
                    "sent": "In this case because of air pollution and the base, the base situation in 2012.",
                    "label": 0
                },
                {
                    "sent": "Such that in certain places in Europe like the poor Valley, Benelux and certain parts of Poland, Hungary, we had a statistical loss of life which was greater than three years due to air pollution.",
                    "label": 1
                },
                {
                    "sent": "And the scenarios which were used to regulate the air pollution were supposed to bring us to situations something like this in eight years, where the statistical loss of life was still almost half a year for the whole average population in Europe.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is relevant not only from the social social point of view, but also from the economic point of view.",
                    "label": 0
                },
                {
                    "sent": "Recently the paper was published, which statistically compared black carbon and.",
                    "label": 0
                },
                {
                    "sent": "All particles smaller than 10 micrometers to health impacts of air pollution, and it was shown that black carbon is more statistically linked to chronic and.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Other health impacts.",
                    "label": 0
                },
                {
                    "sent": "Such as in admissions, in hospitals, and typically it is the stronger the strongest statistical Association is between pulmonary diseases and cardiovascular diseases, and that's big cause when we breathe particles in the enter our bloodstream and cause inflammation.",
                    "label": 0
                },
                {
                    "sent": "Black carbon is also relevant for climate change and the question which one should answer is if there is only one.",
                    "label": 0
                },
                {
                    "sent": "Parts per thousand as much black carbon emitted as CO2.",
                    "label": 0
                },
                {
                    "sent": "You know?",
                    "label": 0
                },
                {
                    "sent": "Why is it relevant at all?",
                    "label": 0
                },
                {
                    "sent": "And also the lifetime of black carbon is very small.",
                    "label": 0
                },
                {
                    "sent": "It is measured in days to weeks while while.",
                    "label": 0
                },
                {
                    "sent": "CO2 lifetime is measured in decades.",
                    "label": 0
                },
                {
                    "sent": "So why is it so important there is?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It is because it absorbs sunlight.",
                    "label": 1
                },
                {
                    "sent": "Which means that it absorbs not only the radiation as it comes to Earth from sun, but also the radiation which is reflected from earth and 1 gram of aerosolized black carbon absorbs approximately as much as 10 umbrellas on which means that for a dirty track.",
                    "label": 1
                },
                {
                    "sent": "There is one umbrella open for each kilometer driven.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That is relevant for, especially for places like India or China or Southeast China Becausw.",
                    "label": 0
                },
                {
                    "sent": "If we calculate the forcing at the top of the atmosphere.",
                    "label": 1
                },
                {
                    "sent": "The CO2 absorbs infrared light, so we have a contribution in the atmosphere and we have a contribution close to the ground.",
                    "label": 0
                },
                {
                    "sent": "Both are positive.",
                    "label": 1
                },
                {
                    "sent": "They add up to about one to just over 1 1/2 volts per square meter.",
                    "label": 0
                },
                {
                    "sent": "Black carbon is also lies so it absorbs light in the atmosphere.",
                    "label": 0
                },
                {
                    "sent": "It hits the atmosphere but it cools the surface because it casts a shadow.",
                    "label": 0
                },
                {
                    "sent": "When we look at the net contribution, it's about.",
                    "label": 0
                },
                {
                    "sent": "In over India, it's about 60% of that of carbon dioxide.",
                    "label": 0
                },
                {
                    "sent": "This is very spatially heterogeneous, so the real contribution is between 20 and 40%.",
                    "label": 0
                },
                {
                    "sent": "Because this is a phenomenon that occurs in the atmosphere it impacts.",
                    "label": 0
                },
                {
                    "sent": "Whether it impacts the formation of clouds and it impacts the precipitation and North of China is becoming is getting less precipitation whereas South is getting more rapid events in storms in India it has been shown that black carbon is associated with change in timing of the monsoon.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is of a picture of New Delhi here from an airplane and we don't see the city at all because of the air pollution in New Delhi.",
                    "label": 0
                },
                {
                    "sent": "More people have asked more than the whole population of Slovenia.",
                    "label": 0
                },
                {
                    "sent": "So it's not just the impact on the environment, it's also the impact on the.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the people who live there.",
                    "label": 0
                },
                {
                    "sent": "And recently it has been shown that becausw, the lifetime of black carbon and also methane, which are called short term short term.",
                    "label": 0
                },
                {
                    "sent": "Climate forcers we can deley the effects.",
                    "label": 0
                },
                {
                    "sent": "That are relevant for Earth.",
                    "label": 0
                },
                {
                    "sent": "For instance, if we set a limit to two degrees Centigrade, we can buy some time by implementing measures that limit the emissions of black carbon and by buying time we can develop the technologies that will increase the efficiency of combustion and reduce the emissions of CO2 or develop carbon storage and sequestration technologies which will store the CO2 emitted.",
                    "label": 0
                },
                {
                    "sent": "Underground, for instance because the measures 4 for limiting the emissions of black carbon exists.",
                    "label": 0
                },
                {
                    "sent": "While US measures for storage, for instance of carbon dioxide's have yet still to be developed.",
                    "label": 0
                },
                {
                    "sent": "And they have quantified this reductions of black carbon.",
                    "label": 0
                },
                {
                    "sent": "In terms of.",
                    "label": 0
                },
                {
                    "sent": "Premature death that would be avoided, and their greatest in India and China because the population is exposed to very high pollution.",
                    "label": 0
                },
                {
                    "sent": "Air pollution there.",
                    "label": 0
                },
                {
                    "sent": "But when we look at this normalized to essentially the population, we see that Southeast Asia and Africa will benefit most in terms of health in terms of climate, we, in the long term, we really don't gain anything.",
                    "label": 0
                },
                {
                    "sent": "But we do get a 20% twenty year window where we can do something about CO2.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We measure black carbon with optical technologies.",
                    "label": 0
                },
                {
                    "sent": "That's why we call it Black.",
                    "label": 0
                },
                {
                    "sent": "And the advantage is that it's instantaneous.",
                    "label": 0
                },
                {
                    "sent": "It doesn't do anything to the sample, so the sample is in principle available for chemical analysis.",
                    "label": 0
                },
                {
                    "sent": "Afterwards, the instrument is smallish.",
                    "label": 0
                },
                {
                    "sent": "And as such, portable, we have very high time resolution measured in minutes and because we use a light, we get an added dimension of wavelength, which is very useful when we want to determine what the sources of air pollution are.",
                    "label": 1
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And a thermometer, which is the instrument that we developed and we make in at aerosole.",
                    "label": 0
                },
                {
                    "sent": "It's samples air through a coarse filter.",
                    "label": 0
                },
                {
                    "sent": "We shine then light through this filter and we detect it with two detectors, one underneath the part of the filter where the sample is collected and one under a reference part of sample of the filter where we have no sample.",
                    "label": 0
                },
                {
                    "sent": "We calculate the attenuation of light due to the sample collected on the filter and from the change of attenuation in a measurement period we can calculate the absorption due to error source collected on the filter during this.",
                    "label": 0
                },
                {
                    "sent": "And this.",
                    "label": 0
                },
                {
                    "sent": "Can be measured in minutes or seconds.",
                    "label": 0
                },
                {
                    "sent": "We convert absorption to mass by dividing absorption with a mass absorption cross section which is specific to black carbon.",
                    "label": 0
                },
                {
                    "sent": "It's it's about 3 orders of magnitude larger than anything else that can be found aerosolized in this size of aerosoles.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the instrument that we make.",
                    "label": 0
                },
                {
                    "sent": "Later I'll show the new instrument which we developed recently and have commercialized this here.",
                    "label": 0
                },
                {
                    "sent": "This is the quartz filter with the spots of aerosoles, each sampled for several hours usually.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our instruments are usually installed in measurement sites such as these in London, in silhouettes, in or somewhere in China.",
                    "label": 0
                },
                {
                    "sent": "Aura.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the remote places such as this installation in the Tibet.",
                    "label": 0
                },
                {
                    "sent": "Where the Chinese are measuring air pollution coming from India.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the middle of the Californian desert.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In Sub Saharan Africa.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or in the Antarctic.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And all of these measurements are there because we want to measure how much pollution there is, but.",
                    "label": 0
                },
                {
                    "sent": "Before we do, we make the ambient measurements.",
                    "label": 0
                },
                {
                    "sent": "We also want to measure the source.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I'll show an example of measurements from mobile sources which were made by our.",
                    "label": 0
                },
                {
                    "sent": "Another is Coca, which is a rough equivalent of a PhD student financed by the government in Slovenia.",
                    "label": 0
                },
                {
                    "sent": "In Verona score this is a test text test track which is used to train drivers.",
                    "label": 0
                },
                {
                    "sent": "We met, we measured blooms of cars passing mobile measurements, stationary measurements, site or we chased the cars with the.",
                    "label": 0
                },
                {
                    "sent": "A car packed full of instruments including our newest kilometre.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We measured three different cars and this is the results of five laps laps on this on this track we see that there is a big there is a big difference between different drivers, the.",
                    "label": 0
                },
                {
                    "sent": "Professional drivers drive much more consistently than.",
                    "label": 0
                },
                {
                    "sent": "I do for instance.",
                    "label": 0
                },
                {
                    "sent": "And we see that the emission factors are not a single number, but our distribution which can be have a very long tail towards high emissions.",
                    "label": 0
                },
                {
                    "sent": "And this is a relevant in terms of modeling cause the models usually take a single number and then they take into account certain percentage of the cars super polluters, which means which emit 23 orders of magnitude larger amounts of black carbon than other cars.",
                    "label": 0
                },
                {
                    "sent": "But that's not true, we have.",
                    "label": 0
                },
                {
                    "sent": "Distribution of emissions from each vehicles depending on the driving, driving, driving conditions.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we want to extrapolate these measurements to ambient measure.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the first example I will show is from Milano.",
                    "label": 0
                },
                {
                    "sent": "Milano is megacity in a very polluted part of Italy.",
                    "label": 1
                },
                {
                    "sent": "90,000 vehicles enter into the city centre.",
                    "label": 1
                },
                {
                    "sent": "Uganda also has about the same order of magnitude of cars entering the city, but they are distributed over the whole city.",
                    "label": 0
                },
                {
                    "sent": "Here it's 90,000 within an area that is rather.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Small.",
                    "label": 0
                },
                {
                    "sent": "This is just three kilometers 4 kilometers across.",
                    "label": 0
                },
                {
                    "sent": "And 'cause they had excessive air pollution inside the central city center.",
                    "label": 0
                },
                {
                    "sent": "They have instituted traffic measures.",
                    "label": 0
                },
                {
                    "sent": "And they have two measurement sites.",
                    "label": 0
                },
                {
                    "sent": "One inside this area and one outside this area.",
                    "label": 0
                },
                {
                    "sent": "Particular measurements, which is particles smaller than 10 micrometers which are aerosolized.",
                    "label": 0
                },
                {
                    "sent": "The two measurements eyes showed no differences.",
                    "label": 0
                },
                {
                    "sent": "So this turned into a large public debate, and what we did is we measured the both particles and black carbon in three different radial.",
                    "label": 0
                },
                {
                    "sent": "Directions from the pedestrian area through this area with limited traffic to the area where there is no limits on the traffic and we.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have shown that there are no differences between coarser or finer particles between outside inside the low emission zone or inside the pedestrian area.",
                    "label": 0
                },
                {
                    "sent": "But when we measured black carbon, we saw a huge difference of a factor of three between these three sides.",
                    "label": 0
                },
                {
                    "sent": "So we can say that the air the traffic restrictions have improved air quality within.",
                    "label": 1
                },
                {
                    "sent": "The city centre Becausw suit, or black carbon, is more closely associated with health effects, so we have done something for people who do live or work inside the city center.",
                    "label": 0
                },
                {
                    "sent": "It's just a matter of taking the right parameter.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will move on to Slovenia and Austria and I'll show some.",
                    "label": 0
                },
                {
                    "sent": "Examples, especially from logarithm zagoria, but also from Maryborough, Ensaladas.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we have conducted a campaign in 2010 in algorithm and when you one plots a time series you get you know.",
                    "label": 0
                },
                {
                    "sent": "These are I would not call this results because it's hard to interpret them, but.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When one digests this into a diurnal profile, one sees that we observe a morning peak during work days, which is most probably associated with traffic because it happens between.",
                    "label": 0
                },
                {
                    "sent": "6:00 and 9:00 AM.",
                    "label": 0
                },
                {
                    "sent": "And we have an afternoon pick which we cannot apportion only to traffic 'cause it it appears too late in the day.",
                    "label": 0
                },
                {
                    "sent": "And there is also one on Sundays which is slightly smaller but still quite large.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So first what we did we look will observe the the traffic counts and we see that yes, the morning peak is traffic.",
                    "label": 0
                },
                {
                    "sent": "But again we have this tale of the afternoon pick which is cannot be explained by traffic.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That this large reduction of concentrations during the day can be explained by atmospheric mixing.",
                    "label": 0
                },
                {
                    "sent": "There is a significant increase in wind during this.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But still we want to know what the sources are.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And now we go from a black and white picture to a colored one.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have we have measurements at 7 wavelengths.",
                    "label": 0
                },
                {
                    "sent": "And especially what we're interested is would because it's a sustainable fuel, trees, recycling CO2 and would is being promoted as a sustainable fuel in terms of carbon dioxide in Slovenia, 52% of households use wood to hit houses.",
                    "label": 1
                },
                {
                    "sent": "And they do this with varying degrees of combustion efficiency.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And what we see here is that we can get extreme emissions of particulate matter from a single from a single house, essentially.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is not true not only for for small villages, but it is also true for towns like in Paris, where there is an estimation of that 20% of fine particulate matter comes from burning wood and getting over it 35% in Milano.",
                    "label": 0
                },
                {
                    "sent": "It's also between 1/3 and 1/4.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We want to quantify how much pollution comes from traffic and how much from wood conversion, and we can parameterized the dependence of absorption coefficient on the wavelength of light.",
                    "label": 0
                },
                {
                    "sent": "With a.",
                    "label": 0
                },
                {
                    "sent": "With with a one over wavelength on an exponent which is called the awesome exponent and for black particles this awesome exponent is 1 and these are measurements which will be done in Switzerland.",
                    "label": 0
                },
                {
                    "sent": "We see that.",
                    "label": 0
                },
                {
                    "sent": "Very tame dependence on the absorption from diesel and significant increase in absorption at low wavelengths in blue and UV due to aromatic compounds which are present in wood smoke.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And one can plot the Exponent's calculated from the Ethel Ometer measurements and we see this significant dip when the major contributor to air pollution.",
                    "label": 0
                },
                {
                    "sent": "Traffic.",
                    "label": 0
                },
                {
                    "sent": "Which is consistent because one would expect this to be one for diesel.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we can.",
                    "label": 0
                },
                {
                    "sent": "We can make a two component model now where we measure the total absorption which is composed of two contributions, one from wood combustion, one from fossil conversion and we know the wavelength dependence of these two different sources.",
                    "label": 0
                },
                {
                    "sent": "So we have four equations and we can decouple.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we can calculate the contributions to black carbon concentrations from fossil fuel and from wood combustion.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is the same.",
                    "label": 0
                },
                {
                    "sent": "In Nova Goritsy.",
                    "label": 0
                },
                {
                    "sent": "We can decouple this.",
                    "label": 0
                },
                {
                    "sent": "And of course the.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Most interesting part is when we when we decouple this in terms of dialogue profiles and we see that for black carbon about 3/4 of black carbon comes from fossil fuel combustion, which means from traffic usually.",
                    "label": 0
                },
                {
                    "sent": "And about 1/4 to 1/3 from combustion of wood.",
                    "label": 0
                },
                {
                    "sent": "And we see that there is a difference between algorithms or in terms of the relations of these two morning and evening picks.",
                    "label": 0
                },
                {
                    "sent": "The evening pick for wood combustion is much more prominent in the glory.",
                    "label": 0
                },
                {
                    "sent": "We can extend this model to all carbonaceous aerosols and this is important because black carbon is a primary pollutant, which means this is essentially what is emitted by the car or any other type of combustion engine carbonaceous aerosols.",
                    "label": 0
                },
                {
                    "sent": "Can be either primary error source which are emitted from the source or they can be generated in the atmosphere due to condensation of of compounds which are emitted in gas phase, or they can be changed by photochemistry or physical processes in the atmosphere.",
                    "label": 0
                },
                {
                    "sent": "And if we look at the oil carbonaceous aerosols, we see that the situation is reversed.",
                    "label": 0
                },
                {
                    "sent": "About 3/4 of of carbonaceous matter is emitted or is caused by burning wood and about 1/4 from traffic emissions.",
                    "label": 0
                },
                {
                    "sent": "So the major contributor to air pollution in terms of mass of particles which we measure in the air is wood combustion.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is not relevant only for outside air, but also for inside there.",
                    "label": 0
                },
                {
                    "sent": "And we have performed measurements in a primary school in Turbo via.",
                    "label": 0
                },
                {
                    "sent": "Where?",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have shown that the concentrations outside of here we are.",
                    "label": 0
                },
                {
                    "sent": "I'm showing again black carbon concentration, about half of them come from fossil fuel combustion, about half from wood combustion and the and the same is true for air which is measured inside the classroom.",
                    "label": 0
                },
                {
                    "sent": "So the composition is the same.",
                    "label": 0
                },
                {
                    "sent": "And the concentrations are the same.",
                    "label": 0
                },
                {
                    "sent": "Also becausw inside the air we measure about 90% of concentrations outside.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When we validate the model, we want to correlate the results of our model.",
                    "label": 0
                },
                {
                    "sent": "Results.",
                    "label": 0
                },
                {
                    "sent": "Is black arborwood compassion to tracer of wood combustion, which is determined by a chemical chemical method and this is labeled.",
                    "label": 0
                },
                {
                    "sent": "Glucose is strange type of sugar which is.",
                    "label": 0
                },
                {
                    "sent": "Generated when you burn cellulose and we see that in both knowledge reasons agori we get a really nice regression lines the slope of these two regression lines is different than we attribute this to different types of wood being combusted and these are some rough emission inventories where one can assume that the majority of Woods burned in algorithm is log would, while in the gory it's wood chips and wood pellets which are burned.",
                    "label": 0
                },
                {
                    "sent": "And the Holy Grail of source apportionment is something that goes mass closure where we want to reconstruct the measurements, which are made for all particulate matter for all particles which we measure in the air.",
                    "label": 0
                },
                {
                    "sent": "And here we add the measurements made from filter analysis at the environmental Agency in Slovenia to our determination of all combinations, method, and we see that.",
                    "label": 0
                },
                {
                    "sent": "Until we add woodsmoke into the picture, we don't really describe the particulate matter very well, so would smoke is a major major contributor to air pollution, especially in places like the area where we have a base in which is closed in winter with an inversion.",
                    "label": 0
                },
                {
                    "sent": "Black carbon is not regulated, so the weather 1 measures is or not or not depends on the goodwill of the municipality and the available funding.",
                    "label": 0
                },
                {
                    "sent": "Polyaromatic hydrocarbons, on the other hand, are regulated and benzo a. Pyrene is considered genic.",
                    "label": 0
                },
                {
                    "sent": "Compound with a limit of 1 nanogram, which is this value?",
                    "label": 0
                },
                {
                    "sent": "But a cubic meter.",
                    "label": 0
                },
                {
                    "sent": "As an annual average.",
                    "label": 0
                },
                {
                    "sent": "And what we wanted to know is whether we can determine what are the sources of benzo a pyrene.",
                    "label": 0
                },
                {
                    "sent": "And when will plot a regression between benzopyrene and black carbon.",
                    "label": 0
                },
                {
                    "sent": "We don't see any pattern.",
                    "label": 0
                },
                {
                    "sent": "However, when we plot the regression line between black carbon from wood combustion benzopyrene, we get a linear regression line with the.",
                    "label": 0
                },
                {
                    "sent": "Small intercept, this tells us that, at least in the Gloria but.",
                    "label": 0
                },
                {
                    "sent": "We found this afterwards also in other places.",
                    "label": 0
                },
                {
                    "sent": "Poly rheumatic hydrocarbons are emitted by wood combustion.",
                    "label": 0
                },
                {
                    "sent": "Which means that people who burn Woods to hit homes are poisoning their kids.",
                    "label": 0
                },
                {
                    "sent": "Which is a strong statement, but it's true.",
                    "label": 0
                },
                {
                    "sent": "We have, I'll skip over this, or maybe I won't.",
                    "label": 0
                },
                {
                    "sent": "We have done a similar XX campaign in Maribor.",
                    "label": 0
                },
                {
                    "sent": "But here we have a pair of station in the city center and outside and we see the outside.",
                    "label": 0
                },
                {
                    "sent": "The contribution of Woodsmoke, which is in green, is completely at outweighs contributions from traffic in inside the city.",
                    "label": 0
                },
                {
                    "sent": "This is about 2:00 to 1:00 and the really interesting thing is now to compare the concentrations which we have measured inside the city to the ones measured outside the city.",
                    "label": 0
                },
                {
                    "sent": "And if you plot a ratio of concentrations which are supposed to change over the day inside the city, normalized to the concentrations outside, we see that there is a strong increase of concentrations inside the city compared to outside during the day.",
                    "label": 0
                },
                {
                    "sent": "That's because the measurement side in the city center in Marable is right next to a very busy St.",
                    "label": 0
                },
                {
                    "sent": "However, would smoke.",
                    "label": 0
                },
                {
                    "sent": "Doesn't change all that much.",
                    "label": 0
                },
                {
                    "sent": "It's about between it's between 60 and 80% of those outside the city.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "This plot is important because it shows that if you regulate traffic, you can regulate local air pollution, while as woodsmoke which is.",
                    "label": 0
                },
                {
                    "sent": "Which contributes 2/3 of air pollution of carbonaceous particles inside the city and the majority outside the city is very homogeneous, so any abatement measures that you want to implement needs to be original, not local.",
                    "label": 0
                },
                {
                    "sent": "And Maribor in particular is is very well positioned because their their Department for the environment is not only a municipal Department for the environment is an Inter municipal Department for their model.",
                    "label": 0
                },
                {
                    "sent": "Environment and comprises several counties of around Marable.",
                    "label": 0
                },
                {
                    "sent": "So this is a place to watch for regulating woodsmoke.",
                    "label": 0
                },
                {
                    "sent": "So if we.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Move from local air pollution to regional and global climate change.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The first thing that I want to show you are the vertical profiles over Milano, which we did with the balloon, which was a standard balloon.",
                    "label": 1
                },
                {
                    "sent": "It was on very thin rope.",
                    "label": 0
                },
                {
                    "sent": "The rope was about this thick and we raise it to about 500 meters.",
                    "label": 0
                },
                {
                    "sent": "Several times during today's and we measured profiles something like this.",
                    "label": 0
                },
                {
                    "sent": "We see a very polluted layer of air immediately next to the ground.",
                    "label": 0
                },
                {
                    "sent": "And the reason is because this is this was next to a quite busy St and we have a relatively homogeneous layer of air.",
                    "label": 0
                },
                {
                    "sent": "And then above the mixing layer, the concentrations drop significantly.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then we parameterized this with a with a very simple model, and what this model shows is that a city can be considered as a regional source of air pollution.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "One can model this in as you know, by factor of less of less than two when compared when you compare the models and the measured air pollution on the site which is.",
                    "label": 0
                },
                {
                    "sent": "2000 meters above the city or the region that you consider your source of air pollution.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The real really interesting measurements, original measurements and these are very rare because they are expensive.",
                    "label": 0
                },
                {
                    "sent": "This year material energy has flown around the world with this aircraft.",
                    "label": 0
                },
                {
                    "sent": "And we have instrumented the aircraft with the prototype kilometre, which sampled the air from an inlet on the wing, and the instrument was inside the cockpit.",
                    "label": 0
                },
                {
                    "sent": "Material has flow.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Around the world.",
                    "label": 0
                },
                {
                    "sent": "In a little over three months and we have identified regions of higher air pollution in Africa, Americas and in Asia.",
                    "label": 0
                },
                {
                    "sent": "And the interesting.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thing about this areas is that sometimes one measures this blooms which are usually identified with a very well defined source.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The same.",
                    "label": 0
                },
                {
                    "sent": "Cannot be said for Southeast Asia where we measured much more spatially homogeneous concentrations.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Africa is a little bit special case because we have a combination of both.",
                    "label": 0
                },
                {
                    "sent": "India is very interesting.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will come back to this so this is an example of a point source over Mexico.",
                    "label": 0
                },
                {
                    "sent": "It's a power plant burning.",
                    "label": 0
                },
                {
                    "sent": "Some some sort of some sort of desire or distributed sources over Nepal where each of these houses has a kitchen where they burn biomes to cook.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And these pollution can then be transported over large differences because it is very well.",
                    "label": 0
                },
                {
                    "sent": "Straps in layers of air and this is an example from over Malaysia, Malaysia and one from over Congo in Africa.",
                    "label": 1
                },
                {
                    "sent": "And one can measure this blooms of pollution.",
                    "label": 0
                },
                {
                    "sent": "At the altitude of three kilometers.",
                    "label": 0
                },
                {
                    "sent": "So this is exactly the Heights where the majority of weather.",
                    "label": 0
                },
                {
                    "sent": "Occurs most of the phenomena, cloud formation and things like that.",
                    "label": 0
                },
                {
                    "sent": "Occur also at this altitude.",
                    "label": 0
                },
                {
                    "sent": "And one can identify these blooms of air pollution as biomes from the from the exponent which was calculated from this same measurements and we can see that we measure a plume and we see an increase of of the awesome experience which indicates that this plume is Biome.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yes, and this is true not only for measurements in Southeast Asia, but also from.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Agents over India where we have also calculated back trajectories.",
                    "label": 0
                },
                {
                    "sent": "So this is the site of the measurement and this is the back trajectory of the air which ended up at this location when we measured it.",
                    "label": 0
                },
                {
                    "sent": "And it was.",
                    "label": 0
                },
                {
                    "sent": "It originated at about 1500 meters in Iran, and then it was turned.",
                    "label": 0
                },
                {
                    "sent": "It raised and it dropped.",
                    "label": 0
                },
                {
                    "sent": "Over India somewhere in Gujarat and then it raised to about 3 1/2 kilometers where this air parcel was measured by.",
                    "label": 0
                },
                {
                    "sent": "It's inside the plane.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The just before the landing at about seven 700 meters above ground level, we measured another.",
                    "label": 0
                },
                {
                    "sent": "We calculate another back trajectory which originated in the approximately the same part where we think that the.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This big trajectory picked up air pollution cause it went really close to the ground.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then it went next to the next to the next to the coast, to the measurement side, and we see that wild concentrations change.",
                    "label": 0
                },
                {
                    "sent": "The angstrom exponent is very homogeneous, and we interpret this as the whole India being covered by a Brown cloud.",
                    "label": 0
                },
                {
                    "sent": "Which is very homogeneous in terms of composition.",
                    "label": 0
                },
                {
                    "sent": "And the sources are biomes being burned all over India.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is a picture of the inlet where we sucked air in to our sampling system and then to the instrument and we see that we see this.",
                    "label": 0
                },
                {
                    "sent": "Significant the position of particulars on the airplane because the air was so dirty.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now I want to show you know this is a more commercial oriented part of the talk.",
                    "label": 0
                },
                {
                    "sent": "This is the new instrument that we developed in the past three years and we commercialized it this year.",
                    "label": 0
                },
                {
                    "sent": "It was a Eureka type project where we collaborated with Swiss very large Swiss Institute.",
                    "label": 0
                },
                {
                    "sent": "In the measurements we made.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These are the results of the measurements from the instrument correlated with post processing.",
                    "label": 0
                },
                {
                    "sent": "The results from our traditional legacy instruments, and we saw we see a very nice regression line with a slope of one and a very very small intersect.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And because the time resolution of this measurement is 1 second, we can use it in mobile measurements and these are measurements from Switzerland where the driver drove around the around a highway and we can show them from these measurements that you know it is nice to live downwind, not downwind, but upwind of the highway, because the concentrations on this side of the highway are much higher than on this side of the highway.",
                    "label": 0
                },
                {
                    "sent": "What we also did with tried to characterize the type of air pollution observed in this, but this is still work in progress.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To sum up.",
                    "label": 0
                },
                {
                    "sent": "Black carbon is relevant for both health and climate.",
                    "label": 0
                },
                {
                    "sent": "We can measure it anywhere because we can miniaturize the methodology, which uses on a filter on a quartz piece of filter and an optical analysis, and we can put it in small airplanes and not only we can we measure, but you can also determine the sources of air pollution with an instrument which is made in Slovenia by now.",
                    "label": 0
                },
                {
                    "sent": "12 people.",
                    "label": 0
                },
                {
                    "sent": "Across the city in Louisiana.",
                    "label": 0
                },
                {
                    "sent": "With this I would like to conclude and.",
                    "label": 0
                },
                {
                    "sent": "Ask you for questions.",
                    "label": 0
                },
                {
                    "sent": "Holly Matic regulator.",
                    "label": 0
                },
                {
                    "sent": "Colelction Bayless turning ugly capybara viani, sadistic retail stratosfear Oh yeah.",
                    "label": 0
                },
                {
                    "sent": "Picasso and Ruben.",
                    "label": 0
                },
                {
                    "sent": "And under present axiom.",
                    "label": 0
                },
                {
                    "sent": "Me small mirrors, no.",
                    "label": 0
                },
                {
                    "sent": "Today is not real little.",
                    "label": 0
                },
                {
                    "sent": "It's not really Italian or any drugs, Viro quote district capital, Zune.",
                    "label": 0
                },
                {
                    "sent": "In provision polluters, Roca is not a cabin.",
                    "label": 0
                },
                {
                    "sent": "AS little Junie Ritter, Clara impress teams filter and that filter in regards to this and maybe bacteria and viruses not recombinant Shirley, I'm at this current system provider publish and Zach is not recommended.",
                    "label": 0
                },
                {
                    "sent": "In terminal, across America means no trail attalla curing.",
                    "label": 0
                },
                {
                    "sent": "In the search business leader provisional credit Rule italic is minimal concentrated Zune that the static allometry into intact and attack an attacker Merito is San Francisco, New York.",
                    "label": 0
                },
                {
                    "sent": "Caring as a cheat code campaign, opponent's Roca voices within this May mirror the token retrieval gas.",
                    "label": 0
                },
                {
                    "sent": "Electrons can apply a. Construct is a low heat rope ladder.",
                    "label": 0
                },
                {
                    "sent": "Equal peers at nanogram, Monokuma trickery is Resolume Alo, not Chicago kennels, midnight permitting she little ish vormetric.",
                    "label": 0
                },
                {
                    "sent": "Mass V2, but with more provision.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that Cohen factored 3 into server since let Allah this was not reinstated.",
                    "label": 0
                },
                {
                    "sent": "Curatorial Attila pred little on bottom ribbon trim and camera in.",
                    "label": 0
                },
                {
                    "sent": "Delicio put Nivea so team is here poem in the Tucker is julians kid just take a journey Rubraca dial she Skechers.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Trachea metry.",
                    "label": 0
                },
                {
                    "sent": "Here's a causes star, a separate sleigh or Bleacher Niconico Hydrophila.",
                    "label": 0
                },
                {
                    "sent": "Be naked, refill and plush.",
                    "label": 0
                },
                {
                    "sent": "Supporting Roddenberry inside his parents atmosphere is redness and visual design.",
                    "label": 0
                },
                {
                    "sent": "Balance 2K rugby, possum, omolo, Sadia, Veneman, utip, Oviedo.",
                    "label": 0
                },
                {
                    "sent": "It'll matter in black carbon, Merritt over Slovenia, Vista, Saginaw Valley to chase, necessitating hoarseness at Cosmo.",
                    "label": 0
                },
                {
                    "sent": "Game is constitute get to Crabtree.",
                    "label": 0
                },
                {
                    "sent": "Very skittish.",
                    "label": 0
                },
                {
                    "sent": "Delivers Lawrence Berkeley laboratory am across EMEA studio.",
                    "label": 0
                },
                {
                    "sent": "Supervisors cupino in small there is discovered.",
                    "label": 0
                },
                {
                    "sent": "Delaval Ina prefetto donis.",
                    "label": 0
                },
                {
                    "sent": "Tommy Resnick Ritala Metra grieshop obj.",
                    "label": 0
                },
                {
                    "sent": "Check bonus little Coco Stark's mascot mattress cover.",
                    "label": 0
                },
                {
                    "sent": "Let's see how to cheat atmospherics, Cocomero, Berkeley, Brazoria Bill, the loss animal, black Carbon Turner Blixen you, Villanova said or done dances.",
                    "label": 0
                },
                {
                    "sent": "Predmore Chadwick late possibly personality Deborah PF America nikolica pray circles of edema, Izium and Razvoj in Slack or some other silly.",
                    "label": 0
                },
                {
                    "sent": "Digraph Slovenia not chosen obesity or minimal permission of local to the the Samish beaches.",
                    "label": 0
                },
                {
                    "sent": "Namastey koala.",
                    "label": 0
                },
                {
                    "sent": "Yes, I'm assume Italia telemeter.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Doing your hands not supposed to pick America tackles in business register burkleo Impala nikolic's never Slovenie says Good Bus which is a pallet code smokes.",
                    "label": 0
                },
                {
                    "sent": "Keys there, so quiet as it is, why I means.",
                    "label": 0
                },
                {
                    "sent": "Please would not take instrumental in planning.",
                    "label": 0
                },
                {
                    "sent": "At Marshall in I am watching tournament Glico.",
                    "label": 0
                },
                {
                    "sent": "Subservient equation chemical yeah there mark actionable stay within our political power she know.",
                    "label": 0
                },
                {
                    "sent": "Making their so called so sigh.",
                    "label": 0
                },
                {
                    "sent": "Sigh Moseley Cupertino primary of is the Western Union in.",
                    "label": 0
                },
                {
                    "sent": "Is experimental cure some miracle?",
                    "label": 0
                },
                {
                    "sent": "Give some mineral absorbs here.",
                    "label": 0
                },
                {
                    "sent": "Dell servers Raccoon is supposed to premiere Real Richmond vanished.",
                    "label": 0
                },
                {
                    "sent": "Romanticism merely sees wreck.",
                    "label": 0
                },
                {
                    "sent": "English the neuter.",
                    "label": 0
                },
                {
                    "sent": "Malaysia knicker Alyssa Grevena Malpas.",
                    "label": 0
                },
                {
                    "sent": "Experiment is not the component, say lack laughner's new organs, Kiss movie, sprouses Delta overprints.",
                    "label": 0
                },
                {
                    "sent": "Cosm commended Putin instrument, concussion in Nash, Khymir Cosa del Cinnabarinum filter if necessary.",
                    "label": 0
                },
                {
                    "sent": "Nikki Silverstein, a filter computer in multi factor into Arabic.",
                    "label": 0
                },
                {
                    "sent": "The Celma heavily quemener filter cut tiki Myrna Valley commuters rock breasting at the new Darian this Castle Castle.",
                    "label": 0
                },
                {
                    "sent": "Yeah the.",
                    "label": 0
                },
                {
                    "sent": "Said Cucina Bahani is Maisha carpool mean.",
                    "label": 0
                },
                {
                    "sent": "The Mogu channel did DLC key so.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ground Operational Spoke Association Premier is the.",
                    "label": 0
                },
                {
                    "sent": "We should do a card.",
                    "label": 0
                },
                {
                    "sent": "Nicole and Nick, Nick Nick Nick na silts.",
                    "label": 0
                },
                {
                    "sent": "Dell service available.",
                    "label": 0
                },
                {
                    "sent": "Mechanism.",
                    "label": 0
                },
                {
                    "sent": "Deal so necessary so slow computer running in realtime or experimental.",
                    "label": 0
                },
                {
                    "sent": "Your children.",
                    "label": 0
                },
                {
                    "sent": "Delta.",
                    "label": 0
                },
                {
                    "sent": "So tonight will try experiments.",
                    "label": 0
                },
                {
                    "sent": "The new Durham in Super Super cars all the tested DLC kinematic newer ganske.",
                    "label": 0
                },
                {
                    "sent": "Screen which car so evil Drow Nikki Michelle programming is specialty Morocco, experimental and Arian.",
                    "label": 0
                },
                {
                    "sent": "Around in the clarner.",
                    "label": 0
                },
                {
                    "sent": "Who is Rocko?",
                    "label": 0
                },
                {
                    "sent": "Could appreciate just so little.",
                    "label": 0
                },
                {
                    "sent": "Bush.",
                    "label": 0
                },
                {
                    "sent": "Mckinneys new people, so Nittany Interleukin mishek filter.",
                    "label": 0
                },
                {
                    "sent": "Kiki.",
                    "label": 0
                },
                {
                    "sent": "So we need a new mechanism.",
                    "label": 0
                },
                {
                    "sent": "It is ticket this provision in the district Key.",
                    "label": 0
                },
                {
                    "sent": "Zach Yep, 2 trees to this on average per surgical is there are in that or mechanism key provider duty?",
                    "label": 0
                },
                {
                    "sent": "So nervous about this new leak.",
                    "label": 0
                },
                {
                    "sent": "To 6:20 to six romantic here.",
                    "label": 0
                },
                {
                    "sent": "Slow process linear at disco.",
                    "label": 0
                },
                {
                    "sent": "Please visit us as a drag.",
                    "label": 0
                },
                {
                    "sent": "Parameter posits.",
                    "label": 0
                },
                {
                    "sent": "Does experimentalism.",
                    "label": 0
                },
                {
                    "sent": "How much money?",
                    "label": 0
                },
                {
                    "sent": "Set lobster.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but it is yellow.",
                    "label": 0
                },
                {
                    "sent": "Good about global accounts for schools going over Cosette planets.",
                    "label": 0
                },
                {
                    "sent": "Yep, reset.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is a bug.",
                    "label": 0
                },
                {
                    "sent": "This kind of near Morris Agreement perversione.",
                    "label": 0
                },
                {
                    "sent": "In the stylish approver, Sheena Turner Glick clip over Sheena.",
                    "label": 0
                },
                {
                    "sent": "The talker interested as measured.",
                    "label": 0
                },
                {
                    "sent": "Live.",
                    "label": 0
                },
                {
                    "sent": "Redeemer is not yet experiment demo colonized by September.",
                    "label": 0
                },
                {
                    "sent": "Apparel North America.",
                    "label": 0
                },
                {
                    "sent": "Is Ratchet Prostor in support tickets Mill Blue 0 so little ski?",
                    "label": 0
                },
                {
                    "sent": "Temperature.",
                    "label": 0
                },
                {
                    "sent": "Perversion interessee particular deals that took out beer.",
                    "label": 0
                },
                {
                    "sent": "Journal click click deeper.",
                    "label": 0
                },
                {
                    "sent": "She know that crap, Sorbera said.",
                    "label": 0
                },
                {
                    "sent": "Lobo San Jose Lobo, atmospheric ambac professional Claudia atmosphere up a cigarette.",
                    "label": 0
                },
                {
                    "sent": "You know?",
                    "label": 0
                },
                {
                    "sent": "Sarah Sugriva, Bill category Cody exit.",
                    "label": 0
                },
                {
                    "sent": "Some little junkie mine.",
                    "label": 0
                },
                {
                    "sent": "She's a talker.",
                    "label": 0
                },
                {
                    "sent": "Chino.",
                    "label": 0
                },
                {
                    "sent": "To buy them Victor.",
                    "label": 0
                },
                {
                    "sent": "The group has a trip to become material.",
                    "label": 0
                },
                {
                    "sent": "Look carefully.",
                    "label": 0
                },
                {
                    "sent": "Cost is Italiana, Kataram Wiederin Kozilek extrapolation discussion normally come and go to Standard Opium, an adverb opposed to set some potential inability to trust machine.",
                    "label": 0
                },
                {
                    "sent": "Filter keys new problem, also filtering kissable as it is a million PM this it is just as long as you can see Nick Dokie Matco Magna Prison Warden.",
                    "label": 0
                },
                {
                    "sent": "Instrumental Zune like email anymore promotional email.",
                    "label": 0
                },
                {
                    "sent": "Znga DLC Sylviane today and it did not have Lackner Sticklen, Alpha, Caccia Vander Waals Museum.",
                    "label": 0
                },
                {
                    "sent": "Peters filtering is aware of those low, making it Delta.",
                    "label": 0
                },
                {
                    "sent": "Yep, so far as licking it puts me feel tree in.",
                    "label": 0
                },
                {
                    "sent": "Because you pressure.",
                    "label": 0
                },
                {
                    "sent": "Climate is concurrent with tremendous slapstick, gnashing in Terminal 3 percentage, also bigger.",
                    "label": 0
                },
                {
                    "sent": "But it'll metrohm problem question filter Alpha.",
                    "label": 0
                },
                {
                    "sent": "Filter is stay clicking so put him or plus Chinese at the forum.",
                    "label": 0
                },
                {
                    "sent": "And we are more practical schedule.",
                    "label": 0
                },
                {
                    "sent": "So doesn't Ristic magic problem near the SMPS in the Tucker.",
                    "label": 0
                },
                {
                    "sent": "Roshanak I lock them quickly set in animate response measures.",
                    "label": 0
                },
                {
                    "sent": "Sophisticated instrument rubbish that there is measure.",
                    "label": 0
                },
                {
                    "sent": "Could.",
                    "label": 0
                },
                {
                    "sent": "Is Christic filter area the lowest?",
                    "label": 0
                },
                {
                    "sent": "Yeah, so problem.",
                    "label": 0
                },
                {
                    "sent": "Problem absolutely filtered through the reality filter or HEPA filter keys on them in an air conditioner in terms of standard in the unit code.",
                    "label": 0
                },
                {
                    "sent": "Discover more super Delta kisses the law, the law mania.",
                    "label": 0
                },
                {
                    "sent": "Departure really costs.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Inga task assist angadi laveaga.",
                    "label": 0
                },
                {
                    "sent": "Yeah, racist nanometer attachable tagra fee to input M Another attack a very cost deals are curious Mermelstein instrumented but typically not Amit awesome.",
                    "label": 0
                },
                {
                    "sent": "Set passcode based Nano Metro the switch design.",
                    "label": 0
                },
                {
                    "sent": "Motion for Sonia.",
                    "label": 0
                },
                {
                    "sent": "His dossantos accounts proposed to victory Casino Manoso.",
                    "label": 0
                },
                {
                    "sent": "My lacoy implicates Rosner, Rosner, Toyota owners, Nirvana News, Bureau squadrons, biomass and apprentice trainee among your cats.",
                    "label": 0
                },
                {
                    "sent": "And their gear.",
                    "label": 0
                },
                {
                    "sent": "But we're standing out with money.",
                    "label": 0
                },
                {
                    "sent": "It's probably not worth it.",
                    "label": 0
                },
                {
                    "sent": "Does go digital partial guy put him with Gore put?",
                    "label": 0
                },
                {
                    "sent": "Why yes, there is some slow professionality for million in.",
                    "label": 0
                },
                {
                    "sent": "Neighbors you probably saw the Nikki Kirby steamer BC Gravel, so he.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Upstyle Nchini Colonel Esaki searching committee.",
                    "label": 0
                },
                {
                    "sent": "In Kinepolis, Roger Missy problem your team into problem, problem, custom ability, it all the.",
                    "label": 0
                },
                {
                    "sent": "In on the browser, even he she.",
                    "label": 0
                },
                {
                    "sent": "It was discovered Napa is it should be hot.",
                    "label": 0
                },
                {
                    "sent": "Let it see mostly any racial problems and IMMA be more under apparently Escargot River in the City Hotel codes.",
                    "label": 0
                },
                {
                    "sent": "Coca terrorism, or the Java hot Logical Lotus Events MA, DMD security system and biomass 2 minute resume not to say CPG in parameters does not.",
                    "label": 0
                },
                {
                    "sent": "Improve problem.",
                    "label": 0
                },
                {
                    "sent": "Which is a minimal separate channel?",
                    "label": 0
                },
                {
                    "sent": "Is the hip which is business lead?",
                    "label": 0
                },
                {
                    "sent": "Pusheen couple in their native artist needs knee grieving analysing you down here.",
                    "label": 0
                },
                {
                    "sent": "Nellis so kudos rush impossibility so the the nieciecza filter on your knowledge technical standard is Alyssa Peachy.",
                    "label": 0
                },
                {
                    "sent": "Net regular error MSE deals are doctors who don't make their intentions are individual issues, so the wall magnetic and it Reba prevalent and Democratic leader in cattle.",
                    "label": 0
                },
                {
                    "sent": "It is merged Nazmi remiss your Delta.",
                    "label": 0
                },
                {
                    "sent": "Let me see this.",
                    "label": 0
                },
                {
                    "sent": "In the motel also care my arm originating sorption correct paper it's pranami there is Michelle Team Winner Deal dinner Dear Sistema keep your gravel Dylan Mr Inview Proble Massa input immigrant visas infrastructure possibilities, sprouted Doppler RADA individually huge problem therapist operator that infrastructure dragon.",
                    "label": 0
                },
                {
                    "sent": "Ljubljana, Mesecher Mamata Plot number Asia Keebler pathology Pretzel dogs catiria sapona Miley mineral primer coat Grill was a grineer vermist into a Redeemer, tacticians, global spare hook you tryba.",
                    "label": 0
                },
                {
                    "sent": "The career climber dealer unplug the list given Izuna Lubrani, Drago with Asahi my auto system.",
                    "label": 0
                },
                {
                    "sent": "I'm a colleague is against it so clear prior the apashe this minimal problems.",
                    "label": 0
                },
                {
                    "sent": "Melissa McBride work, the two crit or patched snail.",
                    "label": 0
                },
                {
                    "sent": "Least you put in to see less.",
                    "label": 0
                },
                {
                    "sent": "Need goes us block.",
                    "label": 0
                },
                {
                    "sent": "It is practicians stone.",
                    "label": 0
                },
                {
                    "sent": "In problem alternative, could annulus IO team the Tony Carey Trainer did submission era that or the the probabilities nail glitter talk with an equal economic or an economic problem.",
                    "label": 0
                },
                {
                    "sent": "Agreed and to cry?",
                    "label": 0
                },
                {
                    "sent": "Very simple proposal shall swarm was driving South drivers license, Salem.",
                    "label": 0
                },
                {
                    "sent": "Nope, spider.",
                    "label": 0
                }
            ]
        }
    }
}