{
    "id": "7bv3uvr5comj3ii5eefyzn33d2b2jwfq",
    "title": "Scalable Influence Maximization for Prevalent Viral Marketing in Large-Scale Social Networks",
    "info": {
        "author": [
            "Wei Chen, Microsoft Research Asia, Microsoft Research"
        ],
        "published": "Oct. 1, 2010",
        "recorded": "July 2010",
        "category": [
            "Top->Computer Science->Algorithms and Data Structures"
        ]
    },
    "url": "http://videolectures.net/kdd2010_chen_sim/",
    "segmentation": [
        [
            "I'm waiting from Microsoft Research Asia here to present our work on scalable influence maximization for prevalent viral marketing in large scale social networks, and this is in collaboration with share one from yeah, you see an yajun Wang from Microsoft Research issue too."
        ],
        [
            "So the outline of the talk I will first talk about the background and the problem definition and next focus on the new algorithm we propose called maximum influence operations heuristic.",
            "I will give the experimental results that we evaluate the algorithm and finally talk about related work and future directions."
        ],
        [
            "So there is a lot of talk about social networks.",
            "So are they justified?",
            "The importance here just showing another example from Microsoft academic, our academic search showing an egocentric network of John Kleinberg.",
            "He is one of the authors that initiated the algorithmic research in this area.",
            "In the influence maximization area.",
            "So basically social network is everywhere, an one of the important aspect of social network is enabled, the viral marketing.",
            "Which I will just briefly explain via an simple example, so here."
        ],
        [
            "Here we show a small network, suppose.",
            "The movie one of the initial select two seats and we give them free tickets to promote the movie Avatar and they watch the movie and really like it and start to talk about the movie to their friends and it's great.",
            "You have to go and watch it and then their friends by this influence start to really go and watch the movie and then start talking about the movie and then this cascade propagates through the network.",
            "And this is basically what we mean by word of mouth marketing or viral marketing.",
            "You choose a small number of nodes to start the cascade effect."
        ],
        [
            "Well, by some marketing research, people show that viral marketing is very effective and arguably the most effective marketing strategy here is marketing research, showing that from the information people got from various channels, the information they got from their family and friends are far more reliable and they trust those information much more than they trust information from, say, newspaper, TV or online advertisement and so on.",
            "So that shows a very marketing is important marketing strategy.",
            "And with the increasing popularity of online social networks that give the opportunity to do effective viral marketing online.",
            "So that's the more less social background.",
            "The now I'm moving to the more technical part."
        ],
        [
            "So to solve this viral marketing problem will give a definition algorithmically problem definition as follows.",
            "So a social network is modeled as influence graph, where vertices are representing individuals, edges representing relationships and the edges directed because its influence is usually directional Ann.",
            "There are probabilities on the edges.",
            "Like here, one person has A to the other person has on these edges has four 0.1 million, roughly million with probability 0.1.",
            "If this guy is activated he will influence this guy and make this second guy activated.",
            "So that's the edge probability and associated with this influence graph we have an influence cascade model.",
            "Basically we start with the initial seed node, a small set of signals.",
            "And at each step, each newly activity node, say you it, will activate its neighbors is outgoing neighbors with probability PUV on the edges, and this is 1 trial an.",
            "The this is cascade going discrete step by step and it will end if there's no more activity nodes in the graph and then.",
            "We define the influence spread to be the expected number of nodes activities, because this is a stochastic process, we're talking about expected expected value here.",
            "So then we can define the problem of influence maximization to be finding the top K sees that generate the largest influence spread, K being the input parameter to the problem.",
            "So this is a well defined problem."
        ],
        [
            "An in fact.",
            "This is some animation to show the process.",
            "So the problem is originally defined by.",
            "Campion climb bringing toddlers in KDD 2003 as a discrete optimization problem.",
            "The results they show their include first that finding the optimal solution is NP hard.",
            "Second, they provide a greedy approximation algorithm achieving about 3063% approximation ratio and the greedy approximation algorithm, similar to what the previous presenter shows, is basically, if you want to find Casey's.",
            "You just repeated in K runs in each round you find 1, see that.",
            "Provides the largest marginal increase in the influence spread and it's guaranteed approximation ratio because of the submodularity property.",
            "But the problem is evaluation of this influence red.",
            "Given NEC set, this problem itself is a hard and slow problem an even with several subsequent study that drastically improve the performance, the overall performance of influence maximization is still quite slow given like for example 30,000 graphs.",
            "It takes hours to find about 50 seats in the network.",
            "So that's the thing we want to improve.",
            "'cause we're be working on much larger graphs and will do a lot of such kind of influence maximization to select top seeds so."
        ],
        [
            "In our work.",
            "We focus on improving the efficiency while keep the effectiveness of the seat selection.",
            "So we designed a heuristic we called maximum influence operations heuristic an it works for independent general independent Cascade model it has.",
            "About at least three orders of magnitude speedup, which means we can reduce the computation from hours to seconds or from days to minutes an.",
            "On the other hand, the influence spread it generate is still close to what is generated by the greedy algorithm, so it doesn't reduce much inequality.",
            "Anne.",
            "We also show a hardness result.",
            "Basically, the computing exactly influence spread given a seat set is a Sharpie hard problem.",
            "Sharpie heart is basically accounting harness.",
            "Result is even harder than NP complete problem.",
            "So so basically this resolve an open question posted in the original paper and it's also another indication showing that computing influence spread in such network is indeed a hard problem.",
            "It has some intrinsic difficulty."
        ],
        [
            "So the second part I'll focus on the the maximum influence operations heuristic.",
            "First, given this graph out, define a maximum influence path.",
            "Basically given any node U and any node V, I'll find the one pass from U2V that has the largest weight.",
            "The weight of the path is basically the product of all the ways on the edges, so this particular path has a weight 0.1 two and its largest among all the paths.",
            "And I ignore those Maps with very small probability and this is controlled by a parameter Param."
        ],
        [
            "Theater.",
            "So this is to find the path the 2nd.",
            "I will find the what we call operators so and it will form the local influence regions.",
            "So here, given a node VI, just collect all the maximum influence paths going into V and this former tree operations is basically a graph theoretical terms in it's a tree where all the edges pointing into the root of the tree is called in our presence.",
            "If it's pointing away from the.",
            "Root is called out operations, so here the Gray edges forms in operations and its phones by maximum influence pass going into."
        ],
        [
            "Symmetrically, for any node you I can find those red edges is form a maximum influence out operations.",
            "The importance of finding these local structures is first they give an efficient computation.",
            "Be efficient, computed using the diestrus shortest path algorithm and Secondly."
        ],
        [
            "Well, we compute influence spread within a tree.",
            "That's a quite easy task, is just.",
            "You can do it by a simple.",
            "Recursion and recursion online six.",
            "It's almost self explained, so I will not spend time here.",
            "So basically computation in trees is easy and we also limited the local computation.",
            "That's the way we want to speed up the algorithm, but just do this by itself if we just do this with a greedy algorithm is already OK. Have a very good speed up, but it's still not efficient enough an."
        ],
        [
            "Then we explore the second property in this kind of computation.",
            "This property is if we say a PV is the activation property in the of the root V in the tree.",
            "An APU is the activation property of another node in the tree.",
            "Then they have this linear relationship and this Alpha is the linear coefficient and the key is all the offers in one tree can be recursively computed, and this recursive computation just take linear time to the size of the tree.",
            "And just by doing this we can reduce the computation from a quadratic time computation to linear time.",
            "And then given this, a linear coefficient, the marginal influence increase from U to V can be easily computed by this formula because our view is the linear coefficient, one is 1 user selected seed, its activation probability becomes one and is old, one is APU.",
            "So this is the daughter of the changes of Activision.",
            "Probability of you.",
            "So this gives the marginal influence from U to V. And we just sum them up from you to all the roots and then we can compute the margin influence probability of you.",
            "And then we just select the you with the largest marginal influence.",
            "So this gives us a way to select the seeds an after we select seeds.",
            "We just updated this linear coefficients and this update just take a linear time to the size of the."
        ],
        [
            "So overall, this computation is the iteration among two steps.",
            "First we select.",
            "Among all the notes that no deal with the largest marginal influence, and then we update the local structures, basically updating those linear coefficients after we select the nodes and the key feature is the update is local because our trees are local controlled by the parameter Theta and is update is linear and also with the tunable parameter Theta.",
            "We are able to do the trade off between running time and influence spread."
        ],
        [
            "So now I will show the our experimental results.",
            "About this algorithm, we run experiments on a number of real world networks and what I show here is 2 particular networks.",
            "One is from physics.",
            "Archive is a collaboration, network is a moderate size like 15 K nodes.",
            "The other is opinion network we got thanks, less coverage from his website.",
            "This data set and we have a couple of larger datasets an.",
            "The influence.",
            "The probability on the edges.",
            "We use this latest case weighted Cascade model.",
            "Basically the influence to a node V is one over the number of in neighbors of V. And then we run different algorithms will compare with greedy algorithm and another algorithm which is a heuristic algorithm based on shortest path and degree discount is another heuristic we did last year for a uniform cascade model and also page rank random.",
            "And actually we have more algorithm.",
            "We comparing the paper and the result here shows the Y axis is the influence red X axis is the seat size basically first.",
            "Our algorithm Mia algorithm Temia is another improvement of near that I didn't talk about it here, so the Premier algorithm matches the greedy algorithm in influence graph.",
            "So in in both cases but comparing with other heuristic algorithm, especially in this case, it has a very good.",
            "Performance in influence spread while page rank and other degrees kind of quite poor here."
        ],
        [
            "More importantly, if we look at the running time results, here we compare running time of different algorithm on different datasets, for example here.",
            "The blueberry is a greedy algorithm.",
            "The Green Bar is our algorithm, and we achieve more than three orders of magnitude speedup.",
            "This is 1.3 hour, and here is only half seconds.",
            "And to a larger data set about on this greedy algorithm, even though we cannot run in a reasonable amount of time and the red bar is another heuristic which takes 30 hours, and in our case only take about 10 seconds.",
            "So basically the two results here.",
            "We want to convey the idea is our algorithm is very fast while we are our influence, spread is still keep at the among the best influence spread that algorithms can find."
        ],
        [
            "So this is another scalability test on synthetic graphs.",
            "An clearly shows the greedy algorithm and another heuristic is does not scale while our algorithm has very good scalability."
        ],
        [
            "Finally, I'll mention the related work.",
            "There's one category of work on improving the greedy approximation algorithm by earlier like lazy full optimization by less coverage etc.",
            "An an edge sampling.",
            "Computation of reachable sets by Kimura and also by our earlier work.",
            "But this work, even though they have good improvement, is still not scalable.",
            "Another line of work is to try different heuristic algorithm.",
            "But the first heuristic algorithm one is based on shortest path, the other based on sharply value both them not scalable and the degree discount we proposed last year is very scalable, but it only works for uniform.",
            "Independent cascade model where edge probabilities are the same and we show in the earlier graph that it doesn't work well in other cases, Ann.",
            "This is actually another algorithm that is going to be presented in the next talk, so we look at them and there have very nice ideas are using Community partition an we believe that our work are complementary to their work.",
            "An another common is our media.",
            "Local media algorithm has this we believe has this natural adaptation to the Community structure because if you have close community will influence our almost within the Community, then we will compute the tree structure within the Community."
        ],
        [
            "Finally, for future directions, from the theoretical point of view, it will be interesting to look at efficient approximation algorithm to compute influence spread, because this seems to be the bottleneck of the of this problem.",
            "From practical side it will be much interesting to do influence analysis using social media data to see what are the actual influence probabilities between people.",
            "Anne."
        ],
        [
            "For that and my talking, thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm waiting from Microsoft Research Asia here to present our work on scalable influence maximization for prevalent viral marketing in large scale social networks, and this is in collaboration with share one from yeah, you see an yajun Wang from Microsoft Research issue too.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the outline of the talk I will first talk about the background and the problem definition and next focus on the new algorithm we propose called maximum influence operations heuristic.",
                    "label": 0
                },
                {
                    "sent": "I will give the experimental results that we evaluate the algorithm and finally talk about related work and future directions.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So there is a lot of talk about social networks.",
                    "label": 1
                },
                {
                    "sent": "So are they justified?",
                    "label": 0
                },
                {
                    "sent": "The importance here just showing another example from Microsoft academic, our academic search showing an egocentric network of John Kleinberg.",
                    "label": 0
                },
                {
                    "sent": "He is one of the authors that initiated the algorithmic research in this area.",
                    "label": 0
                },
                {
                    "sent": "In the influence maximization area.",
                    "label": 0
                },
                {
                    "sent": "So basically social network is everywhere, an one of the important aspect of social network is enabled, the viral marketing.",
                    "label": 0
                },
                {
                    "sent": "Which I will just briefly explain via an simple example, so here.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here we show a small network, suppose.",
                    "label": 0
                },
                {
                    "sent": "The movie one of the initial select two seats and we give them free tickets to promote the movie Avatar and they watch the movie and really like it and start to talk about the movie to their friends and it's great.",
                    "label": 0
                },
                {
                    "sent": "You have to go and watch it and then their friends by this influence start to really go and watch the movie and then start talking about the movie and then this cascade propagates through the network.",
                    "label": 0
                },
                {
                    "sent": "And this is basically what we mean by word of mouth marketing or viral marketing.",
                    "label": 0
                },
                {
                    "sent": "You choose a small number of nodes to start the cascade effect.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, by some marketing research, people show that viral marketing is very effective and arguably the most effective marketing strategy here is marketing research, showing that from the information people got from various channels, the information they got from their family and friends are far more reliable and they trust those information much more than they trust information from, say, newspaper, TV or online advertisement and so on.",
                    "label": 0
                },
                {
                    "sent": "So that shows a very marketing is important marketing strategy.",
                    "label": 0
                },
                {
                    "sent": "And with the increasing popularity of online social networks that give the opportunity to do effective viral marketing online.",
                    "label": 0
                },
                {
                    "sent": "So that's the more less social background.",
                    "label": 0
                },
                {
                    "sent": "The now I'm moving to the more technical part.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to solve this viral marketing problem will give a definition algorithmically problem definition as follows.",
                    "label": 0
                },
                {
                    "sent": "So a social network is modeled as influence graph, where vertices are representing individuals, edges representing relationships and the edges directed because its influence is usually directional Ann.",
                    "label": 0
                },
                {
                    "sent": "There are probabilities on the edges.",
                    "label": 0
                },
                {
                    "sent": "Like here, one person has A to the other person has on these edges has four 0.1 million, roughly million with probability 0.1.",
                    "label": 0
                },
                {
                    "sent": "If this guy is activated he will influence this guy and make this second guy activated.",
                    "label": 0
                },
                {
                    "sent": "So that's the edge probability and associated with this influence graph we have an influence cascade model.",
                    "label": 0
                },
                {
                    "sent": "Basically we start with the initial seed node, a small set of signals.",
                    "label": 0
                },
                {
                    "sent": "And at each step, each newly activity node, say you it, will activate its neighbors is outgoing neighbors with probability PUV on the edges, and this is 1 trial an.",
                    "label": 1
                },
                {
                    "sent": "The this is cascade going discrete step by step and it will end if there's no more activity nodes in the graph and then.",
                    "label": 0
                },
                {
                    "sent": "We define the influence spread to be the expected number of nodes activities, because this is a stochastic process, we're talking about expected expected value here.",
                    "label": 0
                },
                {
                    "sent": "So then we can define the problem of influence maximization to be finding the top K sees that generate the largest influence spread, K being the input parameter to the problem.",
                    "label": 1
                },
                {
                    "sent": "So this is a well defined problem.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "An in fact.",
                    "label": 0
                },
                {
                    "sent": "This is some animation to show the process.",
                    "label": 0
                },
                {
                    "sent": "So the problem is originally defined by.",
                    "label": 0
                },
                {
                    "sent": "Campion climb bringing toddlers in KDD 2003 as a discrete optimization problem.",
                    "label": 1
                },
                {
                    "sent": "The results they show their include first that finding the optimal solution is NP hard.",
                    "label": 0
                },
                {
                    "sent": "Second, they provide a greedy approximation algorithm achieving about 3063% approximation ratio and the greedy approximation algorithm, similar to what the previous presenter shows, is basically, if you want to find Casey's.",
                    "label": 1
                },
                {
                    "sent": "You just repeated in K runs in each round you find 1, see that.",
                    "label": 1
                },
                {
                    "sent": "Provides the largest marginal increase in the influence spread and it's guaranteed approximation ratio because of the submodularity property.",
                    "label": 1
                },
                {
                    "sent": "But the problem is evaluation of this influence red.",
                    "label": 0
                },
                {
                    "sent": "Given NEC set, this problem itself is a hard and slow problem an even with several subsequent study that drastically improve the performance, the overall performance of influence maximization is still quite slow given like for example 30,000 graphs.",
                    "label": 0
                },
                {
                    "sent": "It takes hours to find about 50 seats in the network.",
                    "label": 0
                },
                {
                    "sent": "So that's the thing we want to improve.",
                    "label": 0
                },
                {
                    "sent": "'cause we're be working on much larger graphs and will do a lot of such kind of influence maximization to select top seeds so.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In our work.",
                    "label": 0
                },
                {
                    "sent": "We focus on improving the efficiency while keep the effectiveness of the seat selection.",
                    "label": 0
                },
                {
                    "sent": "So we designed a heuristic we called maximum influence operations heuristic an it works for independent general independent Cascade model it has.",
                    "label": 1
                },
                {
                    "sent": "About at least three orders of magnitude speedup, which means we can reduce the computation from hours to seconds or from days to minutes an.",
                    "label": 1
                },
                {
                    "sent": "On the other hand, the influence spread it generate is still close to what is generated by the greedy algorithm, so it doesn't reduce much inequality.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "We also show a hardness result.",
                    "label": 1
                },
                {
                    "sent": "Basically, the computing exactly influence spread given a seat set is a Sharpie hard problem.",
                    "label": 0
                },
                {
                    "sent": "Sharpie heart is basically accounting harness.",
                    "label": 1
                },
                {
                    "sent": "Result is even harder than NP complete problem.",
                    "label": 0
                },
                {
                    "sent": "So so basically this resolve an open question posted in the original paper and it's also another indication showing that computing influence spread in such network is indeed a hard problem.",
                    "label": 0
                },
                {
                    "sent": "It has some intrinsic difficulty.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the second part I'll focus on the the maximum influence operations heuristic.",
                    "label": 1
                },
                {
                    "sent": "First, given this graph out, define a maximum influence path.",
                    "label": 1
                },
                {
                    "sent": "Basically given any node U and any node V, I'll find the one pass from U2V that has the largest weight.",
                    "label": 0
                },
                {
                    "sent": "The weight of the path is basically the product of all the ways on the edges, so this particular path has a weight 0.1 two and its largest among all the paths.",
                    "label": 0
                },
                {
                    "sent": "And I ignore those Maps with very small probability and this is controlled by a parameter Param.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Theater.",
                    "label": 0
                },
                {
                    "sent": "So this is to find the path the 2nd.",
                    "label": 0
                },
                {
                    "sent": "I will find the what we call operators so and it will form the local influence regions.",
                    "label": 1
                },
                {
                    "sent": "So here, given a node VI, just collect all the maximum influence paths going into V and this former tree operations is basically a graph theoretical terms in it's a tree where all the edges pointing into the root of the tree is called in our presence.",
                    "label": 0
                },
                {
                    "sent": "If it's pointing away from the.",
                    "label": 1
                },
                {
                    "sent": "Root is called out operations, so here the Gray edges forms in operations and its phones by maximum influence pass going into.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Symmetrically, for any node you I can find those red edges is form a maximum influence out operations.",
                    "label": 1
                },
                {
                    "sent": "The importance of finding these local structures is first they give an efficient computation.",
                    "label": 0
                },
                {
                    "sent": "Be efficient, computed using the diestrus shortest path algorithm and Secondly.",
                    "label": 1
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, we compute influence spread within a tree.",
                    "label": 0
                },
                {
                    "sent": "That's a quite easy task, is just.",
                    "label": 0
                },
                {
                    "sent": "You can do it by a simple.",
                    "label": 0
                },
                {
                    "sent": "Recursion and recursion online six.",
                    "label": 0
                },
                {
                    "sent": "It's almost self explained, so I will not spend time here.",
                    "label": 0
                },
                {
                    "sent": "So basically computation in trees is easy and we also limited the local computation.",
                    "label": 0
                },
                {
                    "sent": "That's the way we want to speed up the algorithm, but just do this by itself if we just do this with a greedy algorithm is already OK. Have a very good speed up, but it's still not efficient enough an.",
                    "label": 1
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then we explore the second property in this kind of computation.",
                    "label": 0
                },
                {
                    "sent": "This property is if we say a PV is the activation property in the of the root V in the tree.",
                    "label": 1
                },
                {
                    "sent": "An APU is the activation property of another node in the tree.",
                    "label": 1
                },
                {
                    "sent": "Then they have this linear relationship and this Alpha is the linear coefficient and the key is all the offers in one tree can be recursively computed, and this recursive computation just take linear time to the size of the tree.",
                    "label": 0
                },
                {
                    "sent": "And just by doing this we can reduce the computation from a quadratic time computation to linear time.",
                    "label": 0
                },
                {
                    "sent": "And then given this, a linear coefficient, the marginal influence increase from U to V can be easily computed by this formula because our view is the linear coefficient, one is 1 user selected seed, its activation probability becomes one and is old, one is APU.",
                    "label": 1
                },
                {
                    "sent": "So this is the daughter of the changes of Activision.",
                    "label": 0
                },
                {
                    "sent": "Probability of you.",
                    "label": 0
                },
                {
                    "sent": "So this gives the marginal influence from U to V. And we just sum them up from you to all the roots and then we can compute the margin influence probability of you.",
                    "label": 1
                },
                {
                    "sent": "And then we just select the you with the largest marginal influence.",
                    "label": 0
                },
                {
                    "sent": "So this gives us a way to select the seeds an after we select seeds.",
                    "label": 0
                },
                {
                    "sent": "We just updated this linear coefficients and this update just take a linear time to the size of the.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So overall, this computation is the iteration among two steps.",
                    "label": 1
                },
                {
                    "sent": "First we select.",
                    "label": 0
                },
                {
                    "sent": "Among all the notes that no deal with the largest marginal influence, and then we update the local structures, basically updating those linear coefficients after we select the nodes and the key feature is the update is local because our trees are local controlled by the parameter Theta and is update is linear and also with the tunable parameter Theta.",
                    "label": 1
                },
                {
                    "sent": "We are able to do the trade off between running time and influence spread.",
                    "label": 1
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now I will show the our experimental results.",
                    "label": 0
                },
                {
                    "sent": "About this algorithm, we run experiments on a number of real world networks and what I show here is 2 particular networks.",
                    "label": 0
                },
                {
                    "sent": "One is from physics.",
                    "label": 0
                },
                {
                    "sent": "Archive is a collaboration, network is a moderate size like 15 K nodes.",
                    "label": 0
                },
                {
                    "sent": "The other is opinion network we got thanks, less coverage from his website.",
                    "label": 0
                },
                {
                    "sent": "This data set and we have a couple of larger datasets an.",
                    "label": 0
                },
                {
                    "sent": "The influence.",
                    "label": 0
                },
                {
                    "sent": "The probability on the edges.",
                    "label": 0
                },
                {
                    "sent": "We use this latest case weighted Cascade model.",
                    "label": 0
                },
                {
                    "sent": "Basically the influence to a node V is one over the number of in neighbors of V. And then we run different algorithms will compare with greedy algorithm and another algorithm which is a heuristic algorithm based on shortest path and degree discount is another heuristic we did last year for a uniform cascade model and also page rank random.",
                    "label": 1
                },
                {
                    "sent": "And actually we have more algorithm.",
                    "label": 0
                },
                {
                    "sent": "We comparing the paper and the result here shows the Y axis is the influence red X axis is the seat size basically first.",
                    "label": 0
                },
                {
                    "sent": "Our algorithm Mia algorithm Temia is another improvement of near that I didn't talk about it here, so the Premier algorithm matches the greedy algorithm in influence graph.",
                    "label": 0
                },
                {
                    "sent": "So in in both cases but comparing with other heuristic algorithm, especially in this case, it has a very good.",
                    "label": 0
                },
                {
                    "sent": "Performance in influence spread while page rank and other degrees kind of quite poor here.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "More importantly, if we look at the running time results, here we compare running time of different algorithm on different datasets, for example here.",
                    "label": 1
                },
                {
                    "sent": "The blueberry is a greedy algorithm.",
                    "label": 0
                },
                {
                    "sent": "The Green Bar is our algorithm, and we achieve more than three orders of magnitude speedup.",
                    "label": 0
                },
                {
                    "sent": "This is 1.3 hour, and here is only half seconds.",
                    "label": 0
                },
                {
                    "sent": "And to a larger data set about on this greedy algorithm, even though we cannot run in a reasonable amount of time and the red bar is another heuristic which takes 30 hours, and in our case only take about 10 seconds.",
                    "label": 0
                },
                {
                    "sent": "So basically the two results here.",
                    "label": 0
                },
                {
                    "sent": "We want to convey the idea is our algorithm is very fast while we are our influence, spread is still keep at the among the best influence spread that algorithms can find.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is another scalability test on synthetic graphs.",
                    "label": 0
                },
                {
                    "sent": "An clearly shows the greedy algorithm and another heuristic is does not scale while our algorithm has very good scalability.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Finally, I'll mention the related work.",
                    "label": 0
                },
                {
                    "sent": "There's one category of work on improving the greedy approximation algorithm by earlier like lazy full optimization by less coverage etc.",
                    "label": 0
                },
                {
                    "sent": "An an edge sampling.",
                    "label": 0
                },
                {
                    "sent": "Computation of reachable sets by Kimura and also by our earlier work.",
                    "label": 0
                },
                {
                    "sent": "But this work, even though they have good improvement, is still not scalable.",
                    "label": 0
                },
                {
                    "sent": "Another line of work is to try different heuristic algorithm.",
                    "label": 0
                },
                {
                    "sent": "But the first heuristic algorithm one is based on shortest path, the other based on sharply value both them not scalable and the degree discount we proposed last year is very scalable, but it only works for uniform.",
                    "label": 1
                },
                {
                    "sent": "Independent cascade model where edge probabilities are the same and we show in the earlier graph that it doesn't work well in other cases, Ann.",
                    "label": 0
                },
                {
                    "sent": "This is actually another algorithm that is going to be presented in the next talk, so we look at them and there have very nice ideas are using Community partition an we believe that our work are complementary to their work.",
                    "label": 0
                },
                {
                    "sent": "An another common is our media.",
                    "label": 1
                },
                {
                    "sent": "Local media algorithm has this we believe has this natural adaptation to the Community structure because if you have close community will influence our almost within the Community, then we will compute the tree structure within the Community.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Finally, for future directions, from the theoretical point of view, it will be interesting to look at efficient approximation algorithm to compute influence spread, because this seems to be the bottleneck of the of this problem.",
                    "label": 1
                },
                {
                    "sent": "From practical side it will be much interesting to do influence analysis using social media data to see what are the actual influence probabilities between people.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For that and my talking, thank you.",
                    "label": 0
                }
            ]
        }
    }
}