{
    "id": "7lkxqsnfcmxq57jamxvfgzoawcfgbah5",
    "title": "Learning and Regularization Using non Positive Kernels",
    "info": {
        "author": [
            "Stephan Canu, National Institute of Applied Sciences"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "September 2004",
        "category": [
            "Top->Computer Science->Machine Learning->Kernel Methods"
        ]
    },
    "url": "http://videolectures.net/mlss04_canu_lrunp/",
    "segmentation": [
        [
            "Of learning.",
            "So I want this is most of this work has been done while I was visiting Alex Maloney's group in camera and all new stuff present area joint work.",
            "At least we've changed song on.",
            "Which is finishing his thesis in camera.",
            "So I wanted to associate it in.",
            "I belongs to the insider one I'm working in PC lab.",
            "Well, more information on the web page in Chang Web page.",
            "You can look at it through Google.",
            "So now we can start before to start."
        ],
        [
            "We need some exercise.",
            "To what we have done, we have not done much exercise up to now.",
            "So this is a little exercise.",
            "Just to learn a new stuff since it's a how to derivate functionals.",
            "So define here.",
            "Our Lambda Alpha Fr is a functional that is a function that takes a function and map ship to R. So that's special.",
            "We know how to direct to compute derivative of functions, but here we want to compute derivative respect to functions of a functional.",
            "So the question is how to compute?",
            "The derivative of the subject.",
            "So before to compute the derivative of the object, we have to define what's a derivative for a functional.",
            "So I define it here.",
            "We introduce a real parameter because we know how to derive with respect to this real parameter.",
            "It's a little A and we write what the value of the functional at function F + A time another function G&G is another function, whatever in H it's called a direction.",
            "We have to compute the so called directional derivative indirection G. And now this of course depends on F&G.",
            "But also since it depends on a, we are able to compute its classical derivative in R with respect to a.",
            "And then we take its value at a = 0.",
            "And if we are lucky enough, we are going to represent this quantity.",
            "As a dot product.",
            "Actually, in general sense, this is a linear operator, but if we are lucky enough, we are going to represent that as a dot product and we are going to make the following reasoning if I want to minimize that, then the derivative has to be 0 for energy.",
            "So if this quantity is 0 for energy, that means that these quantities to be equal to 0.",
            "Simple reasoning, classical reasoning one dimension.",
            "The only difficulty here is we are addressing this reasoning in a functional framework.",
            "And afterwards to solve this equation, air prime of F = 0.",
            "Well, it's a functional equation.",
            "It's called the earlier equation.",
            "We spend some time, but it's not that difficult.",
            "So I'll give you 2 seconds to solve the problem and I give you the solution."
        ],
        [
            "So if someone stole it.",
            "So sorry so.",
            "We can see how it works and to try to point out what are the difficulties in computing this derivative.",
            "So for the solution I just taken the definition because I've given the definition and so I have replaced here R. Lambda FF is AG by its definition.",
            "As you can see here, it's exactly the definition using this equation.",
            "And you retrieve the sum of ever express a G of X.",
            "This term is a linear value of this function.",
            "Plus the norm of this quantity F + a G. And then I have to take the derivative with respect to a.",
            "And take the value at equal to 0.",
            "So fair enough, so this term will be F of XI minus I have the square here, so the square becomes two times this value.",
            "Time G of XI.",
            "Of course, if I compute the derivative of a term in a square, that becomes 8 times something.",
            "But because I'm taking its value at equals zero, this time will vanish.",
            "And the only remaining term is this one F of X -- Y time G at the value of G at the point XI.",
            "So the other term I'm using a classical trick saying that the norm of a vector, the square norm is the dot product by himself, and it's more or less morally.",
            "Like a square value or something when you derivate F square, you have 2 * F. Roughly, but it works like that.",
            "And we have.",
            "You can compute it without difficulties because you just use the linear property of the dot product and you retrieve this term here.",
            "So this term is rather nice because we already have something G * F. Here we are happy with that, but here it's not very nice.",
            "I would say it's rather ugly because what we want we want to rewrite this the value of the function at a given point as the dot product of the function with something.",
            "So this thing has to be something that allow me to evaluate the function at Point XI.",
            "Hopefully we follow a tutorial by by Burnout, and we know that if we are in replacing Kennedy birthplace, we have a kernel that does that.",
            "The kernel, when I apply the kernel to a function G, The kernel I'd point XII have the value of the function at Point XI.",
            "So if I want to compute the derivative of this function is very very important for me to know what the value of a function that given point.",
            "And to express it as something like a dot product here, it makes my life much more easier.",
            "So this is a very important difficulty.",
            "And once.",
            "And so most important thing here, once I know how to factorize this, the value of the function at a given point, I just use linearity and then I have my derivative which is this quantity.",
            "The weighted sum of the kernel.",
            "So we retrieved the usual weighted sum of the kernel.",
            "Plus something depending on F. So by just inverting I will retrieve that F is the linear combination of the kernel.",
            "Will see that later.",
            "But the most important point here is the value.",
            "Of a functional given point if we want to compute derivative, we know we have to know how to represent function at point given XI.",
            "So."
        ],
        [
            "I need another appetizer to discuss this point.",
            "So what's the value of a function at a given point?",
            "So when I first begin, I was very surprised by that, because I thought that any function can be evaluated at any point.",
            "But afterwards I discovered this is not the case.",
            "So first of all, it's important here in the following to make the difference between function and some time you already seen I right.",
            "Cause of point that means the function cosine as a function belonging to some function space.",
            "I will call very often H the function space because in learning we have some hypothesis, so it's a set of hypothesis H set of functions.",
            "And.",
            "And, well, sometimes I write, will write it also cause X as a function.",
            "We have to make difference between the function and here cause at Point XI.",
            "That is to say the value of the point at the value of the function like a given point.",
            "This is a real value.",
            "The result of the function and this is the function itself and it's a member of H. So as I said, some function, they have no value in some given point, so I take a simple example.",
            "You take sine function and you just omit to define it in zero.",
            "So what the sign of 0 according to my definition?",
            "You just don't know.",
            "So this function is not defined in zero.",
            "So now you know that if you take some classical functional space like L2 functions, functions in L2 are not defined pointwise.",
            "You don't know the value of the function that given points.",
            "They are not defined.",
            "So maybe we are not happy with that since we want to do learning, we want to know the value of function at given points that we wanted.",
            "So to understand how it works, I will need a specific functional.",
            "So I represent things through maybe a simple things using a complex tool.",
            "These functional Maps function towards real.",
            "And for a given function, the operator T at Point XI give me the value of the function at a given point.",
            "So I will use that a lot.",
            "I will use opera T as a thing that asked give me a function and thanks to TI know the value of the function that a given point.",
            "And all learning is about that.",
            "Given the value of the function at the given point, are you able to retrieve this function to in some sense in some formal sense is to invert this operator.",
            "Which is a painful thing.",
            "Looks nice, but it's not so easy.",
            "So to be more specific, I'd like to give representation of this functional and among all possible representation, pointed out three possible representation.",
            "So maybe one of the first I learn I don't know you, but in France we learn this way when we want to discuss the value of a function at given point, we use the distribution theory and we apply the Delta or direct distribution and we are in distribution framework.",
            "It's got, it's a duality.",
            "It's quite heavy framework.",
            "Maybe you will try to avoid not that much a little bit.",
            "Just this Delta function applied to F give you the value of the function at a given point.",
            "Another way, surprisingly, it's to use it for your transform.",
            "So assume F is a function whose free transform exist.",
            "For instance, I can compute before you transform of sign, and then I compute the inverse Fourier transform of F. And thanks to that I can have the value of the function at a given point.",
            "For instance, if I take this function, I compute this for your transform, and I compute.",
            "Therefore, you transform back.",
            "I can then ask what you value at zero and the four year transform back will answer me the value at zero is 0 because it will take the mean at each side and performing so through this mean I can take a function undefined in certain number of points.",
            "And I have not a function or companion or joint function.",
            "Which value can can be evaluated in any point of the domain?",
            "But of course I will focus on this way of representing the value at a given point through kernels.",
            "They are very handy for many reason.",
            "When I have a replacing kernel, I can ask the value of the function through kernel and this is a very nice object to do learning and to represent the value of the function at a given point.",
            "So this property for me is very important.",
            "The most important property for kernel, its ability to represent the value of a function at the given point.",
            "It's a reason why, for instance, there is no need.",
            "In absolute to have, for instance, in the inner product and to have elberson structure.",
            "I don't need really at this point, and it's not an obligation to add that what we need is something to know what's the value of the function at a given point.",
            "And this can be expressed endeavour in overall functional setting than in version we can have it in non positive space or in duality.",
            "If you focus on this property and you ask yourself what kind of structure shall have most, I have on H to have this property or you have many of them, you are not obliged to do inversion.",
            "Of course, if you have inversion you have very nice properties.",
            "Maybe very happy with that, but it's not.",
            "An obligation what you need to know.",
            "The value of the function at a given point.",
            "Sorry.",
            "Yes, I'm not very confortable with Delta function.",
            "I think distribution has been invented to make it right.",
            "But I'm not sure."
        ],
        [
            "So just as a conclusion, I will use this set.",
            "Sometimes you will see that.",
            "So this is a set of functions and I will ask my hypothesis to belong to the set this set.",
            "Big set of function.",
            "So what is it?",
            "It's a set of what I call pointwise defined function is a set of function.",
            "In which I am able to compute the value of the function at a given point.",
            "So I call it R2D Omega.",
            "Assume Omega is a domain of my learning, so it's where X belong belong to me.",
            "I can be R compact, set, whatever we don't know are to the M. And I want to map Omega 2R so my target value will be are going to be R and I define R to the mega set of all possible function from Omega Tour.",
            "So the only property that the function have in Art Omega is that they are pointwise defined.",
            "I know the value of the function that given point.",
            "So if you have this convolution and so on, you need to be in this framework that mean you are no longer in two.",
            "So you.",
            "You are happy with some side and not very happy with other so you have to be careful and really have a look on what you're doing."
        ],
        [
            "So.",
            "Now we know what's the important things to know.",
            "The value of the function at a given point, we can discuss that through the remaining 3 1/2 hour.",
            "So I try to begin before lunch with a simple example with splines.",
            "To explain.",
            "Try to put a simple example to see what are the difficulties and what are the hypothesis and how we're solving the problem.",
            "And I will do spline for interpolation and then I will discuss also the interpolation problem because it looks simpler.",
            "Maybe it's clearer?",
            "Also and then I will go for define what's a well posed problem Anil Post problem actually, or El Pozon well posed?",
            "Given that imposes not a well posed or well poses not to impose problem kind of complementarity between problems, and then I will present the regularization framework.",
            "Some sense how to turn a new post problem into a well posed problem well to solve ill posed problem for regulation.",
            "So among all regulation technique, I will put some emphasis in Tikhonov regularization and I will also present other realization method and I'll try to show you how.",
            "Regulation is performing.",
            "Through the analysis, using the code filter functions.",
            "So among other regulation method that will put some emphasis in iterative algorithm.",
            "Conjugate gradient type method.",
            "So I tried to explain you why and how they are regulars.",
            "I they are doing regularization and while they are good because they are very fast and very generic, they can use for different framework.",
            "And then we finished last lecture by your proof of convergence.",
            "Actually it's not really convergent, it's what's called semi convergence.",
            "Because we've seen the general case.",
            "What's going to happen?",
            "We are going to have the solution.",
            "And then away from it.",
            "You have to find where to stop, and it's well known in community in neural network community.",
            "For instances it has been known as early stopping so we have to do early stopping.",
            "So what I will provide you is why are we doing early stopping and.",
            "How it works?",
            "How can we design A bound to explain this phenomenon and why we have to do that?",
            "But before to do that we have to go through simple example the spline."
        ],
        [
            "So I take the interpolation spline problem.",
            "So assume we have we on the real line and the output is also a real value.",
            "We have a sample.",
            "M dimensional I try to use consistent notation.",
            "I don't know if I've managed to do that.",
            "And the problem is to find a function F such that F of XI is equal to Y. Interpolation problem.",
            "So to solve it, I propose no, I don't propose the following and respirable.",
            "For instance, we propose to minimize.",
            "This cost we have seen previously, the only thing we're going to do we're going to ask, Lambda.",
            "To go to 0.",
            "So our solution is going to be interpolate, so the idea of this cost function is to add 2 terms, one to feed the data.",
            "This measure the error.",
            "So at the end you want F of X equal Yi.",
            "We want really to minimize this one.",
            "And the other one.",
            "Assess the regularity of the model so you want a solution that fits the data, of course.",
            "Search that F of X is equal to Y, but if you want to be generic in learning, you want to be able to learn anything.",
            "So you need a very big hypothesis space with a lot of functions because you don't know what your target is going to be.",
            "So of course, if you are looking for functions in general such that F of X = y, you may have a lot of them.",
            "Too much, so we have to choose among all of them.",
            "Which are the good one.",
            "So here there's a mean of choosing you're choosing the most regular one, the one with the smallest derivative.",
            "And.",
            "Of course, if you putting too much regularly fit exactly the data.",
            "So if this parameter is a kind of.",
            "Balancing the two things, fitting the data and the regularity.",
            "So if you want to do interpolation, what you have to do is to.",
            "Take this parameter or take the solution with this parameter and make it go to 0.",
            "OK, so when we define our goal, it's looks reasonable, so we can define based on that or hypothesis set.",
            "We're going to look at the solution as a function from R to R. It has to be in R to the Omega pointwise defined function such that its derivative.",
            "As to be square integrable, that is to say, functionally speaking the derivative as to belong to L201.",
            "OK, fair enough.",
            "So now thanks to the appetizer, we know if we want to minimize that, we have to compute the derivative.",
            "We know that art is exactly the derivative well expect except for the DOT product I just represent through integral, I can be more specific here in this case.",
            "And here since I have not discussed yet, what's H is really, I will represent the value of a given function by this kind of Verity.",
            "The Delta distribution applied to G. And for this term to solve it, what I have to do?",
            "I have to integrate by parts.",
            "So you see, if I integrate by parts, I will have the second derivative of F&G will be integrated fully, it's here.",
            "But also I have the constant term.",
            "The value of the function in zero and in one.",
            "Yep, sure.",
            "Also because.",
            "It's my example, I think it right now it's just.",
            "Yes there are.",
            "Yeah OK, so maybe you're right here.",
            "Instead of taking RI should have taken 01 in my example.",
            "Would be clear you're right.",
            "This is very important.",
            "Afterwards, each choice.",
            "So I've taken my example.",
            "I can normalize them so that they fit in 01 and afterwards I'm doing interpolation.",
            "Oh how do we know the second derivative exists?",
            "We don't actually see the problem.",
            "You've read my next slide.",
            "No, you're right, we never see that.",
            "I just integrate by part assuming it exists, but.",
            "In fact it.",
            "We'll see this is the problem?",
            "OK, but anyway.",
            "Assume we continue like that.",
            "We have a kind of equation.",
            "To solve the equation so just this term.",
            "Here we retrieve this term with Delta, the two value at zero and one, and then the second derivative.",
            "So this has to be equal to 0.",
            "So assuming this exist to solve that I have to integrate 2 times and if I integrate two times, I have to fix two constants.",
            "So I need more constraint to solve."
        ],
        [
            "Problem.",
            "So I just recall the function we want to minimize the functional space we are given.",
            "Then if I want to cancel the derivative, I want this to be equal to zero since I have second derivative, I need two more constraints and I choose to put these constraints.",
            "So I decide because I can do that.",
            "Why not?",
            "Because it's easy for me also to put the derivative at 0.",
            "The same as the solution, the same as the derivative of the solution at one, and there will be zero.",
            "That is to say, I asked for the solution to be constant on each side, which is not too bad actually, but the nice thing is because of that, these two terms will cancel be painful, so I'm quite happy with that nice constraint.",
            "OK, and so based on that, what is a solution?",
            "F second, the second derivative of X is just equal to a linear combination of the Delta distribution weighted by some Alpha and these Alpha.",
            "They're just this coefficient.",
            "I wrote it down here.",
            "Oh yes, time the Lambda here.",
            "Time that.",
            "No, afterwards I can integrate once.",
            "So the integration is linear, so I define Y as the Heaviside distribution.",
            "So it's zero and then one.",
            "Depending on the value plus some a.",
            "But since I want F prime to be equal to zero, that means F prime of 0 is to be equal to 0.",
            "This term cancer, so a as 2 equal to 0.",
            "So this is a very nice condition.",
            "Choose it well, OK, and then I integrate the second time.",
            "And then what do I have?",
            "I have the sum of the integration of the heavyside function, so it's a function which is 0 up to one point and then align.",
            "Because today relative to have the heavy side and then to have the Delta distribution.",
            "Somehow to do like that and if I see I want F prime of 1 equal to zero, I just apply it here a cancel this term are equal to 1.",
            "So I have the sum of Alpha equal to 0.",
            "So look, I have Alpha equal that with our M equation.",
            "One more equation and I have M coefficient plus one, so I have M + 1 and nonviable and M + 1 equation so I can solve the problem naturally if I solve it.",
            "I have good solution, it works quite well, but there is some problem as you pointed out, there is no reason for F second.",
            "To exist.",
            "And also.",
            "Maybe the solution here.",
            "It's a function which is not very viable because it's function like that.",
            "So at this point the derivative doesn't exist.",
            "So it's a bit weird to say, OK, I'm looking for a function so that the derivative is in L2, and this function is not terrible, so something is wrong in this framework.",
            "So let's try to solve it.",
            "That's the wrong thing."
        ],
        [
            "Well, the wrong thing is to use the derivative.",
            "In fact, we like the derivative because we think, OK, I want a regular function function whose derivative is small because the derivative measure the fluctuation of the function.",
            "But maybe we can see the thing the other way around.",
            "Instead of starting from.",
            "OK.",
            "So instead of saying that I want the derivative to be L2, I can start from L2 functions.",
            "Because I know them and then integrate this function.",
            "By integrating this function I am saying OK, I want the solution to be more regular because in L2 I don't know other things are and I take the integration.",
            "So things I am asking for F to be regular of course.",
            "Then when I come back I can ask for the derivative to exist, and so by this mean, what do I do?",
            "I'm just defining the derivative in the more general sense as the inverse of the integration operator and the operation the integration operator, it's nice.",
            "When you discuss so the classical way of defining this regularity is to define an operator P from some hypothesis space towards L2.",
            "Associating with a function, it's regularity, which is it derivative?",
            "But this is not very convenient because we have seen we have a lot of problems on that.",
            "So the in my opinion it's better to see the thing the other way around and to define an operator which is point Y D5 from L2 towards R. So for a given function I just associated the value of the function at a given point.",
            "I define it S of X.",
            "Is this integral, which is exactly the value of the function that given X and then I take a new operator for a family of X in Omega.",
            "And then.",
            "As it's just the generalization of.",
            "As for all X in Omega here, Omega 01 and then I define my operator South from L2R201 which is the right space where I want the solution to be.",
            "And then I take my solution to be a regular function in the sense of South.",
            "That is to say, a function that is the result of this convolution integration process.",
            "OK so I'm quite happy with that.",
            "I know that the value of a function is just this integral here.",
            "And then what I do I do?",
            "I just say OK what's H HD image of my linear operator?",
            "I know it's a vector space, I just have some time to work a little bit on the kernel of this sense of new space of this operator in order for him to be really a one to one to other direction.",
            "So when I have objection now, I can define H An I can define and talk about the inverse of South.",
            "An eye can see these derivative adjust the inverse of the operator S. So what we see here is maybe we have some idea of regularity.",
            "I want the derivative to be that and so on so forth, but I think it's quite dangerous to see the thing like that.",
            "We're not quite OK in my opinion.",
            "The best way to do the things to do that the other way around and to start from some nice space we like like L2 or something and then to build the target space, the apparatus space by explicitly stating what's the regularity we want on the solution."
        ],
        [
            "At all.",
            "Of course we are not, of course, but thanks to this framework we have one more property which is rather important.",
            "So I just record this is the bad definition.",
            "So this is a good definition.",
            "We have the operator South that give us a function value and we have also very important since South is a linear operator from Hilbert space, two up vector space, we can do this vector space with a dot product by a very simple thing if we give Me 2 function here, I did find the dot product of these two functions.",
            "As the dot product in L2.",
            "Of this function which has a derivatives in fact, but their their relative in the general sense.",
            "Since I know how to apply it because I've built H to be able to construct and to define S -- 1.",
            "So now I know that H is a dot product space and I know what the DOT product.",
            "If the integral of F prime G prime but the derivative taken in the general sense at the inverse, the real inverse of the integration process.",
            "Here.",
            "So based on that I have one more important property which is the replacing property.",
            "Namely, if I take the value of a function in H at a given point.",
            "So by definition, is F of X, but as of X it just this integral and this integral from zero to X can be seen as integral from zero to one of this Heaviside function.",
            "I just put zero the users term applied to G. And then what's this?",
            "Interroll it's a dot product in L2 of these two function and based on my definition I can represent this dot product in L2 through DOT product in H. The image of G and the made up of the heavyside distribution, and now what the image of G is function F in H. So what the image of H?",
            "As of why the image of the side distribution is going to be the kernel?",
            "And because of this property, I am in replacing canal able space by construction.",
            "So this operator S is very useful because from L2 I can build.",
            "The space which is nice, it's belongs to up to the mega.",
            "It's .25.",
            "It has a dot product and needs replacing connected but space.",
            "So thanks to that I have the good property I know.",
            "And I can of course compute the kernel here.",
            "It's the image of that, so it's this integral and I retrieve my function.",
            "Function which is zero somewhere and then.",
            "Linear model or little explain here.",
            "If I didn't make any mistake in the computation."
        ],
        [
            "So let's summarize what you've done up to now.",
            "So the way of defining splines.",
            "To define the regularity sometimes has been to minimize a function like that, taking into account the derivative and to define H as a function such that these are relative is L2 for the problem is we have a lot of technical problems when we want to derive the solution with the second derivative, and we have a function which is not terrible, so.",
            "Not the reliable in English or.",
            "I differentiable I think is the proper word in English.",
            "I'm sorry I'm using French.",
            "So if you say French deliver differential differentiable good.",
            "So here I propose an altean at an alternative way to design the functional space in which we are building.",
            "So the way I show you through operator S of course can be generalized to any kind of operator.",
            "So to do so we need to take a function.",
            "I call it gamma.",
            "It has to belong to L2 and not a single function, but it's a family of function indexes by XX belonging to.",
            "The the Omega, the domain of my learn.",
            "So in our example or gamma function with this function.",
            "The heavyside function.",
            "Uh.",
            "So we can see for a given X it's L2 integrable in.",
            "In 01.",
            "OK, so then, thanks to gamma we can define SS, take a function G in L2 and its image is a dot product of gamma X with G. So depending on gamma, it cannot be projective, so we have to divide by the new space.",
            "So we make it projective and then we define H at the image of this operator and H belongs to after the mega it's a representation of the space and we know that the kernel going to be this.",
            "The DOT product of these two functions.",
            "And now, instead of minimizing that, we can redefine things saying we want to minimize in H defined as the image of this operator.",
            "This functional, which is of course this term fitting the data plus another term, which is that the norm of the function in H. We are saying OK, we want this is the way we are measuring or defining the regularity of the function H. So maybe we lost the relationship direct relationship with the derivative of the way of expressing regularity, but we still have it, and the way we express regularity is hidden in H and in the way we are defining and retrieving the kernel and the way we have designed this mapping.",
            "So we have seen also that the general solution of this problem minimization problem will put is can be returned as linear combination of the kernel.",
            "It's a represented theorem, so plus one term.",
            "Which is the parametric.",
            "I call it sometime or."
        ],
        [
            "Alex smaller parametric components.",
            "So in our example we have this P equal to 1.",
            "We have only one term which is little be, so we have the function Phi, one of X which is a constant function.",
            "So it's a very simple function in the remaining of my presentation.",
            "I will not talk about this one, it's not a major problem, it's just a technical difficulty too.",
            "To handle this thing."
        ],
        [
            "So.",
            "What's the timer?"
        ],
        [
            "So maybe we stop here and we have lunch with Carrie on tomorrow at 4:00 o'clock."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of learning.",
                    "label": 0
                },
                {
                    "sent": "So I want this is most of this work has been done while I was visiting Alex Maloney's group in camera and all new stuff present area joint work.",
                    "label": 0
                },
                {
                    "sent": "At least we've changed song on.",
                    "label": 0
                },
                {
                    "sent": "Which is finishing his thesis in camera.",
                    "label": 0
                },
                {
                    "sent": "So I wanted to associate it in.",
                    "label": 0
                },
                {
                    "sent": "I belongs to the insider one I'm working in PC lab.",
                    "label": 0
                },
                {
                    "sent": "Well, more information on the web page in Chang Web page.",
                    "label": 0
                },
                {
                    "sent": "You can look at it through Google.",
                    "label": 0
                },
                {
                    "sent": "So now we can start before to start.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We need some exercise.",
                    "label": 0
                },
                {
                    "sent": "To what we have done, we have not done much exercise up to now.",
                    "label": 0
                },
                {
                    "sent": "So this is a little exercise.",
                    "label": 0
                },
                {
                    "sent": "Just to learn a new stuff since it's a how to derivate functionals.",
                    "label": 0
                },
                {
                    "sent": "So define here.",
                    "label": 0
                },
                {
                    "sent": "Our Lambda Alpha Fr is a functional that is a function that takes a function and map ship to R. So that's special.",
                    "label": 0
                },
                {
                    "sent": "We know how to direct to compute derivative of functions, but here we want to compute derivative respect to functions of a functional.",
                    "label": 0
                },
                {
                    "sent": "So the question is how to compute?",
                    "label": 0
                },
                {
                    "sent": "The derivative of the subject.",
                    "label": 0
                },
                {
                    "sent": "So before to compute the derivative of the object, we have to define what's a derivative for a functional.",
                    "label": 0
                },
                {
                    "sent": "So I define it here.",
                    "label": 0
                },
                {
                    "sent": "We introduce a real parameter because we know how to derive with respect to this real parameter.",
                    "label": 0
                },
                {
                    "sent": "It's a little A and we write what the value of the functional at function F + A time another function G&G is another function, whatever in H it's called a direction.",
                    "label": 0
                },
                {
                    "sent": "We have to compute the so called directional derivative indirection G. And now this of course depends on F&G.",
                    "label": 0
                },
                {
                    "sent": "But also since it depends on a, we are able to compute its classical derivative in R with respect to a.",
                    "label": 0
                },
                {
                    "sent": "And then we take its value at a = 0.",
                    "label": 0
                },
                {
                    "sent": "And if we are lucky enough, we are going to represent this quantity.",
                    "label": 0
                },
                {
                    "sent": "As a dot product.",
                    "label": 0
                },
                {
                    "sent": "Actually, in general sense, this is a linear operator, but if we are lucky enough, we are going to represent that as a dot product and we are going to make the following reasoning if I want to minimize that, then the derivative has to be 0 for energy.",
                    "label": 0
                },
                {
                    "sent": "So if this quantity is 0 for energy, that means that these quantities to be equal to 0.",
                    "label": 0
                },
                {
                    "sent": "Simple reasoning, classical reasoning one dimension.",
                    "label": 0
                },
                {
                    "sent": "The only difficulty here is we are addressing this reasoning in a functional framework.",
                    "label": 0
                },
                {
                    "sent": "And afterwards to solve this equation, air prime of F = 0.",
                    "label": 0
                },
                {
                    "sent": "Well, it's a functional equation.",
                    "label": 0
                },
                {
                    "sent": "It's called the earlier equation.",
                    "label": 0
                },
                {
                    "sent": "We spend some time, but it's not that difficult.",
                    "label": 0
                },
                {
                    "sent": "So I'll give you 2 seconds to solve the problem and I give you the solution.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if someone stole it.",
                    "label": 0
                },
                {
                    "sent": "So sorry so.",
                    "label": 0
                },
                {
                    "sent": "We can see how it works and to try to point out what are the difficulties in computing this derivative.",
                    "label": 0
                },
                {
                    "sent": "So for the solution I just taken the definition because I've given the definition and so I have replaced here R. Lambda FF is AG by its definition.",
                    "label": 0
                },
                {
                    "sent": "As you can see here, it's exactly the definition using this equation.",
                    "label": 0
                },
                {
                    "sent": "And you retrieve the sum of ever express a G of X.",
                    "label": 0
                },
                {
                    "sent": "This term is a linear value of this function.",
                    "label": 0
                },
                {
                    "sent": "Plus the norm of this quantity F + a G. And then I have to take the derivative with respect to a.",
                    "label": 0
                },
                {
                    "sent": "And take the value at equal to 0.",
                    "label": 0
                },
                {
                    "sent": "So fair enough, so this term will be F of XI minus I have the square here, so the square becomes two times this value.",
                    "label": 0
                },
                {
                    "sent": "Time G of XI.",
                    "label": 0
                },
                {
                    "sent": "Of course, if I compute the derivative of a term in a square, that becomes 8 times something.",
                    "label": 0
                },
                {
                    "sent": "But because I'm taking its value at equals zero, this time will vanish.",
                    "label": 0
                },
                {
                    "sent": "And the only remaining term is this one F of X -- Y time G at the value of G at the point XI.",
                    "label": 0
                },
                {
                    "sent": "So the other term I'm using a classical trick saying that the norm of a vector, the square norm is the dot product by himself, and it's more or less morally.",
                    "label": 0
                },
                {
                    "sent": "Like a square value or something when you derivate F square, you have 2 * F. Roughly, but it works like that.",
                    "label": 0
                },
                {
                    "sent": "And we have.",
                    "label": 0
                },
                {
                    "sent": "You can compute it without difficulties because you just use the linear property of the dot product and you retrieve this term here.",
                    "label": 0
                },
                {
                    "sent": "So this term is rather nice because we already have something G * F. Here we are happy with that, but here it's not very nice.",
                    "label": 0
                },
                {
                    "sent": "I would say it's rather ugly because what we want we want to rewrite this the value of the function at a given point as the dot product of the function with something.",
                    "label": 0
                },
                {
                    "sent": "So this thing has to be something that allow me to evaluate the function at Point XI.",
                    "label": 0
                },
                {
                    "sent": "Hopefully we follow a tutorial by by Burnout, and we know that if we are in replacing Kennedy birthplace, we have a kernel that does that.",
                    "label": 0
                },
                {
                    "sent": "The kernel, when I apply the kernel to a function G, The kernel I'd point XII have the value of the function at Point XI.",
                    "label": 0
                },
                {
                    "sent": "So if I want to compute the derivative of this function is very very important for me to know what the value of a function that given point.",
                    "label": 0
                },
                {
                    "sent": "And to express it as something like a dot product here, it makes my life much more easier.",
                    "label": 0
                },
                {
                    "sent": "So this is a very important difficulty.",
                    "label": 0
                },
                {
                    "sent": "And once.",
                    "label": 0
                },
                {
                    "sent": "And so most important thing here, once I know how to factorize this, the value of the function at a given point, I just use linearity and then I have my derivative which is this quantity.",
                    "label": 0
                },
                {
                    "sent": "The weighted sum of the kernel.",
                    "label": 0
                },
                {
                    "sent": "So we retrieved the usual weighted sum of the kernel.",
                    "label": 0
                },
                {
                    "sent": "Plus something depending on F. So by just inverting I will retrieve that F is the linear combination of the kernel.",
                    "label": 0
                },
                {
                    "sent": "Will see that later.",
                    "label": 0
                },
                {
                    "sent": "But the most important point here is the value.",
                    "label": 0
                },
                {
                    "sent": "Of a functional given point if we want to compute derivative, we know we have to know how to represent function at point given XI.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I need another appetizer to discuss this point.",
                    "label": 0
                },
                {
                    "sent": "So what's the value of a function at a given point?",
                    "label": 0
                },
                {
                    "sent": "So when I first begin, I was very surprised by that, because I thought that any function can be evaluated at any point.",
                    "label": 0
                },
                {
                    "sent": "But afterwards I discovered this is not the case.",
                    "label": 0
                },
                {
                    "sent": "So first of all, it's important here in the following to make the difference between function and some time you already seen I right.",
                    "label": 0
                },
                {
                    "sent": "Cause of point that means the function cosine as a function belonging to some function space.",
                    "label": 0
                },
                {
                    "sent": "I will call very often H the function space because in learning we have some hypothesis, so it's a set of hypothesis H set of functions.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "And, well, sometimes I write, will write it also cause X as a function.",
                    "label": 0
                },
                {
                    "sent": "We have to make difference between the function and here cause at Point XI.",
                    "label": 0
                },
                {
                    "sent": "That is to say the value of the point at the value of the function like a given point.",
                    "label": 0
                },
                {
                    "sent": "This is a real value.",
                    "label": 0
                },
                {
                    "sent": "The result of the function and this is the function itself and it's a member of H. So as I said, some function, they have no value in some given point, so I take a simple example.",
                    "label": 0
                },
                {
                    "sent": "You take sine function and you just omit to define it in zero.",
                    "label": 0
                },
                {
                    "sent": "So what the sign of 0 according to my definition?",
                    "label": 0
                },
                {
                    "sent": "You just don't know.",
                    "label": 0
                },
                {
                    "sent": "So this function is not defined in zero.",
                    "label": 0
                },
                {
                    "sent": "So now you know that if you take some classical functional space like L2 functions, functions in L2 are not defined pointwise.",
                    "label": 0
                },
                {
                    "sent": "You don't know the value of the function that given points.",
                    "label": 0
                },
                {
                    "sent": "They are not defined.",
                    "label": 0
                },
                {
                    "sent": "So maybe we are not happy with that since we want to do learning, we want to know the value of function at given points that we wanted.",
                    "label": 0
                },
                {
                    "sent": "So to understand how it works, I will need a specific functional.",
                    "label": 0
                },
                {
                    "sent": "So I represent things through maybe a simple things using a complex tool.",
                    "label": 0
                },
                {
                    "sent": "These functional Maps function towards real.",
                    "label": 0
                },
                {
                    "sent": "And for a given function, the operator T at Point XI give me the value of the function at a given point.",
                    "label": 0
                },
                {
                    "sent": "So I will use that a lot.",
                    "label": 0
                },
                {
                    "sent": "I will use opera T as a thing that asked give me a function and thanks to TI know the value of the function that a given point.",
                    "label": 0
                },
                {
                    "sent": "And all learning is about that.",
                    "label": 0
                },
                {
                    "sent": "Given the value of the function at the given point, are you able to retrieve this function to in some sense in some formal sense is to invert this operator.",
                    "label": 0
                },
                {
                    "sent": "Which is a painful thing.",
                    "label": 0
                },
                {
                    "sent": "Looks nice, but it's not so easy.",
                    "label": 0
                },
                {
                    "sent": "So to be more specific, I'd like to give representation of this functional and among all possible representation, pointed out three possible representation.",
                    "label": 0
                },
                {
                    "sent": "So maybe one of the first I learn I don't know you, but in France we learn this way when we want to discuss the value of a function at given point, we use the distribution theory and we apply the Delta or direct distribution and we are in distribution framework.",
                    "label": 0
                },
                {
                    "sent": "It's got, it's a duality.",
                    "label": 0
                },
                {
                    "sent": "It's quite heavy framework.",
                    "label": 0
                },
                {
                    "sent": "Maybe you will try to avoid not that much a little bit.",
                    "label": 0
                },
                {
                    "sent": "Just this Delta function applied to F give you the value of the function at a given point.",
                    "label": 0
                },
                {
                    "sent": "Another way, surprisingly, it's to use it for your transform.",
                    "label": 0
                },
                {
                    "sent": "So assume F is a function whose free transform exist.",
                    "label": 0
                },
                {
                    "sent": "For instance, I can compute before you transform of sign, and then I compute the inverse Fourier transform of F. And thanks to that I can have the value of the function at a given point.",
                    "label": 0
                },
                {
                    "sent": "For instance, if I take this function, I compute this for your transform, and I compute.",
                    "label": 0
                },
                {
                    "sent": "Therefore, you transform back.",
                    "label": 0
                },
                {
                    "sent": "I can then ask what you value at zero and the four year transform back will answer me the value at zero is 0 because it will take the mean at each side and performing so through this mean I can take a function undefined in certain number of points.",
                    "label": 0
                },
                {
                    "sent": "And I have not a function or companion or joint function.",
                    "label": 0
                },
                {
                    "sent": "Which value can can be evaluated in any point of the domain?",
                    "label": 0
                },
                {
                    "sent": "But of course I will focus on this way of representing the value at a given point through kernels.",
                    "label": 0
                },
                {
                    "sent": "They are very handy for many reason.",
                    "label": 0
                },
                {
                    "sent": "When I have a replacing kernel, I can ask the value of the function through kernel and this is a very nice object to do learning and to represent the value of the function at a given point.",
                    "label": 0
                },
                {
                    "sent": "So this property for me is very important.",
                    "label": 0
                },
                {
                    "sent": "The most important property for kernel, its ability to represent the value of a function at the given point.",
                    "label": 0
                },
                {
                    "sent": "It's a reason why, for instance, there is no need.",
                    "label": 0
                },
                {
                    "sent": "In absolute to have, for instance, in the inner product and to have elberson structure.",
                    "label": 0
                },
                {
                    "sent": "I don't need really at this point, and it's not an obligation to add that what we need is something to know what's the value of the function at a given point.",
                    "label": 0
                },
                {
                    "sent": "And this can be expressed endeavour in overall functional setting than in version we can have it in non positive space or in duality.",
                    "label": 0
                },
                {
                    "sent": "If you focus on this property and you ask yourself what kind of structure shall have most, I have on H to have this property or you have many of them, you are not obliged to do inversion.",
                    "label": 0
                },
                {
                    "sent": "Of course, if you have inversion you have very nice properties.",
                    "label": 0
                },
                {
                    "sent": "Maybe very happy with that, but it's not.",
                    "label": 0
                },
                {
                    "sent": "An obligation what you need to know.",
                    "label": 0
                },
                {
                    "sent": "The value of the function at a given point.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "Yes, I'm not very confortable with Delta function.",
                    "label": 0
                },
                {
                    "sent": "I think distribution has been invented to make it right.",
                    "label": 0
                },
                {
                    "sent": "But I'm not sure.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So just as a conclusion, I will use this set.",
                    "label": 0
                },
                {
                    "sent": "Sometimes you will see that.",
                    "label": 0
                },
                {
                    "sent": "So this is a set of functions and I will ask my hypothesis to belong to the set this set.",
                    "label": 0
                },
                {
                    "sent": "Big set of function.",
                    "label": 0
                },
                {
                    "sent": "So what is it?",
                    "label": 0
                },
                {
                    "sent": "It's a set of what I call pointwise defined function is a set of function.",
                    "label": 0
                },
                {
                    "sent": "In which I am able to compute the value of the function at a given point.",
                    "label": 0
                },
                {
                    "sent": "So I call it R2D Omega.",
                    "label": 0
                },
                {
                    "sent": "Assume Omega is a domain of my learning, so it's where X belong belong to me.",
                    "label": 0
                },
                {
                    "sent": "I can be R compact, set, whatever we don't know are to the M. And I want to map Omega 2R so my target value will be are going to be R and I define R to the mega set of all possible function from Omega Tour.",
                    "label": 0
                },
                {
                    "sent": "So the only property that the function have in Art Omega is that they are pointwise defined.",
                    "label": 0
                },
                {
                    "sent": "I know the value of the function that given point.",
                    "label": 0
                },
                {
                    "sent": "So if you have this convolution and so on, you need to be in this framework that mean you are no longer in two.",
                    "label": 0
                },
                {
                    "sent": "So you.",
                    "label": 0
                },
                {
                    "sent": "You are happy with some side and not very happy with other so you have to be careful and really have a look on what you're doing.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Now we know what's the important things to know.",
                    "label": 0
                },
                {
                    "sent": "The value of the function at a given point, we can discuss that through the remaining 3 1/2 hour.",
                    "label": 0
                },
                {
                    "sent": "So I try to begin before lunch with a simple example with splines.",
                    "label": 0
                },
                {
                    "sent": "To explain.",
                    "label": 0
                },
                {
                    "sent": "Try to put a simple example to see what are the difficulties and what are the hypothesis and how we're solving the problem.",
                    "label": 0
                },
                {
                    "sent": "And I will do spline for interpolation and then I will discuss also the interpolation problem because it looks simpler.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's clearer?",
                    "label": 0
                },
                {
                    "sent": "Also and then I will go for define what's a well posed problem Anil Post problem actually, or El Pozon well posed?",
                    "label": 0
                },
                {
                    "sent": "Given that imposes not a well posed or well poses not to impose problem kind of complementarity between problems, and then I will present the regularization framework.",
                    "label": 0
                },
                {
                    "sent": "Some sense how to turn a new post problem into a well posed problem well to solve ill posed problem for regulation.",
                    "label": 0
                },
                {
                    "sent": "So among all regulation technique, I will put some emphasis in Tikhonov regularization and I will also present other realization method and I'll try to show you how.",
                    "label": 0
                },
                {
                    "sent": "Regulation is performing.",
                    "label": 0
                },
                {
                    "sent": "Through the analysis, using the code filter functions.",
                    "label": 0
                },
                {
                    "sent": "So among other regulation method that will put some emphasis in iterative algorithm.",
                    "label": 0
                },
                {
                    "sent": "Conjugate gradient type method.",
                    "label": 0
                },
                {
                    "sent": "So I tried to explain you why and how they are regulars.",
                    "label": 0
                },
                {
                    "sent": "I they are doing regularization and while they are good because they are very fast and very generic, they can use for different framework.",
                    "label": 0
                },
                {
                    "sent": "And then we finished last lecture by your proof of convergence.",
                    "label": 0
                },
                {
                    "sent": "Actually it's not really convergent, it's what's called semi convergence.",
                    "label": 0
                },
                {
                    "sent": "Because we've seen the general case.",
                    "label": 0
                },
                {
                    "sent": "What's going to happen?",
                    "label": 0
                },
                {
                    "sent": "We are going to have the solution.",
                    "label": 0
                },
                {
                    "sent": "And then away from it.",
                    "label": 0
                },
                {
                    "sent": "You have to find where to stop, and it's well known in community in neural network community.",
                    "label": 0
                },
                {
                    "sent": "For instances it has been known as early stopping so we have to do early stopping.",
                    "label": 0
                },
                {
                    "sent": "So what I will provide you is why are we doing early stopping and.",
                    "label": 0
                },
                {
                    "sent": "How it works?",
                    "label": 0
                },
                {
                    "sent": "How can we design A bound to explain this phenomenon and why we have to do that?",
                    "label": 0
                },
                {
                    "sent": "But before to do that we have to go through simple example the spline.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I take the interpolation spline problem.",
                    "label": 0
                },
                {
                    "sent": "So assume we have we on the real line and the output is also a real value.",
                    "label": 0
                },
                {
                    "sent": "We have a sample.",
                    "label": 0
                },
                {
                    "sent": "M dimensional I try to use consistent notation.",
                    "label": 0
                },
                {
                    "sent": "I don't know if I've managed to do that.",
                    "label": 0
                },
                {
                    "sent": "And the problem is to find a function F such that F of XI is equal to Y. Interpolation problem.",
                    "label": 0
                },
                {
                    "sent": "So to solve it, I propose no, I don't propose the following and respirable.",
                    "label": 0
                },
                {
                    "sent": "For instance, we propose to minimize.",
                    "label": 0
                },
                {
                    "sent": "This cost we have seen previously, the only thing we're going to do we're going to ask, Lambda.",
                    "label": 0
                },
                {
                    "sent": "To go to 0.",
                    "label": 0
                },
                {
                    "sent": "So our solution is going to be interpolate, so the idea of this cost function is to add 2 terms, one to feed the data.",
                    "label": 0
                },
                {
                    "sent": "This measure the error.",
                    "label": 0
                },
                {
                    "sent": "So at the end you want F of X equal Yi.",
                    "label": 0
                },
                {
                    "sent": "We want really to minimize this one.",
                    "label": 0
                },
                {
                    "sent": "And the other one.",
                    "label": 0
                },
                {
                    "sent": "Assess the regularity of the model so you want a solution that fits the data, of course.",
                    "label": 0
                },
                {
                    "sent": "Search that F of X is equal to Y, but if you want to be generic in learning, you want to be able to learn anything.",
                    "label": 0
                },
                {
                    "sent": "So you need a very big hypothesis space with a lot of functions because you don't know what your target is going to be.",
                    "label": 0
                },
                {
                    "sent": "So of course, if you are looking for functions in general such that F of X = y, you may have a lot of them.",
                    "label": 0
                },
                {
                    "sent": "Too much, so we have to choose among all of them.",
                    "label": 0
                },
                {
                    "sent": "Which are the good one.",
                    "label": 0
                },
                {
                    "sent": "So here there's a mean of choosing you're choosing the most regular one, the one with the smallest derivative.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Of course, if you putting too much regularly fit exactly the data.",
                    "label": 0
                },
                {
                    "sent": "So if this parameter is a kind of.",
                    "label": 0
                },
                {
                    "sent": "Balancing the two things, fitting the data and the regularity.",
                    "label": 0
                },
                {
                    "sent": "So if you want to do interpolation, what you have to do is to.",
                    "label": 0
                },
                {
                    "sent": "Take this parameter or take the solution with this parameter and make it go to 0.",
                    "label": 0
                },
                {
                    "sent": "OK, so when we define our goal, it's looks reasonable, so we can define based on that or hypothesis set.",
                    "label": 0
                },
                {
                    "sent": "We're going to look at the solution as a function from R to R. It has to be in R to the Omega pointwise defined function such that its derivative.",
                    "label": 0
                },
                {
                    "sent": "As to be square integrable, that is to say, functionally speaking the derivative as to belong to L201.",
                    "label": 0
                },
                {
                    "sent": "OK, fair enough.",
                    "label": 0
                },
                {
                    "sent": "So now thanks to the appetizer, we know if we want to minimize that, we have to compute the derivative.",
                    "label": 0
                },
                {
                    "sent": "We know that art is exactly the derivative well expect except for the DOT product I just represent through integral, I can be more specific here in this case.",
                    "label": 0
                },
                {
                    "sent": "And here since I have not discussed yet, what's H is really, I will represent the value of a given function by this kind of Verity.",
                    "label": 0
                },
                {
                    "sent": "The Delta distribution applied to G. And for this term to solve it, what I have to do?",
                    "label": 0
                },
                {
                    "sent": "I have to integrate by parts.",
                    "label": 0
                },
                {
                    "sent": "So you see, if I integrate by parts, I will have the second derivative of F&G will be integrated fully, it's here.",
                    "label": 0
                },
                {
                    "sent": "But also I have the constant term.",
                    "label": 0
                },
                {
                    "sent": "The value of the function in zero and in one.",
                    "label": 0
                },
                {
                    "sent": "Yep, sure.",
                    "label": 0
                },
                {
                    "sent": "Also because.",
                    "label": 0
                },
                {
                    "sent": "It's my example, I think it right now it's just.",
                    "label": 0
                },
                {
                    "sent": "Yes there are.",
                    "label": 0
                },
                {
                    "sent": "Yeah OK, so maybe you're right here.",
                    "label": 0
                },
                {
                    "sent": "Instead of taking RI should have taken 01 in my example.",
                    "label": 0
                },
                {
                    "sent": "Would be clear you're right.",
                    "label": 0
                },
                {
                    "sent": "This is very important.",
                    "label": 0
                },
                {
                    "sent": "Afterwards, each choice.",
                    "label": 0
                },
                {
                    "sent": "So I've taken my example.",
                    "label": 0
                },
                {
                    "sent": "I can normalize them so that they fit in 01 and afterwards I'm doing interpolation.",
                    "label": 0
                },
                {
                    "sent": "Oh how do we know the second derivative exists?",
                    "label": 0
                },
                {
                    "sent": "We don't actually see the problem.",
                    "label": 0
                },
                {
                    "sent": "You've read my next slide.",
                    "label": 0
                },
                {
                    "sent": "No, you're right, we never see that.",
                    "label": 0
                },
                {
                    "sent": "I just integrate by part assuming it exists, but.",
                    "label": 0
                },
                {
                    "sent": "In fact it.",
                    "label": 0
                },
                {
                    "sent": "We'll see this is the problem?",
                    "label": 0
                },
                {
                    "sent": "OK, but anyway.",
                    "label": 0
                },
                {
                    "sent": "Assume we continue like that.",
                    "label": 0
                },
                {
                    "sent": "We have a kind of equation.",
                    "label": 0
                },
                {
                    "sent": "To solve the equation so just this term.",
                    "label": 0
                },
                {
                    "sent": "Here we retrieve this term with Delta, the two value at zero and one, and then the second derivative.",
                    "label": 0
                },
                {
                    "sent": "So this has to be equal to 0.",
                    "label": 0
                },
                {
                    "sent": "So assuming this exist to solve that I have to integrate 2 times and if I integrate two times, I have to fix two constants.",
                    "label": 0
                },
                {
                    "sent": "So I need more constraint to solve.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Problem.",
                    "label": 0
                },
                {
                    "sent": "So I just recall the function we want to minimize the functional space we are given.",
                    "label": 0
                },
                {
                    "sent": "Then if I want to cancel the derivative, I want this to be equal to zero since I have second derivative, I need two more constraints and I choose to put these constraints.",
                    "label": 0
                },
                {
                    "sent": "So I decide because I can do that.",
                    "label": 0
                },
                {
                    "sent": "Why not?",
                    "label": 0
                },
                {
                    "sent": "Because it's easy for me also to put the derivative at 0.",
                    "label": 0
                },
                {
                    "sent": "The same as the solution, the same as the derivative of the solution at one, and there will be zero.",
                    "label": 0
                },
                {
                    "sent": "That is to say, I asked for the solution to be constant on each side, which is not too bad actually, but the nice thing is because of that, these two terms will cancel be painful, so I'm quite happy with that nice constraint.",
                    "label": 0
                },
                {
                    "sent": "OK, and so based on that, what is a solution?",
                    "label": 0
                },
                {
                    "sent": "F second, the second derivative of X is just equal to a linear combination of the Delta distribution weighted by some Alpha and these Alpha.",
                    "label": 0
                },
                {
                    "sent": "They're just this coefficient.",
                    "label": 0
                },
                {
                    "sent": "I wrote it down here.",
                    "label": 0
                },
                {
                    "sent": "Oh yes, time the Lambda here.",
                    "label": 0
                },
                {
                    "sent": "Time that.",
                    "label": 0
                },
                {
                    "sent": "No, afterwards I can integrate once.",
                    "label": 0
                },
                {
                    "sent": "So the integration is linear, so I define Y as the Heaviside distribution.",
                    "label": 0
                },
                {
                    "sent": "So it's zero and then one.",
                    "label": 0
                },
                {
                    "sent": "Depending on the value plus some a.",
                    "label": 0
                },
                {
                    "sent": "But since I want F prime to be equal to zero, that means F prime of 0 is to be equal to 0.",
                    "label": 0
                },
                {
                    "sent": "This term cancer, so a as 2 equal to 0.",
                    "label": 0
                },
                {
                    "sent": "So this is a very nice condition.",
                    "label": 0
                },
                {
                    "sent": "Choose it well, OK, and then I integrate the second time.",
                    "label": 0
                },
                {
                    "sent": "And then what do I have?",
                    "label": 0
                },
                {
                    "sent": "I have the sum of the integration of the heavyside function, so it's a function which is 0 up to one point and then align.",
                    "label": 0
                },
                {
                    "sent": "Because today relative to have the heavy side and then to have the Delta distribution.",
                    "label": 0
                },
                {
                    "sent": "Somehow to do like that and if I see I want F prime of 1 equal to zero, I just apply it here a cancel this term are equal to 1.",
                    "label": 0
                },
                {
                    "sent": "So I have the sum of Alpha equal to 0.",
                    "label": 0
                },
                {
                    "sent": "So look, I have Alpha equal that with our M equation.",
                    "label": 0
                },
                {
                    "sent": "One more equation and I have M coefficient plus one, so I have M + 1 and nonviable and M + 1 equation so I can solve the problem naturally if I solve it.",
                    "label": 0
                },
                {
                    "sent": "I have good solution, it works quite well, but there is some problem as you pointed out, there is no reason for F second.",
                    "label": 0
                },
                {
                    "sent": "To exist.",
                    "label": 0
                },
                {
                    "sent": "And also.",
                    "label": 0
                },
                {
                    "sent": "Maybe the solution here.",
                    "label": 0
                },
                {
                    "sent": "It's a function which is not very viable because it's function like that.",
                    "label": 0
                },
                {
                    "sent": "So at this point the derivative doesn't exist.",
                    "label": 0
                },
                {
                    "sent": "So it's a bit weird to say, OK, I'm looking for a function so that the derivative is in L2, and this function is not terrible, so something is wrong in this framework.",
                    "label": 0
                },
                {
                    "sent": "So let's try to solve it.",
                    "label": 0
                },
                {
                    "sent": "That's the wrong thing.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, the wrong thing is to use the derivative.",
                    "label": 0
                },
                {
                    "sent": "In fact, we like the derivative because we think, OK, I want a regular function function whose derivative is small because the derivative measure the fluctuation of the function.",
                    "label": 0
                },
                {
                    "sent": "But maybe we can see the thing the other way around.",
                    "label": 0
                },
                {
                    "sent": "Instead of starting from.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So instead of saying that I want the derivative to be L2, I can start from L2 functions.",
                    "label": 0
                },
                {
                    "sent": "Because I know them and then integrate this function.",
                    "label": 0
                },
                {
                    "sent": "By integrating this function I am saying OK, I want the solution to be more regular because in L2 I don't know other things are and I take the integration.",
                    "label": 0
                },
                {
                    "sent": "So things I am asking for F to be regular of course.",
                    "label": 0
                },
                {
                    "sent": "Then when I come back I can ask for the derivative to exist, and so by this mean, what do I do?",
                    "label": 0
                },
                {
                    "sent": "I'm just defining the derivative in the more general sense as the inverse of the integration operator and the operation the integration operator, it's nice.",
                    "label": 0
                },
                {
                    "sent": "When you discuss so the classical way of defining this regularity is to define an operator P from some hypothesis space towards L2.",
                    "label": 0
                },
                {
                    "sent": "Associating with a function, it's regularity, which is it derivative?",
                    "label": 0
                },
                {
                    "sent": "But this is not very convenient because we have seen we have a lot of problems on that.",
                    "label": 0
                },
                {
                    "sent": "So the in my opinion it's better to see the thing the other way around and to define an operator which is point Y D5 from L2 towards R. So for a given function I just associated the value of the function at a given point.",
                    "label": 0
                },
                {
                    "sent": "I define it S of X.",
                    "label": 0
                },
                {
                    "sent": "Is this integral, which is exactly the value of the function that given X and then I take a new operator for a family of X in Omega.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                },
                {
                    "sent": "As it's just the generalization of.",
                    "label": 0
                },
                {
                    "sent": "As for all X in Omega here, Omega 01 and then I define my operator South from L2R201 which is the right space where I want the solution to be.",
                    "label": 0
                },
                {
                    "sent": "And then I take my solution to be a regular function in the sense of South.",
                    "label": 0
                },
                {
                    "sent": "That is to say, a function that is the result of this convolution integration process.",
                    "label": 0
                },
                {
                    "sent": "OK so I'm quite happy with that.",
                    "label": 0
                },
                {
                    "sent": "I know that the value of a function is just this integral here.",
                    "label": 0
                },
                {
                    "sent": "And then what I do I do?",
                    "label": 0
                },
                {
                    "sent": "I just say OK what's H HD image of my linear operator?",
                    "label": 0
                },
                {
                    "sent": "I know it's a vector space, I just have some time to work a little bit on the kernel of this sense of new space of this operator in order for him to be really a one to one to other direction.",
                    "label": 0
                },
                {
                    "sent": "So when I have objection now, I can define H An I can define and talk about the inverse of South.",
                    "label": 0
                },
                {
                    "sent": "An eye can see these derivative adjust the inverse of the operator S. So what we see here is maybe we have some idea of regularity.",
                    "label": 0
                },
                {
                    "sent": "I want the derivative to be that and so on so forth, but I think it's quite dangerous to see the thing like that.",
                    "label": 0
                },
                {
                    "sent": "We're not quite OK in my opinion.",
                    "label": 0
                },
                {
                    "sent": "The best way to do the things to do that the other way around and to start from some nice space we like like L2 or something and then to build the target space, the apparatus space by explicitly stating what's the regularity we want on the solution.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At all.",
                    "label": 0
                },
                {
                    "sent": "Of course we are not, of course, but thanks to this framework we have one more property which is rather important.",
                    "label": 0
                },
                {
                    "sent": "So I just record this is the bad definition.",
                    "label": 0
                },
                {
                    "sent": "So this is a good definition.",
                    "label": 0
                },
                {
                    "sent": "We have the operator South that give us a function value and we have also very important since South is a linear operator from Hilbert space, two up vector space, we can do this vector space with a dot product by a very simple thing if we give Me 2 function here, I did find the dot product of these two functions.",
                    "label": 0
                },
                {
                    "sent": "As the dot product in L2.",
                    "label": 0
                },
                {
                    "sent": "Of this function which has a derivatives in fact, but their their relative in the general sense.",
                    "label": 0
                },
                {
                    "sent": "Since I know how to apply it because I've built H to be able to construct and to define S -- 1.",
                    "label": 0
                },
                {
                    "sent": "So now I know that H is a dot product space and I know what the DOT product.",
                    "label": 0
                },
                {
                    "sent": "If the integral of F prime G prime but the derivative taken in the general sense at the inverse, the real inverse of the integration process.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "So based on that I have one more important property which is the replacing property.",
                    "label": 0
                },
                {
                    "sent": "Namely, if I take the value of a function in H at a given point.",
                    "label": 0
                },
                {
                    "sent": "So by definition, is F of X, but as of X it just this integral and this integral from zero to X can be seen as integral from zero to one of this Heaviside function.",
                    "label": 0
                },
                {
                    "sent": "I just put zero the users term applied to G. And then what's this?",
                    "label": 0
                },
                {
                    "sent": "Interroll it's a dot product in L2 of these two function and based on my definition I can represent this dot product in L2 through DOT product in H. The image of G and the made up of the heavyside distribution, and now what the image of G is function F in H. So what the image of H?",
                    "label": 0
                },
                {
                    "sent": "As of why the image of the side distribution is going to be the kernel?",
                    "label": 0
                },
                {
                    "sent": "And because of this property, I am in replacing canal able space by construction.",
                    "label": 0
                },
                {
                    "sent": "So this operator S is very useful because from L2 I can build.",
                    "label": 0
                },
                {
                    "sent": "The space which is nice, it's belongs to up to the mega.",
                    "label": 0
                },
                {
                    "sent": "It's .25.",
                    "label": 0
                },
                {
                    "sent": "It has a dot product and needs replacing connected but space.",
                    "label": 0
                },
                {
                    "sent": "So thanks to that I have the good property I know.",
                    "label": 0
                },
                {
                    "sent": "And I can of course compute the kernel here.",
                    "label": 0
                },
                {
                    "sent": "It's the image of that, so it's this integral and I retrieve my function.",
                    "label": 0
                },
                {
                    "sent": "Function which is zero somewhere and then.",
                    "label": 0
                },
                {
                    "sent": "Linear model or little explain here.",
                    "label": 0
                },
                {
                    "sent": "If I didn't make any mistake in the computation.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let's summarize what you've done up to now.",
                    "label": 0
                },
                {
                    "sent": "So the way of defining splines.",
                    "label": 0
                },
                {
                    "sent": "To define the regularity sometimes has been to minimize a function like that, taking into account the derivative and to define H as a function such that these are relative is L2 for the problem is we have a lot of technical problems when we want to derive the solution with the second derivative, and we have a function which is not terrible, so.",
                    "label": 0
                },
                {
                    "sent": "Not the reliable in English or.",
                    "label": 0
                },
                {
                    "sent": "I differentiable I think is the proper word in English.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry I'm using French.",
                    "label": 0
                },
                {
                    "sent": "So if you say French deliver differential differentiable good.",
                    "label": 0
                },
                {
                    "sent": "So here I propose an altean at an alternative way to design the functional space in which we are building.",
                    "label": 0
                },
                {
                    "sent": "So the way I show you through operator S of course can be generalized to any kind of operator.",
                    "label": 0
                },
                {
                    "sent": "So to do so we need to take a function.",
                    "label": 0
                },
                {
                    "sent": "I call it gamma.",
                    "label": 0
                },
                {
                    "sent": "It has to belong to L2 and not a single function, but it's a family of function indexes by XX belonging to.",
                    "label": 1
                },
                {
                    "sent": "The the Omega, the domain of my learn.",
                    "label": 0
                },
                {
                    "sent": "So in our example or gamma function with this function.",
                    "label": 0
                },
                {
                    "sent": "The heavyside function.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "So we can see for a given X it's L2 integrable in.",
                    "label": 0
                },
                {
                    "sent": "In 01.",
                    "label": 0
                },
                {
                    "sent": "OK, so then, thanks to gamma we can define SS, take a function G in L2 and its image is a dot product of gamma X with G. So depending on gamma, it cannot be projective, so we have to divide by the new space.",
                    "label": 0
                },
                {
                    "sent": "So we make it projective and then we define H at the image of this operator and H belongs to after the mega it's a representation of the space and we know that the kernel going to be this.",
                    "label": 0
                },
                {
                    "sent": "The DOT product of these two functions.",
                    "label": 0
                },
                {
                    "sent": "And now, instead of minimizing that, we can redefine things saying we want to minimize in H defined as the image of this operator.",
                    "label": 0
                },
                {
                    "sent": "This functional, which is of course this term fitting the data plus another term, which is that the norm of the function in H. We are saying OK, we want this is the way we are measuring or defining the regularity of the function H. So maybe we lost the relationship direct relationship with the derivative of the way of expressing regularity, but we still have it, and the way we express regularity is hidden in H and in the way we are defining and retrieving the kernel and the way we have designed this mapping.",
                    "label": 1
                },
                {
                    "sent": "So we have seen also that the general solution of this problem minimization problem will put is can be returned as linear combination of the kernel.",
                    "label": 0
                },
                {
                    "sent": "It's a represented theorem, so plus one term.",
                    "label": 0
                },
                {
                    "sent": "Which is the parametric.",
                    "label": 0
                },
                {
                    "sent": "I call it sometime or.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Alex smaller parametric components.",
                    "label": 0
                },
                {
                    "sent": "So in our example we have this P equal to 1.",
                    "label": 0
                },
                {
                    "sent": "We have only one term which is little be, so we have the function Phi, one of X which is a constant function.",
                    "label": 0
                },
                {
                    "sent": "So it's a very simple function in the remaining of my presentation.",
                    "label": 0
                },
                {
                    "sent": "I will not talk about this one, it's not a major problem, it's just a technical difficulty too.",
                    "label": 0
                },
                {
                    "sent": "To handle this thing.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What's the timer?",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So maybe we stop here and we have lunch with Carrie on tomorrow at 4:00 o'clock.",
                    "label": 0
                }
            ]
        }
    }
}