{
    "id": "7neffrylfejag34gy2w63ob2uyp6ymux",
    "title": "Nonequilibrium quantum physics: Exact steps",
    "info": {
        "author": [
            "Tomaž Prosen, Fakulteta za matematiko in fiziko, Univerza v Ljubljani"
        ],
        "published": "July 25, 2016",
        "recorded": "June 2016",
        "category": [
            "Top->Physics"
        ]
    },
    "url": "http://videolectures.net/kolokviji_prosen_nonequilibrium_quantum_physics/",
    "segmentation": [
        [
            "So yeah, when I got invitation to give a colloquium in your Stephen Institute, of course.",
            "Somehow I was pleased and proud to be able to present my work here.",
            "On the other hand, it's always a bit cumbersome to give us sort of a general colloquium about something which is quite technical and in essence, but still I try to maybe.",
            "Go leave it behind.",
            "The motivation for doing all these technicalities and try to just flash on some main results or some main mechanisms or something which I could maybe really explain so I will not go basically through all the stuff that we did in the last years, but maybe to some of it with the common denominator that we are that here I'm covering sort of an equilibrium quantum physics of exactly solvable models, so that's why I'm turning this exact steps over through nonequivalent.",
            "Physics.",
            "So first."
        ],
        [
            "I make a sort of reference to an after dinner speech of this guy on the left a little bit.",
            "But yeah, who is one of the?",
            "Probably most influential mathematical physicist that is of these days.",
            "And he's sort of.",
            "He can be considered as a mathematical physicist theoretical physicist depending on your taste.",
            "And the guy on the right is Phillip Anderson.",
            "And there was this after dinner speech after a conference in Rome in 2010.",
            "When I look for the AFC at well.",
            "I mean he wanted to basically explain why is he doing what he's doing, what he's doing and the way that he's doing things.",
            "I mean how basically can view different type of theoretical physicists?",
            "How I mean, what is basically the perspective that they have to to get themselves engaged into theoretical physics.",
            "So basically I mean you can classify I mean.",
            "Because, you know, you can say OK.",
            "I mean, this is like mathematics.",
            "I mean you can say well, I mean you are working with abstract models.",
            "Why do you care about abstract models?",
            "I mean sometimes these models are very far from reality in the next couple of slides I'd like to show you that basically we are nowadays witnessing experiments where things are sort of also realizable in the lapse.",
            "But that's again, it's not.",
            "So maybe this doesn't increase motivations of mathematical feels so much it increases basically the attention of the of the Community.",
            "To look at these results that mathematical physicists work on.",
            "But anyway, so basically once per day of set, I mean that basically there are two ways to to to to to do physics.",
            "One way is basically not the way that we are taught.",
            "You know at I mean this is not a physics thesis way.",
            "This is basically mathematicians or whatever I mean.",
            "Or maybe string theorists way whatever I mean, you start from some basic principles, some beautiful symmetries, conservation laws which postulate.",
            "And then from this you derive models and then from there you drive phenomenal.",
            "Lodging, you check whether you see these in the nature and then of course what species is doing.",
            "This is typical for, let's say, condensed matter physics, which is represented by.",
            "Let's say this guy on the right.",
            "I mean you start from phenology.",
            "Observe how things are in nature.",
            "You deduce effects general effects.",
            "From that you make models.",
            "Then you make simulations.",
            "Nowadays you have good computers.",
            "You can make simulations of models.",
            "And from there you can deduce general principles, symmetries, conservation laws and so then you can understand.",
            "You say I now understand nature.",
            "Then of course if the two things come together, it's very nice, But basically this is how we.",
            "Have to do things, but sometimes people like for death can also do it top down.",
            "And this is, I would say, more typical for high energy physics or high energy theory I would say.",
            "And this is more typical for condensed matter physics.",
            "And I'm definitely sort of.",
            "My perspective is definitely with with Anderson, not, but yeah, so that's sort of.",
            "I mean, if I try to identify what I'm doing is.",
            "I mean I'm doing mathematical physics, but from condensed matter perspective I mean I really like to dig in the mud and try to find Joules if I can.",
            "And then I try to Polish them and see if they have some symmetries, some principles and so on.",
            "So and I will try to maybe show you.",
            "I mean this this approach I was kind of a bit ashamed of this approach for awhile.",
            "I mean because I was interested in mathematical physics, but I was not able to force myself to go top down.",
            "To really go with you.",
            "So and then it turns out that you can basically find some interesting things even if you go bottom up.",
            "I mean not only that you can do simulations, but you can go basically back up, back up to some basic principles.",
            "You can find some things which appear to be kind of elementary.",
            "Basically you so."
        ],
        [
            "OK, so now let me now just give you some motivating slides.",
            "I mean, on this nonequilibrium dynamics, as I said, not including dynamics these days is a kind of a hot topic.",
            "Also because of this huge advancements of experiments, for example.",
            "I mean it started maybe before before this paper, but this paper certainly was very influential.",
            "The paper of the Group of David Wise from Penn State of this so called Newton's Cradle.",
            "I mean, this is basically the dynamics of both Arnstein condensate of 87 rubidium atoms.",
            "Which this is kind of a snapshot sort of cartoon.",
            "This is time.",
            "This is space.",
            "They prepared two both Langston condensates in the harmonic trap.",
            "At some distance and then you let them go.",
            "Basically that is like 2 pendola which collide and then they they they pounds, they collided bounds, they collided bounds.",
            "So basically with the sort of control and precision of 2006 this looks like a nice realization of Scrabble, right when these people remain very much excited about it.",
            "Nowadays the control is even much more precise."
        ],
        [
            "And people can address even more fundamental basic questions for my experiments.",
            "Sorry this is not reference.",
            "Should not yet appear.",
            "Sorry for that.",
            "For example, one of the basic principles that people can now address in the experiment is the principle of.",
            "I mean, it's the issue of Thermalization enclosed many body quantum systems.",
            "The question here is, I mean I have a complex quantum system, for example, but it might be integrable.",
            "It might be non trivial in the sense that it has conserved quantities, not only the energy, but maybe some other conserved quantities.",
            "For example, I mean it can have particle number which is kind of still textbook.",
            "Yeah, then you can generalize Gibson some, but then you have grand Canonical example, but you can have other conserved quantities which are non trivial and then sort of the.",
            "The conjecture is that your.",
            "Density matrix should somehow converge in some spirit which we have to be really explained in detail to a generalized keeps generalized groups and that's yeah.",
            "And this generalized gives answers is basically the state which is described by conserved operators, one of them being Hamiltonian with others and their associated LaGrange multipliers.",
            "Which one of them is called temperature.",
            "The others are sometimes called generalized temperatures and OK, and this is an ansatz.",
            "It follows from several general principles.",
            "For example, one principle is maximum maximizing entropy.",
            "You can ask, I mean.",
            "Under the conditions that my constants of motion are fixed or are constant, what is the state which maximizes the entropy?",
            "And that's exactly this state.",
            "And OK, I mean this is sort of the.",
            "Principle, which is very difficult to prove.",
            "I mean it's very easy to explain.",
            "It's very easy to motivate.",
            "It's very, very difficult to prove, but these days can be seen."
        ],
        [
            "The lab, I mean this is the experiment that the reference refers to.",
            "I will not go into details of experiments.",
            "I'm sorry for that I'm not able to do that.",
            "That's one thing.",
            "And the other thing is I don't have time.",
            "It's just I have flash from some slides from this nature and science papers, which appeared in last few years.",
            "We show, for example, this paper showed.",
            "I mean, this was the paper of green cattle and science in 2012, where basically they they found this pre thermalized state which is.",
            "I mean, first of all, I mean, you expect of course that generic system will go to thermostate because you don't expect the generic system would be integrable.",
            "But what is remarkable is that it's basically very close to an integrable system, and that physics behaves differently from a physics of a generic system.",
            "I mean, you find this so called criminalization plateau and then there is some sort of order parameter if you wish, which discriminates between thermal between generalized keeps.",
            "So there is this blue points here which stay there for awhile.",
            "So there is OK some sketch how experiments do it and split the initial contact in two to almost equal pieces and then they do time evolution.",
            "Then they do some interference phase interference experiments and then they have some definite expectations to what should happen after a while after the state would be thermal and then they check against this expectation and they find something which is consistent with pre thermal or generalized groups."
        ],
        [
            "What is much more remarkable is this experiment, which is newer.",
            "Which is basically it's reviewed in the recent review paper by Group of York Schmitmeyer from Vienna.",
            "It's experiment, made by this group, where they have measured the two point function in the preterm Allstate, and they compared it to the generalized groups and they found remarkable agreements.",
            "For example, this is the two point function.",
            "This is the phase phase.",
            "They find the measure is the phase.",
            "Coherence is the phase correlations so that the two points phase correlations in the condensate.",
            "And then compare it theory and experiment and find basically somehow remarkably good agreement.",
            "With the assumption of the generalized keeps I'm here, the model is the so called.",
            "Linear model that is the integral model of Bowser gas with contact Delta contact interaction.",
            "So that's sort of the sort of quite realistic model which describes called atoms in the lab.",
            "And of course, the real system is hissem imperfections.",
            "It is not exactly the integral linear gas interaction is a bit more complicated than just the contact is isotropic one, so still it seems that this small perturbations don't really spoil the story.",
            "So what we find is not only agreement of two point functions defined agreement of 4.6 point, 10 point functions even after training.",
            "Markham"
        ],
        [
            "OK, and then you can really do dynamics.",
            "For example, this is.",
            "There's another paper from 2013 of the Group of Immanuel Block Block, where they have prepared they have catched some continuous array of atoms which they put in the optical lattice, and then they can find everything with the harmonic trap.",
            "Then they release the trap, so then then again this guy.",
            "Basically these gases described by Bosa Bosa Hubbard Hamiltonian and this atoms would basically allow.",
            "Be allowed to tunnel through their barriers using simple coping mechanism and what you would see then there.",
            "I mean this would be again a film where one axis is time, the other space of the density of the concept content that you see.",
            "Again that you have this.",
            "Spreading which we can predict, for example, of its state of the art.",
            "Numerical techniques like density matrix, organization group.",
            "So this is experiment.",
            "This is Thierry again you can find quite nice agreement.",
            "So basically there are nowadays witnessing sort of the stage of advancement of experimental quantum physics where you can really do.",
            "Relations with the individual.",
            "Many body systems which can be then tested with state of the art numerical methods and it's not clear it's not well still.",
            "I think numerical methods are somehow better, but we are kind of I mean.",
            "Probably it's just a question of time where numerics will no longer be able to catch up, at least not in more than one dimension.",
            "One dimension we have sort of metrics organization group, which is which is very good.",
            "You can basically well it doesn't work very well for the time evolution, but still.",
            "I guess it will compete with experiments, but in more than one dimension.",
            "Of course we are."
        ],
        [
            "OK, and then you can do even what you can do basically.",
            "Furthermore, is to treat open quantum systems.",
            "That is systems with environment.",
            "For example, this.",
            "Usually this can be done more efficiently with the so called ion traps.",
            "Here I guess state of the art experiments are have been done in Innsbruck in the Group of random blood.",
            "Again I will not go through any of the details, just copy a figure of the of the nature paper from 2011 where they explain how they can basically.",
            "Basically they can manipulate any, let's say mixed state density matrix of a many body system of an ion of an iron chain with which they can do basically quantum computation they can prepare.",
            "States in an arbitrary desired state, and so on."
        ],
        [
            "OK, so now let me go basically to a parody in which we are working on.",
            "Which is the very particular part of the game, so I will just focus on this one.",
            "It's probably at least something which occupies 70% of our research time in our group.",
            "And this is the boundary driven open quantum system.",
            "It doesn't have to be quantum, I will show you also some classical.",
            "I will continue with some classical physics, but idea is the following.",
            "I mean, we're trying to basically understand what happens with the systems in one dimension.",
            "So let's forget about really, really interesting really important questions in 2D.",
            "Let's try first to understand what's going on in one D, because this is already quite interesting and you have a strongly interacting system.",
            "But interaction are supposed to be local and.",
            "You assume now that interaction with the environment only takes place through the boundaries.",
            "There is only the boundary.",
            "Quantum particles are immersed into some reservoirs and they experience transitions.",
            "I don't know.",
            "I mean, they basically can become.",
            "Basically the environment produces the coherence or the state of the system becomes non pure after interacting with the environment.",
            "I mean the idea is of course you can treat an infinite environment or large environment.",
            "You can treat the whole evolution completely unitary fashion and then you can trace over the environment and then what you get at the end is there.",
            "Effective so called Master equation which describes the density matrix of the system in terms of the unitary part which has to do with interaction in the bug and dissipative part, which has to do interactions near the boundaries where the system interacts with the environment.",
            "So I will not, of course explain this equation.",
            "I mean that just flushing it out, that is the Canonical equation which describes the so called Markov Markovian dynamics of an open quantum system which interacts with the environment.",
            "So I mean all that you want to know about the system is parameterized by the Hamiltonian, which is the interactions the coherent interactions.",
            "Many body interactions if you want.",
            "And this operators which are called L sub new which are called sometimes Linda operators or the jump operators which describes interactions with environment.",
            "And in our sort of boundary driven paradigm, people assume that Hamiltonian is the sum of local terms.",
            "So Hamiltonian only contains terms which contain interaction within nearest neighbors.",
            "I mean, that's sort of the.",
            "Example of local interactions.",
            "It could be that Hamiltonian will contain terms which we have 345 particle terms, but this will just increase technical complications, not the conceptual one.",
            "So for conceptual simplicity we only consider 2 body terms in the bug and I and then the boundaries.",
            "We also consider only local jump operators, so this will be like measuring.",
            "I mean, you can imagine this.",
            "Basically we can realize this protocol by measuring by stepwise measuring.",
            "So what you can say is each instance of time, let's say DT.",
            "I mean, after each infinitesimal distance of time.",
            "But I have to be careful little bit with scaling of the strength and time time, time lapse between measurements.",
            "One measures the boundary boundary particles and one measure some observable of the boundary particle and then the system when it's measured.",
            "Then it changes state somehow.",
            "Can experience quantum jump depending on the result of the measurement and then so you can write up basically the master equation which describes this unitary evolution plus the measurement of the environment.",
            "OK, so that's just the general setup and before going into any sort of examples that we have been working on, let me just go."
        ],
        [
            "To A to a system which is much more easy to explain, which is much more common in too much older, which is the classical system of the same sort.",
            "It is a classical boundary driven paradigm, which is where particles again are localized until local interacting.",
            "But there are stochastic, they're classical classical stochastic particles, so this is the so called simple exclusion process.",
            "So this has been around, at least, I think since 1970 and it has been exactly solved in the beginning of 1990s.",
            "And the algebraic nature of this solution can be thought as to be quite related to the algebraic aspects of the solutions that we are working on these days.",
            "Still, the connections are not completely clarified, so it's still kind of interesting, but let me just, you know, for the motivation, I mean, let me try to just move on with this simple model.",
            "So this model is, as I say, it's a simple exclusion process.",
            "So imagine you have L sites.",
            "Again, this good sites particles which are like balls which occupy sites or sites are either either occupied or empty.",
            "And then this is static model.",
            "So at each instance of time, let's say DT, there is a finite probability or probability rate to part for each ball to hop to the right or to the left there is a symmetry.",
            "So let's let's let's normalize the hopping rate to the right one.",
            "Then there is some Q which is between zero and Infinity probability, right that particle hops to the left and then there are some rates Alpha, beta, gamma, Delta for particles to hop in and hop out of the system.",
            "So there is this Alpha which is injection probability to hop from the left to the system.",
            "Beta is the source ejection or absorption probability for particle on the right to exit and so on for gamma and Delta.",
            "So this is a well defined model.",
            "This is if you want to verify model in so-called classical Markov chains.",
            "It's a classical Markov chain.",
            "It's a many body classical Markov chain, so the total in sample of all states comprises of two to the L states.",
            "There is L sides.",
            "Each side can be empty or occupied, so it's two to the El possible states, so it's a huge matrix if you want apply to probability state vector and if you are looking at a steady state and this is mainly what we're doing, we are wondering what is the steady state of this of this dynamics.",
            "An update can be thought as a 000 eigenvalue eigenvector of this Markov matrix.",
            "So it turns out that this problem is actually quite tightly related to a problem of quantum spin chains and fatia, for example, and his school who basically started this.",
            "Procedure of.",
            "Quantum integrability in the 1970s.",
            "One of the problematic models there is a Heisenberg model which I will go into and turns out of.",
            "This matrix is closely related to the Hamiltonian of Heisenberg model.",
            "Actually it is the Hamiltonian of Heisenberg model.",
            "Even though this has nothing to do with quantum mechanics, but it has.",
            "But the fact that this is basically related to quantum Hamiltonians of course brings in the whole machinery of methods of exactly solvable systems into the business of classical.",
            "Exhibition processes this model actually is interesting from the point of view of applications in in.",
            "In biophysics in chemical physics, in that in the asymmetric version of this model, completely isometric version, totally asymmetric version is interesting also to model traffic flow and traffic jams and so on.",
            "For example, just to flash how this I mean how the most elegant?"
        ],
        [
            "Solution of this model looks which I can write down into lines on the screen.",
            "This solution has been put forward by in this seminar paper by the read I'm coworkers in 90, three and this solution puts forward an ansatz which is amazingly successful.",
            "The so called matrix product answers.",
            "So, so the idea is the following.",
            "I mean, this is something we should try first.",
            "I mean this is a generic answer which works in one dimension and so far all the models that are exactly solved in one dimension can be in this way or another related to matrix product and set.",
            "So that's the most useful mathematical concept you can imagine in many body physics or one dimension, classical and quantum.",
            "So what you should do?",
            "I mean you have so many bodies state, and in this case this many body state is called probability state vector.",
            "It depends on bits which are just occupation numbers of this classical balls, stochastic balls and you can make an answer saying that this probability state is simply a product of matrices.",
            "There are two matrices, a zero and a one.",
            "This in this is R zero and one sandwich between two states.",
            "You write, you write this in if you want.",
            "If you like quantum notation, you can write this in.",
            "The Dirac notation doesn't matter.",
            "I mean there is of course some Hilbert space which has nothing to do with physics in which these matrices are represented, in which these days living.",
            "You don't care yet about what is really concrete representation of these matrices.",
            "You just plug these answers into the equations of motion if you want into the expression for this matrix M and you ask for the equivalent condition, or for the sufficient condition for the steady state, it turns out that a sufficient condition for the steady state that is sufficient condition for this equation is comprised of two lines.",
            "The first line is the bulk condition, which simply gives you the.",
            "You can isolate that.",
            "I mean, that's something I have not done here on the slide, but that's something which requires maybe an hour of work, not more.",
            "To isolate this condition.",
            "And it turns out, this condition is remarkably beautiful from mathematical point of view.",
            "Basically tells you that this commutator of these two matrices or Q commutator is Q is related again to some mathematical physics of Q deformations.",
            "And so you can, instead of writing commentators, you can write Q. Commentators, deform commentators and the commutator of these two matrices is given as a combination of these two matrices, and there are boundary conditions which follow from which basically put constraints on the boundary States and this boundary conditions of course involve these two.",
            "These four parameters here.",
            "And it turns out that this is all that you need in order to produce any.",
            "Correlation function in the steady state in the non equilibrium steady state you don't have to write spell out these matrices explicitly.",
            "OK."
        ],
        [
            "And for example.",
            "And there are two particular instances of this model which are kind of interesting or simple to discuss."
        ],
        [
            "One of them is where these hopping greater symmetric work is equal to 1.",
            "Then this is a simple model of diffusion.",
            "It turns out and if you look at the steady state and the steady state would be simply obeying the fixed law, there would be a gradient of density and that would be a current of particles and current of particles will be proportional to the density.",
            "So it's a simplest statistical nuclear statistica mechanics.",
            "You can think of for diffusive system, but then you can also put a bias.",
            "For example you can put Q different from one.",
            "Then this would be like a bias in the bar, could be some push.",
            "For example, you can put Q equal to 0.",
            "Then this would be like a dynamics of cars on the highway.",
            "They have some average velocity which is characterized by this rate one, but then there is density an if density is too big then there are phase transitions there, traffic jams and then."
        ],
        [
            "This can be characterized by this phase diagram.",
            "So for example, this is the so called task, totally asymmetric solution process, where Q is equal to 0.",
            "Then there are basically the one has this simple phase diagram.",
            "There are three phases where when you push hard enough, there are just two parameters.",
            "Now in beta, right?",
            "Because gamma and Delta don't make sense here because you only go to the right, so there is Alpha which is the flux of cars from CTA beta, which is the absorption rate of cars to CTB or a garage or whatever and then theater.",
            "People want to go to the theater, for example, and then you want to know whether there will be a traffic jam.",
            "Just take just use the parameters and look at the phase diagram.",
            "We see that there is a different phases.",
            "There is a nice phase where.",
            "Give you achieve maximal flux maximum current, but then there is a phrase of high density which is basically traffic jam face of low density and there are kinks.",
            "This domain walls between different phases which are rather generic.",
            "Here for example low density, high density domain wall or maximum current high density during war.",
            "Which at the end goes to a maximum high density.",
            "After that I mean this domain words move very slowly, so there is.",
            "I mean, sometimes you find exponential long times for after which this relax is to really.",
            "Depending how close you are to face boundary and so on.",
            "OK, so then I mean this is kind of a paradigm of nonequilibrium quantum phase transition.",
            "So there's the model which people discuss.",
            "I mean often or most of the time when they speak about nonequilibrium quantum phase transitions.",
            "It's classical statistical mechanics."
        ],
        [
            "So then there's a model not related to that, but sort of could be inspired by that which we have just worked out with my friend Carlos Mejia Monastero in.",
            "In a few months ago, basically, which is a caricature of another type of para digam, which is again classical.",
            "For example, suppose you don't want to have stochastic dynamic.",
            "Suppose you want to know what deterministic dynamics that realistic anybody dynamics does.",
            "If you push in or push out particles with some rates.",
            "So with some stochastic boundary.",
            "So imagine the environment is a big thing.",
            "Environment has lots of entropy, so environment can be considered as a stochastic reservoir and particles can come in and come out with some uncorrelated ways.",
            "But still the interior of the.",
            "System is purely deterministic.",
            "There are well defined models of deterministic dynamics which are many body which are strongly correlated or strongly interacting.",
            "So one of them is for example this cell automaton which I don't go into detail here.",
            "This is just a flash to know to know that these things can be done.",
            "For example in this for the people who are interested in high energy physics this can be understood as a simplest model of relativistic quantum field theory.",
            "There are just two types of particles, cure which moves with speed of light but left movers and right movers.",
            "So for example this time this space.",
            "In this left Morrison right movers interact.",
            "They form a quasi stationary state for short time and then they scatter.",
            "So basically there is a time shift or phase shift if you want for each body scattering.",
            "So I mean, this is the simplest if you want anybody the terministic relativistic like because it's on spacetime, lattice dynamics in one plus one dimension.",
            "And now the question is what happens if you put this against two stochastic reservoirs?",
            "It turns out working, produce reservoirs, and this is the way.",
            "Basically you construct them from anybody Markov chain.",
            "So there is a deterministic part which is characterized by this local permutation matrix, which is a local update rule.",
            "This is time space.",
            "And then there is some Markov chains on the boundaries which basically take control of of chemical potentials of the solitons if you want.",
            "As I, as I said, I mean, this is just a flash on illustration that a model like this can also be exactly solved.",
            "It it basically one can write also predictions of this sort which don't appear to be directly related to to accept, which I showed before, but it seems that somehow this picture of integrability of out of equilibrium systems kind of is rich and one can have sort of fundamentally different conceptually different paradigms which which are of this type."
        ],
        [
            "Now let's now move on and go to quantum Quantum many body systems.",
            "The question which we ask some time ago, which basically this was one of the first papers which I've done in this direction in 2008.",
            "This is basically was the first few years where we started to work on this para digam and the first question I asked myself was.",
            "I mean can 1/2 interesting physics and interesting Canonical Ingram states even for essentially non interacting systems.",
            "So for example one of the paradigms of non interacting systems is this XY spin chains.",
            "In one dimension, when you have quantum spins 1/2.",
            "Arrange them on the line you put nearest neighbor interaction, spin spin interaction, but you put interaction in a strongly in isotropic way such that only the components in the XY plane matter, so interaction only is only in the XY plane.",
            "Then it turns out that this model can be mapped by a non local transformation to free fermions.",
            "So technically speaking this model is noninteracting, even though some people they would still call this model interacting.",
            "But there is this simple trick, the Jordan Wigner transformation which.",
            "Basically, demystify this model and makes it non interacting somehow is a bit trivial.",
            "Still not quite trivial.",
            "I mean there are hundreds of papers written on this model.",
            "There are interesting phenomena discussed for this model.",
            "For example, this model is one of the paradisians.",
            "Also for quantum phase transitions equilibrium quantum phase transition is the model which displays quantum phase transition at zero temperature when you change magnetic field.",
            "So I mean, it's not fair to call.",
            "It's trivial, but still.",
            "I mean, it's much simpler than the models which are really interacting.",
            "And for example, one can ask if one can write steady state of this model when you put jump operators on the boundaries with some rates.",
            "And this is what we did with my former students with my PhD student at that time is to be sure.",
            "And we computed correlation function or correlation matrix of the steady state.",
            "This is the spin spin correlation function.",
            "Depending on the magnetic field and we find that it's phonetic ability is large, then basically we have thermal correlations.",
            "This is very much like in the experiments of schmitmeyer.",
            "If you remember the correlation."
        ],
        [
            "And if I just flash back.",
            "You see, this was the typical thermal correlations, right?",
            "OK, so here are some effects, but OK, don't discuss that because this is not but for example, typically is that you have a diagonal and of the diagonal have decay."
        ],
        [
            "And this is typical for thermal states.",
            "You have fast decay from the diagonal, which means that correlations decay when particles are moving away from each other, or when two sites are far away.",
            "That's deep, that should be typical for one time in one.",
            "Any thermal states, repealed, or any equilibrium states would be short range.",
            "In equilibrium, but now when you have this monitoring steady state and you compute spin spin correlations for magnetic field which is below some critical value.",
            "Which is maybe not written here, but doesn't matter.",
            "Then you find a very bizzare patterns of spin spin correlations.",
            "Basically they remind you of some station, some standing waves into the mentions.",
            "Basically you can write wave equation which defines this correlation matrix which from which you can compute the correlation matrix in this wave equation is now has real waves here and harass and evanescent waves there.",
            "So we find sort of a phase transition which can be explained by simple wave equation.",
            "In thermodynamic limit.",
            "OK, so yeah, that's OK, that's sort of the transition which we are sort of kind of understand from technical POV quite well, but still from physical point of view it could be still debated.",
            "I mean the the transition is triggered basically by the probation which comes from the boundary, but still there should be some instability in the bulk which allows for this transition to happen.",
            "So actually recently there was a paper by by Mauricio faculty who showed that.",
            "This phase this is if you want long range correlated phase allows also for some bizarre conservation laws.",
            "You're not there in this phase, so.",
            "Now I will discuss conservation law submit later, so I might come back to this remark."
        ],
        [
            "So now let's go back.",
            "Let's move on to basically to my favorites time model, and it's probably favorite time model of many mathematical or theoretical thesis which is the Heisenberg spin chain.",
            "So basically, it's probably one of the most beautiful models.",
            "Theoretical physicist can play with because it's just just just just.",
            "I mean, it has just the right difficulty.",
            "I mean it is integrable but still there are many things which are kind of quite generic.",
            "In this model it displays even for example, somehow diffusive transport displays, ballistic transport, displays, phase transitions between one to another.",
            "So basically this place most of phenomena that basically should happen in one dimension I guess.",
            "So that's the model.",
            "The model is, again, spins 1/2.",
            "You have this XY interaction.",
            "Now I'm writing it in terms of Sigma plus and minus matrices.",
            "These are all familiar Poly matrices and Sigma plus is just see my ex.",
            "Plus I Sigma Y.",
            "See my mind assisting my X minus icing y / 2 and so on.",
            "I mean this is the familiar I guess spin operators for spin 1/2 and then there is interaction.",
            "So Sigma Z times Sigma's interaction and if Delta is equal to 1 then this could be written as a dot product of two vectors of Poly matrices adjacent sides.",
            "So then this would be like.",
            "Then this would be like really Heisenberg interaction exchange interaction, but you would like also to have some free parameters because this parameter is interesting.",
            "Also if you want to go to field theory, this parameter has to do with the mass of expectations.",
            "For example, if Delta is last less than one, then you would have massless extensions or you would call this model critical if there is larger than one you would have massive excitations and this model will be called kept.",
            "OK, and then you attach to environment channels to this model at the boundaries with some rate epsilon and with some dissipation jump operators which are Sigma plus signal minus.",
            "So this basically correspond to flux of magnetization from left to right, so the left you want to flip up spins on the right you want to flip down speeds, so at the end what you expect is that."
        ],
        [
            "State which has some bias which has some profile of monetization at some, some profile or some characteristics of the current.",
            "So this is just what happens.",
            "I mean before I'm just giving you a one slide flavor of how the solution looks.",
            "I give you the observers in this state which can be computed from the solution.",
            "I will show you.",
            "And these are the two main observers.",
            "This is the profiles of magnetisation and this is the current as a function of system size.",
            "Now I little N is my system size.",
            "Now before it was capital L. But I'm sorry for that.",
            "Usually it's little M which is like a number of qubits in the chain number of spins.",
            "So for example, there are three distinctly different physical behaviors in the in the in the, in the in the gapless phase you would find ballistic transport that is the spin profile.",
            "This is the spin density, that is the trace of density matrix times the operator, and so this is just a constant boring boring constant which is practically zero.",
            "This system is not magnetized, but then at the edges nearer boundaries.",
            "It feels a bit that there are these microscopic magnets which try to polarize it, but in the bark it's basically depolarized.",
            "It's it's, it's it's it's.",
            "And the current is large.",
            "This is the full lines on the right there is a few lines of currents.",
            "Which don't depend on the system size essentially.",
            "So basically our ballistic currents depends on the strength of the coupling, so these different thickness of these three different curves correspond to different strains of couplings to the environment.",
            "So small epsilon means thing curve, large epsilon, large coupling sticker.",
            "And yeah, I see that the customer basically is larger the larger the coupling, but it doesn't depend on system size.",
            "Now when you go to the massive case then the system becomes insulator, the current becomes exponentially small.",
            "This is the inset.",
            "The current is exponentially decaying system size and then you have this kingship profiles.",
            "And the most interesting is that the tropical the Heisenberg really did isotropic Heisenberg situation where data is equal to 1.",
            "Then you have some anomalous scaling of the current Jay goes to lesson to minus two and spin spin profiles are this cosine shaped profiles.",
            "All this can be done analytically so and this."
        ],
        [
            "Mechanical and also one can calculate for example the spin spin correlation function.",
            "Again, this is an object which I showed before.",
            "Now it is long ranged, but it's not wave like.",
            "I mean it's not the one for the XY model, but something intermediate.",
            "I mean it's long range, but still in the case.",
            "I mean there's no oscillations.",
            "It's A kind of simple algebraic formula which.",
            "Characterize it.",
            "It may be that this state has some universality.",
            "I mean that it's more universal than just for the Heisman model, but we still work on this.",
            "I mean, this is this exact result can only be done so far for the Heisenberg isotropic Heisenberg model."
        ],
        [
            "OK, so now now I just.",
            "I bothering maybe for 10 minutes with some technical slides.",
            "I'm sorry for that, but for those who might have some interest to see some of the guts of the of the of this exact solutions might want to follow.",
            "The others may fall asleep for awhile and then try to wake you up again before the end, so.",
            "OK, so remember, I mean now the idea is basically to show how one can.",
            "I mean I'm not sure but I will just illustrate how one can try to solve this steady state of The xx ZT model with the metrics.",
            "Product answers.",
            "Basically I will just try to show what how the solution looks like.",
            "This has been basically done in these two papers of mine in 2011 and then there was a nice paper in 2013 which somehow showed how to do it much more somehow.",
            "In some short shortcut they produce, they propose some simpler formulation of the of the recipe to find solution, but basically the result is the same, so.",
            "So the idea is OK, now we have a density matrix, right?",
            "We have many body density matrix.",
            "We try to proceed as closely as possible to the.",
            "Solution of the generic metrics product.",
            "But we don't write the matrix product state for the density matrix with writing for the square root of the SD matrix.",
            "So first right against the matrix or the unnormalized part of this team matrix as a product of Delta Delta Dagger where Delta is.",
            "If you want the square root but non permission square root of the death matrix, this is some factorization of density matrix or some factorization of a positive operator.",
            "But it turns out it is exactly what is called Cholesky factorization because this Delta turns out to be upper triangular matrix.",
            "If you re write it down, you don't have to do this now, so we don't have to appreciate that.",
            "But you have to appreciate is this simple expression for Omega.",
            "So then what you do is basically right.",
            "Omega in terms of a matrix product state.",
            "But now this is not a state, it's an operator.",
            "So sometimes people call it a metrics product operator where you basically expand an operator into basis of all possible operators which are products or tensor products of Pauli matrices.",
            "What is in this is denoted Sigma plus or minus zero and then so there are four possible matrices which spend.",
            "Or to buy two matrices right?",
            "Sigma plus or minus Sigma Zero and Sigma Z where Sigma zero is just identity.",
            "It's also it's what happens that this answers doesn't need Sigma that so this is kind of remarkable, and that was basically the clue or hint which allowed me to solve this model in the 1st place.",
            "Observation, which followed from doing numerical experiments.",
            "So that's what I say.",
            "That's why I say, I mean, I'd like to dig in the mud, and sometimes I find some jewels in the model.",
            "So then I tried to publish and then I see.",
            "Well, maybe this could be having the right by Friday AF and his company 20 years ago, but they didn't because they didn't look at this filthy.",
            "Underground, and they only wanted to have a beautiful, simple solutions.",
            "So sometimes you know complicated things simplify later and still.",
            "Of course, also this wouldn't have been possible if one would have a computer.",
            "I mean in the 70s they didn't have computers, so now we can play with Mathematica.",
            "We can play with symbolic.",
            "Expressions you don't have to do it on paper.",
            "And then of course it can happen the price to pay is that what can happen is that you compute something and you don't understand what you've done.",
            "So then you can maybe spend 10 two years to understand what you have done.",
            "That's that's the price to pay it, and I'm not sure if this is the best way to do, but still.",
            "I mean, it's possible to make some progress.",
            "OK, so now this is the digested or distilled version of the solution.",
            "The simplest one set of 1 slide presentation.",
            "You can write it in this matrix product form.",
            "These matrices are just three diagonal matrices, but they have to be infinitely dimensional, so there is no finite dimensional presentation of these matrices which would do the job.",
            "So one has to really allow for infinite dimensional ancilla or auxiliary space and the action of this operators AOA plus and minuses.",
            "I set a zed.",
            "Zed doesn't exist because Sigma Z doesn't appear and these three operators basically are closely related to the generators of angular momentum algebra.",
            "In the isotropic case, when Delta is equal to 1, so that is the case of Heisenberg model.",
            "These are exactly the angular momentum algebra, but they correspond to a complex spin.",
            "So this is basically what I write.",
            "Here is a little bit more complicated.",
            "Mathematical object is called UQ SL2.",
            "It's a quantum deformation of angular momentum algebra.",
            "But still if Delta is equal to 1, this deformation parameter ITA is equal to 0.",
            "Then it's really just the incremental algebra.",
            "The point is that there is a parameter S here, which is just the spin.",
            "So if you teach quantum mechanics, if you have still remember quantum mechanics, you know that this is basically the matrix elements of angular momentum operators.",
            "But in quantum mechanics this as to be half integer.",
            "This is Kathy integer, then this will translate.",
            "You start from the lowest weight state and then it truncates after 2 S steps right?",
            "So we have two S plus one steps and this is the dimension of the irreducible representation of of SU-2.",
            "Now this S happens to be complex number.",
            "This actually turns out to be related to epsilon and epsilon is the noise is the boundary is a coupling to the environment.",
            "Is the flux of in and out.",
            "Particles of the environment.",
            "So it turns out that now the spin has to be related to the to the dissipation strength, which is completely imaginary.",
            "So this series would never truncate, so you need to inflict immeasurable infinite measure.",
            "Non unitary or not in mission.",
            "Representation irreducible, non unitary representation of the SQ2 or Q deformed as you do.",
            "So that's sort of in the jargon of mathematical physics, what we have here."
        ],
        [
            "OK, so now let's now move on a little bit and see what we can do with that.",
            "So that's sort of, I mean, that was sort of playing with abstract mathematical model, which might have nothing to do with reality.",
            "Might help.",
            "I mean, at least I guess in the lap of random blood they could do probably quantum Simulator, which would do the job, but I'm not sure if anyone would be so excited, because we can do this by hand or by Mathematica laptop.",
            "So the question is, can we derive anything which is physically sort of interesting from there?",
            "And yes, the idea is to derive some sort of conservation laws which might have some new physics inside.",
            "So let me now just give you a short review of local conservation laws in quantum physics.",
            "So for example.",
            "Starting from Hamiltonian, which is the simplest thing?",
            "I mean, imagine you have a quantum system or even classical one, which can be written as a sum of two body terms.",
            "So these indices just denote the sites on which this operator or observable excellent rebellion.",
            "This is the quantum or classical.",
            "If it's classical, then instead of computer you should use person bracket.",
            "So then you have continued to equation right?",
            "So we can write down the time, time evolution of a local Hamiltonian density.",
            "This is just phenomenal equation.",
            "This is just the commutator of.",
            "The whole Hamiltonian with the little age with the density you can spell out the full Hamiltonian you find there are just two terms which are not commuting, and these two terms defined what is called an energy current.",
            "These are the two terms for which these two densities don't commute among each other, right?",
            "So this is how you define an energy current.",
            "So then it would say OK, H is my conserved quantity, but also defines a local conservation law of energy.",
            "Density defines energy current.",
            "Similarly you can do with any general extensive quantity in an integrable system or in the system, which might not be completely integrable but has nontrivial conserved quantities like magnetisation for Heisenberg or particle number for Herbert and so on.",
            "So you can always write this conservation law as a sum of local densities, and then from the fact that everything should globally commute, you can really drive it or write it as a local continue to equation and this commentator again defines to densities and these two densities you would define as corresponding current densities.",
            "So you have charges and currents.",
            "Yeah, very simple.",
            "Everything is discrete, finite 1 dimensional, but that's sort of the generic picture.",
            "I have charges that sort of sums of local densities and then have currents which defined continue to equation for the charges.",
            "So I don't need to relativity.",
            "I don't need fancy fancy language to have this.",
            "It's just here."
        ],
        [
            "And now the question is what you have, what you can do with it.",
            "And for example, you want to basically go into condensed matter physics, or you want to go to transport and liquid transport.",
            "Let's see if this can be related to for some issues of quantum transport you write down, for example the coding Cooper formula, which is the standard linear response formula for conductivity as a function of Omega.",
            "Now this can be hit connectivity or energy energy transport coefficient.",
            "If Jay is an energy current, it can be spin connectivity with Jay is the spin current.",
            "It could be charged conductivity enjoys a particle.",
            "And so this is just a generic generic formula.",
            "It turns out that you could isolate sort of Delta peaked frequency equal to 0, which is called through the weight because it may happen that is Delta pick is nonvanishing an if this Delta pick is nonvanishing, then this coefficient in front can be written also in terms of Kubo formula, but now the conductivity's connectivity is not at the time integral, but it is a time average of the current current correlation function.",
            "So it's all about current current correlation functions.",
            "But if the time average is not zero, then forget about time integral right?",
            "Because time integral for sure will diverge.",
            "So to have finite conductivity first to make sure that there is no debate if there is through the weights.",
            "On the other hand, we have a signal of ballistic transport.",
            "And here I make a remark of a very inspiring paper which at least inspired me for 20 years, which was a paper by his auto Sparrow, second name.",
            "So of course you know our colleague computer promotion who proposed to apply again, and even a little bit older bound due to Missouri and Suzuki.",
            "To the estimated weight in terms of concert quantities.",
            "So what these people show that there's basically very simple kinematic bound as soon as you have conserved quantities then you have a lower bound and do the weight at any temperature.",
            "Be there is a temperature which just enters definition of the expectation value, but that's sort of that sort of very elegant, very simple identity.",
            "The only thing we have to make sure to enumerate your conserved operators and to check whether they have nonvanishing overlap with the with the current in question.",
            "Yeah.",
            "OK so I have no basically time or intention here to derive this, but it's something which can be derived again within an hour.",
            "I mean it's not.",
            "It's a very elementary thing, it could be done in the in the class."
        ],
        [
            "Graduate class.",
            "So what is the conclusion here?",
            "Conclusion is that internal systems are ballistic conductors at any temperature, unless.",
            "Unless all conserved quantities, orthogonal current operator, which might happen due to discrete symmetries, and this might generically happen.",
            "For example, it will happen in the Heisenberg model in the highest model there is a spin flip symmetry.",
            "You can flip the spin you can take.",
            "I will show you later how how it can be done and then you can show that all the conserved operators that for the oven company derived from algebraic methods that are orthogonal to the spin current because they have the opposite spin flip symmetry.",
            "So then one wonders what one can do cause numerical experiments showed that.",
            "Do the wait is finite starting from numerical work of Peter Promotion Company to America to Boston azatian techniques in which people do analytically and so on?",
            "I mean there are.",
            "There are indications that this really should be finite, even though there was no way to prove it.",
            "So what really one needs is some conservation law which breaks the parity reversal symmetry.",
            "It turns out this is related to conservation laws breaking in parity.",
            "So what we have found this exact solution of the steady state is related to what we need."
        ],
        [
            "So it turns out and then this is again something which are just flashing because it's beyond the scope of the collection.",
            "Talk to show any.",
            "Mechanism of how this can be possibly happening, but what happens is that this Cholesky factors this amplitude operators or square roots of density matrix actually form a commuting family.",
            "So for example, there are functions of some complex spin as you remember, and this complex pin is a function of epsilon, which is the environment parameter or and these guys are actually forming computing commuter commuter among themselves for any value of the spin.",
            "And one can actually show that we could take a derivative of this operator with respect to spin, complex spin and then put spin equal to 0.",
            "Then you get an operator Z which is quasi local, which is as good as any local operator in the sense that is easy dagger.",
            "Has extensive expectation value.",
            "And I forgot to stress that, but that's something which is typical for local operators, and that's all what we need if you want to insert this guy into the muscle bound because muscle bound needs this kind of objects.",
            "By linear objects in the operators and this guy should be proportional to the system size.",
            "This guy is proportional to size with squared, so this is N ^2 / N / N is constant so things becomes intensive and so it becomes non non 0.",
            "OK, so this is the guy basically which we were looking for for 25 years.",
            "For 20 years.",
            "A little less.",
            "It's 195 since 2000.",
            "Eleven 60 years.",
            "OK so and.",
            "And Moreover, I mean this guy actually OK.",
            "I mean, I haven't yet showed that this is a conservation law, but what you can do now?",
            "Basically we can plug this into the equation of motion for this operator.",
            "You find that this follows basically from the limit equation from the steady state limit.",
            "Equation is equivalent to that, namely that this operator will form out of this charge.",
            "I mean, this is just your former Commission combination has a commutator, which is just a sum of two terms difference of two times at the boundaries.",
            "So now this looks like a continued equation, right?",
            "You have a charge, but I'm sure if the charge is a difference of two currents, now these two currents are not looking at occurrence and they're looking at charge densities of charger.",
            "The identity of monetization in vineyard and picture these are like part particle densities or charge densities.",
            "So now this is like a twisted situation.",
            "You have a current like operator Q.",
            "Which plays the role of the charge and the charge.",
            "The Sigma see you want charge which plays the role of the current.",
            "So that's basically what happens, and it's kind of curious why it happens.",
            "I don't know, I mean.",
            "Still.",
            "Why and how generic it is?",
            "But at least it answers quite interesting question in this particular setup.",
            "So as I already said, this is in fact it's just the 1st order perturbative order in the steady state."
        ],
        [
            "So I think I will have to move to the end.",
            "Let me just see what this produces for our.",
            "Heisenberg model for the cosmic model.",
            "So there is this flippin flip symmetry which I mentioned which is just the product of Pauli matrices and probably X you remember is a matrix Switcher, zeros at the corners and sorry once at the corners and zero said that Agnes so just flip spin up, spin down.",
            "It's been down to speed up speed up so it turns out that all there for day of charges are commuting with P including Hamiltonian.",
            "So they are even with respect to spin reversal.",
            "But the spin current which I haven't spelled out but you can imagine spin current is author right?",
            "I mean if you flip the spin.",
            "Then the spin current runs the other way, so this pin current is out, so it's irrelevant.",
            "I mean all these standard local charges are irrelevant to the spin current.",
            "Brazil bound would not give anything if you don't introduce no new objects into the game, and here if you introduce this operator, which is also odd, then you find that the overlap with the current is not zero and then you can basically evaluate them as or bound and you get this result.",
            "So basically that's the main result of this talk.",
            "This result in weaker form appears for the first time in my paper in 2011, but in the stronger form we appeared in 2013 in the paper with an alias scheme.",
            "My PhD student at the time.",
            "This is this black curve.",
            "I mean there is the suboptimal and let's say more optimal result because this result includes more charges, not just this one, but there is a whole family depending on some complex parameter you can optimize over this complex parameter.",
            "You can optimize.",
            "You can get a larger lower bound.",
            "Now there is an interesting question.",
            "First, there is an observation at this lower bound is a fractal.",
            "That is, it's a discontinuous function of the parameter.",
            "This is following from some name, number, number theory games with the representation dimensions.",
            "Which I'm not going to go into into here, but it's interesting that you have this nowhere continuous function, right?",
            "Kind of fractal.",
            "Then the question is, is the physical transport coefficient of the model really fractal function of the parameter or is just cause it's still lower bound and the true transport coefficient is continuous?",
            "This is something which is debated.",
            "It's not clear my current opinion is that it is probably I mean.",
            "Of course it's more let's say fancy result, it's probably I would say it's probably.",
            "Saturated abound, but you may always find that someone at some point some operators which which are independent of these charges, which we take into account and still contribute to the lower bound."
        ],
        [
            "OK, so that's most of it.",
            "What I want to say.",
            "I prepare a few more slides which I will just keep which have to do with generalized Gibson sample.",
            "It turns out that there are other conserved operators which are important for the, so there is not.",
            "So the charges which are derived by for deaf and company are not all the story.",
            "So show now that the first of all they have the wrong symmetry and the odd symmetry is important for quantum transport, but the even symmetry even in the even sector the charges which are even with respect to.",
            "Quality to spin reversal.",
            "Even those charges are not complete.",
            "I mean the local charges over there are not complete in the sense that they don't basically explain the thermalization integrable system if you form a generalized Gibson sample out of this local charges you will find the gap.",
            "Sorry, I said I will skip this now, I'm just I probably just want to say that there is there was a gap.",
            "There was a nice sort of.",
            "Thriller story in the 2015.",
            "I mean, first there was in 2014 two papers, kind of two competing groups reporting there is a big problem.",
            "There is gap and then there was a paper by.",
            "This computer somehow said it's enough.",
            "Anyway, it's it was one of the one before last slide, so.",
            "So I will not show the last slide so that I don't use time, but I still want to maybe 3 minutes for questions so.",
            "So there was a paper from our group bye bye Bye Leave scheme Archimedean myself in 2015 where we construct it.",
            "We've got another idea how to construct quasi local charges, not the ones which are constructed before they don't come from the solution of the linear equation, but they still come from similar philosophy, which basically answered exactly this controversy.",
            "They close this gap.",
            "So basically when we included charges we closed the gap.",
            "So this was a series of two papers in PRL last year, first one by my students and myself and second one by Group in Amsterdam 5 and Yesler in alien skin myself, which somehow answered this question.",
            "OK so yeah I will not show you the conclusion slide you see there is.",
            "Lot of things which can be set.",
            "I'm sorry if I was a bit technical at some points.",
            "Yeah.",
            "There are many exciting questions to do still.",
            "I mean there are there is a question of how one can do these things in field theories.",
            "For example, this is discrete lattice systems.",
            "I feel safer on the lattice, but still there are interesting questions how to go to to continue models to field theories.",
            "There are interesting questions of how to go to classical integrable systems like nonlinear optics.",
            "The question how to go to more interesting models like Hubbard model?",
            "We have some interesting results for Hubbard model, but they have even more interesting questions about Hubbard model, so there are still many interesting things to do.",
            "Thank you for attention.",
            "Very briefly, what's the origin of Fractality which you have shown?",
            "I understood it's analytical solution, but can you just comment?",
            "What's the physical area?",
            "The origin is very simple.",
            "At the origin is."
        ],
        [
            "OK.",
            "Skipped it.",
            "So the origin is the following.",
            "I mean you basically what you have is you know you remember this matrices A0A plus and a minus which were used to construct the steady state.",
            "Basically the same matrices which are used to construct the operator.",
            "Yeah, if you really want to spell out the operator in terms of spin operators, you need to basically have this representation of the UQ SL2 this quantum group.",
            "And these representations are very bizarre.",
            "When Q is root of unity.",
            "And here in this critical strip this is the massless or critical strip.",
            "Here.",
            "Basically Delta can be always approximated by a closest root of unity, and it's like a real number being approximated by the rational and irrational.",
            "Because you can find two different rationals very close by with very different denominators and this means very different dimensions of the operator of the defining the operator, which means that the right hand side of the measure bound could be very sensitive to the dimension and dimension is a non smooth function of the cosine.",
            "This Delta is a cosine, π /, M and M is the dimension.",
            "Yeah.",
            "No, I don't know.",
            "I mean, that's the question.",
            "I mean, that's the physics prohibited to believe that this thing could be really a transport coefficient.",
            "That's another question which I don't think I think it does not.",
            "But for example, why I think it does not because I'm used to see results.",
            "I mean I have in my previous life working on dynamical systems of a single particle people have discussed, for example, fractal diffusion coefficients.",
            "If you have this simple sort of Maps right, depending on one parameter people have looked at the diffusion constant as a function of.",
            "Meter and they found that this factor is peerless parand.",
            "I mean, there was there was some community which was working on that in the mid 90s or early 90s and so.",
            "So if you don't find that strange, I don't find this strange either, but.",
            "Yeah, but you see I mean the upper curve is less structured in the lower curve, so it means that I'm smoothing it somehow.",
            "I'm I'm using more more information.",
            "On different scale yeah.",
            "Knowing the steady state exactly, is there any chance that you can learn something?",
            "Simple exactly good approximation for the relaxation to the study steady state, because normally nature doesn't start in a steady store.",
            "That's a very good question.",
            "It's also very difficult one.",
            "So far we have no results on the relaxation dynamics to the steady state we are working.",
            "We have been working since the last since 2011.",
            "We have been trying several occasions to move to this direction.",
            "Always failed.",
            "This type of problems are somehow difficult, I mean.",
            "They are difficult in the sense that you never know whether you're going to succeed or not.",
            "So what you do, typically you make a kick for few months.",
            "You either find a solution or you give up after few months, but you don't give up forever.",
            "I mean just repeat it after you get a new idea.",
            "Maybe in a year or two.",
            "So.",
            "So we definitely continue with this endeavors, and that's a very good.",
            "I mean.",
            "For example, there is this.",
            "Their results for exclusion processes on the relaxation dynamics they have to do with finding appropriate better equations, because to find the full spectrum of the revillon you have to find appropriate better equations.",
            "And here we don't have a clue how the structure of this medication should be.",
            "So.",
            "Yeah.",
            "We are working with very slow now on the model which is related to that on this classical deterministic model with stochastic boundaries.",
            "This is probably the simplest model and for this model I have the strongest hope that we'll be able to find the full spectrum.",
            "That's why I like it.",
            "It's about the simplest, even more bizarre in some sense in terms of simplicity.",
            "Just before we thank you for the second time, I have a very simple question so you were talking about your results in East documents.",
            "Results about the spin, spin correlation and I imagine that there's a handwaving interpretation of you know why does the spin spin correlation function beyond the phase transition becomes so elaborated?",
            "So what's the interpretation?",
            "So the interpretation as I I tried to give you, but I was probably too quick and not too too explicit.",
            "But you write out.",
            "Basically, you write the equation of motion for the covariances, which is basically a handful situation.",
            "And the code of the parameter K square wave number square.",
            "Is it simply the difference of magnetic field to the critical field?",
            "So and then you see if it's positive you have real ways.",
            "When it's negative, K squared is negative is imaginary, have been established, have decay of correlations.",
            "OK, now I'm not sure if you can see that this is a physical explanation, but that's something that you can really do.",
            "You really see what where things come from.",
            "So basically I call this understanding at the end, but.",
            "Let's thank Professor Putin again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So yeah, when I got invitation to give a colloquium in your Stephen Institute, of course.",
                    "label": 0
                },
                {
                    "sent": "Somehow I was pleased and proud to be able to present my work here.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, it's always a bit cumbersome to give us sort of a general colloquium about something which is quite technical and in essence, but still I try to maybe.",
                    "label": 0
                },
                {
                    "sent": "Go leave it behind.",
                    "label": 0
                },
                {
                    "sent": "The motivation for doing all these technicalities and try to just flash on some main results or some main mechanisms or something which I could maybe really explain so I will not go basically through all the stuff that we did in the last years, but maybe to some of it with the common denominator that we are that here I'm covering sort of an equilibrium quantum physics of exactly solvable models, so that's why I'm turning this exact steps over through nonequivalent.",
                    "label": 0
                },
                {
                    "sent": "Physics.",
                    "label": 0
                },
                {
                    "sent": "So first.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I make a sort of reference to an after dinner speech of this guy on the left a little bit.",
                    "label": 0
                },
                {
                    "sent": "But yeah, who is one of the?",
                    "label": 0
                },
                {
                    "sent": "Probably most influential mathematical physicist that is of these days.",
                    "label": 0
                },
                {
                    "sent": "And he's sort of.",
                    "label": 0
                },
                {
                    "sent": "He can be considered as a mathematical physicist theoretical physicist depending on your taste.",
                    "label": 0
                },
                {
                    "sent": "And the guy on the right is Phillip Anderson.",
                    "label": 0
                },
                {
                    "sent": "And there was this after dinner speech after a conference in Rome in 2010.",
                    "label": 0
                },
                {
                    "sent": "When I look for the AFC at well.",
                    "label": 0
                },
                {
                    "sent": "I mean he wanted to basically explain why is he doing what he's doing, what he's doing and the way that he's doing things.",
                    "label": 0
                },
                {
                    "sent": "I mean how basically can view different type of theoretical physicists?",
                    "label": 0
                },
                {
                    "sent": "How I mean, what is basically the perspective that they have to to get themselves engaged into theoretical physics.",
                    "label": 0
                },
                {
                    "sent": "So basically I mean you can classify I mean.",
                    "label": 0
                },
                {
                    "sent": "Because, you know, you can say OK.",
                    "label": 0
                },
                {
                    "sent": "I mean, this is like mathematics.",
                    "label": 0
                },
                {
                    "sent": "I mean you can say well, I mean you are working with abstract models.",
                    "label": 0
                },
                {
                    "sent": "Why do you care about abstract models?",
                    "label": 0
                },
                {
                    "sent": "I mean sometimes these models are very far from reality in the next couple of slides I'd like to show you that basically we are nowadays witnessing experiments where things are sort of also realizable in the lapse.",
                    "label": 0
                },
                {
                    "sent": "But that's again, it's not.",
                    "label": 0
                },
                {
                    "sent": "So maybe this doesn't increase motivations of mathematical feels so much it increases basically the attention of the of the Community.",
                    "label": 0
                },
                {
                    "sent": "To look at these results that mathematical physicists work on.",
                    "label": 0
                },
                {
                    "sent": "But anyway, so basically once per day of set, I mean that basically there are two ways to to to to to do physics.",
                    "label": 0
                },
                {
                    "sent": "One way is basically not the way that we are taught.",
                    "label": 0
                },
                {
                    "sent": "You know at I mean this is not a physics thesis way.",
                    "label": 0
                },
                {
                    "sent": "This is basically mathematicians or whatever I mean.",
                    "label": 0
                },
                {
                    "sent": "Or maybe string theorists way whatever I mean, you start from some basic principles, some beautiful symmetries, conservation laws which postulate.",
                    "label": 1
                },
                {
                    "sent": "And then from this you derive models and then from there you drive phenomenal.",
                    "label": 0
                },
                {
                    "sent": "Lodging, you check whether you see these in the nature and then of course what species is doing.",
                    "label": 0
                },
                {
                    "sent": "This is typical for, let's say, condensed matter physics, which is represented by.",
                    "label": 0
                },
                {
                    "sent": "Let's say this guy on the right.",
                    "label": 0
                },
                {
                    "sent": "I mean you start from phenology.",
                    "label": 0
                },
                {
                    "sent": "Observe how things are in nature.",
                    "label": 0
                },
                {
                    "sent": "You deduce effects general effects.",
                    "label": 0
                },
                {
                    "sent": "From that you make models.",
                    "label": 0
                },
                {
                    "sent": "Then you make simulations.",
                    "label": 0
                },
                {
                    "sent": "Nowadays you have good computers.",
                    "label": 0
                },
                {
                    "sent": "You can make simulations of models.",
                    "label": 0
                },
                {
                    "sent": "And from there you can deduce general principles, symmetries, conservation laws and so then you can understand.",
                    "label": 1
                },
                {
                    "sent": "You say I now understand nature.",
                    "label": 0
                },
                {
                    "sent": "Then of course if the two things come together, it's very nice, But basically this is how we.",
                    "label": 0
                },
                {
                    "sent": "Have to do things, but sometimes people like for death can also do it top down.",
                    "label": 0
                },
                {
                    "sent": "And this is, I would say, more typical for high energy physics or high energy theory I would say.",
                    "label": 0
                },
                {
                    "sent": "And this is more typical for condensed matter physics.",
                    "label": 0
                },
                {
                    "sent": "And I'm definitely sort of.",
                    "label": 0
                },
                {
                    "sent": "My perspective is definitely with with Anderson, not, but yeah, so that's sort of.",
                    "label": 0
                },
                {
                    "sent": "I mean, if I try to identify what I'm doing is.",
                    "label": 0
                },
                {
                    "sent": "I mean I'm doing mathematical physics, but from condensed matter perspective I mean I really like to dig in the mud and try to find Joules if I can.",
                    "label": 0
                },
                {
                    "sent": "And then I try to Polish them and see if they have some symmetries, some principles and so on.",
                    "label": 0
                },
                {
                    "sent": "So and I will try to maybe show you.",
                    "label": 0
                },
                {
                    "sent": "I mean this this approach I was kind of a bit ashamed of this approach for awhile.",
                    "label": 0
                },
                {
                    "sent": "I mean because I was interested in mathematical physics, but I was not able to force myself to go top down.",
                    "label": 0
                },
                {
                    "sent": "To really go with you.",
                    "label": 0
                },
                {
                    "sent": "So and then it turns out that you can basically find some interesting things even if you go bottom up.",
                    "label": 0
                },
                {
                    "sent": "I mean not only that you can do simulations, but you can go basically back up, back up to some basic principles.",
                    "label": 0
                },
                {
                    "sent": "You can find some things which appear to be kind of elementary.",
                    "label": 0
                },
                {
                    "sent": "Basically you so.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so now let me now just give you some motivating slides.",
                    "label": 0
                },
                {
                    "sent": "I mean, on this nonequilibrium dynamics, as I said, not including dynamics these days is a kind of a hot topic.",
                    "label": 0
                },
                {
                    "sent": "Also because of this huge advancements of experiments, for example.",
                    "label": 0
                },
                {
                    "sent": "I mean it started maybe before before this paper, but this paper certainly was very influential.",
                    "label": 0
                },
                {
                    "sent": "The paper of the Group of David Wise from Penn State of this so called Newton's Cradle.",
                    "label": 0
                },
                {
                    "sent": "I mean, this is basically the dynamics of both Arnstein condensate of 87 rubidium atoms.",
                    "label": 0
                },
                {
                    "sent": "Which this is kind of a snapshot sort of cartoon.",
                    "label": 0
                },
                {
                    "sent": "This is time.",
                    "label": 0
                },
                {
                    "sent": "This is space.",
                    "label": 0
                },
                {
                    "sent": "They prepared two both Langston condensates in the harmonic trap.",
                    "label": 0
                },
                {
                    "sent": "At some distance and then you let them go.",
                    "label": 0
                },
                {
                    "sent": "Basically that is like 2 pendola which collide and then they they they pounds, they collided bounds, they collided bounds.",
                    "label": 0
                },
                {
                    "sent": "So basically with the sort of control and precision of 2006 this looks like a nice realization of Scrabble, right when these people remain very much excited about it.",
                    "label": 0
                },
                {
                    "sent": "Nowadays the control is even much more precise.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And people can address even more fundamental basic questions for my experiments.",
                    "label": 0
                },
                {
                    "sent": "Sorry this is not reference.",
                    "label": 0
                },
                {
                    "sent": "Should not yet appear.",
                    "label": 0
                },
                {
                    "sent": "Sorry for that.",
                    "label": 0
                },
                {
                    "sent": "For example, one of the basic principles that people can now address in the experiment is the principle of.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's the issue of Thermalization enclosed many body quantum systems.",
                    "label": 0
                },
                {
                    "sent": "The question here is, I mean I have a complex quantum system, for example, but it might be integrable.",
                    "label": 0
                },
                {
                    "sent": "It might be non trivial in the sense that it has conserved quantities, not only the energy, but maybe some other conserved quantities.",
                    "label": 0
                },
                {
                    "sent": "For example, I mean it can have particle number which is kind of still textbook.",
                    "label": 0
                },
                {
                    "sent": "Yeah, then you can generalize Gibson some, but then you have grand Canonical example, but you can have other conserved quantities which are non trivial and then sort of the.",
                    "label": 0
                },
                {
                    "sent": "The conjecture is that your.",
                    "label": 0
                },
                {
                    "sent": "Density matrix should somehow converge in some spirit which we have to be really explained in detail to a generalized keeps generalized groups and that's yeah.",
                    "label": 0
                },
                {
                    "sent": "And this generalized gives answers is basically the state which is described by conserved operators, one of them being Hamiltonian with others and their associated LaGrange multipliers.",
                    "label": 0
                },
                {
                    "sent": "Which one of them is called temperature.",
                    "label": 0
                },
                {
                    "sent": "The others are sometimes called generalized temperatures and OK, and this is an ansatz.",
                    "label": 0
                },
                {
                    "sent": "It follows from several general principles.",
                    "label": 0
                },
                {
                    "sent": "For example, one principle is maximum maximizing entropy.",
                    "label": 0
                },
                {
                    "sent": "You can ask, I mean.",
                    "label": 0
                },
                {
                    "sent": "Under the conditions that my constants of motion are fixed or are constant, what is the state which maximizes the entropy?",
                    "label": 0
                },
                {
                    "sent": "And that's exactly this state.",
                    "label": 0
                },
                {
                    "sent": "And OK, I mean this is sort of the.",
                    "label": 0
                },
                {
                    "sent": "Principle, which is very difficult to prove.",
                    "label": 0
                },
                {
                    "sent": "I mean it's very easy to explain.",
                    "label": 0
                },
                {
                    "sent": "It's very easy to motivate.",
                    "label": 0
                },
                {
                    "sent": "It's very, very difficult to prove, but these days can be seen.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The lab, I mean this is the experiment that the reference refers to.",
                    "label": 0
                },
                {
                    "sent": "I will not go into details of experiments.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry for that I'm not able to do that.",
                    "label": 0
                },
                {
                    "sent": "That's one thing.",
                    "label": 0
                },
                {
                    "sent": "And the other thing is I don't have time.",
                    "label": 0
                },
                {
                    "sent": "It's just I have flash from some slides from this nature and science papers, which appeared in last few years.",
                    "label": 0
                },
                {
                    "sent": "We show, for example, this paper showed.",
                    "label": 0
                },
                {
                    "sent": "I mean, this was the paper of green cattle and science in 2012, where basically they they found this pre thermalized state which is.",
                    "label": 0
                },
                {
                    "sent": "I mean, first of all, I mean, you expect of course that generic system will go to thermostate because you don't expect the generic system would be integrable.",
                    "label": 0
                },
                {
                    "sent": "But what is remarkable is that it's basically very close to an integrable system, and that physics behaves differently from a physics of a generic system.",
                    "label": 0
                },
                {
                    "sent": "I mean, you find this so called criminalization plateau and then there is some sort of order parameter if you wish, which discriminates between thermal between generalized keeps.",
                    "label": 0
                },
                {
                    "sent": "So there is this blue points here which stay there for awhile.",
                    "label": 0
                },
                {
                    "sent": "So there is OK some sketch how experiments do it and split the initial contact in two to almost equal pieces and then they do time evolution.",
                    "label": 0
                },
                {
                    "sent": "Then they do some interference phase interference experiments and then they have some definite expectations to what should happen after a while after the state would be thermal and then they check against this expectation and they find something which is consistent with pre thermal or generalized groups.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What is much more remarkable is this experiment, which is newer.",
                    "label": 0
                },
                {
                    "sent": "Which is basically it's reviewed in the recent review paper by Group of York Schmitmeyer from Vienna.",
                    "label": 0
                },
                {
                    "sent": "It's experiment, made by this group, where they have measured the two point function in the preterm Allstate, and they compared it to the generalized groups and they found remarkable agreements.",
                    "label": 0
                },
                {
                    "sent": "For example, this is the two point function.",
                    "label": 0
                },
                {
                    "sent": "This is the phase phase.",
                    "label": 0
                },
                {
                    "sent": "They find the measure is the phase.",
                    "label": 0
                },
                {
                    "sent": "Coherence is the phase correlations so that the two points phase correlations in the condensate.",
                    "label": 0
                },
                {
                    "sent": "And then compare it theory and experiment and find basically somehow remarkably good agreement.",
                    "label": 0
                },
                {
                    "sent": "With the assumption of the generalized keeps I'm here, the model is the so called.",
                    "label": 0
                },
                {
                    "sent": "Linear model that is the integral model of Bowser gas with contact Delta contact interaction.",
                    "label": 0
                },
                {
                    "sent": "So that's sort of the sort of quite realistic model which describes called atoms in the lab.",
                    "label": 0
                },
                {
                    "sent": "And of course, the real system is hissem imperfections.",
                    "label": 0
                },
                {
                    "sent": "It is not exactly the integral linear gas interaction is a bit more complicated than just the contact is isotropic one, so still it seems that this small perturbations don't really spoil the story.",
                    "label": 0
                },
                {
                    "sent": "So what we find is not only agreement of two point functions defined agreement of 4.6 point, 10 point functions even after training.",
                    "label": 0
                },
                {
                    "sent": "Markham",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, and then you can really do dynamics.",
                    "label": 0
                },
                {
                    "sent": "For example, this is.",
                    "label": 0
                },
                {
                    "sent": "There's another paper from 2013 of the Group of Immanuel Block Block, where they have prepared they have catched some continuous array of atoms which they put in the optical lattice, and then they can find everything with the harmonic trap.",
                    "label": 0
                },
                {
                    "sent": "Then they release the trap, so then then again this guy.",
                    "label": 0
                },
                {
                    "sent": "Basically these gases described by Bosa Bosa Hubbard Hamiltonian and this atoms would basically allow.",
                    "label": 0
                },
                {
                    "sent": "Be allowed to tunnel through their barriers using simple coping mechanism and what you would see then there.",
                    "label": 0
                },
                {
                    "sent": "I mean this would be again a film where one axis is time, the other space of the density of the concept content that you see.",
                    "label": 0
                },
                {
                    "sent": "Again that you have this.",
                    "label": 0
                },
                {
                    "sent": "Spreading which we can predict, for example, of its state of the art.",
                    "label": 0
                },
                {
                    "sent": "Numerical techniques like density matrix, organization group.",
                    "label": 0
                },
                {
                    "sent": "So this is experiment.",
                    "label": 0
                },
                {
                    "sent": "This is Thierry again you can find quite nice agreement.",
                    "label": 0
                },
                {
                    "sent": "So basically there are nowadays witnessing sort of the stage of advancement of experimental quantum physics where you can really do.",
                    "label": 0
                },
                {
                    "sent": "Relations with the individual.",
                    "label": 0
                },
                {
                    "sent": "Many body systems which can be then tested with state of the art numerical methods and it's not clear it's not well still.",
                    "label": 0
                },
                {
                    "sent": "I think numerical methods are somehow better, but we are kind of I mean.",
                    "label": 0
                },
                {
                    "sent": "Probably it's just a question of time where numerics will no longer be able to catch up, at least not in more than one dimension.",
                    "label": 0
                },
                {
                    "sent": "One dimension we have sort of metrics organization group, which is which is very good.",
                    "label": 0
                },
                {
                    "sent": "You can basically well it doesn't work very well for the time evolution, but still.",
                    "label": 0
                },
                {
                    "sent": "I guess it will compete with experiments, but in more than one dimension.",
                    "label": 0
                },
                {
                    "sent": "Of course we are.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, and then you can do even what you can do basically.",
                    "label": 0
                },
                {
                    "sent": "Furthermore, is to treat open quantum systems.",
                    "label": 1
                },
                {
                    "sent": "That is systems with environment.",
                    "label": 0
                },
                {
                    "sent": "For example, this.",
                    "label": 1
                },
                {
                    "sent": "Usually this can be done more efficiently with the so called ion traps.",
                    "label": 0
                },
                {
                    "sent": "Here I guess state of the art experiments are have been done in Innsbruck in the Group of random blood.",
                    "label": 1
                },
                {
                    "sent": "Again I will not go through any of the details, just copy a figure of the of the nature paper from 2011 where they explain how they can basically.",
                    "label": 0
                },
                {
                    "sent": "Basically they can manipulate any, let's say mixed state density matrix of a many body system of an ion of an iron chain with which they can do basically quantum computation they can prepare.",
                    "label": 0
                },
                {
                    "sent": "States in an arbitrary desired state, and so on.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so now let me go basically to a parody in which we are working on.",
                    "label": 0
                },
                {
                    "sent": "Which is the very particular part of the game, so I will just focus on this one.",
                    "label": 0
                },
                {
                    "sent": "It's probably at least something which occupies 70% of our research time in our group.",
                    "label": 0
                },
                {
                    "sent": "And this is the boundary driven open quantum system.",
                    "label": 0
                },
                {
                    "sent": "It doesn't have to be quantum, I will show you also some classical.",
                    "label": 0
                },
                {
                    "sent": "I will continue with some classical physics, but idea is the following.",
                    "label": 0
                },
                {
                    "sent": "I mean, we're trying to basically understand what happens with the systems in one dimension.",
                    "label": 0
                },
                {
                    "sent": "So let's forget about really, really interesting really important questions in 2D.",
                    "label": 0
                },
                {
                    "sent": "Let's try first to understand what's going on in one D, because this is already quite interesting and you have a strongly interacting system.",
                    "label": 0
                },
                {
                    "sent": "But interaction are supposed to be local and.",
                    "label": 0
                },
                {
                    "sent": "You assume now that interaction with the environment only takes place through the boundaries.",
                    "label": 0
                },
                {
                    "sent": "There is only the boundary.",
                    "label": 0
                },
                {
                    "sent": "Quantum particles are immersed into some reservoirs and they experience transitions.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "I mean, they basically can become.",
                    "label": 0
                },
                {
                    "sent": "Basically the environment produces the coherence or the state of the system becomes non pure after interacting with the environment.",
                    "label": 0
                },
                {
                    "sent": "I mean the idea is of course you can treat an infinite environment or large environment.",
                    "label": 0
                },
                {
                    "sent": "You can treat the whole evolution completely unitary fashion and then you can trace over the environment and then what you get at the end is there.",
                    "label": 0
                },
                {
                    "sent": "Effective so called Master equation which describes the density matrix of the system in terms of the unitary part which has to do with interaction in the bug and dissipative part, which has to do interactions near the boundaries where the system interacts with the environment.",
                    "label": 0
                },
                {
                    "sent": "So I will not, of course explain this equation.",
                    "label": 0
                },
                {
                    "sent": "I mean that just flushing it out, that is the Canonical equation which describes the so called Markov Markovian dynamics of an open quantum system which interacts with the environment.",
                    "label": 0
                },
                {
                    "sent": "So I mean all that you want to know about the system is parameterized by the Hamiltonian, which is the interactions the coherent interactions.",
                    "label": 0
                },
                {
                    "sent": "Many body interactions if you want.",
                    "label": 0
                },
                {
                    "sent": "And this operators which are called L sub new which are called sometimes Linda operators or the jump operators which describes interactions with environment.",
                    "label": 0
                },
                {
                    "sent": "And in our sort of boundary driven paradigm, people assume that Hamiltonian is the sum of local terms.",
                    "label": 0
                },
                {
                    "sent": "So Hamiltonian only contains terms which contain interaction within nearest neighbors.",
                    "label": 0
                },
                {
                    "sent": "I mean, that's sort of the.",
                    "label": 0
                },
                {
                    "sent": "Example of local interactions.",
                    "label": 0
                },
                {
                    "sent": "It could be that Hamiltonian will contain terms which we have 345 particle terms, but this will just increase technical complications, not the conceptual one.",
                    "label": 0
                },
                {
                    "sent": "So for conceptual simplicity we only consider 2 body terms in the bug and I and then the boundaries.",
                    "label": 0
                },
                {
                    "sent": "We also consider only local jump operators, so this will be like measuring.",
                    "label": 0
                },
                {
                    "sent": "I mean, you can imagine this.",
                    "label": 0
                },
                {
                    "sent": "Basically we can realize this protocol by measuring by stepwise measuring.",
                    "label": 0
                },
                {
                    "sent": "So what you can say is each instance of time, let's say DT.",
                    "label": 0
                },
                {
                    "sent": "I mean, after each infinitesimal distance of time.",
                    "label": 0
                },
                {
                    "sent": "But I have to be careful little bit with scaling of the strength and time time, time lapse between measurements.",
                    "label": 0
                },
                {
                    "sent": "One measures the boundary boundary particles and one measure some observable of the boundary particle and then the system when it's measured.",
                    "label": 0
                },
                {
                    "sent": "Then it changes state somehow.",
                    "label": 0
                },
                {
                    "sent": "Can experience quantum jump depending on the result of the measurement and then so you can write up basically the master equation which describes this unitary evolution plus the measurement of the environment.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's just the general setup and before going into any sort of examples that we have been working on, let me just go.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To A to a system which is much more easy to explain, which is much more common in too much older, which is the classical system of the same sort.",
                    "label": 0
                },
                {
                    "sent": "It is a classical boundary driven paradigm, which is where particles again are localized until local interacting.",
                    "label": 0
                },
                {
                    "sent": "But there are stochastic, they're classical classical stochastic particles, so this is the so called simple exclusion process.",
                    "label": 0
                },
                {
                    "sent": "So this has been around, at least, I think since 1970 and it has been exactly solved in the beginning of 1990s.",
                    "label": 0
                },
                {
                    "sent": "And the algebraic nature of this solution can be thought as to be quite related to the algebraic aspects of the solutions that we are working on these days.",
                    "label": 0
                },
                {
                    "sent": "Still, the connections are not completely clarified, so it's still kind of interesting, but let me just, you know, for the motivation, I mean, let me try to just move on with this simple model.",
                    "label": 0
                },
                {
                    "sent": "So this model is, as I say, it's a simple exclusion process.",
                    "label": 1
                },
                {
                    "sent": "So imagine you have L sites.",
                    "label": 0
                },
                {
                    "sent": "Again, this good sites particles which are like balls which occupy sites or sites are either either occupied or empty.",
                    "label": 0
                },
                {
                    "sent": "And then this is static model.",
                    "label": 0
                },
                {
                    "sent": "So at each instance of time, let's say DT, there is a finite probability or probability rate to part for each ball to hop to the right or to the left there is a symmetry.",
                    "label": 0
                },
                {
                    "sent": "So let's let's let's normalize the hopping rate to the right one.",
                    "label": 0
                },
                {
                    "sent": "Then there is some Q which is between zero and Infinity probability, right that particle hops to the left and then there are some rates Alpha, beta, gamma, Delta for particles to hop in and hop out of the system.",
                    "label": 0
                },
                {
                    "sent": "So there is this Alpha which is injection probability to hop from the left to the system.",
                    "label": 0
                },
                {
                    "sent": "Beta is the source ejection or absorption probability for particle on the right to exit and so on for gamma and Delta.",
                    "label": 0
                },
                {
                    "sent": "So this is a well defined model.",
                    "label": 0
                },
                {
                    "sent": "This is if you want to verify model in so-called classical Markov chains.",
                    "label": 0
                },
                {
                    "sent": "It's a classical Markov chain.",
                    "label": 0
                },
                {
                    "sent": "It's a many body classical Markov chain, so the total in sample of all states comprises of two to the L states.",
                    "label": 0
                },
                {
                    "sent": "There is L sides.",
                    "label": 0
                },
                {
                    "sent": "Each side can be empty or occupied, so it's two to the El possible states, so it's a huge matrix if you want apply to probability state vector and if you are looking at a steady state and this is mainly what we're doing, we are wondering what is the steady state of this of this dynamics.",
                    "label": 1
                },
                {
                    "sent": "An update can be thought as a 000 eigenvalue eigenvector of this Markov matrix.",
                    "label": 0
                },
                {
                    "sent": "So it turns out that this problem is actually quite tightly related to a problem of quantum spin chains and fatia, for example, and his school who basically started this.",
                    "label": 0
                },
                {
                    "sent": "Procedure of.",
                    "label": 0
                },
                {
                    "sent": "Quantum integrability in the 1970s.",
                    "label": 0
                },
                {
                    "sent": "One of the problematic models there is a Heisenberg model which I will go into and turns out of.",
                    "label": 0
                },
                {
                    "sent": "This matrix is closely related to the Hamiltonian of Heisenberg model.",
                    "label": 0
                },
                {
                    "sent": "Actually it is the Hamiltonian of Heisenberg model.",
                    "label": 0
                },
                {
                    "sent": "Even though this has nothing to do with quantum mechanics, but it has.",
                    "label": 0
                },
                {
                    "sent": "But the fact that this is basically related to quantum Hamiltonians of course brings in the whole machinery of methods of exactly solvable systems into the business of classical.",
                    "label": 1
                },
                {
                    "sent": "Exhibition processes this model actually is interesting from the point of view of applications in in.",
                    "label": 0
                },
                {
                    "sent": "In biophysics in chemical physics, in that in the asymmetric version of this model, completely isometric version, totally asymmetric version is interesting also to model traffic flow and traffic jams and so on.",
                    "label": 0
                },
                {
                    "sent": "For example, just to flash how this I mean how the most elegant?",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Solution of this model looks which I can write down into lines on the screen.",
                    "label": 0
                },
                {
                    "sent": "This solution has been put forward by in this seminar paper by the read I'm coworkers in 90, three and this solution puts forward an ansatz which is amazingly successful.",
                    "label": 0
                },
                {
                    "sent": "The so called matrix product answers.",
                    "label": 1
                },
                {
                    "sent": "So, so the idea is the following.",
                    "label": 0
                },
                {
                    "sent": "I mean, this is something we should try first.",
                    "label": 0
                },
                {
                    "sent": "I mean this is a generic answer which works in one dimension and so far all the models that are exactly solved in one dimension can be in this way or another related to matrix product and set.",
                    "label": 0
                },
                {
                    "sent": "So that's the most useful mathematical concept you can imagine in many body physics or one dimension, classical and quantum.",
                    "label": 0
                },
                {
                    "sent": "So what you should do?",
                    "label": 0
                },
                {
                    "sent": "I mean you have so many bodies state, and in this case this many body state is called probability state vector.",
                    "label": 1
                },
                {
                    "sent": "It depends on bits which are just occupation numbers of this classical balls, stochastic balls and you can make an answer saying that this probability state is simply a product of matrices.",
                    "label": 0
                },
                {
                    "sent": "There are two matrices, a zero and a one.",
                    "label": 0
                },
                {
                    "sent": "This in this is R zero and one sandwich between two states.",
                    "label": 0
                },
                {
                    "sent": "You write, you write this in if you want.",
                    "label": 0
                },
                {
                    "sent": "If you like quantum notation, you can write this in.",
                    "label": 0
                },
                {
                    "sent": "The Dirac notation doesn't matter.",
                    "label": 0
                },
                {
                    "sent": "I mean there is of course some Hilbert space which has nothing to do with physics in which these matrices are represented, in which these days living.",
                    "label": 0
                },
                {
                    "sent": "You don't care yet about what is really concrete representation of these matrices.",
                    "label": 0
                },
                {
                    "sent": "You just plug these answers into the equations of motion if you want into the expression for this matrix M and you ask for the equivalent condition, or for the sufficient condition for the steady state, it turns out that a sufficient condition for the steady state that is sufficient condition for this equation is comprised of two lines.",
                    "label": 1
                },
                {
                    "sent": "The first line is the bulk condition, which simply gives you the.",
                    "label": 0
                },
                {
                    "sent": "You can isolate that.",
                    "label": 0
                },
                {
                    "sent": "I mean, that's something I have not done here on the slide, but that's something which requires maybe an hour of work, not more.",
                    "label": 0
                },
                {
                    "sent": "To isolate this condition.",
                    "label": 0
                },
                {
                    "sent": "And it turns out, this condition is remarkably beautiful from mathematical point of view.",
                    "label": 0
                },
                {
                    "sent": "Basically tells you that this commutator of these two matrices or Q commutator is Q is related again to some mathematical physics of Q deformations.",
                    "label": 0
                },
                {
                    "sent": "And so you can, instead of writing commentators, you can write Q. Commentators, deform commentators and the commutator of these two matrices is given as a combination of these two matrices, and there are boundary conditions which follow from which basically put constraints on the boundary States and this boundary conditions of course involve these two.",
                    "label": 1
                },
                {
                    "sent": "These four parameters here.",
                    "label": 0
                },
                {
                    "sent": "And it turns out that this is all that you need in order to produce any.",
                    "label": 0
                },
                {
                    "sent": "Correlation function in the steady state in the non equilibrium steady state you don't have to write spell out these matrices explicitly.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And for example.",
                    "label": 0
                },
                {
                    "sent": "And there are two particular instances of this model which are kind of interesting or simple to discuss.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One of them is where these hopping greater symmetric work is equal to 1.",
                    "label": 0
                },
                {
                    "sent": "Then this is a simple model of diffusion.",
                    "label": 0
                },
                {
                    "sent": "It turns out and if you look at the steady state and the steady state would be simply obeying the fixed law, there would be a gradient of density and that would be a current of particles and current of particles will be proportional to the density.",
                    "label": 0
                },
                {
                    "sent": "So it's a simplest statistical nuclear statistica mechanics.",
                    "label": 0
                },
                {
                    "sent": "You can think of for diffusive system, but then you can also put a bias.",
                    "label": 0
                },
                {
                    "sent": "For example you can put Q different from one.",
                    "label": 0
                },
                {
                    "sent": "Then this would be like a bias in the bar, could be some push.",
                    "label": 0
                },
                {
                    "sent": "For example, you can put Q equal to 0.",
                    "label": 0
                },
                {
                    "sent": "Then this would be like a dynamics of cars on the highway.",
                    "label": 0
                },
                {
                    "sent": "They have some average velocity which is characterized by this rate one, but then there is density an if density is too big then there are phase transitions there, traffic jams and then.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This can be characterized by this phase diagram.",
                    "label": 1
                },
                {
                    "sent": "So for example, this is the so called task, totally asymmetric solution process, where Q is equal to 0.",
                    "label": 0
                },
                {
                    "sent": "Then there are basically the one has this simple phase diagram.",
                    "label": 0
                },
                {
                    "sent": "There are three phases where when you push hard enough, there are just two parameters.",
                    "label": 0
                },
                {
                    "sent": "Now in beta, right?",
                    "label": 1
                },
                {
                    "sent": "Because gamma and Delta don't make sense here because you only go to the right, so there is Alpha which is the flux of cars from CTA beta, which is the absorption rate of cars to CTB or a garage or whatever and then theater.",
                    "label": 0
                },
                {
                    "sent": "People want to go to the theater, for example, and then you want to know whether there will be a traffic jam.",
                    "label": 0
                },
                {
                    "sent": "Just take just use the parameters and look at the phase diagram.",
                    "label": 1
                },
                {
                    "sent": "We see that there is a different phases.",
                    "label": 0
                },
                {
                    "sent": "There is a nice phase where.",
                    "label": 1
                },
                {
                    "sent": "Give you achieve maximal flux maximum current, but then there is a phrase of high density which is basically traffic jam face of low density and there are kinks.",
                    "label": 1
                },
                {
                    "sent": "This domain walls between different phases which are rather generic.",
                    "label": 0
                },
                {
                    "sent": "Here for example low density, high density domain wall or maximum current high density during war.",
                    "label": 0
                },
                {
                    "sent": "Which at the end goes to a maximum high density.",
                    "label": 0
                },
                {
                    "sent": "After that I mean this domain words move very slowly, so there is.",
                    "label": 0
                },
                {
                    "sent": "I mean, sometimes you find exponential long times for after which this relax is to really.",
                    "label": 0
                },
                {
                    "sent": "Depending how close you are to face boundary and so on.",
                    "label": 0
                },
                {
                    "sent": "OK, so then I mean this is kind of a paradigm of nonequilibrium quantum phase transition.",
                    "label": 0
                },
                {
                    "sent": "So there's the model which people discuss.",
                    "label": 1
                },
                {
                    "sent": "I mean often or most of the time when they speak about nonequilibrium quantum phase transitions.",
                    "label": 0
                },
                {
                    "sent": "It's classical statistical mechanics.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So then there's a model not related to that, but sort of could be inspired by that which we have just worked out with my friend Carlos Mejia Monastero in.",
                    "label": 0
                },
                {
                    "sent": "In a few months ago, basically, which is a caricature of another type of para digam, which is again classical.",
                    "label": 0
                },
                {
                    "sent": "For example, suppose you don't want to have stochastic dynamic.",
                    "label": 0
                },
                {
                    "sent": "Suppose you want to know what deterministic dynamics that realistic anybody dynamics does.",
                    "label": 0
                },
                {
                    "sent": "If you push in or push out particles with some rates.",
                    "label": 0
                },
                {
                    "sent": "So with some stochastic boundary.",
                    "label": 0
                },
                {
                    "sent": "So imagine the environment is a big thing.",
                    "label": 0
                },
                {
                    "sent": "Environment has lots of entropy, so environment can be considered as a stochastic reservoir and particles can come in and come out with some uncorrelated ways.",
                    "label": 0
                },
                {
                    "sent": "But still the interior of the.",
                    "label": 0
                },
                {
                    "sent": "System is purely deterministic.",
                    "label": 0
                },
                {
                    "sent": "There are well defined models of deterministic dynamics which are many body which are strongly correlated or strongly interacting.",
                    "label": 0
                },
                {
                    "sent": "So one of them is for example this cell automaton which I don't go into detail here.",
                    "label": 0
                },
                {
                    "sent": "This is just a flash to know to know that these things can be done.",
                    "label": 0
                },
                {
                    "sent": "For example in this for the people who are interested in high energy physics this can be understood as a simplest model of relativistic quantum field theory.",
                    "label": 0
                },
                {
                    "sent": "There are just two types of particles, cure which moves with speed of light but left movers and right movers.",
                    "label": 0
                },
                {
                    "sent": "So for example this time this space.",
                    "label": 0
                },
                {
                    "sent": "In this left Morrison right movers interact.",
                    "label": 0
                },
                {
                    "sent": "They form a quasi stationary state for short time and then they scatter.",
                    "label": 0
                },
                {
                    "sent": "So basically there is a time shift or phase shift if you want for each body scattering.",
                    "label": 0
                },
                {
                    "sent": "So I mean, this is the simplest if you want anybody the terministic relativistic like because it's on spacetime, lattice dynamics in one plus one dimension.",
                    "label": 0
                },
                {
                    "sent": "And now the question is what happens if you put this against two stochastic reservoirs?",
                    "label": 0
                },
                {
                    "sent": "It turns out working, produce reservoirs, and this is the way.",
                    "label": 0
                },
                {
                    "sent": "Basically you construct them from anybody Markov chain.",
                    "label": 0
                },
                {
                    "sent": "So there is a deterministic part which is characterized by this local permutation matrix, which is a local update rule.",
                    "label": 0
                },
                {
                    "sent": "This is time space.",
                    "label": 0
                },
                {
                    "sent": "And then there is some Markov chains on the boundaries which basically take control of of chemical potentials of the solitons if you want.",
                    "label": 0
                },
                {
                    "sent": "As I, as I said, I mean, this is just a flash on illustration that a model like this can also be exactly solved.",
                    "label": 0
                },
                {
                    "sent": "It it basically one can write also predictions of this sort which don't appear to be directly related to to accept, which I showed before, but it seems that somehow this picture of integrability of out of equilibrium systems kind of is rich and one can have sort of fundamentally different conceptually different paradigms which which are of this type.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now let's now move on and go to quantum Quantum many body systems.",
                    "label": 0
                },
                {
                    "sent": "The question which we ask some time ago, which basically this was one of the first papers which I've done in this direction in 2008.",
                    "label": 0
                },
                {
                    "sent": "This is basically was the first few years where we started to work on this para digam and the first question I asked myself was.",
                    "label": 0
                },
                {
                    "sent": "I mean can 1/2 interesting physics and interesting Canonical Ingram states even for essentially non interacting systems.",
                    "label": 0
                },
                {
                    "sent": "So for example one of the paradigms of non interacting systems is this XY spin chains.",
                    "label": 0
                },
                {
                    "sent": "In one dimension, when you have quantum spins 1/2.",
                    "label": 0
                },
                {
                    "sent": "Arrange them on the line you put nearest neighbor interaction, spin spin interaction, but you put interaction in a strongly in isotropic way such that only the components in the XY plane matter, so interaction only is only in the XY plane.",
                    "label": 0
                },
                {
                    "sent": "Then it turns out that this model can be mapped by a non local transformation to free fermions.",
                    "label": 0
                },
                {
                    "sent": "So technically speaking this model is noninteracting, even though some people they would still call this model interacting.",
                    "label": 0
                },
                {
                    "sent": "But there is this simple trick, the Jordan Wigner transformation which.",
                    "label": 0
                },
                {
                    "sent": "Basically, demystify this model and makes it non interacting somehow is a bit trivial.",
                    "label": 0
                },
                {
                    "sent": "Still not quite trivial.",
                    "label": 0
                },
                {
                    "sent": "I mean there are hundreds of papers written on this model.",
                    "label": 0
                },
                {
                    "sent": "There are interesting phenomena discussed for this model.",
                    "label": 0
                },
                {
                    "sent": "For example, this model is one of the paradisians.",
                    "label": 0
                },
                {
                    "sent": "Also for quantum phase transitions equilibrium quantum phase transition is the model which displays quantum phase transition at zero temperature when you change magnetic field.",
                    "label": 0
                },
                {
                    "sent": "So I mean, it's not fair to call.",
                    "label": 0
                },
                {
                    "sent": "It's trivial, but still.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's much simpler than the models which are really interacting.",
                    "label": 0
                },
                {
                    "sent": "And for example, one can ask if one can write steady state of this model when you put jump operators on the boundaries with some rates.",
                    "label": 0
                },
                {
                    "sent": "And this is what we did with my former students with my PhD student at that time is to be sure.",
                    "label": 0
                },
                {
                    "sent": "And we computed correlation function or correlation matrix of the steady state.",
                    "label": 0
                },
                {
                    "sent": "This is the spin spin correlation function.",
                    "label": 0
                },
                {
                    "sent": "Depending on the magnetic field and we find that it's phonetic ability is large, then basically we have thermal correlations.",
                    "label": 0
                },
                {
                    "sent": "This is very much like in the experiments of schmitmeyer.",
                    "label": 0
                },
                {
                    "sent": "If you remember the correlation.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And if I just flash back.",
                    "label": 0
                },
                {
                    "sent": "You see, this was the typical thermal correlations, right?",
                    "label": 0
                },
                {
                    "sent": "OK, so here are some effects, but OK, don't discuss that because this is not but for example, typically is that you have a diagonal and of the diagonal have decay.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is typical for thermal states.",
                    "label": 0
                },
                {
                    "sent": "You have fast decay from the diagonal, which means that correlations decay when particles are moving away from each other, or when two sites are far away.",
                    "label": 0
                },
                {
                    "sent": "That's deep, that should be typical for one time in one.",
                    "label": 0
                },
                {
                    "sent": "Any thermal states, repealed, or any equilibrium states would be short range.",
                    "label": 0
                },
                {
                    "sent": "In equilibrium, but now when you have this monitoring steady state and you compute spin spin correlations for magnetic field which is below some critical value.",
                    "label": 0
                },
                {
                    "sent": "Which is maybe not written here, but doesn't matter.",
                    "label": 0
                },
                {
                    "sent": "Then you find a very bizzare patterns of spin spin correlations.",
                    "label": 0
                },
                {
                    "sent": "Basically they remind you of some station, some standing waves into the mentions.",
                    "label": 0
                },
                {
                    "sent": "Basically you can write wave equation which defines this correlation matrix which from which you can compute the correlation matrix in this wave equation is now has real waves here and harass and evanescent waves there.",
                    "label": 0
                },
                {
                    "sent": "So we find sort of a phase transition which can be explained by simple wave equation.",
                    "label": 0
                },
                {
                    "sent": "In thermodynamic limit.",
                    "label": 0
                },
                {
                    "sent": "OK, so yeah, that's OK, that's sort of the transition which we are sort of kind of understand from technical POV quite well, but still from physical point of view it could be still debated.",
                    "label": 0
                },
                {
                    "sent": "I mean the the transition is triggered basically by the probation which comes from the boundary, but still there should be some instability in the bulk which allows for this transition to happen.",
                    "label": 0
                },
                {
                    "sent": "So actually recently there was a paper by by Mauricio faculty who showed that.",
                    "label": 0
                },
                {
                    "sent": "This phase this is if you want long range correlated phase allows also for some bizarre conservation laws.",
                    "label": 0
                },
                {
                    "sent": "You're not there in this phase, so.",
                    "label": 0
                },
                {
                    "sent": "Now I will discuss conservation law submit later, so I might come back to this remark.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now let's go back.",
                    "label": 0
                },
                {
                    "sent": "Let's move on to basically to my favorites time model, and it's probably favorite time model of many mathematical or theoretical thesis which is the Heisenberg spin chain.",
                    "label": 0
                },
                {
                    "sent": "So basically, it's probably one of the most beautiful models.",
                    "label": 0
                },
                {
                    "sent": "Theoretical physicist can play with because it's just just just just.",
                    "label": 0
                },
                {
                    "sent": "I mean, it has just the right difficulty.",
                    "label": 0
                },
                {
                    "sent": "I mean it is integrable but still there are many things which are kind of quite generic.",
                    "label": 0
                },
                {
                    "sent": "In this model it displays even for example, somehow diffusive transport displays, ballistic transport, displays, phase transitions between one to another.",
                    "label": 0
                },
                {
                    "sent": "So basically this place most of phenomena that basically should happen in one dimension I guess.",
                    "label": 0
                },
                {
                    "sent": "So that's the model.",
                    "label": 0
                },
                {
                    "sent": "The model is, again, spins 1/2.",
                    "label": 0
                },
                {
                    "sent": "You have this XY interaction.",
                    "label": 0
                },
                {
                    "sent": "Now I'm writing it in terms of Sigma plus and minus matrices.",
                    "label": 0
                },
                {
                    "sent": "These are all familiar Poly matrices and Sigma plus is just see my ex.",
                    "label": 0
                },
                {
                    "sent": "Plus I Sigma Y.",
                    "label": 0
                },
                {
                    "sent": "See my mind assisting my X minus icing y / 2 and so on.",
                    "label": 0
                },
                {
                    "sent": "I mean this is the familiar I guess spin operators for spin 1/2 and then there is interaction.",
                    "label": 0
                },
                {
                    "sent": "So Sigma Z times Sigma's interaction and if Delta is equal to 1 then this could be written as a dot product of two vectors of Poly matrices adjacent sides.",
                    "label": 0
                },
                {
                    "sent": "So then this would be like.",
                    "label": 0
                },
                {
                    "sent": "Then this would be like really Heisenberg interaction exchange interaction, but you would like also to have some free parameters because this parameter is interesting.",
                    "label": 0
                },
                {
                    "sent": "Also if you want to go to field theory, this parameter has to do with the mass of expectations.",
                    "label": 0
                },
                {
                    "sent": "For example, if Delta is last less than one, then you would have massless extensions or you would call this model critical if there is larger than one you would have massive excitations and this model will be called kept.",
                    "label": 0
                },
                {
                    "sent": "OK, and then you attach to environment channels to this model at the boundaries with some rate epsilon and with some dissipation jump operators which are Sigma plus signal minus.",
                    "label": 0
                },
                {
                    "sent": "So this basically correspond to flux of magnetization from left to right, so the left you want to flip up spins on the right you want to flip down speeds, so at the end what you expect is that.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "State which has some bias which has some profile of monetization at some, some profile or some characteristics of the current.",
                    "label": 0
                },
                {
                    "sent": "So this is just what happens.",
                    "label": 0
                },
                {
                    "sent": "I mean before I'm just giving you a one slide flavor of how the solution looks.",
                    "label": 0
                },
                {
                    "sent": "I give you the observers in this state which can be computed from the solution.",
                    "label": 0
                },
                {
                    "sent": "I will show you.",
                    "label": 0
                },
                {
                    "sent": "And these are the two main observers.",
                    "label": 0
                },
                {
                    "sent": "This is the profiles of magnetisation and this is the current as a function of system size.",
                    "label": 0
                },
                {
                    "sent": "Now I little N is my system size.",
                    "label": 0
                },
                {
                    "sent": "Now before it was capital L. But I'm sorry for that.",
                    "label": 0
                },
                {
                    "sent": "Usually it's little M which is like a number of qubits in the chain number of spins.",
                    "label": 0
                },
                {
                    "sent": "So for example, there are three distinctly different physical behaviors in the in the in the, in the in the gapless phase you would find ballistic transport that is the spin profile.",
                    "label": 0
                },
                {
                    "sent": "This is the spin density, that is the trace of density matrix times the operator, and so this is just a constant boring boring constant which is practically zero.",
                    "label": 0
                },
                {
                    "sent": "This system is not magnetized, but then at the edges nearer boundaries.",
                    "label": 0
                },
                {
                    "sent": "It feels a bit that there are these microscopic magnets which try to polarize it, but in the bark it's basically depolarized.",
                    "label": 0
                },
                {
                    "sent": "It's it's, it's it's it's.",
                    "label": 0
                },
                {
                    "sent": "And the current is large.",
                    "label": 0
                },
                {
                    "sent": "This is the full lines on the right there is a few lines of currents.",
                    "label": 0
                },
                {
                    "sent": "Which don't depend on the system size essentially.",
                    "label": 0
                },
                {
                    "sent": "So basically our ballistic currents depends on the strength of the coupling, so these different thickness of these three different curves correspond to different strains of couplings to the environment.",
                    "label": 0
                },
                {
                    "sent": "So small epsilon means thing curve, large epsilon, large coupling sticker.",
                    "label": 0
                },
                {
                    "sent": "And yeah, I see that the customer basically is larger the larger the coupling, but it doesn't depend on system size.",
                    "label": 0
                },
                {
                    "sent": "Now when you go to the massive case then the system becomes insulator, the current becomes exponentially small.",
                    "label": 0
                },
                {
                    "sent": "This is the inset.",
                    "label": 0
                },
                {
                    "sent": "The current is exponentially decaying system size and then you have this kingship profiles.",
                    "label": 0
                },
                {
                    "sent": "And the most interesting is that the tropical the Heisenberg really did isotropic Heisenberg situation where data is equal to 1.",
                    "label": 0
                },
                {
                    "sent": "Then you have some anomalous scaling of the current Jay goes to lesson to minus two and spin spin profiles are this cosine shaped profiles.",
                    "label": 0
                },
                {
                    "sent": "All this can be done analytically so and this.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mechanical and also one can calculate for example the spin spin correlation function.",
                    "label": 0
                },
                {
                    "sent": "Again, this is an object which I showed before.",
                    "label": 0
                },
                {
                    "sent": "Now it is long ranged, but it's not wave like.",
                    "label": 0
                },
                {
                    "sent": "I mean it's not the one for the XY model, but something intermediate.",
                    "label": 0
                },
                {
                    "sent": "I mean it's long range, but still in the case.",
                    "label": 0
                },
                {
                    "sent": "I mean there's no oscillations.",
                    "label": 0
                },
                {
                    "sent": "It's A kind of simple algebraic formula which.",
                    "label": 0
                },
                {
                    "sent": "Characterize it.",
                    "label": 0
                },
                {
                    "sent": "It may be that this state has some universality.",
                    "label": 0
                },
                {
                    "sent": "I mean that it's more universal than just for the Heisman model, but we still work on this.",
                    "label": 0
                },
                {
                    "sent": "I mean, this is this exact result can only be done so far for the Heisenberg isotropic Heisenberg model.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so now now I just.",
                    "label": 0
                },
                {
                    "sent": "I bothering maybe for 10 minutes with some technical slides.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry for that, but for those who might have some interest to see some of the guts of the of the of this exact solutions might want to follow.",
                    "label": 0
                },
                {
                    "sent": "The others may fall asleep for awhile and then try to wake you up again before the end, so.",
                    "label": 0
                },
                {
                    "sent": "OK, so remember, I mean now the idea is basically to show how one can.",
                    "label": 0
                },
                {
                    "sent": "I mean I'm not sure but I will just illustrate how one can try to solve this steady state of The xx ZT model with the metrics.",
                    "label": 1
                },
                {
                    "sent": "Product answers.",
                    "label": 0
                },
                {
                    "sent": "Basically I will just try to show what how the solution looks like.",
                    "label": 0
                },
                {
                    "sent": "This has been basically done in these two papers of mine in 2011 and then there was a nice paper in 2013 which somehow showed how to do it much more somehow.",
                    "label": 0
                },
                {
                    "sent": "In some short shortcut they produce, they propose some simpler formulation of the of the recipe to find solution, but basically the result is the same, so.",
                    "label": 0
                },
                {
                    "sent": "So the idea is OK, now we have a density matrix, right?",
                    "label": 0
                },
                {
                    "sent": "We have many body density matrix.",
                    "label": 0
                },
                {
                    "sent": "We try to proceed as closely as possible to the.",
                    "label": 0
                },
                {
                    "sent": "Solution of the generic metrics product.",
                    "label": 0
                },
                {
                    "sent": "But we don't write the matrix product state for the density matrix with writing for the square root of the SD matrix.",
                    "label": 1
                },
                {
                    "sent": "So first right against the matrix or the unnormalized part of this team matrix as a product of Delta Delta Dagger where Delta is.",
                    "label": 0
                },
                {
                    "sent": "If you want the square root but non permission square root of the death matrix, this is some factorization of density matrix or some factorization of a positive operator.",
                    "label": 0
                },
                {
                    "sent": "But it turns out it is exactly what is called Cholesky factorization because this Delta turns out to be upper triangular matrix.",
                    "label": 0
                },
                {
                    "sent": "If you re write it down, you don't have to do this now, so we don't have to appreciate that.",
                    "label": 0
                },
                {
                    "sent": "But you have to appreciate is this simple expression for Omega.",
                    "label": 0
                },
                {
                    "sent": "So then what you do is basically right.",
                    "label": 0
                },
                {
                    "sent": "Omega in terms of a matrix product state.",
                    "label": 0
                },
                {
                    "sent": "But now this is not a state, it's an operator.",
                    "label": 0
                },
                {
                    "sent": "So sometimes people call it a metrics product operator where you basically expand an operator into basis of all possible operators which are products or tensor products of Pauli matrices.",
                    "label": 0
                },
                {
                    "sent": "What is in this is denoted Sigma plus or minus zero and then so there are four possible matrices which spend.",
                    "label": 0
                },
                {
                    "sent": "Or to buy two matrices right?",
                    "label": 0
                },
                {
                    "sent": "Sigma plus or minus Sigma Zero and Sigma Z where Sigma zero is just identity.",
                    "label": 0
                },
                {
                    "sent": "It's also it's what happens that this answers doesn't need Sigma that so this is kind of remarkable, and that was basically the clue or hint which allowed me to solve this model in the 1st place.",
                    "label": 0
                },
                {
                    "sent": "Observation, which followed from doing numerical experiments.",
                    "label": 0
                },
                {
                    "sent": "So that's what I say.",
                    "label": 0
                },
                {
                    "sent": "That's why I say, I mean, I'd like to dig in the mud, and sometimes I find some jewels in the model.",
                    "label": 0
                },
                {
                    "sent": "So then I tried to publish and then I see.",
                    "label": 0
                },
                {
                    "sent": "Well, maybe this could be having the right by Friday AF and his company 20 years ago, but they didn't because they didn't look at this filthy.",
                    "label": 0
                },
                {
                    "sent": "Underground, and they only wanted to have a beautiful, simple solutions.",
                    "label": 0
                },
                {
                    "sent": "So sometimes you know complicated things simplify later and still.",
                    "label": 0
                },
                {
                    "sent": "Of course, also this wouldn't have been possible if one would have a computer.",
                    "label": 0
                },
                {
                    "sent": "I mean in the 70s they didn't have computers, so now we can play with Mathematica.",
                    "label": 0
                },
                {
                    "sent": "We can play with symbolic.",
                    "label": 0
                },
                {
                    "sent": "Expressions you don't have to do it on paper.",
                    "label": 0
                },
                {
                    "sent": "And then of course it can happen the price to pay is that what can happen is that you compute something and you don't understand what you've done.",
                    "label": 0
                },
                {
                    "sent": "So then you can maybe spend 10 two years to understand what you have done.",
                    "label": 0
                },
                {
                    "sent": "That's that's the price to pay it, and I'm not sure if this is the best way to do, but still.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's possible to make some progress.",
                    "label": 0
                },
                {
                    "sent": "OK, so now this is the digested or distilled version of the solution.",
                    "label": 0
                },
                {
                    "sent": "The simplest one set of 1 slide presentation.",
                    "label": 0
                },
                {
                    "sent": "You can write it in this matrix product form.",
                    "label": 0
                },
                {
                    "sent": "These matrices are just three diagonal matrices, but they have to be infinitely dimensional, so there is no finite dimensional presentation of these matrices which would do the job.",
                    "label": 0
                },
                {
                    "sent": "So one has to really allow for infinite dimensional ancilla or auxiliary space and the action of this operators AOA plus and minuses.",
                    "label": 0
                },
                {
                    "sent": "I set a zed.",
                    "label": 0
                },
                {
                    "sent": "Zed doesn't exist because Sigma Z doesn't appear and these three operators basically are closely related to the generators of angular momentum algebra.",
                    "label": 0
                },
                {
                    "sent": "In the isotropic case, when Delta is equal to 1, so that is the case of Heisenberg model.",
                    "label": 1
                },
                {
                    "sent": "These are exactly the angular momentum algebra, but they correspond to a complex spin.",
                    "label": 0
                },
                {
                    "sent": "So this is basically what I write.",
                    "label": 1
                },
                {
                    "sent": "Here is a little bit more complicated.",
                    "label": 0
                },
                {
                    "sent": "Mathematical object is called UQ SL2.",
                    "label": 0
                },
                {
                    "sent": "It's a quantum deformation of angular momentum algebra.",
                    "label": 0
                },
                {
                    "sent": "But still if Delta is equal to 1, this deformation parameter ITA is equal to 0.",
                    "label": 0
                },
                {
                    "sent": "Then it's really just the incremental algebra.",
                    "label": 0
                },
                {
                    "sent": "The point is that there is a parameter S here, which is just the spin.",
                    "label": 0
                },
                {
                    "sent": "So if you teach quantum mechanics, if you have still remember quantum mechanics, you know that this is basically the matrix elements of angular momentum operators.",
                    "label": 0
                },
                {
                    "sent": "But in quantum mechanics this as to be half integer.",
                    "label": 0
                },
                {
                    "sent": "This is Kathy integer, then this will translate.",
                    "label": 0
                },
                {
                    "sent": "You start from the lowest weight state and then it truncates after 2 S steps right?",
                    "label": 0
                },
                {
                    "sent": "So we have two S plus one steps and this is the dimension of the irreducible representation of of SU-2.",
                    "label": 0
                },
                {
                    "sent": "Now this S happens to be complex number.",
                    "label": 0
                },
                {
                    "sent": "This actually turns out to be related to epsilon and epsilon is the noise is the boundary is a coupling to the environment.",
                    "label": 0
                },
                {
                    "sent": "Is the flux of in and out.",
                    "label": 0
                },
                {
                    "sent": "Particles of the environment.",
                    "label": 0
                },
                {
                    "sent": "So it turns out that now the spin has to be related to the to the dissipation strength, which is completely imaginary.",
                    "label": 0
                },
                {
                    "sent": "So this series would never truncate, so you need to inflict immeasurable infinite measure.",
                    "label": 0
                },
                {
                    "sent": "Non unitary or not in mission.",
                    "label": 0
                },
                {
                    "sent": "Representation irreducible, non unitary representation of the SQ2 or Q deformed as you do.",
                    "label": 0
                },
                {
                    "sent": "So that's sort of in the jargon of mathematical physics, what we have here.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so now let's now move on a little bit and see what we can do with that.",
                    "label": 0
                },
                {
                    "sent": "So that's sort of, I mean, that was sort of playing with abstract mathematical model, which might have nothing to do with reality.",
                    "label": 0
                },
                {
                    "sent": "Might help.",
                    "label": 0
                },
                {
                    "sent": "I mean, at least I guess in the lap of random blood they could do probably quantum Simulator, which would do the job, but I'm not sure if anyone would be so excited, because we can do this by hand or by Mathematica laptop.",
                    "label": 0
                },
                {
                    "sent": "So the question is, can we derive anything which is physically sort of interesting from there?",
                    "label": 0
                },
                {
                    "sent": "And yes, the idea is to derive some sort of conservation laws which might have some new physics inside.",
                    "label": 1
                },
                {
                    "sent": "So let me now just give you a short review of local conservation laws in quantum physics.",
                    "label": 1
                },
                {
                    "sent": "So for example.",
                    "label": 0
                },
                {
                    "sent": "Starting from Hamiltonian, which is the simplest thing?",
                    "label": 0
                },
                {
                    "sent": "I mean, imagine you have a quantum system or even classical one, which can be written as a sum of two body terms.",
                    "label": 0
                },
                {
                    "sent": "So these indices just denote the sites on which this operator or observable excellent rebellion.",
                    "label": 0
                },
                {
                    "sent": "This is the quantum or classical.",
                    "label": 0
                },
                {
                    "sent": "If it's classical, then instead of computer you should use person bracket.",
                    "label": 0
                },
                {
                    "sent": "So then you have continued to equation right?",
                    "label": 0
                },
                {
                    "sent": "So we can write down the time, time evolution of a local Hamiltonian density.",
                    "label": 0
                },
                {
                    "sent": "This is just phenomenal equation.",
                    "label": 0
                },
                {
                    "sent": "This is just the commutator of.",
                    "label": 0
                },
                {
                    "sent": "The whole Hamiltonian with the little age with the density you can spell out the full Hamiltonian you find there are just two terms which are not commuting, and these two terms defined what is called an energy current.",
                    "label": 1
                },
                {
                    "sent": "These are the two terms for which these two densities don't commute among each other, right?",
                    "label": 1
                },
                {
                    "sent": "So this is how you define an energy current.",
                    "label": 0
                },
                {
                    "sent": "So then it would say OK, H is my conserved quantity, but also defines a local conservation law of energy.",
                    "label": 1
                },
                {
                    "sent": "Density defines energy current.",
                    "label": 0
                },
                {
                    "sent": "Similarly you can do with any general extensive quantity in an integrable system or in the system, which might not be completely integrable but has nontrivial conserved quantities like magnetisation for Heisenberg or particle number for Herbert and so on.",
                    "label": 0
                },
                {
                    "sent": "So you can always write this conservation law as a sum of local densities, and then from the fact that everything should globally commute, you can really drive it or write it as a local continue to equation and this commentator again defines to densities and these two densities you would define as corresponding current densities.",
                    "label": 0
                },
                {
                    "sent": "So you have charges and currents.",
                    "label": 0
                },
                {
                    "sent": "Yeah, very simple.",
                    "label": 0
                },
                {
                    "sent": "Everything is discrete, finite 1 dimensional, but that's sort of the generic picture.",
                    "label": 0
                },
                {
                    "sent": "I have charges that sort of sums of local densities and then have currents which defined continue to equation for the charges.",
                    "label": 0
                },
                {
                    "sent": "So I don't need to relativity.",
                    "label": 0
                },
                {
                    "sent": "I don't need fancy fancy language to have this.",
                    "label": 0
                },
                {
                    "sent": "It's just here.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And now the question is what you have, what you can do with it.",
                    "label": 0
                },
                {
                    "sent": "And for example, you want to basically go into condensed matter physics, or you want to go to transport and liquid transport.",
                    "label": 1
                },
                {
                    "sent": "Let's see if this can be related to for some issues of quantum transport you write down, for example the coding Cooper formula, which is the standard linear response formula for conductivity as a function of Omega.",
                    "label": 1
                },
                {
                    "sent": "Now this can be hit connectivity or energy energy transport coefficient.",
                    "label": 0
                },
                {
                    "sent": "If Jay is an energy current, it can be spin connectivity with Jay is the spin current.",
                    "label": 0
                },
                {
                    "sent": "It could be charged conductivity enjoys a particle.",
                    "label": 0
                },
                {
                    "sent": "And so this is just a generic generic formula.",
                    "label": 0
                },
                {
                    "sent": "It turns out that you could isolate sort of Delta peaked frequency equal to 0, which is called through the weight because it may happen that is Delta pick is nonvanishing an if this Delta pick is nonvanishing, then this coefficient in front can be written also in terms of Kubo formula, but now the conductivity's connectivity is not at the time integral, but it is a time average of the current current correlation function.",
                    "label": 0
                },
                {
                    "sent": "So it's all about current current correlation functions.",
                    "label": 0
                },
                {
                    "sent": "But if the time average is not zero, then forget about time integral right?",
                    "label": 0
                },
                {
                    "sent": "Because time integral for sure will diverge.",
                    "label": 0
                },
                {
                    "sent": "So to have finite conductivity first to make sure that there is no debate if there is through the weights.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, we have a signal of ballistic transport.",
                    "label": 0
                },
                {
                    "sent": "And here I make a remark of a very inspiring paper which at least inspired me for 20 years, which was a paper by his auto Sparrow, second name.",
                    "label": 1
                },
                {
                    "sent": "So of course you know our colleague computer promotion who proposed to apply again, and even a little bit older bound due to Missouri and Suzuki.",
                    "label": 0
                },
                {
                    "sent": "To the estimated weight in terms of concert quantities.",
                    "label": 1
                },
                {
                    "sent": "So what these people show that there's basically very simple kinematic bound as soon as you have conserved quantities then you have a lower bound and do the weight at any temperature.",
                    "label": 0
                },
                {
                    "sent": "Be there is a temperature which just enters definition of the expectation value, but that's sort of that sort of very elegant, very simple identity.",
                    "label": 0
                },
                {
                    "sent": "The only thing we have to make sure to enumerate your conserved operators and to check whether they have nonvanishing overlap with the with the current in question.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "OK so I have no basically time or intention here to derive this, but it's something which can be derived again within an hour.",
                    "label": 0
                },
                {
                    "sent": "I mean it's not.",
                    "label": 0
                },
                {
                    "sent": "It's a very elementary thing, it could be done in the in the class.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Graduate class.",
                    "label": 0
                },
                {
                    "sent": "So what is the conclusion here?",
                    "label": 0
                },
                {
                    "sent": "Conclusion is that internal systems are ballistic conductors at any temperature, unless.",
                    "label": 1
                },
                {
                    "sent": "Unless all conserved quantities, orthogonal current operator, which might happen due to discrete symmetries, and this might generically happen.",
                    "label": 1
                },
                {
                    "sent": "For example, it will happen in the Heisenberg model in the highest model there is a spin flip symmetry.",
                    "label": 0
                },
                {
                    "sent": "You can flip the spin you can take.",
                    "label": 0
                },
                {
                    "sent": "I will show you later how how it can be done and then you can show that all the conserved operators that for the oven company derived from algebraic methods that are orthogonal to the spin current because they have the opposite spin flip symmetry.",
                    "label": 0
                },
                {
                    "sent": "So then one wonders what one can do cause numerical experiments showed that.",
                    "label": 0
                },
                {
                    "sent": "Do the wait is finite starting from numerical work of Peter Promotion Company to America to Boston azatian techniques in which people do analytically and so on?",
                    "label": 0
                },
                {
                    "sent": "I mean there are.",
                    "label": 0
                },
                {
                    "sent": "There are indications that this really should be finite, even though there was no way to prove it.",
                    "label": 0
                },
                {
                    "sent": "So what really one needs is some conservation law which breaks the parity reversal symmetry.",
                    "label": 0
                },
                {
                    "sent": "It turns out this is related to conservation laws breaking in parity.",
                    "label": 0
                },
                {
                    "sent": "So what we have found this exact solution of the steady state is related to what we need.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So it turns out and then this is again something which are just flashing because it's beyond the scope of the collection.",
                    "label": 0
                },
                {
                    "sent": "Talk to show any.",
                    "label": 0
                },
                {
                    "sent": "Mechanism of how this can be possibly happening, but what happens is that this Cholesky factors this amplitude operators or square roots of density matrix actually form a commuting family.",
                    "label": 0
                },
                {
                    "sent": "So for example, there are functions of some complex spin as you remember, and this complex pin is a function of epsilon, which is the environment parameter or and these guys are actually forming computing commuter commuter among themselves for any value of the spin.",
                    "label": 0
                },
                {
                    "sent": "And one can actually show that we could take a derivative of this operator with respect to spin, complex spin and then put spin equal to 0.",
                    "label": 0
                },
                {
                    "sent": "Then you get an operator Z which is quasi local, which is as good as any local operator in the sense that is easy dagger.",
                    "label": 1
                },
                {
                    "sent": "Has extensive expectation value.",
                    "label": 0
                },
                {
                    "sent": "And I forgot to stress that, but that's something which is typical for local operators, and that's all what we need if you want to insert this guy into the muscle bound because muscle bound needs this kind of objects.",
                    "label": 0
                },
                {
                    "sent": "By linear objects in the operators and this guy should be proportional to the system size.",
                    "label": 0
                },
                {
                    "sent": "This guy is proportional to size with squared, so this is N ^2 / N / N is constant so things becomes intensive and so it becomes non non 0.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is the guy basically which we were looking for for 25 years.",
                    "label": 0
                },
                {
                    "sent": "For 20 years.",
                    "label": 0
                },
                {
                    "sent": "A little less.",
                    "label": 0
                },
                {
                    "sent": "It's 195 since 2000.",
                    "label": 0
                },
                {
                    "sent": "Eleven 60 years.",
                    "label": 0
                },
                {
                    "sent": "OK so and.",
                    "label": 0
                },
                {
                    "sent": "And Moreover, I mean this guy actually OK.",
                    "label": 0
                },
                {
                    "sent": "I mean, I haven't yet showed that this is a conservation law, but what you can do now?",
                    "label": 1
                },
                {
                    "sent": "Basically we can plug this into the equation of motion for this operator.",
                    "label": 0
                },
                {
                    "sent": "You find that this follows basically from the limit equation from the steady state limit.",
                    "label": 0
                },
                {
                    "sent": "Equation is equivalent to that, namely that this operator will form out of this charge.",
                    "label": 0
                },
                {
                    "sent": "I mean, this is just your former Commission combination has a commutator, which is just a sum of two terms difference of two times at the boundaries.",
                    "label": 0
                },
                {
                    "sent": "So now this looks like a continued equation, right?",
                    "label": 0
                },
                {
                    "sent": "You have a charge, but I'm sure if the charge is a difference of two currents, now these two currents are not looking at occurrence and they're looking at charge densities of charger.",
                    "label": 0
                },
                {
                    "sent": "The identity of monetization in vineyard and picture these are like part particle densities or charge densities.",
                    "label": 0
                },
                {
                    "sent": "So now this is like a twisted situation.",
                    "label": 0
                },
                {
                    "sent": "You have a current like operator Q.",
                    "label": 0
                },
                {
                    "sent": "Which plays the role of the charge and the charge.",
                    "label": 0
                },
                {
                    "sent": "The Sigma see you want charge which plays the role of the current.",
                    "label": 0
                },
                {
                    "sent": "So that's basically what happens, and it's kind of curious why it happens.",
                    "label": 0
                },
                {
                    "sent": "I don't know, I mean.",
                    "label": 0
                },
                {
                    "sent": "Still.",
                    "label": 0
                },
                {
                    "sent": "Why and how generic it is?",
                    "label": 0
                },
                {
                    "sent": "But at least it answers quite interesting question in this particular setup.",
                    "label": 1
                },
                {
                    "sent": "So as I already said, this is in fact it's just the 1st order perturbative order in the steady state.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I think I will have to move to the end.",
                    "label": 0
                },
                {
                    "sent": "Let me just see what this produces for our.",
                    "label": 0
                },
                {
                    "sent": "Heisenberg model for the cosmic model.",
                    "label": 0
                },
                {
                    "sent": "So there is this flippin flip symmetry which I mentioned which is just the product of Pauli matrices and probably X you remember is a matrix Switcher, zeros at the corners and sorry once at the corners and zero said that Agnes so just flip spin up, spin down.",
                    "label": 0
                },
                {
                    "sent": "It's been down to speed up speed up so it turns out that all there for day of charges are commuting with P including Hamiltonian.",
                    "label": 0
                },
                {
                    "sent": "So they are even with respect to spin reversal.",
                    "label": 0
                },
                {
                    "sent": "But the spin current which I haven't spelled out but you can imagine spin current is author right?",
                    "label": 0
                },
                {
                    "sent": "I mean if you flip the spin.",
                    "label": 0
                },
                {
                    "sent": "Then the spin current runs the other way, so this pin current is out, so it's irrelevant.",
                    "label": 0
                },
                {
                    "sent": "I mean all these standard local charges are irrelevant to the spin current.",
                    "label": 0
                },
                {
                    "sent": "Brazil bound would not give anything if you don't introduce no new objects into the game, and here if you introduce this operator, which is also odd, then you find that the overlap with the current is not zero and then you can basically evaluate them as or bound and you get this result.",
                    "label": 0
                },
                {
                    "sent": "So basically that's the main result of this talk.",
                    "label": 0
                },
                {
                    "sent": "This result in weaker form appears for the first time in my paper in 2011, but in the stronger form we appeared in 2013 in the paper with an alias scheme.",
                    "label": 0
                },
                {
                    "sent": "My PhD student at the time.",
                    "label": 0
                },
                {
                    "sent": "This is this black curve.",
                    "label": 0
                },
                {
                    "sent": "I mean there is the suboptimal and let's say more optimal result because this result includes more charges, not just this one, but there is a whole family depending on some complex parameter you can optimize over this complex parameter.",
                    "label": 0
                },
                {
                    "sent": "You can optimize.",
                    "label": 0
                },
                {
                    "sent": "You can get a larger lower bound.",
                    "label": 0
                },
                {
                    "sent": "Now there is an interesting question.",
                    "label": 0
                },
                {
                    "sent": "First, there is an observation at this lower bound is a fractal.",
                    "label": 0
                },
                {
                    "sent": "That is, it's a discontinuous function of the parameter.",
                    "label": 0
                },
                {
                    "sent": "This is following from some name, number, number theory games with the representation dimensions.",
                    "label": 0
                },
                {
                    "sent": "Which I'm not going to go into into here, but it's interesting that you have this nowhere continuous function, right?",
                    "label": 0
                },
                {
                    "sent": "Kind of fractal.",
                    "label": 0
                },
                {
                    "sent": "Then the question is, is the physical transport coefficient of the model really fractal function of the parameter or is just cause it's still lower bound and the true transport coefficient is continuous?",
                    "label": 0
                },
                {
                    "sent": "This is something which is debated.",
                    "label": 0
                },
                {
                    "sent": "It's not clear my current opinion is that it is probably I mean.",
                    "label": 0
                },
                {
                    "sent": "Of course it's more let's say fancy result, it's probably I would say it's probably.",
                    "label": 0
                },
                {
                    "sent": "Saturated abound, but you may always find that someone at some point some operators which which are independent of these charges, which we take into account and still contribute to the lower bound.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so that's most of it.",
                    "label": 0
                },
                {
                    "sent": "What I want to say.",
                    "label": 0
                },
                {
                    "sent": "I prepare a few more slides which I will just keep which have to do with generalized Gibson sample.",
                    "label": 0
                },
                {
                    "sent": "It turns out that there are other conserved operators which are important for the, so there is not.",
                    "label": 0
                },
                {
                    "sent": "So the charges which are derived by for deaf and company are not all the story.",
                    "label": 0
                },
                {
                    "sent": "So show now that the first of all they have the wrong symmetry and the odd symmetry is important for quantum transport, but the even symmetry even in the even sector the charges which are even with respect to.",
                    "label": 0
                },
                {
                    "sent": "Quality to spin reversal.",
                    "label": 0
                },
                {
                    "sent": "Even those charges are not complete.",
                    "label": 0
                },
                {
                    "sent": "I mean the local charges over there are not complete in the sense that they don't basically explain the thermalization integrable system if you form a generalized Gibson sample out of this local charges you will find the gap.",
                    "label": 0
                },
                {
                    "sent": "Sorry, I said I will skip this now, I'm just I probably just want to say that there is there was a gap.",
                    "label": 0
                },
                {
                    "sent": "There was a nice sort of.",
                    "label": 0
                },
                {
                    "sent": "Thriller story in the 2015.",
                    "label": 0
                },
                {
                    "sent": "I mean, first there was in 2014 two papers, kind of two competing groups reporting there is a big problem.",
                    "label": 0
                },
                {
                    "sent": "There is gap and then there was a paper by.",
                    "label": 0
                },
                {
                    "sent": "This computer somehow said it's enough.",
                    "label": 0
                },
                {
                    "sent": "Anyway, it's it was one of the one before last slide, so.",
                    "label": 0
                },
                {
                    "sent": "So I will not show the last slide so that I don't use time, but I still want to maybe 3 minutes for questions so.",
                    "label": 0
                },
                {
                    "sent": "So there was a paper from our group bye bye Bye Leave scheme Archimedean myself in 2015 where we construct it.",
                    "label": 0
                },
                {
                    "sent": "We've got another idea how to construct quasi local charges, not the ones which are constructed before they don't come from the solution of the linear equation, but they still come from similar philosophy, which basically answered exactly this controversy.",
                    "label": 0
                },
                {
                    "sent": "They close this gap.",
                    "label": 0
                },
                {
                    "sent": "So basically when we included charges we closed the gap.",
                    "label": 0
                },
                {
                    "sent": "So this was a series of two papers in PRL last year, first one by my students and myself and second one by Group in Amsterdam 5 and Yesler in alien skin myself, which somehow answered this question.",
                    "label": 0
                },
                {
                    "sent": "OK so yeah I will not show you the conclusion slide you see there is.",
                    "label": 0
                },
                {
                    "sent": "Lot of things which can be set.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry if I was a bit technical at some points.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "There are many exciting questions to do still.",
                    "label": 0
                },
                {
                    "sent": "I mean there are there is a question of how one can do these things in field theories.",
                    "label": 0
                },
                {
                    "sent": "For example, this is discrete lattice systems.",
                    "label": 0
                },
                {
                    "sent": "I feel safer on the lattice, but still there are interesting questions how to go to to continue models to field theories.",
                    "label": 0
                },
                {
                    "sent": "There are interesting questions of how to go to classical integrable systems like nonlinear optics.",
                    "label": 0
                },
                {
                    "sent": "The question how to go to more interesting models like Hubbard model?",
                    "label": 0
                },
                {
                    "sent": "We have some interesting results for Hubbard model, but they have even more interesting questions about Hubbard model, so there are still many interesting things to do.",
                    "label": 0
                },
                {
                    "sent": "Thank you for attention.",
                    "label": 0
                },
                {
                    "sent": "Very briefly, what's the origin of Fractality which you have shown?",
                    "label": 0
                },
                {
                    "sent": "I understood it's analytical solution, but can you just comment?",
                    "label": 0
                },
                {
                    "sent": "What's the physical area?",
                    "label": 0
                },
                {
                    "sent": "The origin is very simple.",
                    "label": 0
                },
                {
                    "sent": "At the origin is.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Skipped it.",
                    "label": 0
                },
                {
                    "sent": "So the origin is the following.",
                    "label": 0
                },
                {
                    "sent": "I mean you basically what you have is you know you remember this matrices A0A plus and a minus which were used to construct the steady state.",
                    "label": 0
                },
                {
                    "sent": "Basically the same matrices which are used to construct the operator.",
                    "label": 0
                },
                {
                    "sent": "Yeah, if you really want to spell out the operator in terms of spin operators, you need to basically have this representation of the UQ SL2 this quantum group.",
                    "label": 0
                },
                {
                    "sent": "And these representations are very bizarre.",
                    "label": 0
                },
                {
                    "sent": "When Q is root of unity.",
                    "label": 0
                },
                {
                    "sent": "And here in this critical strip this is the massless or critical strip.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "Basically Delta can be always approximated by a closest root of unity, and it's like a real number being approximated by the rational and irrational.",
                    "label": 0
                },
                {
                    "sent": "Because you can find two different rationals very close by with very different denominators and this means very different dimensions of the operator of the defining the operator, which means that the right hand side of the measure bound could be very sensitive to the dimension and dimension is a non smooth function of the cosine.",
                    "label": 0
                },
                {
                    "sent": "This Delta is a cosine, π /, M and M is the dimension.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "No, I don't know.",
                    "label": 0
                },
                {
                    "sent": "I mean, that's the question.",
                    "label": 0
                },
                {
                    "sent": "I mean, that's the physics prohibited to believe that this thing could be really a transport coefficient.",
                    "label": 0
                },
                {
                    "sent": "That's another question which I don't think I think it does not.",
                    "label": 0
                },
                {
                    "sent": "But for example, why I think it does not because I'm used to see results.",
                    "label": 0
                },
                {
                    "sent": "I mean I have in my previous life working on dynamical systems of a single particle people have discussed, for example, fractal diffusion coefficients.",
                    "label": 0
                },
                {
                    "sent": "If you have this simple sort of Maps right, depending on one parameter people have looked at the diffusion constant as a function of.",
                    "label": 0
                },
                {
                    "sent": "Meter and they found that this factor is peerless parand.",
                    "label": 0
                },
                {
                    "sent": "I mean, there was there was some community which was working on that in the mid 90s or early 90s and so.",
                    "label": 0
                },
                {
                    "sent": "So if you don't find that strange, I don't find this strange either, but.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but you see I mean the upper curve is less structured in the lower curve, so it means that I'm smoothing it somehow.",
                    "label": 0
                },
                {
                    "sent": "I'm I'm using more more information.",
                    "label": 0
                },
                {
                    "sent": "On different scale yeah.",
                    "label": 0
                },
                {
                    "sent": "Knowing the steady state exactly, is there any chance that you can learn something?",
                    "label": 0
                },
                {
                    "sent": "Simple exactly good approximation for the relaxation to the study steady state, because normally nature doesn't start in a steady store.",
                    "label": 0
                },
                {
                    "sent": "That's a very good question.",
                    "label": 0
                },
                {
                    "sent": "It's also very difficult one.",
                    "label": 0
                },
                {
                    "sent": "So far we have no results on the relaxation dynamics to the steady state we are working.",
                    "label": 0
                },
                {
                    "sent": "We have been working since the last since 2011.",
                    "label": 0
                },
                {
                    "sent": "We have been trying several occasions to move to this direction.",
                    "label": 0
                },
                {
                    "sent": "Always failed.",
                    "label": 0
                },
                {
                    "sent": "This type of problems are somehow difficult, I mean.",
                    "label": 0
                },
                {
                    "sent": "They are difficult in the sense that you never know whether you're going to succeed or not.",
                    "label": 0
                },
                {
                    "sent": "So what you do, typically you make a kick for few months.",
                    "label": 0
                },
                {
                    "sent": "You either find a solution or you give up after few months, but you don't give up forever.",
                    "label": 0
                },
                {
                    "sent": "I mean just repeat it after you get a new idea.",
                    "label": 0
                },
                {
                    "sent": "Maybe in a year or two.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So we definitely continue with this endeavors, and that's a very good.",
                    "label": 0
                },
                {
                    "sent": "I mean.",
                    "label": 0
                },
                {
                    "sent": "For example, there is this.",
                    "label": 0
                },
                {
                    "sent": "Their results for exclusion processes on the relaxation dynamics they have to do with finding appropriate better equations, because to find the full spectrum of the revillon you have to find appropriate better equations.",
                    "label": 0
                },
                {
                    "sent": "And here we don't have a clue how the structure of this medication should be.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "We are working with very slow now on the model which is related to that on this classical deterministic model with stochastic boundaries.",
                    "label": 0
                },
                {
                    "sent": "This is probably the simplest model and for this model I have the strongest hope that we'll be able to find the full spectrum.",
                    "label": 0
                },
                {
                    "sent": "That's why I like it.",
                    "label": 0
                },
                {
                    "sent": "It's about the simplest, even more bizarre in some sense in terms of simplicity.",
                    "label": 0
                },
                {
                    "sent": "Just before we thank you for the second time, I have a very simple question so you were talking about your results in East documents.",
                    "label": 0
                },
                {
                    "sent": "Results about the spin, spin correlation and I imagine that there's a handwaving interpretation of you know why does the spin spin correlation function beyond the phase transition becomes so elaborated?",
                    "label": 0
                },
                {
                    "sent": "So what's the interpretation?",
                    "label": 0
                },
                {
                    "sent": "So the interpretation as I I tried to give you, but I was probably too quick and not too too explicit.",
                    "label": 0
                },
                {
                    "sent": "But you write out.",
                    "label": 0
                },
                {
                    "sent": "Basically, you write the equation of motion for the covariances, which is basically a handful situation.",
                    "label": 0
                },
                {
                    "sent": "And the code of the parameter K square wave number square.",
                    "label": 0
                },
                {
                    "sent": "Is it simply the difference of magnetic field to the critical field?",
                    "label": 0
                },
                {
                    "sent": "So and then you see if it's positive you have real ways.",
                    "label": 0
                },
                {
                    "sent": "When it's negative, K squared is negative is imaginary, have been established, have decay of correlations.",
                    "label": 0
                },
                {
                    "sent": "OK, now I'm not sure if you can see that this is a physical explanation, but that's something that you can really do.",
                    "label": 0
                },
                {
                    "sent": "You really see what where things come from.",
                    "label": 0
                },
                {
                    "sent": "So basically I call this understanding at the end, but.",
                    "label": 0
                },
                {
                    "sent": "Let's thank Professor Putin again.",
                    "label": 0
                }
            ]
        }
    }
}