{
    "id": "7q5rbrbsusw7qugldkskx5tmnfagbe4k",
    "title": "Digital Content Management Standards for the Personalised Multlingual Web",
    "info": {
        "author": [
            "Alexander O'Connor, CNGL/Trinity College Dublin, The University of Dublin"
        ],
        "published": "Dec. 12, 2011",
        "recorded": "October 2011",
        "category": [
            "Top->Computer Science->Multilingual Information Access"
        ]
    },
    "url": "http://videolectures.net/w3cworkshop2011_oconnor_standards/",
    "segmentation": [
        [
            "Hi everyone, my name is Alex O'Connor.",
            "I'm a postdoctoral researcher in Trinity College working with this Center for next Generation localization project in the TCM truck.",
            "So we work in digital content management personalization.",
            "My objective with this talk is to take you through what personalization means at the moment on the Web, plot standards, and more importantly, what lacking of standards.",
            "There are.",
            "Some of the practices that exist and perhaps hopefully fertilize some thought on hand.",
            "Multilingual aspects might be."
        ],
        [
            "So.",
            "Where do we stand nowadays?",
            "Is 950,000 books available to buy on the Kindle, and that's a doubling of 175% on last year there are 750 million Facebook users.",
            "Each team has an average of 138 friends.",
            "This 48 hours of video uploaded every minute to YouTube.",
            "And we have 200 million tweets a day.",
            "I'm reliably informed by Twitter that there are 200 tweets a minute on.",
            "The weather alone is an enormous amount of content to deal with.",
            "We have this situation that we stand with this.",
            "The Web 2.0 at an absolutely enormous quantity of data, far more than we've ever been able to look at before, and far more in our fingertips there before all of this data is available to anyone sitting at any terminal, anywhere in the world.",
            "Increasingly, all of these companies, if you look at their reports, their data on their usage, what they're seeing is the pie chart is getting smaller on English side and much much larger on the international side.",
            "They're all looking to support multi lingual techniques.",
            "They're all looking to help people connect to each other, connect to the things that they want, connect what they want to find, and that's a big portion of personalization."
        ],
        [
            "And this feeling being able to take a photo.",
            "Now, this is what I did to suggest the audience that we have here to connect personalization to localization is one of the big challenges.",
            "When you think about what it means, localization, internationalization, or the process of making information more available to the people to people or communicated to individual groups of people so you can talk to people in terms of their culture.",
            "Talk to people in terms of their language, folks, people in terms of their scripts, everything that they need becomes more and more accessible.",
            "So it's one way of dividing the world so that your audience gets access to what it needs.",
            "But you could also think that there are other ways to do that beyond.",
            "Rendering the content you need to get them connected to the content they need to be able to find it.",
            "You need to get them to understand the content, not just in terms of language, but in terms of the terminology in terms of the explanations.",
            "If it's a very technical document, I probably wouldn't want someone who isn't technical reading it.",
            "So what we think is that the that standing on this massive quantity of data we have to start seeing that.",
            "Web can be summarized as interest.",
            "Web 2.0 is about interaction.",
            "It was about the massive populist pushing vast quantities of data up onto the web, creating an unprecedented quantity.",
            "People have talked about it as being called the beginning of history.",
            "Everything out there is documented to an extraordinary degree.",
            "Now we need to actually sort through.",
            "We need to recommend things to people.",
            "We need to personalize things to people so that their individual needs are served and so that they're not swimming in this intractable, massive content.",
            "As a very simple example of what I mean by the linking between internationalization.",
            "Localization and personalization.",
            "I couldn't stop PowerPoint from correcting my spelling all afternoon.",
            "It was driving me mad and in fact I like the collection of software.",
            "Some of it thinks I speak in American.",
            "Some of the things I speak in English, that Zedd S thing is a very simple example of the sort of things that we should be able to personalize transparency.",
            "Now that we can."
        ],
        [
            "So some quick examples of what personalization means today on the web, and if you go to google.com/history and specifically slash delete.",
            "In my case, what you will find is that you can enable or disable Google tracking what you search through their site.",
            "They will use that information to promote your own search results based on what you want.",
            "They will therefore choose page is more suitable to your interests.",
            "Because of that, you can actually extend it further.",
            "You can install the Google Toolbar and if you look at what sites you visit and use that all that information.",
            "In a large track, to do so, to improve their search results for you.",
            "And they experimented with other methods.",
            "This is 1 and Microsoft Bing.",
            "They said that they use 150 or so different senses to try and personalize, search and improve search and you can see all of these sorts of situations occur because.",
            "There's a quest to take this results page and make it actually relevant to what you're searching, because your task is far more subtle, far more contextual Ising far richer than a simple set of 3.5 keywords will actually tell you."
        ],
        [
            "The second one is the one that no one has seen.",
            "As far as I can tell, that does anyone here manage their recommendations on Amazon?",
            "One person so one person can be, so that's two of us and.",
            "Amazon recommends things to you based on your purchases based on your views based on right now based on what other people have you done, your wish lists and actually tell Amazon whether something already, whether or not it was a present and you can rate your views of quite good.",
            "It was and you can say things like don't use a certain thing that I bought for recommendations.",
            "People who complain about the low quality of recommendation actually often find that by doing a little bit of pruning on the system you can greatly improve it, but most people don't.",
            "But those are probably the two most prominent ways that content is being personalized and recommended right now.",
            "It's no longer a situation that I, when I search and put a certain set of search terms into the Google query box, that you get is the same as what I get where we are, who we are, and what we've done before all matters."
        ],
        [
            "So what is personalization?",
            "In a nutshell, we take three things, the user model, which is a representation of the person operating the system domain model, which is a representation of the subject domain that we're looking at, and a content model, which is what we're going to be recommending or personalizing on.",
            "And we throw those into what we like to call a strategy or a bucket, or whatever way you want to think about it.",
            "It's very straightforward at this sort of incredibly abstract level, but you just have to think about is that I have a set of things that I need to rearrange, pick from or reorder.",
            "I have a model of a user.",
            "I can reconcile that to the main and I have some strategies and tools for doing that, some plan."
        ],
        [
            "Very broadly extremely broadly, and there are kind of two ways.",
            "Two schools of thought on how this works.",
            "The first goal is off is what we might call the collaborative models, so these are on the right here.",
            "These are what we see when we look at specifically things like Amazon, specifically, things like the Netflix Prize is what they do is that they say, OK, we'll take everyone in the world who uses our system and will use them to help us decide how to recommend things to each other.",
            "So what we can say is OK.",
            "User A hasn't viewed this movie, but user B is quite like him or user base quite like him.",
            "So what user beyliks user anyone like and that's what we call a user based collaborative filtering.",
            "We can flip that on its head and we can say that most of the people who like movie hey also like movie be so anyone who likes movie A we can begin to do that and you can see that in the most simple terms is what you might call a collaborative models.",
            "They work on enormous quantities of data.",
            "They are highly tuned, extremely hard mathematics and the result is that you get these recommendations on a broad scale very quickly.",
            "On the flip side, you have what you might call the knowledge models, so you can just have a rule based system.",
            "If a user looks at such and such an item, then give them the next one here at classic example of this is a syllabus in the learning context.",
            "If I say the student I teach them first about the existence of character sets, then I teach them about the existence of internationalization tags.",
            "Then I teach them about the notion of term banks and so on.",
            "All of these things can build upon each other.",
            "You can think of them as a logical chain.",
            "And in chaining process.",
            "If I want to be slightly richer than that, I can look at things like an analogical model where I have a full scale domain described in a description logic, and I use that navigate that to try and give the user an automated view or a knowledge driven view.",
            "The world.",
            "The parallels with translation machine translation are Stark.",
            "In my view.",
            "I mean this example based or blue based side and this the statistical sign.",
            "In fact a lot of I gather a lot of the algorithms look like each other in a lot of the tools look like each other, so the reason I started with strategy is that this.",
            "I'm going to ramp up on the content.",
            "The interest from a standards perspective.",
            "How much standards description you can do in here or not?"
        ],
        [
            "Content standards, on the other hand, well, this is a situation where I'm talking to people who know far more about it than I do.",
            "But broadly I'm going to divide them into two areas.",
            "There are semantic and non semantic standards out there.",
            "We have all of the XML based standards, Docbook dealer, Dublin Core.",
            "We have HTML which I've taken out from XML and we have things like the micro formats which are embedded pieces of distinct information within the within.",
            "Other types of content.",
            "So what the value of this is?",
            "But we can begin to see what we need in order to be able to personalize, we need to have some identifiable set of things to reorder.",
            "OK, think about it in this way.",
            "If I just have large dreams of text, all I can do is tell you what documents pick.",
            "That's the classic search engine.",
            "If I know about the segments of a document that I might be able to pick a particular segment for you.",
            "If I know about the topics like in a data or adult book document, I can begin to go further down.",
            "I can pick introductory content, I can pick content that's related to other content.",
            "And with microformats I can even say OK. Well, I think he needs a contact.",
            "I can take a task oriented view of this and say if I if someone previously for the task for the.",
            "The contact details for Alex O'Connor.",
            "I can think.",
            "OK, well, let's look for a vCard rather than something else.",
            "All of these simple things results some together into a richer experience for the user of personalized experience.",
            "On the other side, you have already F. You have things like our DFA which lets you embed this semantics in HTML.",
            "We have friend of a friend which is a friend of friend Dublin Core in Shock.",
            "Are notable because they're high use in the area of linked data, and there's already a lot of information coming in, so in terms of content standards, anything out there that's already a content standard is tractable for personalization.",
            "The ruler personalization generally is that we're trying to take what exists already and added on top.",
            "We're not trying to start again from the model."
        ],
        [
            "In terms of domain models, there's just two things I'm going to speak about.",
            "One is this link data cloud, which is probably the research driven side of things, and I think most people are probably familiar with this notion that people are now publishing vast quantities of data on this link data web, interlinking it altogether so that statements are becoming equivalent so that we're beginning to see these concepts bleeding across different conceptual boundaries.",
            "I can talk about Berlin in an encyclopedic fashion.",
            "I can talk about it in a geographic fashion.",
            "I can say that if.",
            "AM.",
            "Research paper refers to the city of Berlin.",
            "I know what coordinates refer to, and I know what where that might be in a map.",
            "That's very much the research driven side.",
            "It's a very effective tool, and on the other side we have bookmarked, but relatively recently been called schema.org, which is a Microsoft, Bing, Yahoo, and Google have agreed, sort of a common ontology or common domain model that expresses notions such as persons, expressions, notions, such as reviews, and so on together, and builds them in in that fashion.",
            "So the interesting tension between them is."
        ],
        [
            "Is emergent.",
            "OK user models.",
            "There are two types of user models.",
            "The first one is the footprints in the sand or implicit model.",
            "It's your web history, it's what you've clicked.",
            "It's where you search is what's tweets and status updates you made, and it's your purchase history.",
            "Why is this an implicit model?",
            "Because we're not actually asking you what you think of something we're looking at your actions and inferring a recommendation.",
            "OK, that could be highly effective because users don't like managing their recommendations, as evidenced by Maestro Polista who actually manages their recommendations in the room.",
            "The value of this.",
            "Ann is that we could just keep collecting.",
            "It is.",
            "It's extremely useful for statistical purposes because we can just take 2 million tweets and try and decide."
        ],
        [
            "We have, we also might call the explicit model which I like to think of as a form.",
            "OK, these are when you like something plus one something bookmark, something, retweet, something great, something dislike it, or express a set of interests.",
            "Couple of things.",
            "I point out.",
            "First of all, bookmarks are kind of in between right?",
            "Because they may be interested in the sense that you may not bookmark them for recommendation.",
            "The other thing is that dislikes.",
            "Turn out to be.",
            "Useful but difficult.",
            "More difficult to get.",
            "Hence the fact that we don't see them very much.",
            "And finally the ratings are very hard to collect because humans are organic creatures and their horribly inconsistent, and so it's very hard to get people to consistently write things, so it's often better to have a plus or a minus than it is to have or just a plus on its own.",
            "Then it is to have 3.5 stars out of five, and that's the best example of that.",
            "Is the way YouTube moved to that model.",
            "They went from a star rating system to a thumbs up thumbs down system.",
            "Because of that consistency issue, or I gather they have."
        ],
        [
            "What standards are out there?",
            "Well, OK, in this case there are very few.",
            "There are lots of practices that are clear.",
            "OK, we have Jason, we have rest.",
            "We have these share buttons that we embed on pages in terms of identifying people.",
            "Well, there's kind of three things that matter.",
            "There's openid.",
            "There's Oauth, which you see if you use Twitter or anything to embed a credential, and there's a movement related to the linked data movement called a web ID model, which is a full profile plus an SSL CERT.",
            "These are pretty bare standards at the moment, and they build together careful."
        ],
        [
            "I just briefly talk about two other sets of standards, alot of personalization research started in the education area and we have things like the learner information profile, the learning data, sorry, and the and then another package thing for cassette altogether and pushing it altogether called SCORM.",
            "These things might be of interest to people who are interested in localization, package packaging, localization, job transfer because some of this stuff is in that relevant area.",
            "Another thing to note is that for internationalization people Philip Community will probably have a pang of nostalgia for you because they're address name, another internationalization standard context is supremely complex to try to accommodate all the different types of culture, and that they did extremely well, but it makes it very very.",
            "What's the word.",
            "Impressive Apml is a standard for managing an attention and bookmarks and so on, but unfortunately it doesn't seem to have all that much activity at the moment."
        ],
        [
            "I mentioned very briefly because I'm running out of time.",
            "There is the data portability project, which is the objective of making this information back.",
            "Come back to the owner at the moment, the processes that the providers are owning, the data, and there's this state saying on the web that if you're not paying for the if you're not paying for the product, you are the product.",
            "There is some movement in this area.",
            "Facebook and Google Plus both allow you to export your data.",
            "However, at the standards in those situations are extremely obscuring my view.",
            "So for example with Google plus, you get Netscape bookmark HTML files for your links and you get role HTML for your posts.",
            "You get the cards for your Contacts.",
            "With Facebook you just get range of HTML."
        ],
        [
            "Privacy very briefly related to this area, is that we really need to think about how people are going to feel about this in future.",
            "People do feel that they, if they aren't given a contract, that they agree with.",
            "If they aren't given something, the terms that they like, they're going to be about, they're going to feel bad about this Google or introducing a project called Google Wallet soon, which will attach your purchases for, and a near field communications to your to your web history.",
            "So now we have everything come together, so that's another interesting thing.",
            "The other thing is monetization.",
            "We as researchers think money is below us, of course, but everyone else should be thinking about how do you monetize this without necessarily these blackout practices.",
            "Or not those black boots."
        ],
        [
            "OK, challenges and opportunities.",
            "This is my final slide.",
            "Randomized recommendation.",
            "A lot of people are worried also, but they're being blinkered by recommendation.",
            "I'm only getting people I agree with.",
            "I'm only getting articles I've read before.",
            "I'm only getting things that I want to see.",
            "The world is now Rosier Place, but I'm I'm less of a person.",
            "So the question of how you do that is an interesting one.",
            "Jeff Atwood speaks about the Internet driving license.",
            "How do we take open ID web ID?",
            "And so I want to make it a meaningful way so I don't have to create an account on every website.",
            "Contact globalization is a good one, and finally the use of context."
        ],
        [
            "I'll be speaking about this during the our own research later on in the week.",
            "I'm sorry."
        ],
        [
            "Running out of time."
        ],
        [
            "And I'll just pass my credits in my."
        ],
        [
            "Sources acknowledge the essay."
        ],
        [
            "Diane Project, thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hi everyone, my name is Alex O'Connor.",
                    "label": 0
                },
                {
                    "sent": "I'm a postdoctoral researcher in Trinity College working with this Center for next Generation localization project in the TCM truck.",
                    "label": 0
                },
                {
                    "sent": "So we work in digital content management personalization.",
                    "label": 1
                },
                {
                    "sent": "My objective with this talk is to take you through what personalization means at the moment on the Web, plot standards, and more importantly, what lacking of standards.",
                    "label": 0
                },
                {
                    "sent": "There are.",
                    "label": 0
                },
                {
                    "sent": "Some of the practices that exist and perhaps hopefully fertilize some thought on hand.",
                    "label": 0
                },
                {
                    "sent": "Multilingual aspects might be.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Where do we stand nowadays?",
                    "label": 1
                },
                {
                    "sent": "Is 950,000 books available to buy on the Kindle, and that's a doubling of 175% on last year there are 750 million Facebook users.",
                    "label": 0
                },
                {
                    "sent": "Each team has an average of 138 friends.",
                    "label": 0
                },
                {
                    "sent": "This 48 hours of video uploaded every minute to YouTube.",
                    "label": 1
                },
                {
                    "sent": "And we have 200 million tweets a day.",
                    "label": 0
                },
                {
                    "sent": "I'm reliably informed by Twitter that there are 200 tweets a minute on.",
                    "label": 0
                },
                {
                    "sent": "The weather alone is an enormous amount of content to deal with.",
                    "label": 0
                },
                {
                    "sent": "We have this situation that we stand with this.",
                    "label": 0
                },
                {
                    "sent": "The Web 2.0 at an absolutely enormous quantity of data, far more than we've ever been able to look at before, and far more in our fingertips there before all of this data is available to anyone sitting at any terminal, anywhere in the world.",
                    "label": 0
                },
                {
                    "sent": "Increasingly, all of these companies, if you look at their reports, their data on their usage, what they're seeing is the pie chart is getting smaller on English side and much much larger on the international side.",
                    "label": 0
                },
                {
                    "sent": "They're all looking to support multi lingual techniques.",
                    "label": 0
                },
                {
                    "sent": "They're all looking to help people connect to each other, connect to the things that they want, connect what they want to find, and that's a big portion of personalization.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this feeling being able to take a photo.",
                    "label": 0
                },
                {
                    "sent": "Now, this is what I did to suggest the audience that we have here to connect personalization to localization is one of the big challenges.",
                    "label": 0
                },
                {
                    "sent": "When you think about what it means, localization, internationalization, or the process of making information more available to the people to people or communicated to individual groups of people so you can talk to people in terms of their culture.",
                    "label": 0
                },
                {
                    "sent": "Talk to people in terms of their language, folks, people in terms of their scripts, everything that they need becomes more and more accessible.",
                    "label": 0
                },
                {
                    "sent": "So it's one way of dividing the world so that your audience gets access to what it needs.",
                    "label": 0
                },
                {
                    "sent": "But you could also think that there are other ways to do that beyond.",
                    "label": 0
                },
                {
                    "sent": "Rendering the content you need to get them connected to the content they need to be able to find it.",
                    "label": 0
                },
                {
                    "sent": "You need to get them to understand the content, not just in terms of language, but in terms of the terminology in terms of the explanations.",
                    "label": 0
                },
                {
                    "sent": "If it's a very technical document, I probably wouldn't want someone who isn't technical reading it.",
                    "label": 0
                },
                {
                    "sent": "So what we think is that the that standing on this massive quantity of data we have to start seeing that.",
                    "label": 0
                },
                {
                    "sent": "Web can be summarized as interest.",
                    "label": 1
                },
                {
                    "sent": "Web 2.0 is about interaction.",
                    "label": 0
                },
                {
                    "sent": "It was about the massive populist pushing vast quantities of data up onto the web, creating an unprecedented quantity.",
                    "label": 0
                },
                {
                    "sent": "People have talked about it as being called the beginning of history.",
                    "label": 0
                },
                {
                    "sent": "Everything out there is documented to an extraordinary degree.",
                    "label": 0
                },
                {
                    "sent": "Now we need to actually sort through.",
                    "label": 0
                },
                {
                    "sent": "We need to recommend things to people.",
                    "label": 0
                },
                {
                    "sent": "We need to personalize things to people so that their individual needs are served and so that they're not swimming in this intractable, massive content.",
                    "label": 0
                },
                {
                    "sent": "As a very simple example of what I mean by the linking between internationalization.",
                    "label": 0
                },
                {
                    "sent": "Localization and personalization.",
                    "label": 0
                },
                {
                    "sent": "I couldn't stop PowerPoint from correcting my spelling all afternoon.",
                    "label": 0
                },
                {
                    "sent": "It was driving me mad and in fact I like the collection of software.",
                    "label": 0
                },
                {
                    "sent": "Some of it thinks I speak in American.",
                    "label": 0
                },
                {
                    "sent": "Some of the things I speak in English, that Zedd S thing is a very simple example of the sort of things that we should be able to personalize transparency.",
                    "label": 0
                },
                {
                    "sent": "Now that we can.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So some quick examples of what personalization means today on the web, and if you go to google.com/history and specifically slash delete.",
                    "label": 0
                },
                {
                    "sent": "In my case, what you will find is that you can enable or disable Google tracking what you search through their site.",
                    "label": 0
                },
                {
                    "sent": "They will use that information to promote your own search results based on what you want.",
                    "label": 0
                },
                {
                    "sent": "They will therefore choose page is more suitable to your interests.",
                    "label": 0
                },
                {
                    "sent": "Because of that, you can actually extend it further.",
                    "label": 0
                },
                {
                    "sent": "You can install the Google Toolbar and if you look at what sites you visit and use that all that information.",
                    "label": 0
                },
                {
                    "sent": "In a large track, to do so, to improve their search results for you.",
                    "label": 0
                },
                {
                    "sent": "And they experimented with other methods.",
                    "label": 0
                },
                {
                    "sent": "This is 1 and Microsoft Bing.",
                    "label": 0
                },
                {
                    "sent": "They said that they use 150 or so different senses to try and personalize, search and improve search and you can see all of these sorts of situations occur because.",
                    "label": 0
                },
                {
                    "sent": "There's a quest to take this results page and make it actually relevant to what you're searching, because your task is far more subtle, far more contextual Ising far richer than a simple set of 3.5 keywords will actually tell you.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The second one is the one that no one has seen.",
                    "label": 0
                },
                {
                    "sent": "As far as I can tell, that does anyone here manage their recommendations on Amazon?",
                    "label": 0
                },
                {
                    "sent": "One person so one person can be, so that's two of us and.",
                    "label": 0
                },
                {
                    "sent": "Amazon recommends things to you based on your purchases based on your views based on right now based on what other people have you done, your wish lists and actually tell Amazon whether something already, whether or not it was a present and you can rate your views of quite good.",
                    "label": 0
                },
                {
                    "sent": "It was and you can say things like don't use a certain thing that I bought for recommendations.",
                    "label": 0
                },
                {
                    "sent": "People who complain about the low quality of recommendation actually often find that by doing a little bit of pruning on the system you can greatly improve it, but most people don't.",
                    "label": 0
                },
                {
                    "sent": "But those are probably the two most prominent ways that content is being personalized and recommended right now.",
                    "label": 0
                },
                {
                    "sent": "It's no longer a situation that I, when I search and put a certain set of search terms into the Google query box, that you get is the same as what I get where we are, who we are, and what we've done before all matters.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is personalization?",
                    "label": 0
                },
                {
                    "sent": "In a nutshell, we take three things, the user model, which is a representation of the person operating the system domain model, which is a representation of the subject domain that we're looking at, and a content model, which is what we're going to be recommending or personalizing on.",
                    "label": 1
                },
                {
                    "sent": "And we throw those into what we like to call a strategy or a bucket, or whatever way you want to think about it.",
                    "label": 0
                },
                {
                    "sent": "It's very straightforward at this sort of incredibly abstract level, but you just have to think about is that I have a set of things that I need to rearrange, pick from or reorder.",
                    "label": 0
                },
                {
                    "sent": "I have a model of a user.",
                    "label": 0
                },
                {
                    "sent": "I can reconcile that to the main and I have some strategies and tools for doing that, some plan.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Very broadly extremely broadly, and there are kind of two ways.",
                    "label": 0
                },
                {
                    "sent": "Two schools of thought on how this works.",
                    "label": 0
                },
                {
                    "sent": "The first goal is off is what we might call the collaborative models, so these are on the right here.",
                    "label": 1
                },
                {
                    "sent": "These are what we see when we look at specifically things like Amazon, specifically, things like the Netflix Prize is what they do is that they say, OK, we'll take everyone in the world who uses our system and will use them to help us decide how to recommend things to each other.",
                    "label": 0
                },
                {
                    "sent": "So what we can say is OK.",
                    "label": 0
                },
                {
                    "sent": "User A hasn't viewed this movie, but user B is quite like him or user base quite like him.",
                    "label": 0
                },
                {
                    "sent": "So what user beyliks user anyone like and that's what we call a user based collaborative filtering.",
                    "label": 0
                },
                {
                    "sent": "We can flip that on its head and we can say that most of the people who like movie hey also like movie be so anyone who likes movie A we can begin to do that and you can see that in the most simple terms is what you might call a collaborative models.",
                    "label": 0
                },
                {
                    "sent": "They work on enormous quantities of data.",
                    "label": 0
                },
                {
                    "sent": "They are highly tuned, extremely hard mathematics and the result is that you get these recommendations on a broad scale very quickly.",
                    "label": 1
                },
                {
                    "sent": "On the flip side, you have what you might call the knowledge models, so you can just have a rule based system.",
                    "label": 0
                },
                {
                    "sent": "If a user looks at such and such an item, then give them the next one here at classic example of this is a syllabus in the learning context.",
                    "label": 0
                },
                {
                    "sent": "If I say the student I teach them first about the existence of character sets, then I teach them about the existence of internationalization tags.",
                    "label": 0
                },
                {
                    "sent": "Then I teach them about the notion of term banks and so on.",
                    "label": 0
                },
                {
                    "sent": "All of these things can build upon each other.",
                    "label": 0
                },
                {
                    "sent": "You can think of them as a logical chain.",
                    "label": 0
                },
                {
                    "sent": "And in chaining process.",
                    "label": 0
                },
                {
                    "sent": "If I want to be slightly richer than that, I can look at things like an analogical model where I have a full scale domain described in a description logic, and I use that navigate that to try and give the user an automated view or a knowledge driven view.",
                    "label": 0
                },
                {
                    "sent": "The world.",
                    "label": 0
                },
                {
                    "sent": "The parallels with translation machine translation are Stark.",
                    "label": 0
                },
                {
                    "sent": "In my view.",
                    "label": 0
                },
                {
                    "sent": "I mean this example based or blue based side and this the statistical sign.",
                    "label": 0
                },
                {
                    "sent": "In fact a lot of I gather a lot of the algorithms look like each other in a lot of the tools look like each other, so the reason I started with strategy is that this.",
                    "label": 0
                },
                {
                    "sent": "I'm going to ramp up on the content.",
                    "label": 0
                },
                {
                    "sent": "The interest from a standards perspective.",
                    "label": 0
                },
                {
                    "sent": "How much standards description you can do in here or not?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Content standards, on the other hand, well, this is a situation where I'm talking to people who know far more about it than I do.",
                    "label": 1
                },
                {
                    "sent": "But broadly I'm going to divide them into two areas.",
                    "label": 0
                },
                {
                    "sent": "There are semantic and non semantic standards out there.",
                    "label": 0
                },
                {
                    "sent": "We have all of the XML based standards, Docbook dealer, Dublin Core.",
                    "label": 0
                },
                {
                    "sent": "We have HTML which I've taken out from XML and we have things like the micro formats which are embedded pieces of distinct information within the within.",
                    "label": 0
                },
                {
                    "sent": "Other types of content.",
                    "label": 0
                },
                {
                    "sent": "So what the value of this is?",
                    "label": 0
                },
                {
                    "sent": "But we can begin to see what we need in order to be able to personalize, we need to have some identifiable set of things to reorder.",
                    "label": 0
                },
                {
                    "sent": "OK, think about it in this way.",
                    "label": 0
                },
                {
                    "sent": "If I just have large dreams of text, all I can do is tell you what documents pick.",
                    "label": 0
                },
                {
                    "sent": "That's the classic search engine.",
                    "label": 0
                },
                {
                    "sent": "If I know about the segments of a document that I might be able to pick a particular segment for you.",
                    "label": 0
                },
                {
                    "sent": "If I know about the topics like in a data or adult book document, I can begin to go further down.",
                    "label": 0
                },
                {
                    "sent": "I can pick introductory content, I can pick content that's related to other content.",
                    "label": 0
                },
                {
                    "sent": "And with microformats I can even say OK. Well, I think he needs a contact.",
                    "label": 0
                },
                {
                    "sent": "I can take a task oriented view of this and say if I if someone previously for the task for the.",
                    "label": 0
                },
                {
                    "sent": "The contact details for Alex O'Connor.",
                    "label": 0
                },
                {
                    "sent": "I can think.",
                    "label": 0
                },
                {
                    "sent": "OK, well, let's look for a vCard rather than something else.",
                    "label": 0
                },
                {
                    "sent": "All of these simple things results some together into a richer experience for the user of personalized experience.",
                    "label": 0
                },
                {
                    "sent": "On the other side, you have already F. You have things like our DFA which lets you embed this semantics in HTML.",
                    "label": 0
                },
                {
                    "sent": "We have friend of a friend which is a friend of friend Dublin Core in Shock.",
                    "label": 0
                },
                {
                    "sent": "Are notable because they're high use in the area of linked data, and there's already a lot of information coming in, so in terms of content standards, anything out there that's already a content standard is tractable for personalization.",
                    "label": 0
                },
                {
                    "sent": "The ruler personalization generally is that we're trying to take what exists already and added on top.",
                    "label": 0
                },
                {
                    "sent": "We're not trying to start again from the model.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In terms of domain models, there's just two things I'm going to speak about.",
                    "label": 0
                },
                {
                    "sent": "One is this link data cloud, which is probably the research driven side of things, and I think most people are probably familiar with this notion that people are now publishing vast quantities of data on this link data web, interlinking it altogether so that statements are becoming equivalent so that we're beginning to see these concepts bleeding across different conceptual boundaries.",
                    "label": 0
                },
                {
                    "sent": "I can talk about Berlin in an encyclopedic fashion.",
                    "label": 0
                },
                {
                    "sent": "I can talk about it in a geographic fashion.",
                    "label": 0
                },
                {
                    "sent": "I can say that if.",
                    "label": 0
                },
                {
                    "sent": "AM.",
                    "label": 0
                },
                {
                    "sent": "Research paper refers to the city of Berlin.",
                    "label": 0
                },
                {
                    "sent": "I know what coordinates refer to, and I know what where that might be in a map.",
                    "label": 0
                },
                {
                    "sent": "That's very much the research driven side.",
                    "label": 0
                },
                {
                    "sent": "It's a very effective tool, and on the other side we have bookmarked, but relatively recently been called schema.org, which is a Microsoft, Bing, Yahoo, and Google have agreed, sort of a common ontology or common domain model that expresses notions such as persons, expressions, notions, such as reviews, and so on together, and builds them in in that fashion.",
                    "label": 0
                },
                {
                    "sent": "So the interesting tension between them is.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is emergent.",
                    "label": 0
                },
                {
                    "sent": "OK user models.",
                    "label": 0
                },
                {
                    "sent": "There are two types of user models.",
                    "label": 0
                },
                {
                    "sent": "The first one is the footprints in the sand or implicit model.",
                    "label": 0
                },
                {
                    "sent": "It's your web history, it's what you've clicked.",
                    "label": 1
                },
                {
                    "sent": "It's where you search is what's tweets and status updates you made, and it's your purchase history.",
                    "label": 1
                },
                {
                    "sent": "Why is this an implicit model?",
                    "label": 0
                },
                {
                    "sent": "Because we're not actually asking you what you think of something we're looking at your actions and inferring a recommendation.",
                    "label": 0
                },
                {
                    "sent": "OK, that could be highly effective because users don't like managing their recommendations, as evidenced by Maestro Polista who actually manages their recommendations in the room.",
                    "label": 0
                },
                {
                    "sent": "The value of this.",
                    "label": 0
                },
                {
                    "sent": "Ann is that we could just keep collecting.",
                    "label": 0
                },
                {
                    "sent": "It is.",
                    "label": 0
                },
                {
                    "sent": "It's extremely useful for statistical purposes because we can just take 2 million tweets and try and decide.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have, we also might call the explicit model which I like to think of as a form.",
                    "label": 1
                },
                {
                    "sent": "OK, these are when you like something plus one something bookmark, something, retweet, something great, something dislike it, or express a set of interests.",
                    "label": 0
                },
                {
                    "sent": "Couple of things.",
                    "label": 0
                },
                {
                    "sent": "I point out.",
                    "label": 0
                },
                {
                    "sent": "First of all, bookmarks are kind of in between right?",
                    "label": 0
                },
                {
                    "sent": "Because they may be interested in the sense that you may not bookmark them for recommendation.",
                    "label": 0
                },
                {
                    "sent": "The other thing is that dislikes.",
                    "label": 0
                },
                {
                    "sent": "Turn out to be.",
                    "label": 0
                },
                {
                    "sent": "Useful but difficult.",
                    "label": 0
                },
                {
                    "sent": "More difficult to get.",
                    "label": 0
                },
                {
                    "sent": "Hence the fact that we don't see them very much.",
                    "label": 0
                },
                {
                    "sent": "And finally the ratings are very hard to collect because humans are organic creatures and their horribly inconsistent, and so it's very hard to get people to consistently write things, so it's often better to have a plus or a minus than it is to have or just a plus on its own.",
                    "label": 0
                },
                {
                    "sent": "Then it is to have 3.5 stars out of five, and that's the best example of that.",
                    "label": 0
                },
                {
                    "sent": "Is the way YouTube moved to that model.",
                    "label": 0
                },
                {
                    "sent": "They went from a star rating system to a thumbs up thumbs down system.",
                    "label": 0
                },
                {
                    "sent": "Because of that consistency issue, or I gather they have.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What standards are out there?",
                    "label": 0
                },
                {
                    "sent": "Well, OK, in this case there are very few.",
                    "label": 0
                },
                {
                    "sent": "There are lots of practices that are clear.",
                    "label": 0
                },
                {
                    "sent": "OK, we have Jason, we have rest.",
                    "label": 0
                },
                {
                    "sent": "We have these share buttons that we embed on pages in terms of identifying people.",
                    "label": 0
                },
                {
                    "sent": "Well, there's kind of three things that matter.",
                    "label": 0
                },
                {
                    "sent": "There's openid.",
                    "label": 0
                },
                {
                    "sent": "There's Oauth, which you see if you use Twitter or anything to embed a credential, and there's a movement related to the linked data movement called a web ID model, which is a full profile plus an SSL CERT.",
                    "label": 0
                },
                {
                    "sent": "These are pretty bare standards at the moment, and they build together careful.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I just briefly talk about two other sets of standards, alot of personalization research started in the education area and we have things like the learner information profile, the learning data, sorry, and the and then another package thing for cassette altogether and pushing it altogether called SCORM.",
                    "label": 0
                },
                {
                    "sent": "These things might be of interest to people who are interested in localization, package packaging, localization, job transfer because some of this stuff is in that relevant area.",
                    "label": 0
                },
                {
                    "sent": "Another thing to note is that for internationalization people Philip Community will probably have a pang of nostalgia for you because they're address name, another internationalization standard context is supremely complex to try to accommodate all the different types of culture, and that they did extremely well, but it makes it very very.",
                    "label": 0
                },
                {
                    "sent": "What's the word.",
                    "label": 0
                },
                {
                    "sent": "Impressive Apml is a standard for managing an attention and bookmarks and so on, but unfortunately it doesn't seem to have all that much activity at the moment.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I mentioned very briefly because I'm running out of time.",
                    "label": 0
                },
                {
                    "sent": "There is the data portability project, which is the objective of making this information back.",
                    "label": 0
                },
                {
                    "sent": "Come back to the owner at the moment, the processes that the providers are owning, the data, and there's this state saying on the web that if you're not paying for the if you're not paying for the product, you are the product.",
                    "label": 0
                },
                {
                    "sent": "There is some movement in this area.",
                    "label": 0
                },
                {
                    "sent": "Facebook and Google Plus both allow you to export your data.",
                    "label": 0
                },
                {
                    "sent": "However, at the standards in those situations are extremely obscuring my view.",
                    "label": 0
                },
                {
                    "sent": "So for example with Google plus, you get Netscape bookmark HTML files for your links and you get role HTML for your posts.",
                    "label": 0
                },
                {
                    "sent": "You get the cards for your Contacts.",
                    "label": 0
                },
                {
                    "sent": "With Facebook you just get range of HTML.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Privacy very briefly related to this area, is that we really need to think about how people are going to feel about this in future.",
                    "label": 0
                },
                {
                    "sent": "People do feel that they, if they aren't given a contract, that they agree with.",
                    "label": 0
                },
                {
                    "sent": "If they aren't given something, the terms that they like, they're going to be about, they're going to feel bad about this Google or introducing a project called Google Wallet soon, which will attach your purchases for, and a near field communications to your to your web history.",
                    "label": 0
                },
                {
                    "sent": "So now we have everything come together, so that's another interesting thing.",
                    "label": 0
                },
                {
                    "sent": "The other thing is monetization.",
                    "label": 0
                },
                {
                    "sent": "We as researchers think money is below us, of course, but everyone else should be thinking about how do you monetize this without necessarily these blackout practices.",
                    "label": 0
                },
                {
                    "sent": "Or not those black boots.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, challenges and opportunities.",
                    "label": 0
                },
                {
                    "sent": "This is my final slide.",
                    "label": 0
                },
                {
                    "sent": "Randomized recommendation.",
                    "label": 0
                },
                {
                    "sent": "A lot of people are worried also, but they're being blinkered by recommendation.",
                    "label": 0
                },
                {
                    "sent": "I'm only getting people I agree with.",
                    "label": 0
                },
                {
                    "sent": "I'm only getting articles I've read before.",
                    "label": 0
                },
                {
                    "sent": "I'm only getting things that I want to see.",
                    "label": 0
                },
                {
                    "sent": "The world is now Rosier Place, but I'm I'm less of a person.",
                    "label": 0
                },
                {
                    "sent": "So the question of how you do that is an interesting one.",
                    "label": 0
                },
                {
                    "sent": "Jeff Atwood speaks about the Internet driving license.",
                    "label": 1
                },
                {
                    "sent": "How do we take open ID web ID?",
                    "label": 0
                },
                {
                    "sent": "And so I want to make it a meaningful way so I don't have to create an account on every website.",
                    "label": 0
                },
                {
                    "sent": "Contact globalization is a good one, and finally the use of context.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'll be speaking about this during the our own research later on in the week.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Running out of time.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I'll just pass my credits in my.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sources acknowledge the essay.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Diane Project, thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}