{
    "id": "7tbhe5xppwwz46bdq4dngtee6zn4yyeo",
    "title": "Image Segmentation using Dual Distribution Matching",
    "info": {
        "author": [
            "Tatsunori Taniai, University of Tokyo"
        ],
        "published": "Oct. 9, 2012",
        "recorded": "September 2012",
        "category": [
            "Top->Computer Science->Computer Vision"
        ]
    },
    "url": "http://videolectures.net/bmvc2012_taniai_distribution_matching/",
    "segmentation": [
        [
            "My name is Doctor Tanya and I'm from the University of Tokyo, Japan."
        ],
        [
            "And.",
            "In this research, we deal with forgetting about getting segmentation, and here human regions are extracted as a program."
        ],
        [
            "And this is our solution.",
            "First, to be approved first we assume that input color distributions or histograms of programming and background are available in.",
            "Winter segmentation is given to the target image like this, and we can compute the distribution of program region and marking region an.",
            "Think we seek a segmentation such the.",
            "Distributions of segmented regions are consistent with input.",
            "Curtis divisions.",
            "In other words, we perform for grant distribution margin an broken distribution matching simultaneously and output to segmentation satisfies these two constraints and having their jail conference, our middle is feasible for approximate input distributions, an actually.",
            "This is our motivation because.",
            "In practice, only approximation is available for input."
        ],
        [
            "And so this method can be formulated as the sum of four get much internal market market through an smoothness term and need much in term measures the distance between input distributions and output distributions.",
            "But there are many to two terms for this.",
            "Model 1 needs estimation of optimal weight.",
            "And be an optimization and we deal with these problems in this research.",
            "And that was the introduction."
        ],
        [
            "And we go to."
        ],
        [
            "Background and related works."
        ],
        [
            "First, segmentation problem can be formulated as binary labeling program where we assign to each pixel either program or barking level or be in.",
            "This can be often solved in an energy optimization framework and the energy function usually consist of four.",
            "Again, the story appears, termine smoothness through appearance term measures, consistencies between.",
            "This segmentation and input current information or distributions here an smoothness term, parities discontinuity between the neighboring pixels and variety of segmentation methods are mainly stems from the definitions of dysfunction and opt."
        ],
        [
            "Addition method.",
            "In this research we we, we focused on appearance, consistency, measure, and so we classify signification methods by formulation, schemes of appearance.",
            "Turn.",
            "The first one is a local measures that a valid, each pixel independently, and the other one is global registered unemployed all pixels simultaneously considering mutual interaction between all pixels.",
            "So this use high order information."
        ],
        [
            "And this is an overview of local and global images.",
            "In short, local measures have are a simple model, so they're easy to optimize.",
            "But accuracy is not so good.",
            "Out, sorry Ann.",
            "While global matches hover complex models, so they are hard to optimize but accuracy is high and let's look into local measures."
        ],
        [
            "Segmentation methods such as."
        ],
        [
            "Interactive graph cuts and goggles are all based on local measures.",
            "They have our energy function that consists of unity appearance terms in Paris, smoothness terms and such type of energy function can be exactly optimized via graph cuts, but with this simple models, the minimum solution prefers shorter boundaries, so the resulting boundaries often shortcut across thin structure."
        ],
        [
            "And next is global riches."
        ],
        [
            "In global measures we we assume that an input distribution is available and we extract a region whose distribution is consistent with the input distribution.",
            "So which means, uh?",
            "We perform program distribution matching to output the segmentation."
        ],
        [
            "And global measures have some issues, and one of which is.",
            "But they only perform highly accurate as segmentations only an accurate input distribution is giving, so there not robust an hour motivation."
        ],
        [
            "Nice here.",
            "So what will you not do in this research is to relax the street assumption for input and previous method for.",
            "Limited to only either for get matching or vacuum matching, and so here we propose and you segmentation method that matches for getting distribution and marketing distribution simultaneously.",
            "In other words, we use more information or using more constraints to increase the robustness."
        ],
        [
            "So in in our proposed methods."
        ],
        [
            "We assume that two input distributions for forgetting background are available.",
            "In we, we match the distribution of segmented regions and it would distribution.",
            "So we perform program distribution matching and back and distribution matching and output the segmentation that satisfies feeds to matching constraints and with this drug constraints our method is.",
            "Expected, expected to be robust even for approximate input disk."
        ],
        [
            "Visions and this method can be formulated by using the Bhattacharya coefficient, which is a similarity measure of probability distributions.",
            "So our energy function consists of program matching term Ann Barker much Interment smoothness term where each matching term measures.",
            "Negative of the similarity between input and output distributions, and if a.",
            "Input distributions are inaccurate.",
            "For get matching term or rocking matching term only, can I talk to the true solution?",
            "But our do a matching energy is more likely to capture the true solution by using the drug constraints.",
            "But there are two turn just for this model and the estimation of optimal weight and optimized."
        ],
        [
            "And 1st we I talk about estimation of weights."
        ],
        [
            "It to tell the conclusion first.",
            "Each matching term pretty much in terms, should be weighted in proportional to its area size.",
            "So we use wait like the program adoration of Forgan area, size to image size and the ratios for again idiot up answer Buccaneer size to image size and to explain this intuitively well.",
            "Simultaneous matching of forgetting about distribution.",
            "Our result is deeply associated with marching of the entire week distribution.",
            "Therefore, we touch with we can increase.",
            "It reinforces appearance, consistency in the sense of the entire miss distribution."
        ],
        [
            "And how we can get the area size ratios where first the entire meat distribution or bigger is known and it can be approximated by the sum of input distributions as Omega Tudor.",
            "And if you find the perimeter that maximize the similarity between Omega and Omega Tutor, that will be an estimate for racial for exercise and.",
            "It will be repeatedly updated in optimization."
        ],
        [
            "So optimizing."
        ],
        [
            "In previous methods.",
            "An upper bound function such that graph that can be applied was given to the objective function an they optimize the objective function by iteratively minimizing its upper bound functions, but you know our dear matching energy function has both forget much Inter man barking much in terms so.",
            "We need some modifications."
        ],
        [
            "Man.",
            "This is our.",
            "An overview of our optimization method.",
            "First, we approximate for grandparent terms by their upper bound function, such that graph that can be applied.",
            "And we can we take a kind of alternating optimization procedure.",
            "So we will first optimize the Forgan term by iteratively applying graph cuts.",
            "Likewise, we optimized Department term and we perform.",
            "Graph cut once more to get the segmentation result and we repeat these steps for a few times to optimize our industry function."
        ],
        [
            "Onyx."
        ],
        [
            "Pyramids.",
            "We used a graphical segmentation database that consists of 15 test images and grantors level and try Maps.",
            "A trauma consists of four game involving regions and unknown region between them and we use the."
        ],
        [
            "Babies.",
            "In experiment one."
        ],
        [
            "We evaluated our estimated wait, so we compared A2 appearance function and one is with estimated weights and the other one is with fixed weights and we input.",
            "The variable level L and we shrunk an expanded the oil around the Grantors border, and we used we used input distributions as approximate distributions from trauma and this set."
        ],
        [
            "Companies that.",
            "You know the input distributions are in incomplete distributions from trials, so forget much intern or ranking.",
            "Matching term only cannot have to distribution, but if appearance functions are properly weighted they will capture the true solution and we want to confirm."
        ],
        [
            "This.",
            "This is the result as centering shows the graduate level and you can see forget matching term or rocking matching term does not capture the true solution."
        ],
        [
            "But no puffery hour.",
            "Our appears function is properly rated so.",
            "It takes.",
            "The minimum at when the ground truth lawyer is given."
        ],
        [
            "An experiment."
        ],
        [
            "Dude is image segmentations.",
            "So we compared proposed method and that we've fixed weight version and forget matching packet matching and local measures.",
            "And we input approximate distributions from trial up an we classify all pixels on using only the input distributions."
        ],
        [
            "This is the result shown as the average.",
            "It'll fix rates, so the smaller the better.",
            "And from this we can see that our method was most accurate.",
            "An hour estimated weights were effective, I show."
        ],
        [
            "Just some examples.",
            "And as you can see, our method was really accurate, especially around thin structures like arms and legs."
        ],
        [
            "Anne.",
            "I'll show you some more results."
        ],
        [
            "Can any?"
        ],
        [
            "Spending three, we compare the global and local measures by varying accuracy of input distributions in order to know when an which is the best scheme.",
            "And this type of.",
            "Experiment has never been reported.",
            "Anne.",
            "Here we have to change the accuracy of input distribute."
        ],
        [
            "And so we used broad masks like.",
            "The left one and we.",
            "We produced input distributions, Popper City inaccurate by limiting the difference regions by using their masks."
        ],
        [
            "And this is a result.",
            "As you can see, our method was most accurate at mid to high input accuracies and.",
            "Let"
        ],
        [
            "Detailed result first.",
            "Our deal matching method was far more robust than for gain or vacuum matching.",
            "Anne."
        ],
        [
            "Our estimated weights were effects varied at all at almost all accuracies."
        ],
        [
            "Next, as a comparison of global and local measures, well, I think it can be said that local measures outperform global measures.",
            "If input distributions are extremely inaccurate."
        ],
        [
            "And let me conclude my."
        ],
        [
            "Presentation.",
            "We proposed a job matching segmentation without of forgetting back in regions with estimated weeks and with a very optimization method an we compared global and local measure.",
            "We thought and that has never been reported before and that's all.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My name is Doctor Tanya and I'm from the University of Tokyo, Japan.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "In this research, we deal with forgetting about getting segmentation, and here human regions are extracted as a program.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is our solution.",
                    "label": 0
                },
                {
                    "sent": "First, to be approved first we assume that input color distributions or histograms of programming and background are available in.",
                    "label": 1
                },
                {
                    "sent": "Winter segmentation is given to the target image like this, and we can compute the distribution of program region and marking region an.",
                    "label": 0
                },
                {
                    "sent": "Think we seek a segmentation such the.",
                    "label": 0
                },
                {
                    "sent": "Distributions of segmented regions are consistent with input.",
                    "label": 0
                },
                {
                    "sent": "Curtis divisions.",
                    "label": 0
                },
                {
                    "sent": "In other words, we perform for grant distribution margin an broken distribution matching simultaneously and output to segmentation satisfies these two constraints and having their jail conference, our middle is feasible for approximate input distributions, an actually.",
                    "label": 1
                },
                {
                    "sent": "This is our motivation because.",
                    "label": 0
                },
                {
                    "sent": "In practice, only approximation is available for input.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so this method can be formulated as the sum of four get much internal market market through an smoothness term and need much in term measures the distance between input distributions and output distributions.",
                    "label": 0
                },
                {
                    "sent": "But there are many to two terms for this.",
                    "label": 0
                },
                {
                    "sent": "Model 1 needs estimation of optimal weight.",
                    "label": 0
                },
                {
                    "sent": "And be an optimization and we deal with these problems in this research.",
                    "label": 0
                },
                {
                    "sent": "And that was the introduction.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we go to.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Background and related works.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First, segmentation problem can be formulated as binary labeling program where we assign to each pixel either program or barking level or be in.",
                    "label": 0
                },
                {
                    "sent": "This can be often solved in an energy optimization framework and the energy function usually consist of four.",
                    "label": 0
                },
                {
                    "sent": "Again, the story appears, termine smoothness through appearance term measures, consistencies between.",
                    "label": 1
                },
                {
                    "sent": "This segmentation and input current information or distributions here an smoothness term, parities discontinuity between the neighboring pixels and variety of segmentation methods are mainly stems from the definitions of dysfunction and opt.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Addition method.",
                    "label": 0
                },
                {
                    "sent": "In this research we we, we focused on appearance, consistency, measure, and so we classify signification methods by formulation, schemes of appearance.",
                    "label": 1
                },
                {
                    "sent": "Turn.",
                    "label": 1
                },
                {
                    "sent": "The first one is a local measures that a valid, each pixel independently, and the other one is global registered unemployed all pixels simultaneously considering mutual interaction between all pixels.",
                    "label": 1
                },
                {
                    "sent": "So this use high order information.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is an overview of local and global images.",
                    "label": 1
                },
                {
                    "sent": "In short, local measures have are a simple model, so they're easy to optimize.",
                    "label": 0
                },
                {
                    "sent": "But accuracy is not so good.",
                    "label": 0
                },
                {
                    "sent": "Out, sorry Ann.",
                    "label": 0
                },
                {
                    "sent": "While global matches hover complex models, so they are hard to optimize but accuracy is high and let's look into local measures.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Segmentation methods such as.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Interactive graph cuts and goggles are all based on local measures.",
                    "label": 0
                },
                {
                    "sent": "They have our energy function that consists of unity appearance terms in Paris, smoothness terms and such type of energy function can be exactly optimized via graph cuts, but with this simple models, the minimum solution prefers shorter boundaries, so the resulting boundaries often shortcut across thin structure.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And next is global riches.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In global measures we we assume that an input distribution is available and we extract a region whose distribution is consistent with the input distribution.",
                    "label": 1
                },
                {
                    "sent": "So which means, uh?",
                    "label": 1
                },
                {
                    "sent": "We perform program distribution matching to output the segmentation.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And global measures have some issues, and one of which is.",
                    "label": 0
                },
                {
                    "sent": "But they only perform highly accurate as segmentations only an accurate input distribution is giving, so there not robust an hour motivation.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Nice here.",
                    "label": 0
                },
                {
                    "sent": "So what will you not do in this research is to relax the street assumption for input and previous method for.",
                    "label": 1
                },
                {
                    "sent": "Limited to only either for get matching or vacuum matching, and so here we propose and you segmentation method that matches for getting distribution and marketing distribution simultaneously.",
                    "label": 1
                },
                {
                    "sent": "In other words, we use more information or using more constraints to increase the robustness.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in in our proposed methods.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We assume that two input distributions for forgetting background are available.",
                    "label": 0
                },
                {
                    "sent": "In we, we match the distribution of segmented regions and it would distribution.",
                    "label": 1
                },
                {
                    "sent": "So we perform program distribution matching and back and distribution matching and output the segmentation that satisfies feeds to matching constraints and with this drug constraints our method is.",
                    "label": 0
                },
                {
                    "sent": "Expected, expected to be robust even for approximate input disk.",
                    "label": 1
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Visions and this method can be formulated by using the Bhattacharya coefficient, which is a similarity measure of probability distributions.",
                    "label": 0
                },
                {
                    "sent": "So our energy function consists of program matching term Ann Barker much Interment smoothness term where each matching term measures.",
                    "label": 0
                },
                {
                    "sent": "Negative of the similarity between input and output distributions, and if a.",
                    "label": 0
                },
                {
                    "sent": "Input distributions are inaccurate.",
                    "label": 0
                },
                {
                    "sent": "For get matching term or rocking matching term only, can I talk to the true solution?",
                    "label": 0
                },
                {
                    "sent": "But our do a matching energy is more likely to capture the true solution by using the drug constraints.",
                    "label": 1
                },
                {
                    "sent": "But there are two turn just for this model and the estimation of optimal weight and optimized.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And 1st we I talk about estimation of weights.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It to tell the conclusion first.",
                    "label": 0
                },
                {
                    "sent": "Each matching term pretty much in terms, should be weighted in proportional to its area size.",
                    "label": 0
                },
                {
                    "sent": "So we use wait like the program adoration of Forgan area, size to image size and the ratios for again idiot up answer Buccaneer size to image size and to explain this intuitively well.",
                    "label": 0
                },
                {
                    "sent": "Simultaneous matching of forgetting about distribution.",
                    "label": 1
                },
                {
                    "sent": "Our result is deeply associated with marching of the entire week distribution.",
                    "label": 1
                },
                {
                    "sent": "Therefore, we touch with we can increase.",
                    "label": 0
                },
                {
                    "sent": "It reinforces appearance, consistency in the sense of the entire miss distribution.",
                    "label": 1
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And how we can get the area size ratios where first the entire meat distribution or bigger is known and it can be approximated by the sum of input distributions as Omega Tudor.",
                    "label": 1
                },
                {
                    "sent": "And if you find the perimeter that maximize the similarity between Omega and Omega Tutor, that will be an estimate for racial for exercise and.",
                    "label": 0
                },
                {
                    "sent": "It will be repeatedly updated in optimization.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So optimizing.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In previous methods.",
                    "label": 0
                },
                {
                    "sent": "An upper bound function such that graph that can be applied was given to the objective function an they optimize the objective function by iteratively minimizing its upper bound functions, but you know our dear matching energy function has both forget much Inter man barking much in terms so.",
                    "label": 1
                },
                {
                    "sent": "We need some modifications.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Man.",
                    "label": 0
                },
                {
                    "sent": "This is our.",
                    "label": 0
                },
                {
                    "sent": "An overview of our optimization method.",
                    "label": 1
                },
                {
                    "sent": "First, we approximate for grandparent terms by their upper bound function, such that graph that can be applied.",
                    "label": 1
                },
                {
                    "sent": "And we can we take a kind of alternating optimization procedure.",
                    "label": 0
                },
                {
                    "sent": "So we will first optimize the Forgan term by iteratively applying graph cuts.",
                    "label": 0
                },
                {
                    "sent": "Likewise, we optimized Department term and we perform.",
                    "label": 0
                },
                {
                    "sent": "Graph cut once more to get the segmentation result and we repeat these steps for a few times to optimize our industry function.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Onyx.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Pyramids.",
                    "label": 0
                },
                {
                    "sent": "We used a graphical segmentation database that consists of 15 test images and grantors level and try Maps.",
                    "label": 1
                },
                {
                    "sent": "A trauma consists of four game involving regions and unknown region between them and we use the.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Babies.",
                    "label": 0
                },
                {
                    "sent": "In experiment one.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We evaluated our estimated wait, so we compared A2 appearance function and one is with estimated weights and the other one is with fixed weights and we input.",
                    "label": 0
                },
                {
                    "sent": "The variable level L and we shrunk an expanded the oil around the Grantors border, and we used we used input distributions as approximate distributions from trauma and this set.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Companies that.",
                    "label": 0
                },
                {
                    "sent": "You know the input distributions are in incomplete distributions from trials, so forget much intern or ranking.",
                    "label": 1
                },
                {
                    "sent": "Matching term only cannot have to distribution, but if appearance functions are properly weighted they will capture the true solution and we want to confirm.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "This is the result as centering shows the graduate level and you can see forget matching term or rocking matching term does not capture the true solution.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But no puffery hour.",
                    "label": 0
                },
                {
                    "sent": "Our appears function is properly rated so.",
                    "label": 0
                },
                {
                    "sent": "It takes.",
                    "label": 0
                },
                {
                    "sent": "The minimum at when the ground truth lawyer is given.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An experiment.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Dude is image segmentations.",
                    "label": 0
                },
                {
                    "sent": "So we compared proposed method and that we've fixed weight version and forget matching packet matching and local measures.",
                    "label": 0
                },
                {
                    "sent": "And we input approximate distributions from trial up an we classify all pixels on using only the input distributions.",
                    "label": 1
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is the result shown as the average.",
                    "label": 0
                },
                {
                    "sent": "It'll fix rates, so the smaller the better.",
                    "label": 0
                },
                {
                    "sent": "And from this we can see that our method was most accurate.",
                    "label": 1
                },
                {
                    "sent": "An hour estimated weights were effective, I show.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just some examples.",
                    "label": 0
                },
                {
                    "sent": "And as you can see, our method was really accurate, especially around thin structures like arms and legs.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "I'll show you some more results.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Can any?",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Spending three, we compare the global and local measures by varying accuracy of input distributions in order to know when an which is the best scheme.",
                    "label": 1
                },
                {
                    "sent": "And this type of.",
                    "label": 0
                },
                {
                    "sent": "Experiment has never been reported.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 1
                },
                {
                    "sent": "Here we have to change the accuracy of input distribute.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so we used broad masks like.",
                    "label": 0
                },
                {
                    "sent": "The left one and we.",
                    "label": 0
                },
                {
                    "sent": "We produced input distributions, Popper City inaccurate by limiting the difference regions by using their masks.",
                    "label": 1
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is a result.",
                    "label": 0
                },
                {
                    "sent": "As you can see, our method was most accurate at mid to high input accuracies and.",
                    "label": 1
                },
                {
                    "sent": "Let",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Detailed result first.",
                    "label": 0
                },
                {
                    "sent": "Our deal matching method was far more robust than for gain or vacuum matching.",
                    "label": 1
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our estimated weights were effects varied at all at almost all accuracies.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Next, as a comparison of global and local measures, well, I think it can be said that local measures outperform global measures.",
                    "label": 0
                },
                {
                    "sent": "If input distributions are extremely inaccurate.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And let me conclude my.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Presentation.",
                    "label": 0
                },
                {
                    "sent": "We proposed a job matching segmentation without of forgetting back in regions with estimated weeks and with a very optimization method an we compared global and local measure.",
                    "label": 1
                },
                {
                    "sent": "We thought and that has never been reported before and that's all.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}