{
    "id": "7ubdsg7i52ktraqz4atf4yjx5vb6ev43",
    "title": "Embodied Language Games for Autonomous Robots",
    "info": {
        "author": [
            "Luc Steels, Computer Science Department, Vrije Universiteit Brussel"
        ],
        "introducer": [
            "Ramon López de Mántaras, Artificial Intelligence Research Institute - IIIA, Spanish National Research Council - CSIC"
        ],
        "published": "July 22, 2009",
        "recorded": "July 2009",
        "category": [
            "Top->Computer Science->Artificial Intelligence"
        ]
    },
    "url": "http://videolectures.net/ijcai09_steels_elgar/",
    "segmentation": [
        [
            "Fields graduated from MIT and is now the director of the Sony Computer Science Research Lab in Paris in France, as well as a professor of computer science at the Free University of Brussels, where he founded the AOL app in 1983.",
            "Prefers Professor steals is a leading AI scientists.",
            "One of the few truly interdisciplinary researchers in the field.",
            "He has made outstanding contributions that cover almost the whole AI field, natural language, vision, Robert Behavior, learning, cognitive architecture, knowledge representation.",
            "More recently, he has focused his research on dialogues for humanoid robots and on fundamental research on the origins of language and meaning.",
            "His most recent work focuses on developing the foundations of symbiotic dynamics and on fluid construction grammars.",
            "He's the author of approximately 200 papers fellow of a key and a fellow of the Institute of Advanced Studies in Berlin.",
            "His talk today is about embodied language games with autonomous robots.",
            "Please join me in welcoming Professor Lucas deals.",
            "Thank you Ramon and thank you all for coming to the talk.",
            "When I started in AI, this is embarrassingly long time ago.",
            "I was very impressed by the system that their winner Graham had built at MIT in 96.",
            "So when I started in AI, this is long time ago.",
            "I was very impressed by this system that Terry Winograd had built at MIT.",
            "And it was impressive to me because it combined many things in language processing.",
            "I mean parsing, production knowledge, representation, planning, learning.",
            "And so this seemed like an incredible breakthrough.",
            "Now if you look back, I mean, this is 40 years ago to see where we are in language processing.",
            "Then of course a lot has been achieved in the Meanwhile.",
            "But if you really think about grounded language processing, which is really, you know, like you have a scene with two robots and one is asking to pick up the Red Bull."
        ],
        [
            "Now this is already a very different matter.",
            "Of course we can set up some little demo like that, but I would argue that open ended grounded communication with language is still a goal for AI and is still an elusive goal.",
            "Now, why would that be?",
            "Well, I think the first thing is that natural language."
        ],
        [
            "This error prone in the sense that when we speak.",
            "We make phrases that are not necessarily grammatical or complete.",
            "We use words in the wrong way.",
            "Natural languages open ended in the sense that we may use words in new meanings or expand grammatical constructions.",
            "So languages adaptive.",
            "Actually, when you look at the research that psychologists have done on natural dialogue, they discovered that people actually attuned to each other.",
            "They align their lexicons, their ontologies, their grammars.",
            "Two each other in order to be more efficient in speaking so it's not that natural language is a static system that we can implement once and then the job is done.",
            "Second, difficulty, of course is that in grounded language requires that we deal with all the different parts of AI, so to speak.",
            "I mean, the embodiment perception motor control.",
            "We need dialogue management cooperative interactions, then to conceptualize what we're going to express as speaker.",
            "The production of language, the interpretation of it, the parsing of it, you know all of these things.",
            "Adaptation and learning all have to come together.",
            "Into a single system and this is of course complicated.",
            "Another thing I believe is that there's huge variation which is usually under appreciated by people who speak only one or two languages, which is that actually languages in the world are very different, not just in terms of the lexicon.",
            "That's pretty obvious, but also in terms of the meanings that are expressed.",
            "The way that reality is conceptualized for language.",
            "And so that's I think another reason why we're dealing with a very difficult problem here.",
            "And then the final thing I want to point out is that language and meaning they're not just a matter of the individual.",
            "When we built an individual agent or a program that is doing some sort of natural language well, we're missing out on the collective aspect.",
            "And if language of individuals is obviously influenced by the language of the community in which they are, and vice versa, we all speak.",
            "And we all influence the way that this common languages is built.",
            "So these are sort of the kinds of things that I've been worrying about."
        ],
        [
            "And of course, I mean Winograd said in 2005.",
            "We need very long term research to get a handle on human natural language and this was this conclusion after should lewd.",
            "Now, if you think 40 years back you know I don't think that much really very long term research has been done so that we can say that there's so much progress.",
            "And my feeling is that we need to methodology and this is going to be sort of my main topic in this talk is to reflect on what kind of methodology could we use to explore these various issues.",
            "And of course we need components.",
            "You know, we need grammar, formalisms, knowledge representation, perception, all of that.",
            "But I think we need to focus in particular on the issues of adaptation, ongoing adaptation, online learning if you want.",
            "But it's more than.",
            "Then learning it's kind of alignment coordination.",
            "Also in terms of autonomous growth in complexity of language like in development or actually also in emerging languages that you see that there's more and more complexity coming up.",
            "So how does that work?",
            "And then there's the issue of self organization, of how the community, how the collective can influence the individual and vice versa.",
            "Now if you look around for ideas on methodologies that we could use, I think there is actually an obvious choice, and this is evolutionary biology and so.",
            "Now I don't have to explain of course to you here."
        ],
        [
            "Where the basic ideas of evolutionary biology, I mean.",
            "First of all, there is a principle.",
            "This is the principle of evolution.",
            "And basically you.",
            "I mean they start from this idea that you have variation.",
            "That there's heredity, and that their selection.",
            "And if you have different environments and certain phenotypes, certain organisms will be more adapted to that particular environment, and so you know they will have less risk to be eaten by predators.",
            "They have more success in reproduction and all of that.",
            "So you have fitness which is feeding back on the frequency of genes in the gene pool.",
            "So this is one thing, but I think there's another thing is that once."
        ],
        [
            "Evolutionary biology has this big principle for thinking about adaptation.",
            "Thinking about the increase in complexity, and then they start working this out for concrete cases.",
            "So here is one of the example of this which I find very beautiful or not.",
            "Typically they start looking at a certain phenomenon, such as the egg spots on the finova fish.",
            "OK, there's this species of fish which has these experts.",
            "So the question is what are they for?",
            "How could they have evolved?",
            "You know, what are the mechanisms behind of this and evolutionary biologists have developed techniques that they can completely figure out.",
            "Actually, first of all, the function of the whole thing in the ecology of the environment.",
            "And it turns out that these experts play a crucial role in the reproductive strategy of this species.",
            "So what happens is that the female lays down the eggs and then is going to take the eggs back in the mouth for further development now.",
            "What the male is doing is actually faking that there are still more eggs.",
            "By having these experts, so that in this way he can fertilize the eggs when the female is trying to suck up more eggs.",
            "So this is amazing.",
            "This amazing mechanism available that is used in reproduction and that's of course gives and a reproductive advantage through the species or two D individuals that have those genes which leads to the further propagation of those jeans.",
            "So this is the."
        ],
        [
            "Methodology of evolutionary biology to select the phenomenon like exports to try to understand what it is for.",
            "In this case it's for plays a role in the reproductive strategy.",
            "Then to understand how it gets built, how the genetics plays a role, what is going on in development and then also they try to figure out how this particular strategy or this phenotypic feature has a certain selective advantage compared to another one.",
            "And then they try to find out how it emerged and they can do this.",
            "You know they taken an Organism or an animal or something.",
            "They see a particular trait and they reconstruct this whole thing and that way are able to understand and explain this particular feature.",
            "So I think what I'm going to do to argue in my talk is that we can use a similar methodology to think about language.",
            "And the first point, of course, is well."
        ],
        [
            "What are the phenomena that we are looking at the phenomenon that we are looking at our particular features of language?",
            "For example, we see Spanish speakers or English speakers or whatever use color terms like red and green and blue and so on, and they use them to refer to particular objects in the world.",
            "So this is an example of a phenomenon that we try to explain.",
            "Now, if you have a certain context, let's say a certain set of chips and this is speaker, you say fair there.",
            "Then you can be pretty sure that the here is going to pay attention to this particular object.",
            "So using these color terms you can actually draw attention to objects in the environment.",
            "Now, if you want to build a model of that, I think all of you are completely able to do this.",
            "You know you would say, well, there's visual perception going on.",
            "We get information RGB or in short medium long term, long wavelength.",
            "Of the colors, they are mixed into the component, sorry opponent channels, so you have a brightness channel.",
            "You have yellow blue channel, you have a red green channel.",
            "This is creating some sort of color space and then you have points in this color space which are prototypes.",
            "Typical examples of the colors and so if you have to name a color, you look at the sample and you compare the point of the color of that sample in you in this color space and you look at the nearest neighbor, you find the prototype.",
            "And you find back the name of that prototype.",
            "I mean, that's roughly how I think.",
            "You know, we can operationalize this.",
            "OK."
        ],
        [
            "Now, as I said, there's a lot of variation between different languages, and I just want to point out for color.",
            "Berlin and Kay have been going around and also many of other people have been going around with color chips.",
            "These muscle chips, in order to figure out what are the color prototypes in specific languages.",
            "And so, for example, for English you have a color type for green, prototype for blue, prototype for purple, and they cut out certain region in the color space.",
            "Now the point is that if you go to another language then you will find other ways of cutting up the region in the color space.",
            "For example, in Japanese you already have an area called Owl which combines actually blue and green and if you look at even more exotic tribes like this is for.",
            "The bidding more which is Papua New Guinea tribe, you see that they actually organize the color space in a very different way, so they have words like null and wash for these regions of the color space, which are quite different from the regions that you would find in English.",
            "For green and blue.",
            "So you see, even if we look at the simple thing like color and we start to delve into how that could work, we find variation between different languages and we also find.",
            "That"
        ],
        [
            "This evolution.",
            "But for example, the in English in Old English you had all sorts of words which we still have, like red and yellow, blue and Brown, and so on.",
            "But these words actually were not Hugh terms.",
            "In Old English there were more related to brightness.",
            "So what happened in the shift from Old English to Middle English is actually a shift from emphasis on brightness on shiny.",
            "My dark and so on.",
            "A shift towards Hugh terms under the influence of dye industry, so I'm showing this in order to show that you know, language is not a static system, but this actually continuously evolving the ontologies are changing.",
            "Of course the words may be changing and this is the kind of thing that we."
        ],
        [
            "Would like to understand so if we transposed the methodology of evolutionary biology to AI, what would that mean?",
            "Well, we take a phenomenon like color or time or space or articles case, information structure, whatever interests us in natural language, we tried to understand its function.",
            "What role is it playing in communication then?",
            "How it gets built?",
            "You know, the learning process is the invention strategies behind it then show that using this particular feature of a language like color or articles has a certain advantage in communication as a selective advantage.",
            "And then we try to find out how that particular feature may have emerged.",
            "So now I'm going to show you 3 examples of the application of this.",
            "How we do this in our lab?",
            "And basic."
        ],
        [
            "We start from the idea of a language game.",
            "The language game is a kind of interaction between two agents you know, like here, one is asking for a bottle of water, gives the wine and things like that.",
            "So we have a situation.",
            "We have at least two agents there.",
            "Shared attention.",
            "There is some feedback being given.",
            "You know there's some language being used, but there's also a perception, so this is going to be the cell that we are investigating.",
            "The minimal units in which the phenomena.",
            "Arise that we are interested in.",
            "Now the second idea."
        ],
        [
            "Is that we are going to use robots?",
            "And we're going to use these in our lab.",
            "We use these curio, Sony, Curio humanoids.",
            "They're not a commercial product.",
            "But I mean there are really fantastic robots with vision, movement and the whole thing.",
            "OK, so now what we're going to do or what we tried to do is to implement language games on these robots and so we focus on a particular."
        ],
        [
            "Phenomenon like color for example.",
            "And so we play or we set it up so that these robots play."
        ],
        [
            "A color naming game.",
            "Now, the best thing is probably to see an example of such a."
        ],
        [
            "Day.",
            "Um?",
            "OK.",
            "So typically we get.",
            "I mean they are in an environment in which there are certain colorful objects, like here.",
            "And so the goal is that the speaker is going to draw attention to the here by using a particular word and the words like here it's boelema.",
            "Unfortunately, you don't hear the sound that's not so important.",
            "So then the.",
            "The here is pointing to one object that it thinks is refering to boelema and then the speaker is giving feedback on whether the here pointed to the right object.",
            "So this is a game is like you know we sit at the table.",
            "I ask you for the water and you give me the innocent or not.",
            "This is not.",
            "Walter, This is why it's something like that, so this is an example of a game.",
            "Here is another one.",
            "Maybe I can move the sound?",
            "So here again, they look around and they see the environment.",
            "One of them is saying something.",
            "This is the one in the back is again saying boelema.",
            "The other one looks around to see what a ballymount might be.",
            "Points to the object and then the other one is going to agree or disagree with this particular thing.",
            "OK, so in this case he agrees.",
            "So this is an example of a language key and we want to set up language games to study different aspects of language like space or time or those kinds of things.",
            "So let me use the.",
            "Example of the color naming game.",
            "To better explain this methodology that we are using.",
            "Now of course, to play this game.",
            "Lots of things need to happen and to start with we need."
        ],
        [
            "Perception, because you cannot talk about objects you cannot point to objects you know when you cannot see the objects that are in their environment and so we using basically techniques that you all know for doing the recognition of objects.",
            "Or let's say the carving out objects in the world.",
            "So this is the 3D color space here to the right and every point in the image is being mapped in real time.",
            "Into this color space so you can already see that if all the orange point, let's say, are going to form one particular region in the color space.",
            "OK, now then.",
            "This is again from the vision system on the robot.",
            "Is using color segmentation using foreground background segmentation also doing edge detection in order to be able to track objects and to build up a model of the environment in order to play a language game.",
            "Now notice that the robot is actually both doing bottom up processing of the visual image that are streaming in, but also top down predictions of what it is seeing.",
            "In order to be able to figure out.",
            "You know where objects are with respect to the immediate path, because this is necessary for tracking.",
            "So here is an example of a robot that's actually building up a model of its environment.",
            "Doing top down prediction where the other objects are going to be in the environment even if he doesn't see them anymore.",
            "And doing this is using Kalman filters to predict next state of reality Bolt from the viewpoint or integrating how he himself is moving around.",
            "Is this me?",
            "My point was not so important.",
            "You know, and of course the objects as they are moving around.",
            "OK, so this is a little peek into the vision system.",
            "I don't want to say more of that.",
            "What is more relevant here is then what comes after the vision system.",
            "So you have.",
            "We need a way to conceptualize what to say in this case.",
            "This will be to choose a particular color category and then we need to choose a word for it.",
            "And here has to parse that particular word and interpret it in in the reality itself.",
            "So if we go back to our game.",
            "You know this is the.",
            "I."
        ],
        [
            "Actually, now it's the same game as before, but I'm showing at the bottom left what the left agent is seeing at the bottom right.",
            "What the right agents is seeing and you also see the you know the vision system in action.",
            "The square is what they are.",
            "Actually, let me start again.",
            "The square is what they are actually seeing and you see the.",
            "You know the prediction and the reality.",
            "The 3D model that's being built up by these agents.",
            "So if we talk about language games.",
            "Talking about it in the abstract, you know we talk about it grounded in the reality with the concrete objects with pointing and with the necessary feedback, and so on.",
            "OK?",
            "So now what I'm going to show is how we actually deconstruct, step by step, a color language.",
            "And the same technique we would use to deal with space, for example, or to deal with time.",
            "And so the first step is that we take an existing system, for example the Spanish color terms.",
            "And we try to build a system that is able to play this game by using an existing system.",
            "Now we can do that because we have data from psychological experiments.",
            "What the prototypes are that Spanish speakers tend to use connected to words like Faraday, Azul and so on."
        ],
        [
            "And so the when we."
        ],
        [
            "Implement the system like that and we let those agents play language games.",
            "Then we get the kind of result like the one shown here.",
            "So in this axis we have the number of interactions between the agents, so we let them play many different language games and this is a population that only consists of two agents which both have already.",
            "You know, we implemented the prototypes.",
            "We implemented the lexecon so that they could play the game and this is the success.",
            "Reds of playing that particular game.",
            "They're not always successful, because as you can see here, the samples we present to them are sometimes so close that you cannot win in the game by just using these basic Spanish color terms.",
            "So this is sort of 1st baseline that we know that we've been able to capture the natural system that we find in this case among Spanish speakers.",
            "The next step we do."
        ],
        [
            "Send to say OK, let's pull out the lexecon and let's implement the strategy for learning the lexicon.",
            "Again, that's not so difficult.",
            "You know we need bidirectional associative memory, and we need every time that an agent sees the sample of a particular color.",
            "And here's a word, well, because we assume here in this step that they already have the grounded ontology.",
            "You know, they just have to associate the word with the prototype that's being used for this particular sample.",
            "So this is not so difficult."
        ],
        [
            "This is then the result we get here, so the blue line is like before the success rate of, let's say, adult Spanish speakers, and now we throw in here interactions between the learning agents and an agent which already has the system and you see how quickly.",
            "It reaches the same level of Communitive success as those that already had the system have, and this is the size of the lexicon here growing 211.",
            "Color terms because in Spanish you have in living color terms so, so this is demonstrating that we have been able to capture the learning strategy that a Spanish speaker would need to learn the Spanish color terms."
        ],
        [
            "The next step is to say, OK, let's pull out the ontology.",
            "Let's see how we can implement the strategies.",
            "So the agents can learn the ontology and learn the lexicon.",
            "Now to learn an ontology based on this kind of nearest neighbor prototypes.",
            "I mean I don't have to explain this for this audience, you know it can be done by creating new prototypes based on seeing the first example of a new color, or by shifting around the prototype in order to become better adapted to the use of a certain word with a certain prototype.",
            "And indeed."
        ],
        [
            "You implement that.",
            "You get this kind of results again.",
            "Here I plot the success rate of the implemented Spanish color speakers.",
            "And this is now the example where.",
            "An agent who does not know the ontology who does not know the lexecon, nevertheless, is able to learn both by playing this kind of game and by using these mechanisms that I just chose.",
            "OK, this is the size of the lexicon.",
            "This is the success rate of this learning agents and this is the variance between the two."
        ],
        [
            "Agents now the next step is to say, OK, what about if there is no example?",
            "There is no adult Spanish speaker that is teaching to the learner the use of the Spanish color terms.",
            "Can we build a system that actually creates a color lexicon from scratch both towards an these prototypes?",
            "And that's actually not so difficult.",
            "We have already the mechanism for building up prototypes, shifting them around.",
            "And now we just need a way to invent words for them, you know, and we use these syllables like Rob, Adobe, Domo or something.",
            "And they are associated in this memory with the prototypes that are build up and learned."
        ],
        [
            "The way I explained before.",
            "So now we get this kind of results.",
            "This is now for a population of five agents.",
            "This is still the number of games that they are playing.",
            "This here is the communitive success, so we see that starting from scratch you know this thing goes up to 90% or higher rate of success in playing this particular game.",
            "This is the size of the lexecon and this is the variance between the ontologies and the lexicons of the agents, so there's a bit of a miracle that has happened here.",
            "We have these.",
            "Agents we gave them this strategy for building up a color language.",
            "We let them play this game and then actually quite quickly.",
            "You know, after 200 while 300 games, let's say per agent they have already.",
            "80% or more success and it keeps going up."
        ],
        [
            "This is a peek into the prototypes of the agents.",
            "On the left you have the prototypes after 1000 games.",
            "Here you have them after 2500 games and you see that here the prototypes are not yet very coordinated and they become more and more coordinated to weigh.",
            "The agents are playing more and more games, so we're capturing this kind of collective dynamics.",
            "This move towards coherence when the agents are.",
            "Starting from scratch, actually coordinate more and more their ontologies and their lexicons.",
            "Another way to see what."
        ],
        [
            "What's going on is in the top left corner there where I'm plotting all the different prototypes of the agents in one plot.",
            "And you can still you can see that there.",
            "Actually these prototypes are shifting around as the agents are playing games because after every game they are really adapting themselves to each other.",
            "They are aligning their ontologies and aligning their lexicons.",
            "This is the same thing, but now for the mapping of the different words.",
            "And here again you see this kind of continuous adaptation dynamics.",
            "Now yet another way to see what is going on.",
            "Is if we look inside the memory of a single agent look at the associations that it has between sensory experiences, the prototypes and the words.",
            "So this is again starting from scratch and you."
        ],
        [
            "This kind of peek into their memory so you see the blue or the different words, and these things are the representation of the prototypes, and these are sensory experiences that are being grabbed by the agents as they try to cope with new experiences, and so this is only a single agent.",
            "But this agent is playing games with with another agent, right?",
            "So other agents may inject new words into this population.",
            "Or the new situations may be encountered so that there's a need to split prototype single prototype into two prototypes and so on.",
            "Now if you look carefully, actually, maybe now less, but you'll see that actually the prototypes you know, the shifting a little bit around the typical values on each of these channels.",
            "Are shifting around or a word may shift in meaning and those kinds of things.",
            "So we are beginning to see the rich dynamics that we see in natural languages in the way that lexicons and words and meanings are evolving.",
            "We are beginning to get a handle on simulating them in these robotic systems.",
            "OK."
        ],
        [
            "So why does it work well?",
            "I think it's selection is system in the sense that.",
            "You know we we have a language strategy is to use basic prototypes for building language about color.",
            "But then, of course, there's still many possibilities.",
            "Just like we find a lot of variation in human languages like between the English and Brynmor.",
            "But there is this selectionist loop in the sense that if.",
            "Particular words has communicated success, then its use will increase by that agents or in the population.",
            "Or if a word is not successful then it will decrease.",
            "So we get the same sort of loop that we find in Darwinian system.",
            "And the second thing is also that we see here that language is an emergent structure.",
            "There is self organization because communicate if success your communicated success depends also.",
            "On whether the here you're talking to shares.",
            "Your lexicon to some extent, or shares your ontology.",
            "So this was an example.",
            "Let me just check that I'm here.",
            "OK.",
            "This was an example to show.",
            "You know this this this methodology at work.",
            "So we select the phenomenon, we deconstruct it.",
            "We try to understand how it works.",
            "Then we try to understand the strategies for learning for invention and that way we can kind of begin to understand how this particular feature of language arises.",
            "But that's not all, because in."
        ],
        [
            "Evolutionary biology.",
            "There's also research on the question how?",
            "Particular strategy may come about and what they do.",
            "For example, in this is a species called Pima.",
            "Which has different colors and so biologists.",
            "They go out in nature and they measure.",
            "You know whether the what is the, let's say selection is pressure.",
            "If the Organism has one type of car."
        ],
        [
            "Or or another type of color and they make these kinds of studies comparing in different environments what the fitness is of a certain variant of the species with respect to another one, so we can do the same kind of thing actually now with."
        ],
        [
            "Our language games in our language strategies.",
            "For example, we can say OK, we built a population of agents.",
            "That's that's able to do build up a color language based on using Hue and brightness.",
            "In this color space now."
        ],
        [
            "Would have another color strategy which uses only brightness, like in Old English, so in that sense you can also have prototypes and you know we can set that up and then after let's say 3500 games they start to have more and more similar prototypes but now only in the brightness space and then just like the evolution."
        ],
        [
            "Biologists are comparing different strategies for playing the game of life.",
            "You could say we can also compare different strategies for being successful in a particular kind of language key.",
            "And so it's not surprising here that if your environment Hue is not important, well then the brightness strategy is going to have most success, whereas if you is very important in your environment, you know, then the.",
            "The brightness strategy will have much less success, and so we can kind of play these do these experiments.",
            "Where you actually the agents have different strategies in competition with each other, and they're keeping track of how successful they are in the language games that they are playing with a particular strategy.",
            "And of course success with a particular strategy will depend also on whether other agents in the population are following a similar strategy.",
            "And here is an example of 1 experiment where."
        ],
        [
            "In the beginning, well, this is the green line.",
            "Here is Communitive success.",
            "The blue line is the use of the full color space and the red one is the use or fitness in this case of the.",
            "Brightness strategy and you see that you know there's a kind of shift between different strategies in this population that they're shifting from.",
            "Predominantly brightness strategy to predominantly Hue strategy.",
            "OK, So what we see here is a second selection.",
            "Is loop OK?",
            "It's not just a choice of what words, what meanings.",
            "What grammatical constructions will be used in a language based on feedback in the game, but it's also which strategy is going to be used for by the population for playing this particular game."
        ],
        [
            "So this was one example.",
            "Now I'm going to give a totally different example, but it's the same kind of philosophy."
        ],
        [
            "OK, now the second example is about body language and again we.",
            "Play language games.",
            "Body language, I mean things like stand right arm up.",
            "You know which you can then use for describing posture.",
            "But you can also use it for describing positions of objects and even for metaphorical descriptions.",
            "So we start in this domain.",
            "We say, OK, we do the same thing.",
            "You know we start to deconstruct first how a particular language for talking about action.",
            "May arise in such a population, and so we set it up that they play language games with each other.",
            "Language games now.",
            "R. Going to be about sorry."
        ],
        [
            "About actions, so for example.",
            "Here is 1.",
            "So the so the speaker asks to do an action to the here and then the speaker will see whether this is the action that you requested and if it's not the action that he requested, he will show to the other one which action that he actually had in mind.",
            "So it's like saying raise your left arm and you do something you know and if it's not thing that I think is raising your left arm, then giving you feedback on what I think it is.",
            "So so these language games are again require a categorization of reality.",
            "They require that are certain words that are agreed upon by the agents for talking about bodily action.",
            "And they of course require also that agents are able to understand when they see a particular visual image of an action, like raise your left arm.",
            "You know that this corresponds to a certain action that they would do themselves.",
            "So this is the sort of the mirror problem you know for which there's this whole literature on mirror neurons and so on at the moment.",
            "And so the agents need to learn this coordination between visual image of actions and the doing of an action.",
            "And so this is again a kind of search problem actually, because.",
            "When I ask you well, when you say raise your left arm and then you do something to show me what it means to raise your left arm.",
            "I don't know yet how I should raise my left arm, right?",
            "So in order to build up the.",
            "No."
        ],
        [
            "So for doing that, we do various kinds of experiments in which robot is allowed to explore his own body.",
            "And so I'll just show you some.",
            "Some examples of that.",
            "OK, so this is.",
            "An example in looking actually at your own hands.",
            "And in the top corner you see the visual image that robot is getting when it's moving its hand and that the right side is a kind of self model that the robot can use too.",
            "To actually predict what is going to happen when it is doing a particular kind of movement.",
            "So in this way it can learn a relationship between visual image and motor control and the internal self model that the robot has about its own movements.",
            "OK.",
            "Here is another example.",
            "This is an example again with a mirror, because mirrors are quite a good way actually to see your own body and.",
            "So in this case, the robot is doing a kind of motor.",
            "Babbling is moving around its body parts.",
            "And at the same time you see in the at the top there you see the visual image that the robot is getting and also the feature extraction algorithms and at the bottom there is the proprius reception.",
            "Now at the same time.",
            "On the left side there are the commands that the motor our robot is sweeping to the Motors and on the right hand side the body model again.",
            "So using these kinds of relations between you know these different ways of.",
            "Of using your body, the visual proprioception motor control actual movement simulation of movement, the robot can learn the landscape of its own movements and also can start to begin to re late when it sees somebody else doing a particular movement in visual space.",
            "How that is corresponding with its own movements.",
            "Oops, sorry.",
            "OK.",
            "This is an example."
        ],
        [
            "Actually of the motor babbling when that is going on and then we use standard techniques like a clustering in this space in order to discover which dimensions are important for distinguishing between different bodily positions.",
            "For example between standing and sitting and lying, and so giving us various kinds of features.",
            "Now interesting experiment also is to once this kind of body language has evolved, is to accept it to another domain.",
            "In this case spatial position and so once there are features for like standing."
        ],
        [
            "Or sitting know that in this case the the robots are playing a game about.",
            "Objects in their environment, and because these objects the same features can be applied to the body as can be applied to these particular objects, they can actually use the features, the categories, but then also the words that they have developed to talk about body positions.",
            "They can use them for talking about like whether an object is standing or sitting or lying.",
            "OK.",
            "So this was a second example an I will conclude with."
        ],
        [
            "The final example.",
            "This is for space.",
            "And here again we are.",
            "We are playing language K."
        ],
        [
            "Games.",
            "About space, and maybe I'll just show one example of this.",
            "Let me show the.",
            "The vision system.",
            "At the same time, so this is again with two robots.",
            "You know this space contains a set of objects which also have these bar code like.",
            "Structures you see on the walls and so one row, but this approaching the object and you see in the left hand corner how it's tracking this object.",
            "Then beginning to look around it sees the box it sees the wall it sees this other object, and the other robot is also now looking around in this particular environment, trying to see where the different objects are so that they can play a language came about this and now the language came in this case.",
            "Is about the position of objects in this environment.",
            "So if they want to talk about.",
            "This one, for example.",
            "You know then this is a self evolved language.",
            "This is not an existing human language, but you know there's a phrase saying something like the yellow block closest to the box or something like that.",
            "OK, I think.",
            "Let me go to.",
            "Yeah, let me say a few things about this particular experiment because it uses more sophisticated meaning.",
            "It also uses more sophisticated representations of grammar and emergence of grammar and basically for the."
        ],
        [
            "Presentation of meaning in these more sophisticated experiments we use actually constrained based way for representing the semantics of what is being talked about.",
            "So the robots have at their disposal kind of inventory of components that they can use to operate over the visual data that are coming in and over the categorizations of reality.",
            "So one of them, for example, is perspective reversal.",
            "And so if these are the two, the scene seen by one robot, this is the situation as seen by another robot.",
            "I mean, you see those two robots happen to be across each other in this particular case.",
            "So if one would say left, you know this would be right for the other robot, right?",
            "So you cannot if you talk about space, you need to take perspective into account, and so one of these semantic building blocks, if you wish, is to change the perspective, so to say.",
            "Now let's see the world I'm the speaker, but I'm going to perform a geometric transform so that I can see the world from the perspective of the here.",
            "OK, or from the perspective of another object in the scene, another semantic building block is this one, which is that if you have.",
            "Kind of vectors that emanate from the body like this line or this line.",
            "Then you can categorize again so in terms of left in terms of front in terms of right in terms of back.",
            "So this is another semantic component that can be used by the agents to configure actually constrained program.",
            "Actually that will allow them to hear it would execute this particular program that they would find back the object that the.",
            "Speaker wants to refer to.",
            "So for a simple phrase like the block to your right.",
            "OK, various components need to be brought together, so one of them is to get the objects in the context to filter them to find back the ones that are blocks.",
            "To do this geometric transformation.",
            "So because you're saying to your right, so it means from the perspective of the here to do this filtering with an angular."
        ],
        [
            "Category like left or rights and then to select the object from the set that is remaining.",
            "This is going to be a unique set so you can simply pull it out.",
            "So in our experiments we give these agents an inventory of building blocks and they use.",
            "I know a search process to combine these blocks and to see which one would be effective to refer to the object that they want to refer to.",
            "And then of course this needs to be expressed in a particular with words and with grammatical structures, and I don't have much time."
        ],
        [
            "To talk about all this, but we're using a redeveloped, a new grammar formalism called Fluid Construction grammar that actually allows you to deal with these fluidity.",
            "With this adaptivity of human leg."
        ],
        [
            "Average, so let me conclude here.",
            "I mean, we have been trying to figure out how could we get open ended grounded language on autonomous robots.",
            "And by open end it's you know it's not just that the lexicon and the grammar, they have to kind of emerge.",
            "Let's say in the interaction of the agents, but also the meanings that are being expressed.",
            "The way they cut up real AT in terms of colors in terms of temporal relations or spatial relations or bottali actions.",
            "You know they all have to kind of evolve together in coevolution with the way that the language system itself is evolving.",
            "And so the big inspiration for us has been evolutionary biology because they give ways to think about adaptation, ways to think about, increase of complexity.",
            "And so I sort of showed you a little bit how we are doing that.",
            "You know, we look at very concrete phenomena like color or body language.",
            "Then we try to understand what kind of selection is dynamics we have to set up in order to get a system that produces after a certain number of interactions in a population of agents that produces the kind of phenomena that we're interested in.",
            "And the final thing is that I believe we are, you know, just at the beginning of this kind of work.",
            "I mean, we've been doing in our lab various kinds of case studies, some I've shown here, but in my view we need to look at, you know aspect or 10s or determiners or all these kinds of different phenomena in language from this particular perspective, always deconstructing them, trying to understand the strategies for learning, trying to understand the invention strategies, and this dynamics that will.",
            "You know, cause the system to converge towards a particular.",
            "Coherent set OK."
        ],
        [
            "So thank you very much.",
            "OK, we've got 10."
        ],
        [
            "Minutes for questions.",
            "So raise it, raise your hands.",
            "Pull up messages.",
            "College is open for the elements.",
            "Sorry you mentioned this evolution of the ontology in the communication between the Robert.",
            "So can you describe what kind of elements were in ontology and how they evolved basically and relationships between this and so.",
            "So what was evolution of this knowledge through the time?",
            "You mean 40 ontologies, right?",
            "Ontology?",
            "Yeah, well.",
            "An example of an ontology is the one for color.",
            "The different color categories and of course not just the color candy but how they are grounded in reality.",
            "So there's a set of 1 approach is to use prototypes, but it's not the only approach for sure, you know, But then you see how the boundaries of these categories are kind of shifting as the agents are continuing to play games.",
            "So this is what I mean by evolution of ontologies or.",
            "Adaptation of ontologies.",
            "Yeah in this example, but I mean if you look at the space you know then the ontologies are for example radial categories.",
            "So here they are like near and far.",
            "Or if you're looking at angular categories and left front right back, so it depends on the domain.",
            "It depends on the, let's say, the strategy being used.",
            "What kind of ontology you have?",
            "There's not a single type.",
            "Hi, I know that some of the people in your lab have worked on intelligent, autonomous, intelligent, adaptive curiosity and which provides intrinsic motivation for an individual to learn things.",
            "But is there something that corresponds to that for the language games?",
            "So where would the motivation come from for an individual to receive or reward?",
            "From playing the language game.",
            "OK, thank you for this question.",
            "So indeed, of course a language came first of all is embedded in concrete situation, right?",
            "So you're not talking about colleges for the fun of talking about colors.",
            "You talk about colors because you want something and you use color as a vehicle for getting what you want.",
            "So the objective you know the reward if you wish is always outsides.",
            "Of the game, whether your communication has succeeded.",
            "So this is one thing, but.",
            "There is indeed a big question is about complexity.",
            "Why would language be so complicated?",
            "You know why?",
            "What is the motivating factor?",
            "And then of course it's partly to increase expressive power because you need it in order to have communicated success.",
            "But it's also this intrinsic.",
            "You know, motivation.",
            "That says OK if we try to play this game, and if we're all kind of at a certain level in playing the game, then we reach we increase the challenge for us.",
            "So in one of the experiments we've done, every agent is keeping track of challenges and how far it is in reaching those challenges.",
            "And so if the challenges are too high, it's going to decrease.",
            "It's the challenges that it poses to itself in the game.",
            "If they're too low, is going to increase it, and if you have this kind of thing then you get a coordination of challenges and you see that the population is gradually moving up.",
            "I mean, there's a particular paper that IEEE a live two years ago, which I will send you on this.",
            "OK, my question has to do with the progression of concepts in your agents.",
            "Cognitively, color comes very late to too human babies around the age of two years, plus two years, six months, whereas some of the spatial concepts like proximity come at the age of one or two months.",
            "And So what I'm trying to say is that ultimately, in the ontology that is formed by the agent, these sequencing of concepts have a considerable role and one of the very important things is.",
            "Actions which you have appointed to a little bit in the robot models actions also encode what arguments they take, and they have a lot of role in language.",
            "I was wondering if you were looking at these issues, particularly with respect to actions that model verbs that model the head of sentences and things like that.",
            "I'm not sure I understand your question.",
            "I'm just asking if you are modeling actions and mapping them into verbs in language and also argument structures, that kind of thing.",
            "Yeah, well in the Action Action language games, you know this is a verb oriented.",
            "You could say now the distinction between nouns and verbs or nouns and adjectives or adjectives and adverbs.",
            "And all these things is again something that.",
            "Has to emerge out of the interactions between the agents.",
            "We don't put in any syntactic categories.",
            "Our priority.",
            "You know the question is.",
            "I mean there are languages which don't make a distinction between adjectives and nouns, for example, or we don't have articles or or prepositions.",
            "And all of this so.",
            "But indeed, in an action game, actual language are kind of verb oriented.",
            "You know way because one asks the other one to do something or one describes to the other one away too, in which a particular situation unfolds, like one robot is standing up or sitting down or something like this.",
            "Do you have any comment on you know how your your techniques and methodology here could be used for explaining how one might go about teaching language?",
            "I mean, in your examples you're obviously providing some feedback and and so on, but in terms of actively and effectively teaching language, yeah, this is a good point indeed.",
            "I think one of the application areas.",
            "May not necessarily be.",
            "I don't know.",
            "In robotics, I mean there are not that many humanoid robots walking around at the moment, but is indeed in teaching and particularly for example, second language teaching.",
            "Because if you can deconstruct the particular way that in one language is dealing with one part of the problem of language, for example, articles.",
            "OK, now this is what the speaker of that language.",
            "Already has, then you can kind of understand also the target language, the second language to be learned.",
            "And it's not just a matter of learning the words, it's a matter of acquiring the strategy for learning the words N for reusing them in novel situations and for stretching them and all those kind of things.",
            "So yeah, I think this is a very important possible application.",
            "We have a lot 1 last question.",
            "This is an extension of the question on action, so in this sort of historical work of Sirlin, Sterling, Austin, etc.",
            "Use the word language games, but you didn't really talk about language games, so could you speak a little bit about your intentions for you?",
            "No pun intended to look at at agent recognition, discussion of motivations, etc.",
            "Sort of related to this previous question and how you believe your work relates specifically to that tradition.",
            "Yeah, at the moment the redesign, the language game.",
            "And so the agents are giving scripts to play the game.",
            "OK, it's not that they invent new language games on their own, or things like that.",
            "Of course, we can invent a language game or experiment with a language game, where for one type of speech act you know for another kind of speech, act like a command or a description game where they describe to each other and the game is a success.",
            "If the here agrees, that is a description of the scene that sees before them, there are the guessing games where they draw attention to each other in the world so.",
            "No, but all these things like intentions and goals and I mean they are there.",
            "But I would say this is not the target of what we're trying to do, because in the language games are implicitly there like joint attention also or the way that feedback is being given.",
            "All of these things are important, but we at the moment we set it all up that way, and so this is part of the art of this research is to come up with a good game.",
            "On implementable, doable, so that you see the phenomenon arise that we would like to see arise.",
            "OK, let's thank again the speaker."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Fields graduated from MIT and is now the director of the Sony Computer Science Research Lab in Paris in France, as well as a professor of computer science at the Free University of Brussels, where he founded the AOL app in 1983.",
                    "label": 1
                },
                {
                    "sent": "Prefers Professor steals is a leading AI scientists.",
                    "label": 0
                },
                {
                    "sent": "One of the few truly interdisciplinary researchers in the field.",
                    "label": 0
                },
                {
                    "sent": "He has made outstanding contributions that cover almost the whole AI field, natural language, vision, Robert Behavior, learning, cognitive architecture, knowledge representation.",
                    "label": 0
                },
                {
                    "sent": "More recently, he has focused his research on dialogues for humanoid robots and on fundamental research on the origins of language and meaning.",
                    "label": 0
                },
                {
                    "sent": "His most recent work focuses on developing the foundations of symbiotic dynamics and on fluid construction grammars.",
                    "label": 0
                },
                {
                    "sent": "He's the author of approximately 200 papers fellow of a key and a fellow of the Institute of Advanced Studies in Berlin.",
                    "label": 0
                },
                {
                    "sent": "His talk today is about embodied language games with autonomous robots.",
                    "label": 1
                },
                {
                    "sent": "Please join me in welcoming Professor Lucas deals.",
                    "label": 0
                },
                {
                    "sent": "Thank you Ramon and thank you all for coming to the talk.",
                    "label": 0
                },
                {
                    "sent": "When I started in AI, this is embarrassingly long time ago.",
                    "label": 0
                },
                {
                    "sent": "I was very impressed by the system that their winner Graham had built at MIT in 96.",
                    "label": 0
                },
                {
                    "sent": "So when I started in AI, this is long time ago.",
                    "label": 0
                },
                {
                    "sent": "I was very impressed by this system that Terry Winograd had built at MIT.",
                    "label": 0
                },
                {
                    "sent": "And it was impressive to me because it combined many things in language processing.",
                    "label": 0
                },
                {
                    "sent": "I mean parsing, production knowledge, representation, planning, learning.",
                    "label": 0
                },
                {
                    "sent": "And so this seemed like an incredible breakthrough.",
                    "label": 0
                },
                {
                    "sent": "Now if you look back, I mean, this is 40 years ago to see where we are in language processing.",
                    "label": 0
                },
                {
                    "sent": "Then of course a lot has been achieved in the Meanwhile.",
                    "label": 0
                },
                {
                    "sent": "But if you really think about grounded language processing, which is really, you know, like you have a scene with two robots and one is asking to pick up the Red Bull.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now this is already a very different matter.",
                    "label": 0
                },
                {
                    "sent": "Of course we can set up some little demo like that, but I would argue that open ended grounded communication with language is still a goal for AI and is still an elusive goal.",
                    "label": 0
                },
                {
                    "sent": "Now, why would that be?",
                    "label": 0
                },
                {
                    "sent": "Well, I think the first thing is that natural language.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This error prone in the sense that when we speak.",
                    "label": 0
                },
                {
                    "sent": "We make phrases that are not necessarily grammatical or complete.",
                    "label": 0
                },
                {
                    "sent": "We use words in the wrong way.",
                    "label": 0
                },
                {
                    "sent": "Natural languages open ended in the sense that we may use words in new meanings or expand grammatical constructions.",
                    "label": 0
                },
                {
                    "sent": "So languages adaptive.",
                    "label": 0
                },
                {
                    "sent": "Actually, when you look at the research that psychologists have done on natural dialogue, they discovered that people actually attuned to each other.",
                    "label": 0
                },
                {
                    "sent": "They align their lexicons, their ontologies, their grammars.",
                    "label": 0
                },
                {
                    "sent": "Two each other in order to be more efficient in speaking so it's not that natural language is a static system that we can implement once and then the job is done.",
                    "label": 0
                },
                {
                    "sent": "Second, difficulty, of course is that in grounded language requires that we deal with all the different parts of AI, so to speak.",
                    "label": 1
                },
                {
                    "sent": "I mean, the embodiment perception motor control.",
                    "label": 1
                },
                {
                    "sent": "We need dialogue management cooperative interactions, then to conceptualize what we're going to express as speaker.",
                    "label": 0
                },
                {
                    "sent": "The production of language, the interpretation of it, the parsing of it, you know all of these things.",
                    "label": 0
                },
                {
                    "sent": "Adaptation and learning all have to come together.",
                    "label": 0
                },
                {
                    "sent": "Into a single system and this is of course complicated.",
                    "label": 1
                },
                {
                    "sent": "Another thing I believe is that there's huge variation which is usually under appreciated by people who speak only one or two languages, which is that actually languages in the world are very different, not just in terms of the lexicon.",
                    "label": 0
                },
                {
                    "sent": "That's pretty obvious, but also in terms of the meanings that are expressed.",
                    "label": 0
                },
                {
                    "sent": "The way that reality is conceptualized for language.",
                    "label": 0
                },
                {
                    "sent": "And so that's I think another reason why we're dealing with a very difficult problem here.",
                    "label": 1
                },
                {
                    "sent": "And then the final thing I want to point out is that language and meaning they're not just a matter of the individual.",
                    "label": 0
                },
                {
                    "sent": "When we built an individual agent or a program that is doing some sort of natural language well, we're missing out on the collective aspect.",
                    "label": 0
                },
                {
                    "sent": "And if language of individuals is obviously influenced by the language of the community in which they are, and vice versa, we all speak.",
                    "label": 0
                },
                {
                    "sent": "And we all influence the way that this common languages is built.",
                    "label": 0
                },
                {
                    "sent": "So these are sort of the kinds of things that I've been worrying about.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And of course, I mean Winograd said in 2005.",
                    "label": 0
                },
                {
                    "sent": "We need very long term research to get a handle on human natural language and this was this conclusion after should lewd.",
                    "label": 1
                },
                {
                    "sent": "Now, if you think 40 years back you know I don't think that much really very long term research has been done so that we can say that there's so much progress.",
                    "label": 0
                },
                {
                    "sent": "And my feeling is that we need to methodology and this is going to be sort of my main topic in this talk is to reflect on what kind of methodology could we use to explore these various issues.",
                    "label": 0
                },
                {
                    "sent": "And of course we need components.",
                    "label": 0
                },
                {
                    "sent": "You know, we need grammar, formalisms, knowledge representation, perception, all of that.",
                    "label": 0
                },
                {
                    "sent": "But I think we need to focus in particular on the issues of adaptation, ongoing adaptation, online learning if you want.",
                    "label": 0
                },
                {
                    "sent": "But it's more than.",
                    "label": 0
                },
                {
                    "sent": "Then learning it's kind of alignment coordination.",
                    "label": 0
                },
                {
                    "sent": "Also in terms of autonomous growth in complexity of language like in development or actually also in emerging languages that you see that there's more and more complexity coming up.",
                    "label": 0
                },
                {
                    "sent": "So how does that work?",
                    "label": 0
                },
                {
                    "sent": "And then there's the issue of self organization, of how the community, how the collective can influence the individual and vice versa.",
                    "label": 0
                },
                {
                    "sent": "Now if you look around for ideas on methodologies that we could use, I think there is actually an obvious choice, and this is evolutionary biology and so.",
                    "label": 0
                },
                {
                    "sent": "Now I don't have to explain of course to you here.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Where the basic ideas of evolutionary biology, I mean.",
                    "label": 1
                },
                {
                    "sent": "First of all, there is a principle.",
                    "label": 0
                },
                {
                    "sent": "This is the principle of evolution.",
                    "label": 0
                },
                {
                    "sent": "And basically you.",
                    "label": 0
                },
                {
                    "sent": "I mean they start from this idea that you have variation.",
                    "label": 0
                },
                {
                    "sent": "That there's heredity, and that their selection.",
                    "label": 0
                },
                {
                    "sent": "And if you have different environments and certain phenotypes, certain organisms will be more adapted to that particular environment, and so you know they will have less risk to be eaten by predators.",
                    "label": 0
                },
                {
                    "sent": "They have more success in reproduction and all of that.",
                    "label": 0
                },
                {
                    "sent": "So you have fitness which is feeding back on the frequency of genes in the gene pool.",
                    "label": 0
                },
                {
                    "sent": "So this is one thing, but I think there's another thing is that once.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Evolutionary biology has this big principle for thinking about adaptation.",
                    "label": 0
                },
                {
                    "sent": "Thinking about the increase in complexity, and then they start working this out for concrete cases.",
                    "label": 0
                },
                {
                    "sent": "So here is one of the example of this which I find very beautiful or not.",
                    "label": 0
                },
                {
                    "sent": "Typically they start looking at a certain phenomenon, such as the egg spots on the finova fish.",
                    "label": 0
                },
                {
                    "sent": "OK, there's this species of fish which has these experts.",
                    "label": 0
                },
                {
                    "sent": "So the question is what are they for?",
                    "label": 0
                },
                {
                    "sent": "How could they have evolved?",
                    "label": 0
                },
                {
                    "sent": "You know, what are the mechanisms behind of this and evolutionary biologists have developed techniques that they can completely figure out.",
                    "label": 0
                },
                {
                    "sent": "Actually, first of all, the function of the whole thing in the ecology of the environment.",
                    "label": 0
                },
                {
                    "sent": "And it turns out that these experts play a crucial role in the reproductive strategy of this species.",
                    "label": 0
                },
                {
                    "sent": "So what happens is that the female lays down the eggs and then is going to take the eggs back in the mouth for further development now.",
                    "label": 0
                },
                {
                    "sent": "What the male is doing is actually faking that there are still more eggs.",
                    "label": 0
                },
                {
                    "sent": "By having these experts, so that in this way he can fertilize the eggs when the female is trying to suck up more eggs.",
                    "label": 0
                },
                {
                    "sent": "So this is amazing.",
                    "label": 0
                },
                {
                    "sent": "This amazing mechanism available that is used in reproduction and that's of course gives and a reproductive advantage through the species or two D individuals that have those genes which leads to the further propagation of those jeans.",
                    "label": 0
                },
                {
                    "sent": "So this is the.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Methodology of evolutionary biology to select the phenomenon like exports to try to understand what it is for.",
                    "label": 1
                },
                {
                    "sent": "In this case it's for plays a role in the reproductive strategy.",
                    "label": 0
                },
                {
                    "sent": "Then to understand how it gets built, how the genetics plays a role, what is going on in development and then also they try to figure out how this particular strategy or this phenotypic feature has a certain selective advantage compared to another one.",
                    "label": 1
                },
                {
                    "sent": "And then they try to find out how it emerged and they can do this.",
                    "label": 0
                },
                {
                    "sent": "You know they taken an Organism or an animal or something.",
                    "label": 0
                },
                {
                    "sent": "They see a particular trait and they reconstruct this whole thing and that way are able to understand and explain this particular feature.",
                    "label": 0
                },
                {
                    "sent": "So I think what I'm going to do to argue in my talk is that we can use a similar methodology to think about language.",
                    "label": 0
                },
                {
                    "sent": "And the first point, of course, is well.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What are the phenomena that we are looking at the phenomenon that we are looking at our particular features of language?",
                    "label": 0
                },
                {
                    "sent": "For example, we see Spanish speakers or English speakers or whatever use color terms like red and green and blue and so on, and they use them to refer to particular objects in the world.",
                    "label": 0
                },
                {
                    "sent": "So this is an example of a phenomenon that we try to explain.",
                    "label": 1
                },
                {
                    "sent": "Now, if you have a certain context, let's say a certain set of chips and this is speaker, you say fair there.",
                    "label": 0
                },
                {
                    "sent": "Then you can be pretty sure that the here is going to pay attention to this particular object.",
                    "label": 0
                },
                {
                    "sent": "So using these color terms you can actually draw attention to objects in the environment.",
                    "label": 1
                },
                {
                    "sent": "Now, if you want to build a model of that, I think all of you are completely able to do this.",
                    "label": 0
                },
                {
                    "sent": "You know you would say, well, there's visual perception going on.",
                    "label": 0
                },
                {
                    "sent": "We get information RGB or in short medium long term, long wavelength.",
                    "label": 0
                },
                {
                    "sent": "Of the colors, they are mixed into the component, sorry opponent channels, so you have a brightness channel.",
                    "label": 0
                },
                {
                    "sent": "You have yellow blue channel, you have a red green channel.",
                    "label": 0
                },
                {
                    "sent": "This is creating some sort of color space and then you have points in this color space which are prototypes.",
                    "label": 0
                },
                {
                    "sent": "Typical examples of the colors and so if you have to name a color, you look at the sample and you compare the point of the color of that sample in you in this color space and you look at the nearest neighbor, you find the prototype.",
                    "label": 0
                },
                {
                    "sent": "And you find back the name of that prototype.",
                    "label": 0
                },
                {
                    "sent": "I mean, that's roughly how I think.",
                    "label": 0
                },
                {
                    "sent": "You know, we can operationalize this.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, as I said, there's a lot of variation between different languages, and I just want to point out for color.",
                    "label": 0
                },
                {
                    "sent": "Berlin and Kay have been going around and also many of other people have been going around with color chips.",
                    "label": 0
                },
                {
                    "sent": "These muscle chips, in order to figure out what are the color prototypes in specific languages.",
                    "label": 0
                },
                {
                    "sent": "And so, for example, for English you have a color type for green, prototype for blue, prototype for purple, and they cut out certain region in the color space.",
                    "label": 0
                },
                {
                    "sent": "Now the point is that if you go to another language then you will find other ways of cutting up the region in the color space.",
                    "label": 0
                },
                {
                    "sent": "For example, in Japanese you already have an area called Owl which combines actually blue and green and if you look at even more exotic tribes like this is for.",
                    "label": 0
                },
                {
                    "sent": "The bidding more which is Papua New Guinea tribe, you see that they actually organize the color space in a very different way, so they have words like null and wash for these regions of the color space, which are quite different from the regions that you would find in English.",
                    "label": 0
                },
                {
                    "sent": "For green and blue.",
                    "label": 0
                },
                {
                    "sent": "So you see, even if we look at the simple thing like color and we start to delve into how that could work, we find variation between different languages and we also find.",
                    "label": 0
                },
                {
                    "sent": "That",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This evolution.",
                    "label": 0
                },
                {
                    "sent": "But for example, the in English in Old English you had all sorts of words which we still have, like red and yellow, blue and Brown, and so on.",
                    "label": 0
                },
                {
                    "sent": "But these words actually were not Hugh terms.",
                    "label": 0
                },
                {
                    "sent": "In Old English there were more related to brightness.",
                    "label": 0
                },
                {
                    "sent": "So what happened in the shift from Old English to Middle English is actually a shift from emphasis on brightness on shiny.",
                    "label": 0
                },
                {
                    "sent": "My dark and so on.",
                    "label": 0
                },
                {
                    "sent": "A shift towards Hugh terms under the influence of dye industry, so I'm showing this in order to show that you know, language is not a static system, but this actually continuously evolving the ontologies are changing.",
                    "label": 0
                },
                {
                    "sent": "Of course the words may be changing and this is the kind of thing that we.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Would like to understand so if we transposed the methodology of evolutionary biology to AI, what would that mean?",
                    "label": 1
                },
                {
                    "sent": "Well, we take a phenomenon like color or time or space or articles case, information structure, whatever interests us in natural language, we tried to understand its function.",
                    "label": 1
                },
                {
                    "sent": "What role is it playing in communication then?",
                    "label": 0
                },
                {
                    "sent": "How it gets built?",
                    "label": 0
                },
                {
                    "sent": "You know, the learning process is the invention strategies behind it then show that using this particular feature of a language like color or articles has a certain advantage in communication as a selective advantage.",
                    "label": 0
                },
                {
                    "sent": "And then we try to find out how that particular feature may have emerged.",
                    "label": 0
                },
                {
                    "sent": "So now I'm going to show you 3 examples of the application of this.",
                    "label": 0
                },
                {
                    "sent": "How we do this in our lab?",
                    "label": 0
                },
                {
                    "sent": "And basic.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We start from the idea of a language game.",
                    "label": 0
                },
                {
                    "sent": "The language game is a kind of interaction between two agents you know, like here, one is asking for a bottle of water, gives the wine and things like that.",
                    "label": 1
                },
                {
                    "sent": "So we have a situation.",
                    "label": 0
                },
                {
                    "sent": "We have at least two agents there.",
                    "label": 0
                },
                {
                    "sent": "Shared attention.",
                    "label": 0
                },
                {
                    "sent": "There is some feedback being given.",
                    "label": 0
                },
                {
                    "sent": "You know there's some language being used, but there's also a perception, so this is going to be the cell that we are investigating.",
                    "label": 0
                },
                {
                    "sent": "The minimal units in which the phenomena.",
                    "label": 0
                },
                {
                    "sent": "Arise that we are interested in.",
                    "label": 0
                },
                {
                    "sent": "Now the second idea.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is that we are going to use robots?",
                    "label": 0
                },
                {
                    "sent": "And we're going to use these in our lab.",
                    "label": 0
                },
                {
                    "sent": "We use these curio, Sony, Curio humanoids.",
                    "label": 0
                },
                {
                    "sent": "They're not a commercial product.",
                    "label": 0
                },
                {
                    "sent": "But I mean there are really fantastic robots with vision, movement and the whole thing.",
                    "label": 0
                },
                {
                    "sent": "OK, so now what we're going to do or what we tried to do is to implement language games on these robots and so we focus on a particular.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Phenomenon like color for example.",
                    "label": 0
                },
                {
                    "sent": "And so we play or we set it up so that these robots play.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A color naming game.",
                    "label": 0
                },
                {
                    "sent": "Now, the best thing is probably to see an example of such a.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Day.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So typically we get.",
                    "label": 0
                },
                {
                    "sent": "I mean they are in an environment in which there are certain colorful objects, like here.",
                    "label": 0
                },
                {
                    "sent": "And so the goal is that the speaker is going to draw attention to the here by using a particular word and the words like here it's boelema.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, you don't hear the sound that's not so important.",
                    "label": 0
                },
                {
                    "sent": "So then the.",
                    "label": 0
                },
                {
                    "sent": "The here is pointing to one object that it thinks is refering to boelema and then the speaker is giving feedback on whether the here pointed to the right object.",
                    "label": 0
                },
                {
                    "sent": "So this is a game is like you know we sit at the table.",
                    "label": 0
                },
                {
                    "sent": "I ask you for the water and you give me the innocent or not.",
                    "label": 0
                },
                {
                    "sent": "This is not.",
                    "label": 0
                },
                {
                    "sent": "Walter, This is why it's something like that, so this is an example of a game.",
                    "label": 0
                },
                {
                    "sent": "Here is another one.",
                    "label": 0
                },
                {
                    "sent": "Maybe I can move the sound?",
                    "label": 0
                },
                {
                    "sent": "So here again, they look around and they see the environment.",
                    "label": 0
                },
                {
                    "sent": "One of them is saying something.",
                    "label": 0
                },
                {
                    "sent": "This is the one in the back is again saying boelema.",
                    "label": 0
                },
                {
                    "sent": "The other one looks around to see what a ballymount might be.",
                    "label": 0
                },
                {
                    "sent": "Points to the object and then the other one is going to agree or disagree with this particular thing.",
                    "label": 0
                },
                {
                    "sent": "OK, so in this case he agrees.",
                    "label": 0
                },
                {
                    "sent": "So this is an example of a language key and we want to set up language games to study different aspects of language like space or time or those kinds of things.",
                    "label": 0
                },
                {
                    "sent": "So let me use the.",
                    "label": 0
                },
                {
                    "sent": "Example of the color naming game.",
                    "label": 0
                },
                {
                    "sent": "To better explain this methodology that we are using.",
                    "label": 0
                },
                {
                    "sent": "Now of course, to play this game.",
                    "label": 0
                },
                {
                    "sent": "Lots of things need to happen and to start with we need.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Perception, because you cannot talk about objects you cannot point to objects you know when you cannot see the objects that are in their environment and so we using basically techniques that you all know for doing the recognition of objects.",
                    "label": 0
                },
                {
                    "sent": "Or let's say the carving out objects in the world.",
                    "label": 0
                },
                {
                    "sent": "So this is the 3D color space here to the right and every point in the image is being mapped in real time.",
                    "label": 0
                },
                {
                    "sent": "Into this color space so you can already see that if all the orange point, let's say, are going to form one particular region in the color space.",
                    "label": 0
                },
                {
                    "sent": "OK, now then.",
                    "label": 0
                },
                {
                    "sent": "This is again from the vision system on the robot.",
                    "label": 0
                },
                {
                    "sent": "Is using color segmentation using foreground background segmentation also doing edge detection in order to be able to track objects and to build up a model of the environment in order to play a language game.",
                    "label": 0
                },
                {
                    "sent": "Now notice that the robot is actually both doing bottom up processing of the visual image that are streaming in, but also top down predictions of what it is seeing.",
                    "label": 0
                },
                {
                    "sent": "In order to be able to figure out.",
                    "label": 0
                },
                {
                    "sent": "You know where objects are with respect to the immediate path, because this is necessary for tracking.",
                    "label": 0
                },
                {
                    "sent": "So here is an example of a robot that's actually building up a model of its environment.",
                    "label": 0
                },
                {
                    "sent": "Doing top down prediction where the other objects are going to be in the environment even if he doesn't see them anymore.",
                    "label": 0
                },
                {
                    "sent": "And doing this is using Kalman filters to predict next state of reality Bolt from the viewpoint or integrating how he himself is moving around.",
                    "label": 0
                },
                {
                    "sent": "Is this me?",
                    "label": 0
                },
                {
                    "sent": "My point was not so important.",
                    "label": 0
                },
                {
                    "sent": "You know, and of course the objects as they are moving around.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is a little peek into the vision system.",
                    "label": 0
                },
                {
                    "sent": "I don't want to say more of that.",
                    "label": 0
                },
                {
                    "sent": "What is more relevant here is then what comes after the vision system.",
                    "label": 0
                },
                {
                    "sent": "So you have.",
                    "label": 0
                },
                {
                    "sent": "We need a way to conceptualize what to say in this case.",
                    "label": 0
                },
                {
                    "sent": "This will be to choose a particular color category and then we need to choose a word for it.",
                    "label": 0
                },
                {
                    "sent": "And here has to parse that particular word and interpret it in in the reality itself.",
                    "label": 0
                },
                {
                    "sent": "So if we go back to our game.",
                    "label": 0
                },
                {
                    "sent": "You know this is the.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actually, now it's the same game as before, but I'm showing at the bottom left what the left agent is seeing at the bottom right.",
                    "label": 0
                },
                {
                    "sent": "What the right agents is seeing and you also see the you know the vision system in action.",
                    "label": 0
                },
                {
                    "sent": "The square is what they are.",
                    "label": 0
                },
                {
                    "sent": "Actually, let me start again.",
                    "label": 0
                },
                {
                    "sent": "The square is what they are actually seeing and you see the.",
                    "label": 0
                },
                {
                    "sent": "You know the prediction and the reality.",
                    "label": 0
                },
                {
                    "sent": "The 3D model that's being built up by these agents.",
                    "label": 0
                },
                {
                    "sent": "So if we talk about language games.",
                    "label": 0
                },
                {
                    "sent": "Talking about it in the abstract, you know we talk about it grounded in the reality with the concrete objects with pointing and with the necessary feedback, and so on.",
                    "label": 0
                },
                {
                    "sent": "OK?",
                    "label": 0
                },
                {
                    "sent": "So now what I'm going to show is how we actually deconstruct, step by step, a color language.",
                    "label": 0
                },
                {
                    "sent": "And the same technique we would use to deal with space, for example, or to deal with time.",
                    "label": 0
                },
                {
                    "sent": "And so the first step is that we take an existing system, for example the Spanish color terms.",
                    "label": 0
                },
                {
                    "sent": "And we try to build a system that is able to play this game by using an existing system.",
                    "label": 0
                },
                {
                    "sent": "Now we can do that because we have data from psychological experiments.",
                    "label": 0
                },
                {
                    "sent": "What the prototypes are that Spanish speakers tend to use connected to words like Faraday, Azul and so on.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so the when we.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Implement the system like that and we let those agents play language games.",
                    "label": 0
                },
                {
                    "sent": "Then we get the kind of result like the one shown here.",
                    "label": 0
                },
                {
                    "sent": "So in this axis we have the number of interactions between the agents, so we let them play many different language games and this is a population that only consists of two agents which both have already.",
                    "label": 0
                },
                {
                    "sent": "You know, we implemented the prototypes.",
                    "label": 0
                },
                {
                    "sent": "We implemented the lexecon so that they could play the game and this is the success.",
                    "label": 0
                },
                {
                    "sent": "Reds of playing that particular game.",
                    "label": 0
                },
                {
                    "sent": "They're not always successful, because as you can see here, the samples we present to them are sometimes so close that you cannot win in the game by just using these basic Spanish color terms.",
                    "label": 0
                },
                {
                    "sent": "So this is sort of 1st baseline that we know that we've been able to capture the natural system that we find in this case among Spanish speakers.",
                    "label": 0
                },
                {
                    "sent": "The next step we do.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Send to say OK, let's pull out the lexecon and let's implement the strategy for learning the lexicon.",
                    "label": 0
                },
                {
                    "sent": "Again, that's not so difficult.",
                    "label": 0
                },
                {
                    "sent": "You know we need bidirectional associative memory, and we need every time that an agent sees the sample of a particular color.",
                    "label": 0
                },
                {
                    "sent": "And here's a word, well, because we assume here in this step that they already have the grounded ontology.",
                    "label": 0
                },
                {
                    "sent": "You know, they just have to associate the word with the prototype that's being used for this particular sample.",
                    "label": 0
                },
                {
                    "sent": "So this is not so difficult.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is then the result we get here, so the blue line is like before the success rate of, let's say, adult Spanish speakers, and now we throw in here interactions between the learning agents and an agent which already has the system and you see how quickly.",
                    "label": 0
                },
                {
                    "sent": "It reaches the same level of Communitive success as those that already had the system have, and this is the size of the lexicon here growing 211.",
                    "label": 1
                },
                {
                    "sent": "Color terms because in Spanish you have in living color terms so, so this is demonstrating that we have been able to capture the learning strategy that a Spanish speaker would need to learn the Spanish color terms.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The next step is to say, OK, let's pull out the ontology.",
                    "label": 0
                },
                {
                    "sent": "Let's see how we can implement the strategies.",
                    "label": 0
                },
                {
                    "sent": "So the agents can learn the ontology and learn the lexicon.",
                    "label": 1
                },
                {
                    "sent": "Now to learn an ontology based on this kind of nearest neighbor prototypes.",
                    "label": 0
                },
                {
                    "sent": "I mean I don't have to explain this for this audience, you know it can be done by creating new prototypes based on seeing the first example of a new color, or by shifting around the prototype in order to become better adapted to the use of a certain word with a certain prototype.",
                    "label": 0
                },
                {
                    "sent": "And indeed.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You implement that.",
                    "label": 0
                },
                {
                    "sent": "You get this kind of results again.",
                    "label": 0
                },
                {
                    "sent": "Here I plot the success rate of the implemented Spanish color speakers.",
                    "label": 0
                },
                {
                    "sent": "And this is now the example where.",
                    "label": 0
                },
                {
                    "sent": "An agent who does not know the ontology who does not know the lexecon, nevertheless, is able to learn both by playing this kind of game and by using these mechanisms that I just chose.",
                    "label": 0
                },
                {
                    "sent": "OK, this is the size of the lexicon.",
                    "label": 0
                },
                {
                    "sent": "This is the success rate of this learning agents and this is the variance between the two.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Agents now the next step is to say, OK, what about if there is no example?",
                    "label": 0
                },
                {
                    "sent": "There is no adult Spanish speaker that is teaching to the learner the use of the Spanish color terms.",
                    "label": 0
                },
                {
                    "sent": "Can we build a system that actually creates a color lexicon from scratch both towards an these prototypes?",
                    "label": 0
                },
                {
                    "sent": "And that's actually not so difficult.",
                    "label": 0
                },
                {
                    "sent": "We have already the mechanism for building up prototypes, shifting them around.",
                    "label": 0
                },
                {
                    "sent": "And now we just need a way to invent words for them, you know, and we use these syllables like Rob, Adobe, Domo or something.",
                    "label": 0
                },
                {
                    "sent": "And they are associated in this memory with the prototypes that are build up and learned.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The way I explained before.",
                    "label": 0
                },
                {
                    "sent": "So now we get this kind of results.",
                    "label": 0
                },
                {
                    "sent": "This is now for a population of five agents.",
                    "label": 0
                },
                {
                    "sent": "This is still the number of games that they are playing.",
                    "label": 0
                },
                {
                    "sent": "This here is the communitive success, so we see that starting from scratch you know this thing goes up to 90% or higher rate of success in playing this particular game.",
                    "label": 0
                },
                {
                    "sent": "This is the size of the lexecon and this is the variance between the ontologies and the lexicons of the agents, so there's a bit of a miracle that has happened here.",
                    "label": 0
                },
                {
                    "sent": "We have these.",
                    "label": 0
                },
                {
                    "sent": "Agents we gave them this strategy for building up a color language.",
                    "label": 0
                },
                {
                    "sent": "We let them play this game and then actually quite quickly.",
                    "label": 0
                },
                {
                    "sent": "You know, after 200 while 300 games, let's say per agent they have already.",
                    "label": 0
                },
                {
                    "sent": "80% or more success and it keeps going up.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is a peek into the prototypes of the agents.",
                    "label": 0
                },
                {
                    "sent": "On the left you have the prototypes after 1000 games.",
                    "label": 1
                },
                {
                    "sent": "Here you have them after 2500 games and you see that here the prototypes are not yet very coordinated and they become more and more coordinated to weigh.",
                    "label": 0
                },
                {
                    "sent": "The agents are playing more and more games, so we're capturing this kind of collective dynamics.",
                    "label": 0
                },
                {
                    "sent": "This move towards coherence when the agents are.",
                    "label": 0
                },
                {
                    "sent": "Starting from scratch, actually coordinate more and more their ontologies and their lexicons.",
                    "label": 0
                },
                {
                    "sent": "Another way to see what.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What's going on is in the top left corner there where I'm plotting all the different prototypes of the agents in one plot.",
                    "label": 0
                },
                {
                    "sent": "And you can still you can see that there.",
                    "label": 0
                },
                {
                    "sent": "Actually these prototypes are shifting around as the agents are playing games because after every game they are really adapting themselves to each other.",
                    "label": 0
                },
                {
                    "sent": "They are aligning their ontologies and aligning their lexicons.",
                    "label": 0
                },
                {
                    "sent": "This is the same thing, but now for the mapping of the different words.",
                    "label": 0
                },
                {
                    "sent": "And here again you see this kind of continuous adaptation dynamics.",
                    "label": 0
                },
                {
                    "sent": "Now yet another way to see what is going on.",
                    "label": 0
                },
                {
                    "sent": "Is if we look inside the memory of a single agent look at the associations that it has between sensory experiences, the prototypes and the words.",
                    "label": 0
                },
                {
                    "sent": "So this is again starting from scratch and you.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This kind of peek into their memory so you see the blue or the different words, and these things are the representation of the prototypes, and these are sensory experiences that are being grabbed by the agents as they try to cope with new experiences, and so this is only a single agent.",
                    "label": 0
                },
                {
                    "sent": "But this agent is playing games with with another agent, right?",
                    "label": 0
                },
                {
                    "sent": "So other agents may inject new words into this population.",
                    "label": 0
                },
                {
                    "sent": "Or the new situations may be encountered so that there's a need to split prototype single prototype into two prototypes and so on.",
                    "label": 0
                },
                {
                    "sent": "Now if you look carefully, actually, maybe now less, but you'll see that actually the prototypes you know, the shifting a little bit around the typical values on each of these channels.",
                    "label": 0
                },
                {
                    "sent": "Are shifting around or a word may shift in meaning and those kinds of things.",
                    "label": 0
                },
                {
                    "sent": "So we are beginning to see the rich dynamics that we see in natural languages in the way that lexicons and words and meanings are evolving.",
                    "label": 0
                },
                {
                    "sent": "We are beginning to get a handle on simulating them in these robotic systems.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So why does it work well?",
                    "label": 0
                },
                {
                    "sent": "I think it's selection is system in the sense that.",
                    "label": 0
                },
                {
                    "sent": "You know we we have a language strategy is to use basic prototypes for building language about color.",
                    "label": 1
                },
                {
                    "sent": "But then, of course, there's still many possibilities.",
                    "label": 0
                },
                {
                    "sent": "Just like we find a lot of variation in human languages like between the English and Brynmor.",
                    "label": 0
                },
                {
                    "sent": "But there is this selectionist loop in the sense that if.",
                    "label": 0
                },
                {
                    "sent": "Particular words has communicated success, then its use will increase by that agents or in the population.",
                    "label": 0
                },
                {
                    "sent": "Or if a word is not successful then it will decrease.",
                    "label": 0
                },
                {
                    "sent": "So we get the same sort of loop that we find in Darwinian system.",
                    "label": 0
                },
                {
                    "sent": "And the second thing is also that we see here that language is an emergent structure.",
                    "label": 1
                },
                {
                    "sent": "There is self organization because communicate if success your communicated success depends also.",
                    "label": 0
                },
                {
                    "sent": "On whether the here you're talking to shares.",
                    "label": 0
                },
                {
                    "sent": "Your lexicon to some extent, or shares your ontology.",
                    "label": 0
                },
                {
                    "sent": "So this was an example.",
                    "label": 0
                },
                {
                    "sent": "Let me just check that I'm here.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "This was an example to show.",
                    "label": 0
                },
                {
                    "sent": "You know this this this methodology at work.",
                    "label": 0
                },
                {
                    "sent": "So we select the phenomenon, we deconstruct it.",
                    "label": 0
                },
                {
                    "sent": "We try to understand how it works.",
                    "label": 1
                },
                {
                    "sent": "Then we try to understand the strategies for learning for invention and that way we can kind of begin to understand how this particular feature of language arises.",
                    "label": 0
                },
                {
                    "sent": "But that's not all, because in.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Evolutionary biology.",
                    "label": 0
                },
                {
                    "sent": "There's also research on the question how?",
                    "label": 0
                },
                {
                    "sent": "Particular strategy may come about and what they do.",
                    "label": 0
                },
                {
                    "sent": "For example, in this is a species called Pima.",
                    "label": 0
                },
                {
                    "sent": "Which has different colors and so biologists.",
                    "label": 0
                },
                {
                    "sent": "They go out in nature and they measure.",
                    "label": 0
                },
                {
                    "sent": "You know whether the what is the, let's say selection is pressure.",
                    "label": 0
                },
                {
                    "sent": "If the Organism has one type of car.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or or another type of color and they make these kinds of studies comparing in different environments what the fitness is of a certain variant of the species with respect to another one, so we can do the same kind of thing actually now with.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our language games in our language strategies.",
                    "label": 0
                },
                {
                    "sent": "For example, we can say OK, we built a population of agents.",
                    "label": 0
                },
                {
                    "sent": "That's that's able to do build up a color language based on using Hue and brightness.",
                    "label": 1
                },
                {
                    "sent": "In this color space now.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Would have another color strategy which uses only brightness, like in Old English, so in that sense you can also have prototypes and you know we can set that up and then after let's say 3500 games they start to have more and more similar prototypes but now only in the brightness space and then just like the evolution.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Biologists are comparing different strategies for playing the game of life.",
                    "label": 0
                },
                {
                    "sent": "You could say we can also compare different strategies for being successful in a particular kind of language key.",
                    "label": 0
                },
                {
                    "sent": "And so it's not surprising here that if your environment Hue is not important, well then the brightness strategy is going to have most success, whereas if you is very important in your environment, you know, then the.",
                    "label": 0
                },
                {
                    "sent": "The brightness strategy will have much less success, and so we can kind of play these do these experiments.",
                    "label": 0
                },
                {
                    "sent": "Where you actually the agents have different strategies in competition with each other, and they're keeping track of how successful they are in the language games that they are playing with a particular strategy.",
                    "label": 0
                },
                {
                    "sent": "And of course success with a particular strategy will depend also on whether other agents in the population are following a similar strategy.",
                    "label": 0
                },
                {
                    "sent": "And here is an example of 1 experiment where.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the beginning, well, this is the green line.",
                    "label": 0
                },
                {
                    "sent": "Here is Communitive success.",
                    "label": 0
                },
                {
                    "sent": "The blue line is the use of the full color space and the red one is the use or fitness in this case of the.",
                    "label": 0
                },
                {
                    "sent": "Brightness strategy and you see that you know there's a kind of shift between different strategies in this population that they're shifting from.",
                    "label": 0
                },
                {
                    "sent": "Predominantly brightness strategy to predominantly Hue strategy.",
                    "label": 0
                },
                {
                    "sent": "OK, So what we see here is a second selection.",
                    "label": 0
                },
                {
                    "sent": "Is loop OK?",
                    "label": 0
                },
                {
                    "sent": "It's not just a choice of what words, what meanings.",
                    "label": 0
                },
                {
                    "sent": "What grammatical constructions will be used in a language based on feedback in the game, but it's also which strategy is going to be used for by the population for playing this particular game.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this was one example.",
                    "label": 0
                },
                {
                    "sent": "Now I'm going to give a totally different example, but it's the same kind of philosophy.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, now the second example is about body language and again we.",
                    "label": 0
                },
                {
                    "sent": "Play language games.",
                    "label": 0
                },
                {
                    "sent": "Body language, I mean things like stand right arm up.",
                    "label": 0
                },
                {
                    "sent": "You know which you can then use for describing posture.",
                    "label": 0
                },
                {
                    "sent": "But you can also use it for describing positions of objects and even for metaphorical descriptions.",
                    "label": 0
                },
                {
                    "sent": "So we start in this domain.",
                    "label": 0
                },
                {
                    "sent": "We say, OK, we do the same thing.",
                    "label": 0
                },
                {
                    "sent": "You know we start to deconstruct first how a particular language for talking about action.",
                    "label": 0
                },
                {
                    "sent": "May arise in such a population, and so we set it up that they play language games with each other.",
                    "label": 0
                },
                {
                    "sent": "Language games now.",
                    "label": 0
                },
                {
                    "sent": "R. Going to be about sorry.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About actions, so for example.",
                    "label": 0
                },
                {
                    "sent": "Here is 1.",
                    "label": 0
                },
                {
                    "sent": "So the so the speaker asks to do an action to the here and then the speaker will see whether this is the action that you requested and if it's not the action that he requested, he will show to the other one which action that he actually had in mind.",
                    "label": 0
                },
                {
                    "sent": "So it's like saying raise your left arm and you do something you know and if it's not thing that I think is raising your left arm, then giving you feedback on what I think it is.",
                    "label": 0
                },
                {
                    "sent": "So so these language games are again require a categorization of reality.",
                    "label": 0
                },
                {
                    "sent": "They require that are certain words that are agreed upon by the agents for talking about bodily action.",
                    "label": 0
                },
                {
                    "sent": "And they of course require also that agents are able to understand when they see a particular visual image of an action, like raise your left arm.",
                    "label": 0
                },
                {
                    "sent": "You know that this corresponds to a certain action that they would do themselves.",
                    "label": 0
                },
                {
                    "sent": "So this is the sort of the mirror problem you know for which there's this whole literature on mirror neurons and so on at the moment.",
                    "label": 0
                },
                {
                    "sent": "And so the agents need to learn this coordination between visual image of actions and the doing of an action.",
                    "label": 0
                },
                {
                    "sent": "And so this is again a kind of search problem actually, because.",
                    "label": 0
                },
                {
                    "sent": "When I ask you well, when you say raise your left arm and then you do something to show me what it means to raise your left arm.",
                    "label": 0
                },
                {
                    "sent": "I don't know yet how I should raise my left arm, right?",
                    "label": 0
                },
                {
                    "sent": "So in order to build up the.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for doing that, we do various kinds of experiments in which robot is allowed to explore his own body.",
                    "label": 0
                },
                {
                    "sent": "And so I'll just show you some.",
                    "label": 0
                },
                {
                    "sent": "Some examples of that.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is.",
                    "label": 0
                },
                {
                    "sent": "An example in looking actually at your own hands.",
                    "label": 0
                },
                {
                    "sent": "And in the top corner you see the visual image that robot is getting when it's moving its hand and that the right side is a kind of self model that the robot can use too.",
                    "label": 0
                },
                {
                    "sent": "To actually predict what is going to happen when it is doing a particular kind of movement.",
                    "label": 0
                },
                {
                    "sent": "So in this way it can learn a relationship between visual image and motor control and the internal self model that the robot has about its own movements.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Here is another example.",
                    "label": 0
                },
                {
                    "sent": "This is an example again with a mirror, because mirrors are quite a good way actually to see your own body and.",
                    "label": 0
                },
                {
                    "sent": "So in this case, the robot is doing a kind of motor.",
                    "label": 0
                },
                {
                    "sent": "Babbling is moving around its body parts.",
                    "label": 0
                },
                {
                    "sent": "And at the same time you see in the at the top there you see the visual image that the robot is getting and also the feature extraction algorithms and at the bottom there is the proprius reception.",
                    "label": 1
                },
                {
                    "sent": "Now at the same time.",
                    "label": 0
                },
                {
                    "sent": "On the left side there are the commands that the motor our robot is sweeping to the Motors and on the right hand side the body model again.",
                    "label": 0
                },
                {
                    "sent": "So using these kinds of relations between you know these different ways of.",
                    "label": 0
                },
                {
                    "sent": "Of using your body, the visual proprioception motor control actual movement simulation of movement, the robot can learn the landscape of its own movements and also can start to begin to re late when it sees somebody else doing a particular movement in visual space.",
                    "label": 0
                },
                {
                    "sent": "How that is corresponding with its own movements.",
                    "label": 0
                },
                {
                    "sent": "Oops, sorry.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "This is an example.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actually of the motor babbling when that is going on and then we use standard techniques like a clustering in this space in order to discover which dimensions are important for distinguishing between different bodily positions.",
                    "label": 0
                },
                {
                    "sent": "For example between standing and sitting and lying, and so giving us various kinds of features.",
                    "label": 0
                },
                {
                    "sent": "Now interesting experiment also is to once this kind of body language has evolved, is to accept it to another domain.",
                    "label": 0
                },
                {
                    "sent": "In this case spatial position and so once there are features for like standing.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or sitting know that in this case the the robots are playing a game about.",
                    "label": 0
                },
                {
                    "sent": "Objects in their environment, and because these objects the same features can be applied to the body as can be applied to these particular objects, they can actually use the features, the categories, but then also the words that they have developed to talk about body positions.",
                    "label": 0
                },
                {
                    "sent": "They can use them for talking about like whether an object is standing or sitting or lying.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So this was a second example an I will conclude with.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The final example.",
                    "label": 0
                },
                {
                    "sent": "This is for space.",
                    "label": 0
                },
                {
                    "sent": "And here again we are.",
                    "label": 0
                },
                {
                    "sent": "We are playing language K.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Games.",
                    "label": 0
                },
                {
                    "sent": "About space, and maybe I'll just show one example of this.",
                    "label": 0
                },
                {
                    "sent": "Let me show the.",
                    "label": 0
                },
                {
                    "sent": "The vision system.",
                    "label": 0
                },
                {
                    "sent": "At the same time, so this is again with two robots.",
                    "label": 0
                },
                {
                    "sent": "You know this space contains a set of objects which also have these bar code like.",
                    "label": 0
                },
                {
                    "sent": "Structures you see on the walls and so one row, but this approaching the object and you see in the left hand corner how it's tracking this object.",
                    "label": 0
                },
                {
                    "sent": "Then beginning to look around it sees the box it sees the wall it sees this other object, and the other robot is also now looking around in this particular environment, trying to see where the different objects are so that they can play a language came about this and now the language came in this case.",
                    "label": 0
                },
                {
                    "sent": "Is about the position of objects in this environment.",
                    "label": 0
                },
                {
                    "sent": "So if they want to talk about.",
                    "label": 0
                },
                {
                    "sent": "This one, for example.",
                    "label": 0
                },
                {
                    "sent": "You know then this is a self evolved language.",
                    "label": 0
                },
                {
                    "sent": "This is not an existing human language, but you know there's a phrase saying something like the yellow block closest to the box or something like that.",
                    "label": 1
                },
                {
                    "sent": "OK, I think.",
                    "label": 0
                },
                {
                    "sent": "Let me go to.",
                    "label": 0
                },
                {
                    "sent": "Yeah, let me say a few things about this particular experiment because it uses more sophisticated meaning.",
                    "label": 0
                },
                {
                    "sent": "It also uses more sophisticated representations of grammar and emergence of grammar and basically for the.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Presentation of meaning in these more sophisticated experiments we use actually constrained based way for representing the semantics of what is being talked about.",
                    "label": 0
                },
                {
                    "sent": "So the robots have at their disposal kind of inventory of components that they can use to operate over the visual data that are coming in and over the categorizations of reality.",
                    "label": 0
                },
                {
                    "sent": "So one of them, for example, is perspective reversal.",
                    "label": 0
                },
                {
                    "sent": "And so if these are the two, the scene seen by one robot, this is the situation as seen by another robot.",
                    "label": 0
                },
                {
                    "sent": "I mean, you see those two robots happen to be across each other in this particular case.",
                    "label": 0
                },
                {
                    "sent": "So if one would say left, you know this would be right for the other robot, right?",
                    "label": 0
                },
                {
                    "sent": "So you cannot if you talk about space, you need to take perspective into account, and so one of these semantic building blocks, if you wish, is to change the perspective, so to say.",
                    "label": 0
                },
                {
                    "sent": "Now let's see the world I'm the speaker, but I'm going to perform a geometric transform so that I can see the world from the perspective of the here.",
                    "label": 0
                },
                {
                    "sent": "OK, or from the perspective of another object in the scene, another semantic building block is this one, which is that if you have.",
                    "label": 0
                },
                {
                    "sent": "Kind of vectors that emanate from the body like this line or this line.",
                    "label": 0
                },
                {
                    "sent": "Then you can categorize again so in terms of left in terms of front in terms of right in terms of back.",
                    "label": 0
                },
                {
                    "sent": "So this is another semantic component that can be used by the agents to configure actually constrained program.",
                    "label": 0
                },
                {
                    "sent": "Actually that will allow them to hear it would execute this particular program that they would find back the object that the.",
                    "label": 0
                },
                {
                    "sent": "Speaker wants to refer to.",
                    "label": 0
                },
                {
                    "sent": "So for a simple phrase like the block to your right.",
                    "label": 0
                },
                {
                    "sent": "OK, various components need to be brought together, so one of them is to get the objects in the context to filter them to find back the ones that are blocks.",
                    "label": 0
                },
                {
                    "sent": "To do this geometric transformation.",
                    "label": 0
                },
                {
                    "sent": "So because you're saying to your right, so it means from the perspective of the here to do this filtering with an angular.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Category like left or rights and then to select the object from the set that is remaining.",
                    "label": 0
                },
                {
                    "sent": "This is going to be a unique set so you can simply pull it out.",
                    "label": 0
                },
                {
                    "sent": "So in our experiments we give these agents an inventory of building blocks and they use.",
                    "label": 0
                },
                {
                    "sent": "I know a search process to combine these blocks and to see which one would be effective to refer to the object that they want to refer to.",
                    "label": 0
                },
                {
                    "sent": "And then of course this needs to be expressed in a particular with words and with grammatical structures, and I don't have much time.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To talk about all this, but we're using a redeveloped, a new grammar formalism called Fluid Construction grammar that actually allows you to deal with these fluidity.",
                    "label": 0
                },
                {
                    "sent": "With this adaptivity of human leg.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Average, so let me conclude here.",
                    "label": 0
                },
                {
                    "sent": "I mean, we have been trying to figure out how could we get open ended grounded language on autonomous robots.",
                    "label": 1
                },
                {
                    "sent": "And by open end it's you know it's not just that the lexicon and the grammar, they have to kind of emerge.",
                    "label": 0
                },
                {
                    "sent": "Let's say in the interaction of the agents, but also the meanings that are being expressed.",
                    "label": 1
                },
                {
                    "sent": "The way they cut up real AT in terms of colors in terms of temporal relations or spatial relations or bottali actions.",
                    "label": 0
                },
                {
                    "sent": "You know they all have to kind of evolve together in coevolution with the way that the language system itself is evolving.",
                    "label": 0
                },
                {
                    "sent": "And so the big inspiration for us has been evolutionary biology because they give ways to think about adaptation, ways to think about, increase of complexity.",
                    "label": 0
                },
                {
                    "sent": "And so I sort of showed you a little bit how we are doing that.",
                    "label": 0
                },
                {
                    "sent": "You know, we look at very concrete phenomena like color or body language.",
                    "label": 1
                },
                {
                    "sent": "Then we try to understand what kind of selection is dynamics we have to set up in order to get a system that produces after a certain number of interactions in a population of agents that produces the kind of phenomena that we're interested in.",
                    "label": 0
                },
                {
                    "sent": "And the final thing is that I believe we are, you know, just at the beginning of this kind of work.",
                    "label": 0
                },
                {
                    "sent": "I mean, we've been doing in our lab various kinds of case studies, some I've shown here, but in my view we need to look at, you know aspect or 10s or determiners or all these kinds of different phenomena in language from this particular perspective, always deconstructing them, trying to understand the strategies for learning, trying to understand the invention strategies, and this dynamics that will.",
                    "label": 0
                },
                {
                    "sent": "You know, cause the system to converge towards a particular.",
                    "label": 0
                },
                {
                    "sent": "Coherent set OK.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So thank you very much.",
                    "label": 0
                },
                {
                    "sent": "OK, we've got 10.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Minutes for questions.",
                    "label": 0
                },
                {
                    "sent": "So raise it, raise your hands.",
                    "label": 0
                },
                {
                    "sent": "Pull up messages.",
                    "label": 0
                },
                {
                    "sent": "College is open for the elements.",
                    "label": 0
                },
                {
                    "sent": "Sorry you mentioned this evolution of the ontology in the communication between the Robert.",
                    "label": 0
                },
                {
                    "sent": "So can you describe what kind of elements were in ontology and how they evolved basically and relationships between this and so.",
                    "label": 0
                },
                {
                    "sent": "So what was evolution of this knowledge through the time?",
                    "label": 0
                },
                {
                    "sent": "You mean 40 ontologies, right?",
                    "label": 0
                },
                {
                    "sent": "Ontology?",
                    "label": 0
                },
                {
                    "sent": "Yeah, well.",
                    "label": 0
                },
                {
                    "sent": "An example of an ontology is the one for color.",
                    "label": 0
                },
                {
                    "sent": "The different color categories and of course not just the color candy but how they are grounded in reality.",
                    "label": 0
                },
                {
                    "sent": "So there's a set of 1 approach is to use prototypes, but it's not the only approach for sure, you know, But then you see how the boundaries of these categories are kind of shifting as the agents are continuing to play games.",
                    "label": 0
                },
                {
                    "sent": "So this is what I mean by evolution of ontologies or.",
                    "label": 0
                },
                {
                    "sent": "Adaptation of ontologies.",
                    "label": 0
                },
                {
                    "sent": "Yeah in this example, but I mean if you look at the space you know then the ontologies are for example radial categories.",
                    "label": 0
                },
                {
                    "sent": "So here they are like near and far.",
                    "label": 0
                },
                {
                    "sent": "Or if you're looking at angular categories and left front right back, so it depends on the domain.",
                    "label": 0
                },
                {
                    "sent": "It depends on the, let's say, the strategy being used.",
                    "label": 0
                },
                {
                    "sent": "What kind of ontology you have?",
                    "label": 0
                },
                {
                    "sent": "There's not a single type.",
                    "label": 0
                },
                {
                    "sent": "Hi, I know that some of the people in your lab have worked on intelligent, autonomous, intelligent, adaptive curiosity and which provides intrinsic motivation for an individual to learn things.",
                    "label": 0
                },
                {
                    "sent": "But is there something that corresponds to that for the language games?",
                    "label": 1
                },
                {
                    "sent": "So where would the motivation come from for an individual to receive or reward?",
                    "label": 0
                },
                {
                    "sent": "From playing the language game.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you for this question.",
                    "label": 0
                },
                {
                    "sent": "So indeed, of course a language came first of all is embedded in concrete situation, right?",
                    "label": 0
                },
                {
                    "sent": "So you're not talking about colleges for the fun of talking about colors.",
                    "label": 0
                },
                {
                    "sent": "You talk about colors because you want something and you use color as a vehicle for getting what you want.",
                    "label": 0
                },
                {
                    "sent": "So the objective you know the reward if you wish is always outsides.",
                    "label": 0
                },
                {
                    "sent": "Of the game, whether your communication has succeeded.",
                    "label": 0
                },
                {
                    "sent": "So this is one thing, but.",
                    "label": 0
                },
                {
                    "sent": "There is indeed a big question is about complexity.",
                    "label": 0
                },
                {
                    "sent": "Why would language be so complicated?",
                    "label": 0
                },
                {
                    "sent": "You know why?",
                    "label": 0
                },
                {
                    "sent": "What is the motivating factor?",
                    "label": 0
                },
                {
                    "sent": "And then of course it's partly to increase expressive power because you need it in order to have communicated success.",
                    "label": 0
                },
                {
                    "sent": "But it's also this intrinsic.",
                    "label": 0
                },
                {
                    "sent": "You know, motivation.",
                    "label": 0
                },
                {
                    "sent": "That says OK if we try to play this game, and if we're all kind of at a certain level in playing the game, then we reach we increase the challenge for us.",
                    "label": 0
                },
                {
                    "sent": "So in one of the experiments we've done, every agent is keeping track of challenges and how far it is in reaching those challenges.",
                    "label": 0
                },
                {
                    "sent": "And so if the challenges are too high, it's going to decrease.",
                    "label": 0
                },
                {
                    "sent": "It's the challenges that it poses to itself in the game.",
                    "label": 0
                },
                {
                    "sent": "If they're too low, is going to increase it, and if you have this kind of thing then you get a coordination of challenges and you see that the population is gradually moving up.",
                    "label": 0
                },
                {
                    "sent": "I mean, there's a particular paper that IEEE a live two years ago, which I will send you on this.",
                    "label": 0
                },
                {
                    "sent": "OK, my question has to do with the progression of concepts in your agents.",
                    "label": 0
                },
                {
                    "sent": "Cognitively, color comes very late to too human babies around the age of two years, plus two years, six months, whereas some of the spatial concepts like proximity come at the age of one or two months.",
                    "label": 0
                },
                {
                    "sent": "And So what I'm trying to say is that ultimately, in the ontology that is formed by the agent, these sequencing of concepts have a considerable role and one of the very important things is.",
                    "label": 0
                },
                {
                    "sent": "Actions which you have appointed to a little bit in the robot models actions also encode what arguments they take, and they have a lot of role in language.",
                    "label": 0
                },
                {
                    "sent": "I was wondering if you were looking at these issues, particularly with respect to actions that model verbs that model the head of sentences and things like that.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure I understand your question.",
                    "label": 0
                },
                {
                    "sent": "I'm just asking if you are modeling actions and mapping them into verbs in language and also argument structures, that kind of thing.",
                    "label": 0
                },
                {
                    "sent": "Yeah, well in the Action Action language games, you know this is a verb oriented.",
                    "label": 0
                },
                {
                    "sent": "You could say now the distinction between nouns and verbs or nouns and adjectives or adjectives and adverbs.",
                    "label": 0
                },
                {
                    "sent": "And all these things is again something that.",
                    "label": 0
                },
                {
                    "sent": "Has to emerge out of the interactions between the agents.",
                    "label": 0
                },
                {
                    "sent": "We don't put in any syntactic categories.",
                    "label": 0
                },
                {
                    "sent": "Our priority.",
                    "label": 0
                },
                {
                    "sent": "You know the question is.",
                    "label": 0
                },
                {
                    "sent": "I mean there are languages which don't make a distinction between adjectives and nouns, for example, or we don't have articles or or prepositions.",
                    "label": 0
                },
                {
                    "sent": "And all of this so.",
                    "label": 0
                },
                {
                    "sent": "But indeed, in an action game, actual language are kind of verb oriented.",
                    "label": 0
                },
                {
                    "sent": "You know way because one asks the other one to do something or one describes to the other one away too, in which a particular situation unfolds, like one robot is standing up or sitting down or something like this.",
                    "label": 0
                },
                {
                    "sent": "Do you have any comment on you know how your your techniques and methodology here could be used for explaining how one might go about teaching language?",
                    "label": 0
                },
                {
                    "sent": "I mean, in your examples you're obviously providing some feedback and and so on, but in terms of actively and effectively teaching language, yeah, this is a good point indeed.",
                    "label": 0
                },
                {
                    "sent": "I think one of the application areas.",
                    "label": 0
                },
                {
                    "sent": "May not necessarily be.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "In robotics, I mean there are not that many humanoid robots walking around at the moment, but is indeed in teaching and particularly for example, second language teaching.",
                    "label": 0
                },
                {
                    "sent": "Because if you can deconstruct the particular way that in one language is dealing with one part of the problem of language, for example, articles.",
                    "label": 0
                },
                {
                    "sent": "OK, now this is what the speaker of that language.",
                    "label": 0
                },
                {
                    "sent": "Already has, then you can kind of understand also the target language, the second language to be learned.",
                    "label": 0
                },
                {
                    "sent": "And it's not just a matter of learning the words, it's a matter of acquiring the strategy for learning the words N for reusing them in novel situations and for stretching them and all those kind of things.",
                    "label": 0
                },
                {
                    "sent": "So yeah, I think this is a very important possible application.",
                    "label": 0
                },
                {
                    "sent": "We have a lot 1 last question.",
                    "label": 0
                },
                {
                    "sent": "This is an extension of the question on action, so in this sort of historical work of Sirlin, Sterling, Austin, etc.",
                    "label": 0
                },
                {
                    "sent": "Use the word language games, but you didn't really talk about language games, so could you speak a little bit about your intentions for you?",
                    "label": 0
                },
                {
                    "sent": "No pun intended to look at at agent recognition, discussion of motivations, etc.",
                    "label": 0
                },
                {
                    "sent": "Sort of related to this previous question and how you believe your work relates specifically to that tradition.",
                    "label": 0
                },
                {
                    "sent": "Yeah, at the moment the redesign, the language game.",
                    "label": 0
                },
                {
                    "sent": "And so the agents are giving scripts to play the game.",
                    "label": 0
                },
                {
                    "sent": "OK, it's not that they invent new language games on their own, or things like that.",
                    "label": 0
                },
                {
                    "sent": "Of course, we can invent a language game or experiment with a language game, where for one type of speech act you know for another kind of speech, act like a command or a description game where they describe to each other and the game is a success.",
                    "label": 0
                },
                {
                    "sent": "If the here agrees, that is a description of the scene that sees before them, there are the guessing games where they draw attention to each other in the world so.",
                    "label": 0
                },
                {
                    "sent": "No, but all these things like intentions and goals and I mean they are there.",
                    "label": 0
                },
                {
                    "sent": "But I would say this is not the target of what we're trying to do, because in the language games are implicitly there like joint attention also or the way that feedback is being given.",
                    "label": 0
                },
                {
                    "sent": "All of these things are important, but we at the moment we set it all up that way, and so this is part of the art of this research is to come up with a good game.",
                    "label": 0
                },
                {
                    "sent": "On implementable, doable, so that you see the phenomenon arise that we would like to see arise.",
                    "label": 0
                },
                {
                    "sent": "OK, let's thank again the speaker.",
                    "label": 0
                }
            ]
        }
    }
}