{
    "id": "7vvwhapil7v6bx2g5kj4vmu2jyxzd2pw",
    "title": "Visualisation of Cost Landscapes in Combinatorial Optimisation Problems",
    "info": {
        "author": [
            "Adam Prügel-Bennett, University of Southampton"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "November 2005",
        "category": [
            "Top->Computer Science->Data Visualisation"
        ]
    },
    "url": "http://videolectures.net/cov05_bennett_vclco/",
    "segmentation": [
        [
            "To me, here is a great pleasure for two reasons.",
            "One is, I've not been to this part of the world before, and it's always nice to go somewhere new and the other is.",
            "I think this is a workshop about something very important.",
            "Often overlooked.",
            "Subjects which is this visualization an I'm going to talk about something which I've been very interested in philosophy for many years, which is to do with combinatorial optimization.",
            "And so I'm talking about some work which I've been doing over the last couple of years of trying to understand, visualize cost landscapes.",
            "I'm a real academic, which means that I don't actually do much of this work myself.",
            "Most of this work was done by my."
        ],
        [
            "PhD students Jonathan Harlem and will Ben Folds.",
            "I have to thank them and many of the graphs and things you will see I will come from them."
        ],
        [
            "So my talk is going to be.",
            "I'm going to start by telling a little bit about optimization problems.",
            "I'm sure that most of you are familiar with that.",
            "Then I'm going to tell you about cost landscapes, which is a sort of step in the direction of trying to visualize these things.",
            "Which I guess has a very long history and I'm going to talk about barrier trees which have been around for about 15 years.",
            "Many people have worked on them, so this is an example of a barratry.",
            "I'm afraid it's not a very good picture, but will see lots of these pictures.",
            "And then I'll show you some examples of those.",
            "And then I'm going to finish off my work, which is.",
            "The stuff which I've been involved with and it's very simple idea which is actually 2.",
            "Associate a mapping from configuration spaces to this barrier tree, but actually allows you to do a lot more than you can when other people have previously done with Barrett Reason.",
            "In particular, you can do things like visualize optimization algorithms, and hopefully that can help us to understand what problems of optimization algorithms really are, and then something that comes out of that is to do with modeling problems."
        ],
        [
            "And there's a sort of subtext to my talk, which is whenever you have a complex object you're trying to understand, there's several different."
        ],
        [
            "Ways of trying to get to grips with that so very often you start by drawing informal pictures which you kind of think represents your objects.",
            "He obviously you sometimes try to visualize your objects.",
            "You look at different aspects of your objects in sort of more formal way by visualization, and you do mathematical analysis and there's a way in which."
        ],
        [
            "They're all linked when you do research is that often your informal pictures drive you to do some kind of visualization which drives you to do some mathematical analysis, which then motivates you to think of knew.",
            "Ways of understanding which?",
            "Drives the process of.",
            "Forming you pictures and things will see that this sort of.",
            "Interaction between these sorts of different views happens a lot in this talk, and I guess that's something which will occur quite a lot throughout this workshop."
        ],
        [
            "OK, so the very simple view of a combinatorial optimization, which I call the set view, is that you have a search space which is a set.",
            "I'm interested in this talk in combinatorial optimization problems where this set is just a finite countable set.",
            "I.",
            "So you have the search space and then you have a cost function and that Maps each configuration or each point in this space to.",
            "It gives a real number associated with each point and then the thing you want to do is find the optimal point.",
            "And.",
            "In this talk, I'm going to be talking about minimization of the stack and also talk about maximization equally easily, but I'll talk about minimization.",
            "Actually, in most problems your.",
            "Satisfied not with finding the optimum, but we're finding some X which is better than most of the other axis.",
            "And in this talk I'm going to concentrate on problems which.",
            "But physicists, I'm.",
            "Once Upon a time I was a physicist, so I called this the general problems.",
            "These are problems where.",
            "The set of costs as much smaller than your search space and most points in your search based map onto a similar costs or many points in the search space Maps onto a single cost.",
            "Anne.",
            "OK."
        ],
        [
            "So let's look at real optimization problems.",
            "If you call these real optimization problems, these are problems that have been very well studied.",
            "So one of the most well studied problems is matczak.",
            "Which is a variation of the SAT problem.",
            "So what you have is you have N Boolean variables.",
            "And then you have a set of disjunctive clauses.",
            "Also, I've realized I've made this capital in this small.",
            "Sorry about that so.",
            "The clauses are satisfied if any of these are closed.",
            "If any of these truths.",
            "If X one is true, or if X2 is false, or is X freeze true, then this clause is.",
            "True.",
            "And the optimization problem is to find an assignment of these axes.",
            "To satisfy the majority of these clauses right and the SAT problem is where you try to satisfy all of 'em Max.",
            "That is where you try to satisfy as many of these as possible.",
            "To turn this into a minimization problem.",
            "I'm actually doing Min unsatisfied unsat I'm trying to minimize number of unsatisfied clauses.",
            "Anne."
        ],
        [
            "So where do Max at problems arise from Verizon actually in things like digital circuits?",
            "In many planning problems, you can reduce those kinds of problems to Max out problems.",
            "But one of the results, which is well known from theoretical computer science, is that.",
            "Any problem you give to nondeterministic Turing machine can be reduced to the SAT problem.",
            "So nondeterministic Turing machine is a sort of magic computer.",
            "But guess is the answer.",
            "And Coke in 1971 showed that you can reduce a.",
            "Non deterministic Turing machine into a SAT problem.",
            "So this is a sort of theoretical interest, but you can actually use this.",
            "So I recently had an undergraduate student.",
            "Of mine who had to I had for a month and I got him to do factorization of 2 numbers and he did factorization by writing a nondeterministic Turing machine.",
            "That check whether 2 numbers were indeed factor correctly or factor correctly and.",
            "Then he turned back Turing machine into the SAT problem and he said it on the SAT solver so.",
            "Sat problems amaxac problems are.",
            "I saw the generic problem that you can solve anything with."
        ],
        [
            "A lot of you because you are involved with the Pasco Network will be.",
            "I.",
            "Use the machine learning examples.",
            "Here's an example from machine learning, so the perception is assault class is perhaps the classic machine learning device that performs binary classification.",
            "Given a data set with a set of N dimensional inputs and a class label, what the perception does is you try to find away vector which aligns with all the patterns.",
            "Which have a positive class label and is anti aligned with over patterns with have a negative class label."
        ],
        [
            "So if these are your positive class labels and visa, your negative class labels, then you're trying to find a dividing plane and your weight vector is just.",
            "Vector which is orthogonal to that dividing plane or hyperplane in high dimensions."
        ],
        [
            "I.",
            "The perception problem is a continuous optimization problem, but if you actually consider a very constrained perception where we only live weights to be minus one or plus one, we get what's sometimes called either binary perceptron organizing perceptron and this is known to be an NP hard problem.",
            "Actually trying to find the weights to solve our rights and be hard for those of you who aren't computer scientists just means that there aren't actually.",
            "Efficient algorithms for finding good solutions for this, and in fact this is a very hard problem.",
            "It's not a problem.",
            "And then no good algorithms are actually solving this problem particular efficiently.",
            "So in both my examples of this Ising perception of the Max app, they have a lot of structure that's not part of this sect view of.",
            "Of an optimization problem, and so the.",
            "Issue in trying to tackle these problems is can we try to get a better understanding of his optimization problems?",
            "What is it that?",
            "Makes these kinds of optimal optimizations.",
            "Are problems hard to solve?",
            "And can we kind of draw out something about them and these are very different.",
            "You know Max at Ising perceptron, but there's an awful lot of these problems I could have done.",
            "Graph coloring all sorts of problems, and is there a sort of unifying framework?",
            "But we can understand these problems with."
        ],
        [
            "And this brings me on to the next part of the talk, which is the cost landscape.",
            "In cost landscape what we do is we."
        ],
        [
            "Impose some topology on the search space and the easiest way of doing that is just to define a neighborhood function, or at least that's if you have a.",
            "A discrete space.",
            "Say in the continuous space you would usually have continuity, which would give you an automatic topology.",
            "In discrete space you don't really have that, but you can put the topology on by choosing.",
            "And neighborhood.",
            "Neighborhoods are very closely related to search algorithms, so if you have a search operator.",
            "Neighborhood.",
            "Is usually.",
            "A set of configurations, but you can move to from a particular configuration.",
            "And actually one of the key heuristics which.",
            "Underlies a huge number of search algorithms.",
            "Is right if you want to choose a neighborhood so that your cost of your neighbors is similar to your normal cost, so it's closer to the normal cost than a random configuration would be.",
            "So enormous number of search problems rely on this heuristic.",
            "So what neighborhoods for the problems that I've described?"
        ],
        [
            "So I've described problems which can be described in terms of a binary string.",
            "There there's a very natural neighborhood function which is known as a Hamming neighborhood.",
            "And that's why you just neighbors of configurations solutions that just differ at single part of the string.",
            "So this is for the.",
            "Max at problem.",
            "This is for the binary perceptron.",
            "And these both satisfy my criteria of.",
            "Trying to I have neighbors that have a similar cost, so in the Max out problem, if I change the single variable that's not going to affect so many clauses because that variable won't actually exist in many of my clauses, so it should not change very dramatically cost.",
            "Uh, but.",
            "The cost of the solution when I moved to one of these neighbors.",
            "And again in the binary perception, if I change a single wait here, I do a minimal shift in the in the separating plane.",
            "So that's the smallest change I can make from the separating plane."
        ],
        [
            "I.",
            "This hamming neighborhood.",
            "This is a hypercube topology on the search space, so this is.",
            "Rather easy to see if I'm at some point in the search space and I have N neighbors, so this is a 3 dimensional case, so each of these neighbors I get by changing one of these surface is the.",
            "Ising search space.",
            "When I changing one of the weights from plus one to minus one."
        ],
        [
            "So when you look at binary strings to having neighborhood is such an obvious neighborhood, it's difficult to think of other neighborhoods.",
            "Or you can think of other neighborhoods.",
            "You could look at next nearest neighbor neighborhoods and things, but they seem a little bit artificial, but many optimization problems.",
            "There are actually a large number of natural neighborhoods, and one particular example is the traveling salesman problem.",
            "So this is the.",
            "This is an example of a torrent of traveling salesman problem, and you ask, well what's the neighbor of that?",
            "And there's lots of different possible neighbors.",
            "This is a neighbor were actually choose.",
            "A couple of different.",
            "Links in this store and then I swap them around.",
            "And this is known as a two opt neighborhood, and this is actually the most commonly used neighborhood in in.",
            "That ESP so in TSB these would be considered neighbors.",
            "Those two would be considered our neighbors and TSP.",
            "But in test P, you can actually think of a huge number of different kinds of neighbors, so there's free OP says.",
            "Very many different ways of representing your problems so that when you do a change in in the.",
            "In your representation, it creates a small change in the tours that they're doing."
        ],
        [
            "OK, so that was the neighborhood function.",
            "I've had the cost function and then the idea of this cost landscape is that if you have a cost function in the neighborhood, you get a landscape and.",
            "Suddenly this was an idea that was used a lot in evolutionary biology back in 1930s, right?",
            "Did a lot of.",
            "Drawing pictures.",
            "Using fitness landscapes and we think of the landscape.",
            "This is sort of vertical height of the landscape represents the cost and then the.",
            "We can then move around that landscape because real landscapes."
        ],
        [
            "Don't look like that in discrete optimization problems they look like this.",
            "So that we have a sort of hypercube geometry and at each point of hypercube service corresponds to configuration and that will have some fitness associated with it.",
            "One of the issues we have is that this is not an easy thing to visualize.",
            "Now it's easy to visualize in three dimensions, but when I'm in 100 dimensions I can no longer draw.",
            "100 dimensional hypercube.",
            "So one of the sort of big challenges in this area is to try and get your head around what the sort of landscape is.",
            "When you have these kinds of discrete optimization problems."
        ],
        [
            "I.",
            "Well, I can draw some informal pictures to try and get an understanding of how the cost landscape might appear for noising perceptron.",
            "Send actually normal perceptron, what every time I introduce a.",
            "New pattern what I do is I introduce some separating plane.",
            "So if I'm on this side of the separating plane I'm have.",
            "I satisfy this pattern and if I'm on the other side, I don't satisfy this pattern.",
            "If I have."
        ],
        [
            "Many of these patterns and what I do is I have.",
            "Many dividing planes and what I want to be on this I have to be on the right side of each of these dividing planes.",
            "And so this is a so the seer is my search space for my normal perceptron and the.",
            "Hypercube.",
            "Is this search based for the Ising perceptron and there's sort of I don't have too many patterns.",
            "There's some region where I have everything correctly classified."
        ],
        [
            "One of the features that has become quite hot topic over the last 10 years in optimization is an understanding of phase transitions in optimization problems.",
            "And there what you find is, as you increase.",
            "So this is for the item perception.",
            "As we increase the number, the ratio of patterns to the sizes of my input space.",
            "I moved from a case where I can classify.",
            "I can I can correctly classify?",
            "My inputs to a region where I can no longer correctly classify my inputs.",
            "As the same time life, there seems to be a phase transition, so this is the sort of exciting new work that people have been trying to understand the last 10 years.",
            "There's a transition from a phase where the problem is easy to face, where the problem is hard and back transition point seems to be close to where you become unsatisfiable.",
            "Physicists believe it is actually happened slightly before then, some people.",
            "But this can't be the case.",
            "Typical head just means exceptions to this.",
            "If I'm in this region, I might have an unsatisfiable problem, but the probability of having an unsatisfiable problem becomes exponentially rare as I increase the size of my.",
            "Patterns."
        ],
        [
            "So here's one of my informal pictures where what I've done is I've taken my.",
            "For my fear of solutions on which in that sphere I have embedded a hypersphere and I've unwrapped it.",
            "And I've drawn it here so each of these dots corresponds to a solution to binary perception.",
            "And then each of these lines corresponds to.",
            "A dividing plane caused by patterns, so I have to be on the right side of all of these lines and then provided I don't have too many patterns, then there's some region in this space where I have some satisfied solutions.",
            "If I add some more patterns about space, when I start to cut into this regions where there satisfies solutions.",
            "I."
        ],
        [
            "And then I get to.",
            "I reach a point when suddenly what happens is that I still have some satisfied solutions, but these satisfied solutions are now actually disconnected with each other.",
            "Alright, so this was just adding some more patterns into this.",
            "And my solution space becomes disconnected.",
            "Ann is this disconnect edition of my solution space which then makes problems hard as I add more patterns and actually the solution space disappears altogether.",
            "Are there still parts of this where I have some lowest costs?"
        ],
        [
            "So physicists have studied this for some time, probably 2030 years now.",
            "And they see this transition related to something called replica symmetry breaking.",
            "So the problems become hard because solutions become disconnected.",
            "The solutions can be a long way apart as so it's not very obvious in my pictures, but."
        ],
        [
            "The solutions can actually be quite distant from each other because I can get sort of very long thin regions."
        ],
        [
            "A series solution space is kind of shattering into many local Optima, so this is a physicist often bringing analogy with shattering a piece of glass shattering is random.",
            "It depends on the patterns, so it's random if you think of the patterns as.",
            "Random variables.",
            "Has exponentially number of local minimas is like if you shatter a piece of glass, you get an awful lot of small pieces and the sizes in this piece of glass can differ quite a lot.",
            "Sorry, I pressed the wrong.",
            "Spartan.",
            "And it jumped ahead.",
            "Too many things.",
            "OK, so this is seen in calculations when you do calculations of these kinds of systems.",
            "This is seen as replica symmetry breaking.",
            "I'm not going to actually talk much about this."
        ],
        [
            "But the sort of picture of I want to.",
            "Draw is that you have a phase, an easy phase where are basically all you have to do is go downhill and you're going to get to the solution.",
            "So here these are high cost solutions and this is my load cost solution and I can start anywhere and provided I kind of go downhill.",
            "I get to.",
            "A to the global solution."
        ],
        [
            "And then as I increase.",
            "We are the number of patterns or increase use so a lot of these optimization problems.",
            "They have some parameter which you can tweak which makes the problem harder.",
            "So in the Mac sat problem, that's the number of clauses you tweak.",
            "You can increase the number of clauses and when you get this dividing up of this search base.",
            "And then you can no longer guarantee to get a good solution if you go.",
            "If you start here and you just go downhill, you can end up on the solution which is no longer is just a local solution.",
            "It's no longer a global solution."
        ],
        [
            "OK, so that's a pretty picture question is, is this an accurate picture?",
            "Well, I'm talking about discrete problems in high dimensions these are.",
            "Pictures that are drawn in two dimensions and there's continuity here and so obviously that's an approximation.",
            "I'd not very good at drawing a very large number of local minimums, because these pictures quickly become incomprehensible.",
            "Also, this phase transition from easy to hard is actually much more subtle, and we'll talk about that a little bit later.",
            "When we look at some why discuss some other peoples work on some cover number partitioning problem."
        ],
        [
            "OK, so very well, very informal pictures that gave us a sort of idea of what may be happening.",
            "Can we try and get a more rigorous visualization of what's going on in?",
            "This brings us all onto barrier trees.",
            "So these have been well studied, as I say, for about 10 or."
        ],
        [
            "In years.",
            "And they basically help us to build some kind of a picture of a search base, and the idea is that the leaves of these trees are local minimas.",
            "And the merging vertices correspond to lowest cost saddle points or the barriers and the height of the vertices indicates fitness, so here's a sort of."
        ],
        [
            "Picture again, this is not a real picture because this is an artificial problem I just drew by hand, but here's my costs.",
            "Again, dark means high cost and like.",
            "Light means low costs and I'm going I'm minimizing.",
            "I what I can do is I can represent this landscape by tree structure like this so that from this region a I can get to be or I can get to see, but I can't get from B to C without going to a higher cost.",
            "Then the region B is separated into two regions.",
            "D&D&D is separated into Region H and one of the things about by a trees is that this region D doesn't actually have to be connected, provided I can get from here to here.",
            "Going through low-cost, I consider this to be one point, otherwise I don't have a barrier tree.",
            "I have something called the merging graph.",
            "It turns out for to buy a.",
            "Trees are often more useful ways of.",
            "Visualizing landscapes.",
            "But while the star shows it does show the sort of bias involved, so if I might.",
            "And I want to go to the global solution I actually have and I'm testing neighborhood search.",
            "I have to go.",
            "Up so high costs to see than a vent to be vented even to age.",
            "Anne.",
            "OK, so this pretty graph assumed that I had continuity.",
            "Once again, I've done my silly finger pressing wrong button.",
            "This has assuming continuity and."
        ],
        [
            "So I don't have continuity.",
            "I have to replace that if I have a discrete space I have to replace the idea of continuity and I do that by having a path.",
            "So my path is just a sequence of configurations, all of who are neighbors of each other.",
            "And then one technical thing which I'm going to assume throughout this talk is that my neighborhoods are always symmetric, so that is very often the case, but it wouldn't necessarily have to be the case, but I'm going to assume."
        ],
        [
            "Ban just in case there's mathematicians in the audience who's going to pull me up on that.",
            "So.",
            "The key concept in actually building barrier trees for discrete systems, or one thing is the idea of level connectedness.",
            "So in level connectedness this is.",
            "A relation where.",
            "Two points in my spacer level connected if as a path where is point on this path has the same fitness, so that's the idea level connected.",
            "So what I can do is I can take my search space and I can divide it into level connected sets.",
            "Unfortunately, left."
        ],
        [
            "Connectedness has one problem, which is that you often get a very large number of level connected sets to try and understand that.",
            "Here's a sort of toy problem that has been very well studied because it's so simple it's the one Max problem.",
            "It goes by various names, one counting one Max and basically the fitness is the number of ones, so you want to over cost is.",
            "I guess the number of zeros you want to reduce the number of zeros.",
            "And.",
            "One of the things is that every point is actually level connected set.",
            "If you have a Hamming neighborhood, and that's because if you have any binary string and you change a binary string, either 1 to 0 zero to one you changed the cost, and because you're changing the cost, that means that all your neighbors have a different cost to you so.",
            "Few level connected sets or consists of 1 member, so that's not a very good way of.",
            "Representing points, so this is an extreme problem, but even in real things like Mac Sackett, it's at.",
            "If you look at level connected sets, you get an awful lot of level 'cause connected sets, so people tend."
        ],
        [
            "Look at.",
            "Level Accessibility, so Accessibility is a little bit like connectedness, except you say that X&Y are accessible.",
            "Provide that there's a path between X&Y such that you never go.",
            "All the configurations on that path have low cost than your starting configuration.",
            "So that's the idea of Accessibility, and then we have a.",
            "Are never equivalence relation, which is level Accessibility, so which is just saying that these.",
            "Points level Iaccessible, provided they have the same fitness and they're accessible from each other, so that is actually different from global connectedness, as we will see in the next transparency level.",
            "Accessibilities 'cause it's an equivalence relation that defines a partitioning into level iaccessible sets these level iaccessible sets are key to drawing.",
            "Your barrier trees.",
            "I actually won Max.",
            "It turns out that the number of level iaccessible sets is N + 1 and the every fitness level is just a level accessible set."
        ],
        [
            "So this is the same example I had before and now this point here, which previously wasn't part of the level connected set, is part of the level accessible set because starting.",
            "From any of these configurations I can get to this for a number of different routes.",
            "As it turns out, without going through a cost level that is higher from my starting level, OK, this is not part of the level accessible set.",
            "Obviously 'cause it's a different cost."
        ],
        [
            "And finally, to get to borrow trees in this thing, I can define Accessibility between sets.",
            "Says to level Iaccessible sets are accessible, provided this configurations from this in this set that our our configurations in this set or accessible from configurations in this set.",
            "Actually, Accessibility defines partial ordering.",
            "Barratry is actually what's known is often called the diagram of the partial ordering, so it's just a graph of the.",
            "Direct predecesor, so if I have a barrier tree like this.",
            "I look at configuration like this.",
            "This is the immediate predecessor, so this point is accessible from all of these points, so I can reach this point without going through a cost any.",
            "Any higher than any of these points?",
            "I can't do that from this point, 'cause I actually have to go to cost higher than my starting point.",
            "OK, but I don't have to show all these points because it turns out that this point is going to be accessible from all of these higher points.",
            "I just showed the direct predecesor and that gives me a barratry."
        ],
        [
            "Perhaps more importantly, the mathematical definition, I mean it's a clean mathematical definition, but the nice thing is that it's reasonably efficient to compute.",
            "It can be computed in terms size of the search space times the size of the neighborhood.",
            "Using a flooding algorithm, which is a little bit fiddly, but it's basically a straightforward algorithm.",
            "Some would argue that this is not a particularly nice thing, because it depends on the size of the search space, and I'm interested in big surf basis, so I'm only going to be able to look at rather small problems with Barry trees.",
            "Hope I can actually get away from this restriction a little bit by using a modified branstrom Bangor algorithm, which means that I can look at all the configurations.",
            "Act below a certain cost and I can do that reasonably efficiently so I can actually look at some reasonably big problems.",
            "I only get a picture of the lower part of the barratry, but turns out the high parts of a bio trees are usually trivial so I don't lose too much because of that.",
            "And the higher parts of the bio trees, if I'm interested in them, and I will be interested in them, I can estimate some of their properties just by using sampling, 'cause there are bits of search space that are actually very common."
        ],
        [
            "OK, so that was the sort of fairy let me show you some pictures."
        ],
        [
            "So this is a Max at problem, it just has.",
            "The search space just consists of 10 variables, so I've only got the whole search space is only 1024 different configurations?",
            "I've got 50.",
            "50 clauses in this case, and so this is the buyer tree.",
            "This is the global minima.",
            "But have one local minima.",
            "While I'm not showing you, is that there's a huge number of other costs which basically disc golf here and go very high.",
            "So most of my search space is up here, but this is the interesting part of the search space above.",
            "Here there are no local minimas, so also this is the first local minima.",
            "That exists, so this is the first local minima and this is a saddle points.",
            "In order to get from here to here, I actually enforce the girl pill and come down here.",
            "So I increased the number.",
            "The size of this problem, so this is."
        ],
        [
            "20 variable problems.",
            "My search space is now a million configurations.",
            "I get slightly more.",
            "Complicated by a trees.",
            "If I increase that."
        ],
        [
            "The 30 variable problems.",
            "So I have 10 to the nine search space size 8:50.",
            "Then I get slightly more complicated."
        ],
        [
            "Then take out 40 variable problems.",
            "I get a large number of these.",
            "Local minimas actually turns out these local minimums are very have quite a large number.",
            "They're actually very, very small.",
            "And then actually very often visit them."
        ],
        [
            "I.",
            "That was when I had a ratio of clauses to variables of five.",
            "This is when I have a ratio of clauses to variables of four.",
            "Thank."
        ],
        [
            "Priest this ratio closes variable."
        ],
        [
            "To 6 to 8 and to."
        ],
        [
            "10 This is going into the hard region, so this.",
            "Is where these problems become much harder.",
            "I get many more local minimas, and in this case there's probably many more local minimums I'm not seeing above here.",
            "My branch and bound I do sort of cut off at this level and above there is there's too many.",
            "Configurations to actually explore high parts of history.",
            "So whereas for simple problems this is, this will be the top of the tree for these bigger problems.",
            "There be many more local minimums above this level."
        ],
        [
            "So I talked a little bit about phase transitions so people have looked at this.",
            "Particularly, Stadler has done a lot of work with barrier trees.",
            "Have looked at looking for evidence for phase transitions and finally they found very little evidence in the shape of the tree.",
            "So despite this sort of nice picture I drew.",
            "Which physicists would believe in I believed in as a physicist, but you get the splitting of the search space.",
            "It turns out that there's little evidence into shape of the barratry.",
            "I mean, the battery only shows local minimums, and some of these local minimas may have very small.",
            "Numbers of configurations attached with them.",
            "The only evidence they did find for this phase transition is in something called the difficulty, which is the ratio of.",
            "Very, very height to the gap between.",
            "The.",
            "Um?",
            "A local minima and global minima, so the ratio of beta D. This was actually in the number of partitioning problem, which is one that doesn't really have a discrete space.",
            "It has kind of it's not.",
            "Sorry it's not very degenerate problem.",
            "So actually this gap can be very small.",
            "So actually the problems we're looking at this is probably not a good measure of difficulty, so I did have a student tried to look for seeing where they could find phase transitions.",
            "In the.",
            "Structure of these pirate trees, but he didn't get very far.",
            "Partly that was because we were moving on and doing other work, so there's still quite a lot of work to be done in that area."
        ],
        [
            "OK, so let me get on to the work which is.",
            "More original work.",
            "It's a very simple idea, the idea."
        ],
        [
            "Yes, I have my.",
            "Space of.",
            "Configure configurations, my search space and I have a barratry representation.",
            "I.",
            "And one thing which I can trivially do is I can actually record a mapping from any of these points onto a part of a by a tree.",
            "So each of these points are uniquely gets is identified with one of the nodes in this by a tree, and that's actually to do this mappings.",
            "I actually need to have these.",
            "General problems if I have a non degenerate problem then these mappings become slightly less defined.",
            "I mean you can do it, but it is less of this.",
            "I'm.",
            "So that's all I'm mean by the mappings is a very simple idea, but it actually allows me to do quite a lot more visualization."
        ],
        [
            "And also to look at statistics so.",
            "I cannot look at different statistics so I can look at things like the number of configurations in a state I can look at the stringiness of the local minima, so one of the questions is do.",
            "If I have a local minima or over configurations on the side of a hyper cube?",
            "Or are they sort of longfin effin structures that wind through the hypercube?",
            "The.",
            "Unfortunately answer is that they tend to be boring objects that seem to sort of lie on the surface of the hypercube.",
            "I can look at things like.",
            "Distance is the global solutions.",
            "I'm not going to show you a lot of data."
        ],
        [
            "This, but I'll show you an example, so this is.",
            "Barratry formats at problem with 40 variables.",
            "And then the sort of."
        ],
        [
            "Statistiques you can look at for this, as you can say how many configurations are there each cost level so it costs level 1213 fourteen.",
            "These are the number of configurations.",
            "These are the number of local minimas.",
            "This is the main basin size, so actually the basin sizes are very small.",
            "This usually back to two configurations.",
            "In some of these basin sizes, and some of these basins.",
            "Number of minima with depth greater than one rather small.",
            "The percentage of configurations in local minima so obviously over configurations on local minimums here.",
            "But up here actually a very small number percentage of my configurations are actually local minimas.",
            "Number of several points I have.",
            "Then I can run descent from this and I can say if I run to send, where do I end up?",
            "But what level turns out that?",
            "Even for this quite big problem, I half the time I end up in a local minima.",
            "Which is the global side I end up in the global minima?",
            "OK."
        ],
        [
            "But I can also do visualization 'cause I have a mapping.",
            "Every point in my search space I can map to somewhere in the barratry.",
            "So if I do something like simulated annealing, why start way up here?",
            "But basically this is big straight lines that's not very interesting.",
            "After 16 generations my.",
            "Search base gets down here.",
            "I then quickly jump down here.",
            "I jump up and down a few times.",
            "And then."
        ],
        [
            "I get a bit lower."
        ],
        [
            "And finally, I find the global solution."
        ],
        [
            "And I jump up and."
        ],
        [
            "Unfair."
        ],
        [
            "And actually, one of the things you notice is that you don't tend to get trapped in local minima's.",
            "So it turns out that for the size problems, doing descent is a very, very good algorithm for for these kinds of things so.",
            "There's still a lot of work to do on visualization and trying to find problems which are actually quite hard for these.",
            "Optimization algorithms."
        ],
        [
            "You can do the same with genetic algorithms and genetic algorithms, I haven't."
        ],
        [
            "Population, most of my populations up here and I'm not showing it, but."
        ],
        [
            "Eventually I get members of the population down here."
        ],
        [
            "And then later I sort of come down."
        ],
        [
            "And eventually I find a global.",
            "Minimize so."
        ],
        [
            "Let me OK, so that's."
        ],
        [
            "Visualization, which I think is a very useful tool, because it's actually very difficult to actually understand how these kinds of algorithms are searching this space and what the problems are.",
            "I mean, all your problems really that you're getting stuck 'cause it's just that you have to search huge space to actually go downhill.",
            "So I'm going to finish off very quickly talking about.",
            "Something that isn't really doing visualization, but it came out visualization nice to do with modeling problems."
        ],
        [
            "I.",
            "So, given a problem, we can actually model it by Malcolm Eighting configurations and barratry gives us a very natural way of doing that, because all the configurations, but we've mapped to state in the barrier tree.",
            "We can amalgamate into sort of single state.",
            "And then the initial occupancy of that state is obviously just a number of configurations in that state.",
            "The transition probabilities we can make proportional to the number of neighbors seems a very natural thing to do.",
            "It's actually an approximation that's very bad, and I'll talk a little bit by trap.",
            "And then the model has some structure.",
            "So the nice thing about these models is they have exactly the same structure of local minima.",
            "Some barriers as the true problem."
        ],
        [
            "So this is another silly picture I drew trying to explain what's happening.",
            "Face this, these are my configurations, but I took from the hypercube and I saw it separate from interstates.",
            "Depending on why they lined the barratry.",
            "These are all connected.",
            "These aren't connected.",
            "These are not accessible from one or the other because I have to go through higher costs configurations.",
            "They are."
        ],
        [
            "The probability of going from here from this state this state depends on the number of neighbors, so there's three neighbors between these states, divided by the total number of neighbors of all these states.",
            "So I can get a matrix connectivity matrix.",
            "For this problem and what I've done is I've reduced I very high dimensional problem into very low dimensional problem by doing this."
        ],
        [
            "Anne.",
            "Actually I find when I do this is if I compare a real.",
            "So this is dissent from the real problem.",
            "The black line of dissent on my model and why you just see the qualitatively qualitatively they're similar, but we actually disagree.",
            "Quite bad, quantitatively they disagree.",
            "This is actually example where we disagree quite badly, Ann."
        ],
        [
            "And one reason is that I get much slow dynamics, and that's because I'm not really capturing the dynamics within a state.",
            "So my model problems are systematically easier and you can see that because if I'm in, say, this state, there's lots of configurations where I couldn't reach the global minimum.",
            "I have to be this configuration to get into that global minima.",
            "And if I'm in this configuration and then I do move uphill, I stay in this configuration, so I'm still not here, so I saw miss out all the dynamics within these states.",
            "Something which is slightly unexpected and I have no explanation for is that the model problems are systematically easier.",
            "I actually.",
            "Always end up in.",
            "No, statistically, I find that I end up in lower states in my models than I do my real problem.",
            "This arises because I'm not actually searching all of these states equally often, and in fact that's very dramatically true."
        ],
        [
            "This is a histogram of none of the frequency with which I finished up in a state, and this is actually log scale, so some states, so it's sort of a lognormal distribution and some states I seem to be visiting.",
            "Of thousands of more times than other states, so this is for I've played just taking the configurations in a single state and I'm just looking at.",
            "The probability of landing in various configurations and what I find is that sometimes I arrive very, very frequently and sometimes I almost never visit that state.",
            "So."
        ],
        [
            "What does modeling give you?",
            "Well, one thing it gives you that you can do Markov chain analysis.",
            "You can easily build a Markov model for this.",
            "So WS your transition matrix which depends on your connectivity matrix and the heuristics you're using.",
            "So for simulated annealing this W would also depend on your annealing temperature.",
            "And because you have a small number of states, this is tractable.",
            "Ansi."
        ],
        [
            "You can play games of that so you can do things like you can compute optimal annealing schedules, so this has been done before, but only in very small problems.",
            "Now we're doing model problems, but the model problems are much larger problems than what we mean by optimal annealing schedules.",
            "Depends on where your optimization criteria and there's two commonly used ones.",
            "One is just depends on your final results.",
            "And the others depend on the best solution you find so far.",
            "So this is a little bit more complicated to compute, but you can compute it.",
            "And you can optimize.",
            "You can play lots of games like optimizing from ensemble of problems, and you can optimize for other things and annealing schedules.",
            "You can optimize for mutation rates."
        ],
        [
            "So very quickly, here's some annealing schedules, so this is a.",
            "So what I care about is where I end up after time T, so these are different runtimes and my skin needling schedules have rather strange shape.",
            "What I find I do is initially I go at the very low temperature that's 'cause my barrier trees are have very few local minimums at the top, so it's worth to sort of shooting down, and then when I reached the part of the barratry where this local minimas, I do quite a bit of search around there.",
            "And then at the end I want to end up in a good solution.",
            "The best so far.",
            "So this is where I don't care about where I end up at the last position, but where I end the best place I've seen from my run.",
            "I've slightly similar except right?"
        ],
        [
            "At the end you actually for some strange reason you increase your temperature."
        ],
        [
            "And this is just an example where I have a variable mutation rate.",
            "So this is for two problems.",
            "Is a toy problem and this is for Max that problem."
        ],
        [
            "So quickly to conclude, sobia trees are very useful for visualization.",
            "They've been used quite a lot of the stuff which has been interesting.",
            "Me is just a very simple idea of mapping these configurations to buy a trees, which allows you to measure lots of statistical properties and so actually understand more about.",
            "What these landscapes look like?",
            "You can visualize heuristics, which I think is very potent and we haven't really done as much work and virus.",
            "Perhaps we should and you can construct model problems, which opens up lots of sorts of new possibilities of doing things, so I realize I'm.",
            "Roy."
        ],
        [
            "Being very late, but I finally got to my final slide switches.",
            "Are there any questions?",
            "Maybe I'll ask a question and then.",
            "We want.",
            "Can you just explain a little bit more about that algorithm for constructing constructing better keys?",
            "Anything going on this for this given reference or something?",
            "He didn't give any.",
            "Picture of an.",
            "And I really didn't describe the algorithm.",
            "Yeah, it's very simple.",
            "What you do is you.",
            "You construct a list of all your configuration, so you can only do this is exact and is exhausted enumeration, so you can only do it for small problems, but you construct a list of all your configurations of.",
            "Cause of your last costs of the next less Costas next lowest cost and then you start at the bottom.",
            "Here you construct.",
            "Level connected sets, which is just a very simple cluster construction algorithm level, connected to sets for local minimums are going to be level accessible sets and then you move up.",
            "Then you find barriers and you find other local minimas.",
            "And so you sort of, so that's what I mean by flooding algorithm.",
            "Is that you move up.",
            "And then level Accessibility, are you?",
            "You get level Accessibility to this, so the saddle points might consist of many levels accessible sets and basically you've got to look down to these neighbors to see whether you can then go up to something else so you can do that by sort of labeling algorithm.",
            "This is problem.",
            "There's so yeah, there's free software that does this, which has been produced by Studless Group my I've got paper on this as well.",
            "Along the same lines.",
            "Hey baby, I'm coming to see example have many minimum particle is valuable.",
            "Because it's it's I love that line if you will.",
            "If you change the.",
            "Case number here.",
            "Yeah, you can actually different transport.",
            "What is doing even be disconnected?",
            "If I go high?",
            "The only local minimums I'm going to see up here, I'm not guaranteed.",
            "I'm not guaranteed I'm going to get graph tree.",
            "If I cut off here, I'd end up with the forest, but it turns out that.",
            "As you go up, you get that doesn't seem to happen, but there's no reason.",
            "I mean certainly if I cut off here, I'd end up with the forest.",
            "Innovation that you have three local minima separated by barriers on the same page.",
            "Then it will be the same case that evenly.",
            "Sorry.",
            "It's a busy week.",
            "Same body as well.",
            "This season passes many many.",
            "Local minima is always the same or connected.",
            "This is done then just the single stage, right?",
            "The same.",
            "Or wines or whatever in your search space which have the same which you have.",
            "Zander Pharmacy was made, or I mean yeah yeah.",
            "Yeah, so so I said these horizontal lines of points.",
            "Yeah, into single point.",
            "If you don't contract them, you do end up with a graph, But yeah.",
            "Yeah, maybe just a short question.",
            "I think I know the answer, but when you throw the graphs for the simulated annealing, yeah, of course this is a constant kind simulator, so you or is it?",
            "No, I'm just felt it from Superstylin started from sorry.",
            "Sorry, the last time the last section, what you mean constant times, it's probably.",
            "I think it was around 60 or so.",
            "Page 60.",
            "Yeah, yeah.",
            "Sokkia good that's going yeah.",
            "Search some site beforehand.",
            "Time I'm going to run for yes and then what I do is I compute for my model problem what the optimal.",
            "Annealing temperature is.",
            "And it turns out so because it's a analytic function.",
            "This is.",
            "These are the optical surface.",
            "If I run for 50 configurations, then my optimal annealing temperatures I start very low and then I go high on.",
            "Then I go low again.",
            "Sorry I was rushing as I realized those over running as usual, so that's the schedule.",
            "Yeah, thanks for.",
            "Forcing me to clarify that.",
            "One more question.",
            "What is the beginning of the world you told your machine?",
            "But I'm sure you're happy finding something that is.",
            "This morning and most of the.",
            "The values of yeah, so I mean for something.",
            "So something something approximation algorithms would like something which is 10% within the optimal.",
            "But here the change would like something that is like.",
            "Better than 99% of the patients.",
            "OK, there is some formalization of these with some names that could be printed so, so this is just about OK, I mean.",
            "Search algorithms are interested in finding.",
            "Good solutions rather than optimal solutions because.",
            "In a for things like my site, you know.",
            "You're so so I'm not guys so.",
            "Population.",
            "If you could quantify, I mean I'm going to get a solution which is going to be better done.",
            "Yeah, 9% of their solution.",
            "Yes I will look this 99.",
            "Is there some name for the Queen?",
            "Anne.",
            "OK, I don't know if this means that an within 100% away from the ultimate.",
            "Impacts the very."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To me, here is a great pleasure for two reasons.",
                    "label": 0
                },
                {
                    "sent": "One is, I've not been to this part of the world before, and it's always nice to go somewhere new and the other is.",
                    "label": 0
                },
                {
                    "sent": "I think this is a workshop about something very important.",
                    "label": 0
                },
                {
                    "sent": "Often overlooked.",
                    "label": 0
                },
                {
                    "sent": "Subjects which is this visualization an I'm going to talk about something which I've been very interested in philosophy for many years, which is to do with combinatorial optimization.",
                    "label": 0
                },
                {
                    "sent": "And so I'm talking about some work which I've been doing over the last couple of years of trying to understand, visualize cost landscapes.",
                    "label": 0
                },
                {
                    "sent": "I'm a real academic, which means that I don't actually do much of this work myself.",
                    "label": 0
                },
                {
                    "sent": "Most of this work was done by my.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "PhD students Jonathan Harlem and will Ben Folds.",
                    "label": 0
                },
                {
                    "sent": "I have to thank them and many of the graphs and things you will see I will come from them.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So my talk is going to be.",
                    "label": 0
                },
                {
                    "sent": "I'm going to start by telling a little bit about optimization problems.",
                    "label": 0
                },
                {
                    "sent": "I'm sure that most of you are familiar with that.",
                    "label": 0
                },
                {
                    "sent": "Then I'm going to tell you about cost landscapes, which is a sort of step in the direction of trying to visualize these things.",
                    "label": 0
                },
                {
                    "sent": "Which I guess has a very long history and I'm going to talk about barrier trees which have been around for about 15 years.",
                    "label": 0
                },
                {
                    "sent": "Many people have worked on them, so this is an example of a barratry.",
                    "label": 0
                },
                {
                    "sent": "I'm afraid it's not a very good picture, but will see lots of these pictures.",
                    "label": 0
                },
                {
                    "sent": "And then I'll show you some examples of those.",
                    "label": 0
                },
                {
                    "sent": "And then I'm going to finish off my work, which is.",
                    "label": 0
                },
                {
                    "sent": "The stuff which I've been involved with and it's very simple idea which is actually 2.",
                    "label": 0
                },
                {
                    "sent": "Associate a mapping from configuration spaces to this barrier tree, but actually allows you to do a lot more than you can when other people have previously done with Barrett Reason.",
                    "label": 0
                },
                {
                    "sent": "In particular, you can do things like visualize optimization algorithms, and hopefully that can help us to understand what problems of optimization algorithms really are, and then something that comes out of that is to do with modeling problems.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there's a sort of subtext to my talk, which is whenever you have a complex object you're trying to understand, there's several different.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ways of trying to get to grips with that so very often you start by drawing informal pictures which you kind of think represents your objects.",
                    "label": 1
                },
                {
                    "sent": "He obviously you sometimes try to visualize your objects.",
                    "label": 1
                },
                {
                    "sent": "You look at different aspects of your objects in sort of more formal way by visualization, and you do mathematical analysis and there's a way in which.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "They're all linked when you do research is that often your informal pictures drive you to do some kind of visualization which drives you to do some mathematical analysis, which then motivates you to think of knew.",
                    "label": 1
                },
                {
                    "sent": "Ways of understanding which?",
                    "label": 0
                },
                {
                    "sent": "Drives the process of.",
                    "label": 0
                },
                {
                    "sent": "Forming you pictures and things will see that this sort of.",
                    "label": 0
                },
                {
                    "sent": "Interaction between these sorts of different views happens a lot in this talk, and I guess that's something which will occur quite a lot throughout this workshop.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so the very simple view of a combinatorial optimization, which I call the set view, is that you have a search space which is a set.",
                    "label": 1
                },
                {
                    "sent": "I'm interested in this talk in combinatorial optimization problems where this set is just a finite countable set.",
                    "label": 1
                },
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "So you have the search space and then you have a cost function and that Maps each configuration or each point in this space to.",
                    "label": 0
                },
                {
                    "sent": "It gives a real number associated with each point and then the thing you want to do is find the optimal point.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "In this talk, I'm going to be talking about minimization of the stack and also talk about maximization equally easily, but I'll talk about minimization.",
                    "label": 0
                },
                {
                    "sent": "Actually, in most problems your.",
                    "label": 0
                },
                {
                    "sent": "Satisfied not with finding the optimum, but we're finding some X which is better than most of the other axis.",
                    "label": 0
                },
                {
                    "sent": "And in this talk I'm going to concentrate on problems which.",
                    "label": 0
                },
                {
                    "sent": "But physicists, I'm.",
                    "label": 0
                },
                {
                    "sent": "Once Upon a time I was a physicist, so I called this the general problems.",
                    "label": 0
                },
                {
                    "sent": "These are problems where.",
                    "label": 0
                },
                {
                    "sent": "The set of costs as much smaller than your search space and most points in your search based map onto a similar costs or many points in the search space Maps onto a single cost.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's look at real optimization problems.",
                    "label": 0
                },
                {
                    "sent": "If you call these real optimization problems, these are problems that have been very well studied.",
                    "label": 0
                },
                {
                    "sent": "So one of the most well studied problems is matczak.",
                    "label": 0
                },
                {
                    "sent": "Which is a variation of the SAT problem.",
                    "label": 0
                },
                {
                    "sent": "So what you have is you have N Boolean variables.",
                    "label": 0
                },
                {
                    "sent": "And then you have a set of disjunctive clauses.",
                    "label": 0
                },
                {
                    "sent": "Also, I've realized I've made this capital in this small.",
                    "label": 0
                },
                {
                    "sent": "Sorry about that so.",
                    "label": 0
                },
                {
                    "sent": "The clauses are satisfied if any of these are closed.",
                    "label": 0
                },
                {
                    "sent": "If any of these truths.",
                    "label": 0
                },
                {
                    "sent": "If X one is true, or if X2 is false, or is X freeze true, then this clause is.",
                    "label": 0
                },
                {
                    "sent": "True.",
                    "label": 0
                },
                {
                    "sent": "And the optimization problem is to find an assignment of these axes.",
                    "label": 0
                },
                {
                    "sent": "To satisfy the majority of these clauses right and the SAT problem is where you try to satisfy all of 'em Max.",
                    "label": 0
                },
                {
                    "sent": "That is where you try to satisfy as many of these as possible.",
                    "label": 0
                },
                {
                    "sent": "To turn this into a minimization problem.",
                    "label": 0
                },
                {
                    "sent": "I'm actually doing Min unsatisfied unsat I'm trying to minimize number of unsatisfied clauses.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So where do Max at problems arise from Verizon actually in things like digital circuits?",
                    "label": 0
                },
                {
                    "sent": "In many planning problems, you can reduce those kinds of problems to Max out problems.",
                    "label": 0
                },
                {
                    "sent": "But one of the results, which is well known from theoretical computer science, is that.",
                    "label": 0
                },
                {
                    "sent": "Any problem you give to nondeterministic Turing machine can be reduced to the SAT problem.",
                    "label": 1
                },
                {
                    "sent": "So nondeterministic Turing machine is a sort of magic computer.",
                    "label": 0
                },
                {
                    "sent": "But guess is the answer.",
                    "label": 0
                },
                {
                    "sent": "And Coke in 1971 showed that you can reduce a.",
                    "label": 0
                },
                {
                    "sent": "Non deterministic Turing machine into a SAT problem.",
                    "label": 0
                },
                {
                    "sent": "So this is a sort of theoretical interest, but you can actually use this.",
                    "label": 0
                },
                {
                    "sent": "So I recently had an undergraduate student.",
                    "label": 0
                },
                {
                    "sent": "Of mine who had to I had for a month and I got him to do factorization of 2 numbers and he did factorization by writing a nondeterministic Turing machine.",
                    "label": 0
                },
                {
                    "sent": "That check whether 2 numbers were indeed factor correctly or factor correctly and.",
                    "label": 0
                },
                {
                    "sent": "Then he turned back Turing machine into the SAT problem and he said it on the SAT solver so.",
                    "label": 0
                },
                {
                    "sent": "Sat problems amaxac problems are.",
                    "label": 0
                },
                {
                    "sent": "I saw the generic problem that you can solve anything with.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A lot of you because you are involved with the Pasco Network will be.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "Use the machine learning examples.",
                    "label": 0
                },
                {
                    "sent": "Here's an example from machine learning, so the perception is assault class is perhaps the classic machine learning device that performs binary classification.",
                    "label": 1
                },
                {
                    "sent": "Given a data set with a set of N dimensional inputs and a class label, what the perception does is you try to find away vector which aligns with all the patterns.",
                    "label": 1
                },
                {
                    "sent": "Which have a positive class label and is anti aligned with over patterns with have a negative class label.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if these are your positive class labels and visa, your negative class labels, then you're trying to find a dividing plane and your weight vector is just.",
                    "label": 0
                },
                {
                    "sent": "Vector which is orthogonal to that dividing plane or hyperplane in high dimensions.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "The perception problem is a continuous optimization problem, but if you actually consider a very constrained perception where we only live weights to be minus one or plus one, we get what's sometimes called either binary perceptron organizing perceptron and this is known to be an NP hard problem.",
                    "label": 0
                },
                {
                    "sent": "Actually trying to find the weights to solve our rights and be hard for those of you who aren't computer scientists just means that there aren't actually.",
                    "label": 0
                },
                {
                    "sent": "Efficient algorithms for finding good solutions for this, and in fact this is a very hard problem.",
                    "label": 0
                },
                {
                    "sent": "It's not a problem.",
                    "label": 0
                },
                {
                    "sent": "And then no good algorithms are actually solving this problem particular efficiently.",
                    "label": 0
                },
                {
                    "sent": "So in both my examples of this Ising perception of the Max app, they have a lot of structure that's not part of this sect view of.",
                    "label": 1
                },
                {
                    "sent": "Of an optimization problem, and so the.",
                    "label": 0
                },
                {
                    "sent": "Issue in trying to tackle these problems is can we try to get a better understanding of his optimization problems?",
                    "label": 0
                },
                {
                    "sent": "What is it that?",
                    "label": 0
                },
                {
                    "sent": "Makes these kinds of optimal optimizations.",
                    "label": 0
                },
                {
                    "sent": "Are problems hard to solve?",
                    "label": 0
                },
                {
                    "sent": "And can we kind of draw out something about them and these are very different.",
                    "label": 0
                },
                {
                    "sent": "You know Max at Ising perceptron, but there's an awful lot of these problems I could have done.",
                    "label": 0
                },
                {
                    "sent": "Graph coloring all sorts of problems, and is there a sort of unifying framework?",
                    "label": 0
                },
                {
                    "sent": "But we can understand these problems with.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this brings me on to the next part of the talk, which is the cost landscape.",
                    "label": 0
                },
                {
                    "sent": "In cost landscape what we do is we.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Impose some topology on the search space and the easiest way of doing that is just to define a neighborhood function, or at least that's if you have a.",
                    "label": 0
                },
                {
                    "sent": "A discrete space.",
                    "label": 0
                },
                {
                    "sent": "Say in the continuous space you would usually have continuity, which would give you an automatic topology.",
                    "label": 0
                },
                {
                    "sent": "In discrete space you don't really have that, but you can put the topology on by choosing.",
                    "label": 0
                },
                {
                    "sent": "And neighborhood.",
                    "label": 0
                },
                {
                    "sent": "Neighborhoods are very closely related to search algorithms, so if you have a search operator.",
                    "label": 1
                },
                {
                    "sent": "Neighborhood.",
                    "label": 0
                },
                {
                    "sent": "Is usually.",
                    "label": 0
                },
                {
                    "sent": "A set of configurations, but you can move to from a particular configuration.",
                    "label": 1
                },
                {
                    "sent": "And actually one of the key heuristics which.",
                    "label": 0
                },
                {
                    "sent": "Underlies a huge number of search algorithms.",
                    "label": 0
                },
                {
                    "sent": "Is right if you want to choose a neighborhood so that your cost of your neighbors is similar to your normal cost, so it's closer to the normal cost than a random configuration would be.",
                    "label": 0
                },
                {
                    "sent": "So enormous number of search problems rely on this heuristic.",
                    "label": 0
                },
                {
                    "sent": "So what neighborhoods for the problems that I've described?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I've described problems which can be described in terms of a binary string.",
                    "label": 0
                },
                {
                    "sent": "There there's a very natural neighborhood function which is known as a Hamming neighborhood.",
                    "label": 0
                },
                {
                    "sent": "And that's why you just neighbors of configurations solutions that just differ at single part of the string.",
                    "label": 0
                },
                {
                    "sent": "So this is for the.",
                    "label": 0
                },
                {
                    "sent": "Max at problem.",
                    "label": 0
                },
                {
                    "sent": "This is for the binary perceptron.",
                    "label": 0
                },
                {
                    "sent": "And these both satisfy my criteria of.",
                    "label": 0
                },
                {
                    "sent": "Trying to I have neighbors that have a similar cost, so in the Max out problem, if I change the single variable that's not going to affect so many clauses because that variable won't actually exist in many of my clauses, so it should not change very dramatically cost.",
                    "label": 0
                },
                {
                    "sent": "Uh, but.",
                    "label": 0
                },
                {
                    "sent": "The cost of the solution when I moved to one of these neighbors.",
                    "label": 0
                },
                {
                    "sent": "And again in the binary perception, if I change a single wait here, I do a minimal shift in the in the separating plane.",
                    "label": 1
                },
                {
                    "sent": "So that's the smallest change I can make from the separating plane.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "This hamming neighborhood.",
                    "label": 0
                },
                {
                    "sent": "This is a hypercube topology on the search space, so this is.",
                    "label": 1
                },
                {
                    "sent": "Rather easy to see if I'm at some point in the search space and I have N neighbors, so this is a 3 dimensional case, so each of these neighbors I get by changing one of these surface is the.",
                    "label": 0
                },
                {
                    "sent": "Ising search space.",
                    "label": 0
                },
                {
                    "sent": "When I changing one of the weights from plus one to minus one.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So when you look at binary strings to having neighborhood is such an obvious neighborhood, it's difficult to think of other neighborhoods.",
                    "label": 1
                },
                {
                    "sent": "Or you can think of other neighborhoods.",
                    "label": 0
                },
                {
                    "sent": "You could look at next nearest neighbor neighborhoods and things, but they seem a little bit artificial, but many optimization problems.",
                    "label": 0
                },
                {
                    "sent": "There are actually a large number of natural neighborhoods, and one particular example is the traveling salesman problem.",
                    "label": 1
                },
                {
                    "sent": "So this is the.",
                    "label": 0
                },
                {
                    "sent": "This is an example of a torrent of traveling salesman problem, and you ask, well what's the neighbor of that?",
                    "label": 0
                },
                {
                    "sent": "And there's lots of different possible neighbors.",
                    "label": 0
                },
                {
                    "sent": "This is a neighbor were actually choose.",
                    "label": 0
                },
                {
                    "sent": "A couple of different.",
                    "label": 0
                },
                {
                    "sent": "Links in this store and then I swap them around.",
                    "label": 0
                },
                {
                    "sent": "And this is known as a two opt neighborhood, and this is actually the most commonly used neighborhood in in.",
                    "label": 0
                },
                {
                    "sent": "That ESP so in TSB these would be considered neighbors.",
                    "label": 0
                },
                {
                    "sent": "Those two would be considered our neighbors and TSP.",
                    "label": 0
                },
                {
                    "sent": "But in test P, you can actually think of a huge number of different kinds of neighbors, so there's free OP says.",
                    "label": 0
                },
                {
                    "sent": "Very many different ways of representing your problems so that when you do a change in in the.",
                    "label": 0
                },
                {
                    "sent": "In your representation, it creates a small change in the tours that they're doing.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so that was the neighborhood function.",
                    "label": 0
                },
                {
                    "sent": "I've had the cost function and then the idea of this cost landscape is that if you have a cost function in the neighborhood, you get a landscape and.",
                    "label": 1
                },
                {
                    "sent": "Suddenly this was an idea that was used a lot in evolutionary biology back in 1930s, right?",
                    "label": 0
                },
                {
                    "sent": "Did a lot of.",
                    "label": 0
                },
                {
                    "sent": "Drawing pictures.",
                    "label": 0
                },
                {
                    "sent": "Using fitness landscapes and we think of the landscape.",
                    "label": 0
                },
                {
                    "sent": "This is sort of vertical height of the landscape represents the cost and then the.",
                    "label": 0
                },
                {
                    "sent": "We can then move around that landscape because real landscapes.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Don't look like that in discrete optimization problems they look like this.",
                    "label": 0
                },
                {
                    "sent": "So that we have a sort of hypercube geometry and at each point of hypercube service corresponds to configuration and that will have some fitness associated with it.",
                    "label": 0
                },
                {
                    "sent": "One of the issues we have is that this is not an easy thing to visualize.",
                    "label": 0
                },
                {
                    "sent": "Now it's easy to visualize in three dimensions, but when I'm in 100 dimensions I can no longer draw.",
                    "label": 0
                },
                {
                    "sent": "100 dimensional hypercube.",
                    "label": 0
                },
                {
                    "sent": "So one of the sort of big challenges in this area is to try and get your head around what the sort of landscape is.",
                    "label": 0
                },
                {
                    "sent": "When you have these kinds of discrete optimization problems.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "Well, I can draw some informal pictures to try and get an understanding of how the cost landscape might appear for noising perceptron.",
                    "label": 0
                },
                {
                    "sent": "Send actually normal perceptron, what every time I introduce a.",
                    "label": 0
                },
                {
                    "sent": "New pattern what I do is I introduce some separating plane.",
                    "label": 0
                },
                {
                    "sent": "So if I'm on this side of the separating plane I'm have.",
                    "label": 0
                },
                {
                    "sent": "I satisfy this pattern and if I'm on the other side, I don't satisfy this pattern.",
                    "label": 0
                },
                {
                    "sent": "If I have.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Many of these patterns and what I do is I have.",
                    "label": 0
                },
                {
                    "sent": "Many dividing planes and what I want to be on this I have to be on the right side of each of these dividing planes.",
                    "label": 1
                },
                {
                    "sent": "And so this is a so the seer is my search space for my normal perceptron and the.",
                    "label": 0
                },
                {
                    "sent": "Hypercube.",
                    "label": 0
                },
                {
                    "sent": "Is this search based for the Ising perceptron and there's sort of I don't have too many patterns.",
                    "label": 0
                },
                {
                    "sent": "There's some region where I have everything correctly classified.",
                    "label": 1
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One of the features that has become quite hot topic over the last 10 years in optimization is an understanding of phase transitions in optimization problems.",
                    "label": 0
                },
                {
                    "sent": "And there what you find is, as you increase.",
                    "label": 0
                },
                {
                    "sent": "So this is for the item perception.",
                    "label": 0
                },
                {
                    "sent": "As we increase the number, the ratio of patterns to the sizes of my input space.",
                    "label": 1
                },
                {
                    "sent": "I moved from a case where I can classify.",
                    "label": 0
                },
                {
                    "sent": "I can I can correctly classify?",
                    "label": 0
                },
                {
                    "sent": "My inputs to a region where I can no longer correctly classify my inputs.",
                    "label": 0
                },
                {
                    "sent": "As the same time life, there seems to be a phase transition, so this is the sort of exciting new work that people have been trying to understand the last 10 years.",
                    "label": 0
                },
                {
                    "sent": "There's a transition from a phase where the problem is easy to face, where the problem is hard and back transition point seems to be close to where you become unsatisfiable.",
                    "label": 0
                },
                {
                    "sent": "Physicists believe it is actually happened slightly before then, some people.",
                    "label": 0
                },
                {
                    "sent": "But this can't be the case.",
                    "label": 0
                },
                {
                    "sent": "Typical head just means exceptions to this.",
                    "label": 0
                },
                {
                    "sent": "If I'm in this region, I might have an unsatisfiable problem, but the probability of having an unsatisfiable problem becomes exponentially rare as I increase the size of my.",
                    "label": 0
                },
                {
                    "sent": "Patterns.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here's one of my informal pictures where what I've done is I've taken my.",
                    "label": 0
                },
                {
                    "sent": "For my fear of solutions on which in that sphere I have embedded a hypersphere and I've unwrapped it.",
                    "label": 0
                },
                {
                    "sent": "And I've drawn it here so each of these dots corresponds to a solution to binary perception.",
                    "label": 0
                },
                {
                    "sent": "And then each of these lines corresponds to.",
                    "label": 0
                },
                {
                    "sent": "A dividing plane caused by patterns, so I have to be on the right side of all of these lines and then provided I don't have too many patterns, then there's some region in this space where I have some satisfied solutions.",
                    "label": 0
                },
                {
                    "sent": "If I add some more patterns about space, when I start to cut into this regions where there satisfies solutions.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then I get to.",
                    "label": 0
                },
                {
                    "sent": "I reach a point when suddenly what happens is that I still have some satisfied solutions, but these satisfied solutions are now actually disconnected with each other.",
                    "label": 0
                },
                {
                    "sent": "Alright, so this was just adding some more patterns into this.",
                    "label": 0
                },
                {
                    "sent": "And my solution space becomes disconnected.",
                    "label": 0
                },
                {
                    "sent": "Ann is this disconnect edition of my solution space which then makes problems hard as I add more patterns and actually the solution space disappears altogether.",
                    "label": 0
                },
                {
                    "sent": "Are there still parts of this where I have some lowest costs?",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So physicists have studied this for some time, probably 2030 years now.",
                    "label": 0
                },
                {
                    "sent": "And they see this transition related to something called replica symmetry breaking.",
                    "label": 1
                },
                {
                    "sent": "So the problems become hard because solutions become disconnected.",
                    "label": 1
                },
                {
                    "sent": "The solutions can be a long way apart as so it's not very obvious in my pictures, but.",
                    "label": 1
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The solutions can actually be quite distant from each other because I can get sort of very long thin regions.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A series solution space is kind of shattering into many local Optima, so this is a physicist often bringing analogy with shattering a piece of glass shattering is random.",
                    "label": 1
                },
                {
                    "sent": "It depends on the patterns, so it's random if you think of the patterns as.",
                    "label": 0
                },
                {
                    "sent": "Random variables.",
                    "label": 0
                },
                {
                    "sent": "Has exponentially number of local minimas is like if you shatter a piece of glass, you get an awful lot of small pieces and the sizes in this piece of glass can differ quite a lot.",
                    "label": 0
                },
                {
                    "sent": "Sorry, I pressed the wrong.",
                    "label": 0
                },
                {
                    "sent": "Spartan.",
                    "label": 0
                },
                {
                    "sent": "And it jumped ahead.",
                    "label": 0
                },
                {
                    "sent": "Too many things.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is seen in calculations when you do calculations of these kinds of systems.",
                    "label": 1
                },
                {
                    "sent": "This is seen as replica symmetry breaking.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to actually talk much about this.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But the sort of picture of I want to.",
                    "label": 0
                },
                {
                    "sent": "Draw is that you have a phase, an easy phase where are basically all you have to do is go downhill and you're going to get to the solution.",
                    "label": 0
                },
                {
                    "sent": "So here these are high cost solutions and this is my load cost solution and I can start anywhere and provided I kind of go downhill.",
                    "label": 0
                },
                {
                    "sent": "I get to.",
                    "label": 0
                },
                {
                    "sent": "A to the global solution.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then as I increase.",
                    "label": 0
                },
                {
                    "sent": "We are the number of patterns or increase use so a lot of these optimization problems.",
                    "label": 0
                },
                {
                    "sent": "They have some parameter which you can tweak which makes the problem harder.",
                    "label": 0
                },
                {
                    "sent": "So in the Mac sat problem, that's the number of clauses you tweak.",
                    "label": 0
                },
                {
                    "sent": "You can increase the number of clauses and when you get this dividing up of this search base.",
                    "label": 0
                },
                {
                    "sent": "And then you can no longer guarantee to get a good solution if you go.",
                    "label": 0
                },
                {
                    "sent": "If you start here and you just go downhill, you can end up on the solution which is no longer is just a local solution.",
                    "label": 0
                },
                {
                    "sent": "It's no longer a global solution.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so that's a pretty picture question is, is this an accurate picture?",
                    "label": 1
                },
                {
                    "sent": "Well, I'm talking about discrete problems in high dimensions these are.",
                    "label": 1
                },
                {
                    "sent": "Pictures that are drawn in two dimensions and there's continuity here and so obviously that's an approximation.",
                    "label": 0
                },
                {
                    "sent": "I'd not very good at drawing a very large number of local minimums, because these pictures quickly become incomprehensible.",
                    "label": 1
                },
                {
                    "sent": "Also, this phase transition from easy to hard is actually much more subtle, and we'll talk about that a little bit later.",
                    "label": 0
                },
                {
                    "sent": "When we look at some why discuss some other peoples work on some cover number partitioning problem.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so very well, very informal pictures that gave us a sort of idea of what may be happening.",
                    "label": 0
                },
                {
                    "sent": "Can we try and get a more rigorous visualization of what's going on in?",
                    "label": 0
                },
                {
                    "sent": "This brings us all onto barrier trees.",
                    "label": 0
                },
                {
                    "sent": "So these have been well studied, as I say, for about 10 or.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In years.",
                    "label": 0
                },
                {
                    "sent": "And they basically help us to build some kind of a picture of a search base, and the idea is that the leaves of these trees are local minimas.",
                    "label": 0
                },
                {
                    "sent": "And the merging vertices correspond to lowest cost saddle points or the barriers and the height of the vertices indicates fitness, so here's a sort of.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Picture again, this is not a real picture because this is an artificial problem I just drew by hand, but here's my costs.",
                    "label": 0
                },
                {
                    "sent": "Again, dark means high cost and like.",
                    "label": 0
                },
                {
                    "sent": "Light means low costs and I'm going I'm minimizing.",
                    "label": 0
                },
                {
                    "sent": "I what I can do is I can represent this landscape by tree structure like this so that from this region a I can get to be or I can get to see, but I can't get from B to C without going to a higher cost.",
                    "label": 0
                },
                {
                    "sent": "Then the region B is separated into two regions.",
                    "label": 0
                },
                {
                    "sent": "D&D&D is separated into Region H and one of the things about by a trees is that this region D doesn't actually have to be connected, provided I can get from here to here.",
                    "label": 0
                },
                {
                    "sent": "Going through low-cost, I consider this to be one point, otherwise I don't have a barrier tree.",
                    "label": 0
                },
                {
                    "sent": "I have something called the merging graph.",
                    "label": 0
                },
                {
                    "sent": "It turns out for to buy a.",
                    "label": 0
                },
                {
                    "sent": "Trees are often more useful ways of.",
                    "label": 0
                },
                {
                    "sent": "Visualizing landscapes.",
                    "label": 0
                },
                {
                    "sent": "But while the star shows it does show the sort of bias involved, so if I might.",
                    "label": 0
                },
                {
                    "sent": "And I want to go to the global solution I actually have and I'm testing neighborhood search.",
                    "label": 0
                },
                {
                    "sent": "I have to go.",
                    "label": 0
                },
                {
                    "sent": "Up so high costs to see than a vent to be vented even to age.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "OK, so this pretty graph assumed that I had continuity.",
                    "label": 0
                },
                {
                    "sent": "Once again, I've done my silly finger pressing wrong button.",
                    "label": 0
                },
                {
                    "sent": "This has assuming continuity and.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I don't have continuity.",
                    "label": 0
                },
                {
                    "sent": "I have to replace that if I have a discrete space I have to replace the idea of continuity and I do that by having a path.",
                    "label": 1
                },
                {
                    "sent": "So my path is just a sequence of configurations, all of who are neighbors of each other.",
                    "label": 1
                },
                {
                    "sent": "And then one technical thing which I'm going to assume throughout this talk is that my neighborhoods are always symmetric, so that is very often the case, but it wouldn't necessarily have to be the case, but I'm going to assume.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ban just in case there's mathematicians in the audience who's going to pull me up on that.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The key concept in actually building barrier trees for discrete systems, or one thing is the idea of level connectedness.",
                    "label": 0
                },
                {
                    "sent": "So in level connectedness this is.",
                    "label": 1
                },
                {
                    "sent": "A relation where.",
                    "label": 0
                },
                {
                    "sent": "Two points in my spacer level connected if as a path where is point on this path has the same fitness, so that's the idea level connected.",
                    "label": 0
                },
                {
                    "sent": "So what I can do is I can take my search space and I can divide it into level connected sets.",
                    "label": 1
                },
                {
                    "sent": "Unfortunately, left.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Connectedness has one problem, which is that you often get a very large number of level connected sets to try and understand that.",
                    "label": 1
                },
                {
                    "sent": "Here's a sort of toy problem that has been very well studied because it's so simple it's the one Max problem.",
                    "label": 1
                },
                {
                    "sent": "It goes by various names, one counting one Max and basically the fitness is the number of ones, so you want to over cost is.",
                    "label": 0
                },
                {
                    "sent": "I guess the number of zeros you want to reduce the number of zeros.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "One of the things is that every point is actually level connected set.",
                    "label": 0
                },
                {
                    "sent": "If you have a Hamming neighborhood, and that's because if you have any binary string and you change a binary string, either 1 to 0 zero to one you changed the cost, and because you're changing the cost, that means that all your neighbors have a different cost to you so.",
                    "label": 0
                },
                {
                    "sent": "Few level connected sets or consists of 1 member, so that's not a very good way of.",
                    "label": 0
                },
                {
                    "sent": "Representing points, so this is an extreme problem, but even in real things like Mac Sackett, it's at.",
                    "label": 0
                },
                {
                    "sent": "If you look at level connected sets, you get an awful lot of level 'cause connected sets, so people tend.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Look at.",
                    "label": 0
                },
                {
                    "sent": "Level Accessibility, so Accessibility is a little bit like connectedness, except you say that X&Y are accessible.",
                    "label": 1
                },
                {
                    "sent": "Provide that there's a path between X&Y such that you never go.",
                    "label": 0
                },
                {
                    "sent": "All the configurations on that path have low cost than your starting configuration.",
                    "label": 0
                },
                {
                    "sent": "So that's the idea of Accessibility, and then we have a.",
                    "label": 0
                },
                {
                    "sent": "Are never equivalence relation, which is level Accessibility, so which is just saying that these.",
                    "label": 0
                },
                {
                    "sent": "Points level Iaccessible, provided they have the same fitness and they're accessible from each other, so that is actually different from global connectedness, as we will see in the next transparency level.",
                    "label": 0
                },
                {
                    "sent": "Accessibilities 'cause it's an equivalence relation that defines a partitioning into level iaccessible sets these level iaccessible sets are key to drawing.",
                    "label": 1
                },
                {
                    "sent": "Your barrier trees.",
                    "label": 0
                },
                {
                    "sent": "I actually won Max.",
                    "label": 0
                },
                {
                    "sent": "It turns out that the number of level iaccessible sets is N + 1 and the every fitness level is just a level accessible set.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is the same example I had before and now this point here, which previously wasn't part of the level connected set, is part of the level accessible set because starting.",
                    "label": 0
                },
                {
                    "sent": "From any of these configurations I can get to this for a number of different routes.",
                    "label": 0
                },
                {
                    "sent": "As it turns out, without going through a cost level that is higher from my starting level, OK, this is not part of the level accessible set.",
                    "label": 0
                },
                {
                    "sent": "Obviously 'cause it's a different cost.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And finally, to get to borrow trees in this thing, I can define Accessibility between sets.",
                    "label": 1
                },
                {
                    "sent": "Says to level Iaccessible sets are accessible, provided this configurations from this in this set that our our configurations in this set or accessible from configurations in this set.",
                    "label": 0
                },
                {
                    "sent": "Actually, Accessibility defines partial ordering.",
                    "label": 0
                },
                {
                    "sent": "Barratry is actually what's known is often called the diagram of the partial ordering, so it's just a graph of the.",
                    "label": 1
                },
                {
                    "sent": "Direct predecesor, so if I have a barrier tree like this.",
                    "label": 0
                },
                {
                    "sent": "I look at configuration like this.",
                    "label": 0
                },
                {
                    "sent": "This is the immediate predecessor, so this point is accessible from all of these points, so I can reach this point without going through a cost any.",
                    "label": 0
                },
                {
                    "sent": "Any higher than any of these points?",
                    "label": 0
                },
                {
                    "sent": "I can't do that from this point, 'cause I actually have to go to cost higher than my starting point.",
                    "label": 0
                },
                {
                    "sent": "OK, but I don't have to show all these points because it turns out that this point is going to be accessible from all of these higher points.",
                    "label": 0
                },
                {
                    "sent": "I just showed the direct predecesor and that gives me a barratry.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Perhaps more importantly, the mathematical definition, I mean it's a clean mathematical definition, but the nice thing is that it's reasonably efficient to compute.",
                    "label": 0
                },
                {
                    "sent": "It can be computed in terms size of the search space times the size of the neighborhood.",
                    "label": 1
                },
                {
                    "sent": "Using a flooding algorithm, which is a little bit fiddly, but it's basically a straightforward algorithm.",
                    "label": 0
                },
                {
                    "sent": "Some would argue that this is not a particularly nice thing, because it depends on the size of the search space, and I'm interested in big surf basis, so I'm only going to be able to look at rather small problems with Barry trees.",
                    "label": 0
                },
                {
                    "sent": "Hope I can actually get away from this restriction a little bit by using a modified branstrom Bangor algorithm, which means that I can look at all the configurations.",
                    "label": 0
                },
                {
                    "sent": "Act below a certain cost and I can do that reasonably efficiently so I can actually look at some reasonably big problems.",
                    "label": 0
                },
                {
                    "sent": "I only get a picture of the lower part of the barratry, but turns out the high parts of a bio trees are usually trivial so I don't lose too much because of that.",
                    "label": 0
                },
                {
                    "sent": "And the higher parts of the bio trees, if I'm interested in them, and I will be interested in them, I can estimate some of their properties just by using sampling, 'cause there are bits of search space that are actually very common.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so that was the sort of fairy let me show you some pictures.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is a Max at problem, it just has.",
                    "label": 0
                },
                {
                    "sent": "The search space just consists of 10 variables, so I've only got the whole search space is only 1024 different configurations?",
                    "label": 0
                },
                {
                    "sent": "I've got 50.",
                    "label": 0
                },
                {
                    "sent": "50 clauses in this case, and so this is the buyer tree.",
                    "label": 0
                },
                {
                    "sent": "This is the global minima.",
                    "label": 0
                },
                {
                    "sent": "But have one local minima.",
                    "label": 0
                },
                {
                    "sent": "While I'm not showing you, is that there's a huge number of other costs which basically disc golf here and go very high.",
                    "label": 0
                },
                {
                    "sent": "So most of my search space is up here, but this is the interesting part of the search space above.",
                    "label": 0
                },
                {
                    "sent": "Here there are no local minimas, so also this is the first local minima.",
                    "label": 0
                },
                {
                    "sent": "That exists, so this is the first local minima and this is a saddle points.",
                    "label": 0
                },
                {
                    "sent": "In order to get from here to here, I actually enforce the girl pill and come down here.",
                    "label": 0
                },
                {
                    "sent": "So I increased the number.",
                    "label": 0
                },
                {
                    "sent": "The size of this problem, so this is.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "20 variable problems.",
                    "label": 0
                },
                {
                    "sent": "My search space is now a million configurations.",
                    "label": 0
                },
                {
                    "sent": "I get slightly more.",
                    "label": 0
                },
                {
                    "sent": "Complicated by a trees.",
                    "label": 0
                },
                {
                    "sent": "If I increase that.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The 30 variable problems.",
                    "label": 0
                },
                {
                    "sent": "So I have 10 to the nine search space size 8:50.",
                    "label": 0
                },
                {
                    "sent": "Then I get slightly more complicated.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then take out 40 variable problems.",
                    "label": 0
                },
                {
                    "sent": "I get a large number of these.",
                    "label": 0
                },
                {
                    "sent": "Local minimas actually turns out these local minimums are very have quite a large number.",
                    "label": 0
                },
                {
                    "sent": "They're actually very, very small.",
                    "label": 0
                },
                {
                    "sent": "And then actually very often visit them.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "That was when I had a ratio of clauses to variables of five.",
                    "label": 0
                },
                {
                    "sent": "This is when I have a ratio of clauses to variables of four.",
                    "label": 0
                },
                {
                    "sent": "Thank.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Priest this ratio closes variable.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To 6 to 8 and to.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "10 This is going into the hard region, so this.",
                    "label": 0
                },
                {
                    "sent": "Is where these problems become much harder.",
                    "label": 0
                },
                {
                    "sent": "I get many more local minimas, and in this case there's probably many more local minimums I'm not seeing above here.",
                    "label": 0
                },
                {
                    "sent": "My branch and bound I do sort of cut off at this level and above there is there's too many.",
                    "label": 0
                },
                {
                    "sent": "Configurations to actually explore high parts of history.",
                    "label": 0
                },
                {
                    "sent": "So whereas for simple problems this is, this will be the top of the tree for these bigger problems.",
                    "label": 0
                },
                {
                    "sent": "There be many more local minimums above this level.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I talked a little bit about phase transitions so people have looked at this.",
                    "label": 0
                },
                {
                    "sent": "Particularly, Stadler has done a lot of work with barrier trees.",
                    "label": 1
                },
                {
                    "sent": "Have looked at looking for evidence for phase transitions and finally they found very little evidence in the shape of the tree.",
                    "label": 1
                },
                {
                    "sent": "So despite this sort of nice picture I drew.",
                    "label": 0
                },
                {
                    "sent": "Which physicists would believe in I believed in as a physicist, but you get the splitting of the search space.",
                    "label": 0
                },
                {
                    "sent": "It turns out that there's little evidence into shape of the barratry.",
                    "label": 0
                },
                {
                    "sent": "I mean, the battery only shows local minimums, and some of these local minimas may have very small.",
                    "label": 0
                },
                {
                    "sent": "Numbers of configurations attached with them.",
                    "label": 0
                },
                {
                    "sent": "The only evidence they did find for this phase transition is in something called the difficulty, which is the ratio of.",
                    "label": 0
                },
                {
                    "sent": "Very, very height to the gap between.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "A local minima and global minima, so the ratio of beta D. This was actually in the number of partitioning problem, which is one that doesn't really have a discrete space.",
                    "label": 0
                },
                {
                    "sent": "It has kind of it's not.",
                    "label": 0
                },
                {
                    "sent": "Sorry it's not very degenerate problem.",
                    "label": 0
                },
                {
                    "sent": "So actually this gap can be very small.",
                    "label": 0
                },
                {
                    "sent": "So actually the problems we're looking at this is probably not a good measure of difficulty, so I did have a student tried to look for seeing where they could find phase transitions.",
                    "label": 0
                },
                {
                    "sent": "In the.",
                    "label": 0
                },
                {
                    "sent": "Structure of these pirate trees, but he didn't get very far.",
                    "label": 0
                },
                {
                    "sent": "Partly that was because we were moving on and doing other work, so there's still quite a lot of work to be done in that area.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so let me get on to the work which is.",
                    "label": 0
                },
                {
                    "sent": "More original work.",
                    "label": 0
                },
                {
                    "sent": "It's a very simple idea, the idea.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yes, I have my.",
                    "label": 0
                },
                {
                    "sent": "Space of.",
                    "label": 0
                },
                {
                    "sent": "Configure configurations, my search space and I have a barratry representation.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "And one thing which I can trivially do is I can actually record a mapping from any of these points onto a part of a by a tree.",
                    "label": 0
                },
                {
                    "sent": "So each of these points are uniquely gets is identified with one of the nodes in this by a tree, and that's actually to do this mappings.",
                    "label": 0
                },
                {
                    "sent": "I actually need to have these.",
                    "label": 0
                },
                {
                    "sent": "General problems if I have a non degenerate problem then these mappings become slightly less defined.",
                    "label": 0
                },
                {
                    "sent": "I mean you can do it, but it is less of this.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "So that's all I'm mean by the mappings is a very simple idea, but it actually allows me to do quite a lot more visualization.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And also to look at statistics so.",
                    "label": 0
                },
                {
                    "sent": "I cannot look at different statistics so I can look at things like the number of configurations in a state I can look at the stringiness of the local minima, so one of the questions is do.",
                    "label": 1
                },
                {
                    "sent": "If I have a local minima or over configurations on the side of a hyper cube?",
                    "label": 0
                },
                {
                    "sent": "Or are they sort of longfin effin structures that wind through the hypercube?",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately answer is that they tend to be boring objects that seem to sort of lie on the surface of the hypercube.",
                    "label": 0
                },
                {
                    "sent": "I can look at things like.",
                    "label": 0
                },
                {
                    "sent": "Distance is the global solutions.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to show you a lot of data.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This, but I'll show you an example, so this is.",
                    "label": 0
                },
                {
                    "sent": "Barratry formats at problem with 40 variables.",
                    "label": 0
                },
                {
                    "sent": "And then the sort of.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Statistiques you can look at for this, as you can say how many configurations are there each cost level so it costs level 1213 fourteen.",
                    "label": 0
                },
                {
                    "sent": "These are the number of configurations.",
                    "label": 0
                },
                {
                    "sent": "These are the number of local minimas.",
                    "label": 0
                },
                {
                    "sent": "This is the main basin size, so actually the basin sizes are very small.",
                    "label": 0
                },
                {
                    "sent": "This usually back to two configurations.",
                    "label": 0
                },
                {
                    "sent": "In some of these basin sizes, and some of these basins.",
                    "label": 0
                },
                {
                    "sent": "Number of minima with depth greater than one rather small.",
                    "label": 0
                },
                {
                    "sent": "The percentage of configurations in local minima so obviously over configurations on local minimums here.",
                    "label": 0
                },
                {
                    "sent": "But up here actually a very small number percentage of my configurations are actually local minimas.",
                    "label": 0
                },
                {
                    "sent": "Number of several points I have.",
                    "label": 0
                },
                {
                    "sent": "Then I can run descent from this and I can say if I run to send, where do I end up?",
                    "label": 0
                },
                {
                    "sent": "But what level turns out that?",
                    "label": 0
                },
                {
                    "sent": "Even for this quite big problem, I half the time I end up in a local minima.",
                    "label": 0
                },
                {
                    "sent": "Which is the global side I end up in the global minima?",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But I can also do visualization 'cause I have a mapping.",
                    "label": 0
                },
                {
                    "sent": "Every point in my search space I can map to somewhere in the barratry.",
                    "label": 0
                },
                {
                    "sent": "So if I do something like simulated annealing, why start way up here?",
                    "label": 1
                },
                {
                    "sent": "But basically this is big straight lines that's not very interesting.",
                    "label": 0
                },
                {
                    "sent": "After 16 generations my.",
                    "label": 0
                },
                {
                    "sent": "Search base gets down here.",
                    "label": 0
                },
                {
                    "sent": "I then quickly jump down here.",
                    "label": 0
                },
                {
                    "sent": "I jump up and down a few times.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I get a bit lower.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And finally, I find the global solution.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I jump up and.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Unfair.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And actually, one of the things you notice is that you don't tend to get trapped in local minima's.",
                    "label": 0
                },
                {
                    "sent": "So it turns out that for the size problems, doing descent is a very, very good algorithm for for these kinds of things so.",
                    "label": 0
                },
                {
                    "sent": "There's still a lot of work to do on visualization and trying to find problems which are actually quite hard for these.",
                    "label": 0
                },
                {
                    "sent": "Optimization algorithms.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can do the same with genetic algorithms and genetic algorithms, I haven't.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Population, most of my populations up here and I'm not showing it, but.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Eventually I get members of the population down here.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then later I sort of come down.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And eventually I find a global.",
                    "label": 0
                },
                {
                    "sent": "Minimize so.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let me OK, so that's.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Visualization, which I think is a very useful tool, because it's actually very difficult to actually understand how these kinds of algorithms are searching this space and what the problems are.",
                    "label": 0
                },
                {
                    "sent": "I mean, all your problems really that you're getting stuck 'cause it's just that you have to search huge space to actually go downhill.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to finish off very quickly talking about.",
                    "label": 0
                },
                {
                    "sent": "Something that isn't really doing visualization, but it came out visualization nice to do with modeling problems.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "So, given a problem, we can actually model it by Malcolm Eighting configurations and barratry gives us a very natural way of doing that, because all the configurations, but we've mapped to state in the barrier tree.",
                    "label": 0
                },
                {
                    "sent": "We can amalgamate into sort of single state.",
                    "label": 0
                },
                {
                    "sent": "And then the initial occupancy of that state is obviously just a number of configurations in that state.",
                    "label": 0
                },
                {
                    "sent": "The transition probabilities we can make proportional to the number of neighbors seems a very natural thing to do.",
                    "label": 0
                },
                {
                    "sent": "It's actually an approximation that's very bad, and I'll talk a little bit by trap.",
                    "label": 0
                },
                {
                    "sent": "And then the model has some structure.",
                    "label": 0
                },
                {
                    "sent": "So the nice thing about these models is they have exactly the same structure of local minima.",
                    "label": 0
                },
                {
                    "sent": "Some barriers as the true problem.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is another silly picture I drew trying to explain what's happening.",
                    "label": 0
                },
                {
                    "sent": "Face this, these are my configurations, but I took from the hypercube and I saw it separate from interstates.",
                    "label": 0
                },
                {
                    "sent": "Depending on why they lined the barratry.",
                    "label": 0
                },
                {
                    "sent": "These are all connected.",
                    "label": 0
                },
                {
                    "sent": "These aren't connected.",
                    "label": 0
                },
                {
                    "sent": "These are not accessible from one or the other because I have to go through higher costs configurations.",
                    "label": 0
                },
                {
                    "sent": "They are.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The probability of going from here from this state this state depends on the number of neighbors, so there's three neighbors between these states, divided by the total number of neighbors of all these states.",
                    "label": 0
                },
                {
                    "sent": "So I can get a matrix connectivity matrix.",
                    "label": 0
                },
                {
                    "sent": "For this problem and what I've done is I've reduced I very high dimensional problem into very low dimensional problem by doing this.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Actually I find when I do this is if I compare a real.",
                    "label": 0
                },
                {
                    "sent": "So this is dissent from the real problem.",
                    "label": 0
                },
                {
                    "sent": "The black line of dissent on my model and why you just see the qualitatively qualitatively they're similar, but we actually disagree.",
                    "label": 0
                },
                {
                    "sent": "Quite bad, quantitatively they disagree.",
                    "label": 0
                },
                {
                    "sent": "This is actually example where we disagree quite badly, Ann.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And one reason is that I get much slow dynamics, and that's because I'm not really capturing the dynamics within a state.",
                    "label": 0
                },
                {
                    "sent": "So my model problems are systematically easier and you can see that because if I'm in, say, this state, there's lots of configurations where I couldn't reach the global minimum.",
                    "label": 0
                },
                {
                    "sent": "I have to be this configuration to get into that global minima.",
                    "label": 0
                },
                {
                    "sent": "And if I'm in this configuration and then I do move uphill, I stay in this configuration, so I'm still not here, so I saw miss out all the dynamics within these states.",
                    "label": 0
                },
                {
                    "sent": "Something which is slightly unexpected and I have no explanation for is that the model problems are systematically easier.",
                    "label": 0
                },
                {
                    "sent": "I actually.",
                    "label": 0
                },
                {
                    "sent": "Always end up in.",
                    "label": 0
                },
                {
                    "sent": "No, statistically, I find that I end up in lower states in my models than I do my real problem.",
                    "label": 0
                },
                {
                    "sent": "This arises because I'm not actually searching all of these states equally often, and in fact that's very dramatically true.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is a histogram of none of the frequency with which I finished up in a state, and this is actually log scale, so some states, so it's sort of a lognormal distribution and some states I seem to be visiting.",
                    "label": 0
                },
                {
                    "sent": "Of thousands of more times than other states, so this is for I've played just taking the configurations in a single state and I'm just looking at.",
                    "label": 0
                },
                {
                    "sent": "The probability of landing in various configurations and what I find is that sometimes I arrive very, very frequently and sometimes I almost never visit that state.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What does modeling give you?",
                    "label": 0
                },
                {
                    "sent": "Well, one thing it gives you that you can do Markov chain analysis.",
                    "label": 0
                },
                {
                    "sent": "You can easily build a Markov model for this.",
                    "label": 0
                },
                {
                    "sent": "So WS your transition matrix which depends on your connectivity matrix and the heuristics you're using.",
                    "label": 0
                },
                {
                    "sent": "So for simulated annealing this W would also depend on your annealing temperature.",
                    "label": 0
                },
                {
                    "sent": "And because you have a small number of states, this is tractable.",
                    "label": 0
                },
                {
                    "sent": "Ansi.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You can play games of that so you can do things like you can compute optimal annealing schedules, so this has been done before, but only in very small problems.",
                    "label": 0
                },
                {
                    "sent": "Now we're doing model problems, but the model problems are much larger problems than what we mean by optimal annealing schedules.",
                    "label": 0
                },
                {
                    "sent": "Depends on where your optimization criteria and there's two commonly used ones.",
                    "label": 0
                },
                {
                    "sent": "One is just depends on your final results.",
                    "label": 0
                },
                {
                    "sent": "And the others depend on the best solution you find so far.",
                    "label": 1
                },
                {
                    "sent": "So this is a little bit more complicated to compute, but you can compute it.",
                    "label": 0
                },
                {
                    "sent": "And you can optimize.",
                    "label": 0
                },
                {
                    "sent": "You can play lots of games like optimizing from ensemble of problems, and you can optimize for other things and annealing schedules.",
                    "label": 0
                },
                {
                    "sent": "You can optimize for mutation rates.",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So very quickly, here's some annealing schedules, so this is a.",
                    "label": 0
                },
                {
                    "sent": "So what I care about is where I end up after time T, so these are different runtimes and my skin needling schedules have rather strange shape.",
                    "label": 0
                },
                {
                    "sent": "What I find I do is initially I go at the very low temperature that's 'cause my barrier trees are have very few local minimums at the top, so it's worth to sort of shooting down, and then when I reached the part of the barratry where this local minimas, I do quite a bit of search around there.",
                    "label": 0
                },
                {
                    "sent": "And then at the end I want to end up in a good solution.",
                    "label": 0
                },
                {
                    "sent": "The best so far.",
                    "label": 0
                },
                {
                    "sent": "So this is where I don't care about where I end up at the last position, but where I end the best place I've seen from my run.",
                    "label": 0
                },
                {
                    "sent": "I've slightly similar except right?",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At the end you actually for some strange reason you increase your temperature.",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is just an example where I have a variable mutation rate.",
                    "label": 0
                },
                {
                    "sent": "So this is for two problems.",
                    "label": 0
                },
                {
                    "sent": "Is a toy problem and this is for Max that problem.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So quickly to conclude, sobia trees are very useful for visualization.",
                    "label": 0
                },
                {
                    "sent": "They've been used quite a lot of the stuff which has been interesting.",
                    "label": 0
                },
                {
                    "sent": "Me is just a very simple idea of mapping these configurations to buy a trees, which allows you to measure lots of statistical properties and so actually understand more about.",
                    "label": 0
                },
                {
                    "sent": "What these landscapes look like?",
                    "label": 0
                },
                {
                    "sent": "You can visualize heuristics, which I think is very potent and we haven't really done as much work and virus.",
                    "label": 0
                },
                {
                    "sent": "Perhaps we should and you can construct model problems, which opens up lots of sorts of new possibilities of doing things, so I realize I'm.",
                    "label": 0
                },
                {
                    "sent": "Roy.",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Being very late, but I finally got to my final slide switches.",
                    "label": 0
                },
                {
                    "sent": "Are there any questions?",
                    "label": 0
                },
                {
                    "sent": "Maybe I'll ask a question and then.",
                    "label": 0
                },
                {
                    "sent": "We want.",
                    "label": 0
                },
                {
                    "sent": "Can you just explain a little bit more about that algorithm for constructing constructing better keys?",
                    "label": 0
                },
                {
                    "sent": "Anything going on this for this given reference or something?",
                    "label": 0
                },
                {
                    "sent": "He didn't give any.",
                    "label": 0
                },
                {
                    "sent": "Picture of an.",
                    "label": 0
                },
                {
                    "sent": "And I really didn't describe the algorithm.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's very simple.",
                    "label": 0
                },
                {
                    "sent": "What you do is you.",
                    "label": 0
                },
                {
                    "sent": "You construct a list of all your configuration, so you can only do this is exact and is exhausted enumeration, so you can only do it for small problems, but you construct a list of all your configurations of.",
                    "label": 0
                },
                {
                    "sent": "Cause of your last costs of the next less Costas next lowest cost and then you start at the bottom.",
                    "label": 0
                },
                {
                    "sent": "Here you construct.",
                    "label": 0
                },
                {
                    "sent": "Level connected sets, which is just a very simple cluster construction algorithm level, connected to sets for local minimums are going to be level accessible sets and then you move up.",
                    "label": 0
                },
                {
                    "sent": "Then you find barriers and you find other local minimas.",
                    "label": 0
                },
                {
                    "sent": "And so you sort of, so that's what I mean by flooding algorithm.",
                    "label": 0
                },
                {
                    "sent": "Is that you move up.",
                    "label": 0
                },
                {
                    "sent": "And then level Accessibility, are you?",
                    "label": 0
                },
                {
                    "sent": "You get level Accessibility to this, so the saddle points might consist of many levels accessible sets and basically you've got to look down to these neighbors to see whether you can then go up to something else so you can do that by sort of labeling algorithm.",
                    "label": 0
                },
                {
                    "sent": "This is problem.",
                    "label": 0
                },
                {
                    "sent": "There's so yeah, there's free software that does this, which has been produced by Studless Group my I've got paper on this as well.",
                    "label": 0
                },
                {
                    "sent": "Along the same lines.",
                    "label": 0
                },
                {
                    "sent": "Hey baby, I'm coming to see example have many minimum particle is valuable.",
                    "label": 0
                },
                {
                    "sent": "Because it's it's I love that line if you will.",
                    "label": 0
                },
                {
                    "sent": "If you change the.",
                    "label": 0
                },
                {
                    "sent": "Case number here.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you can actually different transport.",
                    "label": 0
                },
                {
                    "sent": "What is doing even be disconnected?",
                    "label": 0
                },
                {
                    "sent": "If I go high?",
                    "label": 0
                },
                {
                    "sent": "The only local minimums I'm going to see up here, I'm not guaranteed.",
                    "label": 0
                },
                {
                    "sent": "I'm not guaranteed I'm going to get graph tree.",
                    "label": 0
                },
                {
                    "sent": "If I cut off here, I'd end up with the forest, but it turns out that.",
                    "label": 0
                },
                {
                    "sent": "As you go up, you get that doesn't seem to happen, but there's no reason.",
                    "label": 0
                },
                {
                    "sent": "I mean certainly if I cut off here, I'd end up with the forest.",
                    "label": 0
                },
                {
                    "sent": "Innovation that you have three local minima separated by barriers on the same page.",
                    "label": 0
                },
                {
                    "sent": "Then it will be the same case that evenly.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "It's a busy week.",
                    "label": 0
                },
                {
                    "sent": "Same body as well.",
                    "label": 0
                },
                {
                    "sent": "This season passes many many.",
                    "label": 0
                },
                {
                    "sent": "Local minima is always the same or connected.",
                    "label": 0
                },
                {
                    "sent": "This is done then just the single stage, right?",
                    "label": 0
                },
                {
                    "sent": "The same.",
                    "label": 0
                },
                {
                    "sent": "Or wines or whatever in your search space which have the same which you have.",
                    "label": 0
                },
                {
                    "sent": "Zander Pharmacy was made, or I mean yeah yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so so I said these horizontal lines of points.",
                    "label": 0
                },
                {
                    "sent": "Yeah, into single point.",
                    "label": 0
                },
                {
                    "sent": "If you don't contract them, you do end up with a graph, But yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah, maybe just a short question.",
                    "label": 0
                },
                {
                    "sent": "I think I know the answer, but when you throw the graphs for the simulated annealing, yeah, of course this is a constant kind simulator, so you or is it?",
                    "label": 0
                },
                {
                    "sent": "No, I'm just felt it from Superstylin started from sorry.",
                    "label": 0
                },
                {
                    "sent": "Sorry, the last time the last section, what you mean constant times, it's probably.",
                    "label": 0
                },
                {
                    "sent": "I think it was around 60 or so.",
                    "label": 0
                },
                {
                    "sent": "Page 60.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah.",
                    "label": 0
                },
                {
                    "sent": "Sokkia good that's going yeah.",
                    "label": 0
                },
                {
                    "sent": "Search some site beforehand.",
                    "label": 0
                },
                {
                    "sent": "Time I'm going to run for yes and then what I do is I compute for my model problem what the optimal.",
                    "label": 0
                },
                {
                    "sent": "Annealing temperature is.",
                    "label": 0
                },
                {
                    "sent": "And it turns out so because it's a analytic function.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "These are the optical surface.",
                    "label": 0
                },
                {
                    "sent": "If I run for 50 configurations, then my optimal annealing temperatures I start very low and then I go high on.",
                    "label": 0
                },
                {
                    "sent": "Then I go low again.",
                    "label": 0
                },
                {
                    "sent": "Sorry I was rushing as I realized those over running as usual, so that's the schedule.",
                    "label": 0
                },
                {
                    "sent": "Yeah, thanks for.",
                    "label": 0
                },
                {
                    "sent": "Forcing me to clarify that.",
                    "label": 0
                },
                {
                    "sent": "One more question.",
                    "label": 0
                },
                {
                    "sent": "What is the beginning of the world you told your machine?",
                    "label": 0
                },
                {
                    "sent": "But I'm sure you're happy finding something that is.",
                    "label": 0
                },
                {
                    "sent": "This morning and most of the.",
                    "label": 0
                },
                {
                    "sent": "The values of yeah, so I mean for something.",
                    "label": 0
                },
                {
                    "sent": "So something something approximation algorithms would like something which is 10% within the optimal.",
                    "label": 0
                },
                {
                    "sent": "But here the change would like something that is like.",
                    "label": 0
                },
                {
                    "sent": "Better than 99% of the patients.",
                    "label": 0
                },
                {
                    "sent": "OK, there is some formalization of these with some names that could be printed so, so this is just about OK, I mean.",
                    "label": 0
                },
                {
                    "sent": "Search algorithms are interested in finding.",
                    "label": 0
                },
                {
                    "sent": "Good solutions rather than optimal solutions because.",
                    "label": 0
                },
                {
                    "sent": "In a for things like my site, you know.",
                    "label": 0
                },
                {
                    "sent": "You're so so I'm not guys so.",
                    "label": 0
                },
                {
                    "sent": "Population.",
                    "label": 0
                },
                {
                    "sent": "If you could quantify, I mean I'm going to get a solution which is going to be better done.",
                    "label": 0
                },
                {
                    "sent": "Yeah, 9% of their solution.",
                    "label": 0
                },
                {
                    "sent": "Yes I will look this 99.",
                    "label": 0
                },
                {
                    "sent": "Is there some name for the Queen?",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "OK, I don't know if this means that an within 100% away from the ultimate.",
                    "label": 0
                },
                {
                    "sent": "Impacts the very.",
                    "label": 0
                }
            ]
        }
    }
}