{
    "id": "7woeb75zlehch43rqiku73qr47xbnh5e",
    "title": "Book of the Dead Project: A New Approach to Digital Editions of Ancient Manuscripts Using CIDOC-CRM, FRBRoo and RDFa",
    "info": {
        "presenter": [
            "Barry Norton, British Museum"
        ],
        "published": "Oct. 19, 2014",
        "recorded": "September 2014",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/eswc2014_norton_digital_editions/",
    "segmentation": [
        [
            "As Dominic mentioned, link linguistics is favorite of digital humanities so far, so I'm going to cannibalize some slides that I gave to their digital humanities group at UCL recently to give some context for where we're using linguistics technology at the British Museum, specifically with regard to the tools that Isabella was talking about, we had implemented something with an LTC in Python.",
            "We thought it would be an interesting example as a hands-on to go with this, but gates.",
            "Gives us a really nice point and click interface where we can achieve quite a lot just in terms of GUI.",
            "So we re engineered it and I need to give full credit to Isabel and how one of our supervisors Diana for helping me with this because we actually achieve better results than we had ourselves in refactoring this for you.",
            "I don't want to say too much about the application."
        ],
        [
            "It's the kind of thing I, Dominic, and I get excited about.",
            "I'm not sure how much we've excited you so far, but the Egyptian book of the Dead is a set of funerary texts.",
            "OK, that were written when, especially when mummies were buried in ancient Egypt.",
            "They are written in a couple of different scripts in hieroglyphics and in the word is gone entirely out of my head, Dominic.",
            "I in the hieratic script, more alphabetic, less pictogram script.",
            "We don't deal with ancient Egyptian NLP.",
            "That'll be an interesting challenge.",
            "What we deal with is translation into English.",
            "The relationship of these translations to our objects.",
            "So the object data we've talked about publishing and that you can get right here to our fixed authoritie's where we have lists of ancient places.",
            "We have lists of.",
            "Ancient gods, we have lists of materials that are used in the construction of objects.",
            "So we're trying to find these kind of things in the English translation of spells worth mentioning, but I'm not going to belabor the point that I'll illustrate it with."
        ],
        [
            "Key pedia there is no such thing as a Canonical book of the dead.",
            "OK, this is an ancient artifact.",
            "1 Two what actually comes down to us on the pierian?",
            "The linens that we have in our music.",
            "Our museum in the Louvre in the Getty are fragmented and then made by different schools across that Kingdom of Egypt, and they had diverged into different traditions.",
            "So there's some sort of reconstructed core.",
            "For what the book means and a division into numbered spells.",
            "But in any given tradition, for instance, memphite around a certain region, there will be a certain idiom to how the spells are rendered and what they contain in terms of people and places and what they do.",
            "OK, the early parts of the book are very mythology based, the later ones are very based on actual burial practices.",
            "So if you place a certain amulets in the mummy.",
            "Then he can be guaranteed of, you know, coming back to life.",
            "That's what mummification was about.",
            "Wikipedia, everyones favorite source, but it's not entirely accurate.",
            "They say their most.",
            "They say they Piri.",
            "They're not exclusively Piri, they say they vary in what are called vignettes in the graphical illustration.",
            "In fact, as I've said, the text varies a lot as well."
        ],
        [
            "So we work with this chap called Malcolm Marsha, who it's his scholarly work that we're trying to digitize and put online using linked data technologies.",
            "He's translated in his first volume, spells 1 to 16."
        ],
        [
            "He's an interesting guy.",
            "If you Google him, you find an HP or Hewlett Packard profile for him, titled Egyptologist, a senior software designer.",
            "If you read on a bit, I got very excited that in 1988 he was working on RDF.",
            "But back."
        ],
        [
            "1998 that wasn't the Resource description framework.",
            "It was something entirely separate, called the Remote Duplicate Database Facility.",
            "All the same, it's a nice hook to talk to him about the technology we use."
        ],
        [
            "Skip that picture.",
            "Nobody needs to see me so you know we have data on objects.",
            "So what was that one that is a papyrus representation of?",
            "Part of the book?"
        ],
        [
            "You know we have a sparkle endpoint, so this is a really crude query to see more or less how many of these things do we have about 1500 objects that are related to the book of."
        ],
        [
            "Guide the slides are available so you can look at these here query to look what materials are those things made from.",
            "Well, mostly papyrus but one in 10 of them are on linen and then you have all kinds of other material in their construction."
        ],
        [
            "But what we also publish is our authorities.",
            "This list of people, places, materials, cultures, etc.",
            "So if we start with the God Osiris, either someone could have given you the you are I in some RDF or otherwise, or you can do a text search for him.",
            "You'll see we've got a record with RDF about a Cyrus."
        ],
        [
            "Even just on the website you can see things like there's a depiction relationship in the CRM, so we can find all kinds of objects that represent a Cyrus."
        ],
        [
            "And indeed, RDF's are good fit for that.",
            "I don't think I need to explain more about RDF modeling relationships well."
        ],
        [
            "Just to remind you that this ontology that Dominic mentioned as any ontology provides properties and classes.",
            "If you're using this data, interesting to know the P numbers of the properties that the numbers of the classes, and there are a lot of them but Domino."
        ],
        [
            "Showed you this is a nice diagram, especially if you want to work with the data.",
            "Nice to some people.",
            "This shows all of the different relationships.",
            "From the object in the center where we can express different parts of what we know about our objects, including the acquisition, the production, where it's House, which Department it's in, so we're going to use such a query over our data to find the gods that are depicted in Egyptian Department items and then use that to source a gazeteer in an NLP pipeline shortly in the hands on."
        ],
        [
            "So."
        ],
        [
            "I'm going to."
        ],
        [
            "Skip some detail."
        ],
        [
            "So on."
        ],
        [
            "Pulling that stuff."
        ],
        [
            "So you can go ahead and look at."
        ],
        [
            "I pass these slides off to."
        ],
        [
            "Dominic on Sir."
        ],
        [
            "Search that was data on it."
        ],
        [
            "Nation where you can actually go to the data and say maybe that's not a Cyrus.",
            "Maybe it's raw and you give your argument for it.",
            "This."
        ],
        [
            "Was as Dominic said, image annotation where you go to an image of the thing, draw this box and use that for an annotation and say that is a representation of a Cyrus.",
            "OK, but increasingly what we're needing to do and what we need to do with Marsha's work is not look at data that's already in RDF is not.",
            "Look at images but actually to annotate text that continuous text in a manuscript like these translations.",
            "So there's a few more slides on how we could represent that for the web.",
            "But you may already know from Maribel's talk yesterday what those semantic Web answer is.",
            "If you want to annotate text and publish it on the web.",
            "Our DFA OK, so our choice is the end of our pipeline is.",
            "We'd like to.",
            "We'd like to persist out the results of the natural language processing as our DFA for the web aligner.",
            "So without further ado we should do some hands on 'cause I'm very keen that you do this.",
            "We put a lot of work into building this.",
            "It depends on having gate installed.",
            "As I've said a couple of times today.",
            "Is there anyone who hasn't managed to install gate yet?",
            "Do you have the USB key to do it?",
            "You OK 'cause the second thing is good.",
            "That was the one hand the USB keys that you have installed from.",
            "Can you please pass them back towards Elena 'cause we need them for the next hands-on session this afternoon?",
            "Know that there was one hand last chance to say you haven't installed it.",
            "I'm still you're still doing it, but you're in progress.",
            "We should also say you don't only need gayden Java, so if you already have that, you will also need the book of the dead folder because it contains a readme you won't need.",
            "Sorry bout that, yes.",
            "So did you copy as well the folder BOTD?",
            "Even if you didn't get it from the USB stick, it is on the file server, as are many other things.",
            "Let me try and find that for you.",
            "I can't read across there, we've got 192.",
            "16821 and that's accessed using FTP, so we should put in FTP: double slash 19216821.",
            "Everybody is going to be in a slightly different place depending on your operating system.",
            "the Mac puts it under applications so I can start gate from here are people seeing this splash screen or dead already been throughout?",
            "Anybody got a problem getting to the splash screen?",
            "You won't see this application, by the way, should have deleted that.",
            "OK, so if you get past the splash screen and get to here raise your hand.",
            "Not everybody, it's it's empty.",
            "I already have some resources I should have closed it right down.",
            "OK, so do you also have the readme dot TXT file?",
            "It might be I'm going to do everything with you, but if you miss a step I'll keep numbering the steps.",
            "If I had my tablet dominant, can you grab my tablet?",
            "So we've got a number of steps.",
            "Number one was indeed open gate.",
            "So what's next?",
            "Install gates, sorry.",
            "Was number one instruction number two start gates.",
            "We've got their instruction number three.",
            "We mentioned both of us that Annie is a named entity Information extraction pipeline, so there is a ready made application.",
            "If you go to the gate menu.",
            "So if you go to the file menu and look under ready made applications.",
            "Annie.",
            "We can make a new Annie application.",
            "OK, that will take a second to load.",
            "And then you see on the left the one thing that you've probably got underneath the groups.",
            "Under application, you've now got a new one called Annie.",
            "You could rename that if you want, but I'm happy that it's called Annie.",
            "OK, if you double click on it you can see this down there.",
            "Right hand side is the pipeline.",
            "The ready defined pipeline.",
            "So of those tasks that Isabel was talking about.",
            "The tokenization the use of a gazeteer sentence splitter.",
            "Part of speech.",
            "Pause tagging OK. All of this is ready made for you OK.",
            "Hands up if you're seeing this.",
            "We're still doing reasonably well if you're having trouble, apart from when I say hands up, put your hand up and Isabel will come help you.",
            "If you fall behind on you.",
            "OK, so next step you see underneath applications we have language resource is yours I believe are empty.",
            "OK right click on language resources and we're going to make a new gate corpus.",
            "OK Corpus is the term linguists always used for a collection of documents.",
            "Its plural is corpora.",
            "That's even more.",
            "Affected, let's call our corpus BRTD for book of the Dead.",
            "OK, so we have we said.",
            "Under language resources, New Gate Corpus we get this dialogue and under the name field we're just going to call it book of the Dead so we know what we're dealing with.",
            "If you click OK. You'll see that that appears under language resource is OK. Now you can right click that.",
            "And say, populate.",
            "OK.",
            "I'm going too quickly.",
            "Who's with me?",
            "Who's got who's now gotta corpus?",
            "OK, good, so right click on your corpus and say populate we get this dialog.",
            "The top fields called Directory directory URL and it has this Finder button beside it.",
            "Use the Finder button to point to the spells directory that under the book of the Dead Directory.",
            "OK, either on the file server or what you copied from the USB stick OK.",
            "So if I go to your equivalent, yeah under book of the dead.",
            "We click spells not double Click to open it, but we click spells to say we want the whole directory full of spells.",
            "We choose that.",
            "And OK. And now we've populated this book of the Dead corpus with a number of spells.",
            "OK, it's 10 files.",
            "I believe it's three spells, but for there for the 1st and the last spells, we have four different versions for different traditions.",
            "OK, the second spell in the book of the Dead is so short that there's very little variation, so we have one version.",
            "OK, but we have men fight, and all of the other.",
            "Traditions whose names I've forgotten but Spell 1 and Spell 3.",
            "OK, everyone with me so far apart from the hands.",
            "Yeah, Dick DS store is not going to process very well.",
            "You can you can remove that if you're on a Mac like me and it's being populated.",
            "OK, so like say there's 10 useful documents on a DS store.",
            "I know there's nine useful documents in a DS store can't count 4 + 4 + 1, that's where I was going wrong.",
            "OK, so now we're going to double click.",
            "Are you OK?",
            "Hands up if you're having trouble.",
            "Is that?",
            "So I was like OK, you bet you if you look at the readme dot tag there's there's a step she should be able to catch up by help, or is it can help you in trouble.",
            "No problem, just try to Windows.",
            "Some files are not properly displayed on windows.",
            "Ouch, Ouch, Ouch.",
            "I notice this with the Mac, so this is what happens if you double click on book of the Dead version one.",
            "The Mac doesn't do this absolutely perfectly, 'cause that's supposed to be a paragraph symbol that isn't rendered correctly on Windows, especially if you're not using English.",
            "There might be another Unicode problem, so sorry, you might have to just follow what I'm doing on the projection.",
            "What we have at the moment is just plain text.",
            "OK, this is marsha's translation of this spell and you see, he said in the spell there's things like beginning of the spells it announces itself.",
            "In this preamble you see at the end of this sentence we mentioned a God already a Cyrus.",
            "OK, words spoken by Osiris.",
            "Can I see any other gods here?",
            "I can see Horus.",
            "OK, So what we're trying to do?",
            "Is both classify those as gods?",
            "Recognize them as named entities, classify them as gods and link them to our link data about gods.",
            "And then later we would do the same for places, an for materials, etc.",
            "If you click on annotation sets at the top, does everyone see that?",
            "OK click on annotation sets.",
            "You'll see all with all that we have is original markup.",
            "So if you click paragraph, which is all the markup we have, then each one of those is a paragraph.",
            "OK, it's good, but it's not NLP OK, it's just looking at the plain text.",
            "So what we do now is double Click to go back to our application.",
            "OK, and you'll see at the bottom.",
            "We have this field called corpus.",
            "And we just created one.",
            "So we select this book of the Dead corpus.",
            "And run the application.",
            "OK, I don't want to do too many steps at once.",
            "Click for the corpus and then Click to run the application.",
            "Work from there.",
            "No, no, this was a ready made application.",
            "So if you have a look here on the right, you should already have that pipeline that I have.",
            "That's fine, Oh yeah sorry.",
            "I have some more of those than the ones in the pipeline because I've already.",
            "I already had some applications.",
            "For you, everything that you have all of their what gate cause processing resource is all of them that are loaded at the moment because you just started from fresh air in your pipeline.",
            "OK so when we say run this application it will run this pipeline over this corpus.",
            "OK, so I'm going to go ahead and do that now.",
            "So running over 11 documents because I still have that Mac file there.",
            "If I go back to be D1V1 so the first version of Spell 1.",
            "With annotation sets displayed on the right hand side, you'll see now in addition to the original markup.",
            "We have all of these new things, dates, locations, things that Isabel was talking about.",
            "OK, one of those is person OK and we are treating gods as people.",
            "The distinctions are subtle one.",
            "So if you click for person, these are the annotations that the automatic pipeline has made.",
            "OK, some of them are goat.",
            "I'm struggling to find 1 thoughhh soft is a God and he's been correctly recognized.",
            "OK, Noble.",
            "Is in our thesaurus, but it's the wrong.",
            "It's not actually naming a God, it's used as the word Noble, so it's fallen to this ambiguity.",
            "OK.",
            "So the point so far is the default pipeline, as we kind of predicted, is not that good at our task, even though we have well written text by a scholar who had an editor's mark.",
            "As Marco was pointing out also for his text.",
            "The entity recognition has not been great.",
            "You are with me so far.",
            "Yeah, happy.",
            "Show of hands if you're happy, so far that we've annotated some gods very good.",
            "Annotated them fairly badly.",
            "It has to be said OK, next step, double click on your application again to go back and see what the pipeline is.",
            "And I'm going to say this generic gazeteer that was used.",
            "I want to remove from the pipeline, so I click it.",
            "And then I click this button to take it out of the window on the right hand side, take it out of the pipeline, the gazetteer.",
            "So remove the gazeteer from the pipeline, remove.",
            "The named entity transducer.",
            "From the pipeline.",
            "And remove the author matcher.",
            "Since I'm calling heavily.",
            "OK, so I want you to cut down your pipeline so you just have a reset at the start, so we're dealing with the documents afresh, a tokenizer, a sentence splitter, and a part of speech tagger OK. Everyone with me ready to move on.",
            "OK, I'm going to.",
            "Run their application again with this reduced pipeline over the same corpus.",
            "Which is quicker because it's doing less OK.",
            "So now if you go back to your document.",
            "Again, I'll just go for Spell 1 version one.",
            "We have fewer annotations because we haven't tried to do that.",
            "Any named entity recognition.",
            "OK. Full instruction I'm going to save that file once it's been annotated as XML.",
            "OK, so pick one of the spells.",
            "Preferably Spell 1 version one.",
            "Then you can follow what I'm doing.",
            "Save it as XML.",
            "Hello.",
            "Oh no.",
            "I think it's frozen.",
            "Sorry, we've been having problems with this Mac.",
            "I can't right click.",
            "No, nothing is frozen.",
            "How do I can you close it for me?",
            "OK, so if yours is still running unlike mine, can you save that spell as XML and then open up the XML in a text editor?",
            "Whichever one you like?",
            "OK. Now if you search in your text editor for this, God, thoughhh, THOTH.",
            "OK, did you find self in that document?",
            "The first instance where you found it is is the spell, but you'll see there's lots of XML tags around it.",
            "Try again here.",
            "So save as XML.",
            "Great.",
            "I'll call mine book The Dead 1 version One dot XML.",
            "I'll find that.",
            "There we go.",
            "Open that in Xcode, yes, OK, so we're looking at the XML, so this is the annotated document.",
            "And as I said, search 4th off.",
            "THOTH it's in the it's in the spell, but the spells hard to read now 'cause we've got all of this mark up all of the elements that are used.",
            "It just called node OK. Those mark places in the text around tokens.",
            "OK so you can see that's off.",
            "The first time he appears.",
            "At the start is 267 and at the end is 272, so we've got those nodes to mark the start and end of thought.",
            "If we search now for the start tag for the 267 and the easiest way because there's lots of 267 in the middle of things is to put quotes around it.",
            "OK. Look for 267 in quotes.",
            "And find the second instance of that.",
            "So the first one is where we just were worse off appears in the spell.",
            "The next time it appears.",
            "Where within an annotation OK. And that annotation has a number of features.",
            "What we found about that part of the text.",
            "Including that it's a string.",
            "I. Oh sorry, I'm on the wrong one, but it's a string down there that its length is 5.",
            "That it starts with a capital.",
            "That's the string.",
            "It stuff OK, and you remember Isabel showed this thing called Penn Tree.",
            "It was a classification of the parts of speech.",
            "OK, the part of speech for software.",
            "It appears the first time is an NP.",
            "That's a noun phrase, and NP specifically.",
            "A proper noun phrase.",
            "OK, so its role in the sentence is a noun, and it's a proper noun.",
            "It names something OK, so the part of speech could actually do much better than we did before in the pipeline at predicting whether we have a God or not.",
            "OK, but at the same time we want to interlink.",
            "Now there's a small problem on the network at the moment.",
            "In order to build a gazeteer by sparkle we need to be able to talk to a sparkle endpoint.",
            "So.",
            "Reviewing we took this default pipeline with default named entity recognition, found it didn't perform very well, but part of the pipeline was standard linguistic stuff like tokenizing, splitting and finding the part of speech.",
            "Part of speech looks really useful to us in improving that because it finds proper noun phrases reliably OK because we want to now adopt this approach that Isabel was talking about where we build a gazetteer with known terms.",
            "OK, and one that links to link data that actually has ur identifiers for each one of those terms.",
            "We're going to build a gazetteer using a sparkle query.",
            "OK, use it to mark up the text, annotate the text and then combine it with part of speech.",
            "So the first part of that I already have one loaded, but you don't, so you need to go to the jigsaw icon which is managed plugins.",
            "Look down the list and you'll find something called gazeteer.",
            "LKB is called that large knowledge base gazeteer OK Click to load that you can load it always.",
            "OK, let me show you that again.",
            "Click on the jigsaw on this one.",
            "From the right icon.",
            "You get the list.",
            "And you want to Click to load always gazeteer LKB.",
            "We have to.",
            "I know you should load it dynamically.",
            "So any problem?",
            "I do it again.",
            "It doesn't add it to your pipeline, by the way, don't expect it to immediately add it to your pipeline as long as as long as you said apply then you can close.",
            "So apply close.",
            "And now it's about it's loaded, so it's available to put into our pipeline.",
            "So we can go to new processing resource OK and in your list Now you should have.",
            "Did I just not click apply?",
            "Oh yes, yeah, sorry.",
            "I notice this yesterday and then immediately forgot it again.",
            "It doesn't say LKB it says LG KB Gazeteer in the menu.",
            "Thank you very much.",
            "So click file, new processing resource large KB gazeteer.",
            "OK, another dialogue.",
            "Good.",
            "What we want to set is this dictionary path.",
            "OK.",
            "Ideally, if the network were working.",
            "We want to set up a directory that this path will point to that has two things.",
            "So let me just find my directory with the one that's working.",
            "Yeah, what you want is a directory that has two things.",
            "It has a config dot TTL and it has a query dot text.",
            "Both of them were on the USB stick.",
            "OK. Will take a look.",
            "To start with.",
            "At what could have been so nice, which is a sparkle query in query dot TXT.",
            "OK, can anyone read that?",
            "No, not at all.",
            "Can you make it bigger for me?",
            "If you if you open who's openquery dot TXT, found it and opened it in text editor.",
            "OK can you try and read what the query meet?",
            "What does so not just read it out, but try and work out what it does.",
            "No.",
            "Label of the person.",
            "Yeah yes, so every every query that we used to make this dollar gazeteer needs three things for every for every entity it needs a label that it's looking for.",
            "It needs the urri for linking and it needs the class for classification.",
            "So what we have here is a query that should run against that triple store over in cost us.",
            "That says, find me objects that depict people OK and it says the the current keeper of the object should be this Department whose identifier is why?",
            "A little bit of local knowledge.",
            "The Department that's got the code Y in the old scheme is our Department.",
            "Ancient Egypt and Sudan.",
            "OK so I'm looking for objects that are in the Egyptian Department and that depict people OK. And then I say double check the person has to be in the persons scheme according to scores.",
            "And it has to have, as you said, a preferred label.",
            "OK, so we're picking out the labels and the ur eyes for people represented on objects in the Egyptian Department.",
            "And then the last bit we didn't really show you this in sparkle, but you can just assign to a variable.",
            "So instead of querying for it, I'm just saying I've already checked all of these are in the class person.",
            "So in the person column of the query results.",
            "Tell me that class give me the urri of that class.",
            "OK, so.",
            "At this point we still don't have a network, so if you would like, you can run this query on the triplestore when it's iaccessible again.",
            "What I've done is already built a gazeteer using it, and for that I need the second file.",
            "I said we need query dot TXT and we need config dot turtle.",
            "The only thing to notice about my turtle file when I built this is that I used the research based sparkle endpoint you'll see on the on the memory stick you had another another config dot TTL called config kalamaki which has the IP address of the triple store that we currently can't talk to.",
            "OK sorry bout that.",
            "Are you?",
            "Do you have it?",
            "That can you talk to the sparkle?",
            "No no I can OK. Place OK, ask.",
            "The in scheme property in doing Oh yeah.",
            "So we didn't talk much about Scotts, but Scotts organizes concepts as we did say gives them preferred and alternative labels.",
            "We said it also as well as the matches that Maribel was talking about.",
            "Close match exact match.",
            "It also has broader and narrower so you can organize things into taxonomies.",
            "OK, each taxonomy belongs in a scheme, so we have a scheme.",
            "Four people, Dominic.",
            "Appoints back schools in post.",
            "OK, if you if you force me to so.",
            "I think Marvelle said I certainly encouraged her to say in some sense it's a little bit naughty to use costs for things that are instances of classes.",
            "Scott steals in concepts.",
            "So what we do with scars.",
            "Organizing things like materials into taxonomies is more or less unarguable, but we.",
            "Carry out the same treatment with people in places.",
            "Now people in places aren't concepts Dominick's not a concept.",
            "I'm not a concept.",
            "One could equally argue, though, here we're not dealing with real people.",
            "We're dealing with gods, which are conceptual.",
            "So I'm happy that soft and Osiris and Bar are concepts and that they are in a concept scheme according to scores.",
            "But it could be argued we shouldn't do that.",
            "The better way to do it, which I did tell one group yesterday, is to have a different resource for the concept.",
            "And something which is the subject of the concept.",
            "So instead of saying someone is at the same time or person and a concept, we could say there's the person that instance, and that there's some concept associated with them.",
            "Whose subject is that person that would be better modeling?",
            "Are you stalling for time?",
            "'cause I don't think it's going to help.",
            "Believe that something no.",
            "Well someone can.",
            "The network tech can.",
            "I yeah, So what I'm going to do is use a gazeteer, which I hope I still have that was built using that query.",
            "It's I wouldn't say that every literal that we have in our data is consistently formatted, but what I would say is if they're in a concept scheme, if they come from an authority, then they well formatted because someone in our documentation Department is actually made that term and approved it for curators and researchers to tag objects with.",
            "So we have some literals that are free text field.",
            "So you put in a curatorial comment.",
            "You can type whatever you like, but this is a controlled vocabulary in a scheme.",
            "So somebody has decided there is thought there is bar there is Rameez Rami.",
            "Is Rameses OK?",
            "So could I return all of those?",
            "What we do is use the literal to look for that little occurrence in the text and make an annotation with the class and the instance that is found OK, which would work reasonably well, but it also would ignore the part of speech, so things like may, which is in that list MA.",
            "Why?",
            "If it's used in a sentence where it's not a noun?",
            "Will be mistagged by that.",
            "So what we need to build is a pipeline that says do the part of speech tagging.",
            "Run the gazeteer and then use one of these transducers to say if something is a is a proper noun phrase and it has a look up with this UI in the class.",
            "Then we tag it as a God OK and then ultimately but this was beyond the hands on.",
            "Even if we were capable of finishing it.",
            "Export that as our DFA so our text turns into HTML.",
            "The problems that cost us.",
            "I'm still not sure why my machine that's plugged into the router is isn't visible anymore, but there's the brakes I should have taken you a screenshot to show that works reasonably well, and in fact it does.",
            "Yeah, everything that's everything that's a proper noun phrase, and that's in our list of gods, is annotated and very little else is Dominic told me to take a screenshot.",
            "When the networks back up, if you want to do this kind of NLP based on sparkle finding terms, then you can reproduce this.",
            "Or if you want to do more exotic pipelines, perhaps with machine learning, then Isabel is a good shooter.",
            "I think we should leave it at that and I should go get a glass of beer after your questions.",
            "So if we look at the annotation sets I it's just the gazeteer after we've run the gazeteer that we're struggling to build 'cause we can't run the sparkle.",
            "If you look at look up, you'll see all of the God names where they occur, annotated in the text, but many of them are annotated at the wrong part of speech.",
            "OK, so we've done nicely with the Cyrus Stuff and Horus, 'cause they're fairly unambiguous.",
            "But where we have, may we get it in all parts of speech?",
            "OK, so may may he enter praised, May he go forth, and these are not talking about May they're talking.",
            "Just a exhortation.",
            "OK, So what we want to do is combine the part of speech tag with this gazeteer markup.",
            "But that's not going to be easy, because this isn't a plain text document.",
            "This is an annotated document.",
            "It showed, but thinking on my feet, I'm not sure if I can do it.",
            "What we need to do this is a transducer that has Isabel mentioned Ajay Prol that looks through the annotations and says find me each one of these and look.",
            "Is there an annotation at the same place that this says is a proper noun phrase?",
            "If so, then making new annotation for that thing as a God?",
            "OK then we can ignore all the old annotation that paragraph.",
            "The sentence is the part of speech the roller cups.",
            "We ignore all of them, we just export gods as markup around the text using RDF A to point to that instance and class OK. Then we have a nicely our DFA annotated text that we can start doing Webby things with and that is something that we actively do.",
            "It's too late to do anything.",
            "I'm I'm going to ask for more questions then I'm going to let you really talk about her marine stuff.",
            "Any questions about what we could have done?",
            "OK, we can use Link data to find identifiers, labels and useful information about texts and combine that into NLP pipelines.",
            "To annotate text really against our data and enrich it.",
            "So Isabel started with this example about how we could use event detection.",
            "Well studied in NLP and look for events on the web.",
            "So for instance at the museum we could link to the Department hosting it the objects in the exhibition by looking through our web pages for those exhibitions without manual annotation.",
            "So question.",
            "So by running this far field yes yeah.",
            "And then we how do we connect it to the URL OK?",
            "'cause the sparkle has all three things, it has the label.",
            "It has the UI and it has the class, so that's the that builds the gazetteers dictionary so this is a gazetteer that does both things.",
            "It recognizes named entities and it links them at the same time because he has all that information.",
            "Well, that's a little bit theoretical at the moment.",
            "Using gate, it's easiest to export to microformats.",
            "There isn't a standard plugin for DFA export, but if you're listening, build on.",
            "Anymore questions.",
            "James stuff on the XML with change on scarf and present.",
            "So you see, you see entities that are well marked up that don't have all of these extra ones, OK?",
            "It says on paragraph nine it says, may you grant this is this is very good.",
            "So the end of the tutorial was going to be.",
            "There's two remaining errors that need some tweaking which are both easy to do with gates.",
            "The first one, you're absolutely right, we lose all of these maze in the middle of the sentence.",
            "But here there's one which is Miss Annotated still, and part of the reason for that is the pause tag.",
            "Is not correct that it identifies that as a proper noun phrase it's not difficult to tweak the vocabulary underneath the pause tagger and make sure that it knows that that's a determinant.",
            "Sorry, model.",
            "Modal thingy that Isabel just said that works.",
            "Can you spot the second error?",
            "That would be really good.",
            "We can see it already here actually.",
            "I know this looks different from yours.",
            "Look at a Cyrus Cyrus.",
            "Yeah, so when we just use the gas at work.",
            "So yeah, we just used the gazeteer here based on sparkle.",
            "A Cyrus was recognized so we tagged it up to here.",
            "There's a 11 somewhere I can't see it now.",
            "There's something hyphenated with two long names.",
            "And it annotates the whole string, which is correct.",
            "OK, in what you have after the transducer, we have Osiris- annotated but not the N. In fact a Cyrus N is the name that's being used for a Cyrus in this text.",
            "So we want to include the N as well.",
            "So we need to slightly change the splitting as well.",
            "So you changed the red X, you changed the precedence in the POS tagging and you get a perfectly annotated document, but that would have been homework anyway.",
            "We would never got that for.",
            "Why not thinking?",
            "Or almost the whole noun phrase instead of long enough?",
            "That's what that's what we do, but it's been the splitter isn't getting it right.",
            "It isn't recognizing that the end after the- is.",
            "The noun phrase, so we're fixing the linguistic side, not fixing the annotation.",
            "OK anymore questions so I'm going to hand over any.",
            "OK, so the Triple Store will be back up even if I've gotta hold cables together with my bare hands.",
            "So if you want to do some of this annotation with music or with museums, then I guarantee somehow will get it to work."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As Dominic mentioned, link linguistics is favorite of digital humanities so far, so I'm going to cannibalize some slides that I gave to their digital humanities group at UCL recently to give some context for where we're using linguistics technology at the British Museum, specifically with regard to the tools that Isabella was talking about, we had implemented something with an LTC in Python.",
                    "label": 0
                },
                {
                    "sent": "We thought it would be an interesting example as a hands-on to go with this, but gates.",
                    "label": 0
                },
                {
                    "sent": "Gives us a really nice point and click interface where we can achieve quite a lot just in terms of GUI.",
                    "label": 0
                },
                {
                    "sent": "So we re engineered it and I need to give full credit to Isabel and how one of our supervisors Diana for helping me with this because we actually achieve better results than we had ourselves in refactoring this for you.",
                    "label": 0
                },
                {
                    "sent": "I don't want to say too much about the application.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's the kind of thing I, Dominic, and I get excited about.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure how much we've excited you so far, but the Egyptian book of the Dead is a set of funerary texts.",
                    "label": 1
                },
                {
                    "sent": "OK, that were written when, especially when mummies were buried in ancient Egypt.",
                    "label": 0
                },
                {
                    "sent": "They are written in a couple of different scripts in hieroglyphics and in the word is gone entirely out of my head, Dominic.",
                    "label": 0
                },
                {
                    "sent": "I in the hieratic script, more alphabetic, less pictogram script.",
                    "label": 0
                },
                {
                    "sent": "We don't deal with ancient Egyptian NLP.",
                    "label": 0
                },
                {
                    "sent": "That'll be an interesting challenge.",
                    "label": 0
                },
                {
                    "sent": "What we deal with is translation into English.",
                    "label": 0
                },
                {
                    "sent": "The relationship of these translations to our objects.",
                    "label": 0
                },
                {
                    "sent": "So the object data we've talked about publishing and that you can get right here to our fixed authoritie's where we have lists of ancient places.",
                    "label": 0
                },
                {
                    "sent": "We have lists of.",
                    "label": 0
                },
                {
                    "sent": "Ancient gods, we have lists of materials that are used in the construction of objects.",
                    "label": 0
                },
                {
                    "sent": "So we're trying to find these kind of things in the English translation of spells worth mentioning, but I'm not going to belabor the point that I'll illustrate it with.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Key pedia there is no such thing as a Canonical book of the dead.",
                    "label": 0
                },
                {
                    "sent": "OK, this is an ancient artifact.",
                    "label": 0
                },
                {
                    "sent": "1 Two what actually comes down to us on the pierian?",
                    "label": 0
                },
                {
                    "sent": "The linens that we have in our music.",
                    "label": 0
                },
                {
                    "sent": "Our museum in the Louvre in the Getty are fragmented and then made by different schools across that Kingdom of Egypt, and they had diverged into different traditions.",
                    "label": 0
                },
                {
                    "sent": "So there's some sort of reconstructed core.",
                    "label": 0
                },
                {
                    "sent": "For what the book means and a division into numbered spells.",
                    "label": 0
                },
                {
                    "sent": "But in any given tradition, for instance, memphite around a certain region, there will be a certain idiom to how the spells are rendered and what they contain in terms of people and places and what they do.",
                    "label": 0
                },
                {
                    "sent": "OK, the early parts of the book are very mythology based, the later ones are very based on actual burial practices.",
                    "label": 0
                },
                {
                    "sent": "So if you place a certain amulets in the mummy.",
                    "label": 0
                },
                {
                    "sent": "Then he can be guaranteed of, you know, coming back to life.",
                    "label": 1
                },
                {
                    "sent": "That's what mummification was about.",
                    "label": 0
                },
                {
                    "sent": "Wikipedia, everyones favorite source, but it's not entirely accurate.",
                    "label": 0
                },
                {
                    "sent": "They say their most.",
                    "label": 0
                },
                {
                    "sent": "They say they Piri.",
                    "label": 0
                },
                {
                    "sent": "They're not exclusively Piri, they say they vary in what are called vignettes in the graphical illustration.",
                    "label": 0
                },
                {
                    "sent": "In fact, as I've said, the text varies a lot as well.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we work with this chap called Malcolm Marsha, who it's his scholarly work that we're trying to digitize and put online using linked data technologies.",
                    "label": 0
                },
                {
                    "sent": "He's translated in his first volume, spells 1 to 16.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "He's an interesting guy.",
                    "label": 0
                },
                {
                    "sent": "If you Google him, you find an HP or Hewlett Packard profile for him, titled Egyptologist, a senior software designer.",
                    "label": 0
                },
                {
                    "sent": "If you read on a bit, I got very excited that in 1988 he was working on RDF.",
                    "label": 0
                },
                {
                    "sent": "But back.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "1998 that wasn't the Resource description framework.",
                    "label": 0
                },
                {
                    "sent": "It was something entirely separate, called the Remote Duplicate Database Facility.",
                    "label": 0
                },
                {
                    "sent": "All the same, it's a nice hook to talk to him about the technology we use.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Skip that picture.",
                    "label": 0
                },
                {
                    "sent": "Nobody needs to see me so you know we have data on objects.",
                    "label": 0
                },
                {
                    "sent": "So what was that one that is a papyrus representation of?",
                    "label": 0
                },
                {
                    "sent": "Part of the book?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You know we have a sparkle endpoint, so this is a really crude query to see more or less how many of these things do we have about 1500 objects that are related to the book of.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Guide the slides are available so you can look at these here query to look what materials are those things made from.",
                    "label": 0
                },
                {
                    "sent": "Well, mostly papyrus but one in 10 of them are on linen and then you have all kinds of other material in their construction.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But what we also publish is our authorities.",
                    "label": 0
                },
                {
                    "sent": "This list of people, places, materials, cultures, etc.",
                    "label": 0
                },
                {
                    "sent": "So if we start with the God Osiris, either someone could have given you the you are I in some RDF or otherwise, or you can do a text search for him.",
                    "label": 0
                },
                {
                    "sent": "You'll see we've got a record with RDF about a Cyrus.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Even just on the website you can see things like there's a depiction relationship in the CRM, so we can find all kinds of objects that represent a Cyrus.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And indeed, RDF's are good fit for that.",
                    "label": 0
                },
                {
                    "sent": "I don't think I need to explain more about RDF modeling relationships well.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just to remind you that this ontology that Dominic mentioned as any ontology provides properties and classes.",
                    "label": 0
                },
                {
                    "sent": "If you're using this data, interesting to know the P numbers of the properties that the numbers of the classes, and there are a lot of them but Domino.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Showed you this is a nice diagram, especially if you want to work with the data.",
                    "label": 0
                },
                {
                    "sent": "Nice to some people.",
                    "label": 0
                },
                {
                    "sent": "This shows all of the different relationships.",
                    "label": 0
                },
                {
                    "sent": "From the object in the center where we can express different parts of what we know about our objects, including the acquisition, the production, where it's House, which Department it's in, so we're going to use such a query over our data to find the gods that are depicted in Egyptian Department items and then use that to source a gazeteer in an NLP pipeline shortly in the hands on.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm going to.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Skip some detail.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So on.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Pulling that stuff.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So you can go ahead and look at.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I pass these slides off to.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Dominic on Sir.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Search that was data on it.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nation where you can actually go to the data and say maybe that's not a Cyrus.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's raw and you give your argument for it.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Was as Dominic said, image annotation where you go to an image of the thing, draw this box and use that for an annotation and say that is a representation of a Cyrus.",
                    "label": 1
                },
                {
                    "sent": "OK, but increasingly what we're needing to do and what we need to do with Marsha's work is not look at data that's already in RDF is not.",
                    "label": 0
                },
                {
                    "sent": "Look at images but actually to annotate text that continuous text in a manuscript like these translations.",
                    "label": 0
                },
                {
                    "sent": "So there's a few more slides on how we could represent that for the web.",
                    "label": 0
                },
                {
                    "sent": "But you may already know from Maribel's talk yesterday what those semantic Web answer is.",
                    "label": 0
                },
                {
                    "sent": "If you want to annotate text and publish it on the web.",
                    "label": 0
                },
                {
                    "sent": "Our DFA OK, so our choice is the end of our pipeline is.",
                    "label": 0
                },
                {
                    "sent": "We'd like to.",
                    "label": 0
                },
                {
                    "sent": "We'd like to persist out the results of the natural language processing as our DFA for the web aligner.",
                    "label": 0
                },
                {
                    "sent": "So without further ado we should do some hands on 'cause I'm very keen that you do this.",
                    "label": 0
                },
                {
                    "sent": "We put a lot of work into building this.",
                    "label": 0
                },
                {
                    "sent": "It depends on having gate installed.",
                    "label": 0
                },
                {
                    "sent": "As I've said a couple of times today.",
                    "label": 0
                },
                {
                    "sent": "Is there anyone who hasn't managed to install gate yet?",
                    "label": 0
                },
                {
                    "sent": "Do you have the USB key to do it?",
                    "label": 0
                },
                {
                    "sent": "You OK 'cause the second thing is good.",
                    "label": 0
                },
                {
                    "sent": "That was the one hand the USB keys that you have installed from.",
                    "label": 0
                },
                {
                    "sent": "Can you please pass them back towards Elena 'cause we need them for the next hands-on session this afternoon?",
                    "label": 0
                },
                {
                    "sent": "Know that there was one hand last chance to say you haven't installed it.",
                    "label": 0
                },
                {
                    "sent": "I'm still you're still doing it, but you're in progress.",
                    "label": 0
                },
                {
                    "sent": "We should also say you don't only need gayden Java, so if you already have that, you will also need the book of the dead folder because it contains a readme you won't need.",
                    "label": 0
                },
                {
                    "sent": "Sorry bout that, yes.",
                    "label": 0
                },
                {
                    "sent": "So did you copy as well the folder BOTD?",
                    "label": 0
                },
                {
                    "sent": "Even if you didn't get it from the USB stick, it is on the file server, as are many other things.",
                    "label": 0
                },
                {
                    "sent": "Let me try and find that for you.",
                    "label": 0
                },
                {
                    "sent": "I can't read across there, we've got 192.",
                    "label": 0
                },
                {
                    "sent": "16821 and that's accessed using FTP, so we should put in FTP: double slash 19216821.",
                    "label": 0
                },
                {
                    "sent": "Everybody is going to be in a slightly different place depending on your operating system.",
                    "label": 0
                },
                {
                    "sent": "the Mac puts it under applications so I can start gate from here are people seeing this splash screen or dead already been throughout?",
                    "label": 0
                },
                {
                    "sent": "Anybody got a problem getting to the splash screen?",
                    "label": 0
                },
                {
                    "sent": "You won't see this application, by the way, should have deleted that.",
                    "label": 0
                },
                {
                    "sent": "OK, so if you get past the splash screen and get to here raise your hand.",
                    "label": 0
                },
                {
                    "sent": "Not everybody, it's it's empty.",
                    "label": 0
                },
                {
                    "sent": "I already have some resources I should have closed it right down.",
                    "label": 0
                },
                {
                    "sent": "OK, so do you also have the readme dot TXT file?",
                    "label": 0
                },
                {
                    "sent": "It might be I'm going to do everything with you, but if you miss a step I'll keep numbering the steps.",
                    "label": 0
                },
                {
                    "sent": "If I had my tablet dominant, can you grab my tablet?",
                    "label": 0
                },
                {
                    "sent": "So we've got a number of steps.",
                    "label": 0
                },
                {
                    "sent": "Number one was indeed open gate.",
                    "label": 0
                },
                {
                    "sent": "So what's next?",
                    "label": 0
                },
                {
                    "sent": "Install gates, sorry.",
                    "label": 0
                },
                {
                    "sent": "Was number one instruction number two start gates.",
                    "label": 0
                },
                {
                    "sent": "We've got their instruction number three.",
                    "label": 0
                },
                {
                    "sent": "We mentioned both of us that Annie is a named entity Information extraction pipeline, so there is a ready made application.",
                    "label": 0
                },
                {
                    "sent": "If you go to the gate menu.",
                    "label": 0
                },
                {
                    "sent": "So if you go to the file menu and look under ready made applications.",
                    "label": 0
                },
                {
                    "sent": "Annie.",
                    "label": 0
                },
                {
                    "sent": "We can make a new Annie application.",
                    "label": 0
                },
                {
                    "sent": "OK, that will take a second to load.",
                    "label": 0
                },
                {
                    "sent": "And then you see on the left the one thing that you've probably got underneath the groups.",
                    "label": 0
                },
                {
                    "sent": "Under application, you've now got a new one called Annie.",
                    "label": 0
                },
                {
                    "sent": "You could rename that if you want, but I'm happy that it's called Annie.",
                    "label": 0
                },
                {
                    "sent": "OK, if you double click on it you can see this down there.",
                    "label": 0
                },
                {
                    "sent": "Right hand side is the pipeline.",
                    "label": 0
                },
                {
                    "sent": "The ready defined pipeline.",
                    "label": 0
                },
                {
                    "sent": "So of those tasks that Isabel was talking about.",
                    "label": 0
                },
                {
                    "sent": "The tokenization the use of a gazeteer sentence splitter.",
                    "label": 0
                },
                {
                    "sent": "Part of speech.",
                    "label": 0
                },
                {
                    "sent": "Pause tagging OK. All of this is ready made for you OK.",
                    "label": 0
                },
                {
                    "sent": "Hands up if you're seeing this.",
                    "label": 0
                },
                {
                    "sent": "We're still doing reasonably well if you're having trouble, apart from when I say hands up, put your hand up and Isabel will come help you.",
                    "label": 0
                },
                {
                    "sent": "If you fall behind on you.",
                    "label": 0
                },
                {
                    "sent": "OK, so next step you see underneath applications we have language resource is yours I believe are empty.",
                    "label": 0
                },
                {
                    "sent": "OK right click on language resources and we're going to make a new gate corpus.",
                    "label": 0
                },
                {
                    "sent": "OK Corpus is the term linguists always used for a collection of documents.",
                    "label": 0
                },
                {
                    "sent": "Its plural is corpora.",
                    "label": 0
                },
                {
                    "sent": "That's even more.",
                    "label": 0
                },
                {
                    "sent": "Affected, let's call our corpus BRTD for book of the Dead.",
                    "label": 0
                },
                {
                    "sent": "OK, so we have we said.",
                    "label": 0
                },
                {
                    "sent": "Under language resources, New Gate Corpus we get this dialogue and under the name field we're just going to call it book of the Dead so we know what we're dealing with.",
                    "label": 0
                },
                {
                    "sent": "If you click OK. You'll see that that appears under language resource is OK. Now you can right click that.",
                    "label": 0
                },
                {
                    "sent": "And say, populate.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "I'm going too quickly.",
                    "label": 0
                },
                {
                    "sent": "Who's with me?",
                    "label": 0
                },
                {
                    "sent": "Who's got who's now gotta corpus?",
                    "label": 0
                },
                {
                    "sent": "OK, good, so right click on your corpus and say populate we get this dialog.",
                    "label": 0
                },
                {
                    "sent": "The top fields called Directory directory URL and it has this Finder button beside it.",
                    "label": 0
                },
                {
                    "sent": "Use the Finder button to point to the spells directory that under the book of the Dead Directory.",
                    "label": 0
                },
                {
                    "sent": "OK, either on the file server or what you copied from the USB stick OK.",
                    "label": 0
                },
                {
                    "sent": "So if I go to your equivalent, yeah under book of the dead.",
                    "label": 0
                },
                {
                    "sent": "We click spells not double Click to open it, but we click spells to say we want the whole directory full of spells.",
                    "label": 0
                },
                {
                    "sent": "We choose that.",
                    "label": 0
                },
                {
                    "sent": "And OK. And now we've populated this book of the Dead corpus with a number of spells.",
                    "label": 0
                },
                {
                    "sent": "OK, it's 10 files.",
                    "label": 0
                },
                {
                    "sent": "I believe it's three spells, but for there for the 1st and the last spells, we have four different versions for different traditions.",
                    "label": 0
                },
                {
                    "sent": "OK, the second spell in the book of the Dead is so short that there's very little variation, so we have one version.",
                    "label": 0
                },
                {
                    "sent": "OK, but we have men fight, and all of the other.",
                    "label": 0
                },
                {
                    "sent": "Traditions whose names I've forgotten but Spell 1 and Spell 3.",
                    "label": 0
                },
                {
                    "sent": "OK, everyone with me so far apart from the hands.",
                    "label": 0
                },
                {
                    "sent": "Yeah, Dick DS store is not going to process very well.",
                    "label": 0
                },
                {
                    "sent": "You can you can remove that if you're on a Mac like me and it's being populated.",
                    "label": 0
                },
                {
                    "sent": "OK, so like say there's 10 useful documents on a DS store.",
                    "label": 0
                },
                {
                    "sent": "I know there's nine useful documents in a DS store can't count 4 + 4 + 1, that's where I was going wrong.",
                    "label": 0
                },
                {
                    "sent": "OK, so now we're going to double click.",
                    "label": 0
                },
                {
                    "sent": "Are you OK?",
                    "label": 0
                },
                {
                    "sent": "Hands up if you're having trouble.",
                    "label": 0
                },
                {
                    "sent": "Is that?",
                    "label": 0
                },
                {
                    "sent": "So I was like OK, you bet you if you look at the readme dot tag there's there's a step she should be able to catch up by help, or is it can help you in trouble.",
                    "label": 0
                },
                {
                    "sent": "No problem, just try to Windows.",
                    "label": 0
                },
                {
                    "sent": "Some files are not properly displayed on windows.",
                    "label": 0
                },
                {
                    "sent": "Ouch, Ouch, Ouch.",
                    "label": 0
                },
                {
                    "sent": "I notice this with the Mac, so this is what happens if you double click on book of the Dead version one.",
                    "label": 0
                },
                {
                    "sent": "The Mac doesn't do this absolutely perfectly, 'cause that's supposed to be a paragraph symbol that isn't rendered correctly on Windows, especially if you're not using English.",
                    "label": 0
                },
                {
                    "sent": "There might be another Unicode problem, so sorry, you might have to just follow what I'm doing on the projection.",
                    "label": 0
                },
                {
                    "sent": "What we have at the moment is just plain text.",
                    "label": 0
                },
                {
                    "sent": "OK, this is marsha's translation of this spell and you see, he said in the spell there's things like beginning of the spells it announces itself.",
                    "label": 0
                },
                {
                    "sent": "In this preamble you see at the end of this sentence we mentioned a God already a Cyrus.",
                    "label": 0
                },
                {
                    "sent": "OK, words spoken by Osiris.",
                    "label": 0
                },
                {
                    "sent": "Can I see any other gods here?",
                    "label": 0
                },
                {
                    "sent": "I can see Horus.",
                    "label": 0
                },
                {
                    "sent": "OK, So what we're trying to do?",
                    "label": 0
                },
                {
                    "sent": "Is both classify those as gods?",
                    "label": 0
                },
                {
                    "sent": "Recognize them as named entities, classify them as gods and link them to our link data about gods.",
                    "label": 0
                },
                {
                    "sent": "And then later we would do the same for places, an for materials, etc.",
                    "label": 0
                },
                {
                    "sent": "If you click on annotation sets at the top, does everyone see that?",
                    "label": 0
                },
                {
                    "sent": "OK click on annotation sets.",
                    "label": 0
                },
                {
                    "sent": "You'll see all with all that we have is original markup.",
                    "label": 0
                },
                {
                    "sent": "So if you click paragraph, which is all the markup we have, then each one of those is a paragraph.",
                    "label": 0
                },
                {
                    "sent": "OK, it's good, but it's not NLP OK, it's just looking at the plain text.",
                    "label": 0
                },
                {
                    "sent": "So what we do now is double Click to go back to our application.",
                    "label": 0
                },
                {
                    "sent": "OK, and you'll see at the bottom.",
                    "label": 0
                },
                {
                    "sent": "We have this field called corpus.",
                    "label": 0
                },
                {
                    "sent": "And we just created one.",
                    "label": 0
                },
                {
                    "sent": "So we select this book of the Dead corpus.",
                    "label": 0
                },
                {
                    "sent": "And run the application.",
                    "label": 0
                },
                {
                    "sent": "OK, I don't want to do too many steps at once.",
                    "label": 0
                },
                {
                    "sent": "Click for the corpus and then Click to run the application.",
                    "label": 0
                },
                {
                    "sent": "Work from there.",
                    "label": 0
                },
                {
                    "sent": "No, no, this was a ready made application.",
                    "label": 0
                },
                {
                    "sent": "So if you have a look here on the right, you should already have that pipeline that I have.",
                    "label": 0
                },
                {
                    "sent": "That's fine, Oh yeah sorry.",
                    "label": 0
                },
                {
                    "sent": "I have some more of those than the ones in the pipeline because I've already.",
                    "label": 0
                },
                {
                    "sent": "I already had some applications.",
                    "label": 0
                },
                {
                    "sent": "For you, everything that you have all of their what gate cause processing resource is all of them that are loaded at the moment because you just started from fresh air in your pipeline.",
                    "label": 0
                },
                {
                    "sent": "OK so when we say run this application it will run this pipeline over this corpus.",
                    "label": 0
                },
                {
                    "sent": "OK, so I'm going to go ahead and do that now.",
                    "label": 0
                },
                {
                    "sent": "So running over 11 documents because I still have that Mac file there.",
                    "label": 0
                },
                {
                    "sent": "If I go back to be D1V1 so the first version of Spell 1.",
                    "label": 0
                },
                {
                    "sent": "With annotation sets displayed on the right hand side, you'll see now in addition to the original markup.",
                    "label": 0
                },
                {
                    "sent": "We have all of these new things, dates, locations, things that Isabel was talking about.",
                    "label": 0
                },
                {
                    "sent": "OK, one of those is person OK and we are treating gods as people.",
                    "label": 0
                },
                {
                    "sent": "The distinctions are subtle one.",
                    "label": 0
                },
                {
                    "sent": "So if you click for person, these are the annotations that the automatic pipeline has made.",
                    "label": 0
                },
                {
                    "sent": "OK, some of them are goat.",
                    "label": 0
                },
                {
                    "sent": "I'm struggling to find 1 thoughhh soft is a God and he's been correctly recognized.",
                    "label": 0
                },
                {
                    "sent": "OK, Noble.",
                    "label": 0
                },
                {
                    "sent": "Is in our thesaurus, but it's the wrong.",
                    "label": 0
                },
                {
                    "sent": "It's not actually naming a God, it's used as the word Noble, so it's fallen to this ambiguity.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So the point so far is the default pipeline, as we kind of predicted, is not that good at our task, even though we have well written text by a scholar who had an editor's mark.",
                    "label": 0
                },
                {
                    "sent": "As Marco was pointing out also for his text.",
                    "label": 0
                },
                {
                    "sent": "The entity recognition has not been great.",
                    "label": 0
                },
                {
                    "sent": "You are with me so far.",
                    "label": 0
                },
                {
                    "sent": "Yeah, happy.",
                    "label": 0
                },
                {
                    "sent": "Show of hands if you're happy, so far that we've annotated some gods very good.",
                    "label": 0
                },
                {
                    "sent": "Annotated them fairly badly.",
                    "label": 0
                },
                {
                    "sent": "It has to be said OK, next step, double click on your application again to go back and see what the pipeline is.",
                    "label": 0
                },
                {
                    "sent": "And I'm going to say this generic gazeteer that was used.",
                    "label": 0
                },
                {
                    "sent": "I want to remove from the pipeline, so I click it.",
                    "label": 0
                },
                {
                    "sent": "And then I click this button to take it out of the window on the right hand side, take it out of the pipeline, the gazetteer.",
                    "label": 0
                },
                {
                    "sent": "So remove the gazeteer from the pipeline, remove.",
                    "label": 0
                },
                {
                    "sent": "The named entity transducer.",
                    "label": 0
                },
                {
                    "sent": "From the pipeline.",
                    "label": 0
                },
                {
                    "sent": "And remove the author matcher.",
                    "label": 0
                },
                {
                    "sent": "Since I'm calling heavily.",
                    "label": 0
                },
                {
                    "sent": "OK, so I want you to cut down your pipeline so you just have a reset at the start, so we're dealing with the documents afresh, a tokenizer, a sentence splitter, and a part of speech tagger OK. Everyone with me ready to move on.",
                    "label": 0
                },
                {
                    "sent": "OK, I'm going to.",
                    "label": 0
                },
                {
                    "sent": "Run their application again with this reduced pipeline over the same corpus.",
                    "label": 0
                },
                {
                    "sent": "Which is quicker because it's doing less OK.",
                    "label": 0
                },
                {
                    "sent": "So now if you go back to your document.",
                    "label": 0
                },
                {
                    "sent": "Again, I'll just go for Spell 1 version one.",
                    "label": 0
                },
                {
                    "sent": "We have fewer annotations because we haven't tried to do that.",
                    "label": 0
                },
                {
                    "sent": "Any named entity recognition.",
                    "label": 0
                },
                {
                    "sent": "OK. Full instruction I'm going to save that file once it's been annotated as XML.",
                    "label": 0
                },
                {
                    "sent": "OK, so pick one of the spells.",
                    "label": 0
                },
                {
                    "sent": "Preferably Spell 1 version one.",
                    "label": 0
                },
                {
                    "sent": "Then you can follow what I'm doing.",
                    "label": 0
                },
                {
                    "sent": "Save it as XML.",
                    "label": 0
                },
                {
                    "sent": "Hello.",
                    "label": 0
                },
                {
                    "sent": "Oh no.",
                    "label": 0
                },
                {
                    "sent": "I think it's frozen.",
                    "label": 0
                },
                {
                    "sent": "Sorry, we've been having problems with this Mac.",
                    "label": 0
                },
                {
                    "sent": "I can't right click.",
                    "label": 0
                },
                {
                    "sent": "No, nothing is frozen.",
                    "label": 0
                },
                {
                    "sent": "How do I can you close it for me?",
                    "label": 0
                },
                {
                    "sent": "OK, so if yours is still running unlike mine, can you save that spell as XML and then open up the XML in a text editor?",
                    "label": 0
                },
                {
                    "sent": "Whichever one you like?",
                    "label": 0
                },
                {
                    "sent": "OK. Now if you search in your text editor for this, God, thoughhh, THOTH.",
                    "label": 0
                },
                {
                    "sent": "OK, did you find self in that document?",
                    "label": 0
                },
                {
                    "sent": "The first instance where you found it is is the spell, but you'll see there's lots of XML tags around it.",
                    "label": 0
                },
                {
                    "sent": "Try again here.",
                    "label": 0
                },
                {
                    "sent": "So save as XML.",
                    "label": 0
                },
                {
                    "sent": "Great.",
                    "label": 0
                },
                {
                    "sent": "I'll call mine book The Dead 1 version One dot XML.",
                    "label": 0
                },
                {
                    "sent": "I'll find that.",
                    "label": 0
                },
                {
                    "sent": "There we go.",
                    "label": 0
                },
                {
                    "sent": "Open that in Xcode, yes, OK, so we're looking at the XML, so this is the annotated document.",
                    "label": 0
                },
                {
                    "sent": "And as I said, search 4th off.",
                    "label": 0
                },
                {
                    "sent": "THOTH it's in the it's in the spell, but the spells hard to read now 'cause we've got all of this mark up all of the elements that are used.",
                    "label": 0
                },
                {
                    "sent": "It just called node OK. Those mark places in the text around tokens.",
                    "label": 0
                },
                {
                    "sent": "OK so you can see that's off.",
                    "label": 0
                },
                {
                    "sent": "The first time he appears.",
                    "label": 0
                },
                {
                    "sent": "At the start is 267 and at the end is 272, so we've got those nodes to mark the start and end of thought.",
                    "label": 0
                },
                {
                    "sent": "If we search now for the start tag for the 267 and the easiest way because there's lots of 267 in the middle of things is to put quotes around it.",
                    "label": 0
                },
                {
                    "sent": "OK. Look for 267 in quotes.",
                    "label": 0
                },
                {
                    "sent": "And find the second instance of that.",
                    "label": 0
                },
                {
                    "sent": "So the first one is where we just were worse off appears in the spell.",
                    "label": 0
                },
                {
                    "sent": "The next time it appears.",
                    "label": 0
                },
                {
                    "sent": "Where within an annotation OK. And that annotation has a number of features.",
                    "label": 0
                },
                {
                    "sent": "What we found about that part of the text.",
                    "label": 0
                },
                {
                    "sent": "Including that it's a string.",
                    "label": 0
                },
                {
                    "sent": "I. Oh sorry, I'm on the wrong one, but it's a string down there that its length is 5.",
                    "label": 0
                },
                {
                    "sent": "That it starts with a capital.",
                    "label": 0
                },
                {
                    "sent": "That's the string.",
                    "label": 0
                },
                {
                    "sent": "It stuff OK, and you remember Isabel showed this thing called Penn Tree.",
                    "label": 0
                },
                {
                    "sent": "It was a classification of the parts of speech.",
                    "label": 0
                },
                {
                    "sent": "OK, the part of speech for software.",
                    "label": 0
                },
                {
                    "sent": "It appears the first time is an NP.",
                    "label": 0
                },
                {
                    "sent": "That's a noun phrase, and NP specifically.",
                    "label": 0
                },
                {
                    "sent": "A proper noun phrase.",
                    "label": 0
                },
                {
                    "sent": "OK, so its role in the sentence is a noun, and it's a proper noun.",
                    "label": 0
                },
                {
                    "sent": "It names something OK, so the part of speech could actually do much better than we did before in the pipeline at predicting whether we have a God or not.",
                    "label": 0
                },
                {
                    "sent": "OK, but at the same time we want to interlink.",
                    "label": 0
                },
                {
                    "sent": "Now there's a small problem on the network at the moment.",
                    "label": 0
                },
                {
                    "sent": "In order to build a gazeteer by sparkle we need to be able to talk to a sparkle endpoint.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Reviewing we took this default pipeline with default named entity recognition, found it didn't perform very well, but part of the pipeline was standard linguistic stuff like tokenizing, splitting and finding the part of speech.",
                    "label": 0
                },
                {
                    "sent": "Part of speech looks really useful to us in improving that because it finds proper noun phrases reliably OK because we want to now adopt this approach that Isabel was talking about where we build a gazetteer with known terms.",
                    "label": 0
                },
                {
                    "sent": "OK, and one that links to link data that actually has ur identifiers for each one of those terms.",
                    "label": 0
                },
                {
                    "sent": "We're going to build a gazetteer using a sparkle query.",
                    "label": 0
                },
                {
                    "sent": "OK, use it to mark up the text, annotate the text and then combine it with part of speech.",
                    "label": 0
                },
                {
                    "sent": "So the first part of that I already have one loaded, but you don't, so you need to go to the jigsaw icon which is managed plugins.",
                    "label": 0
                },
                {
                    "sent": "Look down the list and you'll find something called gazeteer.",
                    "label": 0
                },
                {
                    "sent": "LKB is called that large knowledge base gazeteer OK Click to load that you can load it always.",
                    "label": 0
                },
                {
                    "sent": "OK, let me show you that again.",
                    "label": 0
                },
                {
                    "sent": "Click on the jigsaw on this one.",
                    "label": 0
                },
                {
                    "sent": "From the right icon.",
                    "label": 0
                },
                {
                    "sent": "You get the list.",
                    "label": 0
                },
                {
                    "sent": "And you want to Click to load always gazeteer LKB.",
                    "label": 0
                },
                {
                    "sent": "We have to.",
                    "label": 0
                },
                {
                    "sent": "I know you should load it dynamically.",
                    "label": 0
                },
                {
                    "sent": "So any problem?",
                    "label": 0
                },
                {
                    "sent": "I do it again.",
                    "label": 0
                },
                {
                    "sent": "It doesn't add it to your pipeline, by the way, don't expect it to immediately add it to your pipeline as long as as long as you said apply then you can close.",
                    "label": 0
                },
                {
                    "sent": "So apply close.",
                    "label": 0
                },
                {
                    "sent": "And now it's about it's loaded, so it's available to put into our pipeline.",
                    "label": 0
                },
                {
                    "sent": "So we can go to new processing resource OK and in your list Now you should have.",
                    "label": 0
                },
                {
                    "sent": "Did I just not click apply?",
                    "label": 0
                },
                {
                    "sent": "Oh yes, yeah, sorry.",
                    "label": 0
                },
                {
                    "sent": "I notice this yesterday and then immediately forgot it again.",
                    "label": 0
                },
                {
                    "sent": "It doesn't say LKB it says LG KB Gazeteer in the menu.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "So click file, new processing resource large KB gazeteer.",
                    "label": 0
                },
                {
                    "sent": "OK, another dialogue.",
                    "label": 0
                },
                {
                    "sent": "Good.",
                    "label": 0
                },
                {
                    "sent": "What we want to set is this dictionary path.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Ideally, if the network were working.",
                    "label": 0
                },
                {
                    "sent": "We want to set up a directory that this path will point to that has two things.",
                    "label": 0
                },
                {
                    "sent": "So let me just find my directory with the one that's working.",
                    "label": 0
                },
                {
                    "sent": "Yeah, what you want is a directory that has two things.",
                    "label": 0
                },
                {
                    "sent": "It has a config dot TTL and it has a query dot text.",
                    "label": 0
                },
                {
                    "sent": "Both of them were on the USB stick.",
                    "label": 0
                },
                {
                    "sent": "OK. Will take a look.",
                    "label": 0
                },
                {
                    "sent": "To start with.",
                    "label": 0
                },
                {
                    "sent": "At what could have been so nice, which is a sparkle query in query dot TXT.",
                    "label": 0
                },
                {
                    "sent": "OK, can anyone read that?",
                    "label": 0
                },
                {
                    "sent": "No, not at all.",
                    "label": 0
                },
                {
                    "sent": "Can you make it bigger for me?",
                    "label": 0
                },
                {
                    "sent": "If you if you open who's openquery dot TXT, found it and opened it in text editor.",
                    "label": 0
                },
                {
                    "sent": "OK can you try and read what the query meet?",
                    "label": 0
                },
                {
                    "sent": "What does so not just read it out, but try and work out what it does.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "Label of the person.",
                    "label": 0
                },
                {
                    "sent": "Yeah yes, so every every query that we used to make this dollar gazeteer needs three things for every for every entity it needs a label that it's looking for.",
                    "label": 0
                },
                {
                    "sent": "It needs the urri for linking and it needs the class for classification.",
                    "label": 0
                },
                {
                    "sent": "So what we have here is a query that should run against that triple store over in cost us.",
                    "label": 0
                },
                {
                    "sent": "That says, find me objects that depict people OK and it says the the current keeper of the object should be this Department whose identifier is why?",
                    "label": 0
                },
                {
                    "sent": "A little bit of local knowledge.",
                    "label": 0
                },
                {
                    "sent": "The Department that's got the code Y in the old scheme is our Department.",
                    "label": 0
                },
                {
                    "sent": "Ancient Egypt and Sudan.",
                    "label": 0
                },
                {
                    "sent": "OK so I'm looking for objects that are in the Egyptian Department and that depict people OK. And then I say double check the person has to be in the persons scheme according to scores.",
                    "label": 0
                },
                {
                    "sent": "And it has to have, as you said, a preferred label.",
                    "label": 0
                },
                {
                    "sent": "OK, so we're picking out the labels and the ur eyes for people represented on objects in the Egyptian Department.",
                    "label": 0
                },
                {
                    "sent": "And then the last bit we didn't really show you this in sparkle, but you can just assign to a variable.",
                    "label": 0
                },
                {
                    "sent": "So instead of querying for it, I'm just saying I've already checked all of these are in the class person.",
                    "label": 0
                },
                {
                    "sent": "So in the person column of the query results.",
                    "label": 0
                },
                {
                    "sent": "Tell me that class give me the urri of that class.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "At this point we still don't have a network, so if you would like, you can run this query on the triplestore when it's iaccessible again.",
                    "label": 0
                },
                {
                    "sent": "What I've done is already built a gazeteer using it, and for that I need the second file.",
                    "label": 0
                },
                {
                    "sent": "I said we need query dot TXT and we need config dot turtle.",
                    "label": 0
                },
                {
                    "sent": "The only thing to notice about my turtle file when I built this is that I used the research based sparkle endpoint you'll see on the on the memory stick you had another another config dot TTL called config kalamaki which has the IP address of the triple store that we currently can't talk to.",
                    "label": 0
                },
                {
                    "sent": "OK sorry bout that.",
                    "label": 0
                },
                {
                    "sent": "Are you?",
                    "label": 0
                },
                {
                    "sent": "Do you have it?",
                    "label": 0
                },
                {
                    "sent": "That can you talk to the sparkle?",
                    "label": 0
                },
                {
                    "sent": "No no I can OK. Place OK, ask.",
                    "label": 0
                },
                {
                    "sent": "The in scheme property in doing Oh yeah.",
                    "label": 0
                },
                {
                    "sent": "So we didn't talk much about Scotts, but Scotts organizes concepts as we did say gives them preferred and alternative labels.",
                    "label": 0
                },
                {
                    "sent": "We said it also as well as the matches that Maribel was talking about.",
                    "label": 0
                },
                {
                    "sent": "Close match exact match.",
                    "label": 0
                },
                {
                    "sent": "It also has broader and narrower so you can organize things into taxonomies.",
                    "label": 0
                },
                {
                    "sent": "OK, each taxonomy belongs in a scheme, so we have a scheme.",
                    "label": 0
                },
                {
                    "sent": "Four people, Dominic.",
                    "label": 0
                },
                {
                    "sent": "Appoints back schools in post.",
                    "label": 0
                },
                {
                    "sent": "OK, if you if you force me to so.",
                    "label": 0
                },
                {
                    "sent": "I think Marvelle said I certainly encouraged her to say in some sense it's a little bit naughty to use costs for things that are instances of classes.",
                    "label": 0
                },
                {
                    "sent": "Scott steals in concepts.",
                    "label": 0
                },
                {
                    "sent": "So what we do with scars.",
                    "label": 0
                },
                {
                    "sent": "Organizing things like materials into taxonomies is more or less unarguable, but we.",
                    "label": 0
                },
                {
                    "sent": "Carry out the same treatment with people in places.",
                    "label": 0
                },
                {
                    "sent": "Now people in places aren't concepts Dominick's not a concept.",
                    "label": 0
                },
                {
                    "sent": "I'm not a concept.",
                    "label": 0
                },
                {
                    "sent": "One could equally argue, though, here we're not dealing with real people.",
                    "label": 0
                },
                {
                    "sent": "We're dealing with gods, which are conceptual.",
                    "label": 0
                },
                {
                    "sent": "So I'm happy that soft and Osiris and Bar are concepts and that they are in a concept scheme according to scores.",
                    "label": 0
                },
                {
                    "sent": "But it could be argued we shouldn't do that.",
                    "label": 0
                },
                {
                    "sent": "The better way to do it, which I did tell one group yesterday, is to have a different resource for the concept.",
                    "label": 0
                },
                {
                    "sent": "And something which is the subject of the concept.",
                    "label": 0
                },
                {
                    "sent": "So instead of saying someone is at the same time or person and a concept, we could say there's the person that instance, and that there's some concept associated with them.",
                    "label": 0
                },
                {
                    "sent": "Whose subject is that person that would be better modeling?",
                    "label": 0
                },
                {
                    "sent": "Are you stalling for time?",
                    "label": 0
                },
                {
                    "sent": "'cause I don't think it's going to help.",
                    "label": 0
                },
                {
                    "sent": "Believe that something no.",
                    "label": 0
                },
                {
                    "sent": "Well someone can.",
                    "label": 0
                },
                {
                    "sent": "The network tech can.",
                    "label": 0
                },
                {
                    "sent": "I yeah, So what I'm going to do is use a gazeteer, which I hope I still have that was built using that query.",
                    "label": 0
                },
                {
                    "sent": "It's I wouldn't say that every literal that we have in our data is consistently formatted, but what I would say is if they're in a concept scheme, if they come from an authority, then they well formatted because someone in our documentation Department is actually made that term and approved it for curators and researchers to tag objects with.",
                    "label": 0
                },
                {
                    "sent": "So we have some literals that are free text field.",
                    "label": 0
                },
                {
                    "sent": "So you put in a curatorial comment.",
                    "label": 0
                },
                {
                    "sent": "You can type whatever you like, but this is a controlled vocabulary in a scheme.",
                    "label": 0
                },
                {
                    "sent": "So somebody has decided there is thought there is bar there is Rameez Rami.",
                    "label": 0
                },
                {
                    "sent": "Is Rameses OK?",
                    "label": 0
                },
                {
                    "sent": "So could I return all of those?",
                    "label": 0
                },
                {
                    "sent": "What we do is use the literal to look for that little occurrence in the text and make an annotation with the class and the instance that is found OK, which would work reasonably well, but it also would ignore the part of speech, so things like may, which is in that list MA.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "If it's used in a sentence where it's not a noun?",
                    "label": 0
                },
                {
                    "sent": "Will be mistagged by that.",
                    "label": 0
                },
                {
                    "sent": "So what we need to build is a pipeline that says do the part of speech tagging.",
                    "label": 0
                },
                {
                    "sent": "Run the gazeteer and then use one of these transducers to say if something is a is a proper noun phrase and it has a look up with this UI in the class.",
                    "label": 0
                },
                {
                    "sent": "Then we tag it as a God OK and then ultimately but this was beyond the hands on.",
                    "label": 0
                },
                {
                    "sent": "Even if we were capable of finishing it.",
                    "label": 0
                },
                {
                    "sent": "Export that as our DFA so our text turns into HTML.",
                    "label": 0
                },
                {
                    "sent": "The problems that cost us.",
                    "label": 0
                },
                {
                    "sent": "I'm still not sure why my machine that's plugged into the router is isn't visible anymore, but there's the brakes I should have taken you a screenshot to show that works reasonably well, and in fact it does.",
                    "label": 0
                },
                {
                    "sent": "Yeah, everything that's everything that's a proper noun phrase, and that's in our list of gods, is annotated and very little else is Dominic told me to take a screenshot.",
                    "label": 0
                },
                {
                    "sent": "When the networks back up, if you want to do this kind of NLP based on sparkle finding terms, then you can reproduce this.",
                    "label": 0
                },
                {
                    "sent": "Or if you want to do more exotic pipelines, perhaps with machine learning, then Isabel is a good shooter.",
                    "label": 0
                },
                {
                    "sent": "I think we should leave it at that and I should go get a glass of beer after your questions.",
                    "label": 0
                },
                {
                    "sent": "So if we look at the annotation sets I it's just the gazeteer after we've run the gazeteer that we're struggling to build 'cause we can't run the sparkle.",
                    "label": 0
                },
                {
                    "sent": "If you look at look up, you'll see all of the God names where they occur, annotated in the text, but many of them are annotated at the wrong part of speech.",
                    "label": 0
                },
                {
                    "sent": "OK, so we've done nicely with the Cyrus Stuff and Horus, 'cause they're fairly unambiguous.",
                    "label": 0
                },
                {
                    "sent": "But where we have, may we get it in all parts of speech?",
                    "label": 0
                },
                {
                    "sent": "OK, so may may he enter praised, May he go forth, and these are not talking about May they're talking.",
                    "label": 0
                },
                {
                    "sent": "Just a exhortation.",
                    "label": 0
                },
                {
                    "sent": "OK, So what we want to do is combine the part of speech tag with this gazeteer markup.",
                    "label": 0
                },
                {
                    "sent": "But that's not going to be easy, because this isn't a plain text document.",
                    "label": 0
                },
                {
                    "sent": "This is an annotated document.",
                    "label": 0
                },
                {
                    "sent": "It showed, but thinking on my feet, I'm not sure if I can do it.",
                    "label": 0
                },
                {
                    "sent": "What we need to do this is a transducer that has Isabel mentioned Ajay Prol that looks through the annotations and says find me each one of these and look.",
                    "label": 0
                },
                {
                    "sent": "Is there an annotation at the same place that this says is a proper noun phrase?",
                    "label": 0
                },
                {
                    "sent": "If so, then making new annotation for that thing as a God?",
                    "label": 0
                },
                {
                    "sent": "OK then we can ignore all the old annotation that paragraph.",
                    "label": 0
                },
                {
                    "sent": "The sentence is the part of speech the roller cups.",
                    "label": 0
                },
                {
                    "sent": "We ignore all of them, we just export gods as markup around the text using RDF A to point to that instance and class OK. Then we have a nicely our DFA annotated text that we can start doing Webby things with and that is something that we actively do.",
                    "label": 0
                },
                {
                    "sent": "It's too late to do anything.",
                    "label": 0
                },
                {
                    "sent": "I'm I'm going to ask for more questions then I'm going to let you really talk about her marine stuff.",
                    "label": 0
                },
                {
                    "sent": "Any questions about what we could have done?",
                    "label": 0
                },
                {
                    "sent": "OK, we can use Link data to find identifiers, labels and useful information about texts and combine that into NLP pipelines.",
                    "label": 0
                },
                {
                    "sent": "To annotate text really against our data and enrich it.",
                    "label": 0
                },
                {
                    "sent": "So Isabel started with this example about how we could use event detection.",
                    "label": 0
                },
                {
                    "sent": "Well studied in NLP and look for events on the web.",
                    "label": 0
                },
                {
                    "sent": "So for instance at the museum we could link to the Department hosting it the objects in the exhibition by looking through our web pages for those exhibitions without manual annotation.",
                    "label": 0
                },
                {
                    "sent": "So question.",
                    "label": 0
                },
                {
                    "sent": "So by running this far field yes yeah.",
                    "label": 0
                },
                {
                    "sent": "And then we how do we connect it to the URL OK?",
                    "label": 0
                },
                {
                    "sent": "'cause the sparkle has all three things, it has the label.",
                    "label": 0
                },
                {
                    "sent": "It has the UI and it has the class, so that's the that builds the gazetteers dictionary so this is a gazetteer that does both things.",
                    "label": 0
                },
                {
                    "sent": "It recognizes named entities and it links them at the same time because he has all that information.",
                    "label": 0
                },
                {
                    "sent": "Well, that's a little bit theoretical at the moment.",
                    "label": 0
                },
                {
                    "sent": "Using gate, it's easiest to export to microformats.",
                    "label": 0
                },
                {
                    "sent": "There isn't a standard plugin for DFA export, but if you're listening, build on.",
                    "label": 0
                },
                {
                    "sent": "Anymore questions.",
                    "label": 0
                },
                {
                    "sent": "James stuff on the XML with change on scarf and present.",
                    "label": 0
                },
                {
                    "sent": "So you see, you see entities that are well marked up that don't have all of these extra ones, OK?",
                    "label": 0
                },
                {
                    "sent": "It says on paragraph nine it says, may you grant this is this is very good.",
                    "label": 0
                },
                {
                    "sent": "So the end of the tutorial was going to be.",
                    "label": 0
                },
                {
                    "sent": "There's two remaining errors that need some tweaking which are both easy to do with gates.",
                    "label": 0
                },
                {
                    "sent": "The first one, you're absolutely right, we lose all of these maze in the middle of the sentence.",
                    "label": 0
                },
                {
                    "sent": "But here there's one which is Miss Annotated still, and part of the reason for that is the pause tag.",
                    "label": 0
                },
                {
                    "sent": "Is not correct that it identifies that as a proper noun phrase it's not difficult to tweak the vocabulary underneath the pause tagger and make sure that it knows that that's a determinant.",
                    "label": 0
                },
                {
                    "sent": "Sorry, model.",
                    "label": 0
                },
                {
                    "sent": "Modal thingy that Isabel just said that works.",
                    "label": 0
                },
                {
                    "sent": "Can you spot the second error?",
                    "label": 0
                },
                {
                    "sent": "That would be really good.",
                    "label": 0
                },
                {
                    "sent": "We can see it already here actually.",
                    "label": 0
                },
                {
                    "sent": "I know this looks different from yours.",
                    "label": 0
                },
                {
                    "sent": "Look at a Cyrus Cyrus.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so when we just use the gas at work.",
                    "label": 0
                },
                {
                    "sent": "So yeah, we just used the gazeteer here based on sparkle.",
                    "label": 0
                },
                {
                    "sent": "A Cyrus was recognized so we tagged it up to here.",
                    "label": 0
                },
                {
                    "sent": "There's a 11 somewhere I can't see it now.",
                    "label": 0
                },
                {
                    "sent": "There's something hyphenated with two long names.",
                    "label": 0
                },
                {
                    "sent": "And it annotates the whole string, which is correct.",
                    "label": 0
                },
                {
                    "sent": "OK, in what you have after the transducer, we have Osiris- annotated but not the N. In fact a Cyrus N is the name that's being used for a Cyrus in this text.",
                    "label": 0
                },
                {
                    "sent": "So we want to include the N as well.",
                    "label": 0
                },
                {
                    "sent": "So we need to slightly change the splitting as well.",
                    "label": 0
                },
                {
                    "sent": "So you changed the red X, you changed the precedence in the POS tagging and you get a perfectly annotated document, but that would have been homework anyway.",
                    "label": 0
                },
                {
                    "sent": "We would never got that for.",
                    "label": 0
                },
                {
                    "sent": "Why not thinking?",
                    "label": 0
                },
                {
                    "sent": "Or almost the whole noun phrase instead of long enough?",
                    "label": 0
                },
                {
                    "sent": "That's what that's what we do, but it's been the splitter isn't getting it right.",
                    "label": 0
                },
                {
                    "sent": "It isn't recognizing that the end after the- is.",
                    "label": 0
                },
                {
                    "sent": "The noun phrase, so we're fixing the linguistic side, not fixing the annotation.",
                    "label": 0
                },
                {
                    "sent": "OK anymore questions so I'm going to hand over any.",
                    "label": 0
                },
                {
                    "sent": "OK, so the Triple Store will be back up even if I've gotta hold cables together with my bare hands.",
                    "label": 0
                },
                {
                    "sent": "So if you want to do some of this annotation with music or with museums, then I guarantee somehow will get it to work.",
                    "label": 0
                }
            ]
        }
    }
}