{
    "id": "7zrdtplfop4nzsyzjl47so4qctjjgvo5",
    "title": "Introduction to Modal Logic",
    "info": {
        "author": [
            "Rajeev P. Goré, Australian National University"
        ],
        "published": "April 1, 2009",
        "recorded": "January 2009",
        "category": [
            "Top->Computer Science->Logic"
        ]
    },
    "url": "http://videolectures.net/ssll09_gore_iml/",
    "segmentation": [
        [
            "OK sorry bout this guys.",
            "Pretty people were a bit jealous they put away the camera so we had to go and retrieve the camera.",
            "So what is it now?",
            "It's a quarter past.",
            "I'll try to finish on time still, but we might need to.",
            "Hurry along, maybe I if I'm gonna hurry.",
            "I'm going to 2nd lecture because this first lecture is really vital.",
            "OK, so stop me at anytime if you want to ask questions.",
            "I'm happy to go through things more slowly if you don't understand.",
            "Can you please give me an idea how many of you have a background in first order logic?",
            "Not not what you've seen just over the last three days, but how many of you have seen it before?",
            "How many of you seem logic before OK?",
            "How many of you had seen modal logic?",
            "OK. How many of you are PhD students?",
            "How many of you are undergraduates?",
            "Advanced undergraduates.",
            "OK, fine.",
            "How many of you are computer scientists?",
            "How many of you are mathematics mathematics students or mathematician philosophy?",
            "OK couple alright, So what I usually find is that the technical backgrounds of different disciplines differ.",
            "OK, so if I say some mumbo jumbo that you don't understand, just put up your hand and I'll try and explain it on the board.",
            "Nothing is difficult.",
            "OK, this lecture nothing is difficult, it's really easy.",
            "So if you're finding it hard going, stopping 'cause I'm not getting through somewhere.",
            "OK, my name is Rajiv Goro by the way.",
            "And."
        ],
        [
            "OK, so.",
            "The history of modal logic.",
            "Modern history of modal logic goes back to about 1920.",
            "Have you all got these lecture slides?",
            "By the way, right?",
            "So what I'm going to do is I'm going to draw pictures on here that go with the slides, so don't copy that anything that's on the slides.",
            "Maybe copy down the pictures.",
            "OK, but you're better off if you just listen.",
            "So CI Lewis was looking for CS Lewis is the guy who wrote the line, the Witch and the Wardrobe.",
            "By the way, this is a different person.",
            "He was looking for a non trip functional notion called a necessarily implies B, which he wrote using this strange notation.",
            "See if this works.",
            "Yes no.",
            "No K. Here is there 1 here.",
            "No.",
            "It's like, OK, fine.",
            "Alright.",
            "So what he was trying to do was restart.",
            "This is a new modern technology.",
            "You see that funding is short over here.",
            "He was trying to find a explanation of this guy and he wanted to mean something like this.",
            "It's impossible for A to be true and B to be false.",
            "So what is the right capital P of a 2 mean?",
            "Something like hey is possible and then he worked through the following and I did do this at some stage.",
            "Maybe not now, but just convince yourself that this works right?",
            "So if you negate then this says something like a is impossible alright because the negation is right next to the possible.",
            "OK, then you put a negation in here and then all you're doing is replacing that a with the negation.",
            "So not is impossible.",
            "So then what he did is to say, well, let's define another connective, and he'd redefined this in and said A is necessary.",
            "Right, So what he's saying is if A is necessary then not a is impossible.",
            "Right, there's no way that you can make it false.",
            "That's why it's necessary.",
            "OK, now if you follow this again, hopefully this makes sense.",
            "So we start off here.",
            "We're trying to define this and he defined necessarily a SB as this, so he's just replaced this this A with a bigger formula.",
            "The implication now this is classical implication right now you do this and push all this through.",
            "So I replace that with and then I replace A implies B by not A or B because it's classical implication.",
            "Now I can push this negation sign in.",
            "So that negation cancels there, that becomes an A.",
            "The negation makes this an end, and the negation comes in, sits next to here.",
            "So what I'm hoping is that this stuff in green you should be able to reuse something like that.",
            "Right, it's impossible.",
            "For A to be true and B to be false.",
            "OK.",
            "This is 2 minutes of you know 50 years of philosophy, so please take this with a reasonable Greiner.",
            "Do your reading.",
            "If you're from philosophy and you really want to know the details now the strange thing is that these actions of you know, a strictly implies a necessarily implies B didn't actually Jaune they caught on in philosophy.",
            "But the main thing that caught on and mainly in computer science since the 60s, and mainly the reason 90s is this notion.",
            "That P is possible and any necessary.",
            "So it's the unary operators PNN that gave rise to modal logic and the strict patient has sort of fallen by the wayside, at least in computer science and maths.",
            "But I'm sure it's important in philosophy, OK?",
            "Alright.",
            "Any questions?"
        ],
        [
            "So this whole lecture and modal logic is about graphs.",
            "All of these directed graphs, a set of nodes and some edges between them.",
            "OK, so I just want to fix some notation so that I can use it for free and you have to stop me now if you don't understand this.",
            "Alright, so what's a directed graph?",
            "It's a set of nodes V and some edges between them.",
            "So here's some nodes venor V1V2.",
            "Etc.",
            "Can you see this up the back?",
            "By the way, this is fairly faint.",
            "Let me try to find another one and then some edges S1T1S2T2 from source vertex to target vertex right so that S1T one is to be just some of these nodes, but I don't want to use particular V notes and V ones 'cause I'm just spelling it generally.",
            "OK, So what am I going to do?",
            "There might be an edge between this guy and this guy, so the pair is going to be V nought V1.",
            "OK, that pair is going to be in the set of images.",
            "Now the cross product V CrossFit West Theory just stands for the set of all ordered pairs VW where these little from the set of vertices and little WS from the set of vertices.",
            "OK, so you give me a set of numbers and once the cross product here it's going to be something like V nought V1.",
            "The nought V2.",
            "V1V nought can you see the picture?",
            "I'm just going to take put veinotte in every position in the first one go through all the rotations of that one, then put V1 in the first position and go through all the rotations of that one.",
            "Sorry.",
            "Yep, sorry I forgot one right.",
            "You can put that one of course.",
            "Now, by directing what I mean is that there is an error.",
            "OK, so the arrow goes from V to W, so this edge is that arrow.",
            "The nought to V nought.",
            "Is that arrow.",
            "The two to be not V2 is that arrow and so on.",
            "OK, not difficult so far.",
            "What I'm going to talk about is a binary relation.",
            "Semantics is about binary relations, and I'm going to say that this notation.",
            "Here.",
            "Something is a subset of the cross.",
            "V is a binary relation over V. What does that mean?",
            "So VV says you take all possible arrows.",
            "I might have missed some here, right?",
            "So you have to tell me, have I missed any arrows?",
            "This is very cross V to the set of all errors.",
            "And I'm going to say that R is a subset of the cross V, So what are?",
            "Right, we cross V is a set of edges.",
            "Pairs like this.",
            "And if I take a subset of them.",
            "How far is a subset of these edges?",
            "What am I doing to this cross V?",
            "Baby powder yeah so doing right?",
            "I'm saying very cross these everything crossed with everything the set of all those ordered pairs are is a set of ordered pairs which is a subset of that.",
            "So all it is is it's just not all the edges.",
            "But some of them.",
            "So some of them are gone.",
            "Of course, it may be that power is equal to V across the right, so it can be all of them, but in general it's some subset.",
            "That's it, that's Kripke semantics.",
            "OK, now the rest of the lecture is going to try and fill you in on WHI modal logics.",
            "Propositional logic is the logic of Kripke frames or the logic of graphs.",
            "Why they thought?",
            "Well, imagine you've got a computer which doesn't action and it stays in the same state you've got this thing.",
            "Another action it moves to another state, right?",
            "So lots of systems can be described by, you know, object in a state and moving to a different state.",
            "That's why it's good in computer science, any questions?",
            "Deliberately going slowly.",
            "I'm going to speed up, but I don't want to lose you now.",
            "So for those of you already know this, sorry you just sit there and I don't know do something else for awhile.",
            "Any questions?",
            "OK."
        ],
        [
            "OK, now I'm going to try and use consistent notation for my concepts that I'm introducing.",
            "It's not necessarily the same notation as the other lecture is all use, so be careful.",
            "Alright?",
            "I don't necessarily use notation in the same way.",
            "But pick me up if I.",
            "Don't use it consistently.",
            "OK, what I want to try and do is tell you story.",
            "Something like this that if you want.",
            "If you want to think of logic, you can think of it.",
            "There are two strands to logic, and I'm going to say that it's syntax together with either a semantics or a calculus.",
            "OK, so here's the syntax.",
            "Pending on your point of view.",
            "Then you can either look at the semantic point of view and those two are enough to define a logic or.",
            "At.",
            "Calculus.",
            "Does it done at these lights enough?",
            "You can see this country OK and by calculus what I mean is purely syntactic manipulations, right?",
            "Just fiddling symbols.",
            "What we find is that usually we know what sort of intended semantics we have.",
            "We know what we want these graphs to mean and what we formula to me.",
            "So usually we formulate a logic by giving an exact syntax for the formula so that it's a formal language different from natural language.",
            "And then we give some meaning to the semantics to Philly.",
            "And what we try and do is we then try and find a calculus that matches the notions, because a computer can then do these.",
            "Purely syntactic manipulations, right?",
            "You'll see this theme coming through.",
            "OK, so the syntax is something that allows us to build formula right?",
            "So down here I'm going to define the notion of formula.",
            "And.",
            "Again, a set of finite collection gamma is going to be a set of assumptions.",
            "Now, semantics is.",
            "A way of saying when.",
            "Fire is a logical consequence of gamma.",
            "So what I'm after in this lecture is I want some notion of truth of a formula.",
            "When is the formula true?",
            "I want some notion of a model, but at the end of the day.",
            "So at the end of the lecture I'm after this notion.",
            "Written with double, there's an equals here, right?",
            "Fire is a logical consequence of gamma.",
            "So I know what it means for gamma to be true in a model, and I'm going to decide whether define where the fire is true in the model of gamoran.",
            "Alright.",
            "Now in calculate what we do is we take the same thing.",
            "We take a set of formula gamma.",
            "Some assumptions are given formula Five and now we talk about things like say rule of inference.",
            "Right rules of inference.",
            "You should have seen these things in the previous lectures.",
            "I just want to try and separate them outright.",
            "Rules of inference duction or a derivation.",
            "OK, what am I to hear?",
            "He's a syntactic notion.",
            "Five has a deduction from Gamma or Phis, deducible from gamma purely syntactically just symbol shuffling, notion of truth.",
            "No notion of model, and then what we try and do is we try and show that these two things coincide, so One Direction.",
            "If every deduction is correct.",
            "That's usually known as soundness.",
            "And completeness says whenever fareisa logical consequence of gamma, then you will be able to find a deduction of five from gamma, right?",
            "So there's that direction.",
            "So you should have seen in your previous lectures the notions of soundness and completeness.",
            "Yes.",
            "OK, so most of most of all of this you've already seen before.",
            "I just want to try and put it into part.",
            "Placeholders for you, right?",
            "So when I'm talking about the semantics when I'm talking about the model theory, you shouldn't see this and I shouldn't be saying anything like deduction or rule or.",
            "Syntactic manipulation, if I do then pick me up when I move over there then I shouldn't be talking about truth or model.",
            "Alright, so I'll try and keep that those concepts separate.",
            "And then you've got interesting properties that you can prove.",
            "For example, consistency says.",
            "You can't deduce 5 from gamma.",
            "It was deduced not far from gamma, right?",
            "That's usually not, not.",
            "It's not a healthy sign, right?",
            "Decidability.",
            "Is there an algorithm we know when fire is a logical consequence of gamma?",
            "Is there an algorithm to decide it on a computer?",
            "What's its complexity?",
            "Can you implement it efficiently on a computer?",
            "Those are the sorts of things that you're going to see.",
            "Probably this afternoon, actually, right?",
            "There's an automated reasoning course starting this afternoon, OK?",
            "Questions.",
            "Alright."
        ],
        [
            "Fine so.",
            "The syntax of modal logic.",
            "I'm here and I'm trying to define what formula, yeah, what a formula.",
            "Well, there are some atomic formula, I'll call them P, not P1P2.",
            "There's an infinite supply of them, they're countable 'cause it helps me later on.",
            "In other words, I can tell you I can put them in a well order, say peanut P1P2, but you could reverse the order if we wanted to whatever you wanted to do, and then I say that out of these atomic formula you build bigger formally.",
            "This is just classical logic, right?",
            "This is this is just classical propositional logic.",
            "There is an implication, junction, and disjunction and negation.",
            "Yes.",
            "Yeah OK, all I'm doing now is I'm saying that Diamond Phi is a formula and box Pfizer formula.",
            "So read this as one symbol right?",
            "It's not [] [] here.",
            "Just read it as one symbol.",
            "The reason why I've done it that way is because later on I want to put things inside the inside.",
            "These separators.",
            "OK so Diamond is a formula and box by the formula.",
            "So I claim that this is a formula, why?",
            "What's the claim box?",
            "P nought implies is it P2?",
            "Yes, right.",
            "Why is it a formula 'cause what I can do is I can use this package now for deposit right?",
            "So what do I say?",
            "It's a binary connective and I've got a P2 there.",
            "This is altogether, so I've got a box here.",
            "Annan underneath that I've gotta pee nought.",
            "Right now you start at the bottom.",
            "Is this a formula?",
            "Yes, 'cause it's an Atom.",
            "Is this a formula?",
            "Yes, it's an Atom.",
            "Is this a formula?",
            "Yes, it's box of the formula.",
            "Box of a formula and I already know that peanut is a formula.",
            "Then what's this?",
            "It's a binary connective, and what is it?",
            "What it wants?",
            "A formula on the left and a formula on the right?",
            "Is this a formula?",
            "Yes, I just passed that to be a formula.",
            "Is this a formula?",
            "Yes, I just passed that to be a formula, right?",
            "Just draw a formation tree and work through it.",
            "Box.",
            "Yes, Yep so.",
            "Bracketed, think of the bracketing this way.",
            "Right rather than.",
            "This way.",
            "So the box grabs onto its argument more tightly than time than implication does.",
            "You slowly pick up these things as the lecture progresses anyway, So what I'd like you to do is just convince yourself that some of these other things are formulated as well.",
            "Now in modal logic we rarely deal with actual formula.",
            "We deal with shapes.",
            "Sometimes they're called schemers and what I want to do there, you say that when you have a shape then you start using formula variables like Phi and PSI so.",
            "Box fire implies Phi is a shape because I can substitute any formula I like here, right?",
            "So if I wanted to, I could take this whole thing and put it in there and as long as I put the same thing in there, I get it a formula.",
            "Alright, So what we're going to do is we're going to instantiate.",
            "The shapes and the magic word is uniformly.",
            "OK, so the example box peanut implies P2.",
            "So box Peanut implies P2.",
            "I claim this thing is not an instance of that, why?",
            "Sorry.",
            "Right?",
            "OK, so uniformly the fire has to be the same thing, right?",
            "This fire is P nought.",
            "But now we're saying, well, actually we changed our mind when we went from one side of the arrow to the other.",
            "OK, that's all.",
            "Just wherever you see fire, it has to be the same thing wherever you see sigh.",
            "It can be different from fight.",
            "It can be the same as far if you want as well.",
            "Alright, so again, convince yourself that these schema things work and sometimes I want to count the length of the formula so it's just going to be the the number of symbols in it.",
            "Assuming that these guys P, not P2, etc or all of length one, so I want this to be together right?",
            "It's not 1 two, it's this is of length one.",
            "This is of length one, then this is love length 2 then this is of length 4.",
            "OK.",
            "Questions.",
            "OK.",
            "I beg your pardon.",
            "No, it's not graph theory, it's just.",
            "They traditionally called schema right?",
            "Whereas if you have no background whatsoever in logic, which is what sometimes happens here, then oh, what's a schema?",
            "You know, it sounds very it, and by shape what I'm trying to get across is this idea of uniformity, right?",
            "A shape is something that's the same everywhere.",
            "So far is a shape, and if you see the same shape in two places, you've got to instantiate it in the same way.",
            "It's just something that I made up which other people other people use it as well, but you.",
            "See it more and more recently in introductory logic textbooks.",
            "OK, because not everyone has a background in, say, philosophy anymore, right?",
            "So all of these?",
            "All terms of schemas and substitution instances and things like that.",
            "They just don't have the background.",
            "OK, any other questions?",
            "Alright."
        ],
        [
            "Fine, so now this lecture is all about the Kripke semantics for modal logic.",
            "It's named after a guy called Saul Kripke, who made major contributions.",
            "He basically showed that modal logic has a semantics in terms of graphs K from 1920.",
            "Remember CI Lewis modal logic was a healthy discipline using only syntax.",
            "There was no nice semantics and Kripke came along in about 55 I think 54.",
            "I've got the details at the end of the lectures if you want to look and he said, oh, this is really the modal logic of graphs.",
            "So it's named after Saul Kripke.",
            "What are we trying to do?",
            "We're trying to define these notions like truth and model model with a D not modal within a remember OK. And what we want to do is try and define the notion of when fires a logical consequence of gamma and prove some properties about logical consequence.",
            "And I'll try and wrap up by about 10:00 o'clock today if I can, but.",
            "Again, this is not the lecture where we should be taking shortcuts.",
            "Alright, so if I go over will just delay the break a little bit or something.",
            "I hope you're amenable to that."
        ],
        [
            "OK. What's a Kripke frame?",
            "I'm just gonna let you read some of that first.",
            "So you've got the ingredients already.",
            "OK, a Kripke frame is a directed graph WR.",
            "So instead of using V for the vertices, I'm just going to use W and there's this.",
            "R is a subset of W cross W, right?",
            "So W is going to be a set of points W cross W is the complete graph where you put all the edges in and then R is just.",
            "You.",
            "Go back and delete some of them.",
            "The R is just a. Kripke frame is just a directed graph.",
            "What's a valuation on a Kripke frame?",
            "Well, it's a map.",
            "It looks complicated, but it's not.",
            "All it is is.",
            "So now I'm just going to rename these guys, I'm just am I using these know I'm using W so I'm just going to go back and rewrite these as WS so that we're using the same notation.",
            "2.",
            "And now what's a valuation?",
            "A valuation is a map from every atomic formula to true and false, either true or else false.",
            "At every point.",
            "So a simple way of thinking about it is this.",
            "Imagine where at this point you just write out your atomic formula P nought P1P2... and then you go through and under these you just decide.",
            "Is it true or false?",
            "Maybe it's true.",
            "Maybe it's false whatever.",
            "OK, and you do the same thing over here.",
            "So for every so evaluation says, you give me a world and I'll give you back the formula that the atomic formula that are true there.",
            "So here we are again P, not P1P2... and here's a valuation might be different, so suppose it switches.",
            "It's exactly the opposite.",
            "That's perfectly legal, and you know the more worlds you have, the more variation you can make.",
            "Does that make sense?",
            "Doesn't make sense, OK?",
            "OK, W nought is a set of worlds.",
            "OK, so it's the vertices.",
            "Right, so this is called.",
            "The point is called W, not the point is called W one and the point is called W2 and P nought is our language of formula.",
            "OK, remember up here."
        ],
        [
            "Up the top.",
            "They were the atomic formula.",
            "OK, So what I'm saying is that we build, formulate out of these atomic formula P, not P1P2.",
            "They can't be broken down any further, OK and we build formula.",
            "Using these connectives OK, so we build more and more complicated formation trees like this.",
            "OK, now when we go so in classical logic, which we've seen before, what do we do?",
            "What we do is we take a valuation and say just ignore this.",
            "For the moment we just take a valuation and say peanut is true or P1P1 is false or whatever.",
            "Right?",
            "In classical logic we only have one valuation in modal logic what we do?",
            "Just build that over a graph.",
            "What we say is imagine you have a valuation of the atoms to true and false.",
            "Right now you have a Kripke frame, which is a graph.",
            "Two separate things.",
            "OK, so syntax was formulated.",
            "Kripke frame is sitting here, so the word frame should be sitting here under semantics.",
            "OK, it's just a graph.",
            "And now we're tying them together, so WR is the graph.",
            "Here WR is the graph part.",
            "OK, that's sitting here.",
            "As a frame.",
            "And evaluation.",
            "Where is it?",
            "The valuation here says, whenever you give me a W and one of the atoms.",
            "So this is your P, not P1P2.",
            "Whenever you give me a pair, which is a point and an Atom, I'll tell you whether that Atom is true at that point or not, right?",
            "So?",
            "That's right, yeah, sorry, yeah, yeah, right, that's right.",
            "Yeah, sorry I should.",
            "Yeah I should have.",
            "I should have made that clear.",
            "Sorry, right.",
            "So what I'm saying is that the valuation is such that P nought is true at W 1.",
            "Pay one is false at W1P2 is false it W one, and so on, and then if you go over here the valuations is P nought is false at W2, so they're different.",
            "P1 is true at W2, so again, they're different.",
            "P2 is true, it W2, so again there different that it has to be different.",
            "They could be the same.",
            "Hey, it's just the valuation just says you give me a world and an Atom and I'll tell you either true or false at that world order.",
            "OK. And what's the Kripke model, right?",
            "Remember, I'm after this notion of a model.",
            "It's just a frame and a valuation, so let me write valuation here somewhere as well.",
            "And a model is a frame in a valuation together.",
            "And I'll go through this example now.",
            "OK, so let's have a look.",
            "Let's redraw this so.",
            "What I want to do is, again, I'm happy to go through this more slowly, because if you don't get this then the rest of the lectures are.",
            "Just gonna fly past.",
            "OK, So what do we have?",
            "I'm saying that the frame that's the W in the R consists of what's written up there, so I have three points W nought, W1 and W2.",
            "I'll try and write them the same way.",
            "Green is not a good color.",
            "OK, this one is going to be called W nought.",
            "And this one is going to be called W one, and this one is going to be called W2.",
            "Yes, OK, and now what do we have?",
            "We look up what the graph is.",
            "Graph parts is there's an age that points from W nought to W 1.",
            "There's an edge that points from W, not W 1.",
            "There's an age that points from W nought to W2 is an edge that points from W not to W, and that's all we have.",
            "OK, and now I've written up some stuff which looks complicated.",
            "But I just needed to fit it on the slide.",
            "What am I saying?",
            "I'm saying that the only information I'm telling you is that P3 is true at W 1.",
            "P3 is true at W one.",
            "OK, so.",
            "He is pain or P1P2P3.",
            "I'm telling you that.",
            "P3 is true at W 1.",
            "Now what I'm trying to say there is that this is just shorthand notation 'cause I've got it.",
            "I can't write out valuations infinitely right?",
            "There's an infinite number of atoms.",
            "So what I mean is for all the other things you should just assign false.",
            "OK, so when you.",
            "So first of all, what you should do is you should assign false to all the other guys at W 1 right?",
            "All these guys are now false.",
            "Then if you go to W2.",
            "What I mean is.",
            "Just assign false there as well, and similarly over here it's just a shorthand notation which allows me to.",
            "OK. Now.",
            "So that's this bit.",
            "For any Atom P at W nought.",
            "Value is false.",
            "For alpian atoms, right?",
            "If you come to W nought.",
            "All the atoms are false.",
            "That's all that I'm trying to say here.",
            "If you come to W 1 then they're all false, except if it's P3.",
            "That's all I'm saying there, and if you come to W2 then they are the same.",
            "It's the false again everywhere, right?",
            "So these two guys actually have the same valuation.",
            "That doesn't make them the same as far as the Kripke semantics is concerned, right there?",
            "Two different points.",
            "They have the same valuation, that's OK. Alright, now let's work through something.",
            "What's the truth?",
            "Value of Diamond P1 at W not?",
            "I haven't told you.",
            "Right?",
            "I haven't told you how to evaluate anything larger than atomic formula.",
            "So you can't answer those questions at the moment."
        ],
        [
            "Now we'll go through the recursion steps that we need.",
            "What have I just drawn up tell tell me another way of saying what's on that board or on that slide?",
            "Is there anything modal up there?",
            "Is there anything to do with boxes and don't put your password?",
            "Exactly, it's just a different way of writing up truth tables.",
            "I've seen this is classical propositional logic.",
            "It says the negation of a formula is true at W exactly when the fire underneath is false, it W. It's just a truth table for negation.",
            "Just flip right?",
            "Truth table for conjunction says W makes the conjunction true exactly when it makes each of the conjunct true.",
            "It's just the truth table again.",
            "And disjunction is the same and all I'm doing here is, I'm just pointing out that I'm just rewriting the fireplace size, not file aside, Yep.",
            "Yeah, so I've left on lifting the function now."
        ],
        [
            "So good question.",
            "So here the V was defined to be world cross atoms.",
            "OK so over here you saw World Cross Adam World Cross Adam or Cross Adam and suddenly I switch to larger formula case on lifting the function up the larger formula but I have to tell you how to lift it and this is the way you do it."
        ],
        [
            "OK, so now what we can talk about is we can talk about the truth value of a larger formula at these worlds as long as it's a classical formula, what do you do?",
            "Just use the truth tables, right?",
            "So imagine that there's a truth table attached to every one of these.",
            "For classical logic, So what have we got?",
            "We've got some sort of distributed classical logic, right?",
            "We've got copies of classical logic in different places, with arcs connecting them.",
            "Really, that's all it is.",
            "It's all of these.",
            "Every world is a valuation on the atoms which tells you exactly how the classical connectors behave at that world.",
            "OK, so everything is true functional.",
            "Right?",
            "It's still truth tables."
        ],
        [
            "Now is where we move to the non truth functional part.",
            "So how do we evaluate Diamond and Box now?",
            "This slide is slightly different to what's on your notes because I just wasn't happy with the way I'd written these clauses on the notes.",
            "They were a bit confusing, right?",
            "So you might want to just change it to that.",
            "It's up to you.",
            "Hopefully you should see the meaning.",
            "OK, so now I'm going to.",
            "I'm not going to explain that I'm going to go to the example and the example is the same as up here, right?",
            "So here we are.",
            "What's the truth value of Diamond P3 at W nought the truth value of.",
            "Dime where's W not here.",
            "OK, the truth.",
            "Value of Diamond P3.",
            "At W 9, how do we evaluate it?",
            "Well, we go through the clauses we say.",
            "W Note is this guy.",
            "OK, Diamond P3 is this guy.",
            "So now I'm instantiating this shape to this.",
            "Therefore what's the value of Phi?",
            "Right the fuck if I'm instantiating that to that.",
            "Then I peel off the diamond and the thing that's left is P3, right?",
            "So far is P3 and I come across here and say, well, it's true.",
            "If something or other.",
            "Right, if some V in W. So if some V in W. Has two things.",
            "WRV and.",
            "The truth value of.",
            "5V has to be true.",
            "What's 5?",
            "Right P3 OK?",
            "What's W?",
            "Hi, it's W not so.",
            "This now here.",
            "Hopefully you can see that that statement there is AL version for this particular example of this clause.",
            "If some V in W has WR V and data.",
            "OK.",
            "So there are two things to look up.",
            "We have to find some vertex.",
            "Which is are related to Dublin or.",
            "What does that mean?",
            "There's an arrow.",
            "From W nought to V in this crap.",
            "So it's either this error that I write.",
            "And the truth value of P3 at that V the vertex that we go to has to be true.",
            "Alright.",
            "Is it this one?",
            "No why because remember that the truth value of P3 here is false.",
            "That was something that I stipulated.",
            "OK, so can this V. BW2 well it W nought RV holds if this is the V that's fine.",
            "But then this part fails 'cause the truth value of P3 at this point is not true.",
            "It's false.",
            "Alright, let's go up here.",
            "Can it be this one?",
            "Well, W nought RW One holds so V could be W one.",
            "And then the truth value of P3 at W one is true.",
            "OK, so sorry that it's taken as this long, but all of these is.",
            "Some.",
            "One step.",
            "A successor.",
            "This is another way that I could say it.",
            "Makes P3 true.",
            "That's what diamond.",
            "That's how you might think of Diamond P3.",
            "Someone step our successor makes P3 true OK?",
            "And then boxes the jewel boxes for all of the world's which are related to W. Fire has to be true there.",
            "It doesn't matter what happens at the worlds which are not are related.",
            "But at all at all, the one step our successes fire has to be true.",
            "So let's do the other example W 1 box P1, so W 1.",
            "Box P1.",
            "OK, so let's go through the claws.",
            "If every if every world V, which is a one step, our successor, W, makes the smaller formula true.",
            "That's what that says.",
            "Every once step, our successor makes the smaller formula of truth.",
            "So what's the smaller formula?",
            "It's P1.",
            "What are we trying to do?",
            "We're trying to say.",
            "Does every one step our successor of W One make P1 true?",
            "How many are are successes?",
            "Does W1 have?",
            "It's a dead end.",
            "It doesn't have any ice exists, right?",
            "So how do we interpret the every?",
            "There are two ways you can either say well it's undefined or something like that.",
            "Or you just say, well, that's fine.",
            "If there are no our successes, then every our successor does make something something true.",
            "It's a vacuous statement, right?",
            "So we interpret it that way.",
            "So actually the truth value here.",
            "So the truth value of box P1 at W one is true.",
            "What if I asked you arbitrarily traer only?",
            "What's the truth value of any formula you like that's boxed?",
            "At this world.",
            "I'm not going to tell you what phase, but you can tell me what the truth value is, 'cause it's the same thing, right?",
            "It's the same vacuous statement if it's a dead end, then every successor blah blah blah blah blah.",
            "You can plug in anything you like.",
            "So dead ends make every box formula true.",
            "Are we in a problem here because look?",
            "This is going to be true, but now I can do this as well.",
            "Is that a problem?",
            "You need to be a bit careful.",
            "These are not negations of each other.",
            "I'm not saying that some formula is true at W, and its negation is true at WK, so there's some subtlety.",
            "So dead ends behave in strange may ways.",
            "They may call box formula true.",
            "Hey.",
            "Alright.",
            "I'll let you work through this last one here.",
            "OK, Diamond box P1.",
            "Roughly speaking, what it says is this.",
            "There is at least one.",
            "Sorry, someone stuck someone step are successor of W nought.",
            "He's such that every one step, our successor on that guy makes P1 true.",
            "Right, and I claim that that's true.",
            "Why?",
            "Because you can come here, or you can go there actually right?",
            "Because both of these are dead ends.",
            "So box P1 is going to be true at both of them.",
            "Right and Diamond just says pick one, either one.",
            "I don't care.",
            "OK, I'll let you go through that and."
        ],
        [
            "Oh boy, we've got some catching up to do, but I really I really did need to go slowly.",
            "I think to try and keep everyone OK. What I'd like you to do is just go through some of these at your own leisure.",
            "I hope that I've covered enough detail here to allow you to work through this.",
            "OK, I'm going to skip this slide 'cause I just have to, but the main thing that I'm trying to get across here is.",
            "That this equivalence holds.",
            "Right that box fight implies not diamond, not fire holes and diamond fire implies not box not fire halts.",
            "OK, try and work yourself through that."
        ],
        [
            "OK. Um?",
            "Now, are we supposed to have a break at 10?",
            "Yeah.",
            "Shall we just?",
            "Just wondering how far are you Bud?",
            "OK, let me just.",
            "I've got.",
            "Quite a lot to go of this lecture so.",
            "It might be better.",
            "Right, what I'll do is I'll do one more slide and then get onto this notion of Phi implies a Pfizer logical consequence of gamma after the break, OK?",
            "Just see if they've got anything set up for us.",
            "Looks like it's under the shade over there.",
            "I just want to go through this one thing.",
            "So what I'm trying to say here is that modal logic is sometimes known as a non classical logic.",
            "OK, you'll often hear this term, but at its underlying base it's really classical in the sense that everything is either true or false.",
            "OK, it's non classical.",
            "Because of this graph structure.",
            "Right, and the fact that the truth values of diamond in boxes is not truth functional, right?",
            "You can't come.",
            "You can't evaluate the truth value of Diamond P3 at this world using a truth table sitting here, right?",
            "It depends on the edges.",
            "So if I rub out one edge, the truth value might change, whereas at these particular worlds where there are the truth tables, you know rubbing out an edge doesn't change the value and of how the truth table behaves here.",
            "OK, so this is an attempt to show you that Kripke semantics is classical based and it's approved, and I want to work through it just to show you how some proofs work because there's not much point teaching your logic if I don't teach you how some proofs work.",
            "So this is a proof which is an induction.",
            "OK, so I claim that for every Kripke model.",
            "Any world in any formula.",
            "Either that formula is true at that world or else that formula is false at that world.",
            "Right, that's what I'm going to prove and what I do so because it's an arbitrary Kripke model I'm going to just pick anyone W RV.",
            "Pick any W like you like.",
            "Pick any formula you like.",
            "I don't know what it looks like, but then I'm going to proceed by induction on its shape on its length.",
            "Alright, so then I'm going to say what if fires in atomic formula?",
            "What if I is a bigger formula?",
            "Those are the two steps.",
            "So what if I is an atomic formula?",
            "Well, you've got.",
            "I don't even need to draw anything here.",
            "You've got if I, as an atomic formula, then you know that either the Atom P whatever it is P53P3P2 is either true or false at W. Right, what 'cause?",
            "That's the way the valuation is defined.",
            "The valuation tells you pick your world and go along here until you find your Adam and look up.",
            "Look up the truth value and it's going to be either true or false.",
            "So on the atoms it's by definition of the valuation.",
            "Valuation is binary.",
            "And now you just have to convince yourself that the connectives maintain the classicality.",
            "OK. Hello, that's one way of stopping electric lecture for a break.",
            "Any way to access the menu wait come back?",
            "Computer.",
            "So what do I need to do so it's the computer, right, sorry.",
            "Lock the laptop.",
            "Am I going to get anything?",
            "Video projector on projector is powering up or the projectors turned itself off alright.",
            "Doesn't really matter.",
            "Let's just look at the case.",
            "So you know that it holds for atomic formula.",
            "Now let's pick.",
            "A formula of an arbitrary size, so the formula is of size N greater than zero.",
            "It's some end which is greater than zero.",
            "I don't know how big or what I'm going to assume.",
            "Is that the lemma?",
            "Holds.",
            "For all.",
            "Smaller in length formula.",
            "OK, so this is the induction hypothesis.",
            "So if I is of length N. Then any formula which is smaller than five.",
            "Obeys the lemma.",
            "In other words, it.",
            "It'll either be true or false at any particular world, right?",
            "So you here's our world, and now you just go through the cases.",
            "Suppose that Pfizer conjunction.",
            "So suppose it's a conjunction of the form, say Cy and Chi.",
            "Right Pfizer conjunction.",
            "What is the truth table tell you?",
            "Well, it tells you that this guy is true.",
            "If size true and Chi is true.",
            "Hi Peter OK now these guys are smaller.",
            "Apply the induction hypothesis and it tells you that either this is true at W nought or it's false at W not.",
            "You can't have both either.",
            "This is true at this W or it's false.",
            "It W you can't have both and depending on the floor combinations one of them will be the conjunction conjunctive one and you just apply the truth table.",
            "OK.",
            "Doesn't matter if you don't get the details right, it's you just need to work through this.",
            "Why have I?",
            "Why have I lost the screen?",
            "OK.",
            "Sorry about that.",
            "It's on your lecture notes.",
            "Just work through that at your own leisure, but I just wanted to get across to you that modal logic is classical based.",
            "OK, so how about?",
            "We come back at quarter past say we only get a 10 minute break, but it just helps me catch up a bit.",
            "Yeah, OK?",
            "See you then."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK sorry bout this guys.",
                    "label": 0
                },
                {
                    "sent": "Pretty people were a bit jealous they put away the camera so we had to go and retrieve the camera.",
                    "label": 0
                },
                {
                    "sent": "So what is it now?",
                    "label": 0
                },
                {
                    "sent": "It's a quarter past.",
                    "label": 0
                },
                {
                    "sent": "I'll try to finish on time still, but we might need to.",
                    "label": 0
                },
                {
                    "sent": "Hurry along, maybe I if I'm gonna hurry.",
                    "label": 0
                },
                {
                    "sent": "I'm going to 2nd lecture because this first lecture is really vital.",
                    "label": 0
                },
                {
                    "sent": "OK, so stop me at anytime if you want to ask questions.",
                    "label": 0
                },
                {
                    "sent": "I'm happy to go through things more slowly if you don't understand.",
                    "label": 0
                },
                {
                    "sent": "Can you please give me an idea how many of you have a background in first order logic?",
                    "label": 0
                },
                {
                    "sent": "Not not what you've seen just over the last three days, but how many of you have seen it before?",
                    "label": 0
                },
                {
                    "sent": "How many of you seem logic before OK?",
                    "label": 0
                },
                {
                    "sent": "How many of you had seen modal logic?",
                    "label": 0
                },
                {
                    "sent": "OK. How many of you are PhD students?",
                    "label": 0
                },
                {
                    "sent": "How many of you are undergraduates?",
                    "label": 0
                },
                {
                    "sent": "Advanced undergraduates.",
                    "label": 0
                },
                {
                    "sent": "OK, fine.",
                    "label": 0
                },
                {
                    "sent": "How many of you are computer scientists?",
                    "label": 0
                },
                {
                    "sent": "How many of you are mathematics mathematics students or mathematician philosophy?",
                    "label": 0
                },
                {
                    "sent": "OK couple alright, So what I usually find is that the technical backgrounds of different disciplines differ.",
                    "label": 0
                },
                {
                    "sent": "OK, so if I say some mumbo jumbo that you don't understand, just put up your hand and I'll try and explain it on the board.",
                    "label": 0
                },
                {
                    "sent": "Nothing is difficult.",
                    "label": 0
                },
                {
                    "sent": "OK, this lecture nothing is difficult, it's really easy.",
                    "label": 0
                },
                {
                    "sent": "So if you're finding it hard going, stopping 'cause I'm not getting through somewhere.",
                    "label": 0
                },
                {
                    "sent": "OK, my name is Rajiv Goro by the way.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "The history of modal logic.",
                    "label": 0
                },
                {
                    "sent": "Modern history of modal logic goes back to about 1920.",
                    "label": 0
                },
                {
                    "sent": "Have you all got these lecture slides?",
                    "label": 0
                },
                {
                    "sent": "By the way, right?",
                    "label": 0
                },
                {
                    "sent": "So what I'm going to do is I'm going to draw pictures on here that go with the slides, so don't copy that anything that's on the slides.",
                    "label": 0
                },
                {
                    "sent": "Maybe copy down the pictures.",
                    "label": 0
                },
                {
                    "sent": "OK, but you're better off if you just listen.",
                    "label": 0
                },
                {
                    "sent": "So CI Lewis was looking for CS Lewis is the guy who wrote the line, the Witch and the Wardrobe.",
                    "label": 0
                },
                {
                    "sent": "By the way, this is a different person.",
                    "label": 0
                },
                {
                    "sent": "He was looking for a non trip functional notion called a necessarily implies B, which he wrote using this strange notation.",
                    "label": 0
                },
                {
                    "sent": "See if this works.",
                    "label": 0
                },
                {
                    "sent": "Yes no.",
                    "label": 0
                },
                {
                    "sent": "No K. Here is there 1 here.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "It's like, OK, fine.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "So what he was trying to do was restart.",
                    "label": 0
                },
                {
                    "sent": "This is a new modern technology.",
                    "label": 0
                },
                {
                    "sent": "You see that funding is short over here.",
                    "label": 0
                },
                {
                    "sent": "He was trying to find a explanation of this guy and he wanted to mean something like this.",
                    "label": 0
                },
                {
                    "sent": "It's impossible for A to be true and B to be false.",
                    "label": 1
                },
                {
                    "sent": "So what is the right capital P of a 2 mean?",
                    "label": 0
                },
                {
                    "sent": "Something like hey is possible and then he worked through the following and I did do this at some stage.",
                    "label": 0
                },
                {
                    "sent": "Maybe not now, but just convince yourself that this works right?",
                    "label": 0
                },
                {
                    "sent": "So if you negate then this says something like a is impossible alright because the negation is right next to the possible.",
                    "label": 0
                },
                {
                    "sent": "OK, then you put a negation in here and then all you're doing is replacing that a with the negation.",
                    "label": 0
                },
                {
                    "sent": "So not is impossible.",
                    "label": 0
                },
                {
                    "sent": "So then what he did is to say, well, let's define another connective, and he'd redefined this in and said A is necessary.",
                    "label": 0
                },
                {
                    "sent": "Right, So what he's saying is if A is necessary then not a is impossible.",
                    "label": 0
                },
                {
                    "sent": "Right, there's no way that you can make it false.",
                    "label": 0
                },
                {
                    "sent": "That's why it's necessary.",
                    "label": 0
                },
                {
                    "sent": "OK, now if you follow this again, hopefully this makes sense.",
                    "label": 0
                },
                {
                    "sent": "So we start off here.",
                    "label": 0
                },
                {
                    "sent": "We're trying to define this and he defined necessarily a SB as this, so he's just replaced this this A with a bigger formula.",
                    "label": 0
                },
                {
                    "sent": "The implication now this is classical implication right now you do this and push all this through.",
                    "label": 0
                },
                {
                    "sent": "So I replace that with and then I replace A implies B by not A or B because it's classical implication.",
                    "label": 0
                },
                {
                    "sent": "Now I can push this negation sign in.",
                    "label": 0
                },
                {
                    "sent": "So that negation cancels there, that becomes an A.",
                    "label": 0
                },
                {
                    "sent": "The negation makes this an end, and the negation comes in, sits next to here.",
                    "label": 0
                },
                {
                    "sent": "So what I'm hoping is that this stuff in green you should be able to reuse something like that.",
                    "label": 0
                },
                {
                    "sent": "Right, it's impossible.",
                    "label": 1
                },
                {
                    "sent": "For A to be true and B to be false.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "This is 2 minutes of you know 50 years of philosophy, so please take this with a reasonable Greiner.",
                    "label": 0
                },
                {
                    "sent": "Do your reading.",
                    "label": 0
                },
                {
                    "sent": "If you're from philosophy and you really want to know the details now the strange thing is that these actions of you know, a strictly implies a necessarily implies B didn't actually Jaune they caught on in philosophy.",
                    "label": 0
                },
                {
                    "sent": "But the main thing that caught on and mainly in computer science since the 60s, and mainly the reason 90s is this notion.",
                    "label": 0
                },
                {
                    "sent": "That P is possible and any necessary.",
                    "label": 0
                },
                {
                    "sent": "So it's the unary operators PNN that gave rise to modal logic and the strict patient has sort of fallen by the wayside, at least in computer science and maths.",
                    "label": 0
                },
                {
                    "sent": "But I'm sure it's important in philosophy, OK?",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "Any questions?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this whole lecture and modal logic is about graphs.",
                    "label": 0
                },
                {
                    "sent": "All of these directed graphs, a set of nodes and some edges between them.",
                    "label": 0
                },
                {
                    "sent": "OK, so I just want to fix some notation so that I can use it for free and you have to stop me now if you don't understand this.",
                    "label": 0
                },
                {
                    "sent": "Alright, so what's a directed graph?",
                    "label": 0
                },
                {
                    "sent": "It's a set of nodes V and some edges between them.",
                    "label": 0
                },
                {
                    "sent": "So here's some nodes venor V1V2.",
                    "label": 0
                },
                {
                    "sent": "Etc.",
                    "label": 0
                },
                {
                    "sent": "Can you see this up the back?",
                    "label": 0
                },
                {
                    "sent": "By the way, this is fairly faint.",
                    "label": 0
                },
                {
                    "sent": "Let me try to find another one and then some edges S1T1S2T2 from source vertex to target vertex right so that S1T one is to be just some of these nodes, but I don't want to use particular V notes and V ones 'cause I'm just spelling it generally.",
                    "label": 0
                },
                {
                    "sent": "OK, So what am I going to do?",
                    "label": 0
                },
                {
                    "sent": "There might be an edge between this guy and this guy, so the pair is going to be V nought V1.",
                    "label": 0
                },
                {
                    "sent": "OK, that pair is going to be in the set of images.",
                    "label": 0
                },
                {
                    "sent": "Now the cross product V CrossFit West Theory just stands for the set of all ordered pairs VW where these little from the set of vertices and little WS from the set of vertices.",
                    "label": 1
                },
                {
                    "sent": "OK, so you give me a set of numbers and once the cross product here it's going to be something like V nought V1.",
                    "label": 0
                },
                {
                    "sent": "The nought V2.",
                    "label": 0
                },
                {
                    "sent": "V1V nought can you see the picture?",
                    "label": 0
                },
                {
                    "sent": "I'm just going to take put veinotte in every position in the first one go through all the rotations of that one, then put V1 in the first position and go through all the rotations of that one.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "Yep, sorry I forgot one right.",
                    "label": 0
                },
                {
                    "sent": "You can put that one of course.",
                    "label": 0
                },
                {
                    "sent": "Now, by directing what I mean is that there is an error.",
                    "label": 0
                },
                {
                    "sent": "OK, so the arrow goes from V to W, so this edge is that arrow.",
                    "label": 0
                },
                {
                    "sent": "The nought to V nought.",
                    "label": 0
                },
                {
                    "sent": "Is that arrow.",
                    "label": 0
                },
                {
                    "sent": "The two to be not V2 is that arrow and so on.",
                    "label": 0
                },
                {
                    "sent": "OK, not difficult so far.",
                    "label": 0
                },
                {
                    "sent": "What I'm going to talk about is a binary relation.",
                    "label": 0
                },
                {
                    "sent": "Semantics is about binary relations, and I'm going to say that this notation.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "Something is a subset of the cross.",
                    "label": 1
                },
                {
                    "sent": "V is a binary relation over V. What does that mean?",
                    "label": 0
                },
                {
                    "sent": "So VV says you take all possible arrows.",
                    "label": 0
                },
                {
                    "sent": "I might have missed some here, right?",
                    "label": 0
                },
                {
                    "sent": "So you have to tell me, have I missed any arrows?",
                    "label": 0
                },
                {
                    "sent": "This is very cross V to the set of all errors.",
                    "label": 1
                },
                {
                    "sent": "And I'm going to say that R is a subset of the cross V, So what are?",
                    "label": 0
                },
                {
                    "sent": "Right, we cross V is a set of edges.",
                    "label": 0
                },
                {
                    "sent": "Pairs like this.",
                    "label": 0
                },
                {
                    "sent": "And if I take a subset of them.",
                    "label": 0
                },
                {
                    "sent": "How far is a subset of these edges?",
                    "label": 0
                },
                {
                    "sent": "What am I doing to this cross V?",
                    "label": 0
                },
                {
                    "sent": "Baby powder yeah so doing right?",
                    "label": 0
                },
                {
                    "sent": "I'm saying very cross these everything crossed with everything the set of all those ordered pairs are is a set of ordered pairs which is a subset of that.",
                    "label": 0
                },
                {
                    "sent": "So all it is is it's just not all the edges.",
                    "label": 0
                },
                {
                    "sent": "But some of them.",
                    "label": 0
                },
                {
                    "sent": "So some of them are gone.",
                    "label": 0
                },
                {
                    "sent": "Of course, it may be that power is equal to V across the right, so it can be all of them, but in general it's some subset.",
                    "label": 0
                },
                {
                    "sent": "That's it, that's Kripke semantics.",
                    "label": 0
                },
                {
                    "sent": "OK, now the rest of the lecture is going to try and fill you in on WHI modal logics.",
                    "label": 0
                },
                {
                    "sent": "Propositional logic is the logic of Kripke frames or the logic of graphs.",
                    "label": 0
                },
                {
                    "sent": "Why they thought?",
                    "label": 0
                },
                {
                    "sent": "Well, imagine you've got a computer which doesn't action and it stays in the same state you've got this thing.",
                    "label": 0
                },
                {
                    "sent": "Another action it moves to another state, right?",
                    "label": 0
                },
                {
                    "sent": "So lots of systems can be described by, you know, object in a state and moving to a different state.",
                    "label": 0
                },
                {
                    "sent": "That's why it's good in computer science, any questions?",
                    "label": 0
                },
                {
                    "sent": "Deliberately going slowly.",
                    "label": 0
                },
                {
                    "sent": "I'm going to speed up, but I don't want to lose you now.",
                    "label": 0
                },
                {
                    "sent": "So for those of you already know this, sorry you just sit there and I don't know do something else for awhile.",
                    "label": 0
                },
                {
                    "sent": "Any questions?",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, now I'm going to try and use consistent notation for my concepts that I'm introducing.",
                    "label": 0
                },
                {
                    "sent": "It's not necessarily the same notation as the other lecture is all use, so be careful.",
                    "label": 0
                },
                {
                    "sent": "Alright?",
                    "label": 0
                },
                {
                    "sent": "I don't necessarily use notation in the same way.",
                    "label": 0
                },
                {
                    "sent": "But pick me up if I.",
                    "label": 0
                },
                {
                    "sent": "Don't use it consistently.",
                    "label": 0
                },
                {
                    "sent": "OK, what I want to try and do is tell you story.",
                    "label": 0
                },
                {
                    "sent": "Something like this that if you want.",
                    "label": 0
                },
                {
                    "sent": "If you want to think of logic, you can think of it.",
                    "label": 0
                },
                {
                    "sent": "There are two strands to logic, and I'm going to say that it's syntax together with either a semantics or a calculus.",
                    "label": 0
                },
                {
                    "sent": "OK, so here's the syntax.",
                    "label": 0
                },
                {
                    "sent": "Pending on your point of view.",
                    "label": 0
                },
                {
                    "sent": "Then you can either look at the semantic point of view and those two are enough to define a logic or.",
                    "label": 0
                },
                {
                    "sent": "At.",
                    "label": 0
                },
                {
                    "sent": "Calculus.",
                    "label": 0
                },
                {
                    "sent": "Does it done at these lights enough?",
                    "label": 0
                },
                {
                    "sent": "You can see this country OK and by calculus what I mean is purely syntactic manipulations, right?",
                    "label": 0
                },
                {
                    "sent": "Just fiddling symbols.",
                    "label": 0
                },
                {
                    "sent": "What we find is that usually we know what sort of intended semantics we have.",
                    "label": 0
                },
                {
                    "sent": "We know what we want these graphs to mean and what we formula to me.",
                    "label": 0
                },
                {
                    "sent": "So usually we formulate a logic by giving an exact syntax for the formula so that it's a formal language different from natural language.",
                    "label": 0
                },
                {
                    "sent": "And then we give some meaning to the semantics to Philly.",
                    "label": 0
                },
                {
                    "sent": "And what we try and do is we then try and find a calculus that matches the notions, because a computer can then do these.",
                    "label": 0
                },
                {
                    "sent": "Purely syntactic manipulations, right?",
                    "label": 0
                },
                {
                    "sent": "You'll see this theme coming through.",
                    "label": 0
                },
                {
                    "sent": "OK, so the syntax is something that allows us to build formula right?",
                    "label": 0
                },
                {
                    "sent": "So down here I'm going to define the notion of formula.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Again, a set of finite collection gamma is going to be a set of assumptions.",
                    "label": 0
                },
                {
                    "sent": "Now, semantics is.",
                    "label": 0
                },
                {
                    "sent": "A way of saying when.",
                    "label": 0
                },
                {
                    "sent": "Fire is a logical consequence of gamma.",
                    "label": 0
                },
                {
                    "sent": "So what I'm after in this lecture is I want some notion of truth of a formula.",
                    "label": 0
                },
                {
                    "sent": "When is the formula true?",
                    "label": 0
                },
                {
                    "sent": "I want some notion of a model, but at the end of the day.",
                    "label": 0
                },
                {
                    "sent": "So at the end of the lecture I'm after this notion.",
                    "label": 0
                },
                {
                    "sent": "Written with double, there's an equals here, right?",
                    "label": 0
                },
                {
                    "sent": "Fire is a logical consequence of gamma.",
                    "label": 0
                },
                {
                    "sent": "So I know what it means for gamma to be true in a model, and I'm going to decide whether define where the fire is true in the model of gamoran.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "Now in calculate what we do is we take the same thing.",
                    "label": 0
                },
                {
                    "sent": "We take a set of formula gamma.",
                    "label": 0
                },
                {
                    "sent": "Some assumptions are given formula Five and now we talk about things like say rule of inference.",
                    "label": 0
                },
                {
                    "sent": "Right rules of inference.",
                    "label": 0
                },
                {
                    "sent": "You should have seen these things in the previous lectures.",
                    "label": 0
                },
                {
                    "sent": "I just want to try and separate them outright.",
                    "label": 0
                },
                {
                    "sent": "Rules of inference duction or a derivation.",
                    "label": 0
                },
                {
                    "sent": "OK, what am I to hear?",
                    "label": 0
                },
                {
                    "sent": "He's a syntactic notion.",
                    "label": 0
                },
                {
                    "sent": "Five has a deduction from Gamma or Phis, deducible from gamma purely syntactically just symbol shuffling, notion of truth.",
                    "label": 0
                },
                {
                    "sent": "No notion of model, and then what we try and do is we try and show that these two things coincide, so One Direction.",
                    "label": 0
                },
                {
                    "sent": "If every deduction is correct.",
                    "label": 0
                },
                {
                    "sent": "That's usually known as soundness.",
                    "label": 0
                },
                {
                    "sent": "And completeness says whenever fareisa logical consequence of gamma, then you will be able to find a deduction of five from gamma, right?",
                    "label": 0
                },
                {
                    "sent": "So there's that direction.",
                    "label": 0
                },
                {
                    "sent": "So you should have seen in your previous lectures the notions of soundness and completeness.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "OK, so most of most of all of this you've already seen before.",
                    "label": 0
                },
                {
                    "sent": "I just want to try and put it into part.",
                    "label": 0
                },
                {
                    "sent": "Placeholders for you, right?",
                    "label": 0
                },
                {
                    "sent": "So when I'm talking about the semantics when I'm talking about the model theory, you shouldn't see this and I shouldn't be saying anything like deduction or rule or.",
                    "label": 0
                },
                {
                    "sent": "Syntactic manipulation, if I do then pick me up when I move over there then I shouldn't be talking about truth or model.",
                    "label": 0
                },
                {
                    "sent": "Alright, so I'll try and keep that those concepts separate.",
                    "label": 0
                },
                {
                    "sent": "And then you've got interesting properties that you can prove.",
                    "label": 0
                },
                {
                    "sent": "For example, consistency says.",
                    "label": 0
                },
                {
                    "sent": "You can't deduce 5 from gamma.",
                    "label": 0
                },
                {
                    "sent": "It was deduced not far from gamma, right?",
                    "label": 0
                },
                {
                    "sent": "That's usually not, not.",
                    "label": 0
                },
                {
                    "sent": "It's not a healthy sign, right?",
                    "label": 0
                },
                {
                    "sent": "Decidability.",
                    "label": 0
                },
                {
                    "sent": "Is there an algorithm we know when fire is a logical consequence of gamma?",
                    "label": 1
                },
                {
                    "sent": "Is there an algorithm to decide it on a computer?",
                    "label": 0
                },
                {
                    "sent": "What's its complexity?",
                    "label": 0
                },
                {
                    "sent": "Can you implement it efficiently on a computer?",
                    "label": 0
                },
                {
                    "sent": "Those are the sorts of things that you're going to see.",
                    "label": 0
                },
                {
                    "sent": "Probably this afternoon, actually, right?",
                    "label": 0
                },
                {
                    "sent": "There's an automated reasoning course starting this afternoon, OK?",
                    "label": 0
                },
                {
                    "sent": "Questions.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Fine so.",
                    "label": 0
                },
                {
                    "sent": "The syntax of modal logic.",
                    "label": 1
                },
                {
                    "sent": "I'm here and I'm trying to define what formula, yeah, what a formula.",
                    "label": 0
                },
                {
                    "sent": "Well, there are some atomic formula, I'll call them P, not P1P2.",
                    "label": 0
                },
                {
                    "sent": "There's an infinite supply of them, they're countable 'cause it helps me later on.",
                    "label": 0
                },
                {
                    "sent": "In other words, I can tell you I can put them in a well order, say peanut P1P2, but you could reverse the order if we wanted to whatever you wanted to do, and then I say that out of these atomic formula you build bigger formally.",
                    "label": 0
                },
                {
                    "sent": "This is just classical logic, right?",
                    "label": 0
                },
                {
                    "sent": "This is this is just classical propositional logic.",
                    "label": 1
                },
                {
                    "sent": "There is an implication, junction, and disjunction and negation.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Yeah OK, all I'm doing now is I'm saying that Diamond Phi is a formula and box Pfizer formula.",
                    "label": 0
                },
                {
                    "sent": "So read this as one symbol right?",
                    "label": 0
                },
                {
                    "sent": "It's not [] [] here.",
                    "label": 0
                },
                {
                    "sent": "Just read it as one symbol.",
                    "label": 0
                },
                {
                    "sent": "The reason why I've done it that way is because later on I want to put things inside the inside.",
                    "label": 0
                },
                {
                    "sent": "These separators.",
                    "label": 0
                },
                {
                    "sent": "OK so Diamond is a formula and box by the formula.",
                    "label": 0
                },
                {
                    "sent": "So I claim that this is a formula, why?",
                    "label": 0
                },
                {
                    "sent": "What's the claim box?",
                    "label": 0
                },
                {
                    "sent": "P nought implies is it P2?",
                    "label": 0
                },
                {
                    "sent": "Yes, right.",
                    "label": 0
                },
                {
                    "sent": "Why is it a formula 'cause what I can do is I can use this package now for deposit right?",
                    "label": 0
                },
                {
                    "sent": "So what do I say?",
                    "label": 0
                },
                {
                    "sent": "It's a binary connective and I've got a P2 there.",
                    "label": 0
                },
                {
                    "sent": "This is altogether, so I've got a box here.",
                    "label": 0
                },
                {
                    "sent": "Annan underneath that I've gotta pee nought.",
                    "label": 0
                },
                {
                    "sent": "Right now you start at the bottom.",
                    "label": 0
                },
                {
                    "sent": "Is this a formula?",
                    "label": 0
                },
                {
                    "sent": "Yes, 'cause it's an Atom.",
                    "label": 0
                },
                {
                    "sent": "Is this a formula?",
                    "label": 0
                },
                {
                    "sent": "Yes, it's an Atom.",
                    "label": 0
                },
                {
                    "sent": "Is this a formula?",
                    "label": 1
                },
                {
                    "sent": "Yes, it's box of the formula.",
                    "label": 0
                },
                {
                    "sent": "Box of a formula and I already know that peanut is a formula.",
                    "label": 0
                },
                {
                    "sent": "Then what's this?",
                    "label": 0
                },
                {
                    "sent": "It's a binary connective, and what is it?",
                    "label": 0
                },
                {
                    "sent": "What it wants?",
                    "label": 0
                },
                {
                    "sent": "A formula on the left and a formula on the right?",
                    "label": 0
                },
                {
                    "sent": "Is this a formula?",
                    "label": 0
                },
                {
                    "sent": "Yes, I just passed that to be a formula.",
                    "label": 0
                },
                {
                    "sent": "Is this a formula?",
                    "label": 0
                },
                {
                    "sent": "Yes, I just passed that to be a formula, right?",
                    "label": 0
                },
                {
                    "sent": "Just draw a formation tree and work through it.",
                    "label": 0
                },
                {
                    "sent": "Box.",
                    "label": 0
                },
                {
                    "sent": "Yes, Yep so.",
                    "label": 0
                },
                {
                    "sent": "Bracketed, think of the bracketing this way.",
                    "label": 0
                },
                {
                    "sent": "Right rather than.",
                    "label": 0
                },
                {
                    "sent": "This way.",
                    "label": 0
                },
                {
                    "sent": "So the box grabs onto its argument more tightly than time than implication does.",
                    "label": 0
                },
                {
                    "sent": "You slowly pick up these things as the lecture progresses anyway, So what I'd like you to do is just convince yourself that some of these other things are formulated as well.",
                    "label": 0
                },
                {
                    "sent": "Now in modal logic we rarely deal with actual formula.",
                    "label": 0
                },
                {
                    "sent": "We deal with shapes.",
                    "label": 0
                },
                {
                    "sent": "Sometimes they're called schemers and what I want to do there, you say that when you have a shape then you start using formula variables like Phi and PSI so.",
                    "label": 0
                },
                {
                    "sent": "Box fire implies Phi is a shape because I can substitute any formula I like here, right?",
                    "label": 0
                },
                {
                    "sent": "So if I wanted to, I could take this whole thing and put it in there and as long as I put the same thing in there, I get it a formula.",
                    "label": 0
                },
                {
                    "sent": "Alright, So what we're going to do is we're going to instantiate.",
                    "label": 0
                },
                {
                    "sent": "The shapes and the magic word is uniformly.",
                    "label": 0
                },
                {
                    "sent": "OK, so the example box peanut implies P2.",
                    "label": 0
                },
                {
                    "sent": "So box Peanut implies P2.",
                    "label": 1
                },
                {
                    "sent": "I claim this thing is not an instance of that, why?",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "OK, so uniformly the fire has to be the same thing, right?",
                    "label": 0
                },
                {
                    "sent": "This fire is P nought.",
                    "label": 0
                },
                {
                    "sent": "But now we're saying, well, actually we changed our mind when we went from one side of the arrow to the other.",
                    "label": 0
                },
                {
                    "sent": "OK, that's all.",
                    "label": 0
                },
                {
                    "sent": "Just wherever you see fire, it has to be the same thing wherever you see sigh.",
                    "label": 0
                },
                {
                    "sent": "It can be different from fight.",
                    "label": 0
                },
                {
                    "sent": "It can be the same as far if you want as well.",
                    "label": 0
                },
                {
                    "sent": "Alright, so again, convince yourself that these schema things work and sometimes I want to count the length of the formula so it's just going to be the the number of symbols in it.",
                    "label": 0
                },
                {
                    "sent": "Assuming that these guys P, not P2, etc or all of length one, so I want this to be together right?",
                    "label": 0
                },
                {
                    "sent": "It's not 1 two, it's this is of length one.",
                    "label": 0
                },
                {
                    "sent": "This is of length one, then this is love length 2 then this is of length 4.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Questions.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "I beg your pardon.",
                    "label": 0
                },
                {
                    "sent": "No, it's not graph theory, it's just.",
                    "label": 0
                },
                {
                    "sent": "They traditionally called schema right?",
                    "label": 0
                },
                {
                    "sent": "Whereas if you have no background whatsoever in logic, which is what sometimes happens here, then oh, what's a schema?",
                    "label": 0
                },
                {
                    "sent": "You know, it sounds very it, and by shape what I'm trying to get across is this idea of uniformity, right?",
                    "label": 0
                },
                {
                    "sent": "A shape is something that's the same everywhere.",
                    "label": 0
                },
                {
                    "sent": "So far is a shape, and if you see the same shape in two places, you've got to instantiate it in the same way.",
                    "label": 0
                },
                {
                    "sent": "It's just something that I made up which other people other people use it as well, but you.",
                    "label": 0
                },
                {
                    "sent": "See it more and more recently in introductory logic textbooks.",
                    "label": 0
                },
                {
                    "sent": "OK, because not everyone has a background in, say, philosophy anymore, right?",
                    "label": 0
                },
                {
                    "sent": "So all of these?",
                    "label": 0
                },
                {
                    "sent": "All terms of schemas and substitution instances and things like that.",
                    "label": 0
                },
                {
                    "sent": "They just don't have the background.",
                    "label": 0
                },
                {
                    "sent": "OK, any other questions?",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Fine, so now this lecture is all about the Kripke semantics for modal logic.",
                    "label": 1
                },
                {
                    "sent": "It's named after a guy called Saul Kripke, who made major contributions.",
                    "label": 0
                },
                {
                    "sent": "He basically showed that modal logic has a semantics in terms of graphs K from 1920.",
                    "label": 0
                },
                {
                    "sent": "Remember CI Lewis modal logic was a healthy discipline using only syntax.",
                    "label": 0
                },
                {
                    "sent": "There was no nice semantics and Kripke came along in about 55 I think 54.",
                    "label": 0
                },
                {
                    "sent": "I've got the details at the end of the lectures if you want to look and he said, oh, this is really the modal logic of graphs.",
                    "label": 0
                },
                {
                    "sent": "So it's named after Saul Kripke.",
                    "label": 0
                },
                {
                    "sent": "What are we trying to do?",
                    "label": 0
                },
                {
                    "sent": "We're trying to define these notions like truth and model model with a D not modal within a remember OK. And what we want to do is try and define the notion of when fires a logical consequence of gamma and prove some properties about logical consequence.",
                    "label": 1
                },
                {
                    "sent": "And I'll try and wrap up by about 10:00 o'clock today if I can, but.",
                    "label": 0
                },
                {
                    "sent": "Again, this is not the lecture where we should be taking shortcuts.",
                    "label": 0
                },
                {
                    "sent": "Alright, so if I go over will just delay the break a little bit or something.",
                    "label": 0
                },
                {
                    "sent": "I hope you're amenable to that.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK. What's a Kripke frame?",
                    "label": 0
                },
                {
                    "sent": "I'm just gonna let you read some of that first.",
                    "label": 0
                },
                {
                    "sent": "So you've got the ingredients already.",
                    "label": 0
                },
                {
                    "sent": "OK, a Kripke frame is a directed graph WR.",
                    "label": 1
                },
                {
                    "sent": "So instead of using V for the vertices, I'm just going to use W and there's this.",
                    "label": 0
                },
                {
                    "sent": "R is a subset of W cross W, right?",
                    "label": 0
                },
                {
                    "sent": "So W is going to be a set of points W cross W is the complete graph where you put all the edges in and then R is just.",
                    "label": 0
                },
                {
                    "sent": "You.",
                    "label": 0
                },
                {
                    "sent": "Go back and delete some of them.",
                    "label": 1
                },
                {
                    "sent": "The R is just a. Kripke frame is just a directed graph.",
                    "label": 0
                },
                {
                    "sent": "What's a valuation on a Kripke frame?",
                    "label": 1
                },
                {
                    "sent": "Well, it's a map.",
                    "label": 0
                },
                {
                    "sent": "It looks complicated, but it's not.",
                    "label": 0
                },
                {
                    "sent": "All it is is.",
                    "label": 0
                },
                {
                    "sent": "So now I'm just going to rename these guys, I'm just am I using these know I'm using W so I'm just going to go back and rewrite these as WS so that we're using the same notation.",
                    "label": 0
                },
                {
                    "sent": "2.",
                    "label": 0
                },
                {
                    "sent": "And now what's a valuation?",
                    "label": 0
                },
                {
                    "sent": "A valuation is a map from every atomic formula to true and false, either true or else false.",
                    "label": 1
                },
                {
                    "sent": "At every point.",
                    "label": 0
                },
                {
                    "sent": "So a simple way of thinking about it is this.",
                    "label": 0
                },
                {
                    "sent": "Imagine where at this point you just write out your atomic formula P nought P1P2... and then you go through and under these you just decide.",
                    "label": 0
                },
                {
                    "sent": "Is it true or false?",
                    "label": 0
                },
                {
                    "sent": "Maybe it's true.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's false whatever.",
                    "label": 0
                },
                {
                    "sent": "OK, and you do the same thing over here.",
                    "label": 0
                },
                {
                    "sent": "So for every so evaluation says, you give me a world and I'll give you back the formula that the atomic formula that are true there.",
                    "label": 0
                },
                {
                    "sent": "So here we are again P, not P1P2... and here's a valuation might be different, so suppose it switches.",
                    "label": 0
                },
                {
                    "sent": "It's exactly the opposite.",
                    "label": 0
                },
                {
                    "sent": "That's perfectly legal, and you know the more worlds you have, the more variation you can make.",
                    "label": 0
                },
                {
                    "sent": "Does that make sense?",
                    "label": 0
                },
                {
                    "sent": "Doesn't make sense, OK?",
                    "label": 0
                },
                {
                    "sent": "OK, W nought is a set of worlds.",
                    "label": 0
                },
                {
                    "sent": "OK, so it's the vertices.",
                    "label": 0
                },
                {
                    "sent": "Right, so this is called.",
                    "label": 0
                },
                {
                    "sent": "The point is called W, not the point is called W one and the point is called W2 and P nought is our language of formula.",
                    "label": 0
                },
                {
                    "sent": "OK, remember up here.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Up the top.",
                    "label": 0
                },
                {
                    "sent": "They were the atomic formula.",
                    "label": 0
                },
                {
                    "sent": "OK, So what I'm saying is that we build, formulate out of these atomic formula P, not P1P2.",
                    "label": 0
                },
                {
                    "sent": "They can't be broken down any further, OK and we build formula.",
                    "label": 0
                },
                {
                    "sent": "Using these connectives OK, so we build more and more complicated formation trees like this.",
                    "label": 0
                },
                {
                    "sent": "OK, now when we go so in classical logic, which we've seen before, what do we do?",
                    "label": 0
                },
                {
                    "sent": "What we do is we take a valuation and say just ignore this.",
                    "label": 0
                },
                {
                    "sent": "For the moment we just take a valuation and say peanut is true or P1P1 is false or whatever.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "In classical logic we only have one valuation in modal logic what we do?",
                    "label": 1
                },
                {
                    "sent": "Just build that over a graph.",
                    "label": 0
                },
                {
                    "sent": "What we say is imagine you have a valuation of the atoms to true and false.",
                    "label": 0
                },
                {
                    "sent": "Right now you have a Kripke frame, which is a graph.",
                    "label": 0
                },
                {
                    "sent": "Two separate things.",
                    "label": 0
                },
                {
                    "sent": "OK, so syntax was formulated.",
                    "label": 0
                },
                {
                    "sent": "Kripke frame is sitting here, so the word frame should be sitting here under semantics.",
                    "label": 0
                },
                {
                    "sent": "OK, it's just a graph.",
                    "label": 0
                },
                {
                    "sent": "And now we're tying them together, so WR is the graph.",
                    "label": 0
                },
                {
                    "sent": "Here WR is the graph part.",
                    "label": 0
                },
                {
                    "sent": "OK, that's sitting here.",
                    "label": 0
                },
                {
                    "sent": "As a frame.",
                    "label": 0
                },
                {
                    "sent": "And evaluation.",
                    "label": 0
                },
                {
                    "sent": "Where is it?",
                    "label": 0
                },
                {
                    "sent": "The valuation here says, whenever you give me a W and one of the atoms.",
                    "label": 0
                },
                {
                    "sent": "So this is your P, not P1P2.",
                    "label": 0
                },
                {
                    "sent": "Whenever you give me a pair, which is a point and an Atom, I'll tell you whether that Atom is true at that point or not, right?",
                    "label": 0
                },
                {
                    "sent": "So?",
                    "label": 0
                },
                {
                    "sent": "That's right, yeah, sorry, yeah, yeah, right, that's right.",
                    "label": 0
                },
                {
                    "sent": "Yeah, sorry I should.",
                    "label": 0
                },
                {
                    "sent": "Yeah I should have.",
                    "label": 0
                },
                {
                    "sent": "I should have made that clear.",
                    "label": 0
                },
                {
                    "sent": "Sorry, right.",
                    "label": 0
                },
                {
                    "sent": "So what I'm saying is that the valuation is such that P nought is true at W 1.",
                    "label": 0
                },
                {
                    "sent": "Pay one is false at W1P2 is false it W one, and so on, and then if you go over here the valuations is P nought is false at W2, so they're different.",
                    "label": 0
                },
                {
                    "sent": "P1 is true at W2, so again, they're different.",
                    "label": 1
                },
                {
                    "sent": "P2 is true, it W2, so again there different that it has to be different.",
                    "label": 0
                },
                {
                    "sent": "They could be the same.",
                    "label": 0
                },
                {
                    "sent": "Hey, it's just the valuation just says you give me a world and an Atom and I'll tell you either true or false at that world order.",
                    "label": 0
                },
                {
                    "sent": "OK. And what's the Kripke model, right?",
                    "label": 0
                },
                {
                    "sent": "Remember, I'm after this notion of a model.",
                    "label": 0
                },
                {
                    "sent": "It's just a frame and a valuation, so let me write valuation here somewhere as well.",
                    "label": 0
                },
                {
                    "sent": "And a model is a frame in a valuation together.",
                    "label": 0
                },
                {
                    "sent": "And I'll go through this example now.",
                    "label": 0
                },
                {
                    "sent": "OK, so let's have a look.",
                    "label": 0
                },
                {
                    "sent": "Let's redraw this so.",
                    "label": 0
                },
                {
                    "sent": "What I want to do is, again, I'm happy to go through this more slowly, because if you don't get this then the rest of the lectures are.",
                    "label": 0
                },
                {
                    "sent": "Just gonna fly past.",
                    "label": 0
                },
                {
                    "sent": "OK, So what do we have?",
                    "label": 0
                },
                {
                    "sent": "I'm saying that the frame that's the W in the R consists of what's written up there, so I have three points W nought, W1 and W2.",
                    "label": 0
                },
                {
                    "sent": "I'll try and write them the same way.",
                    "label": 0
                },
                {
                    "sent": "Green is not a good color.",
                    "label": 1
                },
                {
                    "sent": "OK, this one is going to be called W nought.",
                    "label": 0
                },
                {
                    "sent": "And this one is going to be called W one, and this one is going to be called W2.",
                    "label": 0
                },
                {
                    "sent": "Yes, OK, and now what do we have?",
                    "label": 0
                },
                {
                    "sent": "We look up what the graph is.",
                    "label": 0
                },
                {
                    "sent": "Graph parts is there's an age that points from W nought to W 1.",
                    "label": 0
                },
                {
                    "sent": "There's an edge that points from W, not W 1.",
                    "label": 0
                },
                {
                    "sent": "There's an age that points from W nought to W2 is an edge that points from W not to W, and that's all we have.",
                    "label": 0
                },
                {
                    "sent": "OK, and now I've written up some stuff which looks complicated.",
                    "label": 0
                },
                {
                    "sent": "But I just needed to fit it on the slide.",
                    "label": 0
                },
                {
                    "sent": "What am I saying?",
                    "label": 0
                },
                {
                    "sent": "I'm saying that the only information I'm telling you is that P3 is true at W 1.",
                    "label": 0
                },
                {
                    "sent": "P3 is true at W one.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "He is pain or P1P2P3.",
                    "label": 0
                },
                {
                    "sent": "I'm telling you that.",
                    "label": 0
                },
                {
                    "sent": "P3 is true at W 1.",
                    "label": 0
                },
                {
                    "sent": "Now what I'm trying to say there is that this is just shorthand notation 'cause I've got it.",
                    "label": 0
                },
                {
                    "sent": "I can't write out valuations infinitely right?",
                    "label": 1
                },
                {
                    "sent": "There's an infinite number of atoms.",
                    "label": 0
                },
                {
                    "sent": "So what I mean is for all the other things you should just assign false.",
                    "label": 0
                },
                {
                    "sent": "OK, so when you.",
                    "label": 0
                },
                {
                    "sent": "So first of all, what you should do is you should assign false to all the other guys at W 1 right?",
                    "label": 0
                },
                {
                    "sent": "All these guys are now false.",
                    "label": 0
                },
                {
                    "sent": "Then if you go to W2.",
                    "label": 0
                },
                {
                    "sent": "What I mean is.",
                    "label": 0
                },
                {
                    "sent": "Just assign false there as well, and similarly over here it's just a shorthand notation which allows me to.",
                    "label": 0
                },
                {
                    "sent": "OK. Now.",
                    "label": 0
                },
                {
                    "sent": "So that's this bit.",
                    "label": 0
                },
                {
                    "sent": "For any Atom P at W nought.",
                    "label": 0
                },
                {
                    "sent": "Value is false.",
                    "label": 0
                },
                {
                    "sent": "For alpian atoms, right?",
                    "label": 0
                },
                {
                    "sent": "If you come to W nought.",
                    "label": 0
                },
                {
                    "sent": "All the atoms are false.",
                    "label": 0
                },
                {
                    "sent": "That's all that I'm trying to say here.",
                    "label": 0
                },
                {
                    "sent": "If you come to W 1 then they're all false, except if it's P3.",
                    "label": 0
                },
                {
                    "sent": "That's all I'm saying there, and if you come to W2 then they are the same.",
                    "label": 0
                },
                {
                    "sent": "It's the false again everywhere, right?",
                    "label": 0
                },
                {
                    "sent": "So these two guys actually have the same valuation.",
                    "label": 0
                },
                {
                    "sent": "That doesn't make them the same as far as the Kripke semantics is concerned, right there?",
                    "label": 0
                },
                {
                    "sent": "Two different points.",
                    "label": 0
                },
                {
                    "sent": "They have the same valuation, that's OK. Alright, now let's work through something.",
                    "label": 0
                },
                {
                    "sent": "What's the truth?",
                    "label": 0
                },
                {
                    "sent": "Value of Diamond P1 at W not?",
                    "label": 0
                },
                {
                    "sent": "I haven't told you.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "I haven't told you how to evaluate anything larger than atomic formula.",
                    "label": 0
                },
                {
                    "sent": "So you can't answer those questions at the moment.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now we'll go through the recursion steps that we need.",
                    "label": 0
                },
                {
                    "sent": "What have I just drawn up tell tell me another way of saying what's on that board or on that slide?",
                    "label": 0
                },
                {
                    "sent": "Is there anything modal up there?",
                    "label": 0
                },
                {
                    "sent": "Is there anything to do with boxes and don't put your password?",
                    "label": 0
                },
                {
                    "sent": "Exactly, it's just a different way of writing up truth tables.",
                    "label": 0
                },
                {
                    "sent": "I've seen this is classical propositional logic.",
                    "label": 0
                },
                {
                    "sent": "It says the negation of a formula is true at W exactly when the fire underneath is false, it W. It's just a truth table for negation.",
                    "label": 0
                },
                {
                    "sent": "Just flip right?",
                    "label": 0
                },
                {
                    "sent": "Truth table for conjunction says W makes the conjunction true exactly when it makes each of the conjunct true.",
                    "label": 0
                },
                {
                    "sent": "It's just the truth table again.",
                    "label": 0
                },
                {
                    "sent": "And disjunction is the same and all I'm doing here is, I'm just pointing out that I'm just rewriting the fireplace size, not file aside, Yep.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so I've left on lifting the function now.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So good question.",
                    "label": 0
                },
                {
                    "sent": "So here the V was defined to be world cross atoms.",
                    "label": 0
                },
                {
                    "sent": "OK so over here you saw World Cross Adam World Cross Adam or Cross Adam and suddenly I switch to larger formula case on lifting the function up the larger formula but I have to tell you how to lift it and this is the way you do it.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so now what we can talk about is we can talk about the truth value of a larger formula at these worlds as long as it's a classical formula, what do you do?",
                    "label": 1
                },
                {
                    "sent": "Just use the truth tables, right?",
                    "label": 0
                },
                {
                    "sent": "So imagine that there's a truth table attached to every one of these.",
                    "label": 0
                },
                {
                    "sent": "For classical logic, So what have we got?",
                    "label": 0
                },
                {
                    "sent": "We've got some sort of distributed classical logic, right?",
                    "label": 0
                },
                {
                    "sent": "We've got copies of classical logic in different places, with arcs connecting them.",
                    "label": 0
                },
                {
                    "sent": "Really, that's all it is.",
                    "label": 0
                },
                {
                    "sent": "It's all of these.",
                    "label": 0
                },
                {
                    "sent": "Every world is a valuation on the atoms which tells you exactly how the classical connectors behave at that world.",
                    "label": 0
                },
                {
                    "sent": "OK, so everything is true functional.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "It's still truth tables.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now is where we move to the non truth functional part.",
                    "label": 0
                },
                {
                    "sent": "So how do we evaluate Diamond and Box now?",
                    "label": 0
                },
                {
                    "sent": "This slide is slightly different to what's on your notes because I just wasn't happy with the way I'd written these clauses on the notes.",
                    "label": 0
                },
                {
                    "sent": "They were a bit confusing, right?",
                    "label": 0
                },
                {
                    "sent": "So you might want to just change it to that.",
                    "label": 0
                },
                {
                    "sent": "It's up to you.",
                    "label": 0
                },
                {
                    "sent": "Hopefully you should see the meaning.",
                    "label": 0
                },
                {
                    "sent": "OK, so now I'm going to.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to explain that I'm going to go to the example and the example is the same as up here, right?",
                    "label": 0
                },
                {
                    "sent": "So here we are.",
                    "label": 0
                },
                {
                    "sent": "What's the truth value of Diamond P3 at W nought the truth value of.",
                    "label": 0
                },
                {
                    "sent": "Dime where's W not here.",
                    "label": 0
                },
                {
                    "sent": "OK, the truth.",
                    "label": 0
                },
                {
                    "sent": "Value of Diamond P3.",
                    "label": 0
                },
                {
                    "sent": "At W 9, how do we evaluate it?",
                    "label": 0
                },
                {
                    "sent": "Well, we go through the clauses we say.",
                    "label": 0
                },
                {
                    "sent": "W Note is this guy.",
                    "label": 0
                },
                {
                    "sent": "OK, Diamond P3 is this guy.",
                    "label": 0
                },
                {
                    "sent": "So now I'm instantiating this shape to this.",
                    "label": 0
                },
                {
                    "sent": "Therefore what's the value of Phi?",
                    "label": 0
                },
                {
                    "sent": "Right the fuck if I'm instantiating that to that.",
                    "label": 0
                },
                {
                    "sent": "Then I peel off the diamond and the thing that's left is P3, right?",
                    "label": 0
                },
                {
                    "sent": "So far is P3 and I come across here and say, well, it's true.",
                    "label": 0
                },
                {
                    "sent": "If something or other.",
                    "label": 0
                },
                {
                    "sent": "Right, if some V in W. So if some V in W. Has two things.",
                    "label": 0
                },
                {
                    "sent": "WRV and.",
                    "label": 0
                },
                {
                    "sent": "The truth value of.",
                    "label": 0
                },
                {
                    "sent": "5V has to be true.",
                    "label": 0
                },
                {
                    "sent": "What's 5?",
                    "label": 0
                },
                {
                    "sent": "Right P3 OK?",
                    "label": 0
                },
                {
                    "sent": "What's W?",
                    "label": 0
                },
                {
                    "sent": "Hi, it's W not so.",
                    "label": 0
                },
                {
                    "sent": "This now here.",
                    "label": 0
                },
                {
                    "sent": "Hopefully you can see that that statement there is AL version for this particular example of this clause.",
                    "label": 0
                },
                {
                    "sent": "If some V in W has WR V and data.",
                    "label": 1
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So there are two things to look up.",
                    "label": 0
                },
                {
                    "sent": "We have to find some vertex.",
                    "label": 0
                },
                {
                    "sent": "Which is are related to Dublin or.",
                    "label": 0
                },
                {
                    "sent": "What does that mean?",
                    "label": 0
                },
                {
                    "sent": "There's an arrow.",
                    "label": 0
                },
                {
                    "sent": "From W nought to V in this crap.",
                    "label": 0
                },
                {
                    "sent": "So it's either this error that I write.",
                    "label": 0
                },
                {
                    "sent": "And the truth value of P3 at that V the vertex that we go to has to be true.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "Is it this one?",
                    "label": 0
                },
                {
                    "sent": "No why because remember that the truth value of P3 here is false.",
                    "label": 0
                },
                {
                    "sent": "That was something that I stipulated.",
                    "label": 0
                },
                {
                    "sent": "OK, so can this V. BW2 well it W nought RV holds if this is the V that's fine.",
                    "label": 0
                },
                {
                    "sent": "But then this part fails 'cause the truth value of P3 at this point is not true.",
                    "label": 0
                },
                {
                    "sent": "It's false.",
                    "label": 0
                },
                {
                    "sent": "Alright, let's go up here.",
                    "label": 0
                },
                {
                    "sent": "Can it be this one?",
                    "label": 0
                },
                {
                    "sent": "Well, W nought RW One holds so V could be W one.",
                    "label": 0
                },
                {
                    "sent": "And then the truth value of P3 at W one is true.",
                    "label": 0
                },
                {
                    "sent": "OK, so sorry that it's taken as this long, but all of these is.",
                    "label": 0
                },
                {
                    "sent": "Some.",
                    "label": 0
                },
                {
                    "sent": "One step.",
                    "label": 0
                },
                {
                    "sent": "A successor.",
                    "label": 0
                },
                {
                    "sent": "This is another way that I could say it.",
                    "label": 0
                },
                {
                    "sent": "Makes P3 true.",
                    "label": 0
                },
                {
                    "sent": "That's what diamond.",
                    "label": 0
                },
                {
                    "sent": "That's how you might think of Diamond P3.",
                    "label": 0
                },
                {
                    "sent": "Someone step our successor makes P3 true OK?",
                    "label": 0
                },
                {
                    "sent": "And then boxes the jewel boxes for all of the world's which are related to W. Fire has to be true there.",
                    "label": 0
                },
                {
                    "sent": "It doesn't matter what happens at the worlds which are not are related.",
                    "label": 0
                },
                {
                    "sent": "But at all at all, the one step our successes fire has to be true.",
                    "label": 0
                },
                {
                    "sent": "So let's do the other example W 1 box P1, so W 1.",
                    "label": 0
                },
                {
                    "sent": "Box P1.",
                    "label": 0
                },
                {
                    "sent": "OK, so let's go through the claws.",
                    "label": 0
                },
                {
                    "sent": "If every if every world V, which is a one step, our successor, W, makes the smaller formula true.",
                    "label": 0
                },
                {
                    "sent": "That's what that says.",
                    "label": 0
                },
                {
                    "sent": "Every once step, our successor makes the smaller formula of truth.",
                    "label": 0
                },
                {
                    "sent": "So what's the smaller formula?",
                    "label": 0
                },
                {
                    "sent": "It's P1.",
                    "label": 0
                },
                {
                    "sent": "What are we trying to do?",
                    "label": 0
                },
                {
                    "sent": "We're trying to say.",
                    "label": 0
                },
                {
                    "sent": "Does every one step our successor of W One make P1 true?",
                    "label": 0
                },
                {
                    "sent": "How many are are successes?",
                    "label": 0
                },
                {
                    "sent": "Does W1 have?",
                    "label": 0
                },
                {
                    "sent": "It's a dead end.",
                    "label": 0
                },
                {
                    "sent": "It doesn't have any ice exists, right?",
                    "label": 0
                },
                {
                    "sent": "So how do we interpret the every?",
                    "label": 0
                },
                {
                    "sent": "There are two ways you can either say well it's undefined or something like that.",
                    "label": 0
                },
                {
                    "sent": "Or you just say, well, that's fine.",
                    "label": 0
                },
                {
                    "sent": "If there are no our successes, then every our successor does make something something true.",
                    "label": 0
                },
                {
                    "sent": "It's a vacuous statement, right?",
                    "label": 0
                },
                {
                    "sent": "So we interpret it that way.",
                    "label": 0
                },
                {
                    "sent": "So actually the truth value here.",
                    "label": 0
                },
                {
                    "sent": "So the truth value of box P1 at W one is true.",
                    "label": 0
                },
                {
                    "sent": "What if I asked you arbitrarily traer only?",
                    "label": 0
                },
                {
                    "sent": "What's the truth value of any formula you like that's boxed?",
                    "label": 1
                },
                {
                    "sent": "At this world.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to tell you what phase, but you can tell me what the truth value is, 'cause it's the same thing, right?",
                    "label": 0
                },
                {
                    "sent": "It's the same vacuous statement if it's a dead end, then every successor blah blah blah blah blah.",
                    "label": 0
                },
                {
                    "sent": "You can plug in anything you like.",
                    "label": 0
                },
                {
                    "sent": "So dead ends make every box formula true.",
                    "label": 0
                },
                {
                    "sent": "Are we in a problem here because look?",
                    "label": 0
                },
                {
                    "sent": "This is going to be true, but now I can do this as well.",
                    "label": 0
                },
                {
                    "sent": "Is that a problem?",
                    "label": 0
                },
                {
                    "sent": "You need to be a bit careful.",
                    "label": 0
                },
                {
                    "sent": "These are not negations of each other.",
                    "label": 0
                },
                {
                    "sent": "I'm not saying that some formula is true at W, and its negation is true at WK, so there's some subtlety.",
                    "label": 0
                },
                {
                    "sent": "So dead ends behave in strange may ways.",
                    "label": 0
                },
                {
                    "sent": "They may call box formula true.",
                    "label": 0
                },
                {
                    "sent": "Hey.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "I'll let you work through this last one here.",
                    "label": 0
                },
                {
                    "sent": "OK, Diamond box P1.",
                    "label": 0
                },
                {
                    "sent": "Roughly speaking, what it says is this.",
                    "label": 0
                },
                {
                    "sent": "There is at least one.",
                    "label": 0
                },
                {
                    "sent": "Sorry, someone stuck someone step are successor of W nought.",
                    "label": 0
                },
                {
                    "sent": "He's such that every one step, our successor on that guy makes P1 true.",
                    "label": 0
                },
                {
                    "sent": "Right, and I claim that that's true.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because you can come here, or you can go there actually right?",
                    "label": 0
                },
                {
                    "sent": "Because both of these are dead ends.",
                    "label": 0
                },
                {
                    "sent": "So box P1 is going to be true at both of them.",
                    "label": 0
                },
                {
                    "sent": "Right and Diamond just says pick one, either one.",
                    "label": 0
                },
                {
                    "sent": "I don't care.",
                    "label": 0
                },
                {
                    "sent": "OK, I'll let you go through that and.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Oh boy, we've got some catching up to do, but I really I really did need to go slowly.",
                    "label": 0
                },
                {
                    "sent": "I think to try and keep everyone OK. What I'd like you to do is just go through some of these at your own leisure.",
                    "label": 0
                },
                {
                    "sent": "I hope that I've covered enough detail here to allow you to work through this.",
                    "label": 0
                },
                {
                    "sent": "OK, I'm going to skip this slide 'cause I just have to, but the main thing that I'm trying to get across here is.",
                    "label": 0
                },
                {
                    "sent": "That this equivalence holds.",
                    "label": 0
                },
                {
                    "sent": "Right that box fight implies not diamond, not fire holes and diamond fire implies not box not fire halts.",
                    "label": 0
                },
                {
                    "sent": "OK, try and work yourself through that.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK. Um?",
                    "label": 0
                },
                {
                    "sent": "Now, are we supposed to have a break at 10?",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Shall we just?",
                    "label": 0
                },
                {
                    "sent": "Just wondering how far are you Bud?",
                    "label": 0
                },
                {
                    "sent": "OK, let me just.",
                    "label": 0
                },
                {
                    "sent": "I've got.",
                    "label": 0
                },
                {
                    "sent": "Quite a lot to go of this lecture so.",
                    "label": 0
                },
                {
                    "sent": "It might be better.",
                    "label": 0
                },
                {
                    "sent": "Right, what I'll do is I'll do one more slide and then get onto this notion of Phi implies a Pfizer logical consequence of gamma after the break, OK?",
                    "label": 0
                },
                {
                    "sent": "Just see if they've got anything set up for us.",
                    "label": 0
                },
                {
                    "sent": "Looks like it's under the shade over there.",
                    "label": 0
                },
                {
                    "sent": "I just want to go through this one thing.",
                    "label": 0
                },
                {
                    "sent": "So what I'm trying to say here is that modal logic is sometimes known as a non classical logic.",
                    "label": 0
                },
                {
                    "sent": "OK, you'll often hear this term, but at its underlying base it's really classical in the sense that everything is either true or false.",
                    "label": 0
                },
                {
                    "sent": "OK, it's non classical.",
                    "label": 0
                },
                {
                    "sent": "Because of this graph structure.",
                    "label": 0
                },
                {
                    "sent": "Right, and the fact that the truth values of diamond in boxes is not truth functional, right?",
                    "label": 0
                },
                {
                    "sent": "You can't come.",
                    "label": 0
                },
                {
                    "sent": "You can't evaluate the truth value of Diamond P3 at this world using a truth table sitting here, right?",
                    "label": 0
                },
                {
                    "sent": "It depends on the edges.",
                    "label": 0
                },
                {
                    "sent": "So if I rub out one edge, the truth value might change, whereas at these particular worlds where there are the truth tables, you know rubbing out an edge doesn't change the value and of how the truth table behaves here.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is an attempt to show you that Kripke semantics is classical based and it's approved, and I want to work through it just to show you how some proofs work because there's not much point teaching your logic if I don't teach you how some proofs work.",
                    "label": 0
                },
                {
                    "sent": "So this is a proof which is an induction.",
                    "label": 0
                },
                {
                    "sent": "OK, so I claim that for every Kripke model.",
                    "label": 0
                },
                {
                    "sent": "Any world in any formula.",
                    "label": 0
                },
                {
                    "sent": "Either that formula is true at that world or else that formula is false at that world.",
                    "label": 0
                },
                {
                    "sent": "Right, that's what I'm going to prove and what I do so because it's an arbitrary Kripke model I'm going to just pick anyone W RV.",
                    "label": 0
                },
                {
                    "sent": "Pick any W like you like.",
                    "label": 1
                },
                {
                    "sent": "Pick any formula you like.",
                    "label": 1
                },
                {
                    "sent": "I don't know what it looks like, but then I'm going to proceed by induction on its shape on its length.",
                    "label": 1
                },
                {
                    "sent": "Alright, so then I'm going to say what if fires in atomic formula?",
                    "label": 0
                },
                {
                    "sent": "What if I is a bigger formula?",
                    "label": 0
                },
                {
                    "sent": "Those are the two steps.",
                    "label": 0
                },
                {
                    "sent": "So what if I is an atomic formula?",
                    "label": 1
                },
                {
                    "sent": "Well, you've got.",
                    "label": 0
                },
                {
                    "sent": "I don't even need to draw anything here.",
                    "label": 0
                },
                {
                    "sent": "You've got if I, as an atomic formula, then you know that either the Atom P whatever it is P53P3P2 is either true or false at W. Right, what 'cause?",
                    "label": 0
                },
                {
                    "sent": "That's the way the valuation is defined.",
                    "label": 0
                },
                {
                    "sent": "The valuation tells you pick your world and go along here until you find your Adam and look up.",
                    "label": 0
                },
                {
                    "sent": "Look up the truth value and it's going to be either true or false.",
                    "label": 1
                },
                {
                    "sent": "So on the atoms it's by definition of the valuation.",
                    "label": 0
                },
                {
                    "sent": "Valuation is binary.",
                    "label": 0
                },
                {
                    "sent": "And now you just have to convince yourself that the connectives maintain the classicality.",
                    "label": 0
                },
                {
                    "sent": "OK. Hello, that's one way of stopping electric lecture for a break.",
                    "label": 0
                },
                {
                    "sent": "Any way to access the menu wait come back?",
                    "label": 0
                },
                {
                    "sent": "Computer.",
                    "label": 0
                },
                {
                    "sent": "So what do I need to do so it's the computer, right, sorry.",
                    "label": 0
                },
                {
                    "sent": "Lock the laptop.",
                    "label": 0
                },
                {
                    "sent": "Am I going to get anything?",
                    "label": 0
                },
                {
                    "sent": "Video projector on projector is powering up or the projectors turned itself off alright.",
                    "label": 0
                },
                {
                    "sent": "Doesn't really matter.",
                    "label": 0
                },
                {
                    "sent": "Let's just look at the case.",
                    "label": 0
                },
                {
                    "sent": "So you know that it holds for atomic formula.",
                    "label": 0
                },
                {
                    "sent": "Now let's pick.",
                    "label": 0
                },
                {
                    "sent": "A formula of an arbitrary size, so the formula is of size N greater than zero.",
                    "label": 0
                },
                {
                    "sent": "It's some end which is greater than zero.",
                    "label": 0
                },
                {
                    "sent": "I don't know how big or what I'm going to assume.",
                    "label": 0
                },
                {
                    "sent": "Is that the lemma?",
                    "label": 0
                },
                {
                    "sent": "Holds.",
                    "label": 0
                },
                {
                    "sent": "For all.",
                    "label": 0
                },
                {
                    "sent": "Smaller in length formula.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is the induction hypothesis.",
                    "label": 0
                },
                {
                    "sent": "So if I is of length N. Then any formula which is smaller than five.",
                    "label": 1
                },
                {
                    "sent": "Obeys the lemma.",
                    "label": 0
                },
                {
                    "sent": "In other words, it.",
                    "label": 0
                },
                {
                    "sent": "It'll either be true or false at any particular world, right?",
                    "label": 0
                },
                {
                    "sent": "So you here's our world, and now you just go through the cases.",
                    "label": 0
                },
                {
                    "sent": "Suppose that Pfizer conjunction.",
                    "label": 0
                },
                {
                    "sent": "So suppose it's a conjunction of the form, say Cy and Chi.",
                    "label": 0
                },
                {
                    "sent": "Right Pfizer conjunction.",
                    "label": 0
                },
                {
                    "sent": "What is the truth table tell you?",
                    "label": 0
                },
                {
                    "sent": "Well, it tells you that this guy is true.",
                    "label": 0
                },
                {
                    "sent": "If size true and Chi is true.",
                    "label": 0
                },
                {
                    "sent": "Hi Peter OK now these guys are smaller.",
                    "label": 0
                },
                {
                    "sent": "Apply the induction hypothesis and it tells you that either this is true at W nought or it's false at W not.",
                    "label": 0
                },
                {
                    "sent": "You can't have both either.",
                    "label": 0
                },
                {
                    "sent": "This is true at this W or it's false.",
                    "label": 0
                },
                {
                    "sent": "It W you can't have both and depending on the floor combinations one of them will be the conjunction conjunctive one and you just apply the truth table.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Doesn't matter if you don't get the details right, it's you just need to work through this.",
                    "label": 0
                },
                {
                    "sent": "Why have I?",
                    "label": 0
                },
                {
                    "sent": "Why have I lost the screen?",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Sorry about that.",
                    "label": 0
                },
                {
                    "sent": "It's on your lecture notes.",
                    "label": 0
                },
                {
                    "sent": "Just work through that at your own leisure, but I just wanted to get across to you that modal logic is classical based.",
                    "label": 0
                },
                {
                    "sent": "OK, so how about?",
                    "label": 0
                },
                {
                    "sent": "We come back at quarter past say we only get a 10 minute break, but it just helps me catch up a bit.",
                    "label": 0
                },
                {
                    "sent": "Yeah, OK?",
                    "label": 0
                },
                {
                    "sent": "See you then.",
                    "label": 0
                }
            ]
        }
    }
}