{
    "id": "a2xorx4ly5euifvhq4fnerkxqxhb6t2m",
    "title": "PVC and cooperation from AI perspective",
    "info": {
        "author": [
            "Servane Crave, France Telecom Research"
        ],
        "published": "Oct. 17, 2007",
        "recorded": "September 2007",
        "category": [
            "Top->Business->Virtual Communities"
        ]
    },
    "url": "http://videolectures.net/ess07_crave_pca/",
    "segmentation": [
        [
            "This way OK so I'm 7 carbon.",
            "The senior researcher at Causticum Orange Labs.",
            "Orange Labs are is or research and development center with more than factors and engineers working in this.",
            "Different centers do have seven locations in France and also seven laboratories worldwide.",
            "For instance in San Francisco in Tokyo and being also in Egypt since beginning of 2007.",
            "So my presentation's media said will be about professional Jeter qualities.",
            "It's a concept we have extensive developed in one world package of equal it and I would like to emphasize my presentation first on professional virtual communities to give you a background on what it is and also on cooperation.",
            "Collaboration from AI perspective better so far from organizational Sciences perspective, I am researcher in management science, not in really technical.",
            "So if you have too much technical question, I hope my colleagues from the code it will support.",
            "So let's start so."
        ],
        [
            "Yes, and I will be the first.",
            "I will introduce a PC and professional virtual community and virtual team concept after I will do a presentation about what I called the forces and I will make a focus on coordination, cooperation and collaboration.",
            "In the third part of my presentation, I will speak about the different forms of coordination which can support cooperation and collaboration, and I will make a brief conclusion and I hope we can have some discussion."
        ],
        [
            "So I don't know if you are familiar with communities, virtual communities, business oriented community communities, So what?",
            "What is a community?",
            "Use here is the definition of Bender from 1982, which who says that the community inverts a limited number of people in a somewhat restrictive social social space or network L together by shared understandings and a sense of obligation.",
            "As you can see, this definition is from 1982, so it's really focused on face to face meetings in order to build this community and individuals in this community are bound together by.",
            "Affective or emotional ties riser by perception of individual self in tourists.",
            "So we already have the idea of reciprocity and there is a witness.",
            "It means one is a member and all together then years later, writing wrangled in 1993 gives the first definition for virtual communities, which are social aggregations that can emerge from the Internet when enough people carry on those public discussions long enough.",
            "We sufficient human feeling to form webs of personal relationship relationships in cyberspace.",
            "So what are professional virtual communities?",
            "As I told you, it is one of the work package of equality and GM of this work.",
            "Package was to define guidelines, methodologies to build professional virtual community but also to workout what we call an advanced collaborative platform where members of this professional virtual communities can change can get socialized and can also find business opportunities.",
            "So professional qualities are in an out accompany.",
            "The unit is not the organization, but it, it's the individual.",
            "It means it's a knowledge worker, for instance, and some questions about this.",
            "What does this imply?",
            "It implies to develop a social indentity to share, increase and create new knowledge, and it needs to have strong business orientation.",
            "And then just interested value of a business oriented virtual community is to foster innovation.",
            "So the question now is how does it work?"
        ],
        [
            "So she quit professional.",
            "Virtual community is an Association of individuals.",
            "As I said before, knowledge workers who are identified by specific knowledge scope with an explicit business orientation.",
            "So who can?",
            "Can they be?",
            "They can be.",
            "Second, be consultant that can be individual professional.",
            "They can be people who just retired, for instance, or they can belong to large companies.",
            "They can belong to SMS to universities or to private or public research centers.",
            "And.",
            "UPS Jim is to create virtual team when there is a customer request.",
            "For instance foreign you need for knowledge service for expertise for instance and virtual team is created in the professional virtual community to anther.",
            "This customers this customer request and the idea is that the virtual team is going to deliver professional service and we get back money which will be shared amongst different members of the professional virtual community.",
            "And the interaction among the different members.",
            "As you can see, there can be in large organizations that can be in the semis, or they can be really freelancers's interaction is optimized by the use of ICT mediatic tools and also by face to face mechanisms."
        ],
        [
            "What is the mission of the PC PC mission consisting generating value through its members, interaction, sharing and collaboration value generated value consists of advanced knowledge, professional services and also social capital at an ocean of familiar with social capital, social capital is everything about trust.",
            "Reciprocity, being together and having experiences in order to develop trust.",
            "An which is quite new in the definition we've done about professional virtual communities is that we take into account a new dimension which is not that much developed in virtual communities, which is a business dimension knowledge.",
            "You know, maybe you know communities of practice which can be in large organizations, for instance, for sharing expense, sharing knowledge, sorry among experts, for instance.",
            "You can also have virtual communities for social socialization and the PC's then designed to better deliver innovation and maximize the realization of individuals."
        ],
        [
            "Pink.",
            "Here you are, but I was just saying communities of practice where you have social and knowledge dimensions which are addressed.",
            "If you want some more references.",
            "But communities of practice, you can refer to vengeur, for instance was really the first one to define what the Community of practices and the ID in and.",
            "Professional virtual community is absurd is to move towards the business towards business orientation.",
            "Because if you don't have, if you have individuals who are together for social and knowledge that made jeopardize some somehow the motivation and.",
            "Says there's a reason why there is a need for business dimension, and it can also reduce the scope of the Community activities because of a lack of motivation.",
            "What can we see in the activity of the Members in the professional Detroit communities?",
            "So if I start, for instance, with business capital capabilities?",
            "All members are asked to provide some personal marketing, for instance, capability of prospecting and selling own technical abilities to partners and customers take while they take into account the PVC competences, cooperation capability to effectively and efficiently work together with others and opportunities.",
            "Putting capability of identifying business opportunities.",
            "If I refer to social capital cities capabilities, one is networking.",
            "The idea is.",
            "To increase the access to new Contacts and maintain Contacts in the PC interaction capacity to establish relationships interaction.",
            "For instance, identifying common interests and share.",
            "Discuss individual views and flexibility, which is also quite important.",
            "Capability of adapting to different attitude.",
            "Different culture because of professional virtual community or even a virtual community can be cross boundaries worldwide and also overcoming related social barriers.",
            "Cousin knowledge capabilities.",
            "I'm sorry you can treat them very good, so that's three dimensions intuition.",
            "Which is a capability of developing new application of consolidating knowledge and developing new knowledge areas.",
            "Transferability capability to quickly and easily acquiring's consolidated knowledge and competence which is not previously previously owned, and employability capability of developing knowledge and competences.",
            "Free, usable for industrial applications so we can see that all these 3 dimensions are interrelated.",
            "Because if you don't have this knowledge capabilities.",
            "You won't have this power of innovation.",
            "If I give you an example for one activity, for instance, it will be too for member to applaud or to download knowledge to, open social forum and also contribute to a business opportunity.",
            "For instance in problem solving."
        ],
        [
            "Just.",
            "OK.",
            "So how does it work if we if we go through the PC lifecycle, we can see that we have for men.",
            "For men timelines, phases which is a PC creation which are for objective to go to give the members or readiness for cooperation.",
            "So it means that experts like in a community like in virtual community need to share common objectives and understand what's a common objective.",
            "Is.",
            "There is a sort need for shared commitment.",
            "It means that expert's can also be in the same domain and that the PC's identified specific business opportunities.",
            "In creation phase, large attention will also be put on coordination issue and also to attract new members.",
            "So second first is certainly the most interesting one because this is a PVC operation through virtual teams.",
            "I just gave you a short overview of what virtual team is and if we go more into details you can see that you've got the video creation video operation which can also evolve according to the customer request and at the end so VTD solution.",
            "What is very important here to see is that when a virtual team with this is is dissolved, it means that the customer customer has received and the expertise the knowledge has been transferred.",
            "The customers paid for instance and this increase what we call the body of knowledge of the professional virtual community.",
            "The 3rd third phase is a PC evolution.",
            "So we learn from experience from previous virtual team.",
            "We tried to tune to make it more adapted to the customers requirement and also will be to the market evolution and then you can see that there can be another one another Vitti and you can have similar simultaneously different virtual team at the end is the last phase.",
            "Is a PC metamorphosis and it can also mean the end of the PVC.",
            "For instance if there is no trust among members and they.",
            "Can't agree on shared objective on shared commitment so PC may disappear, but it's certainly an.",
            "And we should avoid so the idea is to go forward and two to envisage PVC, metamorphosis, metamorphosis which can be with the same people working here.",
            "The major changes in the PC objectives.",
            "So after this we have defined topology of the different PC which can exist, so I won't go very much into details.",
            "But if you want some more information feel free to send me an email and I can send you more information.",
            "So the first is the established single discipline, PVC.",
            "So it's based on a well established specific discipline.",
            "And.",
            "It means that this professional virtual Committee has already a consistent body of knowledge for guiding the discipline implementation in different application domains.",
            "The second one is the incipient discipline, PCPC I, which is based on potential new knowledge discipline which results from aggregating different multidisciplinary.",
            "Military discipline of a number of established disciplines and the last one is a challenge.",
            "Focused BC.",
            "And.",
            "The biggest in knowledge here won't be directly defined by the definition of a specific challenge with solution will be the basic mission of the PVC.",
            "So it means that you can have in this PC different competences and it means there is no.",
            "There is an unstructured body of knowledge which which will be designed for supporting which would be designed for supporting and addressing specific issues."
        ],
        [
            "I just don't use that.",
            "We have also developed an advanced collaborative platform forum for enabling or supporting coordination and cooperation in professional virtual community.",
            "So the first thing is that we we have the PC portal where a Member can access and after this we have three different.",
            "Vertical services, which are social services, knowledge services, business services and this is supported by what has been also different in IC inequality which is the ICT infrastructure and we will have a presentation of it later on this afternoon."
        ],
        [
            "Supporting the social dimension.",
            "So as I told you, do you part of Lincoln in for instance?",
            "No, you don't know Lincoln it OK, yes.",
            "OK, so here you've got.",
            "You've got some networking function.",
            "OK and legally.",
            "Unlink it and you've got releases, networking functions, them of this virtual community which is professional oriented but not business really business oriented is to make a network of professional, and if you're looking for a job you can address your network and trying to find the right people who can help you in finding a job, for instance so.",
            "For the case of professional virtual communities, we have developed a function which is about social and networking and another one which is quite basic but really important which is CSC W, an author.",
            "Cowork tools such as web 20 tools such as wikis and this will enable members to have on the same platform, instant messaging.",
            "Presence of ability video conference application and document sharing."
        ],
        [
            "For the knowledge dimension, we've developed ontology services which are of two kinds.",
            "First for finding documents and the other one for finding the right profile.",
            "When you're trying to build a virtual to virtual team.",
            "When you have a customer request, you need to find which profiles in your professional little committees will be best suitable for answering the customers request, and the second one is the knowledge IPR management services, which I'm not supporting.",
            "Certification identification and tracking of the knowledge created exchange among some members along with the identification and protection with associated Ipr's."
        ],
        [
            "And the third dimension is a business dimension where here you can choose between three different kind of collaboration.",
            "The first one is, yeah, duck collaborations.",
            "Someone is immediately collaboration, which is really in touch with problem solving, and the third one is a planned collaboration."
        ],
        [
            "OK, what does a key challenges associated to professional virtual communities first thing is managing interdependencies, which are represented by tacit interactions or explicit interactions among actors and managing or so complex task.",
            "And the sun was just the second one is to bring more flexibility.",
            "But this may also implies some organizational changes in the professional virtual community.",
            "Cooperation is critical since.",
            "Members as I told before, some members are freelancers, but they also have some additional activities.",
            "Also, members belong to companies, so they have to engage in boundary spanning activities in addition to accomplishing their ongoing work.",
            "So it means that there is a real need to know when people are available to work and to be sure that they will.",
            "They will be.",
            "They will respect a commitment if they have to deliver.",
            "If they have to work in the virtual team, for instance.",
            "Another thing is when you're thinking of across wandering virtual community, which has business or in addition it means that face to face meetings are often reduced or may not exist.",
            "So this platform, which has been developed in equally, should counterbalance the fact that people don't miss that often.",
            "And I think that you know that during face to face meetings that that's a place where trust is built where people share history.",
            "And that's the reason one for lot of European projects.",
            "You've gotta kick kick off meeting where people who don't know each other before the beginning of the project meet.",
            "And when you have virtual communities people know.",
            "Means that much.",
            "And the last one is important of norms, shared norms, shared commitment.",
            "So there's a kind of uncertain T in running a professional yet welcome you."
        ],
        [
            "She.",
            "So second parties from coordination to collaborate."
        ],
        [
            "I don't know if you're familiar with this.",
            "I want to escape communication because I thought we should.",
            "Do you speak of the four seas, but communication is just sending receiving emails.",
            "For instance, having a call it doesn't mean that you're doing something with someone else.",
            "So.",
            "Have the purpose of virtual communities.",
            "It's quite interesting to have a look at coordination, cooperation and collaboration for each one.",
            "I tried to define and I adapted this from Bola 2005 to define what is the purpose of using this approach?",
            "What is the desired outcome?",
            "And also some examples.",
            "The idea is coordination is the first step.",
            "If you.",
            "And cooperation is something more OK, just skip to it."
        ],
        [
            "Next, for instance, I think I should start with this.",
            "One.",
            "Coordination means that 1 + 1 equal 1 cooperation is 1 + 1 equal 2 and collaboration is 1 + 1 again 3.",
            "So it's strange though."
        ],
        [
            "Very true, but you will understand why.",
            "If I go to coordination.",
            "Is the idea is to avoid gaps and overlaps in individuals assigned work?",
            "And the outcome desired outcome is efficiently achieve results and meeting objectives.",
            "So you're really managing complex task in order to count as a result to the expected result.",
            "For instance, you have traffic flow regulation project to implement of the shape it.",
            "Application cooperation is another form of coordination.",
            "It means obtaining mutual benefit by sharing or partitioning work.",
            "To send this coordination, it's a nifty evolved form of coordination, but.",
            "What we can see from this that one outcome is saving in time and cost.",
            "So some examples coping with an epidemic or katastrophe operating your local community on unity utility and the last one is a collaboration.",
            "Where does it mean for conversion?",
            "The idea is we did that, so it's really oriented on innovation and all partners are working together symmetry simultaneously.",
            "So it means that superposes to achieve collective results that the participant would be unable to accomplish alone.",
            "The same for the outcome is the same then for cooperation.",
            "But if you want to be optimistic it's you had some innovation, extraordinary breakthrough breakthrough results and the collective.",
            "As I said, we did that accomplishment and one example is brainstorming to discover a dramatically better way to do something.",
            "And it's something which is really now.",
            "It's a core of all marketing research and also organizational research.",
            "It's Co.",
            "Creation.",
            "It mean you don't.",
            "You don't create on your own so company doesn't create an on on our own but involves different partners who can be suppliers or customers to create new services.",
            "So the more you go towards collaboration so more you move from efficiency to innovation.",
            "And it's certainly most difficult part here.",
            "Chief."
        ],
        [
            "So what is collaboration cooperation?",
            "You see that people helping each other but.",
            "They want to do it one after one.",
            "It's not work done altogether, so I found on Google this image for collaboration, which seems to be more reflection reflective white collaboration is, and if it takes this definition of polar collaboration and takes finding the right group of people but skills, personalities, knowledge, work styles, we can also add culture and chemistry and sharing the shared commitment.",
            "This is collaboration task at end and providing them with an environment, tools, knowledge, training process and facilitation to ensure they work together effectively.",
            "So what does this mean?",
            "This means that they must have a shared goal, sense of urgency and commitment which are linked productive participation process or so a sense of belonging and open communication and trust."
        ],
        [
            "To some examples.",
            "If you take for instance Vanguardian and Google who are to ask this, but came quite late to paintings because I fail in other professions submit.",
            "They work together and they help.",
            "They collaborate.",
            "Together to develop the technique and also some mastery that has endured ever since."
        ],
        [
            "Two other examples post went maybe a little controversial because the Human Genome Project.",
            "Maybe controversial because it's still.",
            "We don't know very, very well wait goes, but if we take a look behind, we see that it's 15 years of international collaboration that has really quick and scientific advances that will over over otherwise have taken at least generation longer.",
            "And the last one is about open source software like Mozilla Firefox, which is browser.",
            "Thunderbird, Thunderbird, which is a Mail.",
            "Mailer software and and view which is a website editor which are simple Internet softwares which have been developed in collaboration by parallel and sequential work of hundreds of individuals."
        ],
        [
            "Does it third part of my presentation is about forms of coordination to support cooperation and collaboration.",
            "So as I told you before, I do believe that cooperation and collaboration can't exist.",
            "If there is no coordination there evolved form of coordination and more you go towards collaborations and more innovation you can we can achieve.",
            "So if we come back to virtual communities, what are the what are the challenges of coordination for professional virtual communities?",
            "It aims at maximizing the network currents and check our well distributed members of a team work together.",
            "It's also of course very important for location of task.",
            "And resources among members coordination can also support the recognition and resolving of disparities of conflicts in goals, facts and belief and behavior of members.",
            "So open seas appear.",
            "We can have two modes of coordination, which can appear when unit coordinator with several executors or or set of executors acting each as coordinators.",
            "Things the first 4 starting with professional community having only one unit coordinator is certainly the slippers one.",
            "So if you distribute because if you distribute coordination task among the team members, this implies a strong project management and trust among Members to ensure that the different task will be achieved on the due time."
        ],
        [
            "Let's move not too.",
            "Organization of Science with Thomas Malone and Christen in 1990. Who defines this coordination theory?",
            "So you've got four different coordination processes, which are supported by two support processes and communication and decision-making, as opposed to collect and spread information towards correct coordination process is.",
            "So what does a deep for different one you've got managing share resources managing producer consumer relationship managing similarity.",
            "Constraint and also managing test sub task relationships.",
            "But what is really interesting is that melon considered that this coordination process is our nonproductive tasks there to be there but they are non productive for the company or for the Community."
        ],
        [
            "If you make an overview of what's a different method for analysing coordination processes are you can see that, for instance, if I from.",
            "Managing shared resource.",
            "If I take the computer science approach, that's techniques for processor scheduling and memory allocation in terms of coordination process is if I take management science or organization theory from Malone, it's analyzing.",
            "It's the analyze of different organizational structures, budgeting processes, organizational power, and resource dependence in economics and operations.",
            "Research analyst.",
            "And that is of markets and other resource allocation mechanisms, scheduling algorithm and also optimizations techniques.",
            "So it's quite interesting to see that according to Malone's coordination coordination theory, lot of different discipline of.",
            "Also in.",
            "Our so focused on developing techniques, so it means that if you want to manage resources it it can be really relevant to address while computer science with economics and operation and weather.",
            "So organization tourists have developed.",
            "For managing producer consumer relationships, computer science is focused of data flow, pitching it, and analysis in economics.",
            "You will find Pert charts, critical path, method, scheduling techniques in organization theory.",
            "You will find participle participatory design, market research for managing similarity constraints.",
            "Computer science will be focused on synchronization technique, mutual exclusion economics, an operation on scheduling techniques, and in organization theory on meeting scheduling, and also certain kind of process modeling.",
            "For managing tasks and subtasks, relationship, a computer science will be focused on modernization techniques in programming, planning in artificial intelligence.",
            "If you go to economics, it will be really focused when you're Speaking of managing the subtext relationship on economies of scale and scope, and for organization theory, it will be more on strategic planning.",
            "Management by objectives, method of grouping people into units so you can see that these three approaches are complementary.",
            "When you're Speaking of, for instance, managing tasks and subtasks relationship."
        ],
        [
            "If you go back to the virtual team.",
            "And if you think of the distribution of the problem solving in the context of virtual team, there are three different proposition for distributed solving problem, distributed problem solving.",
            "So first one is a distributed solving of problems and the key concept as specialist complementary skills solving more, distributing among actors and indeed for a complex expertise.",
            "And this is.",
            "Really adapted to visual team aiming at developing innovation.",
            "If I go to the salon proposition which is distributed solving of distributing problems is this proposition, it's a problem itself which is distributed.",
            "Agents can have similar skills and it can also be very adapted for cross borders virtual team for centralizing for instance, experience competences from different locations, different countries and member members can have.",
            "Same of complementary competences, and the last one is a distributed techniques for problem solving.",
            "Is the usage of interaction between a chance to solve problems and this relates to solving by coordination, and this is really adapted to virtual team with well defined objectives.",
            "And the objective is to optimize efficiency and to search for optimization for the allocation of tax where the domain and the expertise under distribute."
        ],
        [
            "What kind of form of coordination can can we have?",
            "We can have coordination by synchronization, which is the elementary form of coordination an it's away the action follow on from each other.",
            "The way in which the actions follow on from each other is very important and all coordination of actions as to describe this procedure precisely.",
            "And this induces a necessary synchronization.",
            "And synchronization is quoting when it comes to manage a similarity of several actions.",
            "Second one is coordination by planning and this might of coordination is a step by step approach with three main phases and is certainly the most traditional in artificial artificial intelligence.",
            "Which means this mean definition of the set of actions to be done to reach the objective with the production of different plans.",
            "The executive execution of the accepted plan and dynamic replying according to.",
            "Events which can occur during its execution, and this is really in the scope of virtual team because if you remember on the professional community life cycle during this Vt virtual team Life life cycle, you see that you have the creations operation and also the evolution.",
            "The third one is directive color, coordination.",
            "In this mode of coordination, favors in situ implementation of action instead of a priori.",
            "And it's mainly used in situation when it is very difficult to unset.",
            "Anticipate what is going to happen due to evolutionary context, for instance, but this one is quite dangerous because it may present constraints in terms of optimization of the result.",
            "It means that you've got butchered to send something to a customer, but you're not sure that you will really achieve it in the budget.",
            "And the last one is a coordination by regulation, which means enacting a set of rules of good behavior among actors in order to avoid all kind of conflict."
        ],
        [
            "If I refer to Ferbus ferbus value parameters in addition to form of coordination, it's quite interesting to see the ideas quitting some different criteria and putting parenza different forms of coordination so you can see, for instance, that.",
            "For predictability, planning is very good, but synchronization and reactive.",
            "For synchronization and for reactive form of coordination, it's slow as I said, just before, you can't really know what's going to happen.",
            "An avoidance of conflict can also be very interesting when you Speaking of professional virtual communities which have been just set up an where members don't know each other that much.",
            "If you have a reactive form of coordination, you can see that the avoidance of conflict will be poor because it may lead to a lot of conflict.",
            "So it means that this kind of form of coordination is not adapted to just create it.",
            "Greatest, another one is that the quantity of exchange.",
            "If you if you do planning, for instance you need a lot of exchange among numbers 3 emails for instance, and it's very different if you do reactive or reactive synchronization or regulation."
        ],
        [
            "Open what I've tried to do here is for each type of PC to detect which kind of coordination's could be interested and when.",
            "For instance, if I take if I take the first form of PVC with, which is established single discipline PC, you can see that according to the PC lifecycle creation, Operation, Evolution and Metamorphosis, it's more relevant to start with.",
            "Regulation synchronization and planning and after to go toward reactive 'cause I think that reactive is certainly C1 where?",
            "You will have some more of more collaboration and it means more innovation among members.",
            "For the second one, which is a PCI incipient discipline professional community, it's the idea is to start with form of regulated coordination.",
            "Associated with synchronization and after to go toward planning and reactive form of coordination and for the most challenging PC.",
            "We do things that we it will be interesting to start with.",
            "Regulation, form of coordination, regulation, form and quickly moved towards reactive form.",
            "Because this PC is really business opportunities oriented."
        ],
        [
            "My lifestyle will be about linking, AI coordinate and coordination tureens of frame of PVC and virtual team.",
            "And if I for instance take distributed serving of problem where competences are insufficient, when I try to do is to link here a coordination process proposed by Malone too.",
            "To this proposition.",
            "So if you if you don't have enough competences, if resources, for instance are insufficient, see the ID is here to have managing producer consumer relationship managing share resources as coordination process.",
            "First of all, if there for instance, the example of solving of disrated problems where competences can be sufficient resources sufficient but not share the idea here is to so is to manage.",
            "C Milton 80 contraints and the last one if you take distributed techniques for problem solving, where competences and resources as sufficient as ordination process involved will be to manage task and sub task relationships."
        ],
        [
            "Thank you for your attention and if you have any questions.",
            "Do you have any question?",
            "Any kind?",
            "Close friends doing in football.",
            "I don't know."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This way OK so I'm 7 carbon.",
                    "label": 0
                },
                {
                    "sent": "The senior researcher at Causticum Orange Labs.",
                    "label": 1
                },
                {
                    "sent": "Orange Labs are is or research and development center with more than factors and engineers working in this.",
                    "label": 0
                },
                {
                    "sent": "Different centers do have seven locations in France and also seven laboratories worldwide.",
                    "label": 0
                },
                {
                    "sent": "For instance in San Francisco in Tokyo and being also in Egypt since beginning of 2007.",
                    "label": 0
                },
                {
                    "sent": "So my presentation's media said will be about professional Jeter qualities.",
                    "label": 0
                },
                {
                    "sent": "It's a concept we have extensive developed in one world package of equal it and I would like to emphasize my presentation first on professional virtual communities to give you a background on what it is and also on cooperation.",
                    "label": 0
                },
                {
                    "sent": "Collaboration from AI perspective better so far from organizational Sciences perspective, I am researcher in management science, not in really technical.",
                    "label": 1
                },
                {
                    "sent": "So if you have too much technical question, I hope my colleagues from the code it will support.",
                    "label": 0
                },
                {
                    "sent": "So let's start so.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yes, and I will be the first.",
                    "label": 0
                },
                {
                    "sent": "I will introduce a PC and professional virtual community and virtual team concept after I will do a presentation about what I called the forces and I will make a focus on coordination, cooperation and collaboration.",
                    "label": 0
                },
                {
                    "sent": "In the third part of my presentation, I will speak about the different forms of coordination which can support cooperation and collaboration, and I will make a brief conclusion and I hope we can have some discussion.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I don't know if you are familiar with communities, virtual communities, business oriented community communities, So what?",
                    "label": 0
                },
                {
                    "sent": "What is a community?",
                    "label": 0
                },
                {
                    "sent": "Use here is the definition of Bender from 1982, which who says that the community inverts a limited number of people in a somewhat restrictive social social space or network L together by shared understandings and a sense of obligation.",
                    "label": 0
                },
                {
                    "sent": "As you can see, this definition is from 1982, so it's really focused on face to face meetings in order to build this community and individuals in this community are bound together by.",
                    "label": 0
                },
                {
                    "sent": "Affective or emotional ties riser by perception of individual self in tourists.",
                    "label": 0
                },
                {
                    "sent": "So we already have the idea of reciprocity and there is a witness.",
                    "label": 0
                },
                {
                    "sent": "It means one is a member and all together then years later, writing wrangled in 1993 gives the first definition for virtual communities, which are social aggregations that can emerge from the Internet when enough people carry on those public discussions long enough.",
                    "label": 0
                },
                {
                    "sent": "We sufficient human feeling to form webs of personal relationship relationships in cyberspace.",
                    "label": 0
                },
                {
                    "sent": "So what are professional virtual communities?",
                    "label": 1
                },
                {
                    "sent": "As I told you, it is one of the work package of equality and GM of this work.",
                    "label": 0
                },
                {
                    "sent": "Package was to define guidelines, methodologies to build professional virtual community but also to workout what we call an advanced collaborative platform where members of this professional virtual communities can change can get socialized and can also find business opportunities.",
                    "label": 0
                },
                {
                    "sent": "So professional qualities are in an out accompany.",
                    "label": 0
                },
                {
                    "sent": "The unit is not the organization, but it, it's the individual.",
                    "label": 1
                },
                {
                    "sent": "It means it's a knowledge worker, for instance, and some questions about this.",
                    "label": 0
                },
                {
                    "sent": "What does this imply?",
                    "label": 0
                },
                {
                    "sent": "It implies to develop a social indentity to share, increase and create new knowledge, and it needs to have strong business orientation.",
                    "label": 1
                },
                {
                    "sent": "And then just interested value of a business oriented virtual community is to foster innovation.",
                    "label": 1
                },
                {
                    "sent": "So the question now is how does it work?",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So she quit professional.",
                    "label": 0
                },
                {
                    "sent": "Virtual community is an Association of individuals.",
                    "label": 1
                },
                {
                    "sent": "As I said before, knowledge workers who are identified by specific knowledge scope with an explicit business orientation.",
                    "label": 1
                },
                {
                    "sent": "So who can?",
                    "label": 0
                },
                {
                    "sent": "Can they be?",
                    "label": 1
                },
                {
                    "sent": "They can be.",
                    "label": 0
                },
                {
                    "sent": "Second, be consultant that can be individual professional.",
                    "label": 0
                },
                {
                    "sent": "They can be people who just retired, for instance, or they can belong to large companies.",
                    "label": 0
                },
                {
                    "sent": "They can belong to SMS to universities or to private or public research centers.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "UPS Jim is to create virtual team when there is a customer request.",
                    "label": 0
                },
                {
                    "sent": "For instance foreign you need for knowledge service for expertise for instance and virtual team is created in the professional virtual community to anther.",
                    "label": 0
                },
                {
                    "sent": "This customers this customer request and the idea is that the virtual team is going to deliver professional service and we get back money which will be shared amongst different members of the professional virtual community.",
                    "label": 0
                },
                {
                    "sent": "And the interaction among the different members.",
                    "label": 1
                },
                {
                    "sent": "As you can see, there can be in large organizations that can be in the semis, or they can be really freelancers's interaction is optimized by the use of ICT mediatic tools and also by face to face mechanisms.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What is the mission of the PC PC mission consisting generating value through its members, interaction, sharing and collaboration value generated value consists of advanced knowledge, professional services and also social capital at an ocean of familiar with social capital, social capital is everything about trust.",
                    "label": 1
                },
                {
                    "sent": "Reciprocity, being together and having experiences in order to develop trust.",
                    "label": 0
                },
                {
                    "sent": "An which is quite new in the definition we've done about professional virtual communities is that we take into account a new dimension which is not that much developed in virtual communities, which is a business dimension knowledge.",
                    "label": 0
                },
                {
                    "sent": "You know, maybe you know communities of practice which can be in large organizations, for instance, for sharing expense, sharing knowledge, sorry among experts, for instance.",
                    "label": 1
                },
                {
                    "sent": "You can also have virtual communities for social socialization and the PC's then designed to better deliver innovation and maximize the realization of individuals.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Pink.",
                    "label": 0
                },
                {
                    "sent": "Here you are, but I was just saying communities of practice where you have social and knowledge dimensions which are addressed.",
                    "label": 0
                },
                {
                    "sent": "If you want some more references.",
                    "label": 0
                },
                {
                    "sent": "But communities of practice, you can refer to vengeur, for instance was really the first one to define what the Community of practices and the ID in and.",
                    "label": 1
                },
                {
                    "sent": "Professional virtual community is absurd is to move towards the business towards business orientation.",
                    "label": 1
                },
                {
                    "sent": "Because if you don't have, if you have individuals who are together for social and knowledge that made jeopardize some somehow the motivation and.",
                    "label": 1
                },
                {
                    "sent": "Says there's a reason why there is a need for business dimension, and it can also reduce the scope of the Community activities because of a lack of motivation.",
                    "label": 1
                },
                {
                    "sent": "What can we see in the activity of the Members in the professional Detroit communities?",
                    "label": 0
                },
                {
                    "sent": "So if I start, for instance, with business capital capabilities?",
                    "label": 0
                },
                {
                    "sent": "All members are asked to provide some personal marketing, for instance, capability of prospecting and selling own technical abilities to partners and customers take while they take into account the PVC competences, cooperation capability to effectively and efficiently work together with others and opportunities.",
                    "label": 0
                },
                {
                    "sent": "Putting capability of identifying business opportunities.",
                    "label": 0
                },
                {
                    "sent": "If I refer to social capital cities capabilities, one is networking.",
                    "label": 0
                },
                {
                    "sent": "The idea is.",
                    "label": 0
                },
                {
                    "sent": "To increase the access to new Contacts and maintain Contacts in the PC interaction capacity to establish relationships interaction.",
                    "label": 0
                },
                {
                    "sent": "For instance, identifying common interests and share.",
                    "label": 0
                },
                {
                    "sent": "Discuss individual views and flexibility, which is also quite important.",
                    "label": 0
                },
                {
                    "sent": "Capability of adapting to different attitude.",
                    "label": 0
                },
                {
                    "sent": "Different culture because of professional virtual community or even a virtual community can be cross boundaries worldwide and also overcoming related social barriers.",
                    "label": 0
                },
                {
                    "sent": "Cousin knowledge capabilities.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry you can treat them very good, so that's three dimensions intuition.",
                    "label": 0
                },
                {
                    "sent": "Which is a capability of developing new application of consolidating knowledge and developing new knowledge areas.",
                    "label": 1
                },
                {
                    "sent": "Transferability capability to quickly and easily acquiring's consolidated knowledge and competence which is not previously previously owned, and employability capability of developing knowledge and competences.",
                    "label": 0
                },
                {
                    "sent": "Free, usable for industrial applications so we can see that all these 3 dimensions are interrelated.",
                    "label": 0
                },
                {
                    "sent": "Because if you don't have this knowledge capabilities.",
                    "label": 0
                },
                {
                    "sent": "You won't have this power of innovation.",
                    "label": 0
                },
                {
                    "sent": "If I give you an example for one activity, for instance, it will be too for member to applaud or to download knowledge to, open social forum and also contribute to a business opportunity.",
                    "label": 0
                },
                {
                    "sent": "For instance in problem solving.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So how does it work if we if we go through the PC lifecycle, we can see that we have for men.",
                    "label": 0
                },
                {
                    "sent": "For men timelines, phases which is a PC creation which are for objective to go to give the members or readiness for cooperation.",
                    "label": 0
                },
                {
                    "sent": "So it means that experts like in a community like in virtual community need to share common objectives and understand what's a common objective.",
                    "label": 0
                },
                {
                    "sent": "Is.",
                    "label": 0
                },
                {
                    "sent": "There is a sort need for shared commitment.",
                    "label": 0
                },
                {
                    "sent": "It means that expert's can also be in the same domain and that the PC's identified specific business opportunities.",
                    "label": 0
                },
                {
                    "sent": "In creation phase, large attention will also be put on coordination issue and also to attract new members.",
                    "label": 0
                },
                {
                    "sent": "So second first is certainly the most interesting one because this is a PVC operation through virtual teams.",
                    "label": 0
                },
                {
                    "sent": "I just gave you a short overview of what virtual team is and if we go more into details you can see that you've got the video creation video operation which can also evolve according to the customer request and at the end so VTD solution.",
                    "label": 0
                },
                {
                    "sent": "What is very important here to see is that when a virtual team with this is is dissolved, it means that the customer customer has received and the expertise the knowledge has been transferred.",
                    "label": 0
                },
                {
                    "sent": "The customers paid for instance and this increase what we call the body of knowledge of the professional virtual community.",
                    "label": 0
                },
                {
                    "sent": "The 3rd third phase is a PC evolution.",
                    "label": 0
                },
                {
                    "sent": "So we learn from experience from previous virtual team.",
                    "label": 0
                },
                {
                    "sent": "We tried to tune to make it more adapted to the customers requirement and also will be to the market evolution and then you can see that there can be another one another Vitti and you can have similar simultaneously different virtual team at the end is the last phase.",
                    "label": 0
                },
                {
                    "sent": "Is a PC metamorphosis and it can also mean the end of the PVC.",
                    "label": 1
                },
                {
                    "sent": "For instance if there is no trust among members and they.",
                    "label": 0
                },
                {
                    "sent": "Can't agree on shared objective on shared commitment so PC may disappear, but it's certainly an.",
                    "label": 0
                },
                {
                    "sent": "And we should avoid so the idea is to go forward and two to envisage PVC, metamorphosis, metamorphosis which can be with the same people working here.",
                    "label": 0
                },
                {
                    "sent": "The major changes in the PC objectives.",
                    "label": 0
                },
                {
                    "sent": "So after this we have defined topology of the different PC which can exist, so I won't go very much into details.",
                    "label": 0
                },
                {
                    "sent": "But if you want some more information feel free to send me an email and I can send you more information.",
                    "label": 0
                },
                {
                    "sent": "So the first is the established single discipline, PVC.",
                    "label": 0
                },
                {
                    "sent": "So it's based on a well established specific discipline.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "It means that this professional virtual Committee has already a consistent body of knowledge for guiding the discipline implementation in different application domains.",
                    "label": 0
                },
                {
                    "sent": "The second one is the incipient discipline, PCPC I, which is based on potential new knowledge discipline which results from aggregating different multidisciplinary.",
                    "label": 0
                },
                {
                    "sent": "Military discipline of a number of established disciplines and the last one is a challenge.",
                    "label": 0
                },
                {
                    "sent": "Focused BC.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "The biggest in knowledge here won't be directly defined by the definition of a specific challenge with solution will be the basic mission of the PVC.",
                    "label": 0
                },
                {
                    "sent": "So it means that you can have in this PC different competences and it means there is no.",
                    "label": 0
                },
                {
                    "sent": "There is an unstructured body of knowledge which which will be designed for supporting which would be designed for supporting and addressing specific issues.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I just don't use that.",
                    "label": 0
                },
                {
                    "sent": "We have also developed an advanced collaborative platform forum for enabling or supporting coordination and cooperation in professional virtual community.",
                    "label": 0
                },
                {
                    "sent": "So the first thing is that we we have the PC portal where a Member can access and after this we have three different.",
                    "label": 0
                },
                {
                    "sent": "Vertical services, which are social services, knowledge services, business services and this is supported by what has been also different in IC inequality which is the ICT infrastructure and we will have a presentation of it later on this afternoon.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Supporting the social dimension.",
                    "label": 0
                },
                {
                    "sent": "So as I told you, do you part of Lincoln in for instance?",
                    "label": 0
                },
                {
                    "sent": "No, you don't know Lincoln it OK, yes.",
                    "label": 0
                },
                {
                    "sent": "OK, so here you've got.",
                    "label": 0
                },
                {
                    "sent": "You've got some networking function.",
                    "label": 0
                },
                {
                    "sent": "OK and legally.",
                    "label": 0
                },
                {
                    "sent": "Unlink it and you've got releases, networking functions, them of this virtual community which is professional oriented but not business really business oriented is to make a network of professional, and if you're looking for a job you can address your network and trying to find the right people who can help you in finding a job, for instance so.",
                    "label": 0
                },
                {
                    "sent": "For the case of professional virtual communities, we have developed a function which is about social and networking and another one which is quite basic but really important which is CSC W, an author.",
                    "label": 0
                },
                {
                    "sent": "Cowork tools such as web 20 tools such as wikis and this will enable members to have on the same platform, instant messaging.",
                    "label": 0
                },
                {
                    "sent": "Presence of ability video conference application and document sharing.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For the knowledge dimension, we've developed ontology services which are of two kinds.",
                    "label": 0
                },
                {
                    "sent": "First for finding documents and the other one for finding the right profile.",
                    "label": 0
                },
                {
                    "sent": "When you're trying to build a virtual to virtual team.",
                    "label": 0
                },
                {
                    "sent": "When you have a customer request, you need to find which profiles in your professional little committees will be best suitable for answering the customers request, and the second one is the knowledge IPR management services, which I'm not supporting.",
                    "label": 0
                },
                {
                    "sent": "Certification identification and tracking of the knowledge created exchange among some members along with the identification and protection with associated Ipr's.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the third dimension is a business dimension where here you can choose between three different kind of collaboration.",
                    "label": 0
                },
                {
                    "sent": "The first one is, yeah, duck collaborations.",
                    "label": 0
                },
                {
                    "sent": "Someone is immediately collaboration, which is really in touch with problem solving, and the third one is a planned collaboration.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, what does a key challenges associated to professional virtual communities first thing is managing interdependencies, which are represented by tacit interactions or explicit interactions among actors and managing or so complex task.",
                    "label": 1
                },
                {
                    "sent": "And the sun was just the second one is to bring more flexibility.",
                    "label": 0
                },
                {
                    "sent": "But this may also implies some organizational changes in the professional virtual community.",
                    "label": 0
                },
                {
                    "sent": "Cooperation is critical since.",
                    "label": 0
                },
                {
                    "sent": "Members as I told before, some members are freelancers, but they also have some additional activities.",
                    "label": 1
                },
                {
                    "sent": "Also, members belong to companies, so they have to engage in boundary spanning activities in addition to accomplishing their ongoing work.",
                    "label": 0
                },
                {
                    "sent": "So it means that there is a real need to know when people are available to work and to be sure that they will.",
                    "label": 0
                },
                {
                    "sent": "They will be.",
                    "label": 0
                },
                {
                    "sent": "They will respect a commitment if they have to deliver.",
                    "label": 0
                },
                {
                    "sent": "If they have to work in the virtual team, for instance.",
                    "label": 0
                },
                {
                    "sent": "Another thing is when you're thinking of across wandering virtual community, which has business or in addition it means that face to face meetings are often reduced or may not exist.",
                    "label": 0
                },
                {
                    "sent": "So this platform, which has been developed in equally, should counterbalance the fact that people don't miss that often.",
                    "label": 0
                },
                {
                    "sent": "And I think that you know that during face to face meetings that that's a place where trust is built where people share history.",
                    "label": 0
                },
                {
                    "sent": "And that's the reason one for lot of European projects.",
                    "label": 0
                },
                {
                    "sent": "You've gotta kick kick off meeting where people who don't know each other before the beginning of the project meet.",
                    "label": 0
                },
                {
                    "sent": "And when you have virtual communities people know.",
                    "label": 0
                },
                {
                    "sent": "Means that much.",
                    "label": 0
                },
                {
                    "sent": "And the last one is important of norms, shared norms, shared commitment.",
                    "label": 0
                },
                {
                    "sent": "So there's a kind of uncertain T in running a professional yet welcome you.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "She.",
                    "label": 0
                },
                {
                    "sent": "So second parties from coordination to collaborate.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I don't know if you're familiar with this.",
                    "label": 0
                },
                {
                    "sent": "I want to escape communication because I thought we should.",
                    "label": 0
                },
                {
                    "sent": "Do you speak of the four seas, but communication is just sending receiving emails.",
                    "label": 0
                },
                {
                    "sent": "For instance, having a call it doesn't mean that you're doing something with someone else.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Have the purpose of virtual communities.",
                    "label": 0
                },
                {
                    "sent": "It's quite interesting to have a look at coordination, cooperation and collaboration for each one.",
                    "label": 0
                },
                {
                    "sent": "I tried to define and I adapted this from Bola 2005 to define what is the purpose of using this approach?",
                    "label": 0
                },
                {
                    "sent": "What is the desired outcome?",
                    "label": 0
                },
                {
                    "sent": "And also some examples.",
                    "label": 0
                },
                {
                    "sent": "The idea is coordination is the first step.",
                    "label": 0
                },
                {
                    "sent": "If you.",
                    "label": 0
                },
                {
                    "sent": "And cooperation is something more OK, just skip to it.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Next, for instance, I think I should start with this.",
                    "label": 0
                },
                {
                    "sent": "One.",
                    "label": 0
                },
                {
                    "sent": "Coordination means that 1 + 1 equal 1 cooperation is 1 + 1 equal 2 and collaboration is 1 + 1 again 3.",
                    "label": 1
                },
                {
                    "sent": "So it's strange though.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Very true, but you will understand why.",
                    "label": 0
                },
                {
                    "sent": "If I go to coordination.",
                    "label": 0
                },
                {
                    "sent": "Is the idea is to avoid gaps and overlaps in individuals assigned work?",
                    "label": 0
                },
                {
                    "sent": "And the outcome desired outcome is efficiently achieve results and meeting objectives.",
                    "label": 0
                },
                {
                    "sent": "So you're really managing complex task in order to count as a result to the expected result.",
                    "label": 0
                },
                {
                    "sent": "For instance, you have traffic flow regulation project to implement of the shape it.",
                    "label": 0
                },
                {
                    "sent": "Application cooperation is another form of coordination.",
                    "label": 0
                },
                {
                    "sent": "It means obtaining mutual benefit by sharing or partitioning work.",
                    "label": 0
                },
                {
                    "sent": "To send this coordination, it's a nifty evolved form of coordination, but.",
                    "label": 0
                },
                {
                    "sent": "What we can see from this that one outcome is saving in time and cost.",
                    "label": 0
                },
                {
                    "sent": "So some examples coping with an epidemic or katastrophe operating your local community on unity utility and the last one is a collaboration.",
                    "label": 0
                },
                {
                    "sent": "Where does it mean for conversion?",
                    "label": 0
                },
                {
                    "sent": "The idea is we did that, so it's really oriented on innovation and all partners are working together symmetry simultaneously.",
                    "label": 0
                },
                {
                    "sent": "So it means that superposes to achieve collective results that the participant would be unable to accomplish alone.",
                    "label": 0
                },
                {
                    "sent": "The same for the outcome is the same then for cooperation.",
                    "label": 0
                },
                {
                    "sent": "But if you want to be optimistic it's you had some innovation, extraordinary breakthrough breakthrough results and the collective.",
                    "label": 0
                },
                {
                    "sent": "As I said, we did that accomplishment and one example is brainstorming to discover a dramatically better way to do something.",
                    "label": 0
                },
                {
                    "sent": "And it's something which is really now.",
                    "label": 0
                },
                {
                    "sent": "It's a core of all marketing research and also organizational research.",
                    "label": 0
                },
                {
                    "sent": "It's Co.",
                    "label": 0
                },
                {
                    "sent": "Creation.",
                    "label": 0
                },
                {
                    "sent": "It mean you don't.",
                    "label": 0
                },
                {
                    "sent": "You don't create on your own so company doesn't create an on on our own but involves different partners who can be suppliers or customers to create new services.",
                    "label": 0
                },
                {
                    "sent": "So the more you go towards collaboration so more you move from efficiency to innovation.",
                    "label": 0
                },
                {
                    "sent": "And it's certainly most difficult part here.",
                    "label": 0
                },
                {
                    "sent": "Chief.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is collaboration cooperation?",
                    "label": 0
                },
                {
                    "sent": "You see that people helping each other but.",
                    "label": 0
                },
                {
                    "sent": "They want to do it one after one.",
                    "label": 0
                },
                {
                    "sent": "It's not work done altogether, so I found on Google this image for collaboration, which seems to be more reflection reflective white collaboration is, and if it takes this definition of polar collaboration and takes finding the right group of people but skills, personalities, knowledge, work styles, we can also add culture and chemistry and sharing the shared commitment.",
                    "label": 0
                },
                {
                    "sent": "This is collaboration task at end and providing them with an environment, tools, knowledge, training process and facilitation to ensure they work together effectively.",
                    "label": 1
                },
                {
                    "sent": "So what does this mean?",
                    "label": 1
                },
                {
                    "sent": "This means that they must have a shared goal, sense of urgency and commitment which are linked productive participation process or so a sense of belonging and open communication and trust.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To some examples.",
                    "label": 0
                },
                {
                    "sent": "If you take for instance Vanguardian and Google who are to ask this, but came quite late to paintings because I fail in other professions submit.",
                    "label": 0
                },
                {
                    "sent": "They work together and they help.",
                    "label": 1
                },
                {
                    "sent": "They collaborate.",
                    "label": 0
                },
                {
                    "sent": "Together to develop the technique and also some mastery that has endured ever since.",
                    "label": 1
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Two other examples post went maybe a little controversial because the Human Genome Project.",
                    "label": 1
                },
                {
                    "sent": "Maybe controversial because it's still.",
                    "label": 1
                },
                {
                    "sent": "We don't know very, very well wait goes, but if we take a look behind, we see that it's 15 years of international collaboration that has really quick and scientific advances that will over over otherwise have taken at least generation longer.",
                    "label": 1
                },
                {
                    "sent": "And the last one is about open source software like Mozilla Firefox, which is browser.",
                    "label": 1
                },
                {
                    "sent": "Thunderbird, Thunderbird, which is a Mail.",
                    "label": 1
                },
                {
                    "sent": "Mailer software and and view which is a website editor which are simple Internet softwares which have been developed in collaboration by parallel and sequential work of hundreds of individuals.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Does it third part of my presentation is about forms of coordination to support cooperation and collaboration.",
                    "label": 1
                },
                {
                    "sent": "So as I told you before, I do believe that cooperation and collaboration can't exist.",
                    "label": 0
                },
                {
                    "sent": "If there is no coordination there evolved form of coordination and more you go towards collaborations and more innovation you can we can achieve.",
                    "label": 0
                },
                {
                    "sent": "So if we come back to virtual communities, what are the what are the challenges of coordination for professional virtual communities?",
                    "label": 0
                },
                {
                    "sent": "It aims at maximizing the network currents and check our well distributed members of a team work together.",
                    "label": 0
                },
                {
                    "sent": "It's also of course very important for location of task.",
                    "label": 0
                },
                {
                    "sent": "And resources among members coordination can also support the recognition and resolving of disparities of conflicts in goals, facts and belief and behavior of members.",
                    "label": 0
                },
                {
                    "sent": "So open seas appear.",
                    "label": 0
                },
                {
                    "sent": "We can have two modes of coordination, which can appear when unit coordinator with several executors or or set of executors acting each as coordinators.",
                    "label": 0
                },
                {
                    "sent": "Things the first 4 starting with professional community having only one unit coordinator is certainly the slippers one.",
                    "label": 0
                },
                {
                    "sent": "So if you distribute because if you distribute coordination task among the team members, this implies a strong project management and trust among Members to ensure that the different task will be achieved on the due time.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's move not too.",
                    "label": 0
                },
                {
                    "sent": "Organization of Science with Thomas Malone and Christen in 1990. Who defines this coordination theory?",
                    "label": 0
                },
                {
                    "sent": "So you've got four different coordination processes, which are supported by two support processes and communication and decision-making, as opposed to collect and spread information towards correct coordination process is.",
                    "label": 0
                },
                {
                    "sent": "So what does a deep for different one you've got managing share resources managing producer consumer relationship managing similarity.",
                    "label": 0
                },
                {
                    "sent": "Constraint and also managing test sub task relationships.",
                    "label": 0
                },
                {
                    "sent": "But what is really interesting is that melon considered that this coordination process is our nonproductive tasks there to be there but they are non productive for the company or for the Community.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If you make an overview of what's a different method for analysing coordination processes are you can see that, for instance, if I from.",
                    "label": 1
                },
                {
                    "sent": "Managing shared resource.",
                    "label": 1
                },
                {
                    "sent": "If I take the computer science approach, that's techniques for processor scheduling and memory allocation in terms of coordination process is if I take management science or organization theory from Malone, it's analyzing.",
                    "label": 0
                },
                {
                    "sent": "It's the analyze of different organizational structures, budgeting processes, organizational power, and resource dependence in economics and operations.",
                    "label": 1
                },
                {
                    "sent": "Research analyst.",
                    "label": 1
                },
                {
                    "sent": "And that is of markets and other resource allocation mechanisms, scheduling algorithm and also optimizations techniques.",
                    "label": 0
                },
                {
                    "sent": "So it's quite interesting to see that according to Malone's coordination coordination theory, lot of different discipline of.",
                    "label": 0
                },
                {
                    "sent": "Also in.",
                    "label": 0
                },
                {
                    "sent": "Our so focused on developing techniques, so it means that if you want to manage resources it it can be really relevant to address while computer science with economics and operation and weather.",
                    "label": 1
                },
                {
                    "sent": "So organization tourists have developed.",
                    "label": 1
                },
                {
                    "sent": "For managing producer consumer relationships, computer science is focused of data flow, pitching it, and analysis in economics.",
                    "label": 1
                },
                {
                    "sent": "You will find Pert charts, critical path, method, scheduling techniques in organization theory.",
                    "label": 0
                },
                {
                    "sent": "You will find participle participatory design, market research for managing similarity constraints.",
                    "label": 1
                },
                {
                    "sent": "Computer science will be focused on synchronization technique, mutual exclusion economics, an operation on scheduling techniques, and in organization theory on meeting scheduling, and also certain kind of process modeling.",
                    "label": 0
                },
                {
                    "sent": "For managing tasks and subtasks, relationship, a computer science will be focused on modernization techniques in programming, planning in artificial intelligence.",
                    "label": 0
                },
                {
                    "sent": "If you go to economics, it will be really focused when you're Speaking of managing the subtext relationship on economies of scale and scope, and for organization theory, it will be more on strategic planning.",
                    "label": 0
                },
                {
                    "sent": "Management by objectives, method of grouping people into units so you can see that these three approaches are complementary.",
                    "label": 0
                },
                {
                    "sent": "When you're Speaking of, for instance, managing tasks and subtasks relationship.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If you go back to the virtual team.",
                    "label": 0
                },
                {
                    "sent": "And if you think of the distribution of the problem solving in the context of virtual team, there are three different proposition for distributed solving problem, distributed problem solving.",
                    "label": 1
                },
                {
                    "sent": "So first one is a distributed solving of problems and the key concept as specialist complementary skills solving more, distributing among actors and indeed for a complex expertise.",
                    "label": 1
                },
                {
                    "sent": "And this is.",
                    "label": 0
                },
                {
                    "sent": "Really adapted to visual team aiming at developing innovation.",
                    "label": 1
                },
                {
                    "sent": "If I go to the salon proposition which is distributed solving of distributing problems is this proposition, it's a problem itself which is distributed.",
                    "label": 1
                },
                {
                    "sent": "Agents can have similar skills and it can also be very adapted for cross borders virtual team for centralizing for instance, experience competences from different locations, different countries and member members can have.",
                    "label": 0
                },
                {
                    "sent": "Same of complementary competences, and the last one is a distributed techniques for problem solving.",
                    "label": 1
                },
                {
                    "sent": "Is the usage of interaction between a chance to solve problems and this relates to solving by coordination, and this is really adapted to virtual team with well defined objectives.",
                    "label": 0
                },
                {
                    "sent": "And the objective is to optimize efficiency and to search for optimization for the allocation of tax where the domain and the expertise under distribute.",
                    "label": 1
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What kind of form of coordination can can we have?",
                    "label": 0
                },
                {
                    "sent": "We can have coordination by synchronization, which is the elementary form of coordination an it's away the action follow on from each other.",
                    "label": 1
                },
                {
                    "sent": "The way in which the actions follow on from each other is very important and all coordination of actions as to describe this procedure precisely.",
                    "label": 1
                },
                {
                    "sent": "And this induces a necessary synchronization.",
                    "label": 1
                },
                {
                    "sent": "And synchronization is quoting when it comes to manage a similarity of several actions.",
                    "label": 1
                },
                {
                    "sent": "Second one is coordination by planning and this might of coordination is a step by step approach with three main phases and is certainly the most traditional in artificial artificial intelligence.",
                    "label": 1
                },
                {
                    "sent": "Which means this mean definition of the set of actions to be done to reach the objective with the production of different plans.",
                    "label": 1
                },
                {
                    "sent": "The executive execution of the accepted plan and dynamic replying according to.",
                    "label": 1
                },
                {
                    "sent": "Events which can occur during its execution, and this is really in the scope of virtual team because if you remember on the professional community life cycle during this Vt virtual team Life life cycle, you see that you have the creations operation and also the evolution.",
                    "label": 0
                },
                {
                    "sent": "The third one is directive color, coordination.",
                    "label": 0
                },
                {
                    "sent": "In this mode of coordination, favors in situ implementation of action instead of a priori.",
                    "label": 0
                },
                {
                    "sent": "And it's mainly used in situation when it is very difficult to unset.",
                    "label": 0
                },
                {
                    "sent": "Anticipate what is going to happen due to evolutionary context, for instance, but this one is quite dangerous because it may present constraints in terms of optimization of the result.",
                    "label": 1
                },
                {
                    "sent": "It means that you've got butchered to send something to a customer, but you're not sure that you will really achieve it in the budget.",
                    "label": 0
                },
                {
                    "sent": "And the last one is a coordination by regulation, which means enacting a set of rules of good behavior among actors in order to avoid all kind of conflict.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If I refer to Ferbus ferbus value parameters in addition to form of coordination, it's quite interesting to see the ideas quitting some different criteria and putting parenza different forms of coordination so you can see, for instance, that.",
                    "label": 1
                },
                {
                    "sent": "For predictability, planning is very good, but synchronization and reactive.",
                    "label": 0
                },
                {
                    "sent": "For synchronization and for reactive form of coordination, it's slow as I said, just before, you can't really know what's going to happen.",
                    "label": 0
                },
                {
                    "sent": "An avoidance of conflict can also be very interesting when you Speaking of professional virtual communities which have been just set up an where members don't know each other that much.",
                    "label": 0
                },
                {
                    "sent": "If you have a reactive form of coordination, you can see that the avoidance of conflict will be poor because it may lead to a lot of conflict.",
                    "label": 0
                },
                {
                    "sent": "So it means that this kind of form of coordination is not adapted to just create it.",
                    "label": 0
                },
                {
                    "sent": "Greatest, another one is that the quantity of exchange.",
                    "label": 0
                },
                {
                    "sent": "If you if you do planning, for instance you need a lot of exchange among numbers 3 emails for instance, and it's very different if you do reactive or reactive synchronization or regulation.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Open what I've tried to do here is for each type of PC to detect which kind of coordination's could be interested and when.",
                    "label": 1
                },
                {
                    "sent": "For instance, if I take if I take the first form of PVC with, which is established single discipline PC, you can see that according to the PC lifecycle creation, Operation, Evolution and Metamorphosis, it's more relevant to start with.",
                    "label": 0
                },
                {
                    "sent": "Regulation synchronization and planning and after to go toward reactive 'cause I think that reactive is certainly C1 where?",
                    "label": 0
                },
                {
                    "sent": "You will have some more of more collaboration and it means more innovation among members.",
                    "label": 0
                },
                {
                    "sent": "For the second one, which is a PCI incipient discipline professional community, it's the idea is to start with form of regulated coordination.",
                    "label": 0
                },
                {
                    "sent": "Associated with synchronization and after to go toward planning and reactive form of coordination and for the most challenging PC.",
                    "label": 1
                },
                {
                    "sent": "We do things that we it will be interesting to start with.",
                    "label": 0
                },
                {
                    "sent": "Regulation, form of coordination, regulation, form and quickly moved towards reactive form.",
                    "label": 0
                },
                {
                    "sent": "Because this PC is really business opportunities oriented.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "My lifestyle will be about linking, AI coordinate and coordination tureens of frame of PVC and virtual team.",
                    "label": 1
                },
                {
                    "sent": "And if I for instance take distributed serving of problem where competences are insufficient, when I try to do is to link here a coordination process proposed by Malone too.",
                    "label": 0
                },
                {
                    "sent": "To this proposition.",
                    "label": 0
                },
                {
                    "sent": "So if you if you don't have enough competences, if resources, for instance are insufficient, see the ID is here to have managing producer consumer relationship managing share resources as coordination process.",
                    "label": 0
                },
                {
                    "sent": "First of all, if there for instance, the example of solving of disrated problems where competences can be sufficient resources sufficient but not share the idea here is to so is to manage.",
                    "label": 0
                },
                {
                    "sent": "C Milton 80 contraints and the last one if you take distributed techniques for problem solving, where competences and resources as sufficient as ordination process involved will be to manage task and sub task relationships.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you for your attention and if you have any questions.",
                    "label": 1
                },
                {
                    "sent": "Do you have any question?",
                    "label": 0
                },
                {
                    "sent": "Any kind?",
                    "label": 0
                },
                {
                    "sent": "Close friends doing in football.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                }
            ]
        }
    }
}