{
    "id": "a5uyhlkdzgsszp4iplgkuzt6vfhohx6k",
    "title": "Detecting Changes in Musical Texture",
    "info": {
        "author": [
            "Atte Tenkanen, School of Art Studies, Department of Musicology, University of Turku"
        ],
        "published": "July 31, 2008",
        "recorded": "July 2008",
        "category": [
            "Top->Computer Science->Machine Learning->Clustering"
        ]
    },
    "url": "http://videolectures.net/icml08_tenkanen_dcm/",
    "segmentation": [
        [
            "I'm collaborating with Fernanda Holder.",
            "OK. Fernando is from Queens, University of Belfast and we are developing.",
            "Software for music analysis, and I put this picture here because if this is the last lecture or last presentation, and if you are if you fall asleep during this last presentation, you will remember this.",
            "This picture, at least it's about Scriabin's study of 65 #3 and you can see the prevalence of the so called.",
            "Mystic or promote him court, which was the very typical court for in in Scriabin's last work this line represents.",
            "The prevalence of this quote here."
        ],
        [
            "And the aims.",
            "Now is to detect articulated boundaries in a composition, and now we're we're using multidimensional features."
        ],
        [
            "And this approach is only a tiny extension to the.",
            "At Jim Method called comparison set analysis and I'm I'm first talking about comparisons that analyze and then about the preparation study."
        ],
        [
            "And here's the picture which tell us you.",
            "But what what do we mean about comparison set analysis?",
            "If this is music?",
            "And.",
            "We use we make some feature extraction by segmenting the music and we have some comparison set.",
            "And some similarity function.",
            "Then we can.",
            "We can measure the prevalence of this comparison set.",
            "During through this piece.",
            "And of course, we can change this detector.",
            "It can be diatonic scale or chromatic scale or something other octatonic.",
            "Or if we're talking about fits class sets or abstract set classes."
        ],
        [
            "Competition set analysis is for to produce formal articulations of a COM."
        ],
        [
            "Position.",
            "And.",
            "In comparison, set analysis musical units like pit classes.",
            "Are segmented into overlapping sets of the same cardinality.",
            "The same we need the same cognitive because many similarity measures.",
            "Works best if if this sets segments are awful."
        ],
        [
            "Same cardinality.",
            "And these segments are then compared with the selecting comparison set that Citroen you saw there, for example."
        ],
        [
            "And that comparison set embodies a chosen musical property.",
            "Who's prevalences ever?"
        ],
        [
            "Edit.",
            "In a conversation.",
            "And this is very interesting that we get crafts.",
            "Because they are easily they understandable.",
            "And we can produce mean points.",
            "For classification."
        ],
        [
            "Awesome.",
            "And we're working with symbolic data and especially."
        ],
        [
            "MIDI files um.",
            "Use media event list, but these lists are we re prepare these lists?"
        ],
        [
            "What do I mean with this?",
            "For example, in the case of Pitts class that segmentation, we associate the most approximate.",
            "In Time pit class set off the chosen kind lady to eat."
        ],
        [
            "No, in the score.",
            "This is about the segmentation.",
            "I don't go into details.",
            "But we have here Middle East or kind of Middle East, and for example, this note see it's outlook left here.",
            "We use for example in Pentecostal segmentation.",
            "We have get this kind of.",
            "Or assign this kind of set class or pitch class set for this note."
        ],
        [
            "And.",
            "Fiercer competition set.",
            "Analysin not sell.",
            "We have score and even list and then feature extraction and comparison set and and we compare this company set to all these segments with some similarity function and get crafts.",
            "But there is also another way to do.",
            "We can only count segments.",
            "If we label all the second segments, we can count the labels and.",
            "Do different kind of analysis."
        ],
        [
            "And this is an example of that kind of analysis.",
            "There are 22 Scriabin piano pieces and we have segmented.",
            "This piece is using hexaco to segmentation.",
            "So all these.",
            "Segments consist of 6 bits classes and this is a full term set class at class notation it's associated with this Mystic court or from a town called.",
            "And it's well known that scrubbing used this type of code more in his later pieces.",
            "You see that competition years."
        ],
        [
            "There is another example now with compassion function.",
            "The compression function is.",
            "Costing based causing distance based and we have here 2 competitions that diatonic and chromatic hepta courts.",
            "So this is diatonic scale in fact.",
            "And in 2004 I asked my my improvisation teacher applicability.",
            "I got me to improvise a piece and ask him to start with a medieval style.",
            "Now can I get music somewhere here?",
            "Yes, is it this one?",
            "Style I asked him to start with medieval style and then change to Renaissance style and Baroque style and so on.",
            "So on.",
            "Let's see if we can hear something.",
            "And here the the chromatic curve is very low, but the diatonic.",
            "Curve is very high.",
            "Let me go further.",
            "We're somewhere here.",
            "I don't know.",
            "It's like working there or.",
            "And so on.",
            "Damn."
        ],
        [
            "But there's there's no connection between these mechanical segments and the real musical segments, but however.",
            "They can use comparison satellites to detect this kind of a real musical pounder isn't.",
            "And this picture I showed you.",
            "In the first slide.",
            "I used it to to make a form analysis.",
            "I have made I have marked these boundaries only by using this picture, not without without looking to score.",
            "You see that there are similar sections here and I have marked them with those typical.",
            "Section markings."
        ],
        [
            "But in the present study, we utilized several musical features now that, for example, in that linear must piece we used only abstract set classes.",
            "But now."
        ],
        [
            "We exploit.",
            "6 features.",
            "Instead of selecting a competition set for each measurable feature separately."
        ],
        [
            "We use or we choose by hand some notes which are associated with interesting musical characters in the piece, and here we are interested changes in."
        ],
        [
            "Magical texture.",
            "And for that purpose.",
            "Remove two consecutive times windows."
        ],
        [
            "For the peace.",
            "And we tested this method for Sibelius Symphony #5 the final final finale.",
            "So these windows are moved across this space."
        ],
        [
            "And then we calculated average distances between this Windows recording to these features."
        ],
        [
            "And for each note in our list, we stored a 6 dimensional feature vector.",
            "For each support line, note there."
        ],
        [
            "And we normalized all the values."
        ],
        [
            "So now the comparison set consists of selected multidimensional feature vectors and we input these feature vectors to fuzzy KNN classifier.",
            "It's like it's almost like A and."
        ],
        [
            "Pacifier, but.",
            "If we in KNN classifier we use the exact matches, the number of exact matches, this is unlabeled object here and these are the.",
            "Sample.",
            "Glass samples here.",
            "But in the party K in the first city KNN classifier we we count the.",
            "The distance is.",
            "And now they're not distances.",
            "They're similarity values here.",
            "Normally in K and we we select a class one for this.",
            "Unlabeled object, but in this case because the similarity value is here.",
            "Baker this unlabelled object belongs to the Class 2."
        ],
        [
            "And we get critics by review.",
            "There's not much matching learning in this paper."
        ],
        [
            "And we totally agree."
        ],
        [
            "The classifier freeze asked from defining the exact attributes for the group of comparison sets.",
            "That's that's the machine learning."
        ],
        [
            "Only part of machine learning here.",
            "It's only one way to define the comparison set.",
            "Now the features are highly different, so this is very easy easy way."
        ],
        [
            "To use this, there is something about vector types.",
            "I don't call now to them, but we we introduced a measure called circle of fifths relation there and."
        ],
        [
            "OK, we we considered only note onsets.",
            "To produce these set class and pitch class set segments."
        ],
        [
            "And about melodic transition vectors.",
            "We produced transition probability matrices and compared the Euclidean distance."
        ],
        [
            "At about this circle of fifths relation, what can we do with with that?",
            "This is from Carl Philippon mailbox denial, it honey.",
            "It's one of his latest piece.",
            "It's good example.",
            "There is a comparison bar.",
            "In this case we have selected these nodes as a comparison set and compared to all these bars and the main keys G major and now we see for example that this deep flat.",
            "Dominant chord here.",
            "D flat.",
            "Angie.",
            "Measure their treatment part so they are maximally almost maximally distant and you see here that.",
            "The distances here most the biggest here."
        ],
        [
            "OK.",
            "But about the test analysis we selected 11 features or 1111.",
            "Feature vectors.",
            "Connected to the lowest note in the beginning of the bars, these bars here and we named them as Class 1."
        ],
        [
            "Amber actors.",
            "And in those places that are remarkable changes into tech."
        ],
        [
            "And then we I don't know if this is good where this is.",
            "So I don't know if it's a good way to to select random randomly the class zero vectors.",
            "But we made it so."
        ],
        [
            "And.",
            "Anne."
        ],
        [
            "Something about results."
        ],
        [
            "And the texture is nearly constant for about 140 Buck pass.",
            "There are the number of bars here and.",
            "It's nearly constant.",
            "And.",
            "There is fairly plain place before before this, before the final section of this movement, I. I analyzed 6 in front of the finale of 1620 also, and there were also this kind of.",
            "Plane section before the end and it's I haven't noticed before."
        ],
        [
            "And unlike the other features, the routing setup roads didn't show any significant correlation with this curb.",
            "So."
        ],
        [
            "In fact, we are studying our intuition becausw the text change places were chosen by hand."
        ],
        [
            "There's something something about pewter plans future plans.",
            "We're going go on developing the multi multi dimensional comparison set analysts.",
            "And.",
            "And we are developing standalone application for music analysis.",
            "And of course, this kind of.",
            "Apple's could be used in music information retrieval also.",
            "And then we will use iterative use of comparison set analysis.",
            "I will show you what.",
            "What do I mean with this?"
        ],
        [
            "For example, we can take we can afford.",
            "At first we can count.",
            "Or calculate this curve and then we can take this this vector and compare it against all phrases.",
            "In this piece there are 560 bars in this space, so use it iteratively.",
            "And then."
        ],
        [
            "There are some references.",
            "We just got from from Alvin.",
            "An article in which we introduced this.",
            "Competition set allies among some other.",
            "Aproaches"
        ],
        [
            "Thank you.",
            "One meeting for one question.",
            "Have you thought of doing discovery of compare comparison sets?",
            "We're discovering patterns of comparison sets, discovering of well.",
            "You are required to specify the comparison set.",
            "Yeah, Can you imagine taking piece and finding what the good comparison sets could be?",
            "Yes, we can use for example principal component analysis to select those sets which had a greatest variance among these pieces or.",
            "Or take or use all all hexa Hexa core set classes 18 Sicola said classes and see what happens for example.",
            "Struck by your diagram.",
            "Prevalence of scrubs.",
            "Yeah the first one, yeah?",
            "Now I'm not sure what speech class set is most representative for well known block composer shape.",
            "When he was young.",
            "Uh huh.",
            "Just wondering if there was a corresponding pull off diagram.",
            "OK. Perhaps perhaps we need to admit you think that I.",
            "Two to select 22 pieces from Japan and compare those or.",
            "OK, thank you thanks.",
            "Cancel 6:00 o'clock so I will be there, work till then sure."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm collaborating with Fernanda Holder.",
                    "label": 0
                },
                {
                    "sent": "OK. Fernando is from Queens, University of Belfast and we are developing.",
                    "label": 1
                },
                {
                    "sent": "Software for music analysis, and I put this picture here because if this is the last lecture or last presentation, and if you are if you fall asleep during this last presentation, you will remember this.",
                    "label": 0
                },
                {
                    "sent": "This picture, at least it's about Scriabin's study of 65 #3 and you can see the prevalence of the so called.",
                    "label": 0
                },
                {
                    "sent": "Mystic or promote him court, which was the very typical court for in in Scriabin's last work this line represents.",
                    "label": 0
                },
                {
                    "sent": "The prevalence of this quote here.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the aims.",
                    "label": 0
                },
                {
                    "sent": "Now is to detect articulated boundaries in a composition, and now we're we're using multidimensional features.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this approach is only a tiny extension to the.",
                    "label": 0
                },
                {
                    "sent": "At Jim Method called comparison set analysis and I'm I'm first talking about comparisons that analyze and then about the preparation study.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And here's the picture which tell us you.",
                    "label": 1
                },
                {
                    "sent": "But what what do we mean about comparison set analysis?",
                    "label": 1
                },
                {
                    "sent": "If this is music?",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "We use we make some feature extraction by segmenting the music and we have some comparison set.",
                    "label": 0
                },
                {
                    "sent": "And some similarity function.",
                    "label": 0
                },
                {
                    "sent": "Then we can.",
                    "label": 1
                },
                {
                    "sent": "We can measure the prevalence of this comparison set.",
                    "label": 0
                },
                {
                    "sent": "During through this piece.",
                    "label": 0
                },
                {
                    "sent": "And of course, we can change this detector.",
                    "label": 0
                },
                {
                    "sent": "It can be diatonic scale or chromatic scale or something other octatonic.",
                    "label": 0
                },
                {
                    "sent": "Or if we're talking about fits class sets or abstract set classes.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Competition set analysis is for to produce formal articulations of a COM.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Position.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "In comparison, set analysis musical units like pit classes.",
                    "label": 1
                },
                {
                    "sent": "Are segmented into overlapping sets of the same cardinality.",
                    "label": 1
                },
                {
                    "sent": "The same we need the same cognitive because many similarity measures.",
                    "label": 0
                },
                {
                    "sent": "Works best if if this sets segments are awful.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Same cardinality.",
                    "label": 0
                },
                {
                    "sent": "And these segments are then compared with the selecting comparison set that Citroen you saw there, for example.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that comparison set embodies a chosen musical property.",
                    "label": 0
                },
                {
                    "sent": "Who's prevalences ever?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Edit.",
                    "label": 0
                },
                {
                    "sent": "In a conversation.",
                    "label": 0
                },
                {
                    "sent": "And this is very interesting that we get crafts.",
                    "label": 0
                },
                {
                    "sent": "Because they are easily they understandable.",
                    "label": 0
                },
                {
                    "sent": "And we can produce mean points.",
                    "label": 0
                },
                {
                    "sent": "For classification.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Awesome.",
                    "label": 0
                },
                {
                    "sent": "And we're working with symbolic data and especially.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "MIDI files um.",
                    "label": 0
                },
                {
                    "sent": "Use media event list, but these lists are we re prepare these lists?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What do I mean with this?",
                    "label": 0
                },
                {
                    "sent": "For example, in the case of Pitts class that segmentation, we associate the most approximate.",
                    "label": 1
                },
                {
                    "sent": "In Time pit class set off the chosen kind lady to eat.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, in the score.",
                    "label": 0
                },
                {
                    "sent": "This is about the segmentation.",
                    "label": 0
                },
                {
                    "sent": "I don't go into details.",
                    "label": 0
                },
                {
                    "sent": "But we have here Middle East or kind of Middle East, and for example, this note see it's outlook left here.",
                    "label": 0
                },
                {
                    "sent": "We use for example in Pentecostal segmentation.",
                    "label": 0
                },
                {
                    "sent": "We have get this kind of.",
                    "label": 0
                },
                {
                    "sent": "Or assign this kind of set class or pitch class set for this note.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Fiercer competition set.",
                    "label": 0
                },
                {
                    "sent": "Analysin not sell.",
                    "label": 0
                },
                {
                    "sent": "We have score and even list and then feature extraction and comparison set and and we compare this company set to all these segments with some similarity function and get crafts.",
                    "label": 0
                },
                {
                    "sent": "But there is also another way to do.",
                    "label": 0
                },
                {
                    "sent": "We can only count segments.",
                    "label": 0
                },
                {
                    "sent": "If we label all the second segments, we can count the labels and.",
                    "label": 0
                },
                {
                    "sent": "Do different kind of analysis.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is an example of that kind of analysis.",
                    "label": 0
                },
                {
                    "sent": "There are 22 Scriabin piano pieces and we have segmented.",
                    "label": 1
                },
                {
                    "sent": "This piece is using hexaco to segmentation.",
                    "label": 0
                },
                {
                    "sent": "So all these.",
                    "label": 0
                },
                {
                    "sent": "Segments consist of 6 bits classes and this is a full term set class at class notation it's associated with this Mystic court or from a town called.",
                    "label": 0
                },
                {
                    "sent": "And it's well known that scrubbing used this type of code more in his later pieces.",
                    "label": 0
                },
                {
                    "sent": "You see that competition years.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There is another example now with compassion function.",
                    "label": 0
                },
                {
                    "sent": "The compression function is.",
                    "label": 0
                },
                {
                    "sent": "Costing based causing distance based and we have here 2 competitions that diatonic and chromatic hepta courts.",
                    "label": 0
                },
                {
                    "sent": "So this is diatonic scale in fact.",
                    "label": 0
                },
                {
                    "sent": "And in 2004 I asked my my improvisation teacher applicability.",
                    "label": 0
                },
                {
                    "sent": "I got me to improvise a piece and ask him to start with a medieval style.",
                    "label": 0
                },
                {
                    "sent": "Now can I get music somewhere here?",
                    "label": 0
                },
                {
                    "sent": "Yes, is it this one?",
                    "label": 0
                },
                {
                    "sent": "Style I asked him to start with medieval style and then change to Renaissance style and Baroque style and so on.",
                    "label": 0
                },
                {
                    "sent": "So on.",
                    "label": 0
                },
                {
                    "sent": "Let's see if we can hear something.",
                    "label": 0
                },
                {
                    "sent": "And here the the chromatic curve is very low, but the diatonic.",
                    "label": 0
                },
                {
                    "sent": "Curve is very high.",
                    "label": 0
                },
                {
                    "sent": "Let me go further.",
                    "label": 0
                },
                {
                    "sent": "We're somewhere here.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "It's like working there or.",
                    "label": 0
                },
                {
                    "sent": "And so on.",
                    "label": 0
                },
                {
                    "sent": "Damn.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But there's there's no connection between these mechanical segments and the real musical segments, but however.",
                    "label": 1
                },
                {
                    "sent": "They can use comparison satellites to detect this kind of a real musical pounder isn't.",
                    "label": 0
                },
                {
                    "sent": "And this picture I showed you.",
                    "label": 0
                },
                {
                    "sent": "In the first slide.",
                    "label": 0
                },
                {
                    "sent": "I used it to to make a form analysis.",
                    "label": 0
                },
                {
                    "sent": "I have made I have marked these boundaries only by using this picture, not without without looking to score.",
                    "label": 0
                },
                {
                    "sent": "You see that there are similar sections here and I have marked them with those typical.",
                    "label": 0
                },
                {
                    "sent": "Section markings.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But in the present study, we utilized several musical features now that, for example, in that linear must piece we used only abstract set classes.",
                    "label": 0
                },
                {
                    "sent": "But now.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We exploit.",
                    "label": 0
                },
                {
                    "sent": "6 features.",
                    "label": 0
                },
                {
                    "sent": "Instead of selecting a competition set for each measurable feature separately.",
                    "label": 1
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We use or we choose by hand some notes which are associated with interesting musical characters in the piece, and here we are interested changes in.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Magical texture.",
                    "label": 0
                },
                {
                    "sent": "And for that purpose.",
                    "label": 0
                },
                {
                    "sent": "Remove two consecutive times windows.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For the peace.",
                    "label": 0
                },
                {
                    "sent": "And we tested this method for Sibelius Symphony #5 the final final finale.",
                    "label": 1
                },
                {
                    "sent": "So these windows are moved across this space.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we calculated average distances between this Windows recording to these features.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And for each note in our list, we stored a 6 dimensional feature vector.",
                    "label": 0
                },
                {
                    "sent": "For each support line, note there.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we normalized all the values.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now the comparison set consists of selected multidimensional feature vectors and we input these feature vectors to fuzzy KNN classifier.",
                    "label": 0
                },
                {
                    "sent": "It's like it's almost like A and.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Pacifier, but.",
                    "label": 0
                },
                {
                    "sent": "If we in KNN classifier we use the exact matches, the number of exact matches, this is unlabeled object here and these are the.",
                    "label": 0
                },
                {
                    "sent": "Sample.",
                    "label": 0
                },
                {
                    "sent": "Glass samples here.",
                    "label": 0
                },
                {
                    "sent": "But in the party K in the first city KNN classifier we we count the.",
                    "label": 1
                },
                {
                    "sent": "The distance is.",
                    "label": 0
                },
                {
                    "sent": "And now they're not distances.",
                    "label": 0
                },
                {
                    "sent": "They're similarity values here.",
                    "label": 0
                },
                {
                    "sent": "Normally in K and we we select a class one for this.",
                    "label": 0
                },
                {
                    "sent": "Unlabeled object, but in this case because the similarity value is here.",
                    "label": 0
                },
                {
                    "sent": "Baker this unlabelled object belongs to the Class 2.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we get critics by review.",
                    "label": 0
                },
                {
                    "sent": "There's not much matching learning in this paper.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we totally agree.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The classifier freeze asked from defining the exact attributes for the group of comparison sets.",
                    "label": 0
                },
                {
                    "sent": "That's that's the machine learning.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Only part of machine learning here.",
                    "label": 0
                },
                {
                    "sent": "It's only one way to define the comparison set.",
                    "label": 1
                },
                {
                    "sent": "Now the features are highly different, so this is very easy easy way.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To use this, there is something about vector types.",
                    "label": 0
                },
                {
                    "sent": "I don't call now to them, but we we introduced a measure called circle of fifths relation there and.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, we we considered only note onsets.",
                    "label": 0
                },
                {
                    "sent": "To produce these set class and pitch class set segments.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And about melodic transition vectors.",
                    "label": 0
                },
                {
                    "sent": "We produced transition probability matrices and compared the Euclidean distance.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At about this circle of fifths relation, what can we do with with that?",
                    "label": 0
                },
                {
                    "sent": "This is from Carl Philippon mailbox denial, it honey.",
                    "label": 0
                },
                {
                    "sent": "It's one of his latest piece.",
                    "label": 0
                },
                {
                    "sent": "It's good example.",
                    "label": 0
                },
                {
                    "sent": "There is a comparison bar.",
                    "label": 0
                },
                {
                    "sent": "In this case we have selected these nodes as a comparison set and compared to all these bars and the main keys G major and now we see for example that this deep flat.",
                    "label": 0
                },
                {
                    "sent": "Dominant chord here.",
                    "label": 0
                },
                {
                    "sent": "D flat.",
                    "label": 0
                },
                {
                    "sent": "Angie.",
                    "label": 0
                },
                {
                    "sent": "Measure their treatment part so they are maximally almost maximally distant and you see here that.",
                    "label": 0
                },
                {
                    "sent": "The distances here most the biggest here.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "But about the test analysis we selected 11 features or 1111.",
                    "label": 0
                },
                {
                    "sent": "Feature vectors.",
                    "label": 0
                },
                {
                    "sent": "Connected to the lowest note in the beginning of the bars, these bars here and we named them as Class 1.",
                    "label": 1
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Amber actors.",
                    "label": 0
                },
                {
                    "sent": "And in those places that are remarkable changes into tech.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we I don't know if this is good where this is.",
                    "label": 0
                },
                {
                    "sent": "So I don't know if it's a good way to to select random randomly the class zero vectors.",
                    "label": 0
                },
                {
                    "sent": "But we made it so.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Something about results.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the texture is nearly constant for about 140 Buck pass.",
                    "label": 1
                },
                {
                    "sent": "There are the number of bars here and.",
                    "label": 0
                },
                {
                    "sent": "It's nearly constant.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "There is fairly plain place before before this, before the final section of this movement, I. I analyzed 6 in front of the finale of 1620 also, and there were also this kind of.",
                    "label": 0
                },
                {
                    "sent": "Plane section before the end and it's I haven't noticed before.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And unlike the other features, the routing setup roads didn't show any significant correlation with this curb.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In fact, we are studying our intuition becausw the text change places were chosen by hand.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There's something something about pewter plans future plans.",
                    "label": 0
                },
                {
                    "sent": "We're going go on developing the multi multi dimensional comparison set analysts.",
                    "label": 1
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "And we are developing standalone application for music analysis.",
                    "label": 1
                },
                {
                    "sent": "And of course, this kind of.",
                    "label": 1
                },
                {
                    "sent": "Apple's could be used in music information retrieval also.",
                    "label": 0
                },
                {
                    "sent": "And then we will use iterative use of comparison set analysis.",
                    "label": 0
                },
                {
                    "sent": "I will show you what.",
                    "label": 0
                },
                {
                    "sent": "What do I mean with this?",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For example, we can take we can afford.",
                    "label": 0
                },
                {
                    "sent": "At first we can count.",
                    "label": 0
                },
                {
                    "sent": "Or calculate this curve and then we can take this this vector and compare it against all phrases.",
                    "label": 0
                },
                {
                    "sent": "In this piece there are 560 bars in this space, so use it iteratively.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There are some references.",
                    "label": 0
                },
                {
                    "sent": "We just got from from Alvin.",
                    "label": 0
                },
                {
                    "sent": "An article in which we introduced this.",
                    "label": 0
                },
                {
                    "sent": "Competition set allies among some other.",
                    "label": 0
                },
                {
                    "sent": "Aproaches",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "One meeting for one question.",
                    "label": 0
                },
                {
                    "sent": "Have you thought of doing discovery of compare comparison sets?",
                    "label": 0
                },
                {
                    "sent": "We're discovering patterns of comparison sets, discovering of well.",
                    "label": 0
                },
                {
                    "sent": "You are required to specify the comparison set.",
                    "label": 0
                },
                {
                    "sent": "Yeah, Can you imagine taking piece and finding what the good comparison sets could be?",
                    "label": 0
                },
                {
                    "sent": "Yes, we can use for example principal component analysis to select those sets which had a greatest variance among these pieces or.",
                    "label": 0
                },
                {
                    "sent": "Or take or use all all hexa Hexa core set classes 18 Sicola said classes and see what happens for example.",
                    "label": 0
                },
                {
                    "sent": "Struck by your diagram.",
                    "label": 0
                },
                {
                    "sent": "Prevalence of scrubs.",
                    "label": 0
                },
                {
                    "sent": "Yeah the first one, yeah?",
                    "label": 0
                },
                {
                    "sent": "Now I'm not sure what speech class set is most representative for well known block composer shape.",
                    "label": 0
                },
                {
                    "sent": "When he was young.",
                    "label": 0
                },
                {
                    "sent": "Uh huh.",
                    "label": 0
                },
                {
                    "sent": "Just wondering if there was a corresponding pull off diagram.",
                    "label": 0
                },
                {
                    "sent": "OK. Perhaps perhaps we need to admit you think that I.",
                    "label": 0
                },
                {
                    "sent": "Two to select 22 pieces from Japan and compare those or.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you thanks.",
                    "label": 0
                },
                {
                    "sent": "Cancel 6:00 o'clock so I will be there, work till then sure.",
                    "label": 0
                }
            ]
        }
    }
}