{
    "id": "aa5fw7e3hglmw6rr536wgnjvj7nzakwt",
    "title": "Truth in Fan Fiction",
    "info": {
        "author": [
            "Peter Ludlow, Department of Philosophy, University of Toronto"
        ],
        "published": "Feb. 22, 2008",
        "recorded": "December 2007",
        "category": [
            "Top->Philosophy"
        ]
    },
    "url": "http://videolectures.net/ung07_ludlow_tff/",
    "segmentation": [
        [
            "What I wanna talk about is what sometimes called fanfiction.",
            "That is to say it's it's.",
            "Maybe you know about this, but not under this name.",
            "So for example, if you take a work of fiction like Harry Potter.",
            "You may not know this, but there are thousands and thousands of people around the world that are writing Harry Potter fiction of their own right.",
            "They're writing their own Harry Potter stories and their exchanging and trading.",
            "These Harry Potter stories and what I want to do is focus what I want to do is introduce you to this kind of fiction.",
            "Amateur fiction, or fanfiction, and think about some of the puzzles that arise from it.",
            "So this is actually going to begin with a.",
            "A little bit of philosophy, then I'm going to go into fanfiction itself.",
            "I'm going to give you some examples of fanfiction.",
            "And then I want to discuss the kinds of philosophical puzzles that fan fiction poses for certain theories of fiction, and then finally I want to solve the problem."
        ],
        [
            "Or try to.",
            "Yes, now there's a very interesting paper by David Lewis philosopher, and it's called Truth in Fanfiction.",
            "Ann Lewis considers several possible stories about the notion of truth that we might have in fiction, right?",
            "If I said truth in fan fiction a second ago, I meant just truth in fiction.",
            "That is, is there any sense when I say, well, you know, Juliet loved Romeo and Romeo love Juliet?",
            "Is there any sense in which we can say?",
            "In the fiction that's true, right?",
            "Well, here's a first way of thinking about it.",
            "You could say, well, look.",
            "A sentence of the form in fiction.",
            "F5 is true or Phi as a sentence like Romeo loves Juliet.",
            "That's true if and only if I is true at every world where F is told as a known fact rather than fiction.",
            "So what does that mean?",
            "That means consider the following.",
            "Imagine that like there, all these different possible worlds write an in some possible worlds.",
            "The whole Romeo and Juliet story are true, and if you go to every world where.",
            "That story is told as though it's true.",
            "Then what we're saying is basically when we say that Romeo Love Juliet is true in the Shakespeare fiction.",
            "It's true in every world where that was true.",
            "Anne Romeo told that story.",
            "The problem with this story, as Lewis points out, is that we extrapolate a lot of facts about the fiction from real world facts that is.",
            "There's more to the fiction, or more is true in a fiction than explicitly what Shakespeare told us.",
            "We figure something."
        ],
        [
            "Is out.",
            "So.",
            "Um?",
            "Right so so for here.",
            "Let me give you an example.",
            "One of the things that Shakespeare didn't have to tell us is that poison acts on your nervous system, and then it can kill you or one of the things that Shakespeare didn't have to tell us is that if you get stabbed by a sword, it can cause vital damage and it can kill you.",
            "So in any fiction, the writer assumes that you have some common sense in real world knowledge, so that the writer doesn't have to load everything up into the story.",
            "So there's some facts that the writer tells you, and other things you just figure out because you've got common sense and you've got real world knowledge.",
            "So Lewis says, well, we might consider the following analysis and it's complicated, and here's how it goes.",
            "Will say a sentence of the form in fiction, F5.",
            "Is non vacuously true if and only if some World War efforts told us a known fact and fires true differs less from our actual world on balance than does any other world where F is told is known fact and fire is not true.",
            "What on God's green Earth does that mean?"
        ],
        [
            "Well, let's say it means this.",
            "It comes to in effect saying that some proposition fires true and affection if and only ethics explicitly stated in the fiction, or it's the sort of thing you would expect to hold in worlds that are as close to the actual world as they can be, given everything that's it told.",
            "Sometimes we call this the reality constraint.",
            "That is, when you tell a fiction.",
            "All other things being equal, you assume that the real world is kind of otherwise, as it is that the person is just adding stuff and you don't have to worry about the laws of physics.",
            "You don't have to worry about biology, you don't have to worry about what's going to kill you and so forth."
        ],
        [
            "Louis.",
            "Considers this, but then says, well.",
            "I think there might be a problem with this analysis, so consider the following story from Sherlock Holmes.",
            "And actually this this quote is from is from a paper in science.",
            "Called how snakes move OK. And so the guy in this paper writing about snakes says in the adventure of the Speckled Band.",
            "Sherlock Holmes solves a murder mystery by showing that the victim had been killed by a Russell's Viper that had climbed up a rope.",
            "What homes did not realize is that a snake is not a constrictor and could not have climbed the rope either.",
            "The snake reached its victim in some other way or the case remains open.",
            "Now there's another possibility here, which Lewis doesn't consider an just to Telegraph where I'm going to go here, but I want to say is the third possibility is that Louis, sorry.",
            "The third possibility is that that.",
            "Conan Doyle, who wrote Sherlock Holmes, just made a mistake, right?",
            "That is when you write a work of fiction, you're not God in some sense, and you can get things wrong about your very own fiction.",
            "And I think it's pretty clear that if Conan Doyle knew that a Russell's Viper could not climb, a snake could not climb a rope.",
            "Doyle would not have written the story this way, so we can say as a third possibility.",
            "Just no.",
            "Doyle screwed up.",
            "He shouldn't have said Russell's Viper.",
            "It was some other kind of snake and maybe we could even fix the fiction.",
            "That's that's another."
        ],
        [
            "Possibility that will take up.",
            "So here in effect.",
            "Well, the next C Lewis Lewis says look the reality constraints not enough.",
            "But then there's this problem about Sherlock Holmes and he's concerned about this Sherlock Holmes problem enough so that he proposes his second analysis.",
            "And the second analysis goes like this."
        ],
        [
            "Well, I'll skip the complicated form.",
            "I'll show you the simple form.",
            "Analysis 2 is that the statement is explicitly stated in the fiction.",
            "And or is the sort of thing you would expect to hold in worlds that are as close to the way the original audience of F took the world to be.",
            "See So what what Luis wants to say is in that Sherlock Holmes case, so the average person in Britain at the time that Doyle wrote that story would believe that a Russell's Viper could climb a rope, and that's enough.",
            "And so you don't have to worry about real world facts.",
            "That's not the stuff that the writer is asking you to fill in, but all you're really interested is a kind of normal belief system, right?",
            "So when shakes, so the Lewis idea is this.",
            "That when you know in Shakespeare and you get a sword fight in someone is pierced by a sword.",
            "You don't have to go through all the kind of business about about biology and medicine, and that swords are dangerous in the real world.",
            "All that's really required is that in for the audience, in Shakespeare's time they would have understood that this would be a fatal injury.",
            "So Shakespeare's audience had certain beliefs and ideas.",
            "Those are the things that we assume are true.",
            "That's where the common sense is that's filling in the gaps in the story.",
            "Right, so there's this stuff.",
            "There's this stuff that Shakespeare literally tells us, and then the rest gets filled in, not by the actual real world, but by the general or common beliefs of the audience.",
            "So instead of calling this the reality constraint, let's call this the general belief constraint.",
            "Alright."
        ],
        [
            "Now there's a.",
            "There's a problem for both of these analysis.",
            "I think an this problem has to do with the issue of of serial fictions, and it also has to do with fan fiction.",
            "Now one of the issues with serial fiction, of course, is that as you write a story, you're constrained not just by general belief in what you're saying in a specific story, but you're also constrained by things that were said in earlier episodes.",
            "So think of a television show, for example.",
            "Earlier episodes of the show are relevant to what's going on here, and there's also a kind of general background about fiction genres that's relevant.",
            "So if I write a story about vampires um, I don't always have to fill in stuff for you, such as a vampire can't see itself in a mirror, right?",
            "Because you all know that this is true, or I don't have to tell you that a wooden stake through the heart will kill the vampire because you all know that that's the case.",
            "Well, Ann, likewise, you know I don't have to tell you that Dragons can breathe fire.",
            "You already know that.",
            "So they certain conventions about John."
        ],
        [
            "And Lewis addresses this.",
            "And he gives a kind of gesture at analysis.",
            "The complicated version there I'll give you the simple version here."
        ],
        [
            "Um?",
            "And that is that some proposition, a fiction is true if it's explicitly stated by Shakespeare, whoever an it's the sort of thing you'd expect to hold in worlds is close to the actual world, as they can be.",
            "And the salient things told inappropriately related fictions.",
            "That is, we can fill in the blanks.",
            "Just buy things we know about vampire stories.",
            "We can fill in the blanks just based on things we know about human nature, and we can fill in the blanks about things we know about well, whatever the genre of fiction is.",
            "We fill in the blanks based on knowledge we have about the genre.",
            "Well.",
            "I am going to suggest eventually that this is.",
            "I mean this is a good start at a kind of theory about how truth and fiction works.",
            "But when we look at fanfiction, it's it's going to introduce new problems and we're going to see limitations for this kind of analysis that Lou."
        ],
        [
            "Is proposing so let me begin by giving you a little primer on fanfiction and what it is and what it's about."
        ],
        [
            "First of all, I give you some concepts from fanfiction.",
            "First of all, there's a notion of Canon which is fiction from the original media source.",
            "So let's say I'm going to do some Harry Potter fanfiction.",
            "Canon is just the stuff that, what's the name of the woman who writes the Harry Potter stuff?",
            "Again.",
            "Oh yeah, Roland so, so anything that she writes, right?",
            "And it's sort of published as a Harry Potter book that counts as Canon.",
            "Sometimes there's a notion of fanfiction that's called fan and an an that can either be fanfiction that becomes Canonical itself right in the fanfiction community, or sometimes it even goes into the actual story, so there are lots of cases of American television shows where people write fanfiction and then the fanfiction actually gets incorporated into the television show the next year, right?",
            "There are three major categories of fanfiction.",
            "One thing you have to understand about fanfiction is that a lot of it involves sexual relationships between the characters, so the very some of the most famous fanfiction involves fanfiction about the American television show Star Trek.",
            "Have any of you ever seen this show?",
            "Yeah, OK, so the fanfiction often involves what sometimes called slash fanfiction, because in the early days it was distributed as these little mimeographed stories, and it would be.",
            "Kirk Slash Spock and the idea would be that it would involve Captain Kirk and Mr. Spock having sex with each other, right?",
            "So so the three kinds will distinguish Jenn, which establishes no new romantic relationships hat, which just involves stories with heterosexual relationships.",
            "That is, you know if you wrote a story with Captain Kirk, an nurse Chapel on on Star Trek, then that would be categorized as het.",
            "And then Slash as in the Kirk and Spock stuff based on some sort of perceived homoerotic subtext to the store."
        ],
        [
            "Ray there are a number of subgenres of fanfiction, including hurt, comfort or HC, so there the idea is Kirk gets injured by some alien monster and somebody takes care of him right, and the whole thing is about this caregiving thing.",
            "There's a there's a whole genre called M preg, in which males become pregnant.",
            "There's actually a lot of Harry Potter impreg in which either Harry gets pregnant or Draco gets pregnant.",
            "That sort of thing.",
            "There's a that should be death, thick, misspelled there, and then there's like a weird genre called curtain Fick, in which it's like Uber domestic.",
            "That means.",
            "So imagine the following.",
            "Imagine you write a fanfiction story in which Harry Potter and.",
            "Anne Draco have a relationship and start living together.",
            "And then there's a whole story just written about how they go out and buy curtains together, OK?",
            "There are other things like episode Fix and this is sort of an important element to it.",
            "Lots of times people perceive that episodes are badly written right, or that they're just flat out mistakes, so consider that Sherlock Holmes example I gave you earlier about this snake going up the up the rope.",
            "I mean, you could imagine someone writing an amidation to the Sherlock Holmes story.",
            "That fixed that episode tag, in which you include a missing scene.",
            "Then there are also alternate universe type fanfiction stuff.",
            "Say if you were going to drop Harry Potter into the Star Trek universe.",
            "There are crossover in which you.",
            "Let's say, well, an example of crossover would be putting Captain Kirk and Mr. Spock in the Harry Potter universe.",
            "And, uh, genre called fluff that just doesn't advance the plot at all, but it's just sitting around doing not."
        ],
        [
            "Very much.",
            "So more fanfic concepts.",
            "There's PWP which is just porn without plot, kink, badfic and some people intentionally write bad, thick and then there's a genre that that's called Mary Sue or Mary Stu fanfiction where it's like so notoriously bad.",
            "So it basically involves writing yourself into a Harry Potter story as like Harry's girlfriend or Harry's boyfriend, or something like that.",
            "Did any of you know any of this?"
        ],
        [
            "Alright, well.",
            "One of the interesting things about fan fiction is there's a system of editorial control for it.",
            "A lot of it's posted up on on site on the Internet, and their fanfiction sites, and there are certain people that are in effect control of it.",
            "We can often the stories are posted with a header that specifies the genre, the pairings of individuals like if you're throwing someone in bed together, it tells you who and all of this sort of allows for archiving.",
            "It also has.",
            "It's a kind of system for a system for organizing the fanfiction.",
            "Then there are these people that are called betas as in beta testers and these are the people that read the early drafts of the fanfiction make suggestions and provide comments for people.",
            "Then there are the list moms or list owners.",
            "These are the people that set rules and guidelines for what can be posted on their board.",
            "So there rules even if you have like weird slash fanfiction in which you have Harry and Harry Potter, an Mr Snape, you know in bed together, there's still rules for the board.",
            "Um?",
            "Once the stories are posted, the readers provide reviews and comments, and then there's also a concept of a BNF which is a big name.",
            "Fan are big name fan fiction writer and some of these fan fiction writers just get like tremendous status within the fan fiction."
        ],
        [
            "Unity.",
            "Let me just give you one hand, here is just one Internet site for fanfiction right and it's harrypotterfanfiction.com.",
            "It's not even the only Harry Potter site, but even in that one site there are as of October 19, there are about 44,000 stories on this site, 163 thousand chapters.",
            "1.3 million reviews.",
            "21,000 offers authors and about 50,000 members of that one board.",
            "And that's not even the largest one, so that just gives you a sense of how fast that community is.",
            "And if you think of it like 163 thousand chapters, that's a lot of stuff being written about Harry Potter.",
            "Or you know, not even written about him, but fleshing out that universe."
        ],
        [
            "Now there's a kind of controversy about fanfiction, and there's a battle in a way between the people who write the fanfiction and then certain Canonical authors that like hate it, and here is a writer named Robin Hobb, and this is what she's got to say about it.",
            "Fanfiction is a good way to avoid learning how to be a writer.",
            "Fanfiction allows the writer to pretend to be creating a story while using someone elses world characters and plot coloring.",
            "Barbie's hair green in a coloring book is not a great act of creativity.",
            "Neither is putting lipstick on Kim.",
            "These are, you know like, Barbie and Ken.",
            "Are these dolls right?",
            "Fanfiction does exactly those kinds of things."
        ],
        [
            "Anyone who read fanfiction about Harry Potter, for instance, would have an entirely different idea of what those stories are about than if he had simply read JK Rowling's books."
        ],
        [
            "People say I quote I should be flattered that readers like my stories enough to want to continue them.",
            "That's not flattering.",
            "That's insulting every fanfiction I've read to date based on my world or any other writers world had focused on changing the writers careful work to suit the foible of the fan rider.",
            "Romances are invented.",
            "Gender identities changed, fetishes indulged and endings are altered.",
            "It's not flattery obviously.",
            "She's pissed off."
        ],
        [
            "To me it is the fan fiction writer saying look, the original author really screwed up the story, so I'm going to fix it.",
            "Here's how it should have gone.",
            "At the extreme low end of the spectrum, fanfiction becomes personal masturbation fantasy in which the fan reader is interacting with the writers character that isn't healthy for any alright.",
            "Like I said, she's real."
        ],
        [
            "He pissed off.",
            "Well, what what can we say about that?",
            "Let's take that argument and set it aside to make our discussion more concrete.",
            "What I want to do now is consider some actual examples of fanfiction.",
            "Anne."
        ],
        [
            "And.",
            "Oh, how that's my first sound effect.",
            "So what these examples that I'm going to show you are actually what we could call sometime Xvid, thick an what people do is not just write stories, but obviously the technology is there so you can actually create your own television shows and movies and so forth.",
            "And this what I have here is an example of a.",
            "Let's see if I can get this to work.",
            "What I have here is an example of a. Um?",
            "Of a Star Trek episode that was created by fans, this is a pilot for it.",
            "A fan created television show for fan fiction.",
            "And let's see if we can get this to happen.",
            "Microsoft update 611.2.",
            "Seriously?",
            "Right, so I'm frustrated by the lack of information gathered thus far back by the fact there's nothing to do but wait for the energy or the truth.",
            "I do not recall disappearing.",
            "What song?",
            "Composition of this way over here.",
            "What about my brother Sam?",
            "My mother gave Katrina really when they left for dead.",
            "What is it like?",
            "I do not understand words Amazing Grace.",
            "How sweet the sound that say correctly.",
            "I was lost, but now I'm found for July, but now I see.",
            "Starbucks.",
            "Sending compassion for those in need.",
            "Set an alarm.",
            "Can't help himself.",
            "Actually, nothing was wrong with the solid Cedar dated here.",
            "Whenever the registrar poster boards would like this piece, is there breaking destruction?",
            "Yes, but it's the ideal that survives today, so really I still remember something.",
            "Your little friend.",
            "Dump.",
            "Beware models bearing gifts.",
            "My bones by myself you're aware Doctor Farmingdale is legal?",
            "'cause I should say I only use it for medicinal purposes.",
            "Now, this looks familiar.",
            "I'll have to check his next move.",
            "Will you play with the receiving payment chest with Galaxy irritated with Doctor?",
            "Soon you'll be rotating, yes.",
            "Back at my father here with me now.",
            "I love who made, learn, enjoy.",
            "Cursive writing.",
            "Received a message from Starbase 27 with 711.",
            "Anyway, for the hours for us?",
            "Alright, that's enough of that.",
            "Let me.",
            "Let let me.",
            "Let me continue here with another example.",
            "What have I done?"
        ],
        [
            "Alright, So what I've got here is.",
            "You know this the start this.",
            "This involves Star Wars right?",
            "And so it starts out really with Episode 4.",
            "And so the way it progressed in the movie theater was 456 and then it comes back with 123.",
            "And there's this gap between Episode 3 and episode 4, in which you want to.",
            "You're wondering what happened to all the all the Jedi Knights.",
            "OK, so a lot of fanfiction addresses this question, right?",
            "It's sort of after the Clone Wars, but before you get to the episode that has Luke Skywalker and all that stuff.",
            "So this this is a trailer from a movie that's being made by fans in which is supposed to address that gap in the in the Star Trek.",
            "The Star Wars thing.",
            "And hopefully there we go.",
            "This one, this one is going to load slowly, so I'm going to talk a little bit while I while it loads.",
            "So I mean, what one of the?",
            "I mean, there's like basically three different things you can think about happening here.",
            "One is that there are just gaps in the in the fiction world that.",
            "That like remained to be sort of fleshed out, and when we look at this one, this is going to be a particular case right where you're filling in a gap between two episodes of a particular movie, right?",
            "Other things involved just fleshing out characters or things that happen.",
            "Simultaneously with things that you actually saw in the movie, so it's entirely possible to write a work of fanfiction that's sort of taking place at the same time as other events in a movie, but you just didn't get to see it, right?",
            "So, for example, you could imagine someone writing a story that just involved what's going on with Luke Skywalker and Yoda, while all this other stuff is going on at the same time, right?",
            "And the third thing is just going to involve.",
            "Things that we consider to be wrong or considered to be mistakes.",
            "Others.",
            "A famous Star Trek example where the people on the show decided it would be really great are really fun to have.",
            "One of the characters get pregnant like I forget which one it was, but a lot of fans objected to that and thought it was gratuitous and unnecessary, and it was just some sort of male sexism that it made its way into the show.",
            "Other kinds of fixes.",
            "If you remember episode one of Star Trek, which was The Phantom Menace?",
            "Sorry, episode one of Star Wars, which was the Phantom Menace and there was this character Jar Jar Binks that was like extremely offensive and looked to be based on a kind of racial stereotype.",
            "One of the things that people have done is to completely re Edit episode one of Star Wars, so there's a famous one called the Phantom Edit, Right?",
            "Instead of the Phantom Menace and a person just went in and completely re edited the entire episode and is actually it's much much better because like George Lucas is not actually not a very good at are as what I've learned from this.",
            "And the story is much superior and there are a couple of re edits of this right that are available on the Internet or which you can buy over the Internet.",
            "And the first thing all of them do is remove this character Jar Jar Binks from the show, because as much as possible because he's completely intolerable.",
            "Well, this is loaded enough so I think I can start playing it.",
            "And again, remember, this is a fan created thing and you'll be blown away.",
            "You'll be blown away by the special effects, but the acting is horrible so the acting is horrible.",
            "That's how you know it's a fan production, but it shows how anyone can do special effects.",
            "Empire.",
            "Always useful.",
            "Troops ready.",
            "Priority do you have it?",
            "How did that to you?",
            "I really don't care what you want very much.",
            "Yeah.",
            "There we we, we got, we were not loading fast enough to catch up with that.",
            "Alright, I'm going to show you one more.",
            "This one is a.",
            "Is a trailer for a production of the TV show.",
            "It's a fan fiction version.",
            "That said, in a in a universe for a television show that was called Firefly, Firefly was a TV show that show it was in America played for about 8 episodes before they killed it, but it was made by the guy who made Buffy the Vampire Slayer.",
            "Joss Whedon OK, and it's amazing.",
            "The only made eight 8 episodes of this show.",
            "But there's an enormous fanfiction industry.",
            "Or just enormous and there actually could setting up a virtual world version of Firefly.",
            "The basic thing you need to understand about Firefly is that sorry.",
            "It's what it is.",
            "It's like a cowboy, a cowboy show in outer space, right?",
            "So they have these people flying around from planet to planet and they're actually like.",
            "Whoops, sorry they're actually rustling cattle.",
            "She.",
            "I guess we watched the rest of this first.",
            "Yeah.",
            "Alright.",
            "Now.",
            "I want to get my slideshow back up."
        ],
        [
            "Alright, here's my here's my cowboy in Outer space trailer.",
            "For Firefly Urban Outfitters.",
            "I'm really, really happy to take him back to every kind of music you still find.",
            "Or no, it's even worse.",
            "Alright.",
            "Like I said, the acting is really bad.",
            "Sound.",
            "Yes.",
            "Round up.",
            "Line.",
            "Down there.",
            "Here's hoping we can do this.",
            "Yes, yes.",
            "I think it's fair to say it didn't appear in the summer of 2007, but."
        ],
        [
            "Alright.",
            "I mentioned the Star Wars Phantom added thing.",
            "This actually did a lot of things.",
            "First of all, it removed this kind of racially offensive character Jar Jar Binks.",
            "It re added to it a lot of the discussion between the battle droids.",
            "I trimmed a lot of the political discussion at illuminated redundant exposition.",
            "You rearrange shots and scenes to imagine.",
            "Sorry to match the original trilogy style, and if you remember, if you saw it, there was like little Anakin.",
            "Anakin Skywalker, who's later going to grow up to be Darth Vader.",
            "I mean that through to that movie he's always doing, like lots of hippies and wow ease and he's really annoying.",
            "So they changed a lot of the dialogue to make him a stronger."
        ],
        [
            "Character too.",
            "Um well.",
            "Turns out that you could think of fanfiction is not really being something.",
            "Altogether new and you know what about this?",
            "If you go back to 1428, there was a story by John Lidgate called the Siege of Thieves, which actually continued Chaucer's Canterbury Tales, right?",
            "Well, was that fanfiction or Robert Henryson also had a variation on on a story by Chaucer, which was itself a variant of a Greek myth.",
            "You know those episodes of fanfiction?",
            "I I gave this talk at the American Society for Aesthetics and I said, well, you know, really, Shakespeare was just a fanfiction guide to write because I mean his stories were all recycled, of course.",
            "And then there's some people who think he didn't even do the writing of them.",
            "He was.",
            "He was sort of like a fanfiction list, mom, and what he was basically doing was aggregating, running a shop in which people were providing fanfiction stories based on classics.",
            "Irene"
        ],
        [
            "I'm neutral on this question.",
            "Other early fanfiction.",
            "See one of the things that's true about.",
            "Fanfiction today is that an enormous percentage of the people doing fanfiction are women.",
            "I mean, it's like 75% of it is written by women, and there's also a long history of this.",
            "So if you go back to the 17th century in 1613, Elizabeth Carey.",
            "Wrote the tragedy of Mariam, which was based on Josephus's story of King Herod's wife.",
            "Then Lady Mary Roth wrote a piece that was based on Sydney's the Countess of Pembroke's Arcadia.",
            "1654 Anna we wrote a continuation of this story, and there's also even earlier in 1590, someone found a copy of Arcadia by this woman Lucy Hastings, in which she had like handwritten notes and continuations inside her copy of the book, Right?",
            "So this is an enterprise that people have been engaged in for a long time."
        ],
        [
            "I'm.",
            "Are Interestingly, a lot of it.",
            "Is sort of correct?",
            "If what it does is it provides you a perspective on the story from somebody else's perspective.",
            "One example that people point to is M butterfly, which is based on Madame Butterfly.",
            "But I think the more salient examples here are the following.",
            "So Shannon Asselin wrote a piece called Ahab's wife, which is based on Moby Dick.",
            "But it's told from it's told from the perspective of Captain Ahab's wife, right?",
            "So imagine what that was like being married to Captain Ahab the then Alice Randall wrote a story called the Wind Done, Gone, which is.",
            "Which is based on gone with the wind, but it's told from the perspective of Scarlet Slave An then Nancy Rawles had wrote a piece called or book called My Gym which is based on the Huck Finn story only.",
            "It's told from the perspective of Jim and his wife and you can see how I like powerful it would be to see these stories from these other perspectives, right?",
            "So there's this kind of tradition going way back, but also in contemporary fiction of people doing this sort of thing.",
            "Taking that fictional world and sort of looking at it from another perspective or another angle, and that's I think the correct way to think about what fanfiction people are doing right there.",
            "Providing some alternative perspective at these these."
        ],
        [
            "Stories are into these world, and in fact there's a very important book on fanfiction called textual poachers by Henry Jenkins, who's at MIT and he said fanfiction is a way of the culture repairing the damage done in a system where contemporary myths are owned by kept corporations instead of folk, right?",
            "Because when the Corporation controls the fiction right then, it's got to basically be.",
            "Correct from the perspective that Corporation in the audience it's trying to reach and not offend advertisers and so forth, right?",
            "So then it becomes up to the fans to to sort of have the corrective remedy to this and sort of get out what this take the story where May."
        ],
        [
            "It should have gone.",
            "Now.",
            "Let's go back to Louis is story about truth and fiction and think about.",
            "How limited that looks when we consider it from the perspective."
        ],
        [
            "Fanfiction.",
            "Here's what we would actually need if we wanted a story about fanfiction that really made sense here.",
            "First of all we need is a way of critiquing Canonical fiction for flouting norms and getting real life facts wrong.",
            "I mean, this takes this back to the case of.",
            "Of.",
            "Sherlock Holmes, right where Conan Doyle wrote that you know the snake was climbing the rope, but that kind of snake can't climb a rope.",
            "Or what about other kinds of facts that people get wrong?",
            "Right in fictional works, but we want a way of being able to critique these fictions.",
            "But we also want to have a way of critiquing them when they happen.",
            "They put in a racially offensive character, like Jar Jar Binks as well.",
            "Secondly, we want to make sense of the idea that you could improve on Canonical fiction by extensions and repair.",
            "So in a certain sense, if these if these fans are fleshing out what happened between episode 3 and Episode 4 of Star Wars, I mean that's a contribution and we want to make sense of that, but we want to be able to say that what they did is true, or that it added to that that fictional universe.",
            "We want to develop alternative narratives that explore alternative points of view and latent subtext, so ideally, you know, we want to be able to say that in a certain genre of fanfiction, where Kirk and Spock are lovers, for example, or where Harry Potter and Snape are lovers, we want to have some way of saying, well, in the fiction, it's true that Harry and Snape are lovers.",
            "But but we gotta come up with some way of making sense of that idea, that in the narrative, right, that could be right.",
            "We want to still have a way of critiquing fanfiction.",
            "First of all, if you write something a piece of fanfiction right and you post it to the board, people will critique you, right?",
            "It's not like anything goes.",
            "It will say this is bad, this is wrong, etc.",
            "So even if you've left the Canon behind and you're.",
            "100 miles away from Canonical fanfiction and you have, you know, Harry and Snape are like doing it somewhere, right?",
            "There's still going to be critique.",
            "Possible, right?",
            "Is the discussion honest?",
            "We want at the same time to provide Canon based critiques of fanfiction, right?",
            "So even if someone is writing the work of fanfiction.",
            "I don't mean necessarily the Robin Hobb Virgin right, but maybe something like it.",
            "You would want someone to be able to say, well, this fanfiction guy took it to the wrong way because Harry would never do this or Harry would never say this.",
            "And finally we want to be able to do the whole thing without any kind of contradiction.",
            "We want it to be coherent.",
            "Are they?"
        ],
        [
            "That sounds impossible."
        ],
        [
            "But This is why.",
            "We get the big Bucks philosophy, so let me give you a prelude to an analysis here.",
            "I'm.",
            "Where I'm going to go with this is going to assume a notion of normative grounding for a work of fiction F. So let's provide a definition.",
            "I'll say that for any fanfiction F worlds that provide normative grounding, forever are those worlds consistent with the norms established by the relevant community of fanfic readers?",
            "Given expectations established for FK, so there are different kinds of norms that you can establish.",
            "So if I if I label my story as flat slash fanfiction, that establishes certain expectations, and it's also going to set me up for probably respecting certain norms, or it's going to give, it's going to give the reader's expectations about the kinds of norms that's guiding my writing here.",
            "Now the possible norms are going to include things like physical laws, logical laws, biological laws, social norms, ethical norms, norms of character, etc.",
            "That is.",
            "If I write a story.",
            "That's.",
            "I can say I'm Sherlock Holmes, right?",
            "I don't or I'm Conan Doyle writing a Sherlock Holmes story.",
            "I have my characters in there.",
            "Very interesting characters, but I think that for the most part, what I want the stories to do is to obey existing physical laws.",
            "A distinct existing logical laws.",
            "Certainly existing biological laws, etc.",
            "And so Lewis is not right in thinking that what we're interested in here is just the general beliefs of the community, right?",
            "Because it's not like Conan Doyle is writing just for the community of whatever 19th century England, right?",
            "But what what he's really after here is telling us that look, I'm telling you some stuff about this character.",
            "Sherlock Holmes, who lives in London and everything else is, is as it should be, in effect.",
            "So for example.",
            "I'm assuming that the standard physical laws hold.",
            "I'm assuming that the standard logical laws hold.",
            "I'm assuming the standard.",
            "Biological laws hold, etc and we have some play with this.",
            "In the case of Sherlock Holmes and Conan Doyle, basically all of those things held.",
            "But if you write a certain scientific story, you might you might have different laws or different physical laws, so you might relax or."
        ],
        [
            "Change some of those norms.",
            "So here's analysis three, and if I guess I should give a nicer name to it, then analysis 3.",
            "So I guess I guess what I would call it is the norm, consistency or the salient norm theory of truth and fiction, because we're going to raise certain norms to salient.",
            "And those are the things that are going to sort of flesh out the rest of the story, right?",
            "So remember in all these cases, there was what the author literally said.",
            "How do you flush it out?",
            "Is it everything that's true in the real world?",
            "Well, that doesn't seem right.",
            "Is it what my audience believes?",
            "That doesn't seem right, and what I'm suggesting is that what what these people do is they raise certain norms to salients and then those norms are going to sort of provide the material.",
            "The raw material for fleshing out the additional stuff that's going to make it true in the fiction, and so technically, here's how it goes.",
            "Some proposition fires true in a fanfiction F if either.",
            "Find the sort of thing you would expect to hold, given a sincere telling of the story F or it's the sort of thing you would expect to hold given a sincere telling of F in a set of worlds W prime related to W by permissible extension."
        ],
        [
            "Well, what's a permissible extension?",
            "Well, suppose Phi isn't the sort of thing you would expect to set holding a set of worlds that are Canonical for F. Let let let me just be very careful here, right?",
            "So what time is?",
            "Let's imagine, let's imagine I I completely agree with this part.",
            "So the let's imagine that I'm writing a story and I'm writing it and posting it to a fanfiction board.",
            "There are certain norms that are respected on that board.",
            "OK Anne, I'm either in accord with that or not, but so something could be true, right?",
            "If I if I sort of flesh out some story and then the norms of that community fill in the details.",
            "But sometimes I want to go and push the boundaries right?",
            "I want to go further, annex and sort of say I'm going to relax some norms here.",
            "I'm going to do something crazy right?",
            "So when am I permitted to do that?",
            "And that's what I mean by a permissible extension, so it should be the sort of thing you would expect to hold in a set of worlds W prime that differ from W with respect to some manageable number of identifiable norms.",
            "So let's suppose that my fanfiction community has.",
            "Some very clear norms established, and let's suppose we could number them, you know, respect certain physical laws.",
            "The biological laws allow certain kinds of weird symbiotic creatures.",
            "That's fine.",
            "Social norms are like different because it's a different social world.",
            "And then I want to sort of try something new.",
            "When am I permitted?"
        ],
        [
            "Do something like that and what I've suggested there is that you kind of have to hold as much as constant as possible and but you can still push the envelope right?",
            "If you're clear, or at least not deceptive about the norms being played with, right?",
            "So if I'm going to extend, you know, change the biology of this world somehow, then I at least have to be clear about that, right?",
            "You offer some sort of explanation for why this is different.",
            "You can see this in if you know a TV show like Buffy the Vampire Slayer.",
            "There's all this background about how things are supposed to be with vampires, but sometimes they diverge from the usual vampire stories.",
            "So then someone goes well, I thought vampires were like this and they go.",
            "No, no, it's not like that at all and they go into a like a long story about how the usual stuff about vampires is wrong.",
            "So you have to Telegraph when and why you're violating one of these norms.",
            "Alright, well what?"
        ],
        [
            "The kind of resulting picture here.",
            "And how is it that we can sort of have exchange of sort of discussion between people involved in a fanfiction community and people involved in the Canonical community?",
            "The basic idea is that if you think about a Canonical fiction, they're often certain norms that are established right, and likewise there are actual world norms.",
            "These are the actual physical laws, biological laws, and social norms that we recognize.",
            "Fanfiction.",
            "R. Sort of extend the boundaries or provide this like a new set of norms to deal with that people introduce.",
            "Sometimes you get overlap with the actual world.",
            "Sometimes you get overlap with norm systems from standard Canonical fiction worlds.",
            "And sometimes all three of them overlap, so there are these points of intersection, and I think you probably get that with something like a Sherlock Holmes story, or probably with most most Shakespeare stories.",
            "I think where there's a kind of intersection between actual world norms and the norms of that Canonical fiction.",
            "An if we write a piece of fanfiction about it, we might also say we're going to respect those norms to write.",
            "That is, if I were going to write some some.",
            "Fan fiction based on Romeo and Juliet telling.",
            "About the other capital, it's right or the other Montague's.",
            "I might respect all of these norms, and if I don't, right if I'm going to sort of push the boundaries then then I mean I have to Telegraph that somehow.",
            "So if it's the the Capulets and Montague's in outer."
        ],
        [
            "Space or something?",
            "So how what?",
            "What is this by all of us?",
            "I mean in the homes and Snake case, what's happening is that that thing is the problem with that, that that.",
            "That mistake in there is that it flouts the norm in the homes Canon, which is respect for real world physical laws, and I think that Conan Doyle was very rigorous about this.",
            "So when he violates that norm, we say look he made a mistake.",
            "It calls for correction in the Jar Jar Binks case in The Phantom Menace.",
            "What we're doing is we're flouting norms in the Star Wars Canon, which is respect certain real world social norms.",
            "Certainly don't.",
            "Don't be a racist idiot.",
            "In M Craig fiction, right?",
            "Suppose we had a piece of fiction which Harry Potter gets pregnant.",
            "This happens or in which Draco gets pregnant.",
            "Well, there were supposed to expect respect norms related to social, logical aspects of pregnancy.",
            "I don't have it with me, but I have a little passage from.",
            "A live Journal.",
            "Our entry that was written by this person who kind of role plays as.",
            "Draco, after he's been made pregnant by Harry Potter.",
            "OK, so so he keeps.",
            "So there's a person who keeps a daily Journal write every day he gets up and writes ya'll in the voice of Draco.",
            "And then it's like really sad because I'm sitting around I got up I threw up this morning I'm really bored I don't know what to do with myself and so it's really a story about being pregnant and being abandoned.",
            "Well I you know Harry's off like doing all this great wizard stuff.",
            "And Draco, Draco, Draco is sitting in the sitting in his like dorm room like you know, with morning sickness.",
            "OK, well, I mean it in a certain sense.",
            "That's even though it's like magical and weird and freaky and a little bit scary.",
            "I mean, it's still respecting certain norms.",
            "So like you might say, if like Drake was right.",
            "Oh wow, being pregnant is the funnest thing I ever did I mean, you might say that that's flouting certain kinds of norms.",
            "And then their cross community critiques are made possible.",
            "Right by points of overlap.",
            "So in these in these cases where we do have points of overlap right, we can say, well, look, you're supposed to be respecting these these law norms of certain physical laws.",
            "You're violating it here, and it doesn't matter if that critique is coming from the Canonical Canonical fiction perspective or the fan fiction perspective.",
            "Everyone kind of has a voice in this critique because they can say these are the norms years you've said, or the norms that are salient here.",
            "And you seem to be violating those, so the way you're writing this fiction is like you've made a mistake here somewhere.",
            "That is not consistent with the fictional world you're developing, even though it's a even though it's a fanfiction."
        ],
        [
            "Story now I want to consider a complication at this point, which is what I would call automated fanfiction.",
            "One of the things that people have done is use virtual worlds and video games like The Sims on line for example to produce works of fiction or reproduce works of fiction.",
            "So there's an entire episode of.",
            "There's an entire episode of Harry Potter story that's been produced in The Sims on line, right?",
            "Which is sort of amazing, right?",
            "Because?",
            "Because what you're in effect doing is getting these little Sims that are kind of automated and you can't really control everything they do right there.",
            "These little video game characters and so so like you know, some Snape will be up there teaching and all of a sudden for no no apparent reason, he'll dance a jig or something like that, right?",
            "And so the person who made this actually also made a series of bloopers and outtakes, right?",
            "Because you have to edit out the crazy stuff you can't control.",
            "But here is the sort of puzzle about it.",
            "Suppose.",
            "Suppose I do make this.",
            "I want to use.",
            "I want to use a video game to create a work of fiction and something random happens in it.",
            "Write something that I didn't anticipate or control.",
            "Does that make it into part of the fiction as well?",
            "I just wanted to give a couple examples here.",
            "Some impreg fanfiction.",
            "I guess they're both impreg fanfiction, just just so you can see.",
            "The first one, involves Jack Sparrow from from.",
            "Pirates of the Caribbean thanks.",
            "All it really is is just him having the baby but.",
            "I can't resist it.",
            "Yeah.",
            "Well that was disturbing.",
            "Alright.",
            "Let's start.",
            "Here's this now.",
            "This involves Harry Potter and Snape OK.",
            "Yes.",
            "Would you?",
            "I'm going to speed this up a little.",
            "Well.",
            "Let's play star Chinese.",
            "Alright here, oh here, it will just go there is pregnant now.",
            "Would you love me?",
            "Just talk about the world?",
            "Hi, you're never gonna listen to that song the same way again.",
            "Alright, well.",
            "Is there?"
        ],
        [
            "Anything we can say about?",
            "Well, here's another complication.",
            "This is actually very interesting.",
            "There's like kind of fanfiction role play, so I showed you the video from Firefly.",
            "Those Cowboys in outer space thing.",
            "In The Sims on line, which is a virtual world that I hang out there, a number of islands there that are dedicated to people that just role play.",
            "Inside that Firefly universe, right?",
            "There are also regions inside Second Life where people role play in the Harry Potter universe as well.",
            "There are these gorion islands.",
            "Should explain this.",
            "There are these really bad science fiction novels written by this guy named John Norman, and they're about this.",
            "Planet where there are this.",
            "Race of slaves and Masters where they're basically sexual slaves, right, and?",
            "And so they're like many islands in Second life where people role play inside this gorean universe as sexual slaves.",
            "So right Wizards Alley is the place in Second Life.",
            "There's a version of Gotham City inside Second Life, and there's also the Justice League Unlimited.",
            "There people that actually run around in like capes and tights and so forth and and fight evil inside Second life.",
            "So what's going on in there, right?",
            "So when people are role playing like that, is it just play or is it?",
            "Are they actually constructing little narrative's, right?",
            "I mean, that is an interesting question there.",
            "So if they get into a discussion there with some evil character.",
            "I mean.",
            "They're often typing in character, right?",
            "They're typing in the character of Harry or someone in that universe, right?",
            "Are they actually working out?",
            "That fictional world?",
            "Or are they just doing something else altogether?",
            "Well."
        ],
        [
            "The question is, can we extend the analysis?",
            "The analysis about norms to handle narratives outside of authorial intention, that is, The Sims kind of have minds of their own.",
            "You can't really predict when they're going to like.",
            "Have a thought about Snape, right?",
            "I mean, that's random.",
            "You can't predict exactly.",
            "You know when Harry is going to start throwing up, right?",
            "You can't predict exactly when the baby is going to come or how they're going to react.",
            "So these aspects of the narrative.",
            "They're outside the authorial intention.",
            "One thing you could do is to incorporate a notion of truth in role play, right?",
            "So you could say, well, you're not.",
            "That's no way to play inside the Harry Potter universe.",
            "You shouldn't be.",
            "You shouldn't be playing that way.",
            "So the possible answer then is you extend the fiction F beyond tellings and aeration to include automated fanfiction and role play.",
            "And then you have to, you know, do lots of tweaks and so forth.",
            "And and be careful about how you set that up.",
            "But I think."
        ],
        [
            "Is possible to do something like that?",
            "Finally, I want to close on this one.",
            "You all have seen.",
            "Maybe the movie Mary Poppins at some time, so you know about Mary Poppins, this magical nanny that's played by Julie Andrews and comes and takes care of these kids.",
            "Anne, it's a Disney movie, so it's all very happy and cheerful and so forth.",
            "But here's an example of how someone took something and re edited it right, and what they're going to do is re edit it to sort of show a certain subtext to the story, which is if you think about it.",
            "Mary Poppins is very scary because she's just like Nanny that has these weird magical powers, right?",
            "So here's a re edit.",
            "It's called scary Mary.",
            "I hope it's still on line here.",
            "Anyway.",
            "I I I like closing on that one, but you get the idea that they mean so.",
            "There's some very powerful things you can do with re editing.",
            "Just re editing stuff and all of those were clips from this kind of very happy Disney movie, but it's also revealing of some sort of subtext.",
            "And one thing you might want to do eventually is sort of take the analysis and figure if you know you could extend it to an ocean of truth in parity or something like that.",
            "Anyway, that's all I've got on this stuff.",
            "Are there any?",
            "Are there any questions or anything?",
            "Do you now know more about fanfiction than you ever wanted to?",
            "You'll probably die.",
            "Mir will probably go home and like start making little fan fan fiction movies of his own now.",
            "Yep.",
            "Usually not, because with the I mean there's an interesting question about what.",
            "When is something fanfiction and when is it just.",
            "One thing that makes it fanfiction is that you don't own the property, so usually a remake of the movie somebody gets permission to remake it and so they have a kind of legal authority to do it.",
            "Um?",
            "People were, I mean that raises a question about.",
            "Shakespeare, for example, right.",
            "If I remake.",
            "A Shakespeare story.",
            "Nobody owns that property anymore, right?",
            "So is it really the case that each?",
            "Each retelling of it is is.",
            "Is now a piece of fanfiction.",
            "Now I mean, it's possible that there really isn't an interesting difference between fanfiction, an just some sort of extension of it and Dairy Dyer.",
            "Somebody had a term for it, which he called arc Arc Onyx fiction, which means it's like your building this giant archive, right?",
            "And so fanfiction and remakes of movies and serial fiction.",
            "They all get lumped together as building an archive of the Shakespeare world, or the Harry Potter world, and so forth.",
            "And then fanfiction is at that point, not really special.",
            "It's just one example of this stuff that we've seen for thousands of years.",
            "And I have no problem with that.",
            "I think any theory.",
            "Any theory that sort of came up with the notion of truth and fiction would probably be indifferent to whether it's fanfiction or something else.",
            "Shakespeare.",
            "As it is.",
            "Or think of have you ever seen Rosencrantz and Guildenstern are dead?",
            "So right so there are these two guys that just.",
            "I mean, they're in the shaker.",
            "Just these messengers and they like there.",
            "They are in the.",
            "The Shakespeare play for like 1 scene for like 2 minutes and then there's a whole movie about these guys delivering the message right.",
            "And so I mean, we don't think of that as fanfiction because it was produced by a major studio etc.",
            "So maybe, maybe maybe the real thing is, it's fanfiction if it's like.",
            "People that aren't professionals that are doing it kind of for love of the.",
            "Love of the.",
            "Whatever, right.",
            "Um?",
            "But there's a question.",
            "You know what happens if it gets too good and like some someone buys it, right?",
            "Like like some of this, this Star Wars the Star Wars movies that people make well.",
            "What if George Lucas bought it from them, right?",
            "Would it no longer be fanfiction in that case?",
            "But what I think what's interesting is that, like.",
            "The stuff that gets called fanfiction.",
            "It's normally stuff that's on the margins and it's people that ordinarily don't have access to.",
            "The production and distribution of artistic works, right?",
            "And that's probably the main sort of indicator of whether it's fanfiction or not.",
            "And it also provides the body of work that's in some ways the strangest and creates the most puzzles and challenges for any sort of analysis of.",
            "Any sort of analysis of fiction?",
            "But you know, I don't know you think about all these.",
            "All the all, I guess it was the French that did all these.",
            "Stories about King Arthur and so forth, and the Knights of the Round Table.",
            "I mean, that seemed to be a case where it was just people just kept extending that world with story after story.",
            "And it continues to this day, although it's often like large corporations and not bodies.",
            "If I'm unpaid people that are doing it.",
            "Yes.",
            "Well, no, I'm sure it's fun and I'm sure it's also that there's a sense of community.",
            "Right, but I think it's also a way of embedding yourself into that world that is.",
            "In writing it, it's a bit like role playing, and you know when when that person is keeping the Journal, for example about.",
            "Draco being pregnant, right?",
            "You're producing a work of fiction, but also this person is sort of inserting themselves into the fiction.",
            "And in the cases of Mary Sue Mary Stu fanfiction, this is obvious, right?",
            "Because they write themselves in as a character.",
            "But probably in writing something it's a way of immersing yourself into a certain world.",
            "And exploring aspects of that world.",
            "So I don't find it all surprising that people that like to write fanfiction would also like these spaces in Second life.",
            "For example, where they can go in and actually role play in that world.",
            "Like the line.",
            "At work.",
            "Create.",
            "Well, that's I mean, you could ask that about anybody who writes anything, right?",
            "I mean, it's also entirely possible that these you know, here are people that are well grounded.",
            "And then they see an error in this fiction and there at least in a position that secure enough and confident enough to say that this stands for correction.",
            "So typically.",
            "This is actually.",
            "This is something that.",
            "Gets talked about in that book textual poachers, which is that we usually ridicule people that do fanfiction and say, oh, they're losers.",
            "They don't have lives, etc.",
            "But the sort of peculiar thing is that you know, we ridicule these people because they're like writing corrective fiction and doing something.",
            "But if someone comes home and sits in front of the TV and does nothing but just absorb what it throws at them, that's fine, right?",
            "And Henry Jenkins suggests that you know part of what's going on there is that we're like a in a way of afraid or threatened by the idea that these people are sort of taking the storytelling's into their own hands instead of letting the Disney Corporation.",
            "Do the storytelling for us, right?",
            "So.",
            "You know you we ask questions like, well, do these people do it because they're unsatisfied with their lives, but you know, I've never heard anyone ask?",
            "Well, did Walt Disney start writing cartoons because he was unsatisfied with his own life?",
            "You know it's an.",
            "I mean, it's very interesting.",
            "I mean, it's interesting that kind of ridicule, that sort of comes in the direction of people that work on fanfiction.",
            "Anne and I think it's in part the fact that they're sort of challenging these institutions that control the production of art and control like production of cultural products to China.",
            "I don't know if it seems like these people are waiting, wishing you seriously because after all, it's just fiction.",
            "I mean, I don't know that Jerry comes forward with Viber.",
            "I happen to see that every node and I never notice there was a problem with the Viking.",
            "Oh, it was like one of the best stories, right?",
            "Yeah yeah, yeah.",
            "Cares, right?",
            "I mean the reader.",
            "So.",
            "Regulation.",
            "Well.",
            "Serious.",
            "Yeah, but we all take what we do seriously.",
            "I mean, some people think that like.",
            "Stress and morphology in Slovenian is interesting too.",
            "But but what?",
            "But in point of fact, like works of fiction and cultural products, they're like very, very important to people, right?",
            "And what what these people are doing is in effect offering correctives or alternative pictures, right?",
            "So what a work of fiction can do is can.",
            "It can sort of reinforce certain attitudes and norms which are not necessarily healthy, right?",
            "And I mean when somebody comes and says, well, I'm going to give you, I'm going to give you the.",
            "Gone with the wind story, but from the perspective of the slave, right?",
            "Of course there's a gun with the wind stories.",
            "No, it's no no.",
            "You see, you've been brainwashed.",
            "This is why it's important that these people do this because you are one of these people that think there's only the one fiction and it's the one that that what's the name of the woman who wrote, gone with the Wind, Martha?",
            "What's your name?",
            "Whatever.",
            "Mid Martha Mitchell know Martha Mitchell is the wife of the Mark Margaret Mitchell.",
            "We don't know.",
            "We don't care so, but the point is, the point is that.",
            "That you know you get in this idea that this is the story and this is how it is an here what these people are saying.",
            "No, that's not right.",
            "It's almost like it's almost as like there's a kind of notion of realism about fiction.",
            "And then someone went in there and they described what's going on, right?",
            "But this was this person is not God, and we we can describe what was going on too, right?",
            "Here is let me, here's another way of putting it.",
            "Well, but why?",
            "Because?",
            "Because here's they're describing some sort of fictional world, right?",
            "But we know that this person is not perfect in describing the fictional world, because they made mistakes.",
            "They violated norms that they.",
            "They weren't supposed to violate like laws of physics or biology or something like that now.",
            "Well, go ahead I will.",
            "I was kind of annoying because.",
            "I I don't.",
            "I don't think it's fair number when he wrote those nobles and they were published in France, well, right, right?",
            "He already killed a character, right?",
            "That's right, yeah.",
            "I know it's stuff like this, but.",
            "But still I mean it doesn't.",
            "It doesn't matter because at this stage we don't appreciate his work.",
            "He's too enjoy no.",
            "Of course you can't.",
            "I mean, it's there's no problem with with.",
            "I mean people make mistakes, but we still think they're great, right?",
            "I mean, Chomsky makes mistakes.",
            "We think he's still great, right?",
            "You make mistakes.",
            "We think you're still great.",
            "I think you've made a mistake.",
            "It was so somewhere, I'm sure, right?",
            "So it's not about.",
            "I mean, the fact that Conan Doyle made a mistake is not a problem.",
            "Is this we correct the mistake?",
            "Right, if Chomsky makes a mistake, you write a paper and you correct it.",
            "You don't say Oh well.",
            "Chomsky said this, so it's the end of the, that's it.",
            "You can't fix it.",
            "Well, but I mean I don't understand the difference here.",
            "I mean I don't understand.",
            "I mean, you can get things wrong in linguistics, just as you can get things wrong in mathematics, just as you can get things wrong in works of fiction.",
            "It's sort of like this, you know I met this I I knew this physical anthropologist and she told me there's this attitude that you get sometimes where someone will find some fossil, and then they'll write a paper.",
            "And then I'm going to go.",
            "Well, that must be how it is, because because she found the bone right, that's the expression she found the bone.",
            "But then you think about it, you know what difference does that make?",
            "Just because you found the bone doesn't mean you have a better idea of what it is or what happened, right?",
            "So suppose someone Conan Doyle, or whoever Gene Roddenberry who creates the Star Trek stuff or whatever it's like they found they found the bone they found this sort of fictional world.",
            "An it doesn't mean that they have the best description of it.",
            "It doesn't mean they're the most the best equipped to flush it out or or describe it or explore it or anything like that, and we should sort of credit them for being great artistic geniuses.",
            "Ann for discovering this, but it doesn't mean their God.",
            "And it doesn't mean that they got the fiction right.",
            "It doesn't mean we can't repair it.",
            "You kind of take fictional words to be sort of the same as were linguistics, places or mathematics.",
            "Yeah, yeah.",
            "Fiction as well maybe?",
            "Depression.",
            "But why?",
            "But why do you think it's different?",
            "Fictional?",
            "Well, I know we agree with that.",
            "Well, it doesn't exist, but I mean I mean.",
            "But I mean it exists we, we talk about it.",
            "Of course, the ways of testing we can judge whether this is like correct or not.",
            "Experiment.",
            "Well, sometimes sometimes right the data are the judgments of whether this is acceptable or not, right?",
            "Likewise, in a fiction, you can judge whether or not this turn in the plot is acceptable, right?",
            "Turn off the part is.",
            "Well.",
            "It's there, it's part of it, but we can critique it.",
            "We can critique it.",
            "I mean, this is what people do.",
            "Well, you can do more than say it's badly written.",
            "You can say no no, that was a mistake that shouldn't have happened.",
            "Or if someone you know if Dickens kills off someone and then forgets that he kills them off and put some back in the story that calls for correction.",
            "Fine, you know you kind of say yeah.",
            "Could have been done well, so why not just?",
            "Why not say let's do it another way.",
            "Let's say it was a mistake.",
            "Let's fix the mistake.",
            "Physical space there just adding new stuff.",
            "Oh well, they're doing both, yeah.",
            "Yeah, they're they're doing.",
            "They're doing, they're doing both right?",
            "They're they're like looking at that world from a different perspective in a different angle.",
            "So it's sort of like there's a world.",
            "And then you have like multiple storytellers.",
            "That's kind of the idea an and.",
            "If they're sharing all the same norms, then then they need to converge on some sort of truth of the matter.",
            "I can see you're not convinced that's OK.",
            "I've no, no.",
            "I'm used to not convincing you.",
            "I understand.",
            "OK, alright it is.",
            "Alright, any anything else?",
            "Working at Target.",
            "You compare somehow he's actually the fishing was already summer there in the history.",
            "So now it's in the future, but anything in writing.",
            "But what about the future?",
            "Do you think it's doing?",
            "Picture of and then we'll work on being next, either next now and.",
            "Whatever happened?",
            "Yeah, well, I actually don't believe in a real distinction between.",
            "Fictional world, an real world, and I'll probably talk about this next Friday.",
            "If you're.",
            "If anyone is comes back after this because with next Friday, that's that's one of the things I want to talk about that I think that distinction just completely breaks down in the end, and you already see this when you just think about fictional characters, because a work of fiction has lots of real world characters in it.",
            "So in the Sherlock Holmes story, London is a character in it.",
            "Right or in an antiwar Hall movie?",
            "NYC is a character in it, or when you know he pulls Marshall Mcluhan out of align.",
            "This was in the movie Annie Hall maybe or Manhattan Annie Hall, so we've pulls like Marshall Mcluhan, out of a line in the movie theater, and it's really Marshall Mcluhan in the movie, right?",
            "So so you have this case where real world characters make it into works of fiction.",
            "And I think we can also find cases where things that are objects that are initially in works of fiction make it into the real world.",
            "So for example, there's this language that was invented in Star Trek, Klingon.",
            "OK, but now you have people in the real world they're actually going to run speaking Klingon, and there's a Klingon language Institute for example.",
            "Is this the International Norm Institute that is responsible for fixing the Unicode character set that was supposed to be using computers and clean 1 characters apart of the Unicode standard?",
            "I'm coming to your experts sweet, sweet yeah so now that's so here's the thing so for sure we have real world things in works of fiction.",
            "But now it looks like we have things that start out in works of fiction that make it into the real world.",
            "Well, how on Earth did that happen and what is the difference?",
            "And I guess the point I would make is that maybe there really isn't a serious distinction between fictional worlds, an fictions and sort of real things.",
            "And that's that's that's basically the subject of next Friday's talk.",
            "OK, so see you.",
            "See some of you on Monday.",
            "Tuesday and some of you on Friday.",
            "Thanks a lot guys and Petya coming all the other things."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What I wanna talk about is what sometimes called fanfiction.",
                    "label": 0
                },
                {
                    "sent": "That is to say it's it's.",
                    "label": 0
                },
                {
                    "sent": "Maybe you know about this, but not under this name.",
                    "label": 0
                },
                {
                    "sent": "So for example, if you take a work of fiction like Harry Potter.",
                    "label": 0
                },
                {
                    "sent": "You may not know this, but there are thousands and thousands of people around the world that are writing Harry Potter fiction of their own right.",
                    "label": 0
                },
                {
                    "sent": "They're writing their own Harry Potter stories and their exchanging and trading.",
                    "label": 0
                },
                {
                    "sent": "These Harry Potter stories and what I want to do is focus what I want to do is introduce you to this kind of fiction.",
                    "label": 0
                },
                {
                    "sent": "Amateur fiction, or fanfiction, and think about some of the puzzles that arise from it.",
                    "label": 0
                },
                {
                    "sent": "So this is actually going to begin with a.",
                    "label": 0
                },
                {
                    "sent": "A little bit of philosophy, then I'm going to go into fanfiction itself.",
                    "label": 0
                },
                {
                    "sent": "I'm going to give you some examples of fanfiction.",
                    "label": 1
                },
                {
                    "sent": "And then I want to discuss the kinds of philosophical puzzles that fan fiction poses for certain theories of fiction, and then finally I want to solve the problem.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or try to.",
                    "label": 0
                },
                {
                    "sent": "Yes, now there's a very interesting paper by David Lewis philosopher, and it's called Truth in Fanfiction.",
                    "label": 0
                },
                {
                    "sent": "Ann Lewis considers several possible stories about the notion of truth that we might have in fiction, right?",
                    "label": 0
                },
                {
                    "sent": "If I said truth in fan fiction a second ago, I meant just truth in fiction.",
                    "label": 0
                },
                {
                    "sent": "That is, is there any sense when I say, well, you know, Juliet loved Romeo and Romeo love Juliet?",
                    "label": 0
                },
                {
                    "sent": "Is there any sense in which we can say?",
                    "label": 0
                },
                {
                    "sent": "In the fiction that's true, right?",
                    "label": 0
                },
                {
                    "sent": "Well, here's a first way of thinking about it.",
                    "label": 0
                },
                {
                    "sent": "You could say, well, look.",
                    "label": 0
                },
                {
                    "sent": "A sentence of the form in fiction.",
                    "label": 1
                },
                {
                    "sent": "F5 is true or Phi as a sentence like Romeo loves Juliet.",
                    "label": 0
                },
                {
                    "sent": "That's true if and only if I is true at every world where F is told as a known fact rather than fiction.",
                    "label": 1
                },
                {
                    "sent": "So what does that mean?",
                    "label": 0
                },
                {
                    "sent": "That means consider the following.",
                    "label": 0
                },
                {
                    "sent": "Imagine that like there, all these different possible worlds write an in some possible worlds.",
                    "label": 0
                },
                {
                    "sent": "The whole Romeo and Juliet story are true, and if you go to every world where.",
                    "label": 0
                },
                {
                    "sent": "That story is told as though it's true.",
                    "label": 0
                },
                {
                    "sent": "Then what we're saying is basically when we say that Romeo Love Juliet is true in the Shakespeare fiction.",
                    "label": 0
                },
                {
                    "sent": "It's true in every world where that was true.",
                    "label": 1
                },
                {
                    "sent": "Anne Romeo told that story.",
                    "label": 0
                },
                {
                    "sent": "The problem with this story, as Lewis points out, is that we extrapolate a lot of facts about the fiction from real world facts that is.",
                    "label": 0
                },
                {
                    "sent": "There's more to the fiction, or more is true in a fiction than explicitly what Shakespeare told us.",
                    "label": 0
                },
                {
                    "sent": "We figure something.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is out.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Right so so for here.",
                    "label": 0
                },
                {
                    "sent": "Let me give you an example.",
                    "label": 0
                },
                {
                    "sent": "One of the things that Shakespeare didn't have to tell us is that poison acts on your nervous system, and then it can kill you or one of the things that Shakespeare didn't have to tell us is that if you get stabbed by a sword, it can cause vital damage and it can kill you.",
                    "label": 0
                },
                {
                    "sent": "So in any fiction, the writer assumes that you have some common sense in real world knowledge, so that the writer doesn't have to load everything up into the story.",
                    "label": 0
                },
                {
                    "sent": "So there's some facts that the writer tells you, and other things you just figure out because you've got common sense and you've got real world knowledge.",
                    "label": 0
                },
                {
                    "sent": "So Lewis says, well, we might consider the following analysis and it's complicated, and here's how it goes.",
                    "label": 0
                },
                {
                    "sent": "Will say a sentence of the form in fiction, F5.",
                    "label": 1
                },
                {
                    "sent": "Is non vacuously true if and only if some World War efforts told us a known fact and fires true differs less from our actual world on balance than does any other world where F is told is known fact and fire is not true.",
                    "label": 1
                },
                {
                    "sent": "What on God's green Earth does that mean?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, let's say it means this.",
                    "label": 0
                },
                {
                    "sent": "It comes to in effect saying that some proposition fires true and affection if and only ethics explicitly stated in the fiction, or it's the sort of thing you would expect to hold in worlds that are as close to the actual world as they can be, given everything that's it told.",
                    "label": 1
                },
                {
                    "sent": "Sometimes we call this the reality constraint.",
                    "label": 1
                },
                {
                    "sent": "That is, when you tell a fiction.",
                    "label": 0
                },
                {
                    "sent": "All other things being equal, you assume that the real world is kind of otherwise, as it is that the person is just adding stuff and you don't have to worry about the laws of physics.",
                    "label": 0
                },
                {
                    "sent": "You don't have to worry about biology, you don't have to worry about what's going to kill you and so forth.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Louis.",
                    "label": 0
                },
                {
                    "sent": "Considers this, but then says, well.",
                    "label": 0
                },
                {
                    "sent": "I think there might be a problem with this analysis, so consider the following story from Sherlock Holmes.",
                    "label": 0
                },
                {
                    "sent": "And actually this this quote is from is from a paper in science.",
                    "label": 0
                },
                {
                    "sent": "Called how snakes move OK. And so the guy in this paper writing about snakes says in the adventure of the Speckled Band.",
                    "label": 0
                },
                {
                    "sent": "Sherlock Holmes solves a murder mystery by showing that the victim had been killed by a Russell's Viper that had climbed up a rope.",
                    "label": 1
                },
                {
                    "sent": "What homes did not realize is that a snake is not a constrictor and could not have climbed the rope either.",
                    "label": 0
                },
                {
                    "sent": "The snake reached its victim in some other way or the case remains open.",
                    "label": 0
                },
                {
                    "sent": "Now there's another possibility here, which Lewis doesn't consider an just to Telegraph where I'm going to go here, but I want to say is the third possibility is that Louis, sorry.",
                    "label": 0
                },
                {
                    "sent": "The third possibility is that that.",
                    "label": 0
                },
                {
                    "sent": "Conan Doyle, who wrote Sherlock Holmes, just made a mistake, right?",
                    "label": 0
                },
                {
                    "sent": "That is when you write a work of fiction, you're not God in some sense, and you can get things wrong about your very own fiction.",
                    "label": 0
                },
                {
                    "sent": "And I think it's pretty clear that if Conan Doyle knew that a Russell's Viper could not climb, a snake could not climb a rope.",
                    "label": 0
                },
                {
                    "sent": "Doyle would not have written the story this way, so we can say as a third possibility.",
                    "label": 0
                },
                {
                    "sent": "Just no.",
                    "label": 0
                },
                {
                    "sent": "Doyle screwed up.",
                    "label": 0
                },
                {
                    "sent": "He shouldn't have said Russell's Viper.",
                    "label": 0
                },
                {
                    "sent": "It was some other kind of snake and maybe we could even fix the fiction.",
                    "label": 0
                },
                {
                    "sent": "That's that's another.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Possibility that will take up.",
                    "label": 0
                },
                {
                    "sent": "So here in effect.",
                    "label": 0
                },
                {
                    "sent": "Well, the next C Lewis Lewis says look the reality constraints not enough.",
                    "label": 0
                },
                {
                    "sent": "But then there's this problem about Sherlock Holmes and he's concerned about this Sherlock Holmes problem enough so that he proposes his second analysis.",
                    "label": 0
                },
                {
                    "sent": "And the second analysis goes like this.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, I'll skip the complicated form.",
                    "label": 0
                },
                {
                    "sent": "I'll show you the simple form.",
                    "label": 0
                },
                {
                    "sent": "Analysis 2 is that the statement is explicitly stated in the fiction.",
                    "label": 1
                },
                {
                    "sent": "And or is the sort of thing you would expect to hold in worlds that are as close to the way the original audience of F took the world to be.",
                    "label": 1
                },
                {
                    "sent": "See So what what Luis wants to say is in that Sherlock Holmes case, so the average person in Britain at the time that Doyle wrote that story would believe that a Russell's Viper could climb a rope, and that's enough.",
                    "label": 0
                },
                {
                    "sent": "And so you don't have to worry about real world facts.",
                    "label": 0
                },
                {
                    "sent": "That's not the stuff that the writer is asking you to fill in, but all you're really interested is a kind of normal belief system, right?",
                    "label": 0
                },
                {
                    "sent": "So when shakes, so the Lewis idea is this.",
                    "label": 0
                },
                {
                    "sent": "That when you know in Shakespeare and you get a sword fight in someone is pierced by a sword.",
                    "label": 0
                },
                {
                    "sent": "You don't have to go through all the kind of business about about biology and medicine, and that swords are dangerous in the real world.",
                    "label": 0
                },
                {
                    "sent": "All that's really required is that in for the audience, in Shakespeare's time they would have understood that this would be a fatal injury.",
                    "label": 0
                },
                {
                    "sent": "So Shakespeare's audience had certain beliefs and ideas.",
                    "label": 0
                },
                {
                    "sent": "Those are the things that we assume are true.",
                    "label": 0
                },
                {
                    "sent": "That's where the common sense is that's filling in the gaps in the story.",
                    "label": 0
                },
                {
                    "sent": "Right, so there's this stuff.",
                    "label": 0
                },
                {
                    "sent": "There's this stuff that Shakespeare literally tells us, and then the rest gets filled in, not by the actual real world, but by the general or common beliefs of the audience.",
                    "label": 0
                },
                {
                    "sent": "So instead of calling this the reality constraint, let's call this the general belief constraint.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now there's a.",
                    "label": 0
                },
                {
                    "sent": "There's a problem for both of these analysis.",
                    "label": 0
                },
                {
                    "sent": "I think an this problem has to do with the issue of of serial fictions, and it also has to do with fan fiction.",
                    "label": 0
                },
                {
                    "sent": "Now one of the issues with serial fiction, of course, is that as you write a story, you're constrained not just by general belief in what you're saying in a specific story, but you're also constrained by things that were said in earlier episodes.",
                    "label": 0
                },
                {
                    "sent": "So think of a television show, for example.",
                    "label": 0
                },
                {
                    "sent": "Earlier episodes of the show are relevant to what's going on here, and there's also a kind of general background about fiction genres that's relevant.",
                    "label": 1
                },
                {
                    "sent": "So if I write a story about vampires um, I don't always have to fill in stuff for you, such as a vampire can't see itself in a mirror, right?",
                    "label": 0
                },
                {
                    "sent": "Because you all know that this is true, or I don't have to tell you that a wooden stake through the heart will kill the vampire because you all know that that's the case.",
                    "label": 1
                },
                {
                    "sent": "Well, Ann, likewise, you know I don't have to tell you that Dragons can breathe fire.",
                    "label": 0
                },
                {
                    "sent": "You already know that.",
                    "label": 0
                },
                {
                    "sent": "So they certain conventions about John.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And Lewis addresses this.",
                    "label": 0
                },
                {
                    "sent": "And he gives a kind of gesture at analysis.",
                    "label": 0
                },
                {
                    "sent": "The complicated version there I'll give you the simple version here.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And that is that some proposition, a fiction is true if it's explicitly stated by Shakespeare, whoever an it's the sort of thing you'd expect to hold in worlds is close to the actual world, as they can be.",
                    "label": 1
                },
                {
                    "sent": "And the salient things told inappropriately related fictions.",
                    "label": 0
                },
                {
                    "sent": "That is, we can fill in the blanks.",
                    "label": 0
                },
                {
                    "sent": "Just buy things we know about vampire stories.",
                    "label": 0
                },
                {
                    "sent": "We can fill in the blanks just based on things we know about human nature, and we can fill in the blanks about things we know about well, whatever the genre of fiction is.",
                    "label": 0
                },
                {
                    "sent": "We fill in the blanks based on knowledge we have about the genre.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "I am going to suggest eventually that this is.",
                    "label": 0
                },
                {
                    "sent": "I mean this is a good start at a kind of theory about how truth and fiction works.",
                    "label": 0
                },
                {
                    "sent": "But when we look at fanfiction, it's it's going to introduce new problems and we're going to see limitations for this kind of analysis that Lou.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is proposing so let me begin by giving you a little primer on fanfiction and what it is and what it's about.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First of all, I give you some concepts from fanfiction.",
                    "label": 0
                },
                {
                    "sent": "First of all, there's a notion of Canon which is fiction from the original media source.",
                    "label": 1
                },
                {
                    "sent": "So let's say I'm going to do some Harry Potter fanfiction.",
                    "label": 0
                },
                {
                    "sent": "Canon is just the stuff that, what's the name of the woman who writes the Harry Potter stuff?",
                    "label": 0
                },
                {
                    "sent": "Again.",
                    "label": 0
                },
                {
                    "sent": "Oh yeah, Roland so, so anything that she writes, right?",
                    "label": 0
                },
                {
                    "sent": "And it's sort of published as a Harry Potter book that counts as Canon.",
                    "label": 0
                },
                {
                    "sent": "Sometimes there's a notion of fanfiction that's called fan and an an that can either be fanfiction that becomes Canonical itself right in the fanfiction community, or sometimes it even goes into the actual story, so there are lots of cases of American television shows where people write fanfiction and then the fanfiction actually gets incorporated into the television show the next year, right?",
                    "label": 0
                },
                {
                    "sent": "There are three major categories of fanfiction.",
                    "label": 1
                },
                {
                    "sent": "One thing you have to understand about fanfiction is that a lot of it involves sexual relationships between the characters, so the very some of the most famous fanfiction involves fanfiction about the American television show Star Trek.",
                    "label": 0
                },
                {
                    "sent": "Have any of you ever seen this show?",
                    "label": 0
                },
                {
                    "sent": "Yeah, OK, so the fanfiction often involves what sometimes called slash fanfiction, because in the early days it was distributed as these little mimeographed stories, and it would be.",
                    "label": 1
                },
                {
                    "sent": "Kirk Slash Spock and the idea would be that it would involve Captain Kirk and Mr. Spock having sex with each other, right?",
                    "label": 0
                },
                {
                    "sent": "So so the three kinds will distinguish Jenn, which establishes no new romantic relationships hat, which just involves stories with heterosexual relationships.",
                    "label": 0
                },
                {
                    "sent": "That is, you know if you wrote a story with Captain Kirk, an nurse Chapel on on Star Trek, then that would be categorized as het.",
                    "label": 0
                },
                {
                    "sent": "And then Slash as in the Kirk and Spock stuff based on some sort of perceived homoerotic subtext to the store.",
                    "label": 1
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ray there are a number of subgenres of fanfiction, including hurt, comfort or HC, so there the idea is Kirk gets injured by some alien monster and somebody takes care of him right, and the whole thing is about this caregiving thing.",
                    "label": 0
                },
                {
                    "sent": "There's a there's a whole genre called M preg, in which males become pregnant.",
                    "label": 0
                },
                {
                    "sent": "There's actually a lot of Harry Potter impreg in which either Harry gets pregnant or Draco gets pregnant.",
                    "label": 0
                },
                {
                    "sent": "That sort of thing.",
                    "label": 0
                },
                {
                    "sent": "There's a that should be death, thick, misspelled there, and then there's like a weird genre called curtain Fick, in which it's like Uber domestic.",
                    "label": 0
                },
                {
                    "sent": "That means.",
                    "label": 0
                },
                {
                    "sent": "So imagine the following.",
                    "label": 0
                },
                {
                    "sent": "Imagine you write a fanfiction story in which Harry Potter and.",
                    "label": 0
                },
                {
                    "sent": "Anne Draco have a relationship and start living together.",
                    "label": 0
                },
                {
                    "sent": "And then there's a whole story just written about how they go out and buy curtains together, OK?",
                    "label": 0
                },
                {
                    "sent": "There are other things like episode Fix and this is sort of an important element to it.",
                    "label": 1
                },
                {
                    "sent": "Lots of times people perceive that episodes are badly written right, or that they're just flat out mistakes, so consider that Sherlock Holmes example I gave you earlier about this snake going up the up the rope.",
                    "label": 0
                },
                {
                    "sent": "I mean, you could imagine someone writing an amidation to the Sherlock Holmes story.",
                    "label": 0
                },
                {
                    "sent": "That fixed that episode tag, in which you include a missing scene.",
                    "label": 1
                },
                {
                    "sent": "Then there are also alternate universe type fanfiction stuff.",
                    "label": 0
                },
                {
                    "sent": "Say if you were going to drop Harry Potter into the Star Trek universe.",
                    "label": 0
                },
                {
                    "sent": "There are crossover in which you.",
                    "label": 0
                },
                {
                    "sent": "Let's say, well, an example of crossover would be putting Captain Kirk and Mr. Spock in the Harry Potter universe.",
                    "label": 0
                },
                {
                    "sent": "And, uh, genre called fluff that just doesn't advance the plot at all, but it's just sitting around doing not.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Very much.",
                    "label": 0
                },
                {
                    "sent": "So more fanfic concepts.",
                    "label": 0
                },
                {
                    "sent": "There's PWP which is just porn without plot, kink, badfic and some people intentionally write bad, thick and then there's a genre that that's called Mary Sue or Mary Stu fanfiction where it's like so notoriously bad.",
                    "label": 1
                },
                {
                    "sent": "So it basically involves writing yourself into a Harry Potter story as like Harry's girlfriend or Harry's boyfriend, or something like that.",
                    "label": 0
                },
                {
                    "sent": "Did any of you know any of this?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright, well.",
                    "label": 0
                },
                {
                    "sent": "One of the interesting things about fan fiction is there's a system of editorial control for it.",
                    "label": 0
                },
                {
                    "sent": "A lot of it's posted up on on site on the Internet, and their fanfiction sites, and there are certain people that are in effect control of it.",
                    "label": 0
                },
                {
                    "sent": "We can often the stories are posted with a header that specifies the genre, the pairings of individuals like if you're throwing someone in bed together, it tells you who and all of this sort of allows for archiving.",
                    "label": 0
                },
                {
                    "sent": "It also has.",
                    "label": 0
                },
                {
                    "sent": "It's a kind of system for a system for organizing the fanfiction.",
                    "label": 0
                },
                {
                    "sent": "Then there are these people that are called betas as in beta testers and these are the people that read the early drafts of the fanfiction make suggestions and provide comments for people.",
                    "label": 0
                },
                {
                    "sent": "Then there are the list moms or list owners.",
                    "label": 1
                },
                {
                    "sent": "These are the people that set rules and guidelines for what can be posted on their board.",
                    "label": 1
                },
                {
                    "sent": "So there rules even if you have like weird slash fanfiction in which you have Harry and Harry Potter, an Mr Snape, you know in bed together, there's still rules for the board.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 1
                },
                {
                    "sent": "Once the stories are posted, the readers provide reviews and comments, and then there's also a concept of a BNF which is a big name.",
                    "label": 0
                },
                {
                    "sent": "Fan are big name fan fiction writer and some of these fan fiction writers just get like tremendous status within the fan fiction.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Unity.",
                    "label": 0
                },
                {
                    "sent": "Let me just give you one hand, here is just one Internet site for fanfiction right and it's harrypotterfanfiction.com.",
                    "label": 0
                },
                {
                    "sent": "It's not even the only Harry Potter site, but even in that one site there are as of October 19, there are about 44,000 stories on this site, 163 thousand chapters.",
                    "label": 0
                },
                {
                    "sent": "1.3 million reviews.",
                    "label": 0
                },
                {
                    "sent": "21,000 offers authors and about 50,000 members of that one board.",
                    "label": 0
                },
                {
                    "sent": "And that's not even the largest one, so that just gives you a sense of how fast that community is.",
                    "label": 0
                },
                {
                    "sent": "And if you think of it like 163 thousand chapters, that's a lot of stuff being written about Harry Potter.",
                    "label": 0
                },
                {
                    "sent": "Or you know, not even written about him, but fleshing out that universe.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now there's a kind of controversy about fanfiction, and there's a battle in a way between the people who write the fanfiction and then certain Canonical authors that like hate it, and here is a writer named Robin Hobb, and this is what she's got to say about it.",
                    "label": 0
                },
                {
                    "sent": "Fanfiction is a good way to avoid learning how to be a writer.",
                    "label": 1
                },
                {
                    "sent": "Fanfiction allows the writer to pretend to be creating a story while using someone elses world characters and plot coloring.",
                    "label": 1
                },
                {
                    "sent": "Barbie's hair green in a coloring book is not a great act of creativity.",
                    "label": 0
                },
                {
                    "sent": "Neither is putting lipstick on Kim.",
                    "label": 1
                },
                {
                    "sent": "These are, you know like, Barbie and Ken.",
                    "label": 0
                },
                {
                    "sent": "Are these dolls right?",
                    "label": 0
                },
                {
                    "sent": "Fanfiction does exactly those kinds of things.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anyone who read fanfiction about Harry Potter, for instance, would have an entirely different idea of what those stories are about than if he had simply read JK Rowling's books.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "People say I quote I should be flattered that readers like my stories enough to want to continue them.",
                    "label": 1
                },
                {
                    "sent": "That's not flattering.",
                    "label": 0
                },
                {
                    "sent": "That's insulting every fanfiction I've read to date based on my world or any other writers world had focused on changing the writers careful work to suit the foible of the fan rider.",
                    "label": 1
                },
                {
                    "sent": "Romances are invented.",
                    "label": 0
                },
                {
                    "sent": "Gender identities changed, fetishes indulged and endings are altered.",
                    "label": 0
                },
                {
                    "sent": "It's not flattery obviously.",
                    "label": 0
                },
                {
                    "sent": "She's pissed off.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To me it is the fan fiction writer saying look, the original author really screwed up the story, so I'm going to fix it.",
                    "label": 1
                },
                {
                    "sent": "Here's how it should have gone.",
                    "label": 0
                },
                {
                    "sent": "At the extreme low end of the spectrum, fanfiction becomes personal masturbation fantasy in which the fan reader is interacting with the writers character that isn't healthy for any alright.",
                    "label": 1
                },
                {
                    "sent": "Like I said, she's real.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "He pissed off.",
                    "label": 0
                },
                {
                    "sent": "Well, what what can we say about that?",
                    "label": 0
                },
                {
                    "sent": "Let's take that argument and set it aside to make our discussion more concrete.",
                    "label": 0
                },
                {
                    "sent": "What I want to do now is consider some actual examples of fanfiction.",
                    "label": 1
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Oh, how that's my first sound effect.",
                    "label": 0
                },
                {
                    "sent": "So what these examples that I'm going to show you are actually what we could call sometime Xvid, thick an what people do is not just write stories, but obviously the technology is there so you can actually create your own television shows and movies and so forth.",
                    "label": 0
                },
                {
                    "sent": "And this what I have here is an example of a.",
                    "label": 0
                },
                {
                    "sent": "Let's see if I can get this to work.",
                    "label": 0
                },
                {
                    "sent": "What I have here is an example of a. Um?",
                    "label": 0
                },
                {
                    "sent": "Of a Star Trek episode that was created by fans, this is a pilot for it.",
                    "label": 1
                },
                {
                    "sent": "A fan created television show for fan fiction.",
                    "label": 0
                },
                {
                    "sent": "And let's see if we can get this to happen.",
                    "label": 0
                },
                {
                    "sent": "Microsoft update 611.2.",
                    "label": 0
                },
                {
                    "sent": "Seriously?",
                    "label": 0
                },
                {
                    "sent": "Right, so I'm frustrated by the lack of information gathered thus far back by the fact there's nothing to do but wait for the energy or the truth.",
                    "label": 0
                },
                {
                    "sent": "I do not recall disappearing.",
                    "label": 0
                },
                {
                    "sent": "What song?",
                    "label": 0
                },
                {
                    "sent": "Composition of this way over here.",
                    "label": 0
                },
                {
                    "sent": "What about my brother Sam?",
                    "label": 0
                },
                {
                    "sent": "My mother gave Katrina really when they left for dead.",
                    "label": 0
                },
                {
                    "sent": "What is it like?",
                    "label": 0
                },
                {
                    "sent": "I do not understand words Amazing Grace.",
                    "label": 0
                },
                {
                    "sent": "How sweet the sound that say correctly.",
                    "label": 0
                },
                {
                    "sent": "I was lost, but now I'm found for July, but now I see.",
                    "label": 0
                },
                {
                    "sent": "Starbucks.",
                    "label": 0
                },
                {
                    "sent": "Sending compassion for those in need.",
                    "label": 0
                },
                {
                    "sent": "Set an alarm.",
                    "label": 0
                },
                {
                    "sent": "Can't help himself.",
                    "label": 0
                },
                {
                    "sent": "Actually, nothing was wrong with the solid Cedar dated here.",
                    "label": 0
                },
                {
                    "sent": "Whenever the registrar poster boards would like this piece, is there breaking destruction?",
                    "label": 0
                },
                {
                    "sent": "Yes, but it's the ideal that survives today, so really I still remember something.",
                    "label": 0
                },
                {
                    "sent": "Your little friend.",
                    "label": 0
                },
                {
                    "sent": "Dump.",
                    "label": 0
                },
                {
                    "sent": "Beware models bearing gifts.",
                    "label": 0
                },
                {
                    "sent": "My bones by myself you're aware Doctor Farmingdale is legal?",
                    "label": 0
                },
                {
                    "sent": "'cause I should say I only use it for medicinal purposes.",
                    "label": 0
                },
                {
                    "sent": "Now, this looks familiar.",
                    "label": 0
                },
                {
                    "sent": "I'll have to check his next move.",
                    "label": 0
                },
                {
                    "sent": "Will you play with the receiving payment chest with Galaxy irritated with Doctor?",
                    "label": 0
                },
                {
                    "sent": "Soon you'll be rotating, yes.",
                    "label": 0
                },
                {
                    "sent": "Back at my father here with me now.",
                    "label": 0
                },
                {
                    "sent": "I love who made, learn, enjoy.",
                    "label": 0
                },
                {
                    "sent": "Cursive writing.",
                    "label": 0
                },
                {
                    "sent": "Received a message from Starbase 27 with 711.",
                    "label": 0
                },
                {
                    "sent": "Anyway, for the hours for us?",
                    "label": 0
                },
                {
                    "sent": "Alright, that's enough of that.",
                    "label": 0
                },
                {
                    "sent": "Let me.",
                    "label": 0
                },
                {
                    "sent": "Let let me.",
                    "label": 0
                },
                {
                    "sent": "Let me continue here with another example.",
                    "label": 0
                },
                {
                    "sent": "What have I done?",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Alright, So what I've got here is.",
                    "label": 0
                },
                {
                    "sent": "You know this the start this.",
                    "label": 0
                },
                {
                    "sent": "This involves Star Wars right?",
                    "label": 0
                },
                {
                    "sent": "And so it starts out really with Episode 4.",
                    "label": 0
                },
                {
                    "sent": "And so the way it progressed in the movie theater was 456 and then it comes back with 123.",
                    "label": 0
                },
                {
                    "sent": "And there's this gap between Episode 3 and episode 4, in which you want to.",
                    "label": 0
                },
                {
                    "sent": "You're wondering what happened to all the all the Jedi Knights.",
                    "label": 0
                },
                {
                    "sent": "OK, so a lot of fanfiction addresses this question, right?",
                    "label": 0
                },
                {
                    "sent": "It's sort of after the Clone Wars, but before you get to the episode that has Luke Skywalker and all that stuff.",
                    "label": 0
                },
                {
                    "sent": "So this this is a trailer from a movie that's being made by fans in which is supposed to address that gap in the in the Star Trek.",
                    "label": 0
                },
                {
                    "sent": "The Star Wars thing.",
                    "label": 0
                },
                {
                    "sent": "And hopefully there we go.",
                    "label": 0
                },
                {
                    "sent": "This one, this one is going to load slowly, so I'm going to talk a little bit while I while it loads.",
                    "label": 0
                },
                {
                    "sent": "So I mean, what one of the?",
                    "label": 0
                },
                {
                    "sent": "I mean, there's like basically three different things you can think about happening here.",
                    "label": 0
                },
                {
                    "sent": "One is that there are just gaps in the in the fiction world that.",
                    "label": 0
                },
                {
                    "sent": "That like remained to be sort of fleshed out, and when we look at this one, this is going to be a particular case right where you're filling in a gap between two episodes of a particular movie, right?",
                    "label": 0
                },
                {
                    "sent": "Other things involved just fleshing out characters or things that happen.",
                    "label": 0
                },
                {
                    "sent": "Simultaneously with things that you actually saw in the movie, so it's entirely possible to write a work of fanfiction that's sort of taking place at the same time as other events in a movie, but you just didn't get to see it, right?",
                    "label": 0
                },
                {
                    "sent": "So, for example, you could imagine someone writing a story that just involved what's going on with Luke Skywalker and Yoda, while all this other stuff is going on at the same time, right?",
                    "label": 0
                },
                {
                    "sent": "And the third thing is just going to involve.",
                    "label": 0
                },
                {
                    "sent": "Things that we consider to be wrong or considered to be mistakes.",
                    "label": 0
                },
                {
                    "sent": "Others.",
                    "label": 0
                },
                {
                    "sent": "A famous Star Trek example where the people on the show decided it would be really great are really fun to have.",
                    "label": 0
                },
                {
                    "sent": "One of the characters get pregnant like I forget which one it was, but a lot of fans objected to that and thought it was gratuitous and unnecessary, and it was just some sort of male sexism that it made its way into the show.",
                    "label": 0
                },
                {
                    "sent": "Other kinds of fixes.",
                    "label": 0
                },
                {
                    "sent": "If you remember episode one of Star Trek, which was The Phantom Menace?",
                    "label": 0
                },
                {
                    "sent": "Sorry, episode one of Star Wars, which was the Phantom Menace and there was this character Jar Jar Binks that was like extremely offensive and looked to be based on a kind of racial stereotype.",
                    "label": 0
                },
                {
                    "sent": "One of the things that people have done is to completely re Edit episode one of Star Wars, so there's a famous one called the Phantom Edit, Right?",
                    "label": 0
                },
                {
                    "sent": "Instead of the Phantom Menace and a person just went in and completely re edited the entire episode and is actually it's much much better because like George Lucas is not actually not a very good at are as what I've learned from this.",
                    "label": 0
                },
                {
                    "sent": "And the story is much superior and there are a couple of re edits of this right that are available on the Internet or which you can buy over the Internet.",
                    "label": 0
                },
                {
                    "sent": "And the first thing all of them do is remove this character Jar Jar Binks from the show, because as much as possible because he's completely intolerable.",
                    "label": 0
                },
                {
                    "sent": "Well, this is loaded enough so I think I can start playing it.",
                    "label": 0
                },
                {
                    "sent": "And again, remember, this is a fan created thing and you'll be blown away.",
                    "label": 0
                },
                {
                    "sent": "You'll be blown away by the special effects, but the acting is horrible so the acting is horrible.",
                    "label": 0
                },
                {
                    "sent": "That's how you know it's a fan production, but it shows how anyone can do special effects.",
                    "label": 0
                },
                {
                    "sent": "Empire.",
                    "label": 0
                },
                {
                    "sent": "Always useful.",
                    "label": 0
                },
                {
                    "sent": "Troops ready.",
                    "label": 0
                },
                {
                    "sent": "Priority do you have it?",
                    "label": 0
                },
                {
                    "sent": "How did that to you?",
                    "label": 0
                },
                {
                    "sent": "I really don't care what you want very much.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "There we we, we got, we were not loading fast enough to catch up with that.",
                    "label": 0
                },
                {
                    "sent": "Alright, I'm going to show you one more.",
                    "label": 0
                },
                {
                    "sent": "This one is a.",
                    "label": 0
                },
                {
                    "sent": "Is a trailer for a production of the TV show.",
                    "label": 0
                },
                {
                    "sent": "It's a fan fiction version.",
                    "label": 0
                },
                {
                    "sent": "That said, in a in a universe for a television show that was called Firefly, Firefly was a TV show that show it was in America played for about 8 episodes before they killed it, but it was made by the guy who made Buffy the Vampire Slayer.",
                    "label": 0
                },
                {
                    "sent": "Joss Whedon OK, and it's amazing.",
                    "label": 0
                },
                {
                    "sent": "The only made eight 8 episodes of this show.",
                    "label": 0
                },
                {
                    "sent": "But there's an enormous fanfiction industry.",
                    "label": 0
                },
                {
                    "sent": "Or just enormous and there actually could setting up a virtual world version of Firefly.",
                    "label": 0
                },
                {
                    "sent": "The basic thing you need to understand about Firefly is that sorry.",
                    "label": 0
                },
                {
                    "sent": "It's what it is.",
                    "label": 0
                },
                {
                    "sent": "It's like a cowboy, a cowboy show in outer space, right?",
                    "label": 0
                },
                {
                    "sent": "So they have these people flying around from planet to planet and they're actually like.",
                    "label": 0
                },
                {
                    "sent": "Whoops, sorry they're actually rustling cattle.",
                    "label": 0
                },
                {
                    "sent": "She.",
                    "label": 0
                },
                {
                    "sent": "I guess we watched the rest of this first.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "I want to get my slideshow back up.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Alright, here's my here's my cowboy in Outer space trailer.",
                    "label": 0
                },
                {
                    "sent": "For Firefly Urban Outfitters.",
                    "label": 0
                },
                {
                    "sent": "I'm really, really happy to take him back to every kind of music you still find.",
                    "label": 0
                },
                {
                    "sent": "Or no, it's even worse.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "Like I said, the acting is really bad.",
                    "label": 0
                },
                {
                    "sent": "Sound.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Round up.",
                    "label": 0
                },
                {
                    "sent": "Line.",
                    "label": 0
                },
                {
                    "sent": "Down there.",
                    "label": 0
                },
                {
                    "sent": "Here's hoping we can do this.",
                    "label": 0
                },
                {
                    "sent": "Yes, yes.",
                    "label": 0
                },
                {
                    "sent": "I think it's fair to say it didn't appear in the summer of 2007, but.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "I mentioned the Star Wars Phantom added thing.",
                    "label": 0
                },
                {
                    "sent": "This actually did a lot of things.",
                    "label": 0
                },
                {
                    "sent": "First of all, it removed this kind of racially offensive character Jar Jar Binks.",
                    "label": 1
                },
                {
                    "sent": "It re added to it a lot of the discussion between the battle droids.",
                    "label": 0
                },
                {
                    "sent": "I trimmed a lot of the political discussion at illuminated redundant exposition.",
                    "label": 0
                },
                {
                    "sent": "You rearrange shots and scenes to imagine.",
                    "label": 1
                },
                {
                    "sent": "Sorry to match the original trilogy style, and if you remember, if you saw it, there was like little Anakin.",
                    "label": 0
                },
                {
                    "sent": "Anakin Skywalker, who's later going to grow up to be Darth Vader.",
                    "label": 0
                },
                {
                    "sent": "I mean that through to that movie he's always doing, like lots of hippies and wow ease and he's really annoying.",
                    "label": 0
                },
                {
                    "sent": "So they changed a lot of the dialogue to make him a stronger.",
                    "label": 1
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Character too.",
                    "label": 0
                },
                {
                    "sent": "Um well.",
                    "label": 0
                },
                {
                    "sent": "Turns out that you could think of fanfiction is not really being something.",
                    "label": 0
                },
                {
                    "sent": "Altogether new and you know what about this?",
                    "label": 0
                },
                {
                    "sent": "If you go back to 1428, there was a story by John Lidgate called the Siege of Thieves, which actually continued Chaucer's Canterbury Tales, right?",
                    "label": 0
                },
                {
                    "sent": "Well, was that fanfiction or Robert Henryson also had a variation on on a story by Chaucer, which was itself a variant of a Greek myth.",
                    "label": 1
                },
                {
                    "sent": "You know those episodes of fanfiction?",
                    "label": 0
                },
                {
                    "sent": "I I gave this talk at the American Society for Aesthetics and I said, well, you know, really, Shakespeare was just a fanfiction guide to write because I mean his stories were all recycled, of course.",
                    "label": 0
                },
                {
                    "sent": "And then there's some people who think he didn't even do the writing of them.",
                    "label": 0
                },
                {
                    "sent": "He was.",
                    "label": 0
                },
                {
                    "sent": "He was sort of like a fanfiction list, mom, and what he was basically doing was aggregating, running a shop in which people were providing fanfiction stories based on classics.",
                    "label": 0
                },
                {
                    "sent": "Irene",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm neutral on this question.",
                    "label": 0
                },
                {
                    "sent": "Other early fanfiction.",
                    "label": 0
                },
                {
                    "sent": "See one of the things that's true about.",
                    "label": 0
                },
                {
                    "sent": "Fanfiction today is that an enormous percentage of the people doing fanfiction are women.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's like 75% of it is written by women, and there's also a long history of this.",
                    "label": 0
                },
                {
                    "sent": "So if you go back to the 17th century in 1613, Elizabeth Carey.",
                    "label": 0
                },
                {
                    "sent": "Wrote the tragedy of Mariam, which was based on Josephus's story of King Herod's wife.",
                    "label": 1
                },
                {
                    "sent": "Then Lady Mary Roth wrote a piece that was based on Sydney's the Countess of Pembroke's Arcadia.",
                    "label": 0
                },
                {
                    "sent": "1654 Anna we wrote a continuation of this story, and there's also even earlier in 1590, someone found a copy of Arcadia by this woman Lucy Hastings, in which she had like handwritten notes and continuations inside her copy of the book, Right?",
                    "label": 0
                },
                {
                    "sent": "So this is an enterprise that people have been engaged in for a long time.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "Are Interestingly, a lot of it.",
                    "label": 0
                },
                {
                    "sent": "Is sort of correct?",
                    "label": 0
                },
                {
                    "sent": "If what it does is it provides you a perspective on the story from somebody else's perspective.",
                    "label": 0
                },
                {
                    "sent": "One example that people point to is M butterfly, which is based on Madame Butterfly.",
                    "label": 0
                },
                {
                    "sent": "But I think the more salient examples here are the following.",
                    "label": 0
                },
                {
                    "sent": "So Shannon Asselin wrote a piece called Ahab's wife, which is based on Moby Dick.",
                    "label": 0
                },
                {
                    "sent": "But it's told from it's told from the perspective of Captain Ahab's wife, right?",
                    "label": 0
                },
                {
                    "sent": "So imagine what that was like being married to Captain Ahab the then Alice Randall wrote a story called the Wind Done, Gone, which is.",
                    "label": 0
                },
                {
                    "sent": "Which is based on gone with the wind, but it's told from the perspective of Scarlet Slave An then Nancy Rawles had wrote a piece called or book called My Gym which is based on the Huck Finn story only.",
                    "label": 1
                },
                {
                    "sent": "It's told from the perspective of Jim and his wife and you can see how I like powerful it would be to see these stories from these other perspectives, right?",
                    "label": 0
                },
                {
                    "sent": "So there's this kind of tradition going way back, but also in contemporary fiction of people doing this sort of thing.",
                    "label": 0
                },
                {
                    "sent": "Taking that fictional world and sort of looking at it from another perspective or another angle, and that's I think the correct way to think about what fanfiction people are doing right there.",
                    "label": 0
                },
                {
                    "sent": "Providing some alternative perspective at these these.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Stories are into these world, and in fact there's a very important book on fanfiction called textual poachers by Henry Jenkins, who's at MIT and he said fanfiction is a way of the culture repairing the damage done in a system where contemporary myths are owned by kept corporations instead of folk, right?",
                    "label": 1
                },
                {
                    "sent": "Because when the Corporation controls the fiction right then, it's got to basically be.",
                    "label": 0
                },
                {
                    "sent": "Correct from the perspective that Corporation in the audience it's trying to reach and not offend advertisers and so forth, right?",
                    "label": 0
                },
                {
                    "sent": "So then it becomes up to the fans to to sort of have the corrective remedy to this and sort of get out what this take the story where May.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It should have gone.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "Let's go back to Louis is story about truth and fiction and think about.",
                    "label": 0
                },
                {
                    "sent": "How limited that looks when we consider it from the perspective.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Fanfiction.",
                    "label": 0
                },
                {
                    "sent": "Here's what we would actually need if we wanted a story about fanfiction that really made sense here.",
                    "label": 0
                },
                {
                    "sent": "First of all we need is a way of critiquing Canonical fiction for flouting norms and getting real life facts wrong.",
                    "label": 1
                },
                {
                    "sent": "I mean, this takes this back to the case of.",
                    "label": 0
                },
                {
                    "sent": "Of.",
                    "label": 0
                },
                {
                    "sent": "Sherlock Holmes, right where Conan Doyle wrote that you know the snake was climbing the rope, but that kind of snake can't climb a rope.",
                    "label": 0
                },
                {
                    "sent": "Or what about other kinds of facts that people get wrong?",
                    "label": 0
                },
                {
                    "sent": "Right in fictional works, but we want a way of being able to critique these fictions.",
                    "label": 0
                },
                {
                    "sent": "But we also want to have a way of critiquing them when they happen.",
                    "label": 0
                },
                {
                    "sent": "They put in a racially offensive character, like Jar Jar Binks as well.",
                    "label": 0
                },
                {
                    "sent": "Secondly, we want to make sense of the idea that you could improve on Canonical fiction by extensions and repair.",
                    "label": 1
                },
                {
                    "sent": "So in a certain sense, if these if these fans are fleshing out what happened between episode 3 and Episode 4 of Star Wars, I mean that's a contribution and we want to make sense of that, but we want to be able to say that what they did is true, or that it added to that that fictional universe.",
                    "label": 0
                },
                {
                    "sent": "We want to develop alternative narratives that explore alternative points of view and latent subtext, so ideally, you know, we want to be able to say that in a certain genre of fanfiction, where Kirk and Spock are lovers, for example, or where Harry Potter and Snape are lovers, we want to have some way of saying, well, in the fiction, it's true that Harry and Snape are lovers.",
                    "label": 0
                },
                {
                    "sent": "But but we gotta come up with some way of making sense of that idea, that in the narrative, right, that could be right.",
                    "label": 0
                },
                {
                    "sent": "We want to still have a way of critiquing fanfiction.",
                    "label": 0
                },
                {
                    "sent": "First of all, if you write something a piece of fanfiction right and you post it to the board, people will critique you, right?",
                    "label": 0
                },
                {
                    "sent": "It's not like anything goes.",
                    "label": 0
                },
                {
                    "sent": "It will say this is bad, this is wrong, etc.",
                    "label": 0
                },
                {
                    "sent": "So even if you've left the Canon behind and you're.",
                    "label": 0
                },
                {
                    "sent": "100 miles away from Canonical fanfiction and you have, you know, Harry and Snape are like doing it somewhere, right?",
                    "label": 0
                },
                {
                    "sent": "There's still going to be critique.",
                    "label": 0
                },
                {
                    "sent": "Possible, right?",
                    "label": 0
                },
                {
                    "sent": "Is the discussion honest?",
                    "label": 0
                },
                {
                    "sent": "We want at the same time to provide Canon based critiques of fanfiction, right?",
                    "label": 0
                },
                {
                    "sent": "So even if someone is writing the work of fanfiction.",
                    "label": 0
                },
                {
                    "sent": "I don't mean necessarily the Robin Hobb Virgin right, but maybe something like it.",
                    "label": 0
                },
                {
                    "sent": "You would want someone to be able to say, well, this fanfiction guy took it to the wrong way because Harry would never do this or Harry would never say this.",
                    "label": 0
                },
                {
                    "sent": "And finally we want to be able to do the whole thing without any kind of contradiction.",
                    "label": 0
                },
                {
                    "sent": "We want it to be coherent.",
                    "label": 0
                },
                {
                    "sent": "Are they?",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That sounds impossible.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But This is why.",
                    "label": 0
                },
                {
                    "sent": "We get the big Bucks philosophy, so let me give you a prelude to an analysis here.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "Where I'm going to go with this is going to assume a notion of normative grounding for a work of fiction F. So let's provide a definition.",
                    "label": 0
                },
                {
                    "sent": "I'll say that for any fanfiction F worlds that provide normative grounding, forever are those worlds consistent with the norms established by the relevant community of fanfic readers?",
                    "label": 1
                },
                {
                    "sent": "Given expectations established for FK, so there are different kinds of norms that you can establish.",
                    "label": 0
                },
                {
                    "sent": "So if I if I label my story as flat slash fanfiction, that establishes certain expectations, and it's also going to set me up for probably respecting certain norms, or it's going to give, it's going to give the reader's expectations about the kinds of norms that's guiding my writing here.",
                    "label": 1
                },
                {
                    "sent": "Now the possible norms are going to include things like physical laws, logical laws, biological laws, social norms, ethical norms, norms of character, etc.",
                    "label": 0
                },
                {
                    "sent": "That is.",
                    "label": 0
                },
                {
                    "sent": "If I write a story.",
                    "label": 0
                },
                {
                    "sent": "That's.",
                    "label": 0
                },
                {
                    "sent": "I can say I'm Sherlock Holmes, right?",
                    "label": 0
                },
                {
                    "sent": "I don't or I'm Conan Doyle writing a Sherlock Holmes story.",
                    "label": 0
                },
                {
                    "sent": "I have my characters in there.",
                    "label": 0
                },
                {
                    "sent": "Very interesting characters, but I think that for the most part, what I want the stories to do is to obey existing physical laws.",
                    "label": 0
                },
                {
                    "sent": "A distinct existing logical laws.",
                    "label": 0
                },
                {
                    "sent": "Certainly existing biological laws, etc.",
                    "label": 0
                },
                {
                    "sent": "And so Lewis is not right in thinking that what we're interested in here is just the general beliefs of the community, right?",
                    "label": 0
                },
                {
                    "sent": "Because it's not like Conan Doyle is writing just for the community of whatever 19th century England, right?",
                    "label": 0
                },
                {
                    "sent": "But what what he's really after here is telling us that look, I'm telling you some stuff about this character.",
                    "label": 0
                },
                {
                    "sent": "Sherlock Holmes, who lives in London and everything else is, is as it should be, in effect.",
                    "label": 0
                },
                {
                    "sent": "So for example.",
                    "label": 0
                },
                {
                    "sent": "I'm assuming that the standard physical laws hold.",
                    "label": 0
                },
                {
                    "sent": "I'm assuming that the standard logical laws hold.",
                    "label": 0
                },
                {
                    "sent": "I'm assuming the standard.",
                    "label": 0
                },
                {
                    "sent": "Biological laws hold, etc and we have some play with this.",
                    "label": 0
                },
                {
                    "sent": "In the case of Sherlock Holmes and Conan Doyle, basically all of those things held.",
                    "label": 0
                },
                {
                    "sent": "But if you write a certain scientific story, you might you might have different laws or different physical laws, so you might relax or.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Change some of those norms.",
                    "label": 0
                },
                {
                    "sent": "So here's analysis three, and if I guess I should give a nicer name to it, then analysis 3.",
                    "label": 0
                },
                {
                    "sent": "So I guess I guess what I would call it is the norm, consistency or the salient norm theory of truth and fiction, because we're going to raise certain norms to salient.",
                    "label": 0
                },
                {
                    "sent": "And those are the things that are going to sort of flesh out the rest of the story, right?",
                    "label": 0
                },
                {
                    "sent": "So remember in all these cases, there was what the author literally said.",
                    "label": 0
                },
                {
                    "sent": "How do you flush it out?",
                    "label": 0
                },
                {
                    "sent": "Is it everything that's true in the real world?",
                    "label": 0
                },
                {
                    "sent": "Well, that doesn't seem right.",
                    "label": 0
                },
                {
                    "sent": "Is it what my audience believes?",
                    "label": 0
                },
                {
                    "sent": "That doesn't seem right, and what I'm suggesting is that what what these people do is they raise certain norms to salients and then those norms are going to sort of provide the material.",
                    "label": 0
                },
                {
                    "sent": "The raw material for fleshing out the additional stuff that's going to make it true in the fiction, and so technically, here's how it goes.",
                    "label": 0
                },
                {
                    "sent": "Some proposition fires true in a fanfiction F if either.",
                    "label": 0
                },
                {
                    "sent": "Find the sort of thing you would expect to hold, given a sincere telling of the story F or it's the sort of thing you would expect to hold given a sincere telling of F in a set of worlds W prime related to W by permissible extension.",
                    "label": 1
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, what's a permissible extension?",
                    "label": 0
                },
                {
                    "sent": "Well, suppose Phi isn't the sort of thing you would expect to set holding a set of worlds that are Canonical for F. Let let let me just be very careful here, right?",
                    "label": 1
                },
                {
                    "sent": "So what time is?",
                    "label": 0
                },
                {
                    "sent": "Let's imagine, let's imagine I I completely agree with this part.",
                    "label": 0
                },
                {
                    "sent": "So the let's imagine that I'm writing a story and I'm writing it and posting it to a fanfiction board.",
                    "label": 0
                },
                {
                    "sent": "There are certain norms that are respected on that board.",
                    "label": 0
                },
                {
                    "sent": "OK Anne, I'm either in accord with that or not, but so something could be true, right?",
                    "label": 0
                },
                {
                    "sent": "If I if I sort of flesh out some story and then the norms of that community fill in the details.",
                    "label": 0
                },
                {
                    "sent": "But sometimes I want to go and push the boundaries right?",
                    "label": 0
                },
                {
                    "sent": "I want to go further, annex and sort of say I'm going to relax some norms here.",
                    "label": 0
                },
                {
                    "sent": "I'm going to do something crazy right?",
                    "label": 0
                },
                {
                    "sent": "So when am I permitted to do that?",
                    "label": 0
                },
                {
                    "sent": "And that's what I mean by a permissible extension, so it should be the sort of thing you would expect to hold in a set of worlds W prime that differ from W with respect to some manageable number of identifiable norms.",
                    "label": 1
                },
                {
                    "sent": "So let's suppose that my fanfiction community has.",
                    "label": 0
                },
                {
                    "sent": "Some very clear norms established, and let's suppose we could number them, you know, respect certain physical laws.",
                    "label": 0
                },
                {
                    "sent": "The biological laws allow certain kinds of weird symbiotic creatures.",
                    "label": 0
                },
                {
                    "sent": "That's fine.",
                    "label": 0
                },
                {
                    "sent": "Social norms are like different because it's a different social world.",
                    "label": 0
                },
                {
                    "sent": "And then I want to sort of try something new.",
                    "label": 0
                },
                {
                    "sent": "When am I permitted?",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Do something like that and what I've suggested there is that you kind of have to hold as much as constant as possible and but you can still push the envelope right?",
                    "label": 0
                },
                {
                    "sent": "If you're clear, or at least not deceptive about the norms being played with, right?",
                    "label": 1
                },
                {
                    "sent": "So if I'm going to extend, you know, change the biology of this world somehow, then I at least have to be clear about that, right?",
                    "label": 0
                },
                {
                    "sent": "You offer some sort of explanation for why this is different.",
                    "label": 0
                },
                {
                    "sent": "You can see this in if you know a TV show like Buffy the Vampire Slayer.",
                    "label": 0
                },
                {
                    "sent": "There's all this background about how things are supposed to be with vampires, but sometimes they diverge from the usual vampire stories.",
                    "label": 0
                },
                {
                    "sent": "So then someone goes well, I thought vampires were like this and they go.",
                    "label": 0
                },
                {
                    "sent": "No, no, it's not like that at all and they go into a like a long story about how the usual stuff about vampires is wrong.",
                    "label": 0
                },
                {
                    "sent": "So you have to Telegraph when and why you're violating one of these norms.",
                    "label": 0
                },
                {
                    "sent": "Alright, well what?",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The kind of resulting picture here.",
                    "label": 0
                },
                {
                    "sent": "And how is it that we can sort of have exchange of sort of discussion between people involved in a fanfiction community and people involved in the Canonical community?",
                    "label": 0
                },
                {
                    "sent": "The basic idea is that if you think about a Canonical fiction, they're often certain norms that are established right, and likewise there are actual world norms.",
                    "label": 0
                },
                {
                    "sent": "These are the actual physical laws, biological laws, and social norms that we recognize.",
                    "label": 0
                },
                {
                    "sent": "Fanfiction.",
                    "label": 0
                },
                {
                    "sent": "R. Sort of extend the boundaries or provide this like a new set of norms to deal with that people introduce.",
                    "label": 0
                },
                {
                    "sent": "Sometimes you get overlap with the actual world.",
                    "label": 0
                },
                {
                    "sent": "Sometimes you get overlap with norm systems from standard Canonical fiction worlds.",
                    "label": 0
                },
                {
                    "sent": "And sometimes all three of them overlap, so there are these points of intersection, and I think you probably get that with something like a Sherlock Holmes story, or probably with most most Shakespeare stories.",
                    "label": 0
                },
                {
                    "sent": "I think where there's a kind of intersection between actual world norms and the norms of that Canonical fiction.",
                    "label": 0
                },
                {
                    "sent": "An if we write a piece of fanfiction about it, we might also say we're going to respect those norms to write.",
                    "label": 0
                },
                {
                    "sent": "That is, if I were going to write some some.",
                    "label": 0
                },
                {
                    "sent": "Fan fiction based on Romeo and Juliet telling.",
                    "label": 0
                },
                {
                    "sent": "About the other capital, it's right or the other Montague's.",
                    "label": 0
                },
                {
                    "sent": "I might respect all of these norms, and if I don't, right if I'm going to sort of push the boundaries then then I mean I have to Telegraph that somehow.",
                    "label": 0
                },
                {
                    "sent": "So if it's the the Capulets and Montague's in outer.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Space or something?",
                    "label": 0
                },
                {
                    "sent": "So how what?",
                    "label": 0
                },
                {
                    "sent": "What is this by all of us?",
                    "label": 0
                },
                {
                    "sent": "I mean in the homes and Snake case, what's happening is that that thing is the problem with that, that that.",
                    "label": 0
                },
                {
                    "sent": "That mistake in there is that it flouts the norm in the homes Canon, which is respect for real world physical laws, and I think that Conan Doyle was very rigorous about this.",
                    "label": 0
                },
                {
                    "sent": "So when he violates that norm, we say look he made a mistake.",
                    "label": 0
                },
                {
                    "sent": "It calls for correction in the Jar Jar Binks case in The Phantom Menace.",
                    "label": 1
                },
                {
                    "sent": "What we're doing is we're flouting norms in the Star Wars Canon, which is respect certain real world social norms.",
                    "label": 1
                },
                {
                    "sent": "Certainly don't.",
                    "label": 0
                },
                {
                    "sent": "Don't be a racist idiot.",
                    "label": 0
                },
                {
                    "sent": "In M Craig fiction, right?",
                    "label": 0
                },
                {
                    "sent": "Suppose we had a piece of fiction which Harry Potter gets pregnant.",
                    "label": 0
                },
                {
                    "sent": "This happens or in which Draco gets pregnant.",
                    "label": 1
                },
                {
                    "sent": "Well, there were supposed to expect respect norms related to social, logical aspects of pregnancy.",
                    "label": 0
                },
                {
                    "sent": "I don't have it with me, but I have a little passage from.",
                    "label": 0
                },
                {
                    "sent": "A live Journal.",
                    "label": 0
                },
                {
                    "sent": "Our entry that was written by this person who kind of role plays as.",
                    "label": 0
                },
                {
                    "sent": "Draco, after he's been made pregnant by Harry Potter.",
                    "label": 0
                },
                {
                    "sent": "OK, so so he keeps.",
                    "label": 0
                },
                {
                    "sent": "So there's a person who keeps a daily Journal write every day he gets up and writes ya'll in the voice of Draco.",
                    "label": 0
                },
                {
                    "sent": "And then it's like really sad because I'm sitting around I got up I threw up this morning I'm really bored I don't know what to do with myself and so it's really a story about being pregnant and being abandoned.",
                    "label": 0
                },
                {
                    "sent": "Well I you know Harry's off like doing all this great wizard stuff.",
                    "label": 0
                },
                {
                    "sent": "And Draco, Draco, Draco is sitting in the sitting in his like dorm room like you know, with morning sickness.",
                    "label": 0
                },
                {
                    "sent": "OK, well, I mean it in a certain sense.",
                    "label": 0
                },
                {
                    "sent": "That's even though it's like magical and weird and freaky and a little bit scary.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's still respecting certain norms.",
                    "label": 0
                },
                {
                    "sent": "So like you might say, if like Drake was right.",
                    "label": 0
                },
                {
                    "sent": "Oh wow, being pregnant is the funnest thing I ever did I mean, you might say that that's flouting certain kinds of norms.",
                    "label": 1
                },
                {
                    "sent": "And then their cross community critiques are made possible.",
                    "label": 0
                },
                {
                    "sent": "Right by points of overlap.",
                    "label": 0
                },
                {
                    "sent": "So in these in these cases where we do have points of overlap right, we can say, well, look, you're supposed to be respecting these these law norms of certain physical laws.",
                    "label": 0
                },
                {
                    "sent": "You're violating it here, and it doesn't matter if that critique is coming from the Canonical Canonical fiction perspective or the fan fiction perspective.",
                    "label": 0
                },
                {
                    "sent": "Everyone kind of has a voice in this critique because they can say these are the norms years you've said, or the norms that are salient here.",
                    "label": 0
                },
                {
                    "sent": "And you seem to be violating those, so the way you're writing this fiction is like you've made a mistake here somewhere.",
                    "label": 0
                },
                {
                    "sent": "That is not consistent with the fictional world you're developing, even though it's a even though it's a fanfiction.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Story now I want to consider a complication at this point, which is what I would call automated fanfiction.",
                    "label": 0
                },
                {
                    "sent": "One of the things that people have done is use virtual worlds and video games like The Sims on line for example to produce works of fiction or reproduce works of fiction.",
                    "label": 0
                },
                {
                    "sent": "So there's an entire episode of.",
                    "label": 0
                },
                {
                    "sent": "There's an entire episode of Harry Potter story that's been produced in The Sims on line, right?",
                    "label": 0
                },
                {
                    "sent": "Which is sort of amazing, right?",
                    "label": 0
                },
                {
                    "sent": "Because?",
                    "label": 0
                },
                {
                    "sent": "Because what you're in effect doing is getting these little Sims that are kind of automated and you can't really control everything they do right there.",
                    "label": 0
                },
                {
                    "sent": "These little video game characters and so so like you know, some Snape will be up there teaching and all of a sudden for no no apparent reason, he'll dance a jig or something like that, right?",
                    "label": 0
                },
                {
                    "sent": "And so the person who made this actually also made a series of bloopers and outtakes, right?",
                    "label": 0
                },
                {
                    "sent": "Because you have to edit out the crazy stuff you can't control.",
                    "label": 0
                },
                {
                    "sent": "But here is the sort of puzzle about it.",
                    "label": 0
                },
                {
                    "sent": "Suppose.",
                    "label": 0
                },
                {
                    "sent": "Suppose I do make this.",
                    "label": 0
                },
                {
                    "sent": "I want to use.",
                    "label": 0
                },
                {
                    "sent": "I want to use a video game to create a work of fiction and something random happens in it.",
                    "label": 0
                },
                {
                    "sent": "Write something that I didn't anticipate or control.",
                    "label": 0
                },
                {
                    "sent": "Does that make it into part of the fiction as well?",
                    "label": 0
                },
                {
                    "sent": "I just wanted to give a couple examples here.",
                    "label": 0
                },
                {
                    "sent": "Some impreg fanfiction.",
                    "label": 0
                },
                {
                    "sent": "I guess they're both impreg fanfiction, just just so you can see.",
                    "label": 0
                },
                {
                    "sent": "The first one, involves Jack Sparrow from from.",
                    "label": 0
                },
                {
                    "sent": "Pirates of the Caribbean thanks.",
                    "label": 0
                },
                {
                    "sent": "All it really is is just him having the baby but.",
                    "label": 0
                },
                {
                    "sent": "I can't resist it.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Well that was disturbing.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "Let's start.",
                    "label": 0
                },
                {
                    "sent": "Here's this now.",
                    "label": 0
                },
                {
                    "sent": "This involves Harry Potter and Snape OK.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Would you?",
                    "label": 0
                },
                {
                    "sent": "I'm going to speed this up a little.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "Let's play star Chinese.",
                    "label": 0
                },
                {
                    "sent": "Alright here, oh here, it will just go there is pregnant now.",
                    "label": 0
                },
                {
                    "sent": "Would you love me?",
                    "label": 0
                },
                {
                    "sent": "Just talk about the world?",
                    "label": 0
                },
                {
                    "sent": "Hi, you're never gonna listen to that song the same way again.",
                    "label": 0
                },
                {
                    "sent": "Alright, well.",
                    "label": 0
                },
                {
                    "sent": "Is there?",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Anything we can say about?",
                    "label": 0
                },
                {
                    "sent": "Well, here's another complication.",
                    "label": 0
                },
                {
                    "sent": "This is actually very interesting.",
                    "label": 0
                },
                {
                    "sent": "There's like kind of fanfiction role play, so I showed you the video from Firefly.",
                    "label": 0
                },
                {
                    "sent": "Those Cowboys in outer space thing.",
                    "label": 0
                },
                {
                    "sent": "In The Sims on line, which is a virtual world that I hang out there, a number of islands there that are dedicated to people that just role play.",
                    "label": 0
                },
                {
                    "sent": "Inside that Firefly universe, right?",
                    "label": 0
                },
                {
                    "sent": "There are also regions inside Second Life where people role play in the Harry Potter universe as well.",
                    "label": 0
                },
                {
                    "sent": "There are these gorion islands.",
                    "label": 0
                },
                {
                    "sent": "Should explain this.",
                    "label": 0
                },
                {
                    "sent": "There are these really bad science fiction novels written by this guy named John Norman, and they're about this.",
                    "label": 0
                },
                {
                    "sent": "Planet where there are this.",
                    "label": 0
                },
                {
                    "sent": "Race of slaves and Masters where they're basically sexual slaves, right, and?",
                    "label": 0
                },
                {
                    "sent": "And so they're like many islands in Second life where people role play inside this gorean universe as sexual slaves.",
                    "label": 0
                },
                {
                    "sent": "So right Wizards Alley is the place in Second Life.",
                    "label": 0
                },
                {
                    "sent": "There's a version of Gotham City inside Second Life, and there's also the Justice League Unlimited.",
                    "label": 1
                },
                {
                    "sent": "There people that actually run around in like capes and tights and so forth and and fight evil inside Second life.",
                    "label": 0
                },
                {
                    "sent": "So what's going on in there, right?",
                    "label": 0
                },
                {
                    "sent": "So when people are role playing like that, is it just play or is it?",
                    "label": 0
                },
                {
                    "sent": "Are they actually constructing little narrative's, right?",
                    "label": 0
                },
                {
                    "sent": "I mean, that is an interesting question there.",
                    "label": 0
                },
                {
                    "sent": "So if they get into a discussion there with some evil character.",
                    "label": 0
                },
                {
                    "sent": "I mean.",
                    "label": 0
                },
                {
                    "sent": "They're often typing in character, right?",
                    "label": 0
                },
                {
                    "sent": "They're typing in the character of Harry or someone in that universe, right?",
                    "label": 0
                },
                {
                    "sent": "Are they actually working out?",
                    "label": 0
                },
                {
                    "sent": "That fictional world?",
                    "label": 0
                },
                {
                    "sent": "Or are they just doing something else altogether?",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The question is, can we extend the analysis?",
                    "label": 0
                },
                {
                    "sent": "The analysis about norms to handle narratives outside of authorial intention, that is, The Sims kind of have minds of their own.",
                    "label": 1
                },
                {
                    "sent": "You can't really predict when they're going to like.",
                    "label": 0
                },
                {
                    "sent": "Have a thought about Snape, right?",
                    "label": 0
                },
                {
                    "sent": "I mean, that's random.",
                    "label": 0
                },
                {
                    "sent": "You can't predict exactly.",
                    "label": 0
                },
                {
                    "sent": "You know when Harry is going to start throwing up, right?",
                    "label": 0
                },
                {
                    "sent": "You can't predict exactly when the baby is going to come or how they're going to react.",
                    "label": 0
                },
                {
                    "sent": "So these aspects of the narrative.",
                    "label": 0
                },
                {
                    "sent": "They're outside the authorial intention.",
                    "label": 1
                },
                {
                    "sent": "One thing you could do is to incorporate a notion of truth in role play, right?",
                    "label": 0
                },
                {
                    "sent": "So you could say, well, you're not.",
                    "label": 0
                },
                {
                    "sent": "That's no way to play inside the Harry Potter universe.",
                    "label": 0
                },
                {
                    "sent": "You shouldn't be.",
                    "label": 1
                },
                {
                    "sent": "You shouldn't be playing that way.",
                    "label": 0
                },
                {
                    "sent": "So the possible answer then is you extend the fiction F beyond tellings and aeration to include automated fanfiction and role play.",
                    "label": 0
                },
                {
                    "sent": "And then you have to, you know, do lots of tweaks and so forth.",
                    "label": 0
                },
                {
                    "sent": "And and be careful about how you set that up.",
                    "label": 0
                },
                {
                    "sent": "But I think.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is possible to do something like that?",
                    "label": 0
                },
                {
                    "sent": "Finally, I want to close on this one.",
                    "label": 0
                },
                {
                    "sent": "You all have seen.",
                    "label": 0
                },
                {
                    "sent": "Maybe the movie Mary Poppins at some time, so you know about Mary Poppins, this magical nanny that's played by Julie Andrews and comes and takes care of these kids.",
                    "label": 0
                },
                {
                    "sent": "Anne, it's a Disney movie, so it's all very happy and cheerful and so forth.",
                    "label": 0
                },
                {
                    "sent": "But here's an example of how someone took something and re edited it right, and what they're going to do is re edit it to sort of show a certain subtext to the story, which is if you think about it.",
                    "label": 0
                },
                {
                    "sent": "Mary Poppins is very scary because she's just like Nanny that has these weird magical powers, right?",
                    "label": 1
                },
                {
                    "sent": "So here's a re edit.",
                    "label": 0
                },
                {
                    "sent": "It's called scary Mary.",
                    "label": 0
                },
                {
                    "sent": "I hope it's still on line here.",
                    "label": 0
                },
                {
                    "sent": "Anyway.",
                    "label": 0
                },
                {
                    "sent": "I I I like closing on that one, but you get the idea that they mean so.",
                    "label": 0
                },
                {
                    "sent": "There's some very powerful things you can do with re editing.",
                    "label": 0
                },
                {
                    "sent": "Just re editing stuff and all of those were clips from this kind of very happy Disney movie, but it's also revealing of some sort of subtext.",
                    "label": 0
                },
                {
                    "sent": "And one thing you might want to do eventually is sort of take the analysis and figure if you know you could extend it to an ocean of truth in parity or something like that.",
                    "label": 0
                },
                {
                    "sent": "Anyway, that's all I've got on this stuff.",
                    "label": 0
                },
                {
                    "sent": "Are there any?",
                    "label": 0
                },
                {
                    "sent": "Are there any questions or anything?",
                    "label": 0
                },
                {
                    "sent": "Do you now know more about fanfiction than you ever wanted to?",
                    "label": 0
                },
                {
                    "sent": "You'll probably die.",
                    "label": 0
                },
                {
                    "sent": "Mir will probably go home and like start making little fan fan fiction movies of his own now.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "Usually not, because with the I mean there's an interesting question about what.",
                    "label": 0
                },
                {
                    "sent": "When is something fanfiction and when is it just.",
                    "label": 0
                },
                {
                    "sent": "One thing that makes it fanfiction is that you don't own the property, so usually a remake of the movie somebody gets permission to remake it and so they have a kind of legal authority to do it.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "People were, I mean that raises a question about.",
                    "label": 0
                },
                {
                    "sent": "Shakespeare, for example, right.",
                    "label": 0
                },
                {
                    "sent": "If I remake.",
                    "label": 0
                },
                {
                    "sent": "A Shakespeare story.",
                    "label": 0
                },
                {
                    "sent": "Nobody owns that property anymore, right?",
                    "label": 0
                },
                {
                    "sent": "So is it really the case that each?",
                    "label": 0
                },
                {
                    "sent": "Each retelling of it is is.",
                    "label": 0
                },
                {
                    "sent": "Is now a piece of fanfiction.",
                    "label": 0
                },
                {
                    "sent": "Now I mean, it's possible that there really isn't an interesting difference between fanfiction, an just some sort of extension of it and Dairy Dyer.",
                    "label": 0
                },
                {
                    "sent": "Somebody had a term for it, which he called arc Arc Onyx fiction, which means it's like your building this giant archive, right?",
                    "label": 0
                },
                {
                    "sent": "And so fanfiction and remakes of movies and serial fiction.",
                    "label": 0
                },
                {
                    "sent": "They all get lumped together as building an archive of the Shakespeare world, or the Harry Potter world, and so forth.",
                    "label": 0
                },
                {
                    "sent": "And then fanfiction is at that point, not really special.",
                    "label": 0
                },
                {
                    "sent": "It's just one example of this stuff that we've seen for thousands of years.",
                    "label": 0
                },
                {
                    "sent": "And I have no problem with that.",
                    "label": 0
                },
                {
                    "sent": "I think any theory.",
                    "label": 0
                },
                {
                    "sent": "Any theory that sort of came up with the notion of truth and fiction would probably be indifferent to whether it's fanfiction or something else.",
                    "label": 0
                },
                {
                    "sent": "Shakespeare.",
                    "label": 0
                },
                {
                    "sent": "As it is.",
                    "label": 0
                },
                {
                    "sent": "Or think of have you ever seen Rosencrantz and Guildenstern are dead?",
                    "label": 0
                },
                {
                    "sent": "So right so there are these two guys that just.",
                    "label": 0
                },
                {
                    "sent": "I mean, they're in the shaker.",
                    "label": 0
                },
                {
                    "sent": "Just these messengers and they like there.",
                    "label": 0
                },
                {
                    "sent": "They are in the.",
                    "label": 0
                },
                {
                    "sent": "The Shakespeare play for like 1 scene for like 2 minutes and then there's a whole movie about these guys delivering the message right.",
                    "label": 0
                },
                {
                    "sent": "And so I mean, we don't think of that as fanfiction because it was produced by a major studio etc.",
                    "label": 0
                },
                {
                    "sent": "So maybe, maybe maybe the real thing is, it's fanfiction if it's like.",
                    "label": 0
                },
                {
                    "sent": "People that aren't professionals that are doing it kind of for love of the.",
                    "label": 0
                },
                {
                    "sent": "Love of the.",
                    "label": 0
                },
                {
                    "sent": "Whatever, right.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "But there's a question.",
                    "label": 0
                },
                {
                    "sent": "You know what happens if it gets too good and like some someone buys it, right?",
                    "label": 0
                },
                {
                    "sent": "Like like some of this, this Star Wars the Star Wars movies that people make well.",
                    "label": 0
                },
                {
                    "sent": "What if George Lucas bought it from them, right?",
                    "label": 0
                },
                {
                    "sent": "Would it no longer be fanfiction in that case?",
                    "label": 0
                },
                {
                    "sent": "But what I think what's interesting is that, like.",
                    "label": 0
                },
                {
                    "sent": "The stuff that gets called fanfiction.",
                    "label": 0
                },
                {
                    "sent": "It's normally stuff that's on the margins and it's people that ordinarily don't have access to.",
                    "label": 0
                },
                {
                    "sent": "The production and distribution of artistic works, right?",
                    "label": 0
                },
                {
                    "sent": "And that's probably the main sort of indicator of whether it's fanfiction or not.",
                    "label": 0
                },
                {
                    "sent": "And it also provides the body of work that's in some ways the strangest and creates the most puzzles and challenges for any sort of analysis of.",
                    "label": 0
                },
                {
                    "sent": "Any sort of analysis of fiction?",
                    "label": 0
                },
                {
                    "sent": "But you know, I don't know you think about all these.",
                    "label": 0
                },
                {
                    "sent": "All the all, I guess it was the French that did all these.",
                    "label": 0
                },
                {
                    "sent": "Stories about King Arthur and so forth, and the Knights of the Round Table.",
                    "label": 0
                },
                {
                    "sent": "I mean, that seemed to be a case where it was just people just kept extending that world with story after story.",
                    "label": 0
                },
                {
                    "sent": "And it continues to this day, although it's often like large corporations and not bodies.",
                    "label": 0
                },
                {
                    "sent": "If I'm unpaid people that are doing it.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Well, no, I'm sure it's fun and I'm sure it's also that there's a sense of community.",
                    "label": 0
                },
                {
                    "sent": "Right, but I think it's also a way of embedding yourself into that world that is.",
                    "label": 0
                },
                {
                    "sent": "In writing it, it's a bit like role playing, and you know when when that person is keeping the Journal, for example about.",
                    "label": 0
                },
                {
                    "sent": "Draco being pregnant, right?",
                    "label": 0
                },
                {
                    "sent": "You're producing a work of fiction, but also this person is sort of inserting themselves into the fiction.",
                    "label": 0
                },
                {
                    "sent": "And in the cases of Mary Sue Mary Stu fanfiction, this is obvious, right?",
                    "label": 0
                },
                {
                    "sent": "Because they write themselves in as a character.",
                    "label": 0
                },
                {
                    "sent": "But probably in writing something it's a way of immersing yourself into a certain world.",
                    "label": 0
                },
                {
                    "sent": "And exploring aspects of that world.",
                    "label": 0
                },
                {
                    "sent": "So I don't find it all surprising that people that like to write fanfiction would also like these spaces in Second life.",
                    "label": 0
                },
                {
                    "sent": "For example, where they can go in and actually role play in that world.",
                    "label": 0
                },
                {
                    "sent": "Like the line.",
                    "label": 0
                },
                {
                    "sent": "At work.",
                    "label": 0
                },
                {
                    "sent": "Create.",
                    "label": 0
                },
                {
                    "sent": "Well, that's I mean, you could ask that about anybody who writes anything, right?",
                    "label": 0
                },
                {
                    "sent": "I mean, it's also entirely possible that these you know, here are people that are well grounded.",
                    "label": 0
                },
                {
                    "sent": "And then they see an error in this fiction and there at least in a position that secure enough and confident enough to say that this stands for correction.",
                    "label": 0
                },
                {
                    "sent": "So typically.",
                    "label": 0
                },
                {
                    "sent": "This is actually.",
                    "label": 0
                },
                {
                    "sent": "This is something that.",
                    "label": 0
                },
                {
                    "sent": "Gets talked about in that book textual poachers, which is that we usually ridicule people that do fanfiction and say, oh, they're losers.",
                    "label": 0
                },
                {
                    "sent": "They don't have lives, etc.",
                    "label": 0
                },
                {
                    "sent": "But the sort of peculiar thing is that you know, we ridicule these people because they're like writing corrective fiction and doing something.",
                    "label": 0
                },
                {
                    "sent": "But if someone comes home and sits in front of the TV and does nothing but just absorb what it throws at them, that's fine, right?",
                    "label": 0
                },
                {
                    "sent": "And Henry Jenkins suggests that you know part of what's going on there is that we're like a in a way of afraid or threatened by the idea that these people are sort of taking the storytelling's into their own hands instead of letting the Disney Corporation.",
                    "label": 0
                },
                {
                    "sent": "Do the storytelling for us, right?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "You know you we ask questions like, well, do these people do it because they're unsatisfied with their lives, but you know, I've never heard anyone ask?",
                    "label": 0
                },
                {
                    "sent": "Well, did Walt Disney start writing cartoons because he was unsatisfied with his own life?",
                    "label": 0
                },
                {
                    "sent": "You know it's an.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's very interesting.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's interesting that kind of ridicule, that sort of comes in the direction of people that work on fanfiction.",
                    "label": 0
                },
                {
                    "sent": "Anne and I think it's in part the fact that they're sort of challenging these institutions that control the production of art and control like production of cultural products to China.",
                    "label": 0
                },
                {
                    "sent": "I don't know if it seems like these people are waiting, wishing you seriously because after all, it's just fiction.",
                    "label": 0
                },
                {
                    "sent": "I mean, I don't know that Jerry comes forward with Viber.",
                    "label": 0
                },
                {
                    "sent": "I happen to see that every node and I never notice there was a problem with the Viking.",
                    "label": 0
                },
                {
                    "sent": "Oh, it was like one of the best stories, right?",
                    "label": 0
                },
                {
                    "sent": "Yeah yeah, yeah.",
                    "label": 0
                },
                {
                    "sent": "Cares, right?",
                    "label": 0
                },
                {
                    "sent": "I mean the reader.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Regulation.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "Serious.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but we all take what we do seriously.",
                    "label": 0
                },
                {
                    "sent": "I mean, some people think that like.",
                    "label": 0
                },
                {
                    "sent": "Stress and morphology in Slovenian is interesting too.",
                    "label": 0
                },
                {
                    "sent": "But but what?",
                    "label": 0
                },
                {
                    "sent": "But in point of fact, like works of fiction and cultural products, they're like very, very important to people, right?",
                    "label": 0
                },
                {
                    "sent": "And what what these people are doing is in effect offering correctives or alternative pictures, right?",
                    "label": 0
                },
                {
                    "sent": "So what a work of fiction can do is can.",
                    "label": 0
                },
                {
                    "sent": "It can sort of reinforce certain attitudes and norms which are not necessarily healthy, right?",
                    "label": 0
                },
                {
                    "sent": "And I mean when somebody comes and says, well, I'm going to give you, I'm going to give you the.",
                    "label": 0
                },
                {
                    "sent": "Gone with the wind story, but from the perspective of the slave, right?",
                    "label": 0
                },
                {
                    "sent": "Of course there's a gun with the wind stories.",
                    "label": 0
                },
                {
                    "sent": "No, it's no no.",
                    "label": 0
                },
                {
                    "sent": "You see, you've been brainwashed.",
                    "label": 0
                },
                {
                    "sent": "This is why it's important that these people do this because you are one of these people that think there's only the one fiction and it's the one that that what's the name of the woman who wrote, gone with the Wind, Martha?",
                    "label": 0
                },
                {
                    "sent": "What's your name?",
                    "label": 0
                },
                {
                    "sent": "Whatever.",
                    "label": 0
                },
                {
                    "sent": "Mid Martha Mitchell know Martha Mitchell is the wife of the Mark Margaret Mitchell.",
                    "label": 0
                },
                {
                    "sent": "We don't know.",
                    "label": 0
                },
                {
                    "sent": "We don't care so, but the point is, the point is that.",
                    "label": 0
                },
                {
                    "sent": "That you know you get in this idea that this is the story and this is how it is an here what these people are saying.",
                    "label": 0
                },
                {
                    "sent": "No, that's not right.",
                    "label": 0
                },
                {
                    "sent": "It's almost like it's almost as like there's a kind of notion of realism about fiction.",
                    "label": 0
                },
                {
                    "sent": "And then someone went in there and they described what's going on, right?",
                    "label": 0
                },
                {
                    "sent": "But this was this person is not God, and we we can describe what was going on too, right?",
                    "label": 0
                },
                {
                    "sent": "Here is let me, here's another way of putting it.",
                    "label": 0
                },
                {
                    "sent": "Well, but why?",
                    "label": 0
                },
                {
                    "sent": "Because?",
                    "label": 0
                },
                {
                    "sent": "Because here's they're describing some sort of fictional world, right?",
                    "label": 0
                },
                {
                    "sent": "But we know that this person is not perfect in describing the fictional world, because they made mistakes.",
                    "label": 0
                },
                {
                    "sent": "They violated norms that they.",
                    "label": 0
                },
                {
                    "sent": "They weren't supposed to violate like laws of physics or biology or something like that now.",
                    "label": 0
                },
                {
                    "sent": "Well, go ahead I will.",
                    "label": 0
                },
                {
                    "sent": "I was kind of annoying because.",
                    "label": 0
                },
                {
                    "sent": "I I don't.",
                    "label": 0
                },
                {
                    "sent": "I don't think it's fair number when he wrote those nobles and they were published in France, well, right, right?",
                    "label": 0
                },
                {
                    "sent": "He already killed a character, right?",
                    "label": 0
                },
                {
                    "sent": "That's right, yeah.",
                    "label": 0
                },
                {
                    "sent": "I know it's stuff like this, but.",
                    "label": 0
                },
                {
                    "sent": "But still I mean it doesn't.",
                    "label": 0
                },
                {
                    "sent": "It doesn't matter because at this stage we don't appreciate his work.",
                    "label": 0
                },
                {
                    "sent": "He's too enjoy no.",
                    "label": 0
                },
                {
                    "sent": "Of course you can't.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's there's no problem with with.",
                    "label": 0
                },
                {
                    "sent": "I mean people make mistakes, but we still think they're great, right?",
                    "label": 0
                },
                {
                    "sent": "I mean, Chomsky makes mistakes.",
                    "label": 0
                },
                {
                    "sent": "We think he's still great, right?",
                    "label": 0
                },
                {
                    "sent": "You make mistakes.",
                    "label": 0
                },
                {
                    "sent": "We think you're still great.",
                    "label": 0
                },
                {
                    "sent": "I think you've made a mistake.",
                    "label": 0
                },
                {
                    "sent": "It was so somewhere, I'm sure, right?",
                    "label": 0
                },
                {
                    "sent": "So it's not about.",
                    "label": 0
                },
                {
                    "sent": "I mean, the fact that Conan Doyle made a mistake is not a problem.",
                    "label": 0
                },
                {
                    "sent": "Is this we correct the mistake?",
                    "label": 0
                },
                {
                    "sent": "Right, if Chomsky makes a mistake, you write a paper and you correct it.",
                    "label": 0
                },
                {
                    "sent": "You don't say Oh well.",
                    "label": 0
                },
                {
                    "sent": "Chomsky said this, so it's the end of the, that's it.",
                    "label": 0
                },
                {
                    "sent": "You can't fix it.",
                    "label": 0
                },
                {
                    "sent": "Well, but I mean I don't understand the difference here.",
                    "label": 0
                },
                {
                    "sent": "I mean I don't understand.",
                    "label": 0
                },
                {
                    "sent": "I mean, you can get things wrong in linguistics, just as you can get things wrong in mathematics, just as you can get things wrong in works of fiction.",
                    "label": 0
                },
                {
                    "sent": "It's sort of like this, you know I met this I I knew this physical anthropologist and she told me there's this attitude that you get sometimes where someone will find some fossil, and then they'll write a paper.",
                    "label": 0
                },
                {
                    "sent": "And then I'm going to go.",
                    "label": 0
                },
                {
                    "sent": "Well, that must be how it is, because because she found the bone right, that's the expression she found the bone.",
                    "label": 0
                },
                {
                    "sent": "But then you think about it, you know what difference does that make?",
                    "label": 0
                },
                {
                    "sent": "Just because you found the bone doesn't mean you have a better idea of what it is or what happened, right?",
                    "label": 0
                },
                {
                    "sent": "So suppose someone Conan Doyle, or whoever Gene Roddenberry who creates the Star Trek stuff or whatever it's like they found they found the bone they found this sort of fictional world.",
                    "label": 0
                },
                {
                    "sent": "An it doesn't mean that they have the best description of it.",
                    "label": 0
                },
                {
                    "sent": "It doesn't mean they're the most the best equipped to flush it out or or describe it or explore it or anything like that, and we should sort of credit them for being great artistic geniuses.",
                    "label": 0
                },
                {
                    "sent": "Ann for discovering this, but it doesn't mean their God.",
                    "label": 0
                },
                {
                    "sent": "And it doesn't mean that they got the fiction right.",
                    "label": 0
                },
                {
                    "sent": "It doesn't mean we can't repair it.",
                    "label": 0
                },
                {
                    "sent": "You kind of take fictional words to be sort of the same as were linguistics, places or mathematics.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah.",
                    "label": 0
                },
                {
                    "sent": "Fiction as well maybe?",
                    "label": 0
                },
                {
                    "sent": "Depression.",
                    "label": 0
                },
                {
                    "sent": "But why?",
                    "label": 0
                },
                {
                    "sent": "But why do you think it's different?",
                    "label": 0
                },
                {
                    "sent": "Fictional?",
                    "label": 0
                },
                {
                    "sent": "Well, I know we agree with that.",
                    "label": 0
                },
                {
                    "sent": "Well, it doesn't exist, but I mean I mean.",
                    "label": 0
                },
                {
                    "sent": "But I mean it exists we, we talk about it.",
                    "label": 0
                },
                {
                    "sent": "Of course, the ways of testing we can judge whether this is like correct or not.",
                    "label": 0
                },
                {
                    "sent": "Experiment.",
                    "label": 0
                },
                {
                    "sent": "Well, sometimes sometimes right the data are the judgments of whether this is acceptable or not, right?",
                    "label": 0
                },
                {
                    "sent": "Likewise, in a fiction, you can judge whether or not this turn in the plot is acceptable, right?",
                    "label": 0
                },
                {
                    "sent": "Turn off the part is.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "It's there, it's part of it, but we can critique it.",
                    "label": 0
                },
                {
                    "sent": "We can critique it.",
                    "label": 0
                },
                {
                    "sent": "I mean, this is what people do.",
                    "label": 0
                },
                {
                    "sent": "Well, you can do more than say it's badly written.",
                    "label": 0
                },
                {
                    "sent": "You can say no no, that was a mistake that shouldn't have happened.",
                    "label": 0
                },
                {
                    "sent": "Or if someone you know if Dickens kills off someone and then forgets that he kills them off and put some back in the story that calls for correction.",
                    "label": 0
                },
                {
                    "sent": "Fine, you know you kind of say yeah.",
                    "label": 0
                },
                {
                    "sent": "Could have been done well, so why not just?",
                    "label": 0
                },
                {
                    "sent": "Why not say let's do it another way.",
                    "label": 0
                },
                {
                    "sent": "Let's say it was a mistake.",
                    "label": 0
                },
                {
                    "sent": "Let's fix the mistake.",
                    "label": 0
                },
                {
                    "sent": "Physical space there just adding new stuff.",
                    "label": 0
                },
                {
                    "sent": "Oh well, they're doing both, yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah, they're they're doing.",
                    "label": 0
                },
                {
                    "sent": "They're doing, they're doing both right?",
                    "label": 0
                },
                {
                    "sent": "They're they're like looking at that world from a different perspective in a different angle.",
                    "label": 0
                },
                {
                    "sent": "So it's sort of like there's a world.",
                    "label": 0
                },
                {
                    "sent": "And then you have like multiple storytellers.",
                    "label": 0
                },
                {
                    "sent": "That's kind of the idea an and.",
                    "label": 0
                },
                {
                    "sent": "If they're sharing all the same norms, then then they need to converge on some sort of truth of the matter.",
                    "label": 0
                },
                {
                    "sent": "I can see you're not convinced that's OK.",
                    "label": 0
                },
                {
                    "sent": "I've no, no.",
                    "label": 0
                },
                {
                    "sent": "I'm used to not convincing you.",
                    "label": 0
                },
                {
                    "sent": "I understand.",
                    "label": 0
                },
                {
                    "sent": "OK, alright it is.",
                    "label": 0
                },
                {
                    "sent": "Alright, any anything else?",
                    "label": 0
                },
                {
                    "sent": "Working at Target.",
                    "label": 0
                },
                {
                    "sent": "You compare somehow he's actually the fishing was already summer there in the history.",
                    "label": 0
                },
                {
                    "sent": "So now it's in the future, but anything in writing.",
                    "label": 0
                },
                {
                    "sent": "But what about the future?",
                    "label": 1
                },
                {
                    "sent": "Do you think it's doing?",
                    "label": 0
                },
                {
                    "sent": "Picture of and then we'll work on being next, either next now and.",
                    "label": 0
                },
                {
                    "sent": "Whatever happened?",
                    "label": 0
                },
                {
                    "sent": "Yeah, well, I actually don't believe in a real distinction between.",
                    "label": 0
                },
                {
                    "sent": "Fictional world, an real world, and I'll probably talk about this next Friday.",
                    "label": 0
                },
                {
                    "sent": "If you're.",
                    "label": 0
                },
                {
                    "sent": "If anyone is comes back after this because with next Friday, that's that's one of the things I want to talk about that I think that distinction just completely breaks down in the end, and you already see this when you just think about fictional characters, because a work of fiction has lots of real world characters in it.",
                    "label": 0
                },
                {
                    "sent": "So in the Sherlock Holmes story, London is a character in it.",
                    "label": 0
                },
                {
                    "sent": "Right or in an antiwar Hall movie?",
                    "label": 0
                },
                {
                    "sent": "NYC is a character in it, or when you know he pulls Marshall Mcluhan out of align.",
                    "label": 0
                },
                {
                    "sent": "This was in the movie Annie Hall maybe or Manhattan Annie Hall, so we've pulls like Marshall Mcluhan, out of a line in the movie theater, and it's really Marshall Mcluhan in the movie, right?",
                    "label": 0
                },
                {
                    "sent": "So so you have this case where real world characters make it into works of fiction.",
                    "label": 0
                },
                {
                    "sent": "And I think we can also find cases where things that are objects that are initially in works of fiction make it into the real world.",
                    "label": 0
                },
                {
                    "sent": "So for example, there's this language that was invented in Star Trek, Klingon.",
                    "label": 0
                },
                {
                    "sent": "OK, but now you have people in the real world they're actually going to run speaking Klingon, and there's a Klingon language Institute for example.",
                    "label": 0
                },
                {
                    "sent": "Is this the International Norm Institute that is responsible for fixing the Unicode character set that was supposed to be using computers and clean 1 characters apart of the Unicode standard?",
                    "label": 0
                },
                {
                    "sent": "I'm coming to your experts sweet, sweet yeah so now that's so here's the thing so for sure we have real world things in works of fiction.",
                    "label": 0
                },
                {
                    "sent": "But now it looks like we have things that start out in works of fiction that make it into the real world.",
                    "label": 0
                },
                {
                    "sent": "Well, how on Earth did that happen and what is the difference?",
                    "label": 0
                },
                {
                    "sent": "And I guess the point I would make is that maybe there really isn't a serious distinction between fictional worlds, an fictions and sort of real things.",
                    "label": 0
                },
                {
                    "sent": "And that's that's that's basically the subject of next Friday's talk.",
                    "label": 0
                },
                {
                    "sent": "OK, so see you.",
                    "label": 0
                },
                {
                    "sent": "See some of you on Monday.",
                    "label": 0
                },
                {
                    "sent": "Tuesday and some of you on Friday.",
                    "label": 0
                },
                {
                    "sent": "Thanks a lot guys and Petya coming all the other things.",
                    "label": 0
                }
            ]
        }
    }
}