{
    "id": "agcwdvag7wdc7ijlqjzzikoi4uf7mqcj",
    "title": "Opening of the 1st International Workshop on Knowledge Diversity on the Web",
    "info": {
        "author": [
            "Elena Simperl, School of Electronics and Computer Science, University of Southampton"
        ],
        "published": "April 22, 2011",
        "recorded": "March 2011",
        "category": [
            "Top->Computer Science->Web Mining"
        ]
    },
    "url": "http://videolectures.net/diversiweb2011_simperl_opening/",
    "segmentation": [
        [
            "Well, a. Manuel.",
            "Workshop on knowledge.",
            "Diversity on the web.",
            "My name is Elena simple.",
            "I come from a University in Germany which is called Culture Institute of Technology.",
            "And I'm coordinating the research project which is called Brenda.",
            "This is why all the branding and marketing on the slides.",
            "This is a research project running three years in Europe.",
            "One of the two projects besides living knowledge that you will be introduced to my by my colleague Devika.",
            "That set up this this workshop in an attempt to.",
            "Create awareness and build a community around this topic that we think is is very important for the sustainability and the success of the future success of the World Wide Web.",
            "As collaboration and communication plan."
        ],
        [
            "Um, what do I mean by that?",
            "And what is?",
            "What is the motivation that drives us to set up this project and to organize this workshop here at the WWW?",
            "Well, the first problem that we identified.",
            "And has been confirmed in the meantime by most major players in in web technologies and companies is what we would like to call the last of serendipity.",
            "So what we mean is that.",
            "In the meantime, when people are looking for information on the web.",
            "They rely on.",
            "Pretty narrow number of channels and platforms, so if we're looking for.",
            "Let's say.",
            "We're looking about things about Barack Obama, the president of the United States.",
            "What one typically does is that one issues a query at Google and then Google Returns a series of results.",
            "If you have a look at these results, I mean, you can try it out for yourself.",
            "Yeah, if you have a look at these results, these results are ranked according to this well known algorithm that will go patent it, which is called page rank that is.",
            "Basically a metric of popularity.",
            "This means that pages that are very popular gets ranked higher.",
            "This is for many application scenarios.",
            "Very useful metric on the other side.",
            "The other side of the coin is that sources that are less visible but nevertheless may contain useful and knew information about a certain topic.",
            "Are ranked lower yeah and thus do not reach you as an information seeker.",
            "So for for this query I don't know how well you can see it from the from the from back there and I cannot move from the microphone because we are filled.",
            "But if you have a look at the the results you will see that there is a certain bias in the sources that are ranked on the top five positions.",
            "Yes, so you have the White House.",
            "Exposing their view on on their president, you have Wikipedia.",
            "Yeah, exposing other information you might not have, and you surely not, at least in in the query that I issued.",
            "You don't have the full wealth of information sources.",
            "For instance, from countries that are.",
            "That tend to be more critical against President Obama than than others.",
            "Yeah, what else do we do if we want to get informed?",
            "We might want to access news.",
            "Platform, yeah, and they're on the on the bottom right.",
            "I put a screenshot of query of the results of a query on something called Google News, which I think is a is a notion for for all of you yeah.",
            "That query refers to scandal that we recently had in Germany, where it turned out that our Ministry of Defense.",
            "Is guilty of plagiarism for his PhD thesis?",
            "Yeah, and there was a huge debate about this on the one side, the academic community who thought of course that that this behavior and conduct is a disgrace.",
            "Yeah, on the other side, the well I would dare to say majority of the population who thought oh I cheated in my exams at school as well.",
            "So who cares?",
            "Yeah, they never really knowing about how academic work really.",
            "Really looks like and what kind of codes of conduct we have to apply and quality standards there again.",
            "Yeah, applying the same popularity algorithms.",
            "Yeah, if you want to get the view on the majority, you would probably.",
            "Let him live with it and and stay in his position as a defense minister, which is Meanwhile not the case anymore.",
            "What else do you do when you look for information on the web?",
            "Well, now we're living in the in the in the era of the social web.",
            "So what I do what Danny is doing?",
            "We have tons of friends on Facebook.",
            "Yeah?",
            "So instead of just Googling and looking for information ourselves, we just.",
            "Broadcast the query to our network of friends.",
            "Yeah, we're looking for great restaurants in Hyderabad and then we get.",
            "We get suggestions for that.",
            "Yeah, unfortunately I didn't manage to to get the right screen at the right screenshot for that at Google, but at Facebook, sorry, but what Facebook is doing is that they always show me and promote the type of things web pages in particular that my friends like.",
            "Now my friends and I we share the same viewpoints, opinions, interests, yeah, so in the same way, yeah we have.",
            "Um, sharing interests.",
            "Yeah, as a means to recommend knew information items.",
            "Thus, the serendipity of discovering something new, something unexpected, something that is outside of my of my reach, is basically blocked.",
            "And last but not least, I have a screenshot from from Amazon which is bottom left where you can see that Amazon keeps on recommending me to read Pride and Prejudice.",
            "Though I did this long time ago.",
            "Yeah, but the point there is what Amazon is doing.",
            "An many other vertical sites are doing is that they are promoting their technique which is called or a series of techniques which is called collaborative filtering.",
            "Yeah, what happens?",
            "There is similar to the behavior you will we see in the social network.",
            "Yeah, so they look at people that bought similar items, yeah?",
            "This implies innocence.",
            "Also that these people share the same views and opinions as I do, and I.",
            "Kept the same type of recommendations over and over again, yeah?",
            "Um?",
            "As I said, this is not a negative thing in itself, but it leads to me having basically no real chance to broaden my."
        ],
        [
            "Yeah.",
            "Um, if we look at it from a from a sociological perspective, this leads to a series of effects which are known under different names, some of which being fragmentation polarization in Quito.",
            "Lization yeah, this means that through the techniques that are currently at the core of most channels and platforms people use when looking for information.",
            "Be that Google News sites, Amazon and so on and so forth.",
            "Yeah, we are getting reinforced in our views.",
            "Yeah, and.",
            "This means on the one side that people that have other views.",
            "Yeah, that might be in minority.",
            "At a certain point in time, feel excluded.",
            "What do they do?",
            "I mean the web is open and this is actually a good thing, but they have no problem in setting up their own platform that promotes their views that are similarly narrow minded.",
            "Yeah, so to say or not open to accept?",
            "Other opinions and viewpoints than others, and I have here a couple of screenshots.",
            "So on the bottom right you see a page of.",
            "Of a counterpart of Wikipedia, which is called Conservapedia.",
            "Now this.",
            "A site is very popular, especially in the states.",
            "Um, an it emerged as an effect of the fact that some people in the US felt offended that the Wikipedia in general promotes a certain liberal POV with respect to some topics that they really felt strong about.",
            "Yeah, one of them being, for instance, religion.",
            "So what they did is.",
            "Well, and what Wikipedia also did is that Wikipedia decided to promote their own view.",
            "These people from the states this minority, yeah, said no.",
            "This is our view.",
            "They set up two different things.",
            "These two wells.",
            "They don't communicate with each other, yeah.",
            "So it's very easy.",
            "Um for for any community that does not feel.",
            "Well being listened to.",
            "To look for other people on the web that share their opinions and then they have no interest or no incentive to even think of other possibilities.",
            "Yes, So what I have on the on the.",
            "Bottom Left side is actually a joke.",
            "But it is so if you have to to do quite some searching to realize that it is so, um, it's a religious site forum of discussions where people discuss where the moon is made out of cheese.",
            "And the beauty of it is actually in the line of reasoning that these people give, yeah, so one of them start saying, well, all these scientists.",
            "They tell us that the moon is made out of rock.",
            "Did you find anything in the Bible supporting this?",
            "Do you think God would make things out of rock?",
            "And so on so forth?",
            "Yeah, and they engage in.",
            "Sort of.",
            "Would you ever debate, yeah.",
            "The point, my point being here.",
            "Yeah, the web one more time encourages, well provides the means, the platform, the technologies for a variety of topics and viewpoints to be expressed.",
            "But what also happens is that these communities do not talk to each other.",
            "And last one at least I have a picture of Princess Diana just as an example of all the conspirator conspirative theories, sites that there are out there.",
            "Again, an example of of the type of.",
            "Mindsets you can find you can find on the web.",
            "So these two.",
            "Problems challenges that we identified the last.",
            "Of serendipity and this fragmentation efforts.",
            "Um are the things that motivated us to set up this project."
        ],
        [
            "In this workshop, and as I mentioned at the beginning, the project is called Brenda.",
            "It's a research project with eight European partners that started last year.",
            "Yeah, So what we want to do there is to develop information management models and techniques that pay proper account to diversity.",
            "This means, among other things, that we look into information sources, web documents, news stories, wiki articles.",
            "And try to identify opinions as such.",
            "Make these opinions and biases explicit.",
            "Yeah, and then try to change or adjust.",
            "The ranking and selection algorithms that are used right now based on collaborative recommendation, collaborative filtering, or popularity so that, for instance, in Google you don't just get in the first top ten hits.",
            "The view of the White House.",
            "On its president, but actually different standpoints as well, in the hope that this would lead to communication.",
            "And an improved collaboration on the web, which is actually what it was."
        ],
        [
            "It should be about, yeah.",
            "So.",
            "This was not what motivated us to set up this.",
            "This workshop, as I said it is a joint venture with a living knowledge proper project that you will learn in a bit.",
            "These are the topics that we were looking at you.",
            "You probably all know that."
        ],
        [
            "From the website I would like before I finished to take the opportunity to thank my colleagues for the very smooth cooperation we had over the past months in organizing this workshop.",
            "So my colleagues are then even the church he's sitting over here.",
            "He works with me at KIT and he also works for the Wikimedia Foundation in Germany.",
            "This is the foundation that runs Wikipedia.",
            "David Cash is sitting over there.",
            "Yeah, she's from the.",
            "Indian Statistical Institute in Bangalore and our 4th korganizer is Enrique Alfonseca who works for Google in Switzerland.",
            "I would also want to thank the program Committee.",
            "I'm for ensuring that the papers that were submitted receive fair and constructive reviews."
        ],
        [
            "And yeah, so we have six papers that we accepted.",
            "All of them received very positive reviews.",
            "Since we have only half day time to present them, we will kind of have to be a pain during the whole afternoon and and stick to the schedule.",
            "Yeah, but we have also a closing discussion and the coffee break for four additional questions along direction.",
            "OK, so this was all from my side.",
            "I will now.",
            "Hand over to to Devika for the presentation of the second research project, that is, that is part of this venture.",
            "And yes, enjoy the workshop."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, a. Manuel.",
                    "label": 0
                },
                {
                    "sent": "Workshop on knowledge.",
                    "label": 0
                },
                {
                    "sent": "Diversity on the web.",
                    "label": 0
                },
                {
                    "sent": "My name is Elena simple.",
                    "label": 0
                },
                {
                    "sent": "I come from a University in Germany which is called Culture Institute of Technology.",
                    "label": 0
                },
                {
                    "sent": "And I'm coordinating the research project which is called Brenda.",
                    "label": 0
                },
                {
                    "sent": "This is why all the branding and marketing on the slides.",
                    "label": 1
                },
                {
                    "sent": "This is a research project running three years in Europe.",
                    "label": 0
                },
                {
                    "sent": "One of the two projects besides living knowledge that you will be introduced to my by my colleague Devika.",
                    "label": 0
                },
                {
                    "sent": "That set up this this workshop in an attempt to.",
                    "label": 0
                },
                {
                    "sent": "Create awareness and build a community around this topic that we think is is very important for the sustainability and the success of the future success of the World Wide Web.",
                    "label": 0
                },
                {
                    "sent": "As collaboration and communication plan.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um, what do I mean by that?",
                    "label": 0
                },
                {
                    "sent": "And what is?",
                    "label": 0
                },
                {
                    "sent": "What is the motivation that drives us to set up this project and to organize this workshop here at the WWW?",
                    "label": 0
                },
                {
                    "sent": "Well, the first problem that we identified.",
                    "label": 0
                },
                {
                    "sent": "And has been confirmed in the meantime by most major players in in web technologies and companies is what we would like to call the last of serendipity.",
                    "label": 0
                },
                {
                    "sent": "So what we mean is that.",
                    "label": 0
                },
                {
                    "sent": "In the meantime, when people are looking for information on the web.",
                    "label": 0
                },
                {
                    "sent": "They rely on.",
                    "label": 0
                },
                {
                    "sent": "Pretty narrow number of channels and platforms, so if we're looking for.",
                    "label": 0
                },
                {
                    "sent": "Let's say.",
                    "label": 0
                },
                {
                    "sent": "We're looking about things about Barack Obama, the president of the United States.",
                    "label": 0
                },
                {
                    "sent": "What one typically does is that one issues a query at Google and then Google Returns a series of results.",
                    "label": 0
                },
                {
                    "sent": "If you have a look at these results, I mean, you can try it out for yourself.",
                    "label": 0
                },
                {
                    "sent": "Yeah, if you have a look at these results, these results are ranked according to this well known algorithm that will go patent it, which is called page rank that is.",
                    "label": 0
                },
                {
                    "sent": "Basically a metric of popularity.",
                    "label": 0
                },
                {
                    "sent": "This means that pages that are very popular gets ranked higher.",
                    "label": 0
                },
                {
                    "sent": "This is for many application scenarios.",
                    "label": 0
                },
                {
                    "sent": "Very useful metric on the other side.",
                    "label": 0
                },
                {
                    "sent": "The other side of the coin is that sources that are less visible but nevertheless may contain useful and knew information about a certain topic.",
                    "label": 0
                },
                {
                    "sent": "Are ranked lower yeah and thus do not reach you as an information seeker.",
                    "label": 0
                },
                {
                    "sent": "So for for this query I don't know how well you can see it from the from the from back there and I cannot move from the microphone because we are filled.",
                    "label": 0
                },
                {
                    "sent": "But if you have a look at the the results you will see that there is a certain bias in the sources that are ranked on the top five positions.",
                    "label": 0
                },
                {
                    "sent": "Yes, so you have the White House.",
                    "label": 0
                },
                {
                    "sent": "Exposing their view on on their president, you have Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "Yeah, exposing other information you might not have, and you surely not, at least in in the query that I issued.",
                    "label": 0
                },
                {
                    "sent": "You don't have the full wealth of information sources.",
                    "label": 0
                },
                {
                    "sent": "For instance, from countries that are.",
                    "label": 0
                },
                {
                    "sent": "That tend to be more critical against President Obama than than others.",
                    "label": 0
                },
                {
                    "sent": "Yeah, what else do we do if we want to get informed?",
                    "label": 0
                },
                {
                    "sent": "We might want to access news.",
                    "label": 0
                },
                {
                    "sent": "Platform, yeah, and they're on the on the bottom right.",
                    "label": 0
                },
                {
                    "sent": "I put a screenshot of query of the results of a query on something called Google News, which I think is a is a notion for for all of you yeah.",
                    "label": 0
                },
                {
                    "sent": "That query refers to scandal that we recently had in Germany, where it turned out that our Ministry of Defense.",
                    "label": 0
                },
                {
                    "sent": "Is guilty of plagiarism for his PhD thesis?",
                    "label": 0
                },
                {
                    "sent": "Yeah, and there was a huge debate about this on the one side, the academic community who thought of course that that this behavior and conduct is a disgrace.",
                    "label": 0
                },
                {
                    "sent": "Yeah, on the other side, the well I would dare to say majority of the population who thought oh I cheated in my exams at school as well.",
                    "label": 0
                },
                {
                    "sent": "So who cares?",
                    "label": 0
                },
                {
                    "sent": "Yeah, they never really knowing about how academic work really.",
                    "label": 0
                },
                {
                    "sent": "Really looks like and what kind of codes of conduct we have to apply and quality standards there again.",
                    "label": 0
                },
                {
                    "sent": "Yeah, applying the same popularity algorithms.",
                    "label": 0
                },
                {
                    "sent": "Yeah, if you want to get the view on the majority, you would probably.",
                    "label": 0
                },
                {
                    "sent": "Let him live with it and and stay in his position as a defense minister, which is Meanwhile not the case anymore.",
                    "label": 0
                },
                {
                    "sent": "What else do you do when you look for information on the web?",
                    "label": 0
                },
                {
                    "sent": "Well, now we're living in the in the in the era of the social web.",
                    "label": 0
                },
                {
                    "sent": "So what I do what Danny is doing?",
                    "label": 0
                },
                {
                    "sent": "We have tons of friends on Facebook.",
                    "label": 0
                },
                {
                    "sent": "Yeah?",
                    "label": 0
                },
                {
                    "sent": "So instead of just Googling and looking for information ourselves, we just.",
                    "label": 0
                },
                {
                    "sent": "Broadcast the query to our network of friends.",
                    "label": 0
                },
                {
                    "sent": "Yeah, we're looking for great restaurants in Hyderabad and then we get.",
                    "label": 0
                },
                {
                    "sent": "We get suggestions for that.",
                    "label": 0
                },
                {
                    "sent": "Yeah, unfortunately I didn't manage to to get the right screen at the right screenshot for that at Google, but at Facebook, sorry, but what Facebook is doing is that they always show me and promote the type of things web pages in particular that my friends like.",
                    "label": 0
                },
                {
                    "sent": "Now my friends and I we share the same viewpoints, opinions, interests, yeah, so in the same way, yeah we have.",
                    "label": 0
                },
                {
                    "sent": "Um, sharing interests.",
                    "label": 0
                },
                {
                    "sent": "Yeah, as a means to recommend knew information items.",
                    "label": 0
                },
                {
                    "sent": "Thus, the serendipity of discovering something new, something unexpected, something that is outside of my of my reach, is basically blocked.",
                    "label": 0
                },
                {
                    "sent": "And last but not least, I have a screenshot from from Amazon which is bottom left where you can see that Amazon keeps on recommending me to read Pride and Prejudice.",
                    "label": 0
                },
                {
                    "sent": "Though I did this long time ago.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but the point there is what Amazon is doing.",
                    "label": 0
                },
                {
                    "sent": "An many other vertical sites are doing is that they are promoting their technique which is called or a series of techniques which is called collaborative filtering.",
                    "label": 0
                },
                {
                    "sent": "Yeah, what happens?",
                    "label": 0
                },
                {
                    "sent": "There is similar to the behavior you will we see in the social network.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so they look at people that bought similar items, yeah?",
                    "label": 0
                },
                {
                    "sent": "This implies innocence.",
                    "label": 0
                },
                {
                    "sent": "Also that these people share the same views and opinions as I do, and I.",
                    "label": 0
                },
                {
                    "sent": "Kept the same type of recommendations over and over again, yeah?",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "As I said, this is not a negative thing in itself, but it leads to me having basically no real chance to broaden my.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Um, if we look at it from a from a sociological perspective, this leads to a series of effects which are known under different names, some of which being fragmentation polarization in Quito.",
                    "label": 0
                },
                {
                    "sent": "Lization yeah, this means that through the techniques that are currently at the core of most channels and platforms people use when looking for information.",
                    "label": 0
                },
                {
                    "sent": "Be that Google News sites, Amazon and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "Yeah, we are getting reinforced in our views.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and.",
                    "label": 0
                },
                {
                    "sent": "This means on the one side that people that have other views.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that might be in minority.",
                    "label": 0
                },
                {
                    "sent": "At a certain point in time, feel excluded.",
                    "label": 0
                },
                {
                    "sent": "What do they do?",
                    "label": 0
                },
                {
                    "sent": "I mean the web is open and this is actually a good thing, but they have no problem in setting up their own platform that promotes their views that are similarly narrow minded.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so to say or not open to accept?",
                    "label": 0
                },
                {
                    "sent": "Other opinions and viewpoints than others, and I have here a couple of screenshots.",
                    "label": 0
                },
                {
                    "sent": "So on the bottom right you see a page of.",
                    "label": 0
                },
                {
                    "sent": "Of a counterpart of Wikipedia, which is called Conservapedia.",
                    "label": 0
                },
                {
                    "sent": "Now this.",
                    "label": 0
                },
                {
                    "sent": "A site is very popular, especially in the states.",
                    "label": 0
                },
                {
                    "sent": "Um, an it emerged as an effect of the fact that some people in the US felt offended that the Wikipedia in general promotes a certain liberal POV with respect to some topics that they really felt strong about.",
                    "label": 0
                },
                {
                    "sent": "Yeah, one of them being, for instance, religion.",
                    "label": 0
                },
                {
                    "sent": "So what they did is.",
                    "label": 0
                },
                {
                    "sent": "Well, and what Wikipedia also did is that Wikipedia decided to promote their own view.",
                    "label": 0
                },
                {
                    "sent": "These people from the states this minority, yeah, said no.",
                    "label": 0
                },
                {
                    "sent": "This is our view.",
                    "label": 0
                },
                {
                    "sent": "They set up two different things.",
                    "label": 0
                },
                {
                    "sent": "These two wells.",
                    "label": 0
                },
                {
                    "sent": "They don't communicate with each other, yeah.",
                    "label": 0
                },
                {
                    "sent": "So it's very easy.",
                    "label": 0
                },
                {
                    "sent": "Um for for any community that does not feel.",
                    "label": 0
                },
                {
                    "sent": "Well being listened to.",
                    "label": 0
                },
                {
                    "sent": "To look for other people on the web that share their opinions and then they have no interest or no incentive to even think of other possibilities.",
                    "label": 0
                },
                {
                    "sent": "Yes, So what I have on the on the.",
                    "label": 0
                },
                {
                    "sent": "Bottom Left side is actually a joke.",
                    "label": 0
                },
                {
                    "sent": "But it is so if you have to to do quite some searching to realize that it is so, um, it's a religious site forum of discussions where people discuss where the moon is made out of cheese.",
                    "label": 0
                },
                {
                    "sent": "And the beauty of it is actually in the line of reasoning that these people give, yeah, so one of them start saying, well, all these scientists.",
                    "label": 0
                },
                {
                    "sent": "They tell us that the moon is made out of rock.",
                    "label": 0
                },
                {
                    "sent": "Did you find anything in the Bible supporting this?",
                    "label": 0
                },
                {
                    "sent": "Do you think God would make things out of rock?",
                    "label": 0
                },
                {
                    "sent": "And so on so forth?",
                    "label": 0
                },
                {
                    "sent": "Yeah, and they engage in.",
                    "label": 0
                },
                {
                    "sent": "Sort of.",
                    "label": 0
                },
                {
                    "sent": "Would you ever debate, yeah.",
                    "label": 0
                },
                {
                    "sent": "The point, my point being here.",
                    "label": 0
                },
                {
                    "sent": "Yeah, the web one more time encourages, well provides the means, the platform, the technologies for a variety of topics and viewpoints to be expressed.",
                    "label": 0
                },
                {
                    "sent": "But what also happens is that these communities do not talk to each other.",
                    "label": 0
                },
                {
                    "sent": "And last one at least I have a picture of Princess Diana just as an example of all the conspirator conspirative theories, sites that there are out there.",
                    "label": 0
                },
                {
                    "sent": "Again, an example of of the type of.",
                    "label": 0
                },
                {
                    "sent": "Mindsets you can find you can find on the web.",
                    "label": 0
                },
                {
                    "sent": "So these two.",
                    "label": 0
                },
                {
                    "sent": "Problems challenges that we identified the last.",
                    "label": 0
                },
                {
                    "sent": "Of serendipity and this fragmentation efforts.",
                    "label": 0
                },
                {
                    "sent": "Um are the things that motivated us to set up this project.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this workshop, and as I mentioned at the beginning, the project is called Brenda.",
                    "label": 0
                },
                {
                    "sent": "It's a research project with eight European partners that started last year.",
                    "label": 0
                },
                {
                    "sent": "Yeah, So what we want to do there is to develop information management models and techniques that pay proper account to diversity.",
                    "label": 0
                },
                {
                    "sent": "This means, among other things, that we look into information sources, web documents, news stories, wiki articles.",
                    "label": 0
                },
                {
                    "sent": "And try to identify opinions as such.",
                    "label": 0
                },
                {
                    "sent": "Make these opinions and biases explicit.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and then try to change or adjust.",
                    "label": 0
                },
                {
                    "sent": "The ranking and selection algorithms that are used right now based on collaborative recommendation, collaborative filtering, or popularity so that, for instance, in Google you don't just get in the first top ten hits.",
                    "label": 0
                },
                {
                    "sent": "The view of the White House.",
                    "label": 0
                },
                {
                    "sent": "On its president, but actually different standpoints as well, in the hope that this would lead to communication.",
                    "label": 0
                },
                {
                    "sent": "And an improved collaboration on the web, which is actually what it was.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It should be about, yeah.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This was not what motivated us to set up this.",
                    "label": 0
                },
                {
                    "sent": "This workshop, as I said it is a joint venture with a living knowledge proper project that you will learn in a bit.",
                    "label": 0
                },
                {
                    "sent": "These are the topics that we were looking at you.",
                    "label": 0
                },
                {
                    "sent": "You probably all know that.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From the website I would like before I finished to take the opportunity to thank my colleagues for the very smooth cooperation we had over the past months in organizing this workshop.",
                    "label": 0
                },
                {
                    "sent": "So my colleagues are then even the church he's sitting over here.",
                    "label": 0
                },
                {
                    "sent": "He works with me at KIT and he also works for the Wikimedia Foundation in Germany.",
                    "label": 0
                },
                {
                    "sent": "This is the foundation that runs Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "David Cash is sitting over there.",
                    "label": 0
                },
                {
                    "sent": "Yeah, she's from the.",
                    "label": 0
                },
                {
                    "sent": "Indian Statistical Institute in Bangalore and our 4th korganizer is Enrique Alfonseca who works for Google in Switzerland.",
                    "label": 0
                },
                {
                    "sent": "I would also want to thank the program Committee.",
                    "label": 0
                },
                {
                    "sent": "I'm for ensuring that the papers that were submitted receive fair and constructive reviews.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And yeah, so we have six papers that we accepted.",
                    "label": 0
                },
                {
                    "sent": "All of them received very positive reviews.",
                    "label": 0
                },
                {
                    "sent": "Since we have only half day time to present them, we will kind of have to be a pain during the whole afternoon and and stick to the schedule.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but we have also a closing discussion and the coffee break for four additional questions along direction.",
                    "label": 0
                },
                {
                    "sent": "OK, so this was all from my side.",
                    "label": 0
                },
                {
                    "sent": "I will now.",
                    "label": 0
                },
                {
                    "sent": "Hand over to to Devika for the presentation of the second research project, that is, that is part of this venture.",
                    "label": 0
                },
                {
                    "sent": "And yes, enjoy the workshop.",
                    "label": 0
                }
            ]
        }
    }
}