{
    "id": "agnxlyeffukzmpyfh2dvf74gylwl2ssp",
    "title": "Knowledge Base Construction with Epistemological Databases",
    "info": {
        "author": [
            "Andrew McCallum, Department of Computer Science, University of Massachusetts Amherst"
        ],
        "recorded by": [
            "AKBC-WEKEX"
        ],
        "published": "July 13, 2012",
        "recorded": "June 2012",
        "category": [
            "Top->Computer Science->Information Extraction",
            "Top->Computer Science->Natural Language Processing",
            "Top->Computer Science->Text Mining",
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/akbcwekex2012_mccallum_base_construction/",
    "segmentation": [
        [
            "Knowledge.",
            "Like students in there saying like awakening, and now we're all here.",
            "Cortana.",
            "I've been working on various different kinds of knowledge base construction for Bio NLP work.",
            "This session is done and other general.",
            "But our primary love is to do work on bibliometric databases, like this system that we built."
        ],
        [
            "It's about people and papers and institutions in conferences and journals.",
            "In Branson tries to understand the full set of entities and their relation is where we're on the path to build another piece of also."
        ],
        [
            "It's in the world by extracting integrating information from papers and reports and credit agencies, wire and then resources, and they want to do this because he feels that if we build better tools for scientists to communicate that we can accelerate the progress of science like helping them.",
            "Find reviewers and collaborators.",
            "People to hire one of the first part of the system that I'm eager to build is a postdoc Finder.",
            "Find people about their students and actually try to predict your graduation date so you can kind of just contact you.",
            "And also for.",
            "Policy deciders to understand trends in Massachusetts.",
            "Also a great.",
            "We'd also like to use this kind of platform to support also a platform for a new model of a potion to something that I and others such as Yahoo.",
            "Nor advocating in which rather than submitting a paper to a Journal of art, disappears from the world for six months and maybe or maybe not.",
            "Good review.",
            "And maybe you're not making it appears in the public.",
            "Instead, you supposed to have like archive where your work is available immediately and comments reviews our process that happens through comments.",
            "This would actually improve their quality quality.",
            "So when we think about building such a knowledge base, what do?"
        ],
        [
            "Boots.",
            "Open universe of entities.",
            "It's not just a matter of Co reference to entities that we know appear in the pedia.",
            "There's maybe closed list in relation types that we care about most, although at the end of this talk I'm going to discuss in some detail something that's there is much closer resemblance to open we are users will ever really a low tolerance for errors, right?",
            "They don't want to see their own paper attributed to someone else or other kinds of errors like that, but our our users would be willing to edit this knowledge base in vertical stripes.",
            "And the world is changing stream of new papers appearing all the time, institutions.",
            "Alright, so now let's talk about knowledge base building and what the typical steps."
        ],
        [
            "As we all know, you begin trip with some text.",
            "Typically we run something that finds mentions of entities in this context also defines mentions of relations among these entities in addition to text.",
            "We may also have a large quantity of pre structured data and we like to integrate that as well, and all of this information goes into some resolution or coreference process in which we are resolving not just entity mentions but also in a sense, relations and relations of different types bring this all together into what we think of as.",
            "The truth about entities and relations.",
            "Inject this into the knowledge base and then answer queries.",
            "Issue queries.",
            "And I think the machine learning and NLP community is going to take great pride in the fact that on many of these individual components we have quite good accuracy.",
            "This is all looking good until we realize that we know that because we're streaming these things together.",
            "That is the error.",
            "Snowball and .9 just raised to the third power is already not looking so good, and so we really like to be more accurate.",
            "And that's really the way to do this through reason more with more uncertainty to pass multiple hypothesis through this pipeline to let later stages help us correct earlier errors and to do joint entrance through this pipeline.",
            "And I really this is been topic that I."
        ],
        [
            "Advocating for many years, I feel like it's a lifetimes worth of work.",
            "I feel like it's really one of the fundamental issues in artificial intelligence, not just the language product supervision.",
            "All these areas where there are multiple layers of abstraction, the problem is naturally divided into multiple layers of extraction.",
            "So we and others have done a lot of work on various aspects of joint inference.",
            "Typically neighboring components of some NLP pipeline here, and most of them at the early stages of the pipeline.",
            "More recently, I really feel like the most juice from jointed friends is going to come by recently all the way through the later stages, like pipeline reasoning about the knowledge base contents and having top down reasoning help us get lower levels of the analogy pipeline correct.",
            "So this brings up some challenging issues.",
            "Can we represent and inject uncertainty contraction all the way into the database?",
            "How can we use the database contents to help us do better instructions?",
            "And Furthermore, this might be in some sense most important.",
            "The information extraction is not one shot.",
            "I don't get all my data up front, right have a large project documents now, but then tomorrow I'm going to get another 10,000 documents and I the additional evidence that I get from those later documents through sometimes cause me to change my mind about conclusions that I made yesterday.",
            "And I don't want to have to redo all of extraction from scratch.",
            "I'd like to be able to use this new evidence to help me change my mind about conclusions that I respect.",
            "And.",
            "When this extraction process runs outside of the database like this, this can be quite quite difficult.",
            "In some ways.",
            "I would like actually the database infrastructure to help me manage not just the storing of the results of extraction, but manage information extraction pipeline or process itself being storage immediate results.",
            "Visit.",
            "So with this in mind, we've been thinking about enlarging the purview of the database so that it looks like it's so there's some sense in which."
        ],
        [
            "The extraction process runs inside the database and as I was just saying, intermediate results are stored inside the database.",
            "Revisit them efficiently, interface.",
            "And that really the only thing that gets injected into the database is not the truth, but the raw evidence.",
            "The raw data that we have.",
            "And so in some sense, it which is you points is like customer logical philosophy, which says you don't get to observe the truth.",
            "You only observe evidence and it's up to your inference to discover what the truth is.",
            "So we've taken to calling temper Proton official logical database never injected the truth, evidence and truth discovering inference happens in some sense inside.",
            "And.",
            "In some sense, you can think that this is.",
            "We've just moved around some of the boundaries of our system and some, and that's true in a way.",
            "But this really this worldview provides quite a different way of thinking and create some new opportunities, and some new scientific research angles that we're extremely excited and I want to briefly run through some of these things so.",
            "One is that human edits that I was talking about earlier can be seen as just an additional kind of evidence.",
            "So rather than that."
        ],
        [
            "Additional routes in which a human edit consists of reaching into the database, erasing the former.",
            "Choose writing a new value in, keeping with edit histories.",
            "I need to do it necessary instead of human edit is a committee document, says well On this date.",
            "This person said this thing was true and that evidence participates in truth discovery alongside.",
            "So this really helps us, because sometimes humans can grow more, they can disagree, or they can be out of date.",
            "The machine extraction process to be able to.",
            "Sometimes human might make it correct, like a good correction within six months later in the state of the world changes and like.",
            "Machine extraction process to build the human, sometimes an and this also allows us to reason in an integrated way about those truth discovery.",
            "End about the reliability.",
            "So another is never ending infants.",
            "Because this extraction pipeline is not outside of the database, but inside these entries are not locked in knowledge base entries can always be considered more evidence or times for some sense of it.",
            "You should think that inference is running until bubbling and constantly in the background instead of this.",
            "Another is that resolution is."
        ],
        [
            "The foundational year, and I mean not just entity resolution but also resolution of ontologies, schemas and relations that may come from from the structured data that we have available.",
            "It's also especially relevant here in an epistemologically database where you can only really touch the database.",
            "From this end is from from from the outside, and entities are are are things discovered by inference inside of the database and entities are kind of are ephemeral.",
            "Objects right?",
            "We could be changing their mind about which mentions belong together.",
            "And.",
            "Even the queries that come in are the way those are expressed in terms of mentions which that need to be resolved.",
            "Another aspect is resource bound information."
        ],
        [
            "If you look at our knowledge base and we see that we have some holes.",
            "Missing field values or some missing rows rather than fully processed entire when we can, in some focused way, issue queries that go out to the web and do very focused processing.",
            "Just continue.",
            "Another is that we were going to try to operate at large scale that we should be thinking deeply about parallelism and doing some work which I've described in it.",
            "Which we don't really think."
        ],
        [
            "About map reduce as a black box, but try to reason and integrated way about machine learning, inference and parallelism and do these things together in a way that gives us quite nicely.",
            "Handsome.",
            "Much about what I mean by storing uncertainty inside the knowledge base, and I'll say more about this minute, but let me.",
            "Safe and also a number of the models that we've been using so far.",
            "The graphical models are so complicated and it's really quite hard to do message passing based in Trencin.",
            "Then we doing quite work that work with MCMC sampling and.",
            "So."
        ],
        [
            "With this in mind, a lot of our work so far has means that, well, in this knowledge base we're storing, actually are in contiguous samples samples."
        ],
        [
            "The truth an inference consists of many parallel inference workers visiting the knowledge base when interest workers angle give me a copy of these 10,000 variables, I'll do some inference work on that."
        ],
        [
            "Have"
        ],
        [
            "Samples of new values right?",
            "Those decks.",
            "The knowledge base."
        ],
        [
            "Biscuits rise to a lot of juicing research issues and how to do focus sampling.",
            "How do resolution multiple parallel inference workers they could be working on it or not in fact represent some certainty inside the knowledge base?",
            "Alright, alright so this is my background context and with this in mind I want to talk about."
        ],
        [
            "Or research.",
            "Didn't have time to talk about sample Reg, which is a method of parameter estimation that's embedded in the MCMC process.",
            "State of the art results and can be very, very fast.",
            "But if you'd like to talk about that later.",
            "Let's just get directly into entity resolution.",
            "So here we're going to talk about entity Resolu."
        ],
        [
            "And then thinking about this in a very integrated way with parallel distributed processing and certain kind of model structure choices and how they influence efficiency.",
            "So if you want to do."
        ],
        [
            "Non greedy entity resolution where you don't know the number of entities in advance like the Now classic way to do this is by building models in which you measure pairwise affinity's between mentions.",
            "So here the blue dots are getting in for mentions of entities and the yellow ovals are representing my current hypothesis about how things will be partitioned into entities and the lines are representing these pairwise compatibility that I'm measuring to decide which partitioning seems like.",
            "And the way the inference often works in these models is that I would consider some men."
        ],
        [
            "Like this one, and consider the possibility of coming it from the one entity to another and I."
        ],
        [
            "In order to."
        ],
        [
            "Assess whether I think this is a good idea.",
            "I look at the incompatibilities on the edges that are affected by that move and store them.",
            "I might also consider some other mention."
        ],
        [
            "Discord, at least."
        ],
        [
            "And I can notice that even though there are edges that go fully across the model, the edges that need to be evaluated for assessing these moves are really quite a bit more limited.",
            "They don't have anything to do with each other, and that they can be evaluated and accept it separately and in parallel, not even on separate machines.",
            "And it's this intuition that formed the basis of some work that's missing during internships at Google, which we did exactly this in which we."
        ],
        [
            "Other large set of mentions they go to some distribution process and spread them out over 1000 machines.",
            "Within each machine we do these MCM steps among the data that's available on that machine arrive at some new resolution conclusions.",
            "Send the data back to the distributor which we scrambles the data so that new data can have chances interact in new ways and.",
            "We found the second guy."
        ],
        [
            "We got some nice chunks inefficiency where higher is better accuracy.",
            "Time is running along the axis.",
            "Here we go from one second to the next, looking good.",
            "As we had more CPUs, we have pretty serious dimensioning returns, so this is actually not looking all that great.",
            "So what we're going to do is add a bit more."
        ],
        [
            "To a structure with it more to the model.",
            "By doing so, here we have entities and mention is shown in.",
            "These colors were also going to add a notion of what will call a super entity, wishing that you could think of as it recursive clustering of the entities themselves.",
            "If I were to merge two entities, which entities would diverge?",
            "Sounds like these crazy boxes will go around.",
            "And these super entities provide infer a good.",
            "Data distribution for how I should distribute my my data across machines so that I have.",
            "Similar sets of entities going to the same machines that interact.",
            "I will also add an ocean of water called sub entities or further divisions within an entity and you can think of these as hypothesized splits they were going to split this entity.",
            "Where would I slip this and these sub entities?",
            "And for good block moves this is capturing a notion of some mentions that are so similar to each other that if I were going to move them I should move them over here.",
            "And what's interesting to me about this is that we're using a recursively structured model to do inference not only about truth discovery, but simultaneously about inference.",
            "For the sake of strategizing about how the data should be distributed.",
            "And when we do this blue."
        ],
        [
            "Is that the best one of our previous methods?",
            "And now when we?",
            "Super handsome entity.",
            "But in some newer can do even better than this.",
            "With the following."
        ],
        [
            "Will remove.",
            "We will not have any pairwise compatibility measures on dimensions at all."
        ],
        [
            "And and take these entities which are having in the past been.",
            "Latent in representing the partitioning of mention themselves and pull them up into these are the first class objects.",
            "These representatives of the entities that."
        ],
        [
            "Cells and measure compatibility from the mentions to these inverted entities instead, so gathered in these.",
            "Entities will be at various.",
            "Attributes of the entities which we've pulled from dimensions to which they've been.",
            "Current.",
            "Design inference will consist as it did before of moving mentions from when it into another moving one of ARX 2 new entities and and I can also in a model like this have a notion of sub entities and super entities in hierarchy."
        ],
        [
            "This is a subject of."
        ],
        [
            "We find that it's significantly more efficient or weddings end square factors.",
            "We can do joint inference on all of the attributes of an entity because they've all been gathered together in one place, whereas previously been distributed across the pairs.",
            "We can efficiently handle cases in which there are some entities that have a very large number of mentions, and any of these mentions can be hidden in lower layers of the hierarchy and don't have to be examined that we're making later.",
            "Decisions.",
            "This structure of the model of white certain technical problems that sometimes arise in conditional random field changes in network cardinality between training and testing time.",
            "And this kind of model also better supports and it's incredible.",
            "Results.",
            "Here the red."
        ],
        [
            "Mine is.",
            "The best result from the previous model that had super inside entities, but pairwise comparison dramatic difference in proficiency accuracy here.",
            "This is 145 thousand mentioned before mentions.",
            "Dramatic, currently running this event data with the 90 million mentions.",
            "So we've also been running this kind of model on."
        ],
        [
            "Newswire in Wikipedia data, which will combine structured data that we get from Freebase with unstructured data times.",
            "So here we.",
            "Take Freebase or Wikipedia into."
        ],
        [
            "He's an pre populate this hierarchical structure with the data from there, so we will take probably create some entities for the many different string forms that we get from links and redirects within this construction paper.",
            "So things form submit, he's and then from full text we can extract.",
            "Then you mentioned add these mentions to the model and coreference in which will not only assign these mentions.",
            "Two entities that we know about previously but discover cases where.",
            "We are seeing mentions that we hypothesize don't belong anywhere here previously.",
            "Currently doing this on not such a large set, but about 100,000.",
            "So in HD resolution."
        ],
        [
            "Just in the abstract are many juicy research issues at the intersection between machine learning and systems and very fruitful area for research for future research.",
            "Formalizing notions of asynchronous distributed Markov chain Monte Carlo processes.",
            "Methods for how to select subsets of variables for sampling lightworker, engine scaling, and preference.",
            "Next chapter."
        ],
        [
            "Property for humans.",
            "So let's look at this in the context of entity resolution in the end."
        ],
        [
            "And let's say that in the current system we have yellow areas mentioning this, capturing undercurrent notion of entities and let's say their current system thinks that we have one extra here, which is a friend of prayer.",
            "Obviously Google and what we think at the moment is a different Fernando Pereira social with Sri.",
            "A human looks like this is well, actually.",
            "I know that those are the same person that had somehow like to tell the system again, see.",
            "And what we don't want to do is have a human just say, well numbers take this edge and somehow tell them that these things should be merged.",
            "Nodes that we want the human to do this by introducing some new evidence that will cause inference to to come to that conclusion itself.",
            "So what that looks like is that the human editor adds effectively 2 new mentions.",
            "Here's a."
        ],
        [
            "Amanda Pereira in filiation is Google and the research.",
            "She's learning how to pee.",
            "And then here's another mention of a fanatic proliferation right with some slightly different research topics we.",
            "And that's that the human expresses some notion that, well, I prefer that these two mentions end up in the same.",
            "So next inference runs on these mentions independently, ignoring that link.",
            "Evidently, you'll get coreference like this and then the MCMC scoring process is set up to prefer proposals whose.",
            "Cause entities that obey those.",
            "Constraints, constraints but preferences.",
            "So that later, when CMC said considers a proposal that looks like this."
        ],
        [
            "Taking this entity and now turning into a sub entities and already this is the same as the center here at this kind of move will be scored more highly because.",
            "Other people could add human edits that may disagree with this so people could add human edits that are actually quite noisy and will do it sometime.",
            "So we have some new experimental results with."
        ],
        [
            "It will be presented.",
            "I'm rich.",
            "Overwrite method.",
            "Just makes direct link changes to place links.",
            "Doesn't make that much of a difference.",
            "Obey some local transitivity.",
            "We can do a bit better, but we reason in a more global sense about this.",
            "And that if we.",
            "Project edits that are."
        ],
        [
            "Noisy that are wrong because we're not just taking it said it's always incorporating that.",
            "It's been recently about them that.",
            "As more and more error full edits are made that we can preserve some accuracy for quite some time before accuracy folds."
        ],
        [
            "So we are interested in.",
            "How to do efficient forward chaining given new evidence of some of these edits and how to be more robust to noise?",
            "How to deal with streaming inputs in some cases in which will have so many mentions or so many edits that will want to keep some of them toss others?",
            "Alright.",
            "So."
        ],
        [
            "Charger.",
            "So there are several styles of relation extraction that have been done and."
        ],
        [
            "You don't work.",
            "So one, of course, is vanilla supervised, in which somebody gives you a schema in advance.",
            "They also give you some label data.",
            "Matching that schema and then at Test time given new instance and remodel hopefully produces something good.",
            "Label data extract.",
            "Massive pain to get this kind of label data and so we'd like to consider some alternatives and one alternative is."
        ],
        [
            "Super Bowls from data that might be freely available to us already, such as a pre existing large structured knowledge base like Freebase or.",
            "So here again, we have some ontology that so it's.",
            "With the database.",
            "Have a large, unlabeled textual document.",
            "Find places in the text where certain facts that we know about from the database has been rendered in text and align them with each other.",
            "This alignments effectively labeled piece of text from which we can then train machine learning models.",
            "And then run that model and more text discovered.",
            "But this requires that we have large set stuff.",
            "Pre structured data or that we find a set like this with an ontology that matches with care about, and maybe that doesn't match.",
            "This fight so more completely unsupervised, which happened to be open.",
            "Here."
        ],
        [
            "Text coming in.",
            "Run a dependency parse or some approximation to a dependency.",
            "Parts over this text and then directly pull out the words from the sentence into something that you called.",
            "Mixed regulations.",
            "Classic version of this then has issues that, well, I'm extracting the surface form that the sentence says.",
            "Somebody attended Harvard, but that may not be that I don't know that that's the same thing as affiliated and so there can be some sparsity problems here.",
            "So for this reason.",
            "Ornament and others have done work, then on doing some unsupervised clustering to try to discover these kinds of synonyms where."
        ],
        [
            "Discover Wells affiliated and attendees we need sort of the same thing and so I can have better coverage.",
            "But he's kind of unsupervised.",
            "This is Patrick.",
            "And others have been working in.",
            "Can be sort of slippery right there, a bit arbitrary.",
            "They can be hard to evaluate.",
            "We may argue that well, if somebody offered a paper they wrote a paper, they published the paper and these are really synonyms and we're happy to say that these mean all the same thing, but to say that.",
            "Tennessee University is not to be the same as saying that they are a professor at the University.",
            "Students are not really synonyms and they don't.",
            "There's not a bidirectional implicature.",
            "Actually, really."
        ],
        [
            "Any schema that we would pick is going to be incomplete and have many boundary cases to it.",
            "Card reading assignment.",
            "This came up earlier in the conference losing that already asked, hoping the question matters.",
            "If I talked, where do these relation types?",
            "This is.",
            "Organs.",
            "Intelligent.",
            "So there are people like the folks at Freebase have worked hard to build an ontology that cover a lot of things, but.",
            "Still, there are going to be things that we may care about.",
            "It would be missing from that image and augmenting ontology.",
            "So quite recently."
        ],
        [
            "Sebastian.",
            "Thinking about something that we refer to as a universal schema.",
            "So in an open."
        ],
        [
            "Incense will take the schema to be the union of all inputs from natural language and from databases, so will embrace or the diversity ended.",
            "Ambiguity of the original input form of language and not try to force that we need by these relations into something to some fixed predefined boxes.",
            "And some of this I think is well aligned with a statement that commanders like to make it past.",
            "If there were a useful concept then.",
            "Speakers of English language would have invented the word capture and so just use the original words to being.",
            "Just going down what's the word for that idea?",
            "Sorry.",
            "You are on the spot.",
            "I don't know yet.",
            "But they haven't shown that it's usually actually let me show it's useful then, maybe when.",
            "And but then we'd also like to, so this gives us a very sort of sparse view of what all these things mean.",
            "So to address this, sparsity would like to learn implicature among these entity relations, in order to fill in things also that we don't observe, and so the way that an initial way that we've been thinking about this can be visualized in the following sense.",
            "Imagine a huge table."
        ],
        [
            "With entity pairs in the road over on the left and then these will be user entities not mentioned.",
            "And then in the columns are these many different relation types and many of them shown in yellow.",
            "There are really just the surface textual form of these relations, just like we come from open.",
            "And and then, you know, we'll also throw in structured data as well, and those come in their own ontology, so these will form some additional columns that come from construction relations at the base or.",
            "But there will be a large number in some of our preliminary experiments, 22,000 and four.",
            "And then we go to Texans knowledge base and you can see that some of these are observed."
        ],
        [
            "So we can just go in.",
            "And but then, what we'd like to do is fill in the rest of this this knowledge base as well, and will do this by modeling this matrix and filling it in with the kinds of methods that have been quite successful in Netflix, Netflix.",
            "You also have a very large matrix that's extremely sparse.",
            "And.",
            "Well, there, and so we've started with some methods based on devices, components, analysis which we're making some documentations that are specialized for this kind of application or everywhere.",
            "And so this effectively fills in the rest of the matrix of these lighter shades in which we can see."
        ],
        [
            "Well, even though we didn't observe in text directly that Obama is the leader of the United States, we infer this and maybe.",
            "The model discovered that this was a good idea is solid.",
            "President of Russia.",
            "Many other colleagues, including ones not showing it to help us arrive.",
            "At the same time.",
            "See things like.",
            "The top members in their release Medicine culture membership organizations not heads of State, and that will really.",
            "Will embrace some of the original ambiguity, right?",
            "So like here's Chancellor Oven, his chancellor country in his chance for University.",
            "And those, maybe those mean little bit different things.",
            "But those are the same surface form.",
            "And some of those the differences in those meaning will show up in other additional columns that say something about their responsibility.",
            "So let me show you some examples of pieces of this matrix as they come out from from some field data.",
            "So here we infer."
        ],
        [
            "Sure that even folks criticize George Bush.",
            "Synonym situation here's a more.",
            "Should we observe you further?"
        ],
        [
            "Volvo owns a percentage in.",
            "From having observed it.",
            "And here's another case that makes this point that we're not."
        ],
        [
            "Just learning synonyms or clusterings with the divide affectional, but we have some asymmetric notion here, so we by observing that Kevin Boyle is at historian at Ohio State, we infer that he's professor at Ohio State.",
            "But when we observe that Freeman is a professor at Harvard, we don't necessarily infer historian.",
            "So this is I see this says this is different from.",
            "Learning mappings just among these relation types in the abstract like this relation always means this other kind of relation is true or reasoning simultaneously about the relations of the individual concerns.",
            "At the same time, and many relations that these entity pairs would have an even better about exceptions in my life.",
            "So these are very preliminary."
        ],
        [
            "The initial efforts, but we're running on 20 years of New York Times, from which we get 50,000 entity pairs and about 20,000 interpolation surface forms, throwing freebase as well and.",
            "Here are some preliminary results.",
            "I think that in comparison with a lot of other systems that are extracting relations, including things like alignments against Freebase, once you get up into recall levels that are in 50s or above above 15, that's these precision numbers are actually quite low in line.",
            "So I'm just about every time so."
        ],
        [
            "Summary this approach within this approach we're embracing diversity and unity of the original intent of forcing these boxes for reasoning about entities and relations together.",
            "It's not an abstract relation.",
            "Relation mapping.",
            "The user can then.",
            "Query this knowledge base without needing to study your understand some limited schema.",
            "You can ask in whatever language they want too, and we probably have a column for that somewhere in that column.",
            "And probably I think the way we think about this is that.",
            "It's best to try to model and predict the original expression pattern.",
            "Well defined database path and not to try to create models of semantic difference.",
            "They really think are loose.",
            "So this is related to."
        ],
        [
            "Also related to this country methods I described dispenser, quite related work which work actually mentioned earlier this also.",
            "Discovery rules to fill these these things and most of what I've seen there is you can try to recent directly about their relations without looking at mixed together on this small error.",
            "That move.",
            "So we're next going to be."
        ],
        [
            "Incorporating relations with different arodys, integrating more background knowledge, scaling up.",
            "Final conclusion I."
        ],
        [
            "Advertisement.",
            "Before for factory, so you know we've been working on very complicated graphical."
        ],
        [
            "Levels of research was really slowed down by implementing these things by hand and.",
            "And."
        ],
        [
            "So to accelerate our research, we've been working on.",
            "Tools that will help."
        ],
        [
            "Quicker fucker hearing about machine learning models."
        ],
        [
            "Probably.",
            "Interest to specify which complicated models using the full power of the kinds of benefits were used to having indeterminate programming languages.",
            "Good useful data structures and control mechanisms that abstraction and built the system."
        ],
        [
            "Factory, which is a general tool kit for graphical models that's intended to be scalable enough, could actually deploy the kind of scales that we care about this workshop.",
            "It's object oriented in which various factors influence.",
            "Marketing efforts.",
            "Are all objects and modified by inheritance.",
            "Perative flexibility in the way we construct into operations on that performance is imbedded in general purpose programming language which mixed together the model definitions that was pre processing the data and various.",
            "Diagnostic machines would actually represented the full programming language scalable.",
            "Database."
        ],
        [
            "Few minutes for question.",
            "Whole host of really exciting ideas in there, so I think it was great talking just picking.",
            "I sense that it could trigger.",
            "I really not really like the vision.",
            "I mean making it actually run scalable.",
            "I think is the question, but just to pick up one particular topic on the universal schemas cookout polysemy.",
            "Ah, OK, so.",
            "Um?",
            "Now we're using just a surface form to represent itself, and I think that.",
            "The sense in which.",
            "There are some different subtle meetings here then that would be captured by some other kinds of columns, right?",
            "So let me exist.",
            "So I mean like like let's let's take the chance for example, that was there.",
            "So you can ask, well, is Crimson the chancellor of MIT?",
            "Well, you know the answer is yes, the chance to have more than one meeting, yes, but it's still true.",
            "And that's where this morning in any way that Felicity mattered.",
            "Well, that's going to be captured by difference in somehow.",
            "Does that happen?",
            "So I wanted to just ask you more about the UI issues and human editing that you are talking about.",
            "Specifically, in some scenarios level of generalization becomes very critical, so user gives an information.",
            "These two affiliations at the same.",
            "That could be because the company bought another company.",
            "So all affiliations are the same or just this person has dual apps, applications or even these kind of people have dual affiliations.",
            "So there are multiple levels.",
            "Realities in which each your information can be generalized.",
            "Have you thought about it?",
            "How would the user give that kind of information?",
            "How you might be able to gracefully degrade it?",
            "These are really interesting, but these are great questions, and once they were eager to try to address our preliminary thoughts so far, consists of having these pretty sharply defined forms in which somebody enters information to create some new mentions on which we do intend to reflect.",
            "Edit and we've thought about everything from that too.",
            "Just giving somebody a blank text box and saying here tell us something new that reflects and edits and you actually have to do NLP on the edit text as well as.",
            "And other things, and I think that I don't yet have some deep insights to answer question.",
            "But I agree that this is.",
            "Your Fernando Pereira example Sri and Google.",
            "If I were the user, the evidence that I would like to include is Fernando moved.",
            "He used to work at Sri.",
            "Now we moved into it.",
            "Now it works.",
            "Google any ideas how you would handle that?",
            "I'm OK, yeah, you're right, right so.",
            "About time, but I think we haven't done so much.",
            "Yeah, I think that in the abstract.",
            "But this means that we have many databases and there's some Markov process overtime.",
            "As I said in our current experiments were not capturing motion.",
            "I wonder if it'll miss."
        ],
        [
            "Metz, also with your matrix factorization inference.",
            "I think that it could because some of these might be."
        ],
        [
            "Can't be true at the same time and so I think that.",
            "Physical reality.",
            "Additional dimension and how we?",
            "Thanks Gerhard like on this.",
            "Right, let's take the speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Knowledge.",
                    "label": 0
                },
                {
                    "sent": "Like students in there saying like awakening, and now we're all here.",
                    "label": 0
                },
                {
                    "sent": "Cortana.",
                    "label": 0
                },
                {
                    "sent": "I've been working on various different kinds of knowledge base construction for Bio NLP work.",
                    "label": 1
                },
                {
                    "sent": "This session is done and other general.",
                    "label": 0
                },
                {
                    "sent": "But our primary love is to do work on bibliometric databases, like this system that we built.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's about people and papers and institutions in conferences and journals.",
                    "label": 0
                },
                {
                    "sent": "In Branson tries to understand the full set of entities and their relation is where we're on the path to build another piece of also.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's in the world by extracting integrating information from papers and reports and credit agencies, wire and then resources, and they want to do this because he feels that if we build better tools for scientists to communicate that we can accelerate the progress of science like helping them.",
                    "label": 1
                },
                {
                    "sent": "Find reviewers and collaborators.",
                    "label": 1
                },
                {
                    "sent": "People to hire one of the first part of the system that I'm eager to build is a postdoc Finder.",
                    "label": 0
                },
                {
                    "sent": "Find people about their students and actually try to predict your graduation date so you can kind of just contact you.",
                    "label": 0
                },
                {
                    "sent": "And also for.",
                    "label": 1
                },
                {
                    "sent": "Policy deciders to understand trends in Massachusetts.",
                    "label": 0
                },
                {
                    "sent": "Also a great.",
                    "label": 0
                },
                {
                    "sent": "We'd also like to use this kind of platform to support also a platform for a new model of a potion to something that I and others such as Yahoo.",
                    "label": 1
                },
                {
                    "sent": "Nor advocating in which rather than submitting a paper to a Journal of art, disappears from the world for six months and maybe or maybe not.",
                    "label": 0
                },
                {
                    "sent": "Good review.",
                    "label": 0
                },
                {
                    "sent": "And maybe you're not making it appears in the public.",
                    "label": 0
                },
                {
                    "sent": "Instead, you supposed to have like archive where your work is available immediately and comments reviews our process that happens through comments.",
                    "label": 0
                },
                {
                    "sent": "This would actually improve their quality quality.",
                    "label": 0
                },
                {
                    "sent": "So when we think about building such a knowledge base, what do?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Boots.",
                    "label": 0
                },
                {
                    "sent": "Open universe of entities.",
                    "label": 0
                },
                {
                    "sent": "It's not just a matter of Co reference to entities that we know appear in the pedia.",
                    "label": 1
                },
                {
                    "sent": "There's maybe closed list in relation types that we care about most, although at the end of this talk I'm going to discuss in some detail something that's there is much closer resemblance to open we are users will ever really a low tolerance for errors, right?",
                    "label": 1
                },
                {
                    "sent": "They don't want to see their own paper attributed to someone else or other kinds of errors like that, but our our users would be willing to edit this knowledge base in vertical stripes.",
                    "label": 1
                },
                {
                    "sent": "And the world is changing stream of new papers appearing all the time, institutions.",
                    "label": 0
                },
                {
                    "sent": "Alright, so now let's talk about knowledge base building and what the typical steps.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As we all know, you begin trip with some text.",
                    "label": 0
                },
                {
                    "sent": "Typically we run something that finds mentions of entities in this context also defines mentions of relations among these entities in addition to text.",
                    "label": 0
                },
                {
                    "sent": "We may also have a large quantity of pre structured data and we like to integrate that as well, and all of this information goes into some resolution or coreference process in which we are resolving not just entity mentions but also in a sense, relations and relations of different types bring this all together into what we think of as.",
                    "label": 0
                },
                {
                    "sent": "The truth about entities and relations.",
                    "label": 0
                },
                {
                    "sent": "Inject this into the knowledge base and then answer queries.",
                    "label": 0
                },
                {
                    "sent": "Issue queries.",
                    "label": 0
                },
                {
                    "sent": "And I think the machine learning and NLP community is going to take great pride in the fact that on many of these individual components we have quite good accuracy.",
                    "label": 0
                },
                {
                    "sent": "This is all looking good until we realize that we know that because we're streaming these things together.",
                    "label": 0
                },
                {
                    "sent": "That is the error.",
                    "label": 0
                },
                {
                    "sent": "Snowball and .9 just raised to the third power is already not looking so good, and so we really like to be more accurate.",
                    "label": 0
                },
                {
                    "sent": "And that's really the way to do this through reason more with more uncertainty to pass multiple hypothesis through this pipeline to let later stages help us correct earlier errors and to do joint entrance through this pipeline.",
                    "label": 0
                },
                {
                    "sent": "And I really this is been topic that I.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Advocating for many years, I feel like it's a lifetimes worth of work.",
                    "label": 0
                },
                {
                    "sent": "I feel like it's really one of the fundamental issues in artificial intelligence, not just the language product supervision.",
                    "label": 1
                },
                {
                    "sent": "All these areas where there are multiple layers of abstraction, the problem is naturally divided into multiple layers of extraction.",
                    "label": 0
                },
                {
                    "sent": "So we and others have done a lot of work on various aspects of joint inference.",
                    "label": 1
                },
                {
                    "sent": "Typically neighboring components of some NLP pipeline here, and most of them at the early stages of the pipeline.",
                    "label": 0
                },
                {
                    "sent": "More recently, I really feel like the most juice from jointed friends is going to come by recently all the way through the later stages, like pipeline reasoning about the knowledge base contents and having top down reasoning help us get lower levels of the analogy pipeline correct.",
                    "label": 0
                },
                {
                    "sent": "So this brings up some challenging issues.",
                    "label": 0
                },
                {
                    "sent": "Can we represent and inject uncertainty contraction all the way into the database?",
                    "label": 1
                },
                {
                    "sent": "How can we use the database contents to help us do better instructions?",
                    "label": 1
                },
                {
                    "sent": "And Furthermore, this might be in some sense most important.",
                    "label": 0
                },
                {
                    "sent": "The information extraction is not one shot.",
                    "label": 1
                },
                {
                    "sent": "I don't get all my data up front, right have a large project documents now, but then tomorrow I'm going to get another 10,000 documents and I the additional evidence that I get from those later documents through sometimes cause me to change my mind about conclusions that I made yesterday.",
                    "label": 0
                },
                {
                    "sent": "And I don't want to have to redo all of extraction from scratch.",
                    "label": 0
                },
                {
                    "sent": "I'd like to be able to use this new evidence to help me change my mind about conclusions that I respect.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "When this extraction process runs outside of the database like this, this can be quite quite difficult.",
                    "label": 0
                },
                {
                    "sent": "In some ways.",
                    "label": 0
                },
                {
                    "sent": "I would like actually the database infrastructure to help me manage not just the storing of the results of extraction, but manage information extraction pipeline or process itself being storage immediate results.",
                    "label": 0
                },
                {
                    "sent": "Visit.",
                    "label": 0
                },
                {
                    "sent": "So with this in mind, we've been thinking about enlarging the purview of the database so that it looks like it's so there's some sense in which.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The extraction process runs inside the database and as I was just saying, intermediate results are stored inside the database.",
                    "label": 0
                },
                {
                    "sent": "Revisit them efficiently, interface.",
                    "label": 0
                },
                {
                    "sent": "And that really the only thing that gets injected into the database is not the truth, but the raw evidence.",
                    "label": 0
                },
                {
                    "sent": "The raw data that we have.",
                    "label": 0
                },
                {
                    "sent": "And so in some sense, it which is you points is like customer logical philosophy, which says you don't get to observe the truth.",
                    "label": 0
                },
                {
                    "sent": "You only observe evidence and it's up to your inference to discover what the truth is.",
                    "label": 0
                },
                {
                    "sent": "So we've taken to calling temper Proton official logical database never injected the truth, evidence and truth discovering inference happens in some sense inside.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "In some sense, you can think that this is.",
                    "label": 0
                },
                {
                    "sent": "We've just moved around some of the boundaries of our system and some, and that's true in a way.",
                    "label": 0
                },
                {
                    "sent": "But this really this worldview provides quite a different way of thinking and create some new opportunities, and some new scientific research angles that we're extremely excited and I want to briefly run through some of these things so.",
                    "label": 0
                },
                {
                    "sent": "One is that human edits that I was talking about earlier can be seen as just an additional kind of evidence.",
                    "label": 0
                },
                {
                    "sent": "So rather than that.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Additional routes in which a human edit consists of reaching into the database, erasing the former.",
                    "label": 0
                },
                {
                    "sent": "Choose writing a new value in, keeping with edit histories.",
                    "label": 0
                },
                {
                    "sent": "I need to do it necessary instead of human edit is a committee document, says well On this date.",
                    "label": 0
                },
                {
                    "sent": "This person said this thing was true and that evidence participates in truth discovery alongside.",
                    "label": 0
                },
                {
                    "sent": "So this really helps us, because sometimes humans can grow more, they can disagree, or they can be out of date.",
                    "label": 0
                },
                {
                    "sent": "The machine extraction process to be able to.",
                    "label": 0
                },
                {
                    "sent": "Sometimes human might make it correct, like a good correction within six months later in the state of the world changes and like.",
                    "label": 0
                },
                {
                    "sent": "Machine extraction process to build the human, sometimes an and this also allows us to reason in an integrated way about those truth discovery.",
                    "label": 0
                },
                {
                    "sent": "End about the reliability.",
                    "label": 0
                },
                {
                    "sent": "So another is never ending infants.",
                    "label": 1
                },
                {
                    "sent": "Because this extraction pipeline is not outside of the database, but inside these entries are not locked in knowledge base entries can always be considered more evidence or times for some sense of it.",
                    "label": 1
                },
                {
                    "sent": "You should think that inference is running until bubbling and constantly in the background instead of this.",
                    "label": 0
                },
                {
                    "sent": "Another is that resolution is.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The foundational year, and I mean not just entity resolution but also resolution of ontologies, schemas and relations that may come from from the structured data that we have available.",
                    "label": 1
                },
                {
                    "sent": "It's also especially relevant here in an epistemologically database where you can only really touch the database.",
                    "label": 0
                },
                {
                    "sent": "From this end is from from from the outside, and entities are are are things discovered by inference inside of the database and entities are kind of are ephemeral.",
                    "label": 0
                },
                {
                    "sent": "Objects right?",
                    "label": 0
                },
                {
                    "sent": "We could be changing their mind about which mentions belong together.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Even the queries that come in are the way those are expressed in terms of mentions which that need to be resolved.",
                    "label": 0
                },
                {
                    "sent": "Another aspect is resource bound information.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you look at our knowledge base and we see that we have some holes.",
                    "label": 0
                },
                {
                    "sent": "Missing field values or some missing rows rather than fully processed entire when we can, in some focused way, issue queries that go out to the web and do very focused processing.",
                    "label": 0
                },
                {
                    "sent": "Just continue.",
                    "label": 0
                },
                {
                    "sent": "Another is that we were going to try to operate at large scale that we should be thinking deeply about parallelism and doing some work which I've described in it.",
                    "label": 0
                },
                {
                    "sent": "Which we don't really think.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About map reduce as a black box, but try to reason and integrated way about machine learning, inference and parallelism and do these things together in a way that gives us quite nicely.",
                    "label": 0
                },
                {
                    "sent": "Handsome.",
                    "label": 0
                },
                {
                    "sent": "Much about what I mean by storing uncertainty inside the knowledge base, and I'll say more about this minute, but let me.",
                    "label": 0
                },
                {
                    "sent": "Safe and also a number of the models that we've been using so far.",
                    "label": 0
                },
                {
                    "sent": "The graphical models are so complicated and it's really quite hard to do message passing based in Trencin.",
                    "label": 0
                },
                {
                    "sent": "Then we doing quite work that work with MCMC sampling and.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With this in mind, a lot of our work so far has means that, well, in this knowledge base we're storing, actually are in contiguous samples samples.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The truth an inference consists of many parallel inference workers visiting the knowledge base when interest workers angle give me a copy of these 10,000 variables, I'll do some inference work on that.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Have",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Samples of new values right?",
                    "label": 0
                },
                {
                    "sent": "Those decks.",
                    "label": 0
                },
                {
                    "sent": "The knowledge base.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Biscuits rise to a lot of juicing research issues and how to do focus sampling.",
                    "label": 0
                },
                {
                    "sent": "How do resolution multiple parallel inference workers they could be working on it or not in fact represent some certainty inside the knowledge base?",
                    "label": 0
                },
                {
                    "sent": "Alright, alright so this is my background context and with this in mind I want to talk about.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or research.",
                    "label": 0
                },
                {
                    "sent": "Didn't have time to talk about sample Reg, which is a method of parameter estimation that's embedded in the MCMC process.",
                    "label": 0
                },
                {
                    "sent": "State of the art results and can be very, very fast.",
                    "label": 0
                },
                {
                    "sent": "But if you'd like to talk about that later.",
                    "label": 0
                },
                {
                    "sent": "Let's just get directly into entity resolution.",
                    "label": 1
                },
                {
                    "sent": "So here we're going to talk about entity Resolu.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then thinking about this in a very integrated way with parallel distributed processing and certain kind of model structure choices and how they influence efficiency.",
                    "label": 0
                },
                {
                    "sent": "So if you want to do.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Non greedy entity resolution where you don't know the number of entities in advance like the Now classic way to do this is by building models in which you measure pairwise affinity's between mentions.",
                    "label": 0
                },
                {
                    "sent": "So here the blue dots are getting in for mentions of entities and the yellow ovals are representing my current hypothesis about how things will be partitioned into entities and the lines are representing these pairwise compatibility that I'm measuring to decide which partitioning seems like.",
                    "label": 0
                },
                {
                    "sent": "And the way the inference often works in these models is that I would consider some men.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Like this one, and consider the possibility of coming it from the one entity to another and I.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In order to.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Assess whether I think this is a good idea.",
                    "label": 0
                },
                {
                    "sent": "I look at the incompatibilities on the edges that are affected by that move and store them.",
                    "label": 0
                },
                {
                    "sent": "I might also consider some other mention.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Discord, at least.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I can notice that even though there are edges that go fully across the model, the edges that need to be evaluated for assessing these moves are really quite a bit more limited.",
                    "label": 0
                },
                {
                    "sent": "They don't have anything to do with each other, and that they can be evaluated and accept it separately and in parallel, not even on separate machines.",
                    "label": 1
                },
                {
                    "sent": "And it's this intuition that formed the basis of some work that's missing during internships at Google, which we did exactly this in which we.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Other large set of mentions they go to some distribution process and spread them out over 1000 machines.",
                    "label": 0
                },
                {
                    "sent": "Within each machine we do these MCM steps among the data that's available on that machine arrive at some new resolution conclusions.",
                    "label": 0
                },
                {
                    "sent": "Send the data back to the distributor which we scrambles the data so that new data can have chances interact in new ways and.",
                    "label": 0
                },
                {
                    "sent": "We found the second guy.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We got some nice chunks inefficiency where higher is better accuracy.",
                    "label": 0
                },
                {
                    "sent": "Time is running along the axis.",
                    "label": 0
                },
                {
                    "sent": "Here we go from one second to the next, looking good.",
                    "label": 0
                },
                {
                    "sent": "As we had more CPUs, we have pretty serious dimensioning returns, so this is actually not looking all that great.",
                    "label": 0
                },
                {
                    "sent": "So what we're going to do is add a bit more.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To a structure with it more to the model.",
                    "label": 0
                },
                {
                    "sent": "By doing so, here we have entities and mention is shown in.",
                    "label": 0
                },
                {
                    "sent": "These colors were also going to add a notion of what will call a super entity, wishing that you could think of as it recursive clustering of the entities themselves.",
                    "label": 0
                },
                {
                    "sent": "If I were to merge two entities, which entities would diverge?",
                    "label": 0
                },
                {
                    "sent": "Sounds like these crazy boxes will go around.",
                    "label": 0
                },
                {
                    "sent": "And these super entities provide infer a good.",
                    "label": 0
                },
                {
                    "sent": "Data distribution for how I should distribute my my data across machines so that I have.",
                    "label": 1
                },
                {
                    "sent": "Similar sets of entities going to the same machines that interact.",
                    "label": 0
                },
                {
                    "sent": "I will also add an ocean of water called sub entities or further divisions within an entity and you can think of these as hypothesized splits they were going to split this entity.",
                    "label": 0
                },
                {
                    "sent": "Where would I slip this and these sub entities?",
                    "label": 0
                },
                {
                    "sent": "And for good block moves this is capturing a notion of some mentions that are so similar to each other that if I were going to move them I should move them over here.",
                    "label": 1
                },
                {
                    "sent": "And what's interesting to me about this is that we're using a recursively structured model to do inference not only about truth discovery, but simultaneously about inference.",
                    "label": 1
                },
                {
                    "sent": "For the sake of strategizing about how the data should be distributed.",
                    "label": 0
                },
                {
                    "sent": "And when we do this blue.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is that the best one of our previous methods?",
                    "label": 0
                },
                {
                    "sent": "And now when we?",
                    "label": 0
                },
                {
                    "sent": "Super handsome entity.",
                    "label": 0
                },
                {
                    "sent": "But in some newer can do even better than this.",
                    "label": 0
                },
                {
                    "sent": "With the following.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Will remove.",
                    "label": 0
                },
                {
                    "sent": "We will not have any pairwise compatibility measures on dimensions at all.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And and take these entities which are having in the past been.",
                    "label": 0
                },
                {
                    "sent": "Latent in representing the partitioning of mention themselves and pull them up into these are the first class objects.",
                    "label": 0
                },
                {
                    "sent": "These representatives of the entities that.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cells and measure compatibility from the mentions to these inverted entities instead, so gathered in these.",
                    "label": 0
                },
                {
                    "sent": "Entities will be at various.",
                    "label": 0
                },
                {
                    "sent": "Attributes of the entities which we've pulled from dimensions to which they've been.",
                    "label": 0
                },
                {
                    "sent": "Current.",
                    "label": 0
                },
                {
                    "sent": "Design inference will consist as it did before of moving mentions from when it into another moving one of ARX 2 new entities and and I can also in a model like this have a notion of sub entities and super entities in hierarchy.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is a subject of.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We find that it's significantly more efficient or weddings end square factors.",
                    "label": 1
                },
                {
                    "sent": "We can do joint inference on all of the attributes of an entity because they've all been gathered together in one place, whereas previously been distributed across the pairs.",
                    "label": 1
                },
                {
                    "sent": "We can efficiently handle cases in which there are some entities that have a very large number of mentions, and any of these mentions can be hidden in lower layers of the hierarchy and don't have to be examined that we're making later.",
                    "label": 0
                },
                {
                    "sent": "Decisions.",
                    "label": 1
                },
                {
                    "sent": "This structure of the model of white certain technical problems that sometimes arise in conditional random field changes in network cardinality between training and testing time.",
                    "label": 0
                },
                {
                    "sent": "And this kind of model also better supports and it's incredible.",
                    "label": 0
                },
                {
                    "sent": "Results.",
                    "label": 0
                },
                {
                    "sent": "Here the red.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mine is.",
                    "label": 0
                },
                {
                    "sent": "The best result from the previous model that had super inside entities, but pairwise comparison dramatic difference in proficiency accuracy here.",
                    "label": 0
                },
                {
                    "sent": "This is 145 thousand mentioned before mentions.",
                    "label": 0
                },
                {
                    "sent": "Dramatic, currently running this event data with the 90 million mentions.",
                    "label": 0
                },
                {
                    "sent": "So we've also been running this kind of model on.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Newswire in Wikipedia data, which will combine structured data that we get from Freebase with unstructured data times.",
                    "label": 1
                },
                {
                    "sent": "So here we.",
                    "label": 0
                },
                {
                    "sent": "Take Freebase or Wikipedia into.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "He's an pre populate this hierarchical structure with the data from there, so we will take probably create some entities for the many different string forms that we get from links and redirects within this construction paper.",
                    "label": 0
                },
                {
                    "sent": "So things form submit, he's and then from full text we can extract.",
                    "label": 0
                },
                {
                    "sent": "Then you mentioned add these mentions to the model and coreference in which will not only assign these mentions.",
                    "label": 0
                },
                {
                    "sent": "Two entities that we know about previously but discover cases where.",
                    "label": 0
                },
                {
                    "sent": "We are seeing mentions that we hypothesize don't belong anywhere here previously.",
                    "label": 0
                },
                {
                    "sent": "Currently doing this on not such a large set, but about 100,000.",
                    "label": 0
                },
                {
                    "sent": "So in HD resolution.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just in the abstract are many juicy research issues at the intersection between machine learning and systems and very fruitful area for research for future research.",
                    "label": 0
                },
                {
                    "sent": "Formalizing notions of asynchronous distributed Markov chain Monte Carlo processes.",
                    "label": 1
                },
                {
                    "sent": "Methods for how to select subsets of variables for sampling lightworker, engine scaling, and preference.",
                    "label": 1
                },
                {
                    "sent": "Next chapter.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Property for humans.",
                    "label": 0
                },
                {
                    "sent": "So let's look at this in the context of entity resolution in the end.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And let's say that in the current system we have yellow areas mentioning this, capturing undercurrent notion of entities and let's say their current system thinks that we have one extra here, which is a friend of prayer.",
                    "label": 0
                },
                {
                    "sent": "Obviously Google and what we think at the moment is a different Fernando Pereira social with Sri.",
                    "label": 0
                },
                {
                    "sent": "A human looks like this is well, actually.",
                    "label": 0
                },
                {
                    "sent": "I know that those are the same person that had somehow like to tell the system again, see.",
                    "label": 0
                },
                {
                    "sent": "And what we don't want to do is have a human just say, well numbers take this edge and somehow tell them that these things should be merged.",
                    "label": 0
                },
                {
                    "sent": "Nodes that we want the human to do this by introducing some new evidence that will cause inference to to come to that conclusion itself.",
                    "label": 0
                },
                {
                    "sent": "So what that looks like is that the human editor adds effectively 2 new mentions.",
                    "label": 0
                },
                {
                    "sent": "Here's a.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Amanda Pereira in filiation is Google and the research.",
                    "label": 0
                },
                {
                    "sent": "She's learning how to pee.",
                    "label": 0
                },
                {
                    "sent": "And then here's another mention of a fanatic proliferation right with some slightly different research topics we.",
                    "label": 0
                },
                {
                    "sent": "And that's that the human expresses some notion that, well, I prefer that these two mentions end up in the same.",
                    "label": 0
                },
                {
                    "sent": "So next inference runs on these mentions independently, ignoring that link.",
                    "label": 0
                },
                {
                    "sent": "Evidently, you'll get coreference like this and then the MCMC scoring process is set up to prefer proposals whose.",
                    "label": 0
                },
                {
                    "sent": "Cause entities that obey those.",
                    "label": 0
                },
                {
                    "sent": "Constraints, constraints but preferences.",
                    "label": 0
                },
                {
                    "sent": "So that later, when CMC said considers a proposal that looks like this.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Taking this entity and now turning into a sub entities and already this is the same as the center here at this kind of move will be scored more highly because.",
                    "label": 0
                },
                {
                    "sent": "Other people could add human edits that may disagree with this so people could add human edits that are actually quite noisy and will do it sometime.",
                    "label": 0
                },
                {
                    "sent": "So we have some new experimental results with.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It will be presented.",
                    "label": 0
                },
                {
                    "sent": "I'm rich.",
                    "label": 0
                },
                {
                    "sent": "Overwrite method.",
                    "label": 0
                },
                {
                    "sent": "Just makes direct link changes to place links.",
                    "label": 0
                },
                {
                    "sent": "Doesn't make that much of a difference.",
                    "label": 0
                },
                {
                    "sent": "Obey some local transitivity.",
                    "label": 0
                },
                {
                    "sent": "We can do a bit better, but we reason in a more global sense about this.",
                    "label": 0
                },
                {
                    "sent": "And that if we.",
                    "label": 0
                },
                {
                    "sent": "Project edits that are.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Noisy that are wrong because we're not just taking it said it's always incorporating that.",
                    "label": 0
                },
                {
                    "sent": "It's been recently about them that.",
                    "label": 0
                },
                {
                    "sent": "As more and more error full edits are made that we can preserve some accuracy for quite some time before accuracy folds.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we are interested in.",
                    "label": 0
                },
                {
                    "sent": "How to do efficient forward chaining given new evidence of some of these edits and how to be more robust to noise?",
                    "label": 1
                },
                {
                    "sent": "How to deal with streaming inputs in some cases in which will have so many mentions or so many edits that will want to keep some of them toss others?",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Charger.",
                    "label": 0
                },
                {
                    "sent": "So there are several styles of relation extraction that have been done and.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You don't work.",
                    "label": 0
                },
                {
                    "sent": "So one, of course, is vanilla supervised, in which somebody gives you a schema in advance.",
                    "label": 0
                },
                {
                    "sent": "They also give you some label data.",
                    "label": 0
                },
                {
                    "sent": "Matching that schema and then at Test time given new instance and remodel hopefully produces something good.",
                    "label": 0
                },
                {
                    "sent": "Label data extract.",
                    "label": 0
                },
                {
                    "sent": "Massive pain to get this kind of label data and so we'd like to consider some alternatives and one alternative is.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Super Bowls from data that might be freely available to us already, such as a pre existing large structured knowledge base like Freebase or.",
                    "label": 0
                },
                {
                    "sent": "So here again, we have some ontology that so it's.",
                    "label": 0
                },
                {
                    "sent": "With the database.",
                    "label": 0
                },
                {
                    "sent": "Have a large, unlabeled textual document.",
                    "label": 0
                },
                {
                    "sent": "Find places in the text where certain facts that we know about from the database has been rendered in text and align them with each other.",
                    "label": 0
                },
                {
                    "sent": "This alignments effectively labeled piece of text from which we can then train machine learning models.",
                    "label": 0
                },
                {
                    "sent": "And then run that model and more text discovered.",
                    "label": 0
                },
                {
                    "sent": "But this requires that we have large set stuff.",
                    "label": 0
                },
                {
                    "sent": "Pre structured data or that we find a set like this with an ontology that matches with care about, and maybe that doesn't match.",
                    "label": 0
                },
                {
                    "sent": "This fight so more completely unsupervised, which happened to be open.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Text coming in.",
                    "label": 0
                },
                {
                    "sent": "Run a dependency parse or some approximation to a dependency.",
                    "label": 1
                },
                {
                    "sent": "Parts over this text and then directly pull out the words from the sentence into something that you called.",
                    "label": 0
                },
                {
                    "sent": "Mixed regulations.",
                    "label": 0
                },
                {
                    "sent": "Classic version of this then has issues that, well, I'm extracting the surface form that the sentence says.",
                    "label": 0
                },
                {
                    "sent": "Somebody attended Harvard, but that may not be that I don't know that that's the same thing as affiliated and so there can be some sparsity problems here.",
                    "label": 0
                },
                {
                    "sent": "So for this reason.",
                    "label": 0
                },
                {
                    "sent": "Ornament and others have done work, then on doing some unsupervised clustering to try to discover these kinds of synonyms where.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Discover Wells affiliated and attendees we need sort of the same thing and so I can have better coverage.",
                    "label": 0
                },
                {
                    "sent": "But he's kind of unsupervised.",
                    "label": 0
                },
                {
                    "sent": "This is Patrick.",
                    "label": 0
                },
                {
                    "sent": "And others have been working in.",
                    "label": 0
                },
                {
                    "sent": "Can be sort of slippery right there, a bit arbitrary.",
                    "label": 0
                },
                {
                    "sent": "They can be hard to evaluate.",
                    "label": 1
                },
                {
                    "sent": "We may argue that well, if somebody offered a paper they wrote a paper, they published the paper and these are really synonyms and we're happy to say that these mean all the same thing, but to say that.",
                    "label": 1
                },
                {
                    "sent": "Tennessee University is not to be the same as saying that they are a professor at the University.",
                    "label": 0
                },
                {
                    "sent": "Students are not really synonyms and they don't.",
                    "label": 0
                },
                {
                    "sent": "There's not a bidirectional implicature.",
                    "label": 0
                },
                {
                    "sent": "Actually, really.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Any schema that we would pick is going to be incomplete and have many boundary cases to it.",
                    "label": 1
                },
                {
                    "sent": "Card reading assignment.",
                    "label": 0
                },
                {
                    "sent": "This came up earlier in the conference losing that already asked, hoping the question matters.",
                    "label": 1
                },
                {
                    "sent": "If I talked, where do these relation types?",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "Organs.",
                    "label": 0
                },
                {
                    "sent": "Intelligent.",
                    "label": 0
                },
                {
                    "sent": "So there are people like the folks at Freebase have worked hard to build an ontology that cover a lot of things, but.",
                    "label": 0
                },
                {
                    "sent": "Still, there are going to be things that we may care about.",
                    "label": 0
                },
                {
                    "sent": "It would be missing from that image and augmenting ontology.",
                    "label": 0
                },
                {
                    "sent": "So quite recently.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sebastian.",
                    "label": 0
                },
                {
                    "sent": "Thinking about something that we refer to as a universal schema.",
                    "label": 1
                },
                {
                    "sent": "So in an open.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Incense will take the schema to be the union of all inputs from natural language and from databases, so will embrace or the diversity ended.",
                    "label": 1
                },
                {
                    "sent": "Ambiguity of the original input form of language and not try to force that we need by these relations into something to some fixed predefined boxes.",
                    "label": 1
                },
                {
                    "sent": "And some of this I think is well aligned with a statement that commanders like to make it past.",
                    "label": 0
                },
                {
                    "sent": "If there were a useful concept then.",
                    "label": 0
                },
                {
                    "sent": "Speakers of English language would have invented the word capture and so just use the original words to being.",
                    "label": 0
                },
                {
                    "sent": "Just going down what's the word for that idea?",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "You are on the spot.",
                    "label": 0
                },
                {
                    "sent": "I don't know yet.",
                    "label": 0
                },
                {
                    "sent": "But they haven't shown that it's usually actually let me show it's useful then, maybe when.",
                    "label": 0
                },
                {
                    "sent": "And but then we'd also like to, so this gives us a very sort of sparse view of what all these things mean.",
                    "label": 0
                },
                {
                    "sent": "So to address this, sparsity would like to learn implicature among these entity relations, in order to fill in things also that we don't observe, and so the way that an initial way that we've been thinking about this can be visualized in the following sense.",
                    "label": 0
                },
                {
                    "sent": "Imagine a huge table.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With entity pairs in the road over on the left and then these will be user entities not mentioned.",
                    "label": 0
                },
                {
                    "sent": "And then in the columns are these many different relation types and many of them shown in yellow.",
                    "label": 0
                },
                {
                    "sent": "There are really just the surface textual form of these relations, just like we come from open.",
                    "label": 0
                },
                {
                    "sent": "And and then, you know, we'll also throw in structured data as well, and those come in their own ontology, so these will form some additional columns that come from construction relations at the base or.",
                    "label": 0
                },
                {
                    "sent": "But there will be a large number in some of our preliminary experiments, 22,000 and four.",
                    "label": 0
                },
                {
                    "sent": "And then we go to Texans knowledge base and you can see that some of these are observed.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we can just go in.",
                    "label": 0
                },
                {
                    "sent": "And but then, what we'd like to do is fill in the rest of this this knowledge base as well, and will do this by modeling this matrix and filling it in with the kinds of methods that have been quite successful in Netflix, Netflix.",
                    "label": 0
                },
                {
                    "sent": "You also have a very large matrix that's extremely sparse.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Well, there, and so we've started with some methods based on devices, components, analysis which we're making some documentations that are specialized for this kind of application or everywhere.",
                    "label": 0
                },
                {
                    "sent": "And so this effectively fills in the rest of the matrix of these lighter shades in which we can see.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, even though we didn't observe in text directly that Obama is the leader of the United States, we infer this and maybe.",
                    "label": 0
                },
                {
                    "sent": "The model discovered that this was a good idea is solid.",
                    "label": 0
                },
                {
                    "sent": "President of Russia.",
                    "label": 0
                },
                {
                    "sent": "Many other colleagues, including ones not showing it to help us arrive.",
                    "label": 0
                },
                {
                    "sent": "At the same time.",
                    "label": 0
                },
                {
                    "sent": "See things like.",
                    "label": 0
                },
                {
                    "sent": "The top members in their release Medicine culture membership organizations not heads of State, and that will really.",
                    "label": 0
                },
                {
                    "sent": "Will embrace some of the original ambiguity, right?",
                    "label": 0
                },
                {
                    "sent": "So like here's Chancellor Oven, his chancellor country in his chance for University.",
                    "label": 0
                },
                {
                    "sent": "And those, maybe those mean little bit different things.",
                    "label": 0
                },
                {
                    "sent": "But those are the same surface form.",
                    "label": 0
                },
                {
                    "sent": "And some of those the differences in those meaning will show up in other additional columns that say something about their responsibility.",
                    "label": 0
                },
                {
                    "sent": "So let me show you some examples of pieces of this matrix as they come out from from some field data.",
                    "label": 0
                },
                {
                    "sent": "So here we infer.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sure that even folks criticize George Bush.",
                    "label": 0
                },
                {
                    "sent": "Synonym situation here's a more.",
                    "label": 0
                },
                {
                    "sent": "Should we observe you further?",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Volvo owns a percentage in.",
                    "label": 0
                },
                {
                    "sent": "From having observed it.",
                    "label": 0
                },
                {
                    "sent": "And here's another case that makes this point that we're not.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just learning synonyms or clusterings with the divide affectional, but we have some asymmetric notion here, so we by observing that Kevin Boyle is at historian at Ohio State, we infer that he's professor at Ohio State.",
                    "label": 1
                },
                {
                    "sent": "But when we observe that Freeman is a professor at Harvard, we don't necessarily infer historian.",
                    "label": 0
                },
                {
                    "sent": "So this is I see this says this is different from.",
                    "label": 0
                },
                {
                    "sent": "Learning mappings just among these relation types in the abstract like this relation always means this other kind of relation is true or reasoning simultaneously about the relations of the individual concerns.",
                    "label": 0
                },
                {
                    "sent": "At the same time, and many relations that these entity pairs would have an even better about exceptions in my life.",
                    "label": 0
                },
                {
                    "sent": "So these are very preliminary.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The initial efforts, but we're running on 20 years of New York Times, from which we get 50,000 entity pairs and about 20,000 interpolation surface forms, throwing freebase as well and.",
                    "label": 1
                },
                {
                    "sent": "Here are some preliminary results.",
                    "label": 0
                },
                {
                    "sent": "I think that in comparison with a lot of other systems that are extracting relations, including things like alignments against Freebase, once you get up into recall levels that are in 50s or above above 15, that's these precision numbers are actually quite low in line.",
                    "label": 0
                },
                {
                    "sent": "So I'm just about every time so.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Summary this approach within this approach we're embracing diversity and unity of the original intent of forcing these boxes for reasoning about entities and relations together.",
                    "label": 0
                },
                {
                    "sent": "It's not an abstract relation.",
                    "label": 1
                },
                {
                    "sent": "Relation mapping.",
                    "label": 0
                },
                {
                    "sent": "The user can then.",
                    "label": 0
                },
                {
                    "sent": "Query this knowledge base without needing to study your understand some limited schema.",
                    "label": 0
                },
                {
                    "sent": "You can ask in whatever language they want too, and we probably have a column for that somewhere in that column.",
                    "label": 1
                },
                {
                    "sent": "And probably I think the way we think about this is that.",
                    "label": 0
                },
                {
                    "sent": "It's best to try to model and predict the original expression pattern.",
                    "label": 1
                },
                {
                    "sent": "Well defined database path and not to try to create models of semantic difference.",
                    "label": 0
                },
                {
                    "sent": "They really think are loose.",
                    "label": 0
                },
                {
                    "sent": "So this is related to.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also related to this country methods I described dispenser, quite related work which work actually mentioned earlier this also.",
                    "label": 0
                },
                {
                    "sent": "Discovery rules to fill these these things and most of what I've seen there is you can try to recent directly about their relations without looking at mixed together on this small error.",
                    "label": 0
                },
                {
                    "sent": "That move.",
                    "label": 0
                },
                {
                    "sent": "So we're next going to be.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Incorporating relations with different arodys, integrating more background knowledge, scaling up.",
                    "label": 0
                },
                {
                    "sent": "Final conclusion I.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Advertisement.",
                    "label": 0
                },
                {
                    "sent": "Before for factory, so you know we've been working on very complicated graphical.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Levels of research was really slowed down by implementing these things by hand and.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to accelerate our research, we've been working on.",
                    "label": 0
                },
                {
                    "sent": "Tools that will help.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Quicker fucker hearing about machine learning models.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Probably.",
                    "label": 0
                },
                {
                    "sent": "Interest to specify which complicated models using the full power of the kinds of benefits were used to having indeterminate programming languages.",
                    "label": 1
                },
                {
                    "sent": "Good useful data structures and control mechanisms that abstraction and built the system.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Factory, which is a general tool kit for graphical models that's intended to be scalable enough, could actually deploy the kind of scales that we care about this workshop.",
                    "label": 0
                },
                {
                    "sent": "It's object oriented in which various factors influence.",
                    "label": 0
                },
                {
                    "sent": "Marketing efforts.",
                    "label": 0
                },
                {
                    "sent": "Are all objects and modified by inheritance.",
                    "label": 0
                },
                {
                    "sent": "Perative flexibility in the way we construct into operations on that performance is imbedded in general purpose programming language which mixed together the model definitions that was pre processing the data and various.",
                    "label": 0
                },
                {
                    "sent": "Diagnostic machines would actually represented the full programming language scalable.",
                    "label": 0
                },
                {
                    "sent": "Database.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Few minutes for question.",
                    "label": 0
                },
                {
                    "sent": "Whole host of really exciting ideas in there, so I think it was great talking just picking.",
                    "label": 0
                },
                {
                    "sent": "I sense that it could trigger.",
                    "label": 0
                },
                {
                    "sent": "I really not really like the vision.",
                    "label": 0
                },
                {
                    "sent": "I mean making it actually run scalable.",
                    "label": 0
                },
                {
                    "sent": "I think is the question, but just to pick up one particular topic on the universal schemas cookout polysemy.",
                    "label": 0
                },
                {
                    "sent": "Ah, OK, so.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Now we're using just a surface form to represent itself, and I think that.",
                    "label": 0
                },
                {
                    "sent": "The sense in which.",
                    "label": 0
                },
                {
                    "sent": "There are some different subtle meetings here then that would be captured by some other kinds of columns, right?",
                    "label": 0
                },
                {
                    "sent": "So let me exist.",
                    "label": 0
                },
                {
                    "sent": "So I mean like like let's let's take the chance for example, that was there.",
                    "label": 0
                },
                {
                    "sent": "So you can ask, well, is Crimson the chancellor of MIT?",
                    "label": 0
                },
                {
                    "sent": "Well, you know the answer is yes, the chance to have more than one meeting, yes, but it's still true.",
                    "label": 0
                },
                {
                    "sent": "And that's where this morning in any way that Felicity mattered.",
                    "label": 0
                },
                {
                    "sent": "Well, that's going to be captured by difference in somehow.",
                    "label": 0
                },
                {
                    "sent": "Does that happen?",
                    "label": 0
                },
                {
                    "sent": "So I wanted to just ask you more about the UI issues and human editing that you are talking about.",
                    "label": 0
                },
                {
                    "sent": "Specifically, in some scenarios level of generalization becomes very critical, so user gives an information.",
                    "label": 0
                },
                {
                    "sent": "These two affiliations at the same.",
                    "label": 0
                },
                {
                    "sent": "That could be because the company bought another company.",
                    "label": 0
                },
                {
                    "sent": "So all affiliations are the same or just this person has dual apps, applications or even these kind of people have dual affiliations.",
                    "label": 0
                },
                {
                    "sent": "So there are multiple levels.",
                    "label": 0
                },
                {
                    "sent": "Realities in which each your information can be generalized.",
                    "label": 0
                },
                {
                    "sent": "Have you thought about it?",
                    "label": 0
                },
                {
                    "sent": "How would the user give that kind of information?",
                    "label": 0
                },
                {
                    "sent": "How you might be able to gracefully degrade it?",
                    "label": 0
                },
                {
                    "sent": "These are really interesting, but these are great questions, and once they were eager to try to address our preliminary thoughts so far, consists of having these pretty sharply defined forms in which somebody enters information to create some new mentions on which we do intend to reflect.",
                    "label": 0
                },
                {
                    "sent": "Edit and we've thought about everything from that too.",
                    "label": 0
                },
                {
                    "sent": "Just giving somebody a blank text box and saying here tell us something new that reflects and edits and you actually have to do NLP on the edit text as well as.",
                    "label": 0
                },
                {
                    "sent": "And other things, and I think that I don't yet have some deep insights to answer question.",
                    "label": 0
                },
                {
                    "sent": "But I agree that this is.",
                    "label": 0
                },
                {
                    "sent": "Your Fernando Pereira example Sri and Google.",
                    "label": 0
                },
                {
                    "sent": "If I were the user, the evidence that I would like to include is Fernando moved.",
                    "label": 0
                },
                {
                    "sent": "He used to work at Sri.",
                    "label": 0
                },
                {
                    "sent": "Now we moved into it.",
                    "label": 0
                },
                {
                    "sent": "Now it works.",
                    "label": 0
                },
                {
                    "sent": "Google any ideas how you would handle that?",
                    "label": 0
                },
                {
                    "sent": "I'm OK, yeah, you're right, right so.",
                    "label": 0
                },
                {
                    "sent": "About time, but I think we haven't done so much.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I think that in the abstract.",
                    "label": 0
                },
                {
                    "sent": "But this means that we have many databases and there's some Markov process overtime.",
                    "label": 0
                },
                {
                    "sent": "As I said in our current experiments were not capturing motion.",
                    "label": 0
                },
                {
                    "sent": "I wonder if it'll miss.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Metz, also with your matrix factorization inference.",
                    "label": 0
                },
                {
                    "sent": "I think that it could because some of these might be.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Can't be true at the same time and so I think that.",
                    "label": 0
                },
                {
                    "sent": "Physical reality.",
                    "label": 0
                },
                {
                    "sent": "Additional dimension and how we?",
                    "label": 0
                },
                {
                    "sent": "Thanks Gerhard like on this.",
                    "label": 0
                },
                {
                    "sent": "Right, let's take the speaker again.",
                    "label": 0
                }
            ]
        }
    }
}