{
    "id": "aikak3aafhbnn6k7qiwivdcafint4fy4",
    "title": "At the Intersection of Data Science and Language",
    "info": {
        "author": [
            "Kathleen McKeown, Department of Computer Science, Columbia University"
        ],
        "published": "Nov. 10, 2016",
        "recorded": "October 2016",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2016_mckeown_data_science/",
    "segmentation": [
        [
            "Thanks Paul.",
            "I wanted to start by thanking you Landon Paul for asking, inviting me here today.",
            "I also wanted to thank the local Arrangement Committee for their gracious welcome to Japan.",
            "I I thought I would also say thank you to the Japanese people.",
            "When I entered I it was such a wonderful experience and really contrasted heavily with my day-to-day experience in New York.",
            "This is my first time here at the Semantic Web conference and I'm excited to learn about what you're all doing.",
            "So we're all aware of the large amount vast amount of of language that is available on the web, and we know that it figures heavily in.",
            "The everyday experience of users in online interaction.",
            "At the same time, we see the field date of data science which is springing up everywhere an IT promises solutions to a variety of tasks by applying data science techniques to large amounts of data.",
            "Today I'm going to talk about the use of data science techniques and a number of different applications using online language.",
            "These are applications that we've developed over the last five.",
            "Years or so.",
            "And I'll note that I'm swapped in and out some applications from those that I mentioned in my abstract, so I hope you're all OK with that."
        ],
        [
            "So my work fits in the data science context at the Institute at Columbia with."
        ],
        [
            "Then what we call the new Media Center and they're we're working on developing tools and talents to enhance communications.",
            "An interactions within communities."
        ],
        [
            "My own vision is to develop systems that can generate presentations that connect events, opinions, personal accounts, and their impact on the world."
        ],
        [
            "In all of the work that I'm going to talk about today, I take a machine learning or data science framework.",
            "We take data.",
            "It's often labeled with what the output for the task should be.",
            "We extract features from this text data and this is where the natural language comes to play.",
            "And we use those features to predict our output for the task."
        ],
        [
            "I'm not a machine learning person, so my interest here lies in what data is available for learning, and often how can we get it without having to manually label it with the output?",
            "And today I'm going to focus on applications where we've gathered that data from the web."
        ],
        [
            "I'm also interested in what features yield good predictions, and today I'll focus a bit on how we view semantics for those features."
        ],
        [
            "I'm going to be talking about applications that use data from a variety of different genres, and I've laid them out along a continuum from fact to fiction.",
            "So at the top of the continuum we have genres that are more objective, more factual news usually is more factual and subjective.",
            "Wikipedia descriptions, which I think are pretty objective.",
            "And as we go down, we come to genres that have more subjective information.",
            "So with personal narrative and social media, we often have a lot of opinionated.",
            "Information.",
            "And then at the bottom we get to novels which are not fact at all."
        ],
        [
            "So I'm going to start with our work on news."
        ],
        [
            "Now news has been around for quite awhile in the natural language field.",
            "Early as the 90s, the field began with annotation of large quantities of news in order to enable us to do a variety of of natural language tests and a number of them very basic tools that figure in all higher level applications.",
            "For example, it was at this point in time that parser robust parsers were first trained on on data and developed part of speech, taggers and so forth and.",
            "My work very much relies on having these tools available in order to be able to address higher level applications."
        ],
        [
            "In our work on news, I'm going to talk today about our work addressing a problem, and that is being able to identify needs during disaster.",
            "We were very much motivated to do this work after Hurricane Sandy hit New York.",
            "Most of us were worried about what was happening.",
            "Many of my students lived in these areas where the rat is where there was possible flooding, and in fact in my apartment on the Upper West Side, it became a sort of refugee for those who lived in the southern half of Manhattan.",
            "I had many people who moved up and.",
            "Stayed with me over the course of the time and I know here in Japan you've had similar experiences after the tsunami."
        ],
        [
            "So when our work we're working on developing a system that can monitor events over time, we take his input streaming data.",
            "Right now this is news or web pages we're moving towards adding social media into that, and at every hour we'd like to produce an update on what's new."
        ],
        [
            "Our goal is to get to the point where we can track events as they occur and the sub events that unfold.",
            "So, for example, after Hurricane Sandy hit we had the subevents of the blackout in the lower part of Manhattan of Fire in one of the suburbs of New York and the subway transit outage after flooding."
        ],
        [
            "So to develop our system, we have been using data that has been collected from NIST by doing a web crawl over a two year period from 2011 to 2013.",
            "I've done a crawl for.",
            "Web pages, news that have to do with various kinds of disasters which they have categorized into 11 broad categories and you can see just four of them here.",
            "So for example, protests, terrorist events, bombings, and so forth."
        ],
        [
            "And our our system takes input over the course of an hour and I'm showing just 4."
        ],
        [
            "Year but"
        ],
        [
            "In the course of an hour."
        ],
        [
            "We would actually take in many, many documents an at the end of an hour produce an update which essentially summarizes what's new in those doc."
        ],
        [
            "Kimetsu shown here.",
            "This is data within this tonn, the Guatemalan earthquake, and we see that the update tells us that a strong earthquake has hit off the Pacific coast of Guatemala, rocking the capital and shaking buildings as far away as Mexico City.",
            "So we have the event location.",
            "The magnitude of the quake and so forth."
        ],
        [
            "So our approach to produce this kind of output is a temporal summarization approach.",
            "Our system works in time slots, so at time T we predict salience for the input sentence is and we use disaster specific features in order to produce salience.",
            "We also need to remove redundant sentences both from the hour that we're looking at.",
            "But also we want to make sure that we're not repeating information that was presented.",
            "In an earlier update, will still have a lot of sentences, and so we cluster and select exemplar sentences for T and we use a clustering algorithm that allows us to incorporate salients prediction as a prior."
        ],
        [
            "So I'm going to give you some examples of some of the features that we used to predict salients.",
            "We use two kinds of language models.",
            "The first we build from a generic news corpus and this allows us to select or rank higher senses that are grammatically correct, and this is an issue that can arise when we're dealing with web content.",
            "The domain specific corpus is more interesting.",
            "We build a corpus from disaster related Wikipedia articles with a separate corpus for.",
            "Each type of disaster that we're considering.",
            "And then the domain specific language model scores sentences by how typical they are of the disaster type."
        ],
        [
            "So for example, if we look at these three sentences that come in for our.",
            "Guatemalan earthquake using the domain specific corpus for earthquakes, it would rank the first sentence as higher because it contains phrases which are typical of what we might expect to see during an earthquake like disaster management or local tsunami alert."
        ],
        [
            "That language model tells us will rank sentences higher that are typical of any event.",
            "We want to make sure that we're getting sentences that refer to the specific event under question, so we also use geographic features.",
            "We tag the input with an A."
        ],
        [
            "And entity tagger an for the location here.",
            "Nicola, Nicaragua and Mexico City, we get locations coordinates for the location and their mean distance to the event an will rank sentence is higher which are closer to the to the.",
            "Event."
        ],
        [
            "We also use semantic information and we use word net to do this, so we have.",
            "We take synonyms, Hypernyms and hyponyms of the event type and we look for them in the input so shown here.",
            "Disaster is a hypernym of earthquake.",
            "And again this would wait the first sentence higher."
        ],
        [
            "So what have we learned here?",
            "Well, we've learned that our salience predictions lead to high precision.",
            "Quickly the red line is our model using salience, and we can see that overtime the X axis shows days overtime.",
            "Precision rises quickly much more quickly than the other models that we tested it against.",
            "On the bottom, we see that salients prediction.",
            "Allow us to more quickly recover more information so less of a difference here between our clustering without salients and with with salients, but nonetheless we still see an improvement."
        ],
        [
            "So what's next?",
            "I know that somebody during the question answering.",
            "Is going to ask me about neural Nets.",
            "We are beginning experimentation with the neural net approach an we're looking at neural Nets for summarization updates an what we're eating at with this approach is abstractive summarization's where we can generate new sentence is from the phrases in our input sentences."
        ],
        [
            "OK, so let me turn now to our work on generating Wikipedia descriptions."
        ],
        [
            "And.",
            "This, I think, is the application that's closest to the kind of work that you do here.",
            "We have developed a system where we take as input RDF triples from a source such as Wikipedia, and we generate as output Wikipedia descriptions.",
            "I should."
        ],
        [
            "Say this is the work of a student who is just finishing his dissertation now.",
            "So how do Wikipedia descriptions differ from news like news?",
            "They are formal language, they're grammatical.",
            "There are perhaps more stylized format or structure than news.",
            "For certain kinds of entries, there is less varied content than what you would expect to find in news."
        ],
        [
            "So with now RDF applications that we're looking at where we have developed applications that generate descriptions of semantic web entities, and we've done that for biographies and company descriptions."
        ],
        [
            "So in both of these we can look at this as an entity for a biography, which is a type of person an, an entity for a company which is a type of company.",
            "For each, we looked at two different kinds of examples for biographies, we looked at the professions of politicians and models an for industry.",
            "We developed a system that Kim we tested in the domain of automative in video games, although I should say there's nothing specific in what we did to these two professions or industries, it should be able to apply to others."
        ],
        [
            "So in order to do the generation we use what are called templates and we have two core messages.",
            "These are messages that are built from already RDF triple Triples an.",
            "The instant entity will appear as the subject within the template, so we can see here.",
            "We have the core messages.",
            "We have two ways of expressing it.",
            "One we have the predicate of subject is.",
            "Checked or subjects predicate?",
            "Is object an this for a company like Tesla would rely on the predicate location would result in the sentence the location of Tesla is Palo Alto.",
            "Now this would be.",
            "Relatively monotonous if we generated all our sentences using these two templates."
        ],
        [
            "So one of the things that we have worked on is para phrasal template extraction.",
            "So we have we mine para phrasal templates from the domain corpus, and here we use Wikipedia and we use the taxonomy.",
            "Or ontology within.",
            "Wikipedia.",
            "To find richly typed para phrasal templates so we this is important for generation, we need to know what the type is for a slot so we can decide what are appropriate phrases to fill it and this enables us to find para phrasal templates from non paraphrase sentences."
        ],
        [
            "So let me show you how this works.",
            "Here are two sentences from the corpus.",
            "They refer to two car companies."
        ],
        [
            "First one GM, Taiwan was founded in August 1989, the second one.",
            "In 1904, the company was established as Oscar Lear Automotive Automobile Company, so these two senses refer to the are sentences that cover the same kind of RDF triple, both refering to when the company was founded.",
            "They have a company is instance Anna date, so we find the entities within the sentence and label them, and now we must.",
            "Infer what their type is within the ontology.",
            "I'm not giving you details on how we do that, although you can ask."
        ],
        [
            "And shown here from these two sentences, then we're able to get two paraphrases that convey that information an you can see this now, in addition to the core messages, gives us three ways to convey that information, and in fact, we're able to mine thousands of para phrasal templates for each domain, so we can get quite a bit of variety and how we generate.",
            "Are text."
        ],
        [
            "So show I'll show you here the example of the output that's generated by the system for a description of the company Tesla Motors an in blue are three sentences that are generated using para phrasal templates.",
            "So first we have Tesla Motors was founded by JB Straubel, Mart, Martin Eberhard and Elon Musk.",
            "Tesla Motors is a privately held company with approximately 6000 employees and in 2003 the company reorganized adapting its current name Tesla Motors."
        ],
        [
            "In the same example, in the yellow we have two sentences that were generated using the core messages, so those do get used in our output and the fact that they're not heavily used makes for good text."
        ],
        [
            "We have extended this approach so in addition to doing generation using templates from the triples, we also use a hybrid where we see whether we can augment those with information drawn from the web.",
            "So this is the summarization approach and we're looking at finding all relevant sentence is that match the entity and or contain RDF triples.",
            "So in sentences like these we might match multiple triples within a sentence.",
            "And the sentence may convey additional information that we didn't have in our triples."
        ],
        [
            "So if we look at the example, the last several sentence is we're generating using hybrid approach.",
            "For example, in May 2010, Toyota launched a collaboration with Tesla Motors to create electric vehicles and so forth."
        ],
        [
            "We did an evaluation with 100 text generated from each application domain combination and we generated them in five versions.",
            "I'm going to be showing only three the results for three of them here, so we generated descriptions using the full system.",
            "Using the full system, but without para phrasal templates an then baseline which did not use the para phrasal templates, the hybrid, or some of the other components which I didn't did not talk about.",
            "The annotators and this was done on Amazon Mechanical Turk were shown to test an ASK which is better or equal and they were asked to rank them on the criteria of content ordering style.",
            "An overall description."
        ],
        [
            "So what have we learned?",
            "Well, we can see that the full system gets a huge win over the baseline.",
            "That happens on content, so 66% of the people preferred the full system over the baseline.",
            "20% preferred the baseline, and so forth on all of them with a 42% win overall."
        ],
        [
            "If we look at well, how much do the para phrasal templates contribute to what people like?",
            "Here is an evaluation with just the paraphrases removed.",
            "We can see the win is not as big, but nonetheless we do get a significant improvement in all cases."
        ],
        [
            "So what what's next?",
            "There are certain kinds of generation issues that we've not addressed here, which are relatively easy.",
            "Things like handling pronouns and some other style questions we could extend to other types of entities.",
            "We have developed similar approaches for generating explanations for machine learning, and I'm particularly interested in doing more work on that."
        ],
        [
            "So let me turn now to our work on person."
        ],
        [
            "All narrative.",
            "And I use as example the autobiography of Malcolm X.",
            "Now clearly we're not looking for texts as big as novels on the web, but I think this one is illustrates the kind of narrative that we're looking for.",
            "We're looking for narratives which have a compelling component life or death situations that happened to the author, and they are told from the first person."
        ],
        [
            "So how is personal narrative different?",
            "Well, we have a coherent telling of a story.",
            "This story has this compelling life or death component.",
            "It's a monologue, so in that ways is like news or the description.",
            "Wikipedia descriptions, but unlike Newsan the Wikipedia descriptions, it's much more informal language."
        ],
        [
            "Hey, so we're interested in this.",
            "This actually combines with our work on generating updates for disaster, were interested in being able to generate summaries of personal views, so individually experience of individuals who have lived through some kind of disaster."
        ],
        [
            "I have an example here of the kind of narrative that we're interested in.",
            "This comes from.",
            "A post after Hurricane Sandy."
        ],
        [
            "And we can see that it's structured.",
            "It they typically start out with some kind of background information.",
            "We were sitting down to a late dinner on Monday when the storm was supposed to hit.",
            "It was incredibly windy, but the rain really hadn't been that bad."
        ],
        [
            "We then go into a series of complicating actions where the suspense builds.",
            "So by 10:00 PM, the skies lit up in a purple and brew blue brilliance and the power started to go out here and there.",
            "That's when I notice neighbors across the street running out of their homes and fire trucks racing down the block.",
            "I saw a trickle of steady water coming down the street on both sides and then water began pouring in through the creeks in the basement door.",
            "So my husband went to grab the pump.",
            "And then we."
        ],
        [
            "Have what we're calling the most reportable event.",
            "This is that compelling moment of life or death.",
            "Here he went upstairs to get a tulan.",
            "In those few seconds, ocean waves broke the steel door lock and flooded the basement 6 feet high in minutes."
        ],
        [
            "So our goal in this work is to be able to automatically identify the most reportable event.",
            "We want to know which sentence is convey that compelling life or death moment, and we hypothesize that that reportable event could serve as a story for what this summary for what this story is about."
        ],
        [
            "So as data we use online data, the from askreddit we use the Askreddit subreddit, which is what's your creepiest real life story an using this?",
            "We downloaded 3000 stories.",
            "Of course, you know this is the source where we could get as many stories as we want.",
            "From the East we had a small amount that were manually labeled with graduate students, identifying which sentence is where.",
            "The most reportable events, and this was our feed data set.",
            "And then we used a distant supervision to automatically label a large amount of stories, with the most reportable events.",
            "So, for example, we used heuristics like TLD R. Which sentence is semantically closest to the TLD are too long, didn't read or comments.",
            "Which sentence is semantically closest to the majority of comments?"
        ],
        [
            "To develop our system, we relied on linguistic theory, which tells us that stories are about change.",
            "The turning point is typically marked by a change in formality style, an emphasis and above whose theory of narrative structure we build on notes that a change in verb tense often accompanies the most reportable event."
        ],
        [
            "So to do this, we um.",
            "Constructed sentence scores computed scores for each sentence.",
            "Some of these were based on syntactic feature.",
            "So for example, sentence length, which we might expect to change.",
            "For example, if we have long sentence is we might expect the most reportable event to be punctuated with a short sentence.",
            "Some of them are semantics, so we looked at similarity to the surrounding sentences.",
            "Here we might expect the most reportable event have the most distance from the surrounding sentences.",
            "And then from pragmatics we use scores about affect.",
            "The pleasantness of the words in the sentence, the activeness and the imagery that they invoke."
        ],
        [
            "So for example, for this story, this graph shows the change in affect, and our hypothesis is that the most reportable event would occur at a Max or min in the scores for sentence.",
            "So shown here activeness has a peak at the point of the most reportable event.",
            "While pleasantness, jasmyn at the point of the most reportable event."
        ],
        [
            "So what have we learned here?",
            "Well, we've learned that of all the features that we use, then we use more than those I talked about here.",
            "Change features are the most effective.",
            "We also experimented with how to use the data, so we experimented with building a system that you see data only.",
            "This is small but very accurately labeled distant supervision, so this is a large amount of data, but it's noisy.",
            "Self training which is a mix between the two.",
            "So they are.",
            "We ran the system first on the seed data an the data that was labeled which matched the distant labels we fed back as new training data and that's where we got our best results."
        ],
        [
            "So what's next?",
            "We're looking at work on rewriting the extracted sentences for better summaries because they are very informal and often they tell only part of the story and we're looking to develop a browsing interface which has summaries of different personal experiences in the context of a disaster, which people can link into to see what's happened."
        ],
        [
            "Hey so let me turn now to our work on social media."
        ],
        [
            "We're dealing here with Twitter, so how is social media different?",
            "Well, like personal narratives, it is also informal.",
            "It has quite a bit more slang and abbreviations and emojis.",
            "It's definitely not the language of news.",
            "Unlike the other genres that we've looked at, it has dialogue, so we do see back and forth between people who post.",
            "And because this is Twitter, each contribution is short."
        ],
        [
            "So in this application, we're looking at addressing a problem that is a big problem in the US and that is that we have the highest rate of gun related deaths when compared to other industrialized companies, and the violence particularly affects low income cities like Chicago, which had more than 3000 shooting victims in 2015."
        ],
        [
            "Now some of this gun violence occurs because of gang violence, and one of the things that we see is that gangs post on social media and in many ways their virtual life reflects their life, lived on the street.",
            "So we began."
        ],
        [
            "Looking at whether we can automatically detect aggressive posts.",
            "So for example, like the one shown here, which says just brought it creative guns, I'm on my way through Lamron shoot you and whoever next to.",
            "You can see that the language that used in these posts is quite different from the language that we normally deal with.",
            "Certainly the part of speech taggers and the parsers that we've developed over the years cannot help us here."
        ],
        [
            "Ann are the approach that we're taking.",
            "Here is a collaboration between social workers, an natural language processing.",
            "This is a collaboration that came about because of the Data Science Institute.",
            "The social worker came to Columbia and immediately came to the Data Science Institute and asked if there were people who were interested in working with them.",
            "The social worker, Desmond Patton and his group had been working on.",
            "Annotating and analyzing tweets using what they call a deep read and they were working with Chicago youth to help them interpret the tweets.",
            "They look for things like trigger events which might occur in the conversation before the aggressive post they looked for triggered events, tone and the meaning of some of the words.",
            "And we use the labels that they created in these annotations for automatic prediction.",
            "Our goal is ultimately to alert community outreach groups that can intervene and help too.",
            "Reduce the violence and we're working with a group called Cure Violence."
        ],
        [
            "As a case study, this is the data that the social worker and his group collected were using.",
            "Tweets generated by a young woman named Shakirah.",
            "Bonk Barnes, who later renamed herself, is Tyquan Assassin after a friend of hers named Tyquan was shot and killed when she was 13.",
            "And this is actually something that we see that often gang involved.",
            "Youth experience a lot of trauma because of killings.",
            "Two shootings of family friends.",
            "Family or friends?",
            "So she joined the gang and became a gang leader at age 13, and she boasted that she had nine killings to her name until she was killed at the age of 17.",
            "She had 27,000 tweets that she posted between the period December 2011 to April 2014 and she had 4200 followers on Twitter.",
            "An so we use her tweets plus the responses of 10 of her top followers."
        ],
        [
            "So the themes that emerge from the coding can fall into three general categories, aggression, where they find things like insults, threats, bragging, challenge with authority, grief which comes out of the trauma that they experience, distress, sadness, loneliness and death.",
            "And actually I think it would be interesting to also look at intervention at points when people first post about grief and then others.",
            "So these are general conversations between users.",
            "Discussions about women and tweets that represent happiness."
        ],
        [
            "So if we look at the quality, some more examples from the qualitative analysis.",
            "The first 2 fall into the category of aggression one is a threat.",
            "If we see an op fuck it, we going to smoke him.",
            "I'm sorry I'm not used to seeing this kind of language.",
            "It's a little hard for me.",
            "So basically that means if we see someone we don't like, we're going to kill them.",
            "The second one is aggression, but insult don't get caught on that 800 block that is 1 particular gangs.",
            "Area lame ass.",
            "Little Anne.",
            "Better take that shit on Stony spot.",
            "Another area or loss young and still getting shot.",
            "Babies still dying."
        ],
        [
            "So in our work we've developed natural language tools that can process these kinds of language.",
            "This is work by Owen Rambow and his students who's part of our team.",
            "So they developed a part of speech tagger using the supervised machine learning approach plus domain adaptation so that they could take data from other Twitter domains and they found that some of the best features included semantic clusters that use Brown clusters.",
            "Plus character in grants.",
            "They also developed a bilingual dictionary and this was done by glossing the tweets into Standard American English and then using a tool which automatically align the words between the two so we could see that smoke would translate as kill."
        ],
        [
            "And then we developed an aggression and loss category classifiers 3 way classifier also into other one of the key kinds of features used as an emotion lexecon it's scores words according to their affect.",
            "So we use the same dictionary that we use in the work on personal narrative and we would get scores for words, for example how angry a word was or how sad word was.",
            "We use the part of speech tags developed by our group and the bilingual Lexcom was critical in order to let us look upwards in the emotion lexecon, which is just standard American English an our classifier has an F measure in valuation of 63% and this is work that will be presenting at coaling in December."
        ],
        [
            "So what have we learned?",
            "Well, one of the main things is that we need collaboration to make progress, so there is no way that we as natural language people could understand what these tweets are about and the language used in them and what is meant, what's important in order to develop our tools.",
            "We've also learned that context outside context like trigger trigger events are essential to annotation and the next steps that we're looking at here.",
            "Is to be able to generate an explanation of our prediction which might point to the different tweets in the conversation that lead up to the most aggressive tweet and this is important for the community outreach people because they must understand the background of what's happened in order to make a decision about how to pursue it."
        ],
        [
            "K I'm going to close with our work."
        ],
        [
            "Novels and here very different.",
            "Type of language.",
            "We're dealing with 19th century novels like that of Charles Dickens of David, written by David Copperfield, sorry, David Copperfield.",
            "Written by Charles Dickens."
        ],
        [
            "If we look in an excerpt from that novel, we'll see that there's a lot of conversation here we have.",
            "It was Broad Day eight or nine o'clock.",
            "The storm raging, in lieu of the batteries and someone knocking and calling at my door.",
            "What is the matter?",
            "I cried a wreck close by.",
            "I sprung out of bed and asked what wreck?"
        ],
        [
            "So for this we used a corpus of 19th century novels.",
            "We had 60 novels and they were selected by the comparative literature professor on our team to represent different genres over that period of time."
        ],
        [
            "The work was a collaboration between computer science and comparative literature and we were looking to see whether we could provide evidence for or against literary theory.",
            "And we did this through social network extraction from the literature.",
            "So from in our corpus for each novel we built a network based on conversation within the novel.",
            "Our method with based on quoted speech, we automatically identify who talks to whom and then we extracted features of the graph that we could use to evaluate the hypothesis."
        ],
        [
            "So one of the hypothesis that we looked at was that larger conversational novels with more people tend to be less connected, so this was associated with the move from novels like Jane Austen and the country into novels by Dickens in the city where there were a much larger group of people and cities were industrialized and therefore less friendly.",
            "So the theory was that these larger conversational networks with more people.",
            "Tend to be less connected.",
            "We have two theorists here.",
            "Franco Moretti, who says at 10 or 20 characters.",
            "It's possible to include distant and openly hostile groups, and Terry Eagleton, who said most of our encounters consist of seen rather than speaking, glimpsing each other as objects rather than conversing as fellow subjects.",
            "So our question was, can we show empirically that conversational networks with fewer people?",
            "Are more closely connected."
        ],
        [
            "To construct the social network we had nodes which represented people who said something and we were able to do this task called quote Attribution with 83% accuracy.",
            "We set edges equal to people who are talking to each other and we use quote adjacency as a heuristic for detecting conversations.",
            "The edge weight was set to the share of detected conversation over the novel an we could detect conversation with 95% precision, but we only got about 51% of the conversations."
        ],
        [
            "We looked at the impact of network size, so according to our theory we would expect that as the number of named characters increases, we would get the same or less total speech an we found this to be true.",
            "The number normalized number of quotes was flat.",
            "We would expect to have a less lopsided distribution of quotes among speakers, and we found this to be true.",
            "The share of quotes by the top three speakers decreases."
        ],
        [
            "As the number of named and characters increases, we would expect to find lower density that is fewer conversational partners as a percentage of the population, and we found this not to be true.",
            "Larger networks are more connected.",
            "We would expect to find the same or fewer cliques, and we found this also not to be true.",
            "The three clique rate increases larger networks formed cliques more often."
        ],
        [
            "So we thought, well, maybe we should be looking at speakers, not just name characters, and so we would expect as the number of speakers increases, we would expect to see less overall dialogue.",
            "This quote, glimpsing rather than speaking.",
            "But we found this not to be true.",
            "Larger networks are more talkative.",
            "We would also expect lower density that is in larger networks people speak to more of their neighbors.",
            "And we found this not to be true, that is, that in larger networks people know more if their neighbors, whereas the opposite should be true."
        ],
        [
            "We did find an alternate explanation.",
            "Text perspective dominates the network shape, so in third person tellings we saw a significant increases in the normalized number of quotes, the average degree, the graph density and the rate of three cliques, all with no significant difference in the number of characters or speakers.",
            "So our hypothesis is that first person narrators are not Privy to other characters conversations with each other and therefore they don't appear."
        ],
        [
            "So you can see this in a couple of the social networks that we produce.",
            "This is 1 produced for Jane Austen's persuasion.",
            "It's told in the third person you can see an is the central character.",
            "She's slightly larger than the other and there are length so she talks with or other characters talk with each other pretty often."
        ],
        [
            "If we look at what's called a close third, this is where it's told from the perspective of one of the characters, so this is Braden's Lady Audley Secret told from the perspective of Robert we get a quite different shape to the network.",
            "Robert again is dominant and most of the links are between Robert and the other characters."
        ],
        [
            "And then finally, if we look at a first person narrative, so this is Dickens David Copperfield, the eye is very dominant and there are much fewer conversations between the other characters."
        ],
        [
            "So what have we learned?",
            "Well, we've learned that high precision conversational networks can be extracted from literature, and we think the time is right for the natural language field to be exploring analysis of fiction.",
            "We are thinking about what we might have overlooked.",
            "So these were theories, after all, by experts in literature.",
            "Um Ann, right now what we're working on to look at something different is detection of scene changes in novels and thinking about the fact that the community can be seen from who's present in the scene and who knows each other whether or not they're speaking to each other.",
            "And so this is something that we're exploring now."
        ],
        [
            "So to close, I've looked at applications in four different genres.",
            "I have ideas about how at least three of them, news, personal narrative and online discussion forums can be connected in one setting and thinking about the Wikipedia text."
        ],
        [
            "Seeing that the kind of information that plays a big role in getting these applications up and running is semantics and data from the web."
        ],
        [
            "We've also seen in some of the more subjective genres that pragmatics, that is information about affect or emotion, plays a role, and certainly real world context is important."
        ],
        [
            "I want to close by acknowledging the work of my PhD students who have played a major role in getting these systems up and running."
        ],
        [
            "And I also want to acknowledge my path students where all of this work has had.",
            "An impact overtime?"
        ],
        [
            "So thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thanks Paul.",
                    "label": 0
                },
                {
                    "sent": "I wanted to start by thanking you Landon Paul for asking, inviting me here today.",
                    "label": 0
                },
                {
                    "sent": "I also wanted to thank the local Arrangement Committee for their gracious welcome to Japan.",
                    "label": 0
                },
                {
                    "sent": "I I thought I would also say thank you to the Japanese people.",
                    "label": 0
                },
                {
                    "sent": "When I entered I it was such a wonderful experience and really contrasted heavily with my day-to-day experience in New York.",
                    "label": 0
                },
                {
                    "sent": "This is my first time here at the Semantic Web conference and I'm excited to learn about what you're all doing.",
                    "label": 0
                },
                {
                    "sent": "So we're all aware of the large amount vast amount of of language that is available on the web, and we know that it figures heavily in.",
                    "label": 0
                },
                {
                    "sent": "The everyday experience of users in online interaction.",
                    "label": 0
                },
                {
                    "sent": "At the same time, we see the field date of data science which is springing up everywhere an IT promises solutions to a variety of tasks by applying data science techniques to large amounts of data.",
                    "label": 1
                },
                {
                    "sent": "Today I'm going to talk about the use of data science techniques and a number of different applications using online language.",
                    "label": 0
                },
                {
                    "sent": "These are applications that we've developed over the last five.",
                    "label": 0
                },
                {
                    "sent": "Years or so.",
                    "label": 0
                },
                {
                    "sent": "And I'll note that I'm swapped in and out some applications from those that I mentioned in my abstract, so I hope you're all OK with that.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So my work fits in the data science context at the Institute at Columbia with.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then what we call the new Media Center and they're we're working on developing tools and talents to enhance communications.",
                    "label": 0
                },
                {
                    "sent": "An interactions within communities.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My own vision is to develop systems that can generate presentations that connect events, opinions, personal accounts, and their impact on the world.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In all of the work that I'm going to talk about today, I take a machine learning or data science framework.",
                    "label": 0
                },
                {
                    "sent": "We take data.",
                    "label": 0
                },
                {
                    "sent": "It's often labeled with what the output for the task should be.",
                    "label": 1
                },
                {
                    "sent": "We extract features from this text data and this is where the natural language comes to play.",
                    "label": 1
                },
                {
                    "sent": "And we use those features to predict our output for the task.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm not a machine learning person, so my interest here lies in what data is available for learning, and often how can we get it without having to manually label it with the output?",
                    "label": 0
                },
                {
                    "sent": "And today I'm going to focus on applications where we've gathered that data from the web.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm also interested in what features yield good predictions, and today I'll focus a bit on how we view semantics for those features.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm going to be talking about applications that use data from a variety of different genres, and I've laid them out along a continuum from fact to fiction.",
                    "label": 0
                },
                {
                    "sent": "So at the top of the continuum we have genres that are more objective, more factual news usually is more factual and subjective.",
                    "label": 0
                },
                {
                    "sent": "Wikipedia descriptions, which I think are pretty objective.",
                    "label": 1
                },
                {
                    "sent": "And as we go down, we come to genres that have more subjective information.",
                    "label": 0
                },
                {
                    "sent": "So with personal narrative and social media, we often have a lot of opinionated.",
                    "label": 1
                },
                {
                    "sent": "Information.",
                    "label": 0
                },
                {
                    "sent": "And then at the bottom we get to novels which are not fact at all.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'm going to start with our work on news.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now news has been around for quite awhile in the natural language field.",
                    "label": 0
                },
                {
                    "sent": "Early as the 90s, the field began with annotation of large quantities of news in order to enable us to do a variety of of natural language tests and a number of them very basic tools that figure in all higher level applications.",
                    "label": 0
                },
                {
                    "sent": "For example, it was at this point in time that parser robust parsers were first trained on on data and developed part of speech, taggers and so forth and.",
                    "label": 0
                },
                {
                    "sent": "My work very much relies on having these tools available in order to be able to address higher level applications.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In our work on news, I'm going to talk today about our work addressing a problem, and that is being able to identify needs during disaster.",
                    "label": 1
                },
                {
                    "sent": "We were very much motivated to do this work after Hurricane Sandy hit New York.",
                    "label": 0
                },
                {
                    "sent": "Most of us were worried about what was happening.",
                    "label": 0
                },
                {
                    "sent": "Many of my students lived in these areas where the rat is where there was possible flooding, and in fact in my apartment on the Upper West Side, it became a sort of refugee for those who lived in the southern half of Manhattan.",
                    "label": 0
                },
                {
                    "sent": "I had many people who moved up and.",
                    "label": 0
                },
                {
                    "sent": "Stayed with me over the course of the time and I know here in Japan you've had similar experiences after the tsunami.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So when our work we're working on developing a system that can monitor events over time, we take his input streaming data.",
                    "label": 0
                },
                {
                    "sent": "Right now this is news or web pages we're moving towards adding social media into that, and at every hour we'd like to produce an update on what's new.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our goal is to get to the point where we can track events as they occur and the sub events that unfold.",
                    "label": 0
                },
                {
                    "sent": "So, for example, after Hurricane Sandy hit we had the subevents of the blackout in the lower part of Manhattan of Fire in one of the suburbs of New York and the subway transit outage after flooding.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to develop our system, we have been using data that has been collected from NIST by doing a web crawl over a two year period from 2011 to 2013.",
                    "label": 1
                },
                {
                    "sent": "I've done a crawl for.",
                    "label": 0
                },
                {
                    "sent": "Web pages, news that have to do with various kinds of disasters which they have categorized into 11 broad categories and you can see just four of them here.",
                    "label": 0
                },
                {
                    "sent": "So for example, protests, terrorist events, bombings, and so forth.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And our our system takes input over the course of an hour and I'm showing just 4.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Year but",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the course of an hour.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We would actually take in many, many documents an at the end of an hour produce an update which essentially summarizes what's new in those doc.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Kimetsu shown here.",
                    "label": 0
                },
                {
                    "sent": "This is data within this tonn, the Guatemalan earthquake, and we see that the update tells us that a strong earthquake has hit off the Pacific coast of Guatemala, rocking the capital and shaking buildings as far away as Mexico City.",
                    "label": 0
                },
                {
                    "sent": "So we have the event location.",
                    "label": 0
                },
                {
                    "sent": "The magnitude of the quake and so forth.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So our approach to produce this kind of output is a temporal summarization approach.",
                    "label": 0
                },
                {
                    "sent": "Our system works in time slots, so at time T we predict salience for the input sentence is and we use disaster specific features in order to produce salience.",
                    "label": 0
                },
                {
                    "sent": "We also need to remove redundant sentences both from the hour that we're looking at.",
                    "label": 0
                },
                {
                    "sent": "But also we want to make sure that we're not repeating information that was presented.",
                    "label": 0
                },
                {
                    "sent": "In an earlier update, will still have a lot of sentences, and so we cluster and select exemplar sentences for T and we use a clustering algorithm that allows us to incorporate salients prediction as a prior.",
                    "label": 1
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'm going to give you some examples of some of the features that we used to predict salients.",
                    "label": 0
                },
                {
                    "sent": "We use two kinds of language models.",
                    "label": 0
                },
                {
                    "sent": "The first we build from a generic news corpus and this allows us to select or rank higher senses that are grammatically correct, and this is an issue that can arise when we're dealing with web content.",
                    "label": 0
                },
                {
                    "sent": "The domain specific corpus is more interesting.",
                    "label": 1
                },
                {
                    "sent": "We build a corpus from disaster related Wikipedia articles with a separate corpus for.",
                    "label": 0
                },
                {
                    "sent": "Each type of disaster that we're considering.",
                    "label": 0
                },
                {
                    "sent": "And then the domain specific language model scores sentences by how typical they are of the disaster type.",
                    "label": 1
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So for example, if we look at these three sentences that come in for our.",
                    "label": 0
                },
                {
                    "sent": "Guatemalan earthquake using the domain specific corpus for earthquakes, it would rank the first sentence as higher because it contains phrases which are typical of what we might expect to see during an earthquake like disaster management or local tsunami alert.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That language model tells us will rank sentences higher that are typical of any event.",
                    "label": 0
                },
                {
                    "sent": "We want to make sure that we're getting sentences that refer to the specific event under question, so we also use geographic features.",
                    "label": 0
                },
                {
                    "sent": "We tag the input with an A.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And entity tagger an for the location here.",
                    "label": 0
                },
                {
                    "sent": "Nicola, Nicaragua and Mexico City, we get locations coordinates for the location and their mean distance to the event an will rank sentence is higher which are closer to the to the.",
                    "label": 1
                },
                {
                    "sent": "Event.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We also use semantic information and we use word net to do this, so we have.",
                    "label": 0
                },
                {
                    "sent": "We take synonyms, Hypernyms and hyponyms of the event type and we look for them in the input so shown here.",
                    "label": 1
                },
                {
                    "sent": "Disaster is a hypernym of earthquake.",
                    "label": 0
                },
                {
                    "sent": "And again this would wait the first sentence higher.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what have we learned here?",
                    "label": 1
                },
                {
                    "sent": "Well, we've learned that our salience predictions lead to high precision.",
                    "label": 1
                },
                {
                    "sent": "Quickly the red line is our model using salience, and we can see that overtime the X axis shows days overtime.",
                    "label": 0
                },
                {
                    "sent": "Precision rises quickly much more quickly than the other models that we tested it against.",
                    "label": 1
                },
                {
                    "sent": "On the bottom, we see that salients prediction.",
                    "label": 0
                },
                {
                    "sent": "Allow us to more quickly recover more information so less of a difference here between our clustering without salients and with with salients, but nonetheless we still see an improvement.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what's next?",
                    "label": 0
                },
                {
                    "sent": "I know that somebody during the question answering.",
                    "label": 0
                },
                {
                    "sent": "Is going to ask me about neural Nets.",
                    "label": 0
                },
                {
                    "sent": "We are beginning experimentation with the neural net approach an we're looking at neural Nets for summarization updates an what we're eating at with this approach is abstractive summarization's where we can generate new sentence is from the phrases in our input sentences.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so let me turn now to our work on generating Wikipedia descriptions.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "This, I think, is the application that's closest to the kind of work that you do here.",
                    "label": 0
                },
                {
                    "sent": "We have developed a system where we take as input RDF triples from a source such as Wikipedia, and we generate as output Wikipedia descriptions.",
                    "label": 0
                },
                {
                    "sent": "I should.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Say this is the work of a student who is just finishing his dissertation now.",
                    "label": 0
                },
                {
                    "sent": "So how do Wikipedia descriptions differ from news like news?",
                    "label": 1
                },
                {
                    "sent": "They are formal language, they're grammatical.",
                    "label": 0
                },
                {
                    "sent": "There are perhaps more stylized format or structure than news.",
                    "label": 0
                },
                {
                    "sent": "For certain kinds of entries, there is less varied content than what you would expect to find in news.",
                    "label": 1
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So with now RDF applications that we're looking at where we have developed applications that generate descriptions of semantic web entities, and we've done that for biographies and company descriptions.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in both of these we can look at this as an entity for a biography, which is a type of person an, an entity for a company which is a type of company.",
                    "label": 0
                },
                {
                    "sent": "For each, we looked at two different kinds of examples for biographies, we looked at the professions of politicians and models an for industry.",
                    "label": 0
                },
                {
                    "sent": "We developed a system that Kim we tested in the domain of automative in video games, although I should say there's nothing specific in what we did to these two professions or industries, it should be able to apply to others.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in order to do the generation we use what are called templates and we have two core messages.",
                    "label": 0
                },
                {
                    "sent": "These are messages that are built from already RDF triple Triples an.",
                    "label": 0
                },
                {
                    "sent": "The instant entity will appear as the subject within the template, so we can see here.",
                    "label": 0
                },
                {
                    "sent": "We have the core messages.",
                    "label": 0
                },
                {
                    "sent": "We have two ways of expressing it.",
                    "label": 0
                },
                {
                    "sent": "One we have the predicate of subject is.",
                    "label": 1
                },
                {
                    "sent": "Checked or subjects predicate?",
                    "label": 1
                },
                {
                    "sent": "Is object an this for a company like Tesla would rely on the predicate location would result in the sentence the location of Tesla is Palo Alto.",
                    "label": 0
                },
                {
                    "sent": "Now this would be.",
                    "label": 0
                },
                {
                    "sent": "Relatively monotonous if we generated all our sentences using these two templates.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So one of the things that we have worked on is para phrasal template extraction.",
                    "label": 0
                },
                {
                    "sent": "So we have we mine para phrasal templates from the domain corpus, and here we use Wikipedia and we use the taxonomy.",
                    "label": 1
                },
                {
                    "sent": "Or ontology within.",
                    "label": 0
                },
                {
                    "sent": "Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "To find richly typed para phrasal templates so we this is important for generation, we need to know what the type is for a slot so we can decide what are appropriate phrases to fill it and this enables us to find para phrasal templates from non paraphrase sentences.",
                    "label": 1
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me show you how this works.",
                    "label": 0
                },
                {
                    "sent": "Here are two sentences from the corpus.",
                    "label": 1
                },
                {
                    "sent": "They refer to two car companies.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First one GM, Taiwan was founded in August 1989, the second one.",
                    "label": 1
                },
                {
                    "sent": "In 1904, the company was established as Oscar Lear Automotive Automobile Company, so these two senses refer to the are sentences that cover the same kind of RDF triple, both refering to when the company was founded.",
                    "label": 0
                },
                {
                    "sent": "They have a company is instance Anna date, so we find the entities within the sentence and label them, and now we must.",
                    "label": 0
                },
                {
                    "sent": "Infer what their type is within the ontology.",
                    "label": 0
                },
                {
                    "sent": "I'm not giving you details on how we do that, although you can ask.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And shown here from these two sentences, then we're able to get two paraphrases that convey that information an you can see this now, in addition to the core messages, gives us three ways to convey that information, and in fact, we're able to mine thousands of para phrasal templates for each domain, so we can get quite a bit of variety and how we generate.",
                    "label": 0
                },
                {
                    "sent": "Are text.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So show I'll show you here the example of the output that's generated by the system for a description of the company Tesla Motors an in blue are three sentences that are generated using para phrasal templates.",
                    "label": 0
                },
                {
                    "sent": "So first we have Tesla Motors was founded by JB Straubel, Mart, Martin Eberhard and Elon Musk.",
                    "label": 1
                },
                {
                    "sent": "Tesla Motors is a privately held company with approximately 6000 employees and in 2003 the company reorganized adapting its current name Tesla Motors.",
                    "label": 1
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the same example, in the yellow we have two sentences that were generated using the core messages, so those do get used in our output and the fact that they're not heavily used makes for good text.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have extended this approach so in addition to doing generation using templates from the triples, we also use a hybrid where we see whether we can augment those with information drawn from the web.",
                    "label": 0
                },
                {
                    "sent": "So this is the summarization approach and we're looking at finding all relevant sentence is that match the entity and or contain RDF triples.",
                    "label": 1
                },
                {
                    "sent": "So in sentences like these we might match multiple triples within a sentence.",
                    "label": 0
                },
                {
                    "sent": "And the sentence may convey additional information that we didn't have in our triples.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if we look at the example, the last several sentence is we're generating using hybrid approach.",
                    "label": 0
                },
                {
                    "sent": "For example, in May 2010, Toyota launched a collaboration with Tesla Motors to create electric vehicles and so forth.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We did an evaluation with 100 text generated from each application domain combination and we generated them in five versions.",
                    "label": 1
                },
                {
                    "sent": "I'm going to be showing only three the results for three of them here, so we generated descriptions using the full system.",
                    "label": 0
                },
                {
                    "sent": "Using the full system, but without para phrasal templates an then baseline which did not use the para phrasal templates, the hybrid, or some of the other components which I didn't did not talk about.",
                    "label": 0
                },
                {
                    "sent": "The annotators and this was done on Amazon Mechanical Turk were shown to test an ASK which is better or equal and they were asked to rank them on the criteria of content ordering style.",
                    "label": 1
                },
                {
                    "sent": "An overall description.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what have we learned?",
                    "label": 1
                },
                {
                    "sent": "Well, we can see that the full system gets a huge win over the baseline.",
                    "label": 0
                },
                {
                    "sent": "That happens on content, so 66% of the people preferred the full system over the baseline.",
                    "label": 0
                },
                {
                    "sent": "20% preferred the baseline, and so forth on all of them with a 42% win overall.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If we look at well, how much do the para phrasal templates contribute to what people like?",
                    "label": 0
                },
                {
                    "sent": "Here is an evaluation with just the paraphrases removed.",
                    "label": 0
                },
                {
                    "sent": "We can see the win is not as big, but nonetheless we do get a significant improvement in all cases.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what what's next?",
                    "label": 0
                },
                {
                    "sent": "There are certain kinds of generation issues that we've not addressed here, which are relatively easy.",
                    "label": 0
                },
                {
                    "sent": "Things like handling pronouns and some other style questions we could extend to other types of entities.",
                    "label": 1
                },
                {
                    "sent": "We have developed similar approaches for generating explanations for machine learning, and I'm particularly interested in doing more work on that.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me turn now to our work on person.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All narrative.",
                    "label": 0
                },
                {
                    "sent": "And I use as example the autobiography of Malcolm X.",
                    "label": 0
                },
                {
                    "sent": "Now clearly we're not looking for texts as big as novels on the web, but I think this one is illustrates the kind of narrative that we're looking for.",
                    "label": 0
                },
                {
                    "sent": "We're looking for narratives which have a compelling component life or death situations that happened to the author, and they are told from the first person.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So how is personal narrative different?",
                    "label": 1
                },
                {
                    "sent": "Well, we have a coherent telling of a story.",
                    "label": 0
                },
                {
                    "sent": "This story has this compelling life or death component.",
                    "label": 0
                },
                {
                    "sent": "It's a monologue, so in that ways is like news or the description.",
                    "label": 0
                },
                {
                    "sent": "Wikipedia descriptions, but unlike Newsan the Wikipedia descriptions, it's much more informal language.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hey, so we're interested in this.",
                    "label": 0
                },
                {
                    "sent": "This actually combines with our work on generating updates for disaster, were interested in being able to generate summaries of personal views, so individually experience of individuals who have lived through some kind of disaster.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I have an example here of the kind of narrative that we're interested in.",
                    "label": 0
                },
                {
                    "sent": "This comes from.",
                    "label": 0
                },
                {
                    "sent": "A post after Hurricane Sandy.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we can see that it's structured.",
                    "label": 0
                },
                {
                    "sent": "It they typically start out with some kind of background information.",
                    "label": 0
                },
                {
                    "sent": "We were sitting down to a late dinner on Monday when the storm was supposed to hit.",
                    "label": 1
                },
                {
                    "sent": "It was incredibly windy, but the rain really hadn't been that bad.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We then go into a series of complicating actions where the suspense builds.",
                    "label": 0
                },
                {
                    "sent": "So by 10:00 PM, the skies lit up in a purple and brew blue brilliance and the power started to go out here and there.",
                    "label": 1
                },
                {
                    "sent": "That's when I notice neighbors across the street running out of their homes and fire trucks racing down the block.",
                    "label": 0
                },
                {
                    "sent": "I saw a trickle of steady water coming down the street on both sides and then water began pouring in through the creeks in the basement door.",
                    "label": 1
                },
                {
                    "sent": "So my husband went to grab the pump.",
                    "label": 0
                },
                {
                    "sent": "And then we.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Have what we're calling the most reportable event.",
                    "label": 0
                },
                {
                    "sent": "This is that compelling moment of life or death.",
                    "label": 0
                },
                {
                    "sent": "Here he went upstairs to get a tulan.",
                    "label": 1
                },
                {
                    "sent": "In those few seconds, ocean waves broke the steel door lock and flooded the basement 6 feet high in minutes.",
                    "label": 1
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So our goal in this work is to be able to automatically identify the most reportable event.",
                    "label": 0
                },
                {
                    "sent": "We want to know which sentence is convey that compelling life or death moment, and we hypothesize that that reportable event could serve as a story for what this summary for what this story is about.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So as data we use online data, the from askreddit we use the Askreddit subreddit, which is what's your creepiest real life story an using this?",
                    "label": 1
                },
                {
                    "sent": "We downloaded 3000 stories.",
                    "label": 0
                },
                {
                    "sent": "Of course, you know this is the source where we could get as many stories as we want.",
                    "label": 0
                },
                {
                    "sent": "From the East we had a small amount that were manually labeled with graduate students, identifying which sentence is where.",
                    "label": 0
                },
                {
                    "sent": "The most reportable events, and this was our feed data set.",
                    "label": 0
                },
                {
                    "sent": "And then we used a distant supervision to automatically label a large amount of stories, with the most reportable events.",
                    "label": 0
                },
                {
                    "sent": "So, for example, we used heuristics like TLD R. Which sentence is semantically closest to the TLD are too long, didn't read or comments.",
                    "label": 0
                },
                {
                    "sent": "Which sentence is semantically closest to the majority of comments?",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To develop our system, we relied on linguistic theory, which tells us that stories are about change.",
                    "label": 0
                },
                {
                    "sent": "The turning point is typically marked by a change in formality style, an emphasis and above whose theory of narrative structure we build on notes that a change in verb tense often accompanies the most reportable event.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to do this, we um.",
                    "label": 0
                },
                {
                    "sent": "Constructed sentence scores computed scores for each sentence.",
                    "label": 1
                },
                {
                    "sent": "Some of these were based on syntactic feature.",
                    "label": 1
                },
                {
                    "sent": "So for example, sentence length, which we might expect to change.",
                    "label": 0
                },
                {
                    "sent": "For example, if we have long sentence is we might expect the most reportable event to be punctuated with a short sentence.",
                    "label": 0
                },
                {
                    "sent": "Some of them are semantics, so we looked at similarity to the surrounding sentences.",
                    "label": 1
                },
                {
                    "sent": "Here we might expect the most reportable event have the most distance from the surrounding sentences.",
                    "label": 0
                },
                {
                    "sent": "And then from pragmatics we use scores about affect.",
                    "label": 0
                },
                {
                    "sent": "The pleasantness of the words in the sentence, the activeness and the imagery that they invoke.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for example, for this story, this graph shows the change in affect, and our hypothesis is that the most reportable event would occur at a Max or min in the scores for sentence.",
                    "label": 1
                },
                {
                    "sent": "So shown here activeness has a peak at the point of the most reportable event.",
                    "label": 0
                },
                {
                    "sent": "While pleasantness, jasmyn at the point of the most reportable event.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what have we learned here?",
                    "label": 1
                },
                {
                    "sent": "Well, we've learned that of all the features that we use, then we use more than those I talked about here.",
                    "label": 1
                },
                {
                    "sent": "Change features are the most effective.",
                    "label": 0
                },
                {
                    "sent": "We also experimented with how to use the data, so we experimented with building a system that you see data only.",
                    "label": 1
                },
                {
                    "sent": "This is small but very accurately labeled distant supervision, so this is a large amount of data, but it's noisy.",
                    "label": 0
                },
                {
                    "sent": "Self training which is a mix between the two.",
                    "label": 0
                },
                {
                    "sent": "So they are.",
                    "label": 0
                },
                {
                    "sent": "We ran the system first on the seed data an the data that was labeled which matched the distant labels we fed back as new training data and that's where we got our best results.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what's next?",
                    "label": 0
                },
                {
                    "sent": "We're looking at work on rewriting the extracted sentences for better summaries because they are very informal and often they tell only part of the story and we're looking to develop a browsing interface which has summaries of different personal experiences in the context of a disaster, which people can link into to see what's happened.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hey so let me turn now to our work on social media.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We're dealing here with Twitter, so how is social media different?",
                    "label": 1
                },
                {
                    "sent": "Well, like personal narratives, it is also informal.",
                    "label": 0
                },
                {
                    "sent": "It has quite a bit more slang and abbreviations and emojis.",
                    "label": 0
                },
                {
                    "sent": "It's definitely not the language of news.",
                    "label": 1
                },
                {
                    "sent": "Unlike the other genres that we've looked at, it has dialogue, so we do see back and forth between people who post.",
                    "label": 0
                },
                {
                    "sent": "And because this is Twitter, each contribution is short.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in this application, we're looking at addressing a problem that is a big problem in the US and that is that we have the highest rate of gun related deaths when compared to other industrialized companies, and the violence particularly affects low income cities like Chicago, which had more than 3000 shooting victims in 2015.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now some of this gun violence occurs because of gang violence, and one of the things that we see is that gangs post on social media and in many ways their virtual life reflects their life, lived on the street.",
                    "label": 0
                },
                {
                    "sent": "So we began.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Looking at whether we can automatically detect aggressive posts.",
                    "label": 1
                },
                {
                    "sent": "So for example, like the one shown here, which says just brought it creative guns, I'm on my way through Lamron shoot you and whoever next to.",
                    "label": 0
                },
                {
                    "sent": "You can see that the language that used in these posts is quite different from the language that we normally deal with.",
                    "label": 0
                },
                {
                    "sent": "Certainly the part of speech taggers and the parsers that we've developed over the years cannot help us here.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ann are the approach that we're taking.",
                    "label": 0
                },
                {
                    "sent": "Here is a collaboration between social workers, an natural language processing.",
                    "label": 1
                },
                {
                    "sent": "This is a collaboration that came about because of the Data Science Institute.",
                    "label": 0
                },
                {
                    "sent": "The social worker came to Columbia and immediately came to the Data Science Institute and asked if there were people who were interested in working with them.",
                    "label": 0
                },
                {
                    "sent": "The social worker, Desmond Patton and his group had been working on.",
                    "label": 1
                },
                {
                    "sent": "Annotating and analyzing tweets using what they call a deep read and they were working with Chicago youth to help them interpret the tweets.",
                    "label": 0
                },
                {
                    "sent": "They look for things like trigger events which might occur in the conversation before the aggressive post they looked for triggered events, tone and the meaning of some of the words.",
                    "label": 0
                },
                {
                    "sent": "And we use the labels that they created in these annotations for automatic prediction.",
                    "label": 0
                },
                {
                    "sent": "Our goal is ultimately to alert community outreach groups that can intervene and help too.",
                    "label": 0
                },
                {
                    "sent": "Reduce the violence and we're working with a group called Cure Violence.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As a case study, this is the data that the social worker and his group collected were using.",
                    "label": 0
                },
                {
                    "sent": "Tweets generated by a young woman named Shakirah.",
                    "label": 0
                },
                {
                    "sent": "Bonk Barnes, who later renamed herself, is Tyquan Assassin after a friend of hers named Tyquan was shot and killed when she was 13.",
                    "label": 0
                },
                {
                    "sent": "And this is actually something that we see that often gang involved.",
                    "label": 0
                },
                {
                    "sent": "Youth experience a lot of trauma because of killings.",
                    "label": 0
                },
                {
                    "sent": "Two shootings of family friends.",
                    "label": 0
                },
                {
                    "sent": "Family or friends?",
                    "label": 0
                },
                {
                    "sent": "So she joined the gang and became a gang leader at age 13, and she boasted that she had nine killings to her name until she was killed at the age of 17.",
                    "label": 1
                },
                {
                    "sent": "She had 27,000 tweets that she posted between the period December 2011 to April 2014 and she had 4200 followers on Twitter.",
                    "label": 0
                },
                {
                    "sent": "An so we use her tweets plus the responses of 10 of her top followers.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the themes that emerge from the coding can fall into three general categories, aggression, where they find things like insults, threats, bragging, challenge with authority, grief which comes out of the trauma that they experience, distress, sadness, loneliness and death.",
                    "label": 1
                },
                {
                    "sent": "And actually I think it would be interesting to also look at intervention at points when people first post about grief and then others.",
                    "label": 0
                },
                {
                    "sent": "So these are general conversations between users.",
                    "label": 1
                },
                {
                    "sent": "Discussions about women and tweets that represent happiness.",
                    "label": 1
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if we look at the quality, some more examples from the qualitative analysis.",
                    "label": 0
                },
                {
                    "sent": "The first 2 fall into the category of aggression one is a threat.",
                    "label": 0
                },
                {
                    "sent": "If we see an op fuck it, we going to smoke him.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry I'm not used to seeing this kind of language.",
                    "label": 0
                },
                {
                    "sent": "It's a little hard for me.",
                    "label": 0
                },
                {
                    "sent": "So basically that means if we see someone we don't like, we're going to kill them.",
                    "label": 0
                },
                {
                    "sent": "The second one is aggression, but insult don't get caught on that 800 block that is 1 particular gangs.",
                    "label": 0
                },
                {
                    "sent": "Area lame ass.",
                    "label": 0
                },
                {
                    "sent": "Little Anne.",
                    "label": 0
                },
                {
                    "sent": "Better take that shit on Stony spot.",
                    "label": 0
                },
                {
                    "sent": "Another area or loss young and still getting shot.",
                    "label": 0
                },
                {
                    "sent": "Babies still dying.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in our work we've developed natural language tools that can process these kinds of language.",
                    "label": 0
                },
                {
                    "sent": "This is work by Owen Rambow and his students who's part of our team.",
                    "label": 0
                },
                {
                    "sent": "So they developed a part of speech tagger using the supervised machine learning approach plus domain adaptation so that they could take data from other Twitter domains and they found that some of the best features included semantic clusters that use Brown clusters.",
                    "label": 1
                },
                {
                    "sent": "Plus character in grants.",
                    "label": 1
                },
                {
                    "sent": "They also developed a bilingual dictionary and this was done by glossing the tweets into Standard American English and then using a tool which automatically align the words between the two so we could see that smoke would translate as kill.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then we developed an aggression and loss category classifiers 3 way classifier also into other one of the key kinds of features used as an emotion lexecon it's scores words according to their affect.",
                    "label": 1
                },
                {
                    "sent": "So we use the same dictionary that we use in the work on personal narrative and we would get scores for words, for example how angry a word was or how sad word was.",
                    "label": 0
                },
                {
                    "sent": "We use the part of speech tags developed by our group and the bilingual Lexcom was critical in order to let us look upwards in the emotion lexecon, which is just standard American English an our classifier has an F measure in valuation of 63% and this is work that will be presenting at coaling in December.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what have we learned?",
                    "label": 1
                },
                {
                    "sent": "Well, one of the main things is that we need collaboration to make progress, so there is no way that we as natural language people could understand what these tweets are about and the language used in them and what is meant, what's important in order to develop our tools.",
                    "label": 0
                },
                {
                    "sent": "We've also learned that context outside context like trigger trigger events are essential to annotation and the next steps that we're looking at here.",
                    "label": 0
                },
                {
                    "sent": "Is to be able to generate an explanation of our prediction which might point to the different tweets in the conversation that lead up to the most aggressive tweet and this is important for the community outreach people because they must understand the background of what's happened in order to make a decision about how to pursue it.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "K I'm going to close with our work.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Novels and here very different.",
                    "label": 0
                },
                {
                    "sent": "Type of language.",
                    "label": 0
                },
                {
                    "sent": "We're dealing with 19th century novels like that of Charles Dickens of David, written by David Copperfield, sorry, David Copperfield.",
                    "label": 0
                },
                {
                    "sent": "Written by Charles Dickens.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If we look in an excerpt from that novel, we'll see that there's a lot of conversation here we have.",
                    "label": 0
                },
                {
                    "sent": "It was Broad Day eight or nine o'clock.",
                    "label": 1
                },
                {
                    "sent": "The storm raging, in lieu of the batteries and someone knocking and calling at my door.",
                    "label": 1
                },
                {
                    "sent": "What is the matter?",
                    "label": 1
                },
                {
                    "sent": "I cried a wreck close by.",
                    "label": 1
                },
                {
                    "sent": "I sprung out of bed and asked what wreck?",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So for this we used a corpus of 19th century novels.",
                    "label": 0
                },
                {
                    "sent": "We had 60 novels and they were selected by the comparative literature professor on our team to represent different genres over that period of time.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The work was a collaboration between computer science and comparative literature and we were looking to see whether we could provide evidence for or against literary theory.",
                    "label": 1
                },
                {
                    "sent": "And we did this through social network extraction from the literature.",
                    "label": 0
                },
                {
                    "sent": "So from in our corpus for each novel we built a network based on conversation within the novel.",
                    "label": 1
                },
                {
                    "sent": "Our method with based on quoted speech, we automatically identify who talks to whom and then we extracted features of the graph that we could use to evaluate the hypothesis.",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So one of the hypothesis that we looked at was that larger conversational novels with more people tend to be less connected, so this was associated with the move from novels like Jane Austen and the country into novels by Dickens in the city where there were a much larger group of people and cities were industrialized and therefore less friendly.",
                    "label": 0
                },
                {
                    "sent": "So the theory was that these larger conversational networks with more people.",
                    "label": 0
                },
                {
                    "sent": "Tend to be less connected.",
                    "label": 1
                },
                {
                    "sent": "We have two theorists here.",
                    "label": 1
                },
                {
                    "sent": "Franco Moretti, who says at 10 or 20 characters.",
                    "label": 0
                },
                {
                    "sent": "It's possible to include distant and openly hostile groups, and Terry Eagleton, who said most of our encounters consist of seen rather than speaking, glimpsing each other as objects rather than conversing as fellow subjects.",
                    "label": 1
                },
                {
                    "sent": "So our question was, can we show empirically that conversational networks with fewer people?",
                    "label": 0
                },
                {
                    "sent": "Are more closely connected.",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To construct the social network we had nodes which represented people who said something and we were able to do this task called quote Attribution with 83% accuracy.",
                    "label": 1
                },
                {
                    "sent": "We set edges equal to people who are talking to each other and we use quote adjacency as a heuristic for detecting conversations.",
                    "label": 1
                },
                {
                    "sent": "The edge weight was set to the share of detected conversation over the novel an we could detect conversation with 95% precision, but we only got about 51% of the conversations.",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We looked at the impact of network size, so according to our theory we would expect that as the number of named characters increases, we would get the same or less total speech an we found this to be true.",
                    "label": 1
                },
                {
                    "sent": "The number normalized number of quotes was flat.",
                    "label": 0
                },
                {
                    "sent": "We would expect to have a less lopsided distribution of quotes among speakers, and we found this to be true.",
                    "label": 0
                },
                {
                    "sent": "The share of quotes by the top three speakers decreases.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As the number of named and characters increases, we would expect to find lower density that is fewer conversational partners as a percentage of the population, and we found this not to be true.",
                    "label": 0
                },
                {
                    "sent": "Larger networks are more connected.",
                    "label": 0
                },
                {
                    "sent": "We would expect to find the same or fewer cliques, and we found this also not to be true.",
                    "label": 0
                },
                {
                    "sent": "The three clique rate increases larger networks formed cliques more often.",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we thought, well, maybe we should be looking at speakers, not just name characters, and so we would expect as the number of speakers increases, we would expect to see less overall dialogue.",
                    "label": 0
                },
                {
                    "sent": "This quote, glimpsing rather than speaking.",
                    "label": 0
                },
                {
                    "sent": "But we found this not to be true.",
                    "label": 0
                },
                {
                    "sent": "Larger networks are more talkative.",
                    "label": 0
                },
                {
                    "sent": "We would also expect lower density that is in larger networks people speak to more of their neighbors.",
                    "label": 0
                },
                {
                    "sent": "And we found this not to be true, that is, that in larger networks people know more if their neighbors, whereas the opposite should be true.",
                    "label": 0
                }
            ]
        },
        "clip_82": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We did find an alternate explanation.",
                    "label": 0
                },
                {
                    "sent": "Text perspective dominates the network shape, so in third person tellings we saw a significant increases in the normalized number of quotes, the average degree, the graph density and the rate of three cliques, all with no significant difference in the number of characters or speakers.",
                    "label": 1
                },
                {
                    "sent": "So our hypothesis is that first person narrators are not Privy to other characters conversations with each other and therefore they don't appear.",
                    "label": 0
                }
            ]
        },
        "clip_83": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So you can see this in a couple of the social networks that we produce.",
                    "label": 0
                },
                {
                    "sent": "This is 1 produced for Jane Austen's persuasion.",
                    "label": 0
                },
                {
                    "sent": "It's told in the third person you can see an is the central character.",
                    "label": 0
                },
                {
                    "sent": "She's slightly larger than the other and there are length so she talks with or other characters talk with each other pretty often.",
                    "label": 0
                }
            ]
        },
        "clip_84": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If we look at what's called a close third, this is where it's told from the perspective of one of the characters, so this is Braden's Lady Audley Secret told from the perspective of Robert we get a quite different shape to the network.",
                    "label": 0
                },
                {
                    "sent": "Robert again is dominant and most of the links are between Robert and the other characters.",
                    "label": 0
                }
            ]
        },
        "clip_85": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then finally, if we look at a first person narrative, so this is Dickens David Copperfield, the eye is very dominant and there are much fewer conversations between the other characters.",
                    "label": 0
                }
            ]
        },
        "clip_86": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what have we learned?",
                    "label": 1
                },
                {
                    "sent": "Well, we've learned that high precision conversational networks can be extracted from literature, and we think the time is right for the natural language field to be exploring analysis of fiction.",
                    "label": 1
                },
                {
                    "sent": "We are thinking about what we might have overlooked.",
                    "label": 0
                },
                {
                    "sent": "So these were theories, after all, by experts in literature.",
                    "label": 0
                },
                {
                    "sent": "Um Ann, right now what we're working on to look at something different is detection of scene changes in novels and thinking about the fact that the community can be seen from who's present in the scene and who knows each other whether or not they're speaking to each other.",
                    "label": 0
                },
                {
                    "sent": "And so this is something that we're exploring now.",
                    "label": 0
                }
            ]
        },
        "clip_87": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to close, I've looked at applications in four different genres.",
                    "label": 0
                },
                {
                    "sent": "I have ideas about how at least three of them, news, personal narrative and online discussion forums can be connected in one setting and thinking about the Wikipedia text.",
                    "label": 0
                }
            ]
        },
        "clip_88": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Seeing that the kind of information that plays a big role in getting these applications up and running is semantics and data from the web.",
                    "label": 0
                }
            ]
        },
        "clip_89": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We've also seen in some of the more subjective genres that pragmatics, that is information about affect or emotion, plays a role, and certainly real world context is important.",
                    "label": 0
                }
            ]
        },
        "clip_90": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I want to close by acknowledging the work of my PhD students who have played a major role in getting these systems up and running.",
                    "label": 0
                }
            ]
        },
        "clip_91": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I also want to acknowledge my path students where all of this work has had.",
                    "label": 0
                },
                {
                    "sent": "An impact overtime?",
                    "label": 0
                }
            ]
        },
        "clip_92": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So thank you.",
                    "label": 0
                }
            ]
        }
    }
}