{
    "id": "alglvegtnwokkuccd2kjvgq65u2yvlf7",
    "title": "Delayed Detached Eddy Simulation of Yacht Sails with Experimental Validation",
    "info": {
        "author": [
            "Raffaele Ponzini, CINECA"
        ],
        "published": "Jan. 6, 2014",
        "recorded": "September 2013",
        "category": [
            "Top->Computer Science",
            "Top->Computers->Software"
        ]
    },
    "url": "http://videolectures.net/prace2013_ponzini_yacht_sails/",
    "segmentation": [
        [
            "So we have Rafaela from CD, working from Milano on our supercomputer and he won't firstly have to lectures.",
            "First lecture will be on sale in the office and 2nd lecture will be on Bio Flo.",
            "Then after lunch we will start here also with tutorials and he will demonstrate.",
            "Quite complex bio flows on fluent.",
            "How is work so he will be working on PS on our supercomputer and you will be following this tutorials.",
            "All these tutorials are already available on.",
            "Web page, so you'll have to repeat this quite shortly after, and we are also recording.",
            "This so please verify.",
            "Let's start with your presentation, introducing yourself and explain how.",
            "Loste your license drivers license.",
            "Sorry so we have amplifiers.",
            "Everybody will hear you now.",
            "Thank you.",
            "Thank you very much.",
            "OK, so I apologize for not being there.",
            "I'm sorry I have the body of proof that is my license drive data as expired two years ago.",
            "I didn't really know what by mistake and so they didn't give me the car drive that they have rented for me from Ruby and to get to be on a so I'm here.",
            "I thank everybody from the technical lubiana.",
            "University becausw they really helped to overcome this problem.",
            "I hope that even if I cannot hear you, you can interact with me eventually by posing question to lay on that can send it to me and I can answer the question maybe after the lunch break.",
            "OK, so I will be glad to answer.",
            "My name is Rafael Poncini.",
            "I work in a computer center, but I have an engineering background.",
            "I have a PhD also in bio engineering, so I have let's say studied something that is modeling blood flow mainly OK. An after that I start working in a computer center in.",
            "I switched my activity on deploying a best way I performance computing infrastructure to, let's say engineer engine put into a much more engineering way.",
            "The computing aspect of modeling blood flow.",
            "So you are there, you are hosted in actually infrastructure that have quite big.",
            "Saturday's computer and facility.",
            "So maybe I will from time to time give you some advice about how to have strong interaction with the machine.",
            "When the invite me to have a lecture at the this winter school.",
            "They asked me actually two kind of topics, so one was should be much more strongly related to HPC, so I performance computing an both of the lecture have to have industrial Director say less direct but industrial fallout.",
            "So I selected two kind of lecture.",
            "The first one that I'm going to give you right now it's.",
            "Electrode that is related to.",
            "Numerical simulation of yacht sailing.",
            "And this is the much more HPC focus at one, the other one that I'm going to show you later on this morning and then the afternoon, that with the tutorial it's much more related to my let's say student background.",
            "OK as a PhD.",
            "So it's biomedical in that kind of lecture.",
            "I will not stress the HPC aspect even if they are present.",
            "Becausw biomedical biofluids, let's say can be.",
            "Approach had also without very large infrastructure, so can be handled also on smallest infrastructure, whereas as you will see the first lecture in on detail on on your sailing CFD require higher HPC infrastructure.",
            "So let's start with the first lecture."
        ],
        [
            "The first presentation gonna have.",
            "Let's say I'm going to present you the sale this project, which is a collaboration project.",
            "So actually it's between between computer center and universities.",
            "Material methods we I will show you very synthesis.",
            "The modeling.",
            "Let's say decision that we take to study this problem.",
            "Then I will show you the results an the future possible development of this."
        ],
        [
            "Work, they said their project save this project is a collaboration between Janecka in the University of Newcastle that.",
            "Through its school of Marine Science, Technology, and in particular thanks to the collaboration with Professor Viola, we decide to, let's say, put together different competence from high performance computing to Marine CFD to, let's say, to bring innovation for industry.",
            "So that's why I select this kind of lecture also for the for the school, because it's I think, very focused on the main intention of this school.",
            "The first outcome of the of the project is this collaboration.",
            "Also with ANSYS Italy OK and is the result of this."
        ],
        [
            "Of this that I will present you OK, so in much more in detail.",
            "OK, I show you.",
            "There is HPC side that have been covered by Janecka Ann Marina competence CFD competence that have been covered by Newcastle University.",
            "And also of course there is software to use that have been furnished by ANSYS but more in detail we have let's say the philosophy that is behind the service project is to use measure that have been performed.",
            "Really, there's been built also the measurement campaign at being built 2 model the measurement campaign, so it's not usually in this kind of project.",
            "While you can have is, maybe you have wind tunnel data.",
            "OK, that you see here on the left, but usually this wind tunnel data are not, let's say, built in order to be modeled in a CFD using CFD software.",
            "This cause several problems usually so.",
            "Once you have the model in the CFD you it's very hard to, let's say, make a right calibration of the model.",
            "Within the experiment an always you find out that the condition were not exactly the same becausw when you did the measure in the wind tunnel, you didn't.",
            "Let's say kept all the number that you need to bring into the let's say in silico model.",
            "So the CFD model.",
            "And this causes several problems in the sense that after that you do all the work to bring measure into model and then you cannot compare the two results.",
            "OK, the philosophy behind the service project is to build measure, but already thinking to the fact that this measure will be modeled in a CFD way.",
            "OK, so all the winter nailed experimental campaign as.",
            "To say has been built with regard to the fact that one day it will be put into us if the model OK, so the main philosophy is from measure internal to model to get much more insight, OK?",
            "And they cite the in this."
        ],
        [
            "In this kind of problem, are related to really, let's say, industrial in the sense that are real scale real life scale product problems.",
            "So during America's Cup, other kind of, let's say sailing yacht than the one they are acting now.",
            "So the AC-90 class.",
            "Anne.",
            "You need to perform experimental and numerical activity to study the best.",
            "Let's say configuration of the of the windage to have to obtain the maximum.",
            "Let's say velocity of the of the boat, let's say.",
            "To do this?",
            "Ola ever spend several years at the Yocto Anna Research unit at the University of Auckland, which is also involved in this project as a byproduct.",
            "There he worked for several year and the outcome of his work are mentioned here.",
            "OK, you can find the reference here on this slide.",
            "It worked on experimental measure, so it worked on built.",
            "The best setup to perform wind tunnel test OK.",
            "This is a snap of the wind tunnel at the Yacht Research Unit, University of Auckland.",
            "With the twisted vein device.",
            "OK, and this is the instrumented sailing doctor.",
            "OK, with the fiber sailing that are built an constructed starting from images and then built in order to have rigid body here.",
            "OK all this facility allow you to instrument.",
            "With several point pressure Point Re say and also to get the resultant of the forces acting on the Salem.",
            "The necessity, let's say from 2 to pass from the experimental setup to CFD, relies on the fact that the experimental setup, even if it's very, very detailed, like in this case, did not have the ability of give you point to point information OK, and it's very hard to post process the information you have one, so you want to have less a visualization of.",
            "Also, the structure that they are involved in the physical problem that you are studying with the experiment.",
            "So in synthesis experimental setup in this field gives you let's say integral OK value an in app distribution over the sale even if in this case we have much more information.",
            "But in general you have integral, so the result of the forces acting on the sale an by as a by product on the yachts.",
            "But this some cases since is an integral, so you can have several contribution you don't maybe understand exactly where where did it come from the different contribution and how you can say performer and optimization of the windage in particular to get more.",
            "Performance on your on your setting.",
            "OK, so."
        ],
        [
            "Usually.",
            "This is in general like this.",
            "Experiment are then bringing to computational environment.",
            "But usually we.",
            "You do this with the the since you have a problem with, say, turbulence and several.",
            "Let's say there are several fact that they are involved in modeling in the right way.",
            "This kind of problem you use usually run on average modeling in order to handle the complexity of the tool, whereas model without paying too much on computational resources an get numbers that.",
            "Can be reliably compared to the internal measurements.",
            "But the.",
            "Also, this kind of model, even if they allow you to post process, an app visualization and stuff like this, I will show you that even this kind of model so runs modeling of internal test did not allow you to have correct information.",
            "And but on the other hand, if you want to spend the same or sales on that, you.",
            "Are obliged to use less modeling?",
            "OK now in fluent recently it is also available.",
            "This kind of modeling which is the detailed detacher data simulation which is modification of the detached Eddy simulation implemented by.",
            "By some researcher Ann.",
            "And this kind of modeling allow you to have, let's say, runs approach nearby the sailing Yacht K and then the sale and allows you to have less kind of less modeling on the downstream of the of the sale.",
            "So all the problem related to windage and related to the flow structure that they are behind the physics of this problem are well handled.",
            "OK so.",
            "In very short we we modeled the Navier Stokes equation for Newtonian fluids.",
            "OK, so is an incompressible navier Stokes equation formulation with the detail delayer detach the simulation model.",
            "OK and it's the let's say we just click it on the default.",
            "Top that is available on on fluent.",
            "We selected a turbulence model.",
            "OK that is.",
            "Available influenza an we we didn't model in any way.",
            "They will function so we use it.",
            "The standard will function that are available in fluent.",
            "We use a simple seat pressure velocity coupling scheme.",
            "Anne.",
            "OK, we we also imposed an intensity of the turbulence of the 2% uniform at the inlet, and we posed a boundary condition at the inlet as flat glossy profile with this value and the Reynolds of the, let's say, Spinnaker, so nearby the spinnaker is of this magnitude.",
            "So 10 two point 10.",
            "Two power five.",
            "OK, so it's it's pretty big and DNS or less modeling.",
            "Of the overall problem would be, let's say hardly and the ball in the time to give time to market of giving numbers in this kind of problem and also post process.",
            "This kind of will be a problem itself.",
            "OK so you can model but it would be unfeasible from industrial point of view."
        ],
        [
            "Much more, let's say approachable, so it's using this kind of model that in order to have a correct balance between cost, an accuracy allows you to.",
            "As I told you before, to model to treat an ear war region in France like manner.",
            "So low cost, let's say and treat the rest of the flow in a less like manner.",
            "So more expensive, but in.",
            "At the end, but not very much, because far away from the boat you don't need.",
            "You don't have the boundary layer, so you don't need to have cell death small.",
            "OK, so this balance that have been proposed by Spotlight ET al in 97.",
            "Can be reliable and we tested during this kind of project how it can be implemented in a HPC environment.",
            "OK on a realtor."
        ],
        [
            "Case so the measure that have been provided by the.",
            "Newcastle University to do this, we selected three mesh size OK Ann.",
            "We performed different windtunnel loops where we talked with Windtunnel oops, I mean that."
        ],
        [
            "We let the flow enter into the wind tunnel and then get out and then this let's say can update the flow.",
            "Also teach at each loop and this."
        ],
        [
            "Is the fact that this is the sense of this value so 38.",
            "Wind tunnel oops means that the wind have come?"
        ],
        [
            "Into the inlet and exit the outlet 38 time OK. And so we are."
        ],
        [
            "Really calm, confident that at that point the solution was really good.",
            "The timestep selected was of this order of magnitude, and we perform it.",
            "Also, a rans simulation to compare with the DDS simulation.",
            "For the the medium size mesh we were able to perform 10 winter loops and also we have the runs, but for the biggest mesh that we are we have planted at the beginning to to perform the simulation.",
            "At the moment we have not yet perform sufficient to internal test and also we didn't fix the correct time stepping and the run, so it's not available as well.",
            "We tested so actually the project as free mesh, but in fact we only tested two meshes from 4 to 32 million an we tested the scalability on up to 256 core OK. Anne.",
            "The important thing is that for this kind of project, answers provide us the.",
            "The license for fluent four for free.",
            "OK, so it gives us the licensing for two to perform the scalability test, OK?",
            "And."
        ],
        [
            "The hardware that we we use it is standard exultant, assesses Santa Cuatro standard in in the sense of HPC infrastructure, so they are exact core machine.",
            "OK, so not very, very new because the project began years ago.",
            "The Giga power cord was not huge and this is quite common in fluent.",
            "It's not very expensive from rum point of view, but the important thing that I underline you is that the machine was interconnected with InfiniBand could year.",
            "So for the one of you that working on HPC this probably is not surprising because when you want to go up with the computational core.",
            "If you don't have.",
            "A really stronger interconnection.",
            "You will not lost all their performance.",
            "OK, and this is also true for fluent because I perform several tests comparing, say, infini band with Gigabit Ethernet and this for this kind of project.",
            "When you are, let's say approaching problem that big or also even that big.",
            "But you want to perform several several simulation you need to have very strong interconnection.",
            "If you want to.",
            "Go up with the parallel.",
            "Then we use also facility for remote visualization becausw this is also as you seen, there are several entities that working on the project.",
            "There was also two students ship, one from Paris and one from Politecnico di Milano that are working on the project.",
            "And to allow, let's say, a common environment and not moving file.",
            "Also upload and download the.",
            "We use this remote Visitation fat node.",
            "It's DL9999 eighty from HP that as a stronger capability on Ram Becausw produce mesh.",
            "So preprocessing and postprocessing can be very demanding from RAM POV and to compress the output graphics we use the nice DCV.",
            "Technology.",
            "OK, so it's actually a TCB with compression on it."
        ],
        [
            "This capability on our cluster, so I show you the efficiency showed that up to 256 we still have 70%, so 0.770% of the efficiency.",
            "OK, so if you compare I'm sure you are aware of what these officials but just to be sure that you understand if you let's say every task that on single core it takes.",
            "A certain amount of time if you perform the same task on a number of quarter is equal to N. You expect to have one divided by the same number, so one and divided the time that you spent OK.",
            "So if you make the.",
            "Damn, this kind of evaluation.",
            "You can have the efficiency of your parallel computing.",
            "OK, so becausw, since licensing is, let's say, an expensive also task, you have to evaluate if you want to propose this to industrial audience.",
            "What is the cost and the cost keeping valued at up to 70%?",
            "You still have a good scalability.",
            "OK, we.",
            "Decide that this can be a three shot, OK.",
            "The rest modeling will show and let's say in a half a day you have winter in a single internal loop, OK?",
            "But the week to our more rich modeling.",
            "So they did the yes model.",
            "You need to spend 2 days in order to have a windtunnel loop acquisition of that, OK.",
            "This, in my view, is something that is visible in the sense that you are spending.",
            "Let's say the four times the cost.",
            "But as you will see in the in what follows, you have, let's say much, much more rich information, and in some cases this is necessary."
        ],
        [
            "In particular, I just mentioned something that this is not, let's say, muscle number crunching made on HPC center.",
            "This is experimental setup focused on CFD modeling, but the CF model has been strongly compared with the measurement in the sense that we just not need to say OK.",
            "It's that fast to perform this kind of computation.",
            "It's cost that giga to achieve the data.",
            "It's only a matter of fact of having an accurate number.",
            "OK, so at the University of Newcastle, because they are just said the proposal came from that side.",
            "They perform an analysis of the accuracy of the model with the DDS an with compared to the experiment.",
            "OK. What you can see is that.",
            "On the on the sale if you.",
            "Are working on let's say a different level K of the sailing.",
            "You can see these are charged that are selected at different.",
            "It's a coefficient or pressure coefficient, plotted a different section along the sale.",
            "An compared numerical with experiment.",
            "What you can see is that at the bottom an at the top of the of the sail yacht where I have flow separation and vertex presence I have and I are in certainty.",
            "OK, so this makes sense.",
            "OK, it's about.",
            "The incident is also acceptable so.",
            "This is, let's say it's a fair analysis of what we have tested.",
            "OK, even if I am as a computer scientist, much more interested on the scalability case on the feasibility for industry from the University of Newcastle.",
            "They're also interested on the accuracy of the model, of course, and the model in somehow it's, let's say, accurate to perform also numerical campaign to achieve data to perform optimization.",
            "OK. What is?",
            "Sorry is not.",
            "OK so I go up here so.",
            "We were OK. We were considering that also from let's say from an accuracy POV its value."
        ],
        [
            "Other project, but now you will understand why we try to test this.",
            "This technology we try to test this technology becausw.",
            "After all, we are able to visualize understand what is behind the, let's say the resultant of the forces that we are reading on the surface of the sale, but also acting on the yacht OK?",
            "So in this image you have.",
            "Maybe you very interesting output, that is, these are the leak surface, so there are the shear stress.",
            "Let's say map add on the surface of the sale of the sale with announcement of detaching and Reattaching zone an attached zone.",
            "OK, and now you would understand why a different level of the sale you have higher or lower in certainty, OK?",
            "An you will understand why you should spend cell to model this kind of problem.",
            "OK Becausw downstream of the everybody knows that everybody that works in this field of application knows that they are.",
            "Vartox on the top an some structure complex structure on the bottom part and that in the middle the flow.",
            "It's mainly attached OK, but it's very I mean my.",
            "As far as I know this is the first time that you can visualize correctly what kind of structure you have there.",
            "To do so.",
            "We use also synthetic value, which is the criterion.",
            "And here I explain you.",
            "I invite you to reflect on the fact that the without the CFD modeling.",
            "So if I only use Windtunnel data, I will never be able to visualize the criterion becausw the amount of information that I need and space in space and time, so spatial and temporal distribution of the data of the information in the flow field.",
            "I cannot measure it using Internet facility OK.",
            "So that's why CFD is unique tool.",
            "Also in this field of application to enrich.",
            "The measurement that you can perform in the winter, not to, let's say, pass by the wind tunnel, but to enrich the information and analyze what is behind all the physical that you are measuring in."
        ],
        [
            "In a synthetic way, OK, but you are obliged to do this, and under win 10 on the Internet, OK?",
            "If I go further, we visualize it with the top view and a side view.",
            "This flow structure in the overall field around the sailing yacht OK?",
            "An what you see he answere Kate we use to color coding so blue and red.",
            "It's at the olicity and you know Olicity is a product of velocity and vorticity.",
            "So it measure if they are clockwise or counterclockwise turning the structure above text that is in here OK.",
            "So this is positive and negative related to the fact that if they are turning.",
            "Clockwise or counterclockwise OK.",
            "This is the sense of the blue and red an.",
            "These are quickly tell you allows you to have a synthetic visualization of current flow structure.",
            "OK, so it's a synthetic indicator very strong for post processing of data and what we see here is what we were also expecting.",
            "So we have let's say very static vertex on the tip of the sale and complex flow structures that are, let's say.",
            "There are created and destroyed OK on the downstream of the sailing yacht.",
            "This is in theory well known OK, but it's very hard to see it.",
            "Show it in an experiment.",
            "This show."
        ],
        [
            "Be an animation, but it's not important because it's a static vertex and you can imagine this structure that it's it's created here and it evolves from here to there.",
            "OK, it's not really different.",
            "The static image from the animation.",
            "So this is our current structure that we have announced in our experiment and that cannot be announced with only measure.",
            "OK, so CFD in this field will help you on have much more insight.",
            "That sees the main.",
            "The main goal of our activity."
        ],
        [
            "Now, since we are proposing this kind of approach to industrial application and since we have measured and we have shown you that this kind of modeling is much more expensive, about four time OK to have similar information on the surface of the yacht sailing.",
            "So the resultant of the forces that you will measure and the coefficient that will measure on the sale.",
            "It's about the same but.",
            "If you spend cell to perform much complex modeling so the one they were proposed here compared to the runs, which is quite inexpensive as a model.",
            "And we."
        ],
        [
            "We can show you that you have a much more rich information and this is of course, but this information is not only much more rich, is much more precise because if you analyze the position of the main vertex.",
            "OK, so if you analyze the position and the center of the flow structures that are present here, you see are quite difference.",
            "OK, an now since we know that things if D if you spend much more self you are let's say more precise OK?",
            "We we can state that runs modeling not only not show the present of complex structure that they are there?",
            "OK, so see this, but it is very oversimplified.",
            "But also it positioned the center of the vertex in the wrong in the wrong way, which is much more important for some kind of application.",
            "The main application that we see using this model, it's the Windows study an optimization.",
            "This kind of problem for this kind of American Americas capture is ongoing.",
            "Right now.",
            "It's a problem that I know that it's of interest.",
            "OK, 'cause I have you seen the two Bolt?",
            "They are racing the Americas Cup tonight.",
            "They're going to make, let's say the less race, and probably the one that is going to win the Cup is going to win for 10 seconds, 20 seconds.",
            "So very small, different so.",
            "They both are very similar and they're going in the same way.",
            "Probably if you can have a small, really small advantage, maybe optimizing some windage effect you can win on America's Cup next time.",
            "OK, so this is in my view a possible take home."
        ],
        [
            "Message.",
            "So the implication of our study is that the study of traveling structure around the complex 3 dimensional geometry.",
            "Can show separation reattachment zone that are playing a main role an are very expensive in terms of numerical and experimental setup.",
            "For this reason, experimental an numerical setup should be should work together, so experiment are much more expensive than numerical, but they are necessary to build the model and to validate the model.",
            "And once you have, say, a valid model, you can launch several optimization study that it's very hard to do in the winter for several reasons.",
            "So mainly I can say that you cannot visualize.",
            "Understand the physical problem an you don't have the full control of this app.",
            "Once you are changing and optimizing, so the measure it's much more difficult to do it online on real life with tunnel that on the.",
            "Virtual one, so using CFD OK. And also the fact that the experimental setup can be designed tailored to validate numerical models.",
            "That's what I'm saying, and that also numerical modeling.",
            "So like the DDS that we have studied here.",
            "If they are used on a performance, computing resources are feasible because you are spending, let's say two days to have one number which is not.",
            "Out, let's say of its affordable cause."
        ],
        [
            "Effective in our view.",
            "In a future we are seeing.",
            "We need to, let's say, enlarge our application to.",
            "To higher scale OK and we want to test also new technology Becausw X 8664 technology now is an ascending from from starting from near him.",
            "Now it's we use the West Moran.",
            "Now we are on Sandy Bridge technology and it's going to be a new one and also ANSYS is really strongly engaged on Intel Process development an we're the new version.",
            "14 point .5 version answer is also tailored to the to be, let's say more aggressive on the scalability.",
            "Also for very large number.",
            "So over 1000 core you are expecting to still have a nice performance using the next generation of Intel Core, but we didn't test it yet and I think that that will be also a message for for inducing.",
            "OK so this model will be tested there too in the near future."
        ],
        [
            "I have to acknowledge all the people involved and also answers Italy that provide the license and as I."
        ],
        [
            "Say I thank you for your attention for the question.",
            "I suggest maybe that you can maybe learn can during the lunch break get main, let's say question and then I will answer at the beginning after the lunch break.",
            "I if if it's OK with you, OK. OK, this ends the first lecture that was the more."
        ],
        [
            "HPC one now I start with the.",
            "He said.",
            "I don't have any stop from Lyon.",
            "I keep go and I and I make my second presentation which is an introduction on CD in IMO Dynamics.",
            "As I mentioned, I have studied by engineering with a Masters thesis on computational hemodynamics, and then I perform also a PhD on that topic at the Politecnico di Milano.",
            "So I have, let's say, a really clear background on this kind of application, and once they got to this computer center, I start, let's say, improve the way that you can use CFD enable dynamics to have a stronger platform to perform some kind of application.",
            "What they will?"
        ],
        [
            "Discuss, you know what we show you with the lecture it's, let's say, a multi level presentation.",
            "So in the morning we gonna.",
            "I'm going to make you very very high level introduction OK, But after that the things we need to have also tutorial.",
            "I also have to introduce you some theory.",
            "The high level in the sense very.",
            "We're going to Best Buy, but I have to tell you what kind of equation we are solving an what kind also of hypothesis are reliable to model this kind of fluids with CFD?",
            "OK, I will show you some example and then we're going to see well defined implementation using, let's say commercial tool which is ANSYS fluent.",
            "But as I will tell you along the presentation several time.",
            "You can implement in whatever code you want.",
            "I mean I'm going to give you the direction to the fact that there are some hypothesis that can be easily.",
            "Introduce it to perform a correct modeling in CFD, but then you can implement this using no matter which tool.",
            "OK, in my experience I have been using fluent because it's a robust product.",
            "It's out of the box and also because my computer at the master make me start with that and I was just keep going.",
            "But I know that there are several other possibility.",
            "So the implementation is going to be on hands on session, so I will show you the user the graphic user interface of fluent 'cause I don't know the audience what kind of background have on fluent.",
            "So if you are already let's say if you know already the software or if it's if you are new to fluent, OK so I will show you several thing but.",
            "There is also advanced topics.",
            "OK, so as user defined functions so the people who already use fluent for other application maybe can be interested on the last part of the tutorial, which is quite advanced becausw it use user defined function which is the one of the most advanced topics that you can have in fluent.",
            "So CFD is something."
        ],
        [
            "That have it's a computation through dynamics, but have two parts, so there is free dynamics which is physical.",
            "Study the physical fluids and computational, which is something related to numerical, numeric involved in solving the equation.",
            "In this case, the equation that describing the motion of the fluid.",
            "In this field application, so CD in general there is a strong interplay between math, physics, physics, knowledge of the phenomenon and technological tool and environment, OK?",
            "Unfortunately, there are no general rule for specific models set up an there is a need of a periodic knowledge of the food behavior, so you need to know what you are studying strongly as from the physical point of view, to perform hypothesis, an simplification cause it's quite evident that the physical fluids it's.",
            "At the full scale it's very complex, so you need to simplify by unity simplify with some hypothesis in mind.",
            "OK, so that the model is reliably related to the physics that you want to study, OK?",
            "And in general, if possible, you need to have experimental or theoretical innocence analytical solution data to validate the safety results.",
            "So even after you have implemented with correct hypothesis, you're.",
            "With your with your CFD code, you need to verify that in some circumstances.",
            "So as we we have done with the show you with the setting, yeah.",
            "You have to compare your result to experiment.",
            "Also here it's it's a good way of proceed and much more since biological fluid are really complex also to have in terms of data.",
            "So it's very complex to have the experimental setup for hemodynamics.",
            "You better found also analytical solution."
        ],
        [
            "So let's see the the computer engineering workflow in this kind of application.",
            "So we had physical fluids.",
            "So here I put some image of phase contrast MRI, which is a technique of imaging that allows you to map not only the anatomy that you are looking at, but also for each voxel the value of the three components of the velocity of the fluid that is flowing in that in that.",
            "Region OK. From physics you got to computational, so you extract mainly two quantities.",
            "You need mainly two quantities to do this kind of stuff, and they are geometry OK and the boundary condition so.",
            "You can measure this in vivo.",
            "OK, so the geometry can be extracted from images using several tool.",
            "And the boundary condition can be imposed.",
            "Can be measured and then impose it at the boundary.",
            "OK, once you have done that, if you want to, let's say be really productive, you have to go to an HPC environment to perform number crunching and visualization and visualization.",
            "It's one of the main advantage of, in my opinion of CFD, that's why also people call it instead of computational fluid dynamics.",
            "Some people say that is colored through dynamics.",
            "But it depends on how you implement the model, but visualization is in my.",
            "In my view, one of the strongest.",
            "Benefits of CFD and I will.",
            "I will discuss this later on."
        ],
        [
            "In order to pass from physics to model by middle of measure you need to have measure.",
            "An measure can came from in vitro models, animal models or in vivo OK. You always have to remember that in in any kind in any field of Canfield application.",
            "But in this one much more measures are necessary to build reliable CHI models.",
            "So I can order that is not related to any that being measured.",
            "It's in my view not useful at all, OK?"
        ],
        [
            "In vitro models.",
            "In this I just put a slide, so usually you have.",
            "Mock set up part of the summer part of anatomy in this case is that because speed person valve.",
            "That have been studied by Ricardo Vismara Project Milano at the Four Cargo Lab, which is a lab managed by engineering but inside Domino Hospital in in Milano.",
            "OK so.",
            "With this mock you see that you can study the dynamics.",
            "That's why I show you some snap.",
            "The dynamics of the flow flowing through this, which is a valve.",
            "OK, that open and close according to the different pressure between the two side OK. You can in this.",
            "Experimental setup you can of course measure some quantity.",
            "OK, so let's say the pressure the Delta of the pressure that makes open an.",
            "You can, let's say make movie and trace probably points also an verify the distribution of.",
            "Position of the valve along time.",
            "But what is much more hard to do is to, let's say measure point to point, what is the value of some through dynamics index OK?",
            "And This is why I tell you that.",
            "Free dynamics made by.",
            "Easy Commander, so computational fluid dynamics are much more powerful tool to post process the data.",
            "So in the same way as I show you that in the Sayoc the problem the Windows study can be approached.",
            "In my view, only win with CFD and.",
            "With much more, with advanced modeling CFD here I said that anymore dynamics where you have problem of getting into the district that you want to study because you cannot, let's say open.",
            "Somebody K and.",
            "And perform a measure inside of a human body.",
            "Anne.",
            "Much more there.",
            "CFD can be really advantage to perform some kind of study.",
            "I will.",
            "I will discuss this as much as I go on, but I want to make sure that also if you get in vitro models, this will not close all the information you need to study this problem.",
            "They can help you to understand the phenomenon of course, which is required an to build the computational models that are related to physical phenomenon.",
            "And you can compare it, but after that only with CFD you can get some kind of insight of a problem OK. Another way to get data from real life.",
            "It's animal models.",
            "This is PT Fe implant device, so it's a change of value."
        ],
        [
            "Cooler part of an.",
            "Of a sheep.",
            "OK with the let's say.",
            "It's made of some kind of material that is not biological, of course, and they substitute this vast quadratic on a ship an.",
            "For this reason, you can, let's say, analyze in detail how geometry perform changes on the flow field OK in an animal model, and you can measure some quantities along time.",
            "As you see in this is very rude image and I put it in in purpose.",
            "The reason is that in this case, in my view CFD can be a more ethical approach to some necessary measure, but at the moment worldwide in vitro models and animal models are the main let's say the main model that are available for obtaining data.",
            "OK, so see if the is growing, but it's not the the main activity.",
            "This kind of implant have been performed by by Fabio Coachella.",
            "Steven abisola.",
            "I work with them in the past and this is kind of duty now.",
            "It's closed because I'm focusing much more on other topics.",
            "But they are valuable research on this kind of field.",
            "And the the last possibility to get in to get data related."
        ],
        [
            "Biological fluids are in vivo image OK.",
            "This should be an animation, but it's not.",
            "It's not relevant to get as an animation.",
            "These are phase contrast MRI acquisition OK?",
            "This kind of technique it's now increasing interest on researcher becausw.",
            "It allows you to get certain insight.",
            "So very rich information.",
            "Because this on the left side I see the anatomy of the same district.",
            "This is an Arctic arch OK of a human.",
            "Person and this is a noninvasive technique to get this kind of information, and on the other side I have all the same district.",
            "OK, I have also let's say voxel by voxel information on the three velocity encoding direction of the velocity field.",
            "So it started to became something that is really similar to CFD Ann, you are, let's say, invited to say so why we don't just get this kind of image.",
            "An process as CFD data and visualize this is what I've been done on the really less part of my of my PhD thesis Ann.",
            "I agree with you that this is a very interesting application, but.",
            "At the moment do also for cost of the acquisition and time duration and the fact that if you have a subject that is not healthy cannot stay into the.",
            "Meineke Restaurants machine for long time OK, this kind of acquisition can takes up to one hour.",
            "OK, so it's pretty long.",
            "An and also that space in space and time.",
            "You're really obliged to in order to limit the time OK inside of the machine and also the dimension of the data you need to.",
            "Let's say ever a very quarter information with respect to the accuracy that you have with safety, OK?",
            "So I believe that the interplay still necessary at the moment, but this is a very interesting technique that in the future can give information that can be processed as safety data.",
            "OK, so with synthetic index and I will discuss this later on.",
            "Also this acquisition we performed by Joanna Reed so.",
            "And Marcelo casually from Philips Italy that they supported us.",
            "So once we have the, let's say the physical model, even if."
        ],
        [
            "Came from images or from experimental setup or from animal model.",
            "Once I need to have a geometry.",
            "OK so once I have the geometry no matter where this come from, I have to let's say ever matching tool in order to have a discretized geometry in order to perform CFD."
        ],
        [
            "Once I am in two days CFD solver activity, it is presented me.",
            "The scenario is wide so I have open source academic or analysis software and have commercial one and this again open.",
            "Other scenario on the methods that are used to solve the equation.",
            "So finite volume elements, spectral methods, lattice balls, one that is increasing.",
            "Pretty pretty much now in the last decade is lattice Boltzmann method for IMO Dynamics.",
            "Our growing growing an also from HPC center, it's interested becausw the way that our implementation of this kind of methods in HPC infrastructure is very interesting and scalability's probably higher than the one obtaining with finite volume or finite element, OK?",
            "So I think the same, but I I'm not experienced at the moment on performing this kind of modeling."
        ],
        [
            "OK, once I have the geometry and the mechanical property of the vascular and the principle of the conservation equation of mass and momentum, I can say compute the solution of this equation to have, which is the which is the output velocity and pressure distribution for each point of my discretized geometry."
        ],
        [
            "OK.",
            "So the the main approach that is behind this is that the computational domain once is discretized OK."
        ],
        [
            "Has me on ever, let's say.",
            "Conservation general conservation equation for mass and momentum.",
            "And that are discretized into algebraic equation OK and solved for each cell and cell in the descriptor in the discretization OK.",
            "So the Jenna."
        ],
        [
            "Our concept that is behind is that say if the number of cell goes up to Infinity then that makes solution get to exact and this will be independent from the numerical scheme that I adopt.",
            "So but in practice the number of cell is fine it OK?",
            "And ended up the numerical solution tends to be just OK. OK so I need to.",
            "Perform a balancing of accuracy and cost because otherwise the problem will be unapproachable OK.",
            "But once I decide to understand playing, let's say my problem from an American point of view.",
            "This will affect the the property of the numerical scheme that I use will affect the solution that I'm looking for."
        ],
        [
            "OK so I have to take care.",
            "The other CFD concept is that exactly analytical solution are not available due to several complexity that I'm going to show you.",
            "So numerical algebraic approximated solution of the problem are the only way that I have to perform investigation on this environment.",
            "OK, why is that asking environment?"
        ],
        [
            "That the fully 3D I show you here very.",
            "Let's say different view of the same geometry that asks you to understand that this problem is really 3 dimensional.",
            "OK, so there are no.",
            "You cannot see any symmetry.",
            "Plane or line or stuff like this.",
            "This is a very fully trendy problem."
        ],
        [
            "And this in in nature the the flow waveform at each boundary.",
            "It's usually due to the effect of the heart pumping.",
            "It's something that has time dependent.",
            "Wave form OK. An Moreover, it is not even constant for a selected slice.",
            "So it's change in time and change in space at the same place.",
            "OK, so the space and time distribution is quite complex, OK?"
        ],
        [
            "So the other the other big task is the teknowledge so.",
            "Experimental knowledge on the wall property and fruit of all interaction and the velocity profile distribution is a problem because once you have set your your CFD model, you.",
            "I mean, you you don't know what kind of boundary condition is reliable for that geometry, because it's really hard to measure it in vivo.",
            "OK, now with the technique that we show you.",
            "If you have the facility because I remember you that this kind of measure that are very.",
            "Interesting this one."
        ],
        [
            "You need to have a face contrast MRI machine with cost very very high.",
            "An I mean maintenance and stuff like this so it's very hard in this field of application to have correct."
        ],
        [
            "The measures OK. Anne also is a task environment becausw the interplay of mathematics, numerics and technological platform are stronger, so I have to map concept mathematical.",
            "Consider convergence, consistency, instability into boundedness concern, conservativeness and transport illness that is the counterpart in the numeric.",
            "Because I'm not I have a problem that mathematical description but then the solution is numerically.",
            "Obtain it so.",
            "I have an interplay that I have to manage."
        ],
        [
            "How did I use in my in my experience?",
            "I've been saying it is that the CFD can be really helpful an economically and also ethically in my view.",
            "More.",
            "Inexpensive cost OK. For several application I have put some reference of work that I have been done along my Mycareer.",
            "That are, in my view, useful to have an inspiration for future work.",
            "If you want to use CFD anymore dynamics.",
            "So perhaps the first work that I've selected is system analysis.",
            "An optimization OK of a blood filter and there.",
            "Let's say we are.",
            "We were interested on using CFD to track bubble inside of an anterior line filter.",
            "At two understand.",
            "What part of the filter is more stressed in terms of say, more?",
            "Oxygen, an size of different size bubble of different size of oxygen are captured by the filter in some places instead of other that are let's say mostly unused.",
            "OK, that's why I said the system analysis.",
            "OK, an optimization that you can suggest changes on the geometry in order to obtain a better performance of the arterial line filter.",
            "Another another application of save the new modern Amix in My view is detailed measures in the sense that.",
            "Once the clinician or researcher requires data from.",
            "From phase contrast MRI they can give you several data to build CFD model in terms of geometry and boundary condition.",
            "Very accurate.",
            "OK, but after that the overall flow field inside cannot be processed.",
            "With sufficient accuracy in space and time to obtain synthetic index.",
            "Useful in human dynamics.",
            "You can only do this in CFD at the moment, OK, but in the near future probably is going to be possible.",
            "Possible also to bring this kind of technique inside of measures of PC MRI.",
            "But at the moment, CFD is the only solution to perform some kind of study.",
            "In particular, I have selected this one which is the 1st of a quite long serious that is radical flow analysis inside of in order to rely flow, an author Genesis risk in auto coronary bypass.",
            "But the main concept inside of this paper.",
            "That's why I selected.",
            "Only this one as a, let's say, very precise indication as a reference.",
            "Because this is the first paper that we wrote where we underline the fact that atherogenesis so some phenomenon that occurs at the wall vessel location is related to the presence or the absence of helical structure in the flow field in the bulk.",
            "OK, so in the mainstream of the flow.",
            "Anne.",
            "Without CFD, it would not be have been possible to.",
            "Measure the interplay of.",
            "Stress at the world end.",
            "Illegal presence inside Becausw with other experimental measurements.",
            "We were not able to compute Erekle flow quantities OK with accuracy and wall stress analysis with accuracy and perform.",
            "Let's say a statistical study, two found if they were an interplay of what kind, OK?",
            "After that, this interplay has been, let's say, founded in several other application.",
            "But this is the first paper where we focused on that and for this reason, without CFD it would not have been possible to do this kind of implication.",
            "Safety in dynamics is also important for hypothesis testing, in the sense that it's very easy once you have built reliable safety model to make changes of quantity that are really hard to change in experimental setup.",
            "In this in this case.",
            "We we studied the influence of the outflow condition, OK?",
            "With regard to helical structure inside, so we can just you can.",
            "Perform the so called what if analysis?",
            "So if I change if I change distribution of the flow split, let's say in an accurate ification, how can this affect what I'm looking for?",
            "OK, this is a very important kind of application.",
            "Another another selection that I put here is validation of clinical practice that I call a Doppler serious in the sense that in my career I start with my master thesis on this kind of problem that is.",
            "In clinics, there are several hypothesis there are related to measurement in human body.",
            "An one of these was related to the flow rate measurement.",
            "When you are using a Doppler, so only velocity information.",
            "Anne, sometimes.",
            "Finish and forget to verify if on their context, they prothesis, there is behind the measure, they are still valid, OK, and this is can be a problem in the sense that you can easily show with CFD that if they put, this is not valid.",
            "I mean, you are using something some formula OK, very simple to apply.",
            "That condition likes very much, but this totally let's say.",
            "Are reliable because they practice is not valid anymore.",
            "I have been showed this within the context of Doppler measurement for for blood flow, blood flow rate measurement in vivo and we have validated we have studied at the beginning only with CFD and then we keep being moving forward and we arrive with the less paper which is this one.",
            "What was the number based estimate of flow rate in Doppler analysis in validation by means of a consummately?",
            "OK, so at the very end we validate our formula using in vivo data.",
            "OK, after that the project died.",
            "But in my view that it's an end line.",
            "OK, so we show it that the idea was correct and that also in vivo the model reliable and that our formula to estimate in a more correct way.",
            "The Blue Star rating presence of possibility is useful also in vivo.",
            "The other aspect very, very important is related to implantable device the democ that I show you of the poor sign.",
            "Because speed valve it's a typical mark for valve study.",
            "An experimental setup involve validation, it's the main the main tool used today, but CFD with fluid full structure interaction OK.",
            "Analysis, in my view are the future, so there are as as I show you with the sale now.",
            "Instead of design, CFD is quite evident.",
            "It's quite common tool.",
            "Use it for important implantable device.",
            "This is not yet as strong as in, let's say wind engineering, but in my view this will be very strong.",
            "Very strong tool in this kind of application and I I've been put you a couple of reference where we show out to use CFD to measure some quantities that you can never, never, never be able to measure in experimental setup OK?",
            "So this would be a re key advantage of CD and once again we showed it starting from experimental setup, validating received model on the experimental setup and then moving forward from that and showing what added value an what.",
            "Added insight we can have post processing CFD data."
        ],
        [
            "OK, so I take a short.",
            "This part up.",
            "This slide ends my my very first part, so the high level presentation.",
            "I hope that this part is quite clear, but once again I invite you to get the question to bring the question to lay on that.",
            "Maybe you can send me an email and I will start the next part after lunch break with.",
            "With the answering your question now I have to get into the.",
            "The parties say useful only for the tutorial in the sense that since I don't know the background, I have to select a common background for everybody and say something about something about some important.",
            "Feature of blood that we want to study and that we can study using safety in a proper manner.",
            "So if Leon can just send me an SMS, maybe with the that I'm at where I have to stop.",
            "So if you just tell me when you have to go to lunch.",
            "I will.",
            "I will take care of the of the time.",
            "OK, so I start and then I will see the message of the deadline for your lunch break, OK?",
            "So this second part relies on the physics of blood, and in particular we uninterested on the working hypothesis investors.",
            "So I'm here focusing on small and medium sized vessel but not in let's say very very small vessels like capillaries and stuff like this OK. Then we saw we will see some conservation law recommends an how this is implemented in fluent, OK. And then I will just give you some notes on convergence becausw.",
            "It's a concept that is necessary to save decide when the simulation is OK or not, and this is not easy sometimes and also on possible source of errors that are interesting in my view to have critics approach to CFD."
        ],
        [
            "So blood is.",
            "I mean that as is a main function, is to transport and delivery oxygen and not rent.",
            "Into the into the vascular OK.",
            "The blood flow resistance is influenced by very complicated architecture of the busker network and the flow behavior of blood components and build says N plasma.",
            "And of course from also pulsatility.",
            "At the microscopic level, blood appears to be a liquid material, but at the microscopic, it's presents, as you will know, solid particle of different sizes, so.",
            "In"
        ],
        [
            "Generally, we can assume that the density of the blood is constant.",
            "OK, so at 300 Kelvin temperature an under Upton spheric pressure condition block density is very similar or at least equal to water.",
            "So this is the value of blood density that we will use in the in our tutorial and I put it in this kind of units.",
            "Becausw are the one that are well get from two to two fluent."
        ],
        [
            "In the same way.",
            "Then the blood viscosity.",
            "It's.",
            "By the way, is well known that.",
            "Blood is a non Newtonian fluid K, but for many applications can be considered a Newtonian fluid.",
            "And then so that the relationship between.",
            "Velocity and gradient and viscous forces is linear and the slope of this line is the value of the viscosity.",
            "We would assume this value, which is very very common in in clinics.",
            "OK so.",
            "This will be.",
            "Our constant value of of the viscosity, so the charade."
        ],
        [
            "Usually, as this kind of form OK, but we are working our working hypothesis for medium size and large size vessel are that we are on this.",
            "Aria OK.",
            "So blood is Newtonian and non Newtonian but we are not going to approach with our safety models.",
            "The Newtonian part OK."
        ],
        [
            "In order to study a fluids, as you well know, we should get some characteristic of.",
            "The rental number, so this synthetic number, dimensional dimensional S number are useful to have, let's say a quick understand of the flow behavior that we are studying.",
            "So if you define the random number in this way, an in particular, if you identify as.",
            "Artistic length in a vessel the diameter.",
            "Of the other vessel.",
            "Then you can state that if the random number is bigger than let's say very, very big, the flow is dominated by inertia, otherwise the flow is dominated by viscous effect."
        ],
        [
            "And this.",
            "Can be visualized in some how to say that?",
            "Lamina flow as this kind of bottom, whereas turbulent flow is the other one.",
            "Anne."
        ],
        [
            "Nat.",
            "When we are studying blood flow regime and we are probably in between laminar that can get to turbulent.",
            "OK, but it is not so in medium size and large vessel we can assume that the flow is laminar and not turbulent even if for some district let's say for the Arctic Arch, there is several study and also let's say out of the.",
            "Out of the valve of the heart, of course there are some turbulence, but there is, let's say several study that are analyzing the fact that the behavior of the body is made in the sense of not allowing turbulence to get active essay an to destroy.",
            "Let's say this kind of turbulence to dissipate this kind of energy in other manner.",
            "OK, so this is quite advanced topics, but just say that we can assume that blood is laminar under laminar condition OK?",
            "Another number that is meaningful, very meaningful in minimally nomics is the woman is the number man.",
            "This is a quantity day."
        ],
        [
            "Is identified by a characteristic land and but also by the frequency of the signal of the.",
            "Blood flow waveform OK.",
            "If the woman's number is, but it's more like the flow is dominated by viscous effect.",
            "So I see Mail to opposite flow and if it's big, increasing this number over one, the flow is dominated by transient effect OK?"
        ],
        [
            "The effect of the woman's number is as follows, so.",
            "As much as I have possibility on my signal OK on my waveform.",
            "At the.",
            "The fact that they have a dynamics.",
            "In time the not does not allow the velocity profile to get developed up to a parabola.",
            "As you will know an as we will see on the hands on session if we have straight rigid tube with a constant velocity inlet value after a certain entry length the distribution and allowing air condition of course.",
            "After a certain after a certain distance from the inlet, we have fully developed profile that is a parabola OK?",
            "But if the signal is not constant in time and it's.",
            "OSHA waiting OK with a certain frequency.",
            "The velocity profile in space is not able on diameter to reach to ever reach the problem and he start to assume different shape is a long time.",
            "So depending on the point of the wave form that I am I am analyzing and on the value of the warmers in number.",
            "So as much as I have.",
            "Big womans number.",
            "As much as I have a flat and velocity profile OK.",
            "So."
        ],
        [
            "In anymore dynamics we have to consider these two numbers in order to perform, let's say correct evaluation or to have a priority knowledge that is required to analyze our flow.",
            "So the Reynolds number and the Woman's Day number OK."
        ],
        [
            "There are several way to perform a classification of flow and for blood we can perform this kind of this again and say that laminar or turbulent.",
            "Condition fluid particle moving smoother and layered fashion.",
            "OK so there is no mixing.",
            "While in turbulent flow through particle move in Acatic and taglit fashion OK so with significant mixing and steady or unsteady so steady flow is the flow property at a given point in space are constant in time whereas unsteady flow is that the flow properties at any given point in space change with the time OK?",
            "Anne.",
            "As far as we have, so here we want to have we want to study fluid.",
            "There is under linear flow condition an under unsteady flow."
        ],
        [
            "OK so this I mentioned this before."
        ],
        [
            "OK.",
            "Here I show you something that is related to their product knowledge.",
            "This graph of."
        ],
        [
            "Women's new number velocity provide distribution are obtained by a book, but we performed."
        ],
        [
            "Some analysis also using fluent.",
            "An we met.",
            "We compared modeling and measure performed in vivo on see under similar condition and also we compare this with the analytical solution of the Woman's Day problem.",
            "In order to verify if computational model is reliable with respect to measure and with respect to.",
            "Analytical solution.",
            "What you are seeing here is a comparison between the analytical solution and the measurement an.",
            "As you can see.",
            "The woman's be the woman's theory is quite in Group agreement OK with measure, performative, evil, OK, the noisy noisy pattern are of course the measure and the smoothed one are the analytical solution."
        ],
        [
            "Another kind of classification is incompressible or compressible an we have this kind of definition so incompressible flow the volume of a given fruit particle does not change at this implies the density is constant everywhere.",
            "An essentially is valid for all liquid's flow.",
            "A compressible is the vice versa, so the volume of a given food can be changed.",
            "Sorry, I saw that is.",
            "Stop it.",
            "K. OK.",
            "If you need to talk me Leon, you can.",
            "You can always call me on the on the cell phone, OK?",
            "So compressor is device server side.",
            "This imply the density will vary through the flow field.",
            "But as we say in advance for blood we we are studying an incompressible flow."
        ],
        [
            "Eat.",
            "Then single phase and multiphase an more genius, and after genius.",
            "Where single phase is is a fluid flow without phase change.",
            "A liquid or gas and multi phases.",
            "Multiple phases are present in the flow field homogeneous.",
            "An intelligence implies that only fluid material exists in the flow.",
            "In the first case, whereas multiple fluid solid materials are present in the flow field with.",
            "Blood we are studying a single phase, an homogeneous fluids."
        ],
        [
            "OK.",
            "So the working hypothesis that we need to implement in whatever software for CFD analysis.",
            "So we see this on fluent, but it's just us selection, so it's allowing airflow cause Raynaud's.",
            "And we have to check this if we are working on our problem.",
            "In the flow is laminar, so we are below a certain value of the rhino number.",
            "It's incompressible, so we will select solver for incompressible fluids.",
            "It's under unsteady behavior, so this is right to the fact that the woman is the theory as I show you is correct, so.",
            "Unsteady behavior.",
            "It's really meaningful for dynamics.",
            "It's probably the 1st.",
            "Characteristic of biological fluids to be time dependent OK?",
            "Um?",
            "OK, the problem is described exactly by three navier Stokes equation and the equation of continuity.",
            "But the general solution of this kind of problem is not yet available.",
            "Anne Anne the physiological quantities.",
            "Which will arise in a treatment of blood flow in large activities and network known.",
            "OK so we have uncertainity on the modeling and we need to model this on a numerical way because we don't have analytical solution OK?",
            "So that, as I mentioned in the first, the first part of the lecture.",
            "The works in terminal we are working on terms of approximate models OK.",
            "So.",
            "We have to consider important feature of blood and neglect.",
            "An important feature.",
            "OK, so the important important feature are that continue we need to do this in order to simplify.",
            "Otherwise we could not approach our problem."
        ],
        [
            "Important feature are the continuing prothesis.",
            "OK. That the blood is nominal.",
            "The blow is an under unsteady flow condition that is uncompressible.",
            "Isotropic and newtonian.",
            "OK, so all this hypothesis are necessary to be kept OK with their value of these quantities.",
            "But we were working under this hypothesis so."
        ],
        [
            "So the unimportant feature that are still true for the physics of blood in real life, but they are not necessary to be put in place to have CFD models are that because it depends on temperature and the percentage of Emma talk right?",
            "So that is the percent of particle inside of the blood.",
            "And it is compressible.",
            "OK, for low pressure condition.",
            "And that impression of some condition is much more transitional.",
            "Fluent fluid that is moving to turbulent instead of being laminal.",
            "OK, but this is something that we don't want to approach now."
        ],
        [
            "OK, I will.",
            "I will stop here.",
            "If you are OK to let you go to the lunch break.",
            "If it's the correct time and I will continue this.",
            "After the lunch break.",
            "OK, the question is.",
            "They like to to know how the program switch from runs to less approach and what is the trigger if it's the mesh size or distance from the wall.",
            "And the model is.",
            "Let's say we have used the model already implemented in fluent in.",
            "As often happen with Commercial Code, so they are already built in.",
            "The model is of course it's under it's published.",
            "I can give you the reference.",
            "I can give you the reference of the of the papers that I will write you away.",
            "So this is the article where you can find all the detail.",
            "Becausw did you?",
            "Well, this is computational fluid dynamics problems.",
            "Laudable it's published under theoretical computational fluid dynamics.",
            "2006 so it's pretty pretty new and.",
            "OK, you should have it OK. On there so you can find it as a regular paper.",
            "Ann is I was mentioning before the modeling was already implemented in fluent and we just selected the model to test.",
            "It's a modification of a previous version of the of the desk model proposed by the same author, so the same author developed some improvement of the first modeling.",
            "Where to answer your question, this which is on the cell size OK.",
            "So to answer your question, the desk model switches on the on the size and this it's a bit modification to have more stable and reliable result.",
            "But I invite you, I suggest you to say get the paper and have the full description of the of the model we just used.",
            "Also as with standard will function.",
            "So we didn't.",
            "Let's say implemented anything you, so we left it as a model is implemented in.",
            "Influence OK?"
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we have Rafaela from CD, working from Milano on our supercomputer and he won't firstly have to lectures.",
                    "label": 0
                },
                {
                    "sent": "First lecture will be on sale in the office and 2nd lecture will be on Bio Flo.",
                    "label": 0
                },
                {
                    "sent": "Then after lunch we will start here also with tutorials and he will demonstrate.",
                    "label": 0
                },
                {
                    "sent": "Quite complex bio flows on fluent.",
                    "label": 0
                },
                {
                    "sent": "How is work so he will be working on PS on our supercomputer and you will be following this tutorials.",
                    "label": 0
                },
                {
                    "sent": "All these tutorials are already available on.",
                    "label": 0
                },
                {
                    "sent": "Web page, so you'll have to repeat this quite shortly after, and we are also recording.",
                    "label": 0
                },
                {
                    "sent": "This so please verify.",
                    "label": 0
                },
                {
                    "sent": "Let's start with your presentation, introducing yourself and explain how.",
                    "label": 0
                },
                {
                    "sent": "Loste your license drivers license.",
                    "label": 0
                },
                {
                    "sent": "Sorry so we have amplifiers.",
                    "label": 0
                },
                {
                    "sent": "Everybody will hear you now.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "OK, so I apologize for not being there.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry I have the body of proof that is my license drive data as expired two years ago.",
                    "label": 0
                },
                {
                    "sent": "I didn't really know what by mistake and so they didn't give me the car drive that they have rented for me from Ruby and to get to be on a so I'm here.",
                    "label": 0
                },
                {
                    "sent": "I thank everybody from the technical lubiana.",
                    "label": 0
                },
                {
                    "sent": "University becausw they really helped to overcome this problem.",
                    "label": 0
                },
                {
                    "sent": "I hope that even if I cannot hear you, you can interact with me eventually by posing question to lay on that can send it to me and I can answer the question maybe after the lunch break.",
                    "label": 0
                },
                {
                    "sent": "OK, so I will be glad to answer.",
                    "label": 0
                },
                {
                    "sent": "My name is Rafael Poncini.",
                    "label": 0
                },
                {
                    "sent": "I work in a computer center, but I have an engineering background.",
                    "label": 0
                },
                {
                    "sent": "I have a PhD also in bio engineering, so I have let's say studied something that is modeling blood flow mainly OK. An after that I start working in a computer center in.",
                    "label": 0
                },
                {
                    "sent": "I switched my activity on deploying a best way I performance computing infrastructure to, let's say engineer engine put into a much more engineering way.",
                    "label": 0
                },
                {
                    "sent": "The computing aspect of modeling blood flow.",
                    "label": 0
                },
                {
                    "sent": "So you are there, you are hosted in actually infrastructure that have quite big.",
                    "label": 0
                },
                {
                    "sent": "Saturday's computer and facility.",
                    "label": 0
                },
                {
                    "sent": "So maybe I will from time to time give you some advice about how to have strong interaction with the machine.",
                    "label": 0
                },
                {
                    "sent": "When the invite me to have a lecture at the this winter school.",
                    "label": 0
                },
                {
                    "sent": "They asked me actually two kind of topics, so one was should be much more strongly related to HPC, so I performance computing an both of the lecture have to have industrial Director say less direct but industrial fallout.",
                    "label": 0
                },
                {
                    "sent": "So I selected two kind of lecture.",
                    "label": 0
                },
                {
                    "sent": "The first one that I'm going to give you right now it's.",
                    "label": 0
                },
                {
                    "sent": "Electrode that is related to.",
                    "label": 0
                },
                {
                    "sent": "Numerical simulation of yacht sailing.",
                    "label": 1
                },
                {
                    "sent": "And this is the much more HPC focus at one, the other one that I'm going to show you later on this morning and then the afternoon, that with the tutorial it's much more related to my let's say student background.",
                    "label": 0
                },
                {
                    "sent": "OK as a PhD.",
                    "label": 0
                },
                {
                    "sent": "So it's biomedical in that kind of lecture.",
                    "label": 0
                },
                {
                    "sent": "I will not stress the HPC aspect even if they are present.",
                    "label": 0
                },
                {
                    "sent": "Becausw biomedical biofluids, let's say can be.",
                    "label": 0
                },
                {
                    "sent": "Approach had also without very large infrastructure, so can be handled also on smallest infrastructure, whereas as you will see the first lecture in on detail on on your sailing CFD require higher HPC infrastructure.",
                    "label": 0
                },
                {
                    "sent": "So let's start with the first lecture.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The first presentation gonna have.",
                    "label": 0
                },
                {
                    "sent": "Let's say I'm going to present you the sale this project, which is a collaboration project.",
                    "label": 0
                },
                {
                    "sent": "So actually it's between between computer center and universities.",
                    "label": 0
                },
                {
                    "sent": "Material methods we I will show you very synthesis.",
                    "label": 0
                },
                {
                    "sent": "The modeling.",
                    "label": 0
                },
                {
                    "sent": "Let's say decision that we take to study this problem.",
                    "label": 0
                },
                {
                    "sent": "Then I will show you the results an the future possible development of this.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Work, they said their project save this project is a collaboration between Janecka in the University of Newcastle that.",
                    "label": 1
                },
                {
                    "sent": "Through its school of Marine Science, Technology, and in particular thanks to the collaboration with Professor Viola, we decide to, let's say, put together different competence from high performance computing to Marine CFD to, let's say, to bring innovation for industry.",
                    "label": 0
                },
                {
                    "sent": "So that's why I select this kind of lecture also for the for the school, because it's I think, very focused on the main intention of this school.",
                    "label": 0
                },
                {
                    "sent": "The first outcome of the of the project is this collaboration.",
                    "label": 0
                },
                {
                    "sent": "Also with ANSYS Italy OK and is the result of this.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of this that I will present you OK, so in much more in detail.",
                    "label": 0
                },
                {
                    "sent": "OK, I show you.",
                    "label": 0
                },
                {
                    "sent": "There is HPC side that have been covered by Janecka Ann Marina competence CFD competence that have been covered by Newcastle University.",
                    "label": 0
                },
                {
                    "sent": "And also of course there is software to use that have been furnished by ANSYS but more in detail we have let's say the philosophy that is behind the service project is to use measure that have been performed.",
                    "label": 0
                },
                {
                    "sent": "Really, there's been built also the measurement campaign at being built 2 model the measurement campaign, so it's not usually in this kind of project.",
                    "label": 0
                },
                {
                    "sent": "While you can have is, maybe you have wind tunnel data.",
                    "label": 0
                },
                {
                    "sent": "OK, that you see here on the left, but usually this wind tunnel data are not, let's say, built in order to be modeled in a CFD using CFD software.",
                    "label": 0
                },
                {
                    "sent": "This cause several problems usually so.",
                    "label": 0
                },
                {
                    "sent": "Once you have the model in the CFD you it's very hard to, let's say, make a right calibration of the model.",
                    "label": 0
                },
                {
                    "sent": "Within the experiment an always you find out that the condition were not exactly the same becausw when you did the measure in the wind tunnel, you didn't.",
                    "label": 0
                },
                {
                    "sent": "Let's say kept all the number that you need to bring into the let's say in silico model.",
                    "label": 0
                },
                {
                    "sent": "So the CFD model.",
                    "label": 0
                },
                {
                    "sent": "And this causes several problems in the sense that after that you do all the work to bring measure into model and then you cannot compare the two results.",
                    "label": 0
                },
                {
                    "sent": "OK, the philosophy behind the service project is to build measure, but already thinking to the fact that this measure will be modeled in a CFD way.",
                    "label": 0
                },
                {
                    "sent": "OK, so all the winter nailed experimental campaign as.",
                    "label": 0
                },
                {
                    "sent": "To say has been built with regard to the fact that one day it will be put into us if the model OK, so the main philosophy is from measure internal to model to get much more insight, OK?",
                    "label": 0
                },
                {
                    "sent": "And they cite the in this.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In this kind of problem, are related to really, let's say, industrial in the sense that are real scale real life scale product problems.",
                    "label": 0
                },
                {
                    "sent": "So during America's Cup, other kind of, let's say sailing yacht than the one they are acting now.",
                    "label": 0
                },
                {
                    "sent": "So the AC-90 class.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "You need to perform experimental and numerical activity to study the best.",
                    "label": 0
                },
                {
                    "sent": "Let's say configuration of the of the windage to have to obtain the maximum.",
                    "label": 0
                },
                {
                    "sent": "Let's say velocity of the of the boat, let's say.",
                    "label": 0
                },
                {
                    "sent": "To do this?",
                    "label": 0
                },
                {
                    "sent": "Ola ever spend several years at the Yocto Anna Research unit at the University of Auckland, which is also involved in this project as a byproduct.",
                    "label": 0
                },
                {
                    "sent": "There he worked for several year and the outcome of his work are mentioned here.",
                    "label": 0
                },
                {
                    "sent": "OK, you can find the reference here on this slide.",
                    "label": 0
                },
                {
                    "sent": "It worked on experimental measure, so it worked on built.",
                    "label": 0
                },
                {
                    "sent": "The best setup to perform wind tunnel test OK.",
                    "label": 0
                },
                {
                    "sent": "This is a snap of the wind tunnel at the Yacht Research Unit, University of Auckland.",
                    "label": 1
                },
                {
                    "sent": "With the twisted vein device.",
                    "label": 0
                },
                {
                    "sent": "OK, and this is the instrumented sailing doctor.",
                    "label": 0
                },
                {
                    "sent": "OK, with the fiber sailing that are built an constructed starting from images and then built in order to have rigid body here.",
                    "label": 0
                },
                {
                    "sent": "OK all this facility allow you to instrument.",
                    "label": 0
                },
                {
                    "sent": "With several point pressure Point Re say and also to get the resultant of the forces acting on the Salem.",
                    "label": 0
                },
                {
                    "sent": "The necessity, let's say from 2 to pass from the experimental setup to CFD, relies on the fact that the experimental setup, even if it's very, very detailed, like in this case, did not have the ability of give you point to point information OK, and it's very hard to post process the information you have one, so you want to have less a visualization of.",
                    "label": 0
                },
                {
                    "sent": "Also, the structure that they are involved in the physical problem that you are studying with the experiment.",
                    "label": 0
                },
                {
                    "sent": "So in synthesis experimental setup in this field gives you let's say integral OK value an in app distribution over the sale even if in this case we have much more information.",
                    "label": 0
                },
                {
                    "sent": "But in general you have integral, so the result of the forces acting on the sale an by as a by product on the yachts.",
                    "label": 0
                },
                {
                    "sent": "But this some cases since is an integral, so you can have several contribution you don't maybe understand exactly where where did it come from the different contribution and how you can say performer and optimization of the windage in particular to get more.",
                    "label": 0
                },
                {
                    "sent": "Performance on your on your setting.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Usually.",
                    "label": 0
                },
                {
                    "sent": "This is in general like this.",
                    "label": 0
                },
                {
                    "sent": "Experiment are then bringing to computational environment.",
                    "label": 0
                },
                {
                    "sent": "But usually we.",
                    "label": 0
                },
                {
                    "sent": "You do this with the the since you have a problem with, say, turbulence and several.",
                    "label": 0
                },
                {
                    "sent": "Let's say there are several fact that they are involved in modeling in the right way.",
                    "label": 0
                },
                {
                    "sent": "This kind of problem you use usually run on average modeling in order to handle the complexity of the tool, whereas model without paying too much on computational resources an get numbers that.",
                    "label": 0
                },
                {
                    "sent": "Can be reliably compared to the internal measurements.",
                    "label": 0
                },
                {
                    "sent": "But the.",
                    "label": 0
                },
                {
                    "sent": "Also, this kind of model, even if they allow you to post process, an app visualization and stuff like this, I will show you that even this kind of model so runs modeling of internal test did not allow you to have correct information.",
                    "label": 0
                },
                {
                    "sent": "And but on the other hand, if you want to spend the same or sales on that, you.",
                    "label": 0
                },
                {
                    "sent": "Are obliged to use less modeling?",
                    "label": 0
                },
                {
                    "sent": "OK now in fluent recently it is also available.",
                    "label": 0
                },
                {
                    "sent": "This kind of modeling which is the detailed detacher data simulation which is modification of the detached Eddy simulation implemented by.",
                    "label": 0
                },
                {
                    "sent": "By some researcher Ann.",
                    "label": 0
                },
                {
                    "sent": "And this kind of modeling allow you to have, let's say, runs approach nearby the sailing Yacht K and then the sale and allows you to have less kind of less modeling on the downstream of the of the sale.",
                    "label": 0
                },
                {
                    "sent": "So all the problem related to windage and related to the flow structure that they are behind the physics of this problem are well handled.",
                    "label": 0
                },
                {
                    "sent": "OK so.",
                    "label": 0
                },
                {
                    "sent": "In very short we we modeled the Navier Stokes equation for Newtonian fluids.",
                    "label": 1
                },
                {
                    "sent": "OK, so is an incompressible navier Stokes equation formulation with the detail delayer detach the simulation model.",
                    "label": 0
                },
                {
                    "sent": "OK and it's the let's say we just click it on the default.",
                    "label": 0
                },
                {
                    "sent": "Top that is available on on fluent.",
                    "label": 0
                },
                {
                    "sent": "We selected a turbulence model.",
                    "label": 0
                },
                {
                    "sent": "OK that is.",
                    "label": 0
                },
                {
                    "sent": "Available influenza an we we didn't model in any way.",
                    "label": 0
                },
                {
                    "sent": "They will function so we use it.",
                    "label": 0
                },
                {
                    "sent": "The standard will function that are available in fluent.",
                    "label": 0
                },
                {
                    "sent": "We use a simple seat pressure velocity coupling scheme.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "OK, we we also imposed an intensity of the turbulence of the 2% uniform at the inlet, and we posed a boundary condition at the inlet as flat glossy profile with this value and the Reynolds of the, let's say, Spinnaker, so nearby the spinnaker is of this magnitude.",
                    "label": 1
                },
                {
                    "sent": "So 10 two point 10.",
                    "label": 0
                },
                {
                    "sent": "Two power five.",
                    "label": 0
                },
                {
                    "sent": "OK, so it's it's pretty big and DNS or less modeling.",
                    "label": 0
                },
                {
                    "sent": "Of the overall problem would be, let's say hardly and the ball in the time to give time to market of giving numbers in this kind of problem and also post process.",
                    "label": 0
                },
                {
                    "sent": "This kind of will be a problem itself.",
                    "label": 0
                },
                {
                    "sent": "OK so you can model but it would be unfeasible from industrial point of view.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Much more, let's say approachable, so it's using this kind of model that in order to have a correct balance between cost, an accuracy allows you to.",
                    "label": 0
                },
                {
                    "sent": "As I told you before, to model to treat an ear war region in France like manner.",
                    "label": 0
                },
                {
                    "sent": "So low cost, let's say and treat the rest of the flow in a less like manner.",
                    "label": 1
                },
                {
                    "sent": "So more expensive, but in.",
                    "label": 0
                },
                {
                    "sent": "At the end, but not very much, because far away from the boat you don't need.",
                    "label": 0
                },
                {
                    "sent": "You don't have the boundary layer, so you don't need to have cell death small.",
                    "label": 0
                },
                {
                    "sent": "OK, so this balance that have been proposed by Spotlight ET al in 97.",
                    "label": 0
                },
                {
                    "sent": "Can be reliable and we tested during this kind of project how it can be implemented in a HPC environment.",
                    "label": 0
                },
                {
                    "sent": "OK on a realtor.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Case so the measure that have been provided by the.",
                    "label": 0
                },
                {
                    "sent": "Newcastle University to do this, we selected three mesh size OK Ann.",
                    "label": 0
                },
                {
                    "sent": "We performed different windtunnel loops where we talked with Windtunnel oops, I mean that.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We let the flow enter into the wind tunnel and then get out and then this let's say can update the flow.",
                    "label": 0
                },
                {
                    "sent": "Also teach at each loop and this.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is the fact that this is the sense of this value so 38.",
                    "label": 0
                },
                {
                    "sent": "Wind tunnel oops means that the wind have come?",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Into the inlet and exit the outlet 38 time OK. And so we are.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Really calm, confident that at that point the solution was really good.",
                    "label": 0
                },
                {
                    "sent": "The timestep selected was of this order of magnitude, and we perform it.",
                    "label": 0
                },
                {
                    "sent": "Also, a rans simulation to compare with the DDS simulation.",
                    "label": 1
                },
                {
                    "sent": "For the the medium size mesh we were able to perform 10 winter loops and also we have the runs, but for the biggest mesh that we are we have planted at the beginning to to perform the simulation.",
                    "label": 0
                },
                {
                    "sent": "At the moment we have not yet perform sufficient to internal test and also we didn't fix the correct time stepping and the run, so it's not available as well.",
                    "label": 0
                },
                {
                    "sent": "We tested so actually the project as free mesh, but in fact we only tested two meshes from 4 to 32 million an we tested the scalability on up to 256 core OK. Anne.",
                    "label": 1
                },
                {
                    "sent": "The important thing is that for this kind of project, answers provide us the.",
                    "label": 0
                },
                {
                    "sent": "The license for fluent four for free.",
                    "label": 0
                },
                {
                    "sent": "OK, so it gives us the licensing for two to perform the scalability test, OK?",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The hardware that we we use it is standard exultant, assesses Santa Cuatro standard in in the sense of HPC infrastructure, so they are exact core machine.",
                    "label": 0
                },
                {
                    "sent": "OK, so not very, very new because the project began years ago.",
                    "label": 0
                },
                {
                    "sent": "The Giga power cord was not huge and this is quite common in fluent.",
                    "label": 0
                },
                {
                    "sent": "It's not very expensive from rum point of view, but the important thing that I underline you is that the machine was interconnected with InfiniBand could year.",
                    "label": 0
                },
                {
                    "sent": "So for the one of you that working on HPC this probably is not surprising because when you want to go up with the computational core.",
                    "label": 0
                },
                {
                    "sent": "If you don't have.",
                    "label": 0
                },
                {
                    "sent": "A really stronger interconnection.",
                    "label": 0
                },
                {
                    "sent": "You will not lost all their performance.",
                    "label": 0
                },
                {
                    "sent": "OK, and this is also true for fluent because I perform several tests comparing, say, infini band with Gigabit Ethernet and this for this kind of project.",
                    "label": 0
                },
                {
                    "sent": "When you are, let's say approaching problem that big or also even that big.",
                    "label": 0
                },
                {
                    "sent": "But you want to perform several several simulation you need to have very strong interconnection.",
                    "label": 0
                },
                {
                    "sent": "If you want to.",
                    "label": 0
                },
                {
                    "sent": "Go up with the parallel.",
                    "label": 0
                },
                {
                    "sent": "Then we use also facility for remote visualization becausw this is also as you seen, there are several entities that working on the project.",
                    "label": 0
                },
                {
                    "sent": "There was also two students ship, one from Paris and one from Politecnico di Milano that are working on the project.",
                    "label": 0
                },
                {
                    "sent": "And to allow, let's say, a common environment and not moving file.",
                    "label": 0
                },
                {
                    "sent": "Also upload and download the.",
                    "label": 0
                },
                {
                    "sent": "We use this remote Visitation fat node.",
                    "label": 0
                },
                {
                    "sent": "It's DL9999 eighty from HP that as a stronger capability on Ram Becausw produce mesh.",
                    "label": 0
                },
                {
                    "sent": "So preprocessing and postprocessing can be very demanding from RAM POV and to compress the output graphics we use the nice DCV.",
                    "label": 0
                },
                {
                    "sent": "Technology.",
                    "label": 0
                },
                {
                    "sent": "OK, so it's actually a TCB with compression on it.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This capability on our cluster, so I show you the efficiency showed that up to 256 we still have 70%, so 0.770% of the efficiency.",
                    "label": 1
                },
                {
                    "sent": "OK, so if you compare I'm sure you are aware of what these officials but just to be sure that you understand if you let's say every task that on single core it takes.",
                    "label": 0
                },
                {
                    "sent": "A certain amount of time if you perform the same task on a number of quarter is equal to N. You expect to have one divided by the same number, so one and divided the time that you spent OK.",
                    "label": 0
                },
                {
                    "sent": "So if you make the.",
                    "label": 0
                },
                {
                    "sent": "Damn, this kind of evaluation.",
                    "label": 1
                },
                {
                    "sent": "You can have the efficiency of your parallel computing.",
                    "label": 0
                },
                {
                    "sent": "OK, so becausw, since licensing is, let's say, an expensive also task, you have to evaluate if you want to propose this to industrial audience.",
                    "label": 0
                },
                {
                    "sent": "What is the cost and the cost keeping valued at up to 70%?",
                    "label": 0
                },
                {
                    "sent": "You still have a good scalability.",
                    "label": 0
                },
                {
                    "sent": "OK, we.",
                    "label": 0
                },
                {
                    "sent": "Decide that this can be a three shot, OK.",
                    "label": 0
                },
                {
                    "sent": "The rest modeling will show and let's say in a half a day you have winter in a single internal loop, OK?",
                    "label": 0
                },
                {
                    "sent": "But the week to our more rich modeling.",
                    "label": 1
                },
                {
                    "sent": "So they did the yes model.",
                    "label": 0
                },
                {
                    "sent": "You need to spend 2 days in order to have a windtunnel loop acquisition of that, OK.",
                    "label": 0
                },
                {
                    "sent": "This, in my view, is something that is visible in the sense that you are spending.",
                    "label": 0
                },
                {
                    "sent": "Let's say the four times the cost.",
                    "label": 0
                },
                {
                    "sent": "But as you will see in the in what follows, you have, let's say much, much more rich information, and in some cases this is necessary.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In particular, I just mentioned something that this is not, let's say, muscle number crunching made on HPC center.",
                    "label": 0
                },
                {
                    "sent": "This is experimental setup focused on CFD modeling, but the CF model has been strongly compared with the measurement in the sense that we just not need to say OK.",
                    "label": 0
                },
                {
                    "sent": "It's that fast to perform this kind of computation.",
                    "label": 0
                },
                {
                    "sent": "It's cost that giga to achieve the data.",
                    "label": 0
                },
                {
                    "sent": "It's only a matter of fact of having an accurate number.",
                    "label": 0
                },
                {
                    "sent": "OK, so at the University of Newcastle, because they are just said the proposal came from that side.",
                    "label": 0
                },
                {
                    "sent": "They perform an analysis of the accuracy of the model with the DDS an with compared to the experiment.",
                    "label": 0
                },
                {
                    "sent": "OK. What you can see is that.",
                    "label": 0
                },
                {
                    "sent": "On the on the sale if you.",
                    "label": 0
                },
                {
                    "sent": "Are working on let's say a different level K of the sailing.",
                    "label": 0
                },
                {
                    "sent": "You can see these are charged that are selected at different.",
                    "label": 0
                },
                {
                    "sent": "It's a coefficient or pressure coefficient, plotted a different section along the sale.",
                    "label": 1
                },
                {
                    "sent": "An compared numerical with experiment.",
                    "label": 0
                },
                {
                    "sent": "What you can see is that at the bottom an at the top of the of the sail yacht where I have flow separation and vertex presence I have and I are in certainty.",
                    "label": 0
                },
                {
                    "sent": "OK, so this makes sense.",
                    "label": 0
                },
                {
                    "sent": "OK, it's about.",
                    "label": 0
                },
                {
                    "sent": "The incident is also acceptable so.",
                    "label": 0
                },
                {
                    "sent": "This is, let's say it's a fair analysis of what we have tested.",
                    "label": 0
                },
                {
                    "sent": "OK, even if I am as a computer scientist, much more interested on the scalability case on the feasibility for industry from the University of Newcastle.",
                    "label": 0
                },
                {
                    "sent": "They're also interested on the accuracy of the model, of course, and the model in somehow it's, let's say, accurate to perform also numerical campaign to achieve data to perform optimization.",
                    "label": 0
                },
                {
                    "sent": "OK. What is?",
                    "label": 0
                },
                {
                    "sent": "Sorry is not.",
                    "label": 0
                },
                {
                    "sent": "OK so I go up here so.",
                    "label": 0
                },
                {
                    "sent": "We were OK. We were considering that also from let's say from an accuracy POV its value.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Other project, but now you will understand why we try to test this.",
                    "label": 0
                },
                {
                    "sent": "This technology we try to test this technology becausw.",
                    "label": 0
                },
                {
                    "sent": "After all, we are able to visualize understand what is behind the, let's say the resultant of the forces that we are reading on the surface of the sale, but also acting on the yacht OK?",
                    "label": 0
                },
                {
                    "sent": "So in this image you have.",
                    "label": 0
                },
                {
                    "sent": "Maybe you very interesting output, that is, these are the leak surface, so there are the shear stress.",
                    "label": 0
                },
                {
                    "sent": "Let's say map add on the surface of the sale of the sale with announcement of detaching and Reattaching zone an attached zone.",
                    "label": 0
                },
                {
                    "sent": "OK, and now you would understand why a different level of the sale you have higher or lower in certainty, OK?",
                    "label": 0
                },
                {
                    "sent": "An you will understand why you should spend cell to model this kind of problem.",
                    "label": 0
                },
                {
                    "sent": "OK Becausw downstream of the everybody knows that everybody that works in this field of application knows that they are.",
                    "label": 0
                },
                {
                    "sent": "Vartox on the top an some structure complex structure on the bottom part and that in the middle the flow.",
                    "label": 0
                },
                {
                    "sent": "It's mainly attached OK, but it's very I mean my.",
                    "label": 0
                },
                {
                    "sent": "As far as I know this is the first time that you can visualize correctly what kind of structure you have there.",
                    "label": 0
                },
                {
                    "sent": "To do so.",
                    "label": 0
                },
                {
                    "sent": "We use also synthetic value, which is the criterion.",
                    "label": 0
                },
                {
                    "sent": "And here I explain you.",
                    "label": 0
                },
                {
                    "sent": "I invite you to reflect on the fact that the without the CFD modeling.",
                    "label": 0
                },
                {
                    "sent": "So if I only use Windtunnel data, I will never be able to visualize the criterion becausw the amount of information that I need and space in space and time, so spatial and temporal distribution of the data of the information in the flow field.",
                    "label": 0
                },
                {
                    "sent": "I cannot measure it using Internet facility OK.",
                    "label": 0
                },
                {
                    "sent": "So that's why CFD is unique tool.",
                    "label": 0
                },
                {
                    "sent": "Also in this field of application to enrich.",
                    "label": 0
                },
                {
                    "sent": "The measurement that you can perform in the winter, not to, let's say, pass by the wind tunnel, but to enrich the information and analyze what is behind all the physical that you are measuring in.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In a synthetic way, OK, but you are obliged to do this, and under win 10 on the Internet, OK?",
                    "label": 0
                },
                {
                    "sent": "If I go further, we visualize it with the top view and a side view.",
                    "label": 0
                },
                {
                    "sent": "This flow structure in the overall field around the sailing yacht OK?",
                    "label": 0
                },
                {
                    "sent": "An what you see he answere Kate we use to color coding so blue and red.",
                    "label": 0
                },
                {
                    "sent": "It's at the olicity and you know Olicity is a product of velocity and vorticity.",
                    "label": 0
                },
                {
                    "sent": "So it measure if they are clockwise or counterclockwise turning the structure above text that is in here OK.",
                    "label": 0
                },
                {
                    "sent": "So this is positive and negative related to the fact that if they are turning.",
                    "label": 0
                },
                {
                    "sent": "Clockwise or counterclockwise OK.",
                    "label": 0
                },
                {
                    "sent": "This is the sense of the blue and red an.",
                    "label": 0
                },
                {
                    "sent": "These are quickly tell you allows you to have a synthetic visualization of current flow structure.",
                    "label": 0
                },
                {
                    "sent": "OK, so it's a synthetic indicator very strong for post processing of data and what we see here is what we were also expecting.",
                    "label": 0
                },
                {
                    "sent": "So we have let's say very static vertex on the tip of the sale and complex flow structures that are, let's say.",
                    "label": 0
                },
                {
                    "sent": "There are created and destroyed OK on the downstream of the sailing yacht.",
                    "label": 0
                },
                {
                    "sent": "This is in theory well known OK, but it's very hard to see it.",
                    "label": 0
                },
                {
                    "sent": "Show it in an experiment.",
                    "label": 0
                },
                {
                    "sent": "This show.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Be an animation, but it's not important because it's a static vertex and you can imagine this structure that it's it's created here and it evolves from here to there.",
                    "label": 0
                },
                {
                    "sent": "OK, it's not really different.",
                    "label": 0
                },
                {
                    "sent": "The static image from the animation.",
                    "label": 0
                },
                {
                    "sent": "So this is our current structure that we have announced in our experiment and that cannot be announced with only measure.",
                    "label": 0
                },
                {
                    "sent": "OK, so CFD in this field will help you on have much more insight.",
                    "label": 0
                },
                {
                    "sent": "That sees the main.",
                    "label": 0
                },
                {
                    "sent": "The main goal of our activity.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, since we are proposing this kind of approach to industrial application and since we have measured and we have shown you that this kind of modeling is much more expensive, about four time OK to have similar information on the surface of the yacht sailing.",
                    "label": 0
                },
                {
                    "sent": "So the resultant of the forces that you will measure and the coefficient that will measure on the sale.",
                    "label": 0
                },
                {
                    "sent": "It's about the same but.",
                    "label": 0
                },
                {
                    "sent": "If you spend cell to perform much complex modeling so the one they were proposed here compared to the runs, which is quite inexpensive as a model.",
                    "label": 0
                },
                {
                    "sent": "And we.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can show you that you have a much more rich information and this is of course, but this information is not only much more rich, is much more precise because if you analyze the position of the main vertex.",
                    "label": 0
                },
                {
                    "sent": "OK, so if you analyze the position and the center of the flow structures that are present here, you see are quite difference.",
                    "label": 0
                },
                {
                    "sent": "OK, an now since we know that things if D if you spend much more self you are let's say more precise OK?",
                    "label": 0
                },
                {
                    "sent": "We we can state that runs modeling not only not show the present of complex structure that they are there?",
                    "label": 0
                },
                {
                    "sent": "OK, so see this, but it is very oversimplified.",
                    "label": 0
                },
                {
                    "sent": "But also it positioned the center of the vertex in the wrong in the wrong way, which is much more important for some kind of application.",
                    "label": 0
                },
                {
                    "sent": "The main application that we see using this model, it's the Windows study an optimization.",
                    "label": 0
                },
                {
                    "sent": "This kind of problem for this kind of American Americas capture is ongoing.",
                    "label": 0
                },
                {
                    "sent": "Right now.",
                    "label": 0
                },
                {
                    "sent": "It's a problem that I know that it's of interest.",
                    "label": 0
                },
                {
                    "sent": "OK, 'cause I have you seen the two Bolt?",
                    "label": 0
                },
                {
                    "sent": "They are racing the Americas Cup tonight.",
                    "label": 0
                },
                {
                    "sent": "They're going to make, let's say the less race, and probably the one that is going to win the Cup is going to win for 10 seconds, 20 seconds.",
                    "label": 0
                },
                {
                    "sent": "So very small, different so.",
                    "label": 0
                },
                {
                    "sent": "They both are very similar and they're going in the same way.",
                    "label": 0
                },
                {
                    "sent": "Probably if you can have a small, really small advantage, maybe optimizing some windage effect you can win on America's Cup next time.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is in my view a possible take home.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Message.",
                    "label": 0
                },
                {
                    "sent": "So the implication of our study is that the study of traveling structure around the complex 3 dimensional geometry.",
                    "label": 1
                },
                {
                    "sent": "Can show separation reattachment zone that are playing a main role an are very expensive in terms of numerical and experimental setup.",
                    "label": 0
                },
                {
                    "sent": "For this reason, experimental an numerical setup should be should work together, so experiment are much more expensive than numerical, but they are necessary to build the model and to validate the model.",
                    "label": 0
                },
                {
                    "sent": "And once you have, say, a valid model, you can launch several optimization study that it's very hard to do in the winter for several reasons.",
                    "label": 0
                },
                {
                    "sent": "So mainly I can say that you cannot visualize.",
                    "label": 0
                },
                {
                    "sent": "Understand the physical problem an you don't have the full control of this app.",
                    "label": 0
                },
                {
                    "sent": "Once you are changing and optimizing, so the measure it's much more difficult to do it online on real life with tunnel that on the.",
                    "label": 0
                },
                {
                    "sent": "Virtual one, so using CFD OK. And also the fact that the experimental setup can be designed tailored to validate numerical models.",
                    "label": 1
                },
                {
                    "sent": "That's what I'm saying, and that also numerical modeling.",
                    "label": 1
                },
                {
                    "sent": "So like the DDS that we have studied here.",
                    "label": 0
                },
                {
                    "sent": "If they are used on a performance, computing resources are feasible because you are spending, let's say two days to have one number which is not.",
                    "label": 0
                },
                {
                    "sent": "Out, let's say of its affordable cause.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Effective in our view.",
                    "label": 0
                },
                {
                    "sent": "In a future we are seeing.",
                    "label": 0
                },
                {
                    "sent": "We need to, let's say, enlarge our application to.",
                    "label": 0
                },
                {
                    "sent": "To higher scale OK and we want to test also new technology Becausw X 8664 technology now is an ascending from from starting from near him.",
                    "label": 0
                },
                {
                    "sent": "Now it's we use the West Moran.",
                    "label": 0
                },
                {
                    "sent": "Now we are on Sandy Bridge technology and it's going to be a new one and also ANSYS is really strongly engaged on Intel Process development an we're the new version.",
                    "label": 0
                },
                {
                    "sent": "14 point .5 version answer is also tailored to the to be, let's say more aggressive on the scalability.",
                    "label": 0
                },
                {
                    "sent": "Also for very large number.",
                    "label": 0
                },
                {
                    "sent": "So over 1000 core you are expecting to still have a nice performance using the next generation of Intel Core, but we didn't test it yet and I think that that will be also a message for for inducing.",
                    "label": 0
                },
                {
                    "sent": "OK so this model will be tested there too in the near future.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I have to acknowledge all the people involved and also answers Italy that provide the license and as I.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Say I thank you for your attention for the question.",
                    "label": 0
                },
                {
                    "sent": "I suggest maybe that you can maybe learn can during the lunch break get main, let's say question and then I will answer at the beginning after the lunch break.",
                    "label": 0
                },
                {
                    "sent": "I if if it's OK with you, OK. OK, this ends the first lecture that was the more.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "HPC one now I start with the.",
                    "label": 0
                },
                {
                    "sent": "He said.",
                    "label": 0
                },
                {
                    "sent": "I don't have any stop from Lyon.",
                    "label": 0
                },
                {
                    "sent": "I keep go and I and I make my second presentation which is an introduction on CD in IMO Dynamics.",
                    "label": 0
                },
                {
                    "sent": "As I mentioned, I have studied by engineering with a Masters thesis on computational hemodynamics, and then I perform also a PhD on that topic at the Politecnico di Milano.",
                    "label": 0
                },
                {
                    "sent": "So I have, let's say, a really clear background on this kind of application, and once they got to this computer center, I start, let's say, improve the way that you can use CFD enable dynamics to have a stronger platform to perform some kind of application.",
                    "label": 0
                },
                {
                    "sent": "What they will?",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Discuss, you know what we show you with the lecture it's, let's say, a multi level presentation.",
                    "label": 0
                },
                {
                    "sent": "So in the morning we gonna.",
                    "label": 0
                },
                {
                    "sent": "I'm going to make you very very high level introduction OK, But after that the things we need to have also tutorial.",
                    "label": 0
                },
                {
                    "sent": "I also have to introduce you some theory.",
                    "label": 0
                },
                {
                    "sent": "The high level in the sense very.",
                    "label": 0
                },
                {
                    "sent": "We're going to Best Buy, but I have to tell you what kind of equation we are solving an what kind also of hypothesis are reliable to model this kind of fluids with CFD?",
                    "label": 0
                },
                {
                    "sent": "OK, I will show you some example and then we're going to see well defined implementation using, let's say commercial tool which is ANSYS fluent.",
                    "label": 1
                },
                {
                    "sent": "But as I will tell you along the presentation several time.",
                    "label": 0
                },
                {
                    "sent": "You can implement in whatever code you want.",
                    "label": 0
                },
                {
                    "sent": "I mean I'm going to give you the direction to the fact that there are some hypothesis that can be easily.",
                    "label": 0
                },
                {
                    "sent": "Introduce it to perform a correct modeling in CFD, but then you can implement this using no matter which tool.",
                    "label": 0
                },
                {
                    "sent": "OK, in my experience I have been using fluent because it's a robust product.",
                    "label": 0
                },
                {
                    "sent": "It's out of the box and also because my computer at the master make me start with that and I was just keep going.",
                    "label": 0
                },
                {
                    "sent": "But I know that there are several other possibility.",
                    "label": 0
                },
                {
                    "sent": "So the implementation is going to be on hands on session, so I will show you the user the graphic user interface of fluent 'cause I don't know the audience what kind of background have on fluent.",
                    "label": 0
                },
                {
                    "sent": "So if you are already let's say if you know already the software or if it's if you are new to fluent, OK so I will show you several thing but.",
                    "label": 0
                },
                {
                    "sent": "There is also advanced topics.",
                    "label": 0
                },
                {
                    "sent": "OK, so as user defined functions so the people who already use fluent for other application maybe can be interested on the last part of the tutorial, which is quite advanced becausw it use user defined function which is the one of the most advanced topics that you can have in fluent.",
                    "label": 1
                },
                {
                    "sent": "So CFD is something.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That have it's a computation through dynamics, but have two parts, so there is free dynamics which is physical.",
                    "label": 0
                },
                {
                    "sent": "Study the physical fluids and computational, which is something related to numerical, numeric involved in solving the equation.",
                    "label": 1
                },
                {
                    "sent": "In this case, the equation that describing the motion of the fluid.",
                    "label": 1
                },
                {
                    "sent": "In this field application, so CD in general there is a strong interplay between math, physics, physics, knowledge of the phenomenon and technological tool and environment, OK?",
                    "label": 1
                },
                {
                    "sent": "Unfortunately, there are no general rule for specific models set up an there is a need of a periodic knowledge of the food behavior, so you need to know what you are studying strongly as from the physical point of view, to perform hypothesis, an simplification cause it's quite evident that the physical fluids it's.",
                    "label": 0
                },
                {
                    "sent": "At the full scale it's very complex, so you need to simplify by unity simplify with some hypothesis in mind.",
                    "label": 1
                },
                {
                    "sent": "OK, so that the model is reliably related to the physics that you want to study, OK?",
                    "label": 0
                },
                {
                    "sent": "And in general, if possible, you need to have experimental or theoretical innocence analytical solution data to validate the safety results.",
                    "label": 0
                },
                {
                    "sent": "So even after you have implemented with correct hypothesis, you're.",
                    "label": 0
                },
                {
                    "sent": "With your with your CFD code, you need to verify that in some circumstances.",
                    "label": 0
                },
                {
                    "sent": "So as we we have done with the show you with the setting, yeah.",
                    "label": 0
                },
                {
                    "sent": "You have to compare your result to experiment.",
                    "label": 0
                },
                {
                    "sent": "Also here it's it's a good way of proceed and much more since biological fluid are really complex also to have in terms of data.",
                    "label": 0
                },
                {
                    "sent": "So it's very complex to have the experimental setup for hemodynamics.",
                    "label": 0
                },
                {
                    "sent": "You better found also analytical solution.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let's see the the computer engineering workflow in this kind of application.",
                    "label": 1
                },
                {
                    "sent": "So we had physical fluids.",
                    "label": 0
                },
                {
                    "sent": "So here I put some image of phase contrast MRI, which is a technique of imaging that allows you to map not only the anatomy that you are looking at, but also for each voxel the value of the three components of the velocity of the fluid that is flowing in that in that.",
                    "label": 0
                },
                {
                    "sent": "Region OK. From physics you got to computational, so you extract mainly two quantities.",
                    "label": 0
                },
                {
                    "sent": "You need mainly two quantities to do this kind of stuff, and they are geometry OK and the boundary condition so.",
                    "label": 0
                },
                {
                    "sent": "You can measure this in vivo.",
                    "label": 0
                },
                {
                    "sent": "OK, so the geometry can be extracted from images using several tool.",
                    "label": 0
                },
                {
                    "sent": "And the boundary condition can be imposed.",
                    "label": 0
                },
                {
                    "sent": "Can be measured and then impose it at the boundary.",
                    "label": 0
                },
                {
                    "sent": "OK, once you have done that, if you want to, let's say be really productive, you have to go to an HPC environment to perform number crunching and visualization and visualization.",
                    "label": 0
                },
                {
                    "sent": "It's one of the main advantage of, in my opinion of CFD, that's why also people call it instead of computational fluid dynamics.",
                    "label": 0
                },
                {
                    "sent": "Some people say that is colored through dynamics.",
                    "label": 0
                },
                {
                    "sent": "But it depends on how you implement the model, but visualization is in my.",
                    "label": 0
                },
                {
                    "sent": "In my view, one of the strongest.",
                    "label": 0
                },
                {
                    "sent": "Benefits of CFD and I will.",
                    "label": 0
                },
                {
                    "sent": "I will discuss this later on.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In order to pass from physics to model by middle of measure you need to have measure.",
                    "label": 1
                },
                {
                    "sent": "An measure can came from in vitro models, animal models or in vivo OK. You always have to remember that in in any kind in any field of Canfield application.",
                    "label": 1
                },
                {
                    "sent": "But in this one much more measures are necessary to build reliable CHI models.",
                    "label": 0
                },
                {
                    "sent": "So I can order that is not related to any that being measured.",
                    "label": 0
                },
                {
                    "sent": "It's in my view not useful at all, OK?",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In vitro models.",
                    "label": 0
                },
                {
                    "sent": "In this I just put a slide, so usually you have.",
                    "label": 0
                },
                {
                    "sent": "Mock set up part of the summer part of anatomy in this case is that because speed person valve.",
                    "label": 0
                },
                {
                    "sent": "That have been studied by Ricardo Vismara Project Milano at the Four Cargo Lab, which is a lab managed by engineering but inside Domino Hospital in in Milano.",
                    "label": 1
                },
                {
                    "sent": "OK so.",
                    "label": 0
                },
                {
                    "sent": "With this mock you see that you can study the dynamics.",
                    "label": 0
                },
                {
                    "sent": "That's why I show you some snap.",
                    "label": 0
                },
                {
                    "sent": "The dynamics of the flow flowing through this, which is a valve.",
                    "label": 0
                },
                {
                    "sent": "OK, that open and close according to the different pressure between the two side OK. You can in this.",
                    "label": 0
                },
                {
                    "sent": "Experimental setup you can of course measure some quantity.",
                    "label": 0
                },
                {
                    "sent": "OK, so let's say the pressure the Delta of the pressure that makes open an.",
                    "label": 0
                },
                {
                    "sent": "You can, let's say make movie and trace probably points also an verify the distribution of.",
                    "label": 0
                },
                {
                    "sent": "Position of the valve along time.",
                    "label": 0
                },
                {
                    "sent": "But what is much more hard to do is to, let's say measure point to point, what is the value of some through dynamics index OK?",
                    "label": 0
                },
                {
                    "sent": "And This is why I tell you that.",
                    "label": 0
                },
                {
                    "sent": "Free dynamics made by.",
                    "label": 0
                },
                {
                    "sent": "Easy Commander, so computational fluid dynamics are much more powerful tool to post process the data.",
                    "label": 0
                },
                {
                    "sent": "So in the same way as I show you that in the Sayoc the problem the Windows study can be approached.",
                    "label": 0
                },
                {
                    "sent": "In my view, only win with CFD and.",
                    "label": 0
                },
                {
                    "sent": "With much more, with advanced modeling CFD here I said that anymore dynamics where you have problem of getting into the district that you want to study because you cannot, let's say open.",
                    "label": 0
                },
                {
                    "sent": "Somebody K and.",
                    "label": 0
                },
                {
                    "sent": "And perform a measure inside of a human body.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Much more there.",
                    "label": 0
                },
                {
                    "sent": "CFD can be really advantage to perform some kind of study.",
                    "label": 0
                },
                {
                    "sent": "I will.",
                    "label": 0
                },
                {
                    "sent": "I will discuss this as much as I go on, but I want to make sure that also if you get in vitro models, this will not close all the information you need to study this problem.",
                    "label": 0
                },
                {
                    "sent": "They can help you to understand the phenomenon of course, which is required an to build the computational models that are related to physical phenomenon.",
                    "label": 0
                },
                {
                    "sent": "And you can compare it, but after that only with CFD you can get some kind of insight of a problem OK. Another way to get data from real life.",
                    "label": 0
                },
                {
                    "sent": "It's animal models.",
                    "label": 0
                },
                {
                    "sent": "This is PT Fe implant device, so it's a change of value.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Cooler part of an.",
                    "label": 0
                },
                {
                    "sent": "Of a sheep.",
                    "label": 0
                },
                {
                    "sent": "OK with the let's say.",
                    "label": 0
                },
                {
                    "sent": "It's made of some kind of material that is not biological, of course, and they substitute this vast quadratic on a ship an.",
                    "label": 0
                },
                {
                    "sent": "For this reason, you can, let's say, analyze in detail how geometry perform changes on the flow field OK in an animal model, and you can measure some quantities along time.",
                    "label": 0
                },
                {
                    "sent": "As you see in this is very rude image and I put it in in purpose.",
                    "label": 0
                },
                {
                    "sent": "The reason is that in this case, in my view CFD can be a more ethical approach to some necessary measure, but at the moment worldwide in vitro models and animal models are the main let's say the main model that are available for obtaining data.",
                    "label": 0
                },
                {
                    "sent": "OK, so see if the is growing, but it's not the the main activity.",
                    "label": 0
                },
                {
                    "sent": "This kind of implant have been performed by by Fabio Coachella.",
                    "label": 1
                },
                {
                    "sent": "Steven abisola.",
                    "label": 0
                },
                {
                    "sent": "I work with them in the past and this is kind of duty now.",
                    "label": 0
                },
                {
                    "sent": "It's closed because I'm focusing much more on other topics.",
                    "label": 0
                },
                {
                    "sent": "But they are valuable research on this kind of field.",
                    "label": 0
                },
                {
                    "sent": "And the the last possibility to get in to get data related.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Biological fluids are in vivo image OK.",
                    "label": 0
                },
                {
                    "sent": "This should be an animation, but it's not.",
                    "label": 0
                },
                {
                    "sent": "It's not relevant to get as an animation.",
                    "label": 0
                },
                {
                    "sent": "These are phase contrast MRI acquisition OK?",
                    "label": 1
                },
                {
                    "sent": "This kind of technique it's now increasing interest on researcher becausw.",
                    "label": 0
                },
                {
                    "sent": "It allows you to get certain insight.",
                    "label": 0
                },
                {
                    "sent": "So very rich information.",
                    "label": 0
                },
                {
                    "sent": "Because this on the left side I see the anatomy of the same district.",
                    "label": 0
                },
                {
                    "sent": "This is an Arctic arch OK of a human.",
                    "label": 0
                },
                {
                    "sent": "Person and this is a noninvasive technique to get this kind of information, and on the other side I have all the same district.",
                    "label": 0
                },
                {
                    "sent": "OK, I have also let's say voxel by voxel information on the three velocity encoding direction of the velocity field.",
                    "label": 0
                },
                {
                    "sent": "So it started to became something that is really similar to CFD Ann, you are, let's say, invited to say so why we don't just get this kind of image.",
                    "label": 0
                },
                {
                    "sent": "An process as CFD data and visualize this is what I've been done on the really less part of my of my PhD thesis Ann.",
                    "label": 0
                },
                {
                    "sent": "I agree with you that this is a very interesting application, but.",
                    "label": 0
                },
                {
                    "sent": "At the moment do also for cost of the acquisition and time duration and the fact that if you have a subject that is not healthy cannot stay into the.",
                    "label": 0
                },
                {
                    "sent": "Meineke Restaurants machine for long time OK, this kind of acquisition can takes up to one hour.",
                    "label": 0
                },
                {
                    "sent": "OK, so it's pretty long.",
                    "label": 0
                },
                {
                    "sent": "An and also that space in space and time.",
                    "label": 0
                },
                {
                    "sent": "You're really obliged to in order to limit the time OK inside of the machine and also the dimension of the data you need to.",
                    "label": 0
                },
                {
                    "sent": "Let's say ever a very quarter information with respect to the accuracy that you have with safety, OK?",
                    "label": 0
                },
                {
                    "sent": "So I believe that the interplay still necessary at the moment, but this is a very interesting technique that in the future can give information that can be processed as safety data.",
                    "label": 0
                },
                {
                    "sent": "OK, so with synthetic index and I will discuss this later on.",
                    "label": 0
                },
                {
                    "sent": "Also this acquisition we performed by Joanna Reed so.",
                    "label": 0
                },
                {
                    "sent": "And Marcelo casually from Philips Italy that they supported us.",
                    "label": 0
                },
                {
                    "sent": "So once we have the, let's say the physical model, even if.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Came from images or from experimental setup or from animal model.",
                    "label": 0
                },
                {
                    "sent": "Once I need to have a geometry.",
                    "label": 0
                },
                {
                    "sent": "OK so once I have the geometry no matter where this come from, I have to let's say ever matching tool in order to have a discretized geometry in order to perform CFD.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Once I am in two days CFD solver activity, it is presented me.",
                    "label": 1
                },
                {
                    "sent": "The scenario is wide so I have open source academic or analysis software and have commercial one and this again open.",
                    "label": 1
                },
                {
                    "sent": "Other scenario on the methods that are used to solve the equation.",
                    "label": 0
                },
                {
                    "sent": "So finite volume elements, spectral methods, lattice balls, one that is increasing.",
                    "label": 0
                },
                {
                    "sent": "Pretty pretty much now in the last decade is lattice Boltzmann method for IMO Dynamics.",
                    "label": 0
                },
                {
                    "sent": "Our growing growing an also from HPC center, it's interested becausw the way that our implementation of this kind of methods in HPC infrastructure is very interesting and scalability's probably higher than the one obtaining with finite volume or finite element, OK?",
                    "label": 0
                },
                {
                    "sent": "So I think the same, but I I'm not experienced at the moment on performing this kind of modeling.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, once I have the geometry and the mechanical property of the vascular and the principle of the conservation equation of mass and momentum, I can say compute the solution of this equation to have, which is the which is the output velocity and pressure distribution for each point of my discretized geometry.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So the the main approach that is behind this is that the computational domain once is discretized OK.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Has me on ever, let's say.",
                    "label": 0
                },
                {
                    "sent": "Conservation general conservation equation for mass and momentum.",
                    "label": 1
                },
                {
                    "sent": "And that are discretized into algebraic equation OK and solved for each cell and cell in the descriptor in the discretization OK.",
                    "label": 1
                },
                {
                    "sent": "So the Jenna.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our concept that is behind is that say if the number of cell goes up to Infinity then that makes solution get to exact and this will be independent from the numerical scheme that I adopt.",
                    "label": 1
                },
                {
                    "sent": "So but in practice the number of cell is fine it OK?",
                    "label": 0
                },
                {
                    "sent": "And ended up the numerical solution tends to be just OK. OK so I need to.",
                    "label": 0
                },
                {
                    "sent": "Perform a balancing of accuracy and cost because otherwise the problem will be unapproachable OK.",
                    "label": 0
                },
                {
                    "sent": "But once I decide to understand playing, let's say my problem from an American point of view.",
                    "label": 1
                },
                {
                    "sent": "This will affect the the property of the numerical scheme that I use will affect the solution that I'm looking for.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK so I have to take care.",
                    "label": 0
                },
                {
                    "sent": "The other CFD concept is that exactly analytical solution are not available due to several complexity that I'm going to show you.",
                    "label": 0
                },
                {
                    "sent": "So numerical algebraic approximated solution of the problem are the only way that I have to perform investigation on this environment.",
                    "label": 1
                },
                {
                    "sent": "OK, why is that asking environment?",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That the fully 3D I show you here very.",
                    "label": 0
                },
                {
                    "sent": "Let's say different view of the same geometry that asks you to understand that this problem is really 3 dimensional.",
                    "label": 0
                },
                {
                    "sent": "OK, so there are no.",
                    "label": 0
                },
                {
                    "sent": "You cannot see any symmetry.",
                    "label": 0
                },
                {
                    "sent": "Plane or line or stuff like this.",
                    "label": 0
                },
                {
                    "sent": "This is a very fully trendy problem.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this in in nature the the flow waveform at each boundary.",
                    "label": 0
                },
                {
                    "sent": "It's usually due to the effect of the heart pumping.",
                    "label": 0
                },
                {
                    "sent": "It's something that has time dependent.",
                    "label": 1
                },
                {
                    "sent": "Wave form OK. An Moreover, it is not even constant for a selected slice.",
                    "label": 0
                },
                {
                    "sent": "So it's change in time and change in space at the same place.",
                    "label": 0
                },
                {
                    "sent": "OK, so the space and time distribution is quite complex, OK?",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the other the other big task is the teknowledge so.",
                    "label": 0
                },
                {
                    "sent": "Experimental knowledge on the wall property and fruit of all interaction and the velocity profile distribution is a problem because once you have set your your CFD model, you.",
                    "label": 1
                },
                {
                    "sent": "I mean, you you don't know what kind of boundary condition is reliable for that geometry, because it's really hard to measure it in vivo.",
                    "label": 0
                },
                {
                    "sent": "OK, now with the technique that we show you.",
                    "label": 0
                },
                {
                    "sent": "If you have the facility because I remember you that this kind of measure that are very.",
                    "label": 0
                },
                {
                    "sent": "Interesting this one.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You need to have a face contrast MRI machine with cost very very high.",
                    "label": 0
                },
                {
                    "sent": "An I mean maintenance and stuff like this so it's very hard in this field of application to have correct.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The measures OK. Anne also is a task environment becausw the interplay of mathematics, numerics and technological platform are stronger, so I have to map concept mathematical.",
                    "label": 0
                },
                {
                    "sent": "Consider convergence, consistency, instability into boundedness concern, conservativeness and transport illness that is the counterpart in the numeric.",
                    "label": 1
                },
                {
                    "sent": "Because I'm not I have a problem that mathematical description but then the solution is numerically.",
                    "label": 0
                },
                {
                    "sent": "Obtain it so.",
                    "label": 0
                },
                {
                    "sent": "I have an interplay that I have to manage.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How did I use in my in my experience?",
                    "label": 0
                },
                {
                    "sent": "I've been saying it is that the CFD can be really helpful an economically and also ethically in my view.",
                    "label": 1
                },
                {
                    "sent": "More.",
                    "label": 0
                },
                {
                    "sent": "Inexpensive cost OK. For several application I have put some reference of work that I have been done along my Mycareer.",
                    "label": 0
                },
                {
                    "sent": "That are, in my view, useful to have an inspiration for future work.",
                    "label": 0
                },
                {
                    "sent": "If you want to use CFD anymore dynamics.",
                    "label": 0
                },
                {
                    "sent": "So perhaps the first work that I've selected is system analysis.",
                    "label": 0
                },
                {
                    "sent": "An optimization OK of a blood filter and there.",
                    "label": 1
                },
                {
                    "sent": "Let's say we are.",
                    "label": 0
                },
                {
                    "sent": "We were interested on using CFD to track bubble inside of an anterior line filter.",
                    "label": 0
                },
                {
                    "sent": "At two understand.",
                    "label": 0
                },
                {
                    "sent": "What part of the filter is more stressed in terms of say, more?",
                    "label": 0
                },
                {
                    "sent": "Oxygen, an size of different size bubble of different size of oxygen are captured by the filter in some places instead of other that are let's say mostly unused.",
                    "label": 0
                },
                {
                    "sent": "OK, that's why I said the system analysis.",
                    "label": 0
                },
                {
                    "sent": "OK, an optimization that you can suggest changes on the geometry in order to obtain a better performance of the arterial line filter.",
                    "label": 0
                },
                {
                    "sent": "Another another application of save the new modern Amix in My view is detailed measures in the sense that.",
                    "label": 0
                },
                {
                    "sent": "Once the clinician or researcher requires data from.",
                    "label": 0
                },
                {
                    "sent": "From phase contrast MRI they can give you several data to build CFD model in terms of geometry and boundary condition.",
                    "label": 0
                },
                {
                    "sent": "Very accurate.",
                    "label": 0
                },
                {
                    "sent": "OK, but after that the overall flow field inside cannot be processed.",
                    "label": 0
                },
                {
                    "sent": "With sufficient accuracy in space and time to obtain synthetic index.",
                    "label": 0
                },
                {
                    "sent": "Useful in human dynamics.",
                    "label": 0
                },
                {
                    "sent": "You can only do this in CFD at the moment, OK, but in the near future probably is going to be possible.",
                    "label": 0
                },
                {
                    "sent": "Possible also to bring this kind of technique inside of measures of PC MRI.",
                    "label": 0
                },
                {
                    "sent": "But at the moment, CFD is the only solution to perform some kind of study.",
                    "label": 0
                },
                {
                    "sent": "In particular, I have selected this one which is the 1st of a quite long serious that is radical flow analysis inside of in order to rely flow, an author Genesis risk in auto coronary bypass.",
                    "label": 0
                },
                {
                    "sent": "But the main concept inside of this paper.",
                    "label": 0
                },
                {
                    "sent": "That's why I selected.",
                    "label": 0
                },
                {
                    "sent": "Only this one as a, let's say, very precise indication as a reference.",
                    "label": 0
                },
                {
                    "sent": "Because this is the first paper that we wrote where we underline the fact that atherogenesis so some phenomenon that occurs at the wall vessel location is related to the presence or the absence of helical structure in the flow field in the bulk.",
                    "label": 0
                },
                {
                    "sent": "OK, so in the mainstream of the flow.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Without CFD, it would not be have been possible to.",
                    "label": 0
                },
                {
                    "sent": "Measure the interplay of.",
                    "label": 0
                },
                {
                    "sent": "Stress at the world end.",
                    "label": 0
                },
                {
                    "sent": "Illegal presence inside Becausw with other experimental measurements.",
                    "label": 0
                },
                {
                    "sent": "We were not able to compute Erekle flow quantities OK with accuracy and wall stress analysis with accuracy and perform.",
                    "label": 0
                },
                {
                    "sent": "Let's say a statistical study, two found if they were an interplay of what kind, OK?",
                    "label": 0
                },
                {
                    "sent": "After that, this interplay has been, let's say, founded in several other application.",
                    "label": 0
                },
                {
                    "sent": "But this is the first paper where we focused on that and for this reason, without CFD it would not have been possible to do this kind of implication.",
                    "label": 0
                },
                {
                    "sent": "Safety in dynamics is also important for hypothesis testing, in the sense that it's very easy once you have built reliable safety model to make changes of quantity that are really hard to change in experimental setup.",
                    "label": 0
                },
                {
                    "sent": "In this in this case.",
                    "label": 0
                },
                {
                    "sent": "We we studied the influence of the outflow condition, OK?",
                    "label": 1
                },
                {
                    "sent": "With regard to helical structure inside, so we can just you can.",
                    "label": 0
                },
                {
                    "sent": "Perform the so called what if analysis?",
                    "label": 0
                },
                {
                    "sent": "So if I change if I change distribution of the flow split, let's say in an accurate ification, how can this affect what I'm looking for?",
                    "label": 0
                },
                {
                    "sent": "OK, this is a very important kind of application.",
                    "label": 0
                },
                {
                    "sent": "Another another selection that I put here is validation of clinical practice that I call a Doppler serious in the sense that in my career I start with my master thesis on this kind of problem that is.",
                    "label": 1
                },
                {
                    "sent": "In clinics, there are several hypothesis there are related to measurement in human body.",
                    "label": 0
                },
                {
                    "sent": "An one of these was related to the flow rate measurement.",
                    "label": 0
                },
                {
                    "sent": "When you are using a Doppler, so only velocity information.",
                    "label": 0
                },
                {
                    "sent": "Anne, sometimes.",
                    "label": 0
                },
                {
                    "sent": "Finish and forget to verify if on their context, they prothesis, there is behind the measure, they are still valid, OK, and this is can be a problem in the sense that you can easily show with CFD that if they put, this is not valid.",
                    "label": 0
                },
                {
                    "sent": "I mean, you are using something some formula OK, very simple to apply.",
                    "label": 0
                },
                {
                    "sent": "That condition likes very much, but this totally let's say.",
                    "label": 0
                },
                {
                    "sent": "Are reliable because they practice is not valid anymore.",
                    "label": 0
                },
                {
                    "sent": "I have been showed this within the context of Doppler measurement for for blood flow, blood flow rate measurement in vivo and we have validated we have studied at the beginning only with CFD and then we keep being moving forward and we arrive with the less paper which is this one.",
                    "label": 0
                },
                {
                    "sent": "What was the number based estimate of flow rate in Doppler analysis in validation by means of a consummately?",
                    "label": 1
                },
                {
                    "sent": "OK, so at the very end we validate our formula using in vivo data.",
                    "label": 0
                },
                {
                    "sent": "OK, after that the project died.",
                    "label": 0
                },
                {
                    "sent": "But in my view that it's an end line.",
                    "label": 0
                },
                {
                    "sent": "OK, so we show it that the idea was correct and that also in vivo the model reliable and that our formula to estimate in a more correct way.",
                    "label": 0
                },
                {
                    "sent": "The Blue Star rating presence of possibility is useful also in vivo.",
                    "label": 0
                },
                {
                    "sent": "The other aspect very, very important is related to implantable device the democ that I show you of the poor sign.",
                    "label": 0
                },
                {
                    "sent": "Because speed valve it's a typical mark for valve study.",
                    "label": 0
                },
                {
                    "sent": "An experimental setup involve validation, it's the main the main tool used today, but CFD with fluid full structure interaction OK.",
                    "label": 0
                },
                {
                    "sent": "Analysis, in my view are the future, so there are as as I show you with the sale now.",
                    "label": 0
                },
                {
                    "sent": "Instead of design, CFD is quite evident.",
                    "label": 0
                },
                {
                    "sent": "It's quite common tool.",
                    "label": 0
                },
                {
                    "sent": "Use it for important implantable device.",
                    "label": 0
                },
                {
                    "sent": "This is not yet as strong as in, let's say wind engineering, but in my view this will be very strong.",
                    "label": 0
                },
                {
                    "sent": "Very strong tool in this kind of application and I I've been put you a couple of reference where we show out to use CFD to measure some quantities that you can never, never, never be able to measure in experimental setup OK?",
                    "label": 0
                },
                {
                    "sent": "So this would be a re key advantage of CD and once again we showed it starting from experimental setup, validating received model on the experimental setup and then moving forward from that and showing what added value an what.",
                    "label": 0
                },
                {
                    "sent": "Added insight we can have post processing CFD data.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so I take a short.",
                    "label": 0
                },
                {
                    "sent": "This part up.",
                    "label": 0
                },
                {
                    "sent": "This slide ends my my very first part, so the high level presentation.",
                    "label": 0
                },
                {
                    "sent": "I hope that this part is quite clear, but once again I invite you to get the question to bring the question to lay on that.",
                    "label": 0
                },
                {
                    "sent": "Maybe you can send me an email and I will start the next part after lunch break with.",
                    "label": 0
                },
                {
                    "sent": "With the answering your question now I have to get into the.",
                    "label": 0
                },
                {
                    "sent": "The parties say useful only for the tutorial in the sense that since I don't know the background, I have to select a common background for everybody and say something about something about some important.",
                    "label": 0
                },
                {
                    "sent": "Feature of blood that we want to study and that we can study using safety in a proper manner.",
                    "label": 0
                },
                {
                    "sent": "So if Leon can just send me an SMS, maybe with the that I'm at where I have to stop.",
                    "label": 0
                },
                {
                    "sent": "So if you just tell me when you have to go to lunch.",
                    "label": 0
                },
                {
                    "sent": "I will.",
                    "label": 0
                },
                {
                    "sent": "I will take care of the of the time.",
                    "label": 0
                },
                {
                    "sent": "OK, so I start and then I will see the message of the deadline for your lunch break, OK?",
                    "label": 0
                },
                {
                    "sent": "So this second part relies on the physics of blood, and in particular we uninterested on the working hypothesis investors.",
                    "label": 1
                },
                {
                    "sent": "So I'm here focusing on small and medium sized vessel but not in let's say very very small vessels like capillaries and stuff like this OK. Then we saw we will see some conservation law recommends an how this is implemented in fluent, OK. And then I will just give you some notes on convergence becausw.",
                    "label": 1
                },
                {
                    "sent": "It's a concept that is necessary to save decide when the simulation is OK or not, and this is not easy sometimes and also on possible source of errors that are interesting in my view to have critics approach to CFD.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So blood is.",
                    "label": 0
                },
                {
                    "sent": "I mean that as is a main function, is to transport and delivery oxygen and not rent.",
                    "label": 0
                },
                {
                    "sent": "Into the into the vascular OK.",
                    "label": 0
                },
                {
                    "sent": "The blood flow resistance is influenced by very complicated architecture of the busker network and the flow behavior of blood components and build says N plasma.",
                    "label": 1
                },
                {
                    "sent": "And of course from also pulsatility.",
                    "label": 1
                },
                {
                    "sent": "At the microscopic level, blood appears to be a liquid material, but at the microscopic, it's presents, as you will know, solid particle of different sizes, so.",
                    "label": 0
                },
                {
                    "sent": "In",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Generally, we can assume that the density of the blood is constant.",
                    "label": 0
                },
                {
                    "sent": "OK, so at 300 Kelvin temperature an under Upton spheric pressure condition block density is very similar or at least equal to water.",
                    "label": 1
                },
                {
                    "sent": "So this is the value of blood density that we will use in the in our tutorial and I put it in this kind of units.",
                    "label": 0
                },
                {
                    "sent": "Becausw are the one that are well get from two to two fluent.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In the same way.",
                    "label": 0
                },
                {
                    "sent": "Then the blood viscosity.",
                    "label": 0
                },
                {
                    "sent": "It's.",
                    "label": 0
                },
                {
                    "sent": "By the way, is well known that.",
                    "label": 0
                },
                {
                    "sent": "Blood is a non Newtonian fluid K, but for many applications can be considered a Newtonian fluid.",
                    "label": 1
                },
                {
                    "sent": "And then so that the relationship between.",
                    "label": 1
                },
                {
                    "sent": "Velocity and gradient and viscous forces is linear and the slope of this line is the value of the viscosity.",
                    "label": 1
                },
                {
                    "sent": "We would assume this value, which is very very common in in clinics.",
                    "label": 0
                },
                {
                    "sent": "OK so.",
                    "label": 0
                },
                {
                    "sent": "This will be.",
                    "label": 0
                },
                {
                    "sent": "Our constant value of of the viscosity, so the charade.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Usually, as this kind of form OK, but we are working our working hypothesis for medium size and large size vessel are that we are on this.",
                    "label": 0
                },
                {
                    "sent": "Aria OK.",
                    "label": 0
                },
                {
                    "sent": "So blood is Newtonian and non Newtonian but we are not going to approach with our safety models.",
                    "label": 1
                },
                {
                    "sent": "The Newtonian part OK.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In order to study a fluids, as you well know, we should get some characteristic of.",
                    "label": 0
                },
                {
                    "sent": "The rental number, so this synthetic number, dimensional dimensional S number are useful to have, let's say a quick understand of the flow behavior that we are studying.",
                    "label": 0
                },
                {
                    "sent": "So if you define the random number in this way, an in particular, if you identify as.",
                    "label": 0
                },
                {
                    "sent": "Artistic length in a vessel the diameter.",
                    "label": 0
                },
                {
                    "sent": "Of the other vessel.",
                    "label": 0
                },
                {
                    "sent": "Then you can state that if the random number is bigger than let's say very, very big, the flow is dominated by inertia, otherwise the flow is dominated by viscous effect.",
                    "label": 1
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this.",
                    "label": 0
                },
                {
                    "sent": "Can be visualized in some how to say that?",
                    "label": 0
                },
                {
                    "sent": "Lamina flow as this kind of bottom, whereas turbulent flow is the other one.",
                    "label": 1
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Nat.",
                    "label": 0
                },
                {
                    "sent": "When we are studying blood flow regime and we are probably in between laminar that can get to turbulent.",
                    "label": 1
                },
                {
                    "sent": "OK, but it is not so in medium size and large vessel we can assume that the flow is laminar and not turbulent even if for some district let's say for the Arctic Arch, there is several study and also let's say out of the.",
                    "label": 0
                },
                {
                    "sent": "Out of the valve of the heart, of course there are some turbulence, but there is, let's say several study that are analyzing the fact that the behavior of the body is made in the sense of not allowing turbulence to get active essay an to destroy.",
                    "label": 0
                },
                {
                    "sent": "Let's say this kind of turbulence to dissipate this kind of energy in other manner.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is quite advanced topics, but just say that we can assume that blood is laminar under laminar condition OK?",
                    "label": 0
                },
                {
                    "sent": "Another number that is meaningful, very meaningful in minimally nomics is the woman is the number man.",
                    "label": 0
                },
                {
                    "sent": "This is a quantity day.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is identified by a characteristic land and but also by the frequency of the signal of the.",
                    "label": 1
                },
                {
                    "sent": "Blood flow waveform OK.",
                    "label": 0
                },
                {
                    "sent": "If the woman's number is, but it's more like the flow is dominated by viscous effect.",
                    "label": 1
                },
                {
                    "sent": "So I see Mail to opposite flow and if it's big, increasing this number over one, the flow is dominated by transient effect OK?",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The effect of the woman's number is as follows, so.",
                    "label": 0
                },
                {
                    "sent": "As much as I have possibility on my signal OK on my waveform.",
                    "label": 0
                },
                {
                    "sent": "At the.",
                    "label": 0
                },
                {
                    "sent": "The fact that they have a dynamics.",
                    "label": 0
                },
                {
                    "sent": "In time the not does not allow the velocity profile to get developed up to a parabola.",
                    "label": 0
                },
                {
                    "sent": "As you will know an as we will see on the hands on session if we have straight rigid tube with a constant velocity inlet value after a certain entry length the distribution and allowing air condition of course.",
                    "label": 0
                },
                {
                    "sent": "After a certain after a certain distance from the inlet, we have fully developed profile that is a parabola OK?",
                    "label": 0
                },
                {
                    "sent": "But if the signal is not constant in time and it's.",
                    "label": 0
                },
                {
                    "sent": "OSHA waiting OK with a certain frequency.",
                    "label": 0
                },
                {
                    "sent": "The velocity profile in space is not able on diameter to reach to ever reach the problem and he start to assume different shape is a long time.",
                    "label": 0
                },
                {
                    "sent": "So depending on the point of the wave form that I am I am analyzing and on the value of the warmers in number.",
                    "label": 0
                },
                {
                    "sent": "So as much as I have.",
                    "label": 0
                },
                {
                    "sent": "Big womans number.",
                    "label": 0
                },
                {
                    "sent": "As much as I have a flat and velocity profile OK.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In anymore dynamics we have to consider these two numbers in order to perform, let's say correct evaluation or to have a priority knowledge that is required to analyze our flow.",
                    "label": 0
                },
                {
                    "sent": "So the Reynolds number and the Woman's Day number OK.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There are several way to perform a classification of flow and for blood we can perform this kind of this again and say that laminar or turbulent.",
                    "label": 0
                },
                {
                    "sent": "Condition fluid particle moving smoother and layered fashion.",
                    "label": 0
                },
                {
                    "sent": "OK so there is no mixing.",
                    "label": 0
                },
                {
                    "sent": "While in turbulent flow through particle move in Acatic and taglit fashion OK so with significant mixing and steady or unsteady so steady flow is the flow property at a given point in space are constant in time whereas unsteady flow is that the flow properties at any given point in space change with the time OK?",
                    "label": 1
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "As far as we have, so here we want to have we want to study fluid.",
                    "label": 0
                },
                {
                    "sent": "There is under linear flow condition an under unsteady flow.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK so this I mentioned this before.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Here I show you something that is related to their product knowledge.",
                    "label": 0
                },
                {
                    "sent": "This graph of.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Women's new number velocity provide distribution are obtained by a book, but we performed.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some analysis also using fluent.",
                    "label": 0
                },
                {
                    "sent": "An we met.",
                    "label": 0
                },
                {
                    "sent": "We compared modeling and measure performed in vivo on see under similar condition and also we compare this with the analytical solution of the Woman's Day problem.",
                    "label": 0
                },
                {
                    "sent": "In order to verify if computational model is reliable with respect to measure and with respect to.",
                    "label": 0
                },
                {
                    "sent": "Analytical solution.",
                    "label": 0
                },
                {
                    "sent": "What you are seeing here is a comparison between the analytical solution and the measurement an.",
                    "label": 0
                },
                {
                    "sent": "As you can see.",
                    "label": 0
                },
                {
                    "sent": "The woman's be the woman's theory is quite in Group agreement OK with measure, performative, evil, OK, the noisy noisy pattern are of course the measure and the smoothed one are the analytical solution.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another kind of classification is incompressible or compressible an we have this kind of definition so incompressible flow the volume of a given fruit particle does not change at this implies the density is constant everywhere.",
                    "label": 1
                },
                {
                    "sent": "An essentially is valid for all liquid's flow.",
                    "label": 0
                },
                {
                    "sent": "A compressible is the vice versa, so the volume of a given food can be changed.",
                    "label": 0
                },
                {
                    "sent": "Sorry, I saw that is.",
                    "label": 0
                },
                {
                    "sent": "Stop it.",
                    "label": 0
                },
                {
                    "sent": "K. OK.",
                    "label": 0
                },
                {
                    "sent": "If you need to talk me Leon, you can.",
                    "label": 0
                },
                {
                    "sent": "You can always call me on the on the cell phone, OK?",
                    "label": 0
                },
                {
                    "sent": "So compressor is device server side.",
                    "label": 1
                },
                {
                    "sent": "This imply the density will vary through the flow field.",
                    "label": 0
                },
                {
                    "sent": "But as we say in advance for blood we we are studying an incompressible flow.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Eat.",
                    "label": 0
                },
                {
                    "sent": "Then single phase and multiphase an more genius, and after genius.",
                    "label": 0
                },
                {
                    "sent": "Where single phase is is a fluid flow without phase change.",
                    "label": 1
                },
                {
                    "sent": "A liquid or gas and multi phases.",
                    "label": 0
                },
                {
                    "sent": "Multiple phases are present in the flow field homogeneous.",
                    "label": 1
                },
                {
                    "sent": "An intelligence implies that only fluid material exists in the flow.",
                    "label": 1
                },
                {
                    "sent": "In the first case, whereas multiple fluid solid materials are present in the flow field with.",
                    "label": 0
                },
                {
                    "sent": "Blood we are studying a single phase, an homogeneous fluids.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So the working hypothesis that we need to implement in whatever software for CFD analysis.",
                    "label": 0
                },
                {
                    "sent": "So we see this on fluent, but it's just us selection, so it's allowing airflow cause Raynaud's.",
                    "label": 0
                },
                {
                    "sent": "And we have to check this if we are working on our problem.",
                    "label": 0
                },
                {
                    "sent": "In the flow is laminar, so we are below a certain value of the rhino number.",
                    "label": 0
                },
                {
                    "sent": "It's incompressible, so we will select solver for incompressible fluids.",
                    "label": 0
                },
                {
                    "sent": "It's under unsteady behavior, so this is right to the fact that the woman is the theory as I show you is correct, so.",
                    "label": 0
                },
                {
                    "sent": "Unsteady behavior.",
                    "label": 0
                },
                {
                    "sent": "It's really meaningful for dynamics.",
                    "label": 0
                },
                {
                    "sent": "It's probably the 1st.",
                    "label": 0
                },
                {
                    "sent": "Characteristic of biological fluids to be time dependent OK?",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "OK, the problem is described exactly by three navier Stokes equation and the equation of continuity.",
                    "label": 1
                },
                {
                    "sent": "But the general solution of this kind of problem is not yet available.",
                    "label": 1
                },
                {
                    "sent": "Anne Anne the physiological quantities.",
                    "label": 1
                },
                {
                    "sent": "Which will arise in a treatment of blood flow in large activities and network known.",
                    "label": 1
                },
                {
                    "sent": "OK so we have uncertainity on the modeling and we need to model this on a numerical way because we don't have analytical solution OK?",
                    "label": 0
                },
                {
                    "sent": "So that, as I mentioned in the first, the first part of the lecture.",
                    "label": 0
                },
                {
                    "sent": "The works in terminal we are working on terms of approximate models OK.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We have to consider important feature of blood and neglect.",
                    "label": 0
                },
                {
                    "sent": "An important feature.",
                    "label": 0
                },
                {
                    "sent": "OK, so the important important feature are that continue we need to do this in order to simplify.",
                    "label": 0
                },
                {
                    "sent": "Otherwise we could not approach our problem.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Important feature are the continuing prothesis.",
                    "label": 0
                },
                {
                    "sent": "OK. That the blood is nominal.",
                    "label": 0
                },
                {
                    "sent": "The blow is an under unsteady flow condition that is uncompressible.",
                    "label": 0
                },
                {
                    "sent": "Isotropic and newtonian.",
                    "label": 0
                },
                {
                    "sent": "OK, so all this hypothesis are necessary to be kept OK with their value of these quantities.",
                    "label": 0
                },
                {
                    "sent": "But we were working under this hypothesis so.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the unimportant feature that are still true for the physics of blood in real life, but they are not necessary to be put in place to have CFD models are that because it depends on temperature and the percentage of Emma talk right?",
                    "label": 1
                },
                {
                    "sent": "So that is the percent of particle inside of the blood.",
                    "label": 0
                },
                {
                    "sent": "And it is compressible.",
                    "label": 0
                },
                {
                    "sent": "OK, for low pressure condition.",
                    "label": 1
                },
                {
                    "sent": "And that impression of some condition is much more transitional.",
                    "label": 1
                },
                {
                    "sent": "Fluent fluid that is moving to turbulent instead of being laminal.",
                    "label": 0
                },
                {
                    "sent": "OK, but this is something that we don't want to approach now.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, I will.",
                    "label": 0
                },
                {
                    "sent": "I will stop here.",
                    "label": 0
                },
                {
                    "sent": "If you are OK to let you go to the lunch break.",
                    "label": 0
                },
                {
                    "sent": "If it's the correct time and I will continue this.",
                    "label": 0
                },
                {
                    "sent": "After the lunch break.",
                    "label": 0
                },
                {
                    "sent": "OK, the question is.",
                    "label": 0
                },
                {
                    "sent": "They like to to know how the program switch from runs to less approach and what is the trigger if it's the mesh size or distance from the wall.",
                    "label": 0
                },
                {
                    "sent": "And the model is.",
                    "label": 0
                },
                {
                    "sent": "Let's say we have used the model already implemented in fluent in.",
                    "label": 0
                },
                {
                    "sent": "As often happen with Commercial Code, so they are already built in.",
                    "label": 0
                },
                {
                    "sent": "The model is of course it's under it's published.",
                    "label": 0
                },
                {
                    "sent": "I can give you the reference.",
                    "label": 0
                },
                {
                    "sent": "I can give you the reference of the of the papers that I will write you away.",
                    "label": 0
                },
                {
                    "sent": "So this is the article where you can find all the detail.",
                    "label": 0
                },
                {
                    "sent": "Becausw did you?",
                    "label": 0
                },
                {
                    "sent": "Well, this is computational fluid dynamics problems.",
                    "label": 0
                },
                {
                    "sent": "Laudable it's published under theoretical computational fluid dynamics.",
                    "label": 0
                },
                {
                    "sent": "2006 so it's pretty pretty new and.",
                    "label": 0
                },
                {
                    "sent": "OK, you should have it OK. On there so you can find it as a regular paper.",
                    "label": 0
                },
                {
                    "sent": "Ann is I was mentioning before the modeling was already implemented in fluent and we just selected the model to test.",
                    "label": 0
                },
                {
                    "sent": "It's a modification of a previous version of the of the desk model proposed by the same author, so the same author developed some improvement of the first modeling.",
                    "label": 0
                },
                {
                    "sent": "Where to answer your question, this which is on the cell size OK.",
                    "label": 0
                },
                {
                    "sent": "So to answer your question, the desk model switches on the on the size and this it's a bit modification to have more stable and reliable result.",
                    "label": 0
                },
                {
                    "sent": "But I invite you, I suggest you to say get the paper and have the full description of the of the model we just used.",
                    "label": 0
                },
                {
                    "sent": "Also as with standard will function.",
                    "label": 0
                },
                {
                    "sent": "So we didn't.",
                    "label": 0
                },
                {
                    "sent": "Let's say implemented anything you, so we left it as a model is implemented in.",
                    "label": 0
                },
                {
                    "sent": "Influence OK?",
                    "label": 0
                }
            ]
        }
    }
}