{
    "id": "amsa57hg4hqrncntpx534pi3aimkrrxa",
    "title": "Targeted retrieval of gene expression measurements using regulatory models",
    "info": {
        "author": [
            "Elisabeth Georgii, Helsinki Institute for Information Technology"
        ],
        "published": "Oct. 23, 2012",
        "recorded": "September 2012",
        "category": [
            "Top->Computer Science->Machine Learning",
            "Top->Computer Science->Bioinformatics"
        ]
    },
    "url": "http://videolectures.net/mlsb2012_georgii_retrieval/",
    "segmentation": [
        [
            "This talk is about targeted retrieval using regulatory models.",
            "It is joint work with Jaco Saloya V Mikaboshi, Jaco, Congress Heavy and somewhere Caskey, and I gratefully acknowledge the funding sources."
        ],
        [
            "So what is this work about?",
            "Their huge public repository is of molecular measurement data and consumer effort is made to maintain and extend them, and in order to explore this wealth of data, we and other groups are interested in providing methods to do automated search for relevant databases.",
            "So more precisely, the task we consider is.",
            "Give him a gene expression measurement as a query.",
            "Find similar gene expression measurements from a database and if you are not familiar with this red presentation here, so.",
            "Each column, sorry, each column represents a gene expression measurement, which is a heat map of the expression values across all the genes so that Y direction would be the jeans.",
            "So the logical next question would be."
        ],
        [
            "What is a suitable similarity measure for the task?",
            "A state of the art would be to look for shared keywords in the annotation of both gene expression measurements, and that's a very reliable approach, because if two measurements share the same annotation then they are very likely to be relevant to each other, but it totally excludes new findings about which biological conditions are related to each other.",
            "And then there are also obvious problems that this.",
            "Measurements and annotation state do not necessarily use the same kind of vocabulary, so we might miss a lot of relevant experiments due to that.",
            "And therefore data driven approaches have been considered, and the simplest way would be to compute Pearson or Spearman correlation between the gene expression profiles.",
            "This is easy and straightforward to compute, but it ignores the dependencies between the jeans and also this similarity measure can be disturbed by noisy jeans.",
            "So what we have is a thought.",
            "Class of methods are model based approaches.",
            "And those start by learning a model of biology from the database and then use that model to define similarity measure between between different profiles or experiments and that potentially yields better retrieval results and also more biological insights.",
            "But it comes at a higher computational cost.",
            "The approach."
        ],
        [
            "Proposed here is called model based targeted retrieval and it has two main aspects.",
            "The first one is targeted focus, so the model is guided by a list of genes provided by the user and for example, it could be a set of things that is known to be related to a certain disease, and then we do not try to model everything, but only what is relevant to those genes of interest.",
            "So that gives the user more control.",
            "And also it reduces the overall computational effort, so we can build details models to explain the behavior of those genes.",
            "And the model we are interested here are gene regulatory network models.",
            "So their aim is to.",
            "To describe the similarity between biological conditions and terms of.",
            "Activation patents, in their biological networks, so why did we get an improved interpretability of the retrieval result?",
            "So and then not show.",
            "Our system for targeted retrieval works as follows.",
            "So in the first step.",
            "Irregular pops.",
            "In the first step, a regulatory model is learned for the."
        ],
        [
            "Genes provided by the user.",
            "Based on all the measurements in their data compendium and then the second step that.",
            "Model is used to define to do the retrieval.",
            "And here the user provides a certain.",
            "Query measurement of of interest and then she receives a list.",
            "Of all the earlier measurements in the data compendium in ranked order according to that similarity measure defined based on the model."
        ],
        [
            "The target gene expression model we use is a conditional model for the expression of the target genes.",
            "Given the expression of all the other jeans, and for simplicity we use, here is so so called pseudo likelihood approach, where we have an independent model for each target gene.",
            "Based on the expression values of all the other teens and then the overall pseudo likelihood is just on obtained by multiplication.",
            "For the gene specific models, we assume Gaussian linear regression models, where the.",
            "Expression of the.",
            "And Target gene is modeled as a linear combination of the expression of the oil.",
            "The other genes plus some Gaussian noise and.",
            "We obtain sparse estimates for this weight coefficient vectors Peter by using a one norm regularization order.",
            "The usual lasso regression.",
            "By that we obtained for each target in a set of neighbors that have none.",
            "Non zero coefficients here."
        ],
        [
            "So this is all very standard.",
            "So what we obtain is then a set of local dependency networks.",
            "The point I want to make here is that we use this model.",
            "To define a similarity measure between gene expression experiments and how do we do this year?",
            "So we.",
            "We represent each data point with respect to the model.",
            "For that we use the Fisher score, which is formally defined as the gradient.",
            "After lock likelihood for that data point.",
            "At the learn values of the model parameters, so it's still like it's the like.",
            "Sorry it's a gradient with respect to their model parameters.",
            "And of course it assumes that we have a smooth parametrization of the model.",
            "So intuitively what this gradient is it is, it can be understood as the direction in which we need to update the parameters of the model.",
            "After adding that data point to the training data set.",
            "So the learned models of the.",
            "They learn values of the model parameters.",
            "The summary of the training data set and then the updated values of the parameters can be seen.",
            "As a summary of the extended data set the so the training data set plus this.",
            "GNU data point in your example.",
            "So now too.",
            "In order to compare two data points.",
            "The inner product of the data points in this new future score representation is a suitable similarity measure that can be interpreted.",
            "Now along these lines, as the similarity of the.",
            "2 extended datasets either extending by the first point or by the second point, and we.",
            "We take the similarity based on the model based summary statistics.",
            "This is called the symbol Fisher kernel, and it's a common approximation to the Fisher kernel, which has a rigorous connection to information to metry and.",
            "Fisher Kernel has originally been introduced to use hidden Markov models, so generative models and discriminative classifiers.",
            "And here we use it to do this retrieval and unsupervised way.",
            "The parameters of biological interest in our model as simply the coefficients of the neighbors of each target gene.",
            "As an example application, I will present the case study."
        ],
        [
            "An automatic stress in plants as Matic stress relates to the dehydration of plants and their conditions like draught, high salt or cold, and it's one of the most important abiotic stresses for crop productivity.",
            "M The cellular response to those stresses is that first.",
            "Her mentor, second messengers, are triggered, then some signaling pathways are activated and then we have some cellular response in the gene expression and so on.",
            "And without going into details here, I just want to make the point that is 3 stresses drought soil Dan called they have.",
            "Some shared response but also some some specific cellular RESP."
        ],
        [
            "Ants.",
            "Is data we talk 141 differential expression profiles?",
            "From 38 microarray datasets.",
            "Related to stress in Arabidopsis thaliana and we looked at about 6600 differentially expressed genes.",
            "As benchmark task we considered the retrieval of automatic stress experiments, so these were 31 profiles.",
            "Among these 141 and they came from 5 datasets in total.",
            "The experimental setup we used was that we left one of those datasets out as queries and then that.",
            "Then model training with all the others martich stress profiles and all the other non osmotic stress profiles but in an unsupervised way.",
            "So without using the label information.",
            "And this was done in a cross validation manner.",
            "So it was Martich profile was used as a query.",
            "As target lists, we considered two different sources.",
            "The first one was a list of 10 water stress related genes.",
            "Namely, their transcription factor, dread 2A and nine of its targets.",
            "And then an other list of 41 genes annotated as trouts, or called in their stiff DB database, and those two genius overlapped by for teens.",
            "This slide shows the."
        ],
        [
            "Precision versus recall curves for those two different gene lists.",
            "So precision is on the Y axis and recoil on the X axis and the black line.",
            "Refers to our method.",
            "We can see that in both cases it outperforms simpler similarity measures both when considering.",
            "All the genes for the simpler similarity measures and when performing the same kind of dimension reduction As for our targeted retrieval approach.",
            "So what this means is that this model based similarity measure really helps in that retrieval task."
        ],
        [
            "Then network we get out of there first.",
            "First target in list falls apart into three different subnetworks.",
            "And we.",
            "We checked the significance of those in firt edges by performing 1000 fold Bootstrap experiment and it turned out that top ten edges and is bootstrapping.",
            "So the most significant edges.",
            "They all turned out to be known functional relationships.",
            "The edge at position 11 is not unknown relationship, but what we did is that we went to two independent newer datasets and we could actually confirm that concordant expression pattern between groups.",
            "Sat 12 this gene here and Rep. Drip to a.",
            "So that was very nice.",
            "And this.",
            "Requires more more biological validation experiments."
        ],
        [
            "So this heat map here shows.",
            "Model based scores for all these measurements.",
            "So what we see on the?",
            "On the Y axis, all the different measurements and on the X axis there are the different edges of the network Villa and and what can be clearly seen from here is that.",
            "This middle network around our D29A is strongly activated among osmotic stress conditions.",
            "The."
        ],
        [
            "Final point, I want to make here is that the retrieval performance is even very good if we.",
            "And two is smaller sets of target genes so that the most important gene seems to be this RD29A.",
            "And then name says responsive to dehydration.",
            "So there's clearly biological connection.",
            "But what is important to mention?",
            "He added this gene is not a true biomarker for Smart Express, so you cannot get good retrieval performance by using.",
            "Yes, more simple measures, so I haven't showed the comparison in this plot, but it's it has worse retrieval perform."
        ],
        [
            "So to summarize, I presented at approach for targeted retrieval using regulatory models.",
            "The purpose is to investigate specific commonalities between biological conditions based on infer teen relationships, so we both aim it good retrieval, performance and biological interpretability in terms of network patents.",
            "The approach I presented is computationally very efficient, because actually you can pre even precompute those gene specific models and you have very little work to do it query time.",
            "There are some open questions, so first of all, given their promising performance with this very simple model, what is the most suitable model for this retrieval task?",
            "So of course we could consider prior knowledge on on biological networks or integrating protein, protein and direction data.",
            "As we heard before today.",
            "Then also some supervised options could be considered.",
            "He could look.",
            "We could use the labels of the training data and allow for condition specific.",
            "Network models or then use the labels to do some kind of metric learning.",
            "Something like that.",
            "One one thing that was mentioned many times yesterday is this elastic net approach and that is something very straightforward to do.",
            "We tried it also and it gives more densely connected networks, but we have the same retrieval performance, so about the same.",
            "OK, the second open question is whether this concept true idea of having a model generative model and then model based similarity for that idea is also feasible for applications with heterogeneous data.",
            "For instance, if you have my credit from different platforms, different species, or if we have data from different measurement types and I'm happy to take more questions from you and.",
            "Thank you.",
            "Thank you Elizabeth.",
            "Very nice book.",
            "Are there questions?",
            "Yes, please.",
            "Thank you very much for the nice and very clear talk is the source code for this methodology is available?",
            "Yes, it's available at home page of the group, so I don't have it here, but it's in the paper which is in the proceedings of MSP online and by informatics.",
            "Did you think of you?",
            "As far as I understand, you take the beaters in the estimated independently for every gene, right sided?",
            "Yes, so did you think of?",
            "I don't know doing some group lasso or doing some combination of the estimates?",
            "Yeah, that's that's definitely possible.",
            "One thing what it means is that then you cannot do it is pre computation.",
            "So you have a bit more work it.",
            "Query time so you you compute the model at query time only, but it's definitely possible and.",
            "Just trying, yeah.",
            "And did you think of using the model and checking essentially when you when you have a model and you can predict the gene expression value?",
            "Well, alright, so then it's kind of boring and you could use the model to suggest experiments where you don't predict well.",
            "Or yeah that's right and some noise.",
            "And.",
            "The other way around, also this retrieval approach could help to evaluate how how meaningful those models are, right, right?",
            "Yes.",
            "OK, are there?",
            "Are there more questions?",
            "It's not the case.",
            "So then let's go on to the next speaker and let's think speak again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This talk is about targeted retrieval using regulatory models.",
                    "label": 0
                },
                {
                    "sent": "It is joint work with Jaco Saloya V Mikaboshi, Jaco, Congress Heavy and somewhere Caskey, and I gratefully acknowledge the funding sources.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is this work about?",
                    "label": 0
                },
                {
                    "sent": "Their huge public repository is of molecular measurement data and consumer effort is made to maintain and extend them, and in order to explore this wealth of data, we and other groups are interested in providing methods to do automated search for relevant databases.",
                    "label": 0
                },
                {
                    "sent": "So more precisely, the task we consider is.",
                    "label": 0
                },
                {
                    "sent": "Give him a gene expression measurement as a query.",
                    "label": 0
                },
                {
                    "sent": "Find similar gene expression measurements from a database and if you are not familiar with this red presentation here, so.",
                    "label": 1
                },
                {
                    "sent": "Each column, sorry, each column represents a gene expression measurement, which is a heat map of the expression values across all the genes so that Y direction would be the jeans.",
                    "label": 0
                },
                {
                    "sent": "So the logical next question would be.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What is a suitable similarity measure for the task?",
                    "label": 1
                },
                {
                    "sent": "A state of the art would be to look for shared keywords in the annotation of both gene expression measurements, and that's a very reliable approach, because if two measurements share the same annotation then they are very likely to be relevant to each other, but it totally excludes new findings about which biological conditions are related to each other.",
                    "label": 1
                },
                {
                    "sent": "And then there are also obvious problems that this.",
                    "label": 0
                },
                {
                    "sent": "Measurements and annotation state do not necessarily use the same kind of vocabulary, so we might miss a lot of relevant experiments due to that.",
                    "label": 0
                },
                {
                    "sent": "And therefore data driven approaches have been considered, and the simplest way would be to compute Pearson or Spearman correlation between the gene expression profiles.",
                    "label": 0
                },
                {
                    "sent": "This is easy and straightforward to compute, but it ignores the dependencies between the jeans and also this similarity measure can be disturbed by noisy jeans.",
                    "label": 0
                },
                {
                    "sent": "So what we have is a thought.",
                    "label": 0
                },
                {
                    "sent": "Class of methods are model based approaches.",
                    "label": 0
                },
                {
                    "sent": "And those start by learning a model of biology from the database and then use that model to define similarity measure between between different profiles or experiments and that potentially yields better retrieval results and also more biological insights.",
                    "label": 0
                },
                {
                    "sent": "But it comes at a higher computational cost.",
                    "label": 0
                },
                {
                    "sent": "The approach.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Proposed here is called model based targeted retrieval and it has two main aspects.",
                    "label": 1
                },
                {
                    "sent": "The first one is targeted focus, so the model is guided by a list of genes provided by the user and for example, it could be a set of things that is known to be related to a certain disease, and then we do not try to model everything, but only what is relevant to those genes of interest.",
                    "label": 1
                },
                {
                    "sent": "So that gives the user more control.",
                    "label": 0
                },
                {
                    "sent": "And also it reduces the overall computational effort, so we can build details models to explain the behavior of those genes.",
                    "label": 1
                },
                {
                    "sent": "And the model we are interested here are gene regulatory network models.",
                    "label": 0
                },
                {
                    "sent": "So their aim is to.",
                    "label": 0
                },
                {
                    "sent": "To describe the similarity between biological conditions and terms of.",
                    "label": 0
                },
                {
                    "sent": "Activation patents, in their biological networks, so why did we get an improved interpretability of the retrieval result?",
                    "label": 0
                },
                {
                    "sent": "So and then not show.",
                    "label": 0
                },
                {
                    "sent": "Our system for targeted retrieval works as follows.",
                    "label": 0
                },
                {
                    "sent": "So in the first step.",
                    "label": 0
                },
                {
                    "sent": "Irregular pops.",
                    "label": 0
                },
                {
                    "sent": "In the first step, a regulatory model is learned for the.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Genes provided by the user.",
                    "label": 0
                },
                {
                    "sent": "Based on all the measurements in their data compendium and then the second step that.",
                    "label": 0
                },
                {
                    "sent": "Model is used to define to do the retrieval.",
                    "label": 0
                },
                {
                    "sent": "And here the user provides a certain.",
                    "label": 0
                },
                {
                    "sent": "Query measurement of of interest and then she receives a list.",
                    "label": 1
                },
                {
                    "sent": "Of all the earlier measurements in the data compendium in ranked order according to that similarity measure defined based on the model.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The target gene expression model we use is a conditional model for the expression of the target genes.",
                    "label": 1
                },
                {
                    "sent": "Given the expression of all the other jeans, and for simplicity we use, here is so so called pseudo likelihood approach, where we have an independent model for each target gene.",
                    "label": 0
                },
                {
                    "sent": "Based on the expression values of all the other teens and then the overall pseudo likelihood is just on obtained by multiplication.",
                    "label": 0
                },
                {
                    "sent": "For the gene specific models, we assume Gaussian linear regression models, where the.",
                    "label": 0
                },
                {
                    "sent": "Expression of the.",
                    "label": 0
                },
                {
                    "sent": "And Target gene is modeled as a linear combination of the expression of the oil.",
                    "label": 0
                },
                {
                    "sent": "The other genes plus some Gaussian noise and.",
                    "label": 0
                },
                {
                    "sent": "We obtain sparse estimates for this weight coefficient vectors Peter by using a one norm regularization order.",
                    "label": 0
                },
                {
                    "sent": "The usual lasso regression.",
                    "label": 0
                },
                {
                    "sent": "By that we obtained for each target in a set of neighbors that have none.",
                    "label": 0
                },
                {
                    "sent": "Non zero coefficients here.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is all very standard.",
                    "label": 0
                },
                {
                    "sent": "So what we obtain is then a set of local dependency networks.",
                    "label": 0
                },
                {
                    "sent": "The point I want to make here is that we use this model.",
                    "label": 0
                },
                {
                    "sent": "To define a similarity measure between gene expression experiments and how do we do this year?",
                    "label": 0
                },
                {
                    "sent": "So we.",
                    "label": 0
                },
                {
                    "sent": "We represent each data point with respect to the model.",
                    "label": 0
                },
                {
                    "sent": "For that we use the Fisher score, which is formally defined as the gradient.",
                    "label": 0
                },
                {
                    "sent": "After lock likelihood for that data point.",
                    "label": 0
                },
                {
                    "sent": "At the learn values of the model parameters, so it's still like it's the like.",
                    "label": 0
                },
                {
                    "sent": "Sorry it's a gradient with respect to their model parameters.",
                    "label": 0
                },
                {
                    "sent": "And of course it assumes that we have a smooth parametrization of the model.",
                    "label": 0
                },
                {
                    "sent": "So intuitively what this gradient is it is, it can be understood as the direction in which we need to update the parameters of the model.",
                    "label": 1
                },
                {
                    "sent": "After adding that data point to the training data set.",
                    "label": 0
                },
                {
                    "sent": "So the learned models of the.",
                    "label": 0
                },
                {
                    "sent": "They learn values of the model parameters.",
                    "label": 0
                },
                {
                    "sent": "The summary of the training data set and then the updated values of the parameters can be seen.",
                    "label": 0
                },
                {
                    "sent": "As a summary of the extended data set the so the training data set plus this.",
                    "label": 0
                },
                {
                    "sent": "GNU data point in your example.",
                    "label": 0
                },
                {
                    "sent": "So now too.",
                    "label": 0
                },
                {
                    "sent": "In order to compare two data points.",
                    "label": 0
                },
                {
                    "sent": "The inner product of the data points in this new future score representation is a suitable similarity measure that can be interpreted.",
                    "label": 0
                },
                {
                    "sent": "Now along these lines, as the similarity of the.",
                    "label": 0
                },
                {
                    "sent": "2 extended datasets either extending by the first point or by the second point, and we.",
                    "label": 0
                },
                {
                    "sent": "We take the similarity based on the model based summary statistics.",
                    "label": 0
                },
                {
                    "sent": "This is called the symbol Fisher kernel, and it's a common approximation to the Fisher kernel, which has a rigorous connection to information to metry and.",
                    "label": 0
                },
                {
                    "sent": "Fisher Kernel has originally been introduced to use hidden Markov models, so generative models and discriminative classifiers.",
                    "label": 0
                },
                {
                    "sent": "And here we use it to do this retrieval and unsupervised way.",
                    "label": 0
                },
                {
                    "sent": "The parameters of biological interest in our model as simply the coefficients of the neighbors of each target gene.",
                    "label": 1
                },
                {
                    "sent": "As an example application, I will present the case study.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "An automatic stress in plants as Matic stress relates to the dehydration of plants and their conditions like draught, high salt or cold, and it's one of the most important abiotic stresses for crop productivity.",
                    "label": 1
                },
                {
                    "sent": "M The cellular response to those stresses is that first.",
                    "label": 0
                },
                {
                    "sent": "Her mentor, second messengers, are triggered, then some signaling pathways are activated and then we have some cellular response in the gene expression and so on.",
                    "label": 0
                },
                {
                    "sent": "And without going into details here, I just want to make the point that is 3 stresses drought soil Dan called they have.",
                    "label": 0
                },
                {
                    "sent": "Some shared response but also some some specific cellular RESP.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ants.",
                    "label": 0
                },
                {
                    "sent": "Is data we talk 141 differential expression profiles?",
                    "label": 1
                },
                {
                    "sent": "From 38 microarray datasets.",
                    "label": 0
                },
                {
                    "sent": "Related to stress in Arabidopsis thaliana and we looked at about 6600 differentially expressed genes.",
                    "label": 1
                },
                {
                    "sent": "As benchmark task we considered the retrieval of automatic stress experiments, so these were 31 profiles.",
                    "label": 0
                },
                {
                    "sent": "Among these 141 and they came from 5 datasets in total.",
                    "label": 0
                },
                {
                    "sent": "The experimental setup we used was that we left one of those datasets out as queries and then that.",
                    "label": 0
                },
                {
                    "sent": "Then model training with all the others martich stress profiles and all the other non osmotic stress profiles but in an unsupervised way.",
                    "label": 1
                },
                {
                    "sent": "So without using the label information.",
                    "label": 0
                },
                {
                    "sent": "And this was done in a cross validation manner.",
                    "label": 0
                },
                {
                    "sent": "So it was Martich profile was used as a query.",
                    "label": 1
                },
                {
                    "sent": "As target lists, we considered two different sources.",
                    "label": 0
                },
                {
                    "sent": "The first one was a list of 10 water stress related genes.",
                    "label": 0
                },
                {
                    "sent": "Namely, their transcription factor, dread 2A and nine of its targets.",
                    "label": 0
                },
                {
                    "sent": "And then an other list of 41 genes annotated as trouts, or called in their stiff DB database, and those two genius overlapped by for teens.",
                    "label": 0
                },
                {
                    "sent": "This slide shows the.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Precision versus recall curves for those two different gene lists.",
                    "label": 0
                },
                {
                    "sent": "So precision is on the Y axis and recoil on the X axis and the black line.",
                    "label": 0
                },
                {
                    "sent": "Refers to our method.",
                    "label": 0
                },
                {
                    "sent": "We can see that in both cases it outperforms simpler similarity measures both when considering.",
                    "label": 0
                },
                {
                    "sent": "All the genes for the simpler similarity measures and when performing the same kind of dimension reduction As for our targeted retrieval approach.",
                    "label": 0
                },
                {
                    "sent": "So what this means is that this model based similarity measure really helps in that retrieval task.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then network we get out of there first.",
                    "label": 0
                },
                {
                    "sent": "First target in list falls apart into three different subnetworks.",
                    "label": 0
                },
                {
                    "sent": "And we.",
                    "label": 0
                },
                {
                    "sent": "We checked the significance of those in firt edges by performing 1000 fold Bootstrap experiment and it turned out that top ten edges and is bootstrapping.",
                    "label": 0
                },
                {
                    "sent": "So the most significant edges.",
                    "label": 0
                },
                {
                    "sent": "They all turned out to be known functional relationships.",
                    "label": 0
                },
                {
                    "sent": "The edge at position 11 is not unknown relationship, but what we did is that we went to two independent newer datasets and we could actually confirm that concordant expression pattern between groups.",
                    "label": 0
                },
                {
                    "sent": "Sat 12 this gene here and Rep. Drip to a.",
                    "label": 0
                },
                {
                    "sent": "So that was very nice.",
                    "label": 0
                },
                {
                    "sent": "And this.",
                    "label": 0
                },
                {
                    "sent": "Requires more more biological validation experiments.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this heat map here shows.",
                    "label": 0
                },
                {
                    "sent": "Model based scores for all these measurements.",
                    "label": 0
                },
                {
                    "sent": "So what we see on the?",
                    "label": 0
                },
                {
                    "sent": "On the Y axis, all the different measurements and on the X axis there are the different edges of the network Villa and and what can be clearly seen from here is that.",
                    "label": 0
                },
                {
                    "sent": "This middle network around our D29A is strongly activated among osmotic stress conditions.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Final point, I want to make here is that the retrieval performance is even very good if we.",
                    "label": 0
                },
                {
                    "sent": "And two is smaller sets of target genes so that the most important gene seems to be this RD29A.",
                    "label": 1
                },
                {
                    "sent": "And then name says responsive to dehydration.",
                    "label": 1
                },
                {
                    "sent": "So there's clearly biological connection.",
                    "label": 0
                },
                {
                    "sent": "But what is important to mention?",
                    "label": 0
                },
                {
                    "sent": "He added this gene is not a true biomarker for Smart Express, so you cannot get good retrieval performance by using.",
                    "label": 0
                },
                {
                    "sent": "Yes, more simple measures, so I haven't showed the comparison in this plot, but it's it has worse retrieval perform.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to summarize, I presented at approach for targeted retrieval using regulatory models.",
                    "label": 1
                },
                {
                    "sent": "The purpose is to investigate specific commonalities between biological conditions based on infer teen relationships, so we both aim it good retrieval, performance and biological interpretability in terms of network patents.",
                    "label": 1
                },
                {
                    "sent": "The approach I presented is computationally very efficient, because actually you can pre even precompute those gene specific models and you have very little work to do it query time.",
                    "label": 0
                },
                {
                    "sent": "There are some open questions, so first of all, given their promising performance with this very simple model, what is the most suitable model for this retrieval task?",
                    "label": 1
                },
                {
                    "sent": "So of course we could consider prior knowledge on on biological networks or integrating protein, protein and direction data.",
                    "label": 0
                },
                {
                    "sent": "As we heard before today.",
                    "label": 0
                },
                {
                    "sent": "Then also some supervised options could be considered.",
                    "label": 0
                },
                {
                    "sent": "He could look.",
                    "label": 0
                },
                {
                    "sent": "We could use the labels of the training data and allow for condition specific.",
                    "label": 0
                },
                {
                    "sent": "Network models or then use the labels to do some kind of metric learning.",
                    "label": 0
                },
                {
                    "sent": "Something like that.",
                    "label": 1
                },
                {
                    "sent": "One one thing that was mentioned many times yesterday is this elastic net approach and that is something very straightforward to do.",
                    "label": 0
                },
                {
                    "sent": "We tried it also and it gives more densely connected networks, but we have the same retrieval performance, so about the same.",
                    "label": 0
                },
                {
                    "sent": "OK, the second open question is whether this concept true idea of having a model generative model and then model based similarity for that idea is also feasible for applications with heterogeneous data.",
                    "label": 0
                },
                {
                    "sent": "For instance, if you have my credit from different platforms, different species, or if we have data from different measurement types and I'm happy to take more questions from you and.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you Elizabeth.",
                    "label": 0
                },
                {
                    "sent": "Very nice book.",
                    "label": 0
                },
                {
                    "sent": "Are there questions?",
                    "label": 0
                },
                {
                    "sent": "Yes, please.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much for the nice and very clear talk is the source code for this methodology is available?",
                    "label": 0
                },
                {
                    "sent": "Yes, it's available at home page of the group, so I don't have it here, but it's in the paper which is in the proceedings of MSP online and by informatics.",
                    "label": 0
                },
                {
                    "sent": "Did you think of you?",
                    "label": 0
                },
                {
                    "sent": "As far as I understand, you take the beaters in the estimated independently for every gene, right sided?",
                    "label": 0
                },
                {
                    "sent": "Yes, so did you think of?",
                    "label": 0
                },
                {
                    "sent": "I don't know doing some group lasso or doing some combination of the estimates?",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's that's definitely possible.",
                    "label": 0
                },
                {
                    "sent": "One thing what it means is that then you cannot do it is pre computation.",
                    "label": 0
                },
                {
                    "sent": "So you have a bit more work it.",
                    "label": 0
                },
                {
                    "sent": "Query time so you you compute the model at query time only, but it's definitely possible and.",
                    "label": 0
                },
                {
                    "sent": "Just trying, yeah.",
                    "label": 0
                },
                {
                    "sent": "And did you think of using the model and checking essentially when you when you have a model and you can predict the gene expression value?",
                    "label": 0
                },
                {
                    "sent": "Well, alright, so then it's kind of boring and you could use the model to suggest experiments where you don't predict well.",
                    "label": 0
                },
                {
                    "sent": "Or yeah that's right and some noise.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "The other way around, also this retrieval approach could help to evaluate how how meaningful those models are, right, right?",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "OK, are there?",
                    "label": 0
                },
                {
                    "sent": "Are there more questions?",
                    "label": 0
                },
                {
                    "sent": "It's not the case.",
                    "label": 0
                },
                {
                    "sent": "So then let's go on to the next speaker and let's think speak again.",
                    "label": 0
                }
            ]
        }
    }
}