{
    "id": "anpglcwnfp7jgknvigli4cm353pdmwus",
    "title": "Ion-doped transition metal dichalcogenide transistors",
    "info": {
        "author": [
            "Alan C. Seabaugh, Department of Electrical Engineering, University of Notre Dame"
        ],
        "published": "May 24, 2015",
        "recorded": "May 2015",
        "category": [
            "Top->Physics"
        ]
    },
    "url": "http://videolectures.net/kolokviji_seabaugh_dichalcogenide_transistors/",
    "segmentation": [
        [
            "It's my big pleasure to introduce you, Professor Alan Seabaugh, who is visiting our Institute in a frame of international project between US and Slovenia.",
            "He has kindly agreed to speak to us on the subject of iron dope transistor method teacher covenant transistors.",
            "Tennessee Board is a professor of electrical engineering at the University of Notre Dame in Indiana and director of the Semiconductor Technology Advanced Research Network, which is part of the Semiconductor Research Corporation.",
            "This network combines the most important research centers in the field, working on finding paths around the fundamental physical limits that threaten the long term growth of the microelectronics industry.",
            "He's also technical director of the Center of Low Energy Systems Technology.",
            "Professor Sebo received the PhD degree in electrical engineering from the University of Virginia in 1985 before joining the University of Notre Dame 16 years ago.",
            "He had research positions at the National Bureau of Standards at Texas Instruments and in company Raytheon.",
            "He has authored or coauthored more than 300 papers and given 90 inviting invited presentations at conferences and workshops.",
            "His huge indexes 34.",
            "He has 23 US patents and 10 foreign patents and works in a close collaboration with imported industrial partners.",
            "He's an editor for the IE Transactions on Electron Devices.",
            "Among many awards he has received, I would like to mention only award from 2011 at the International Symposium on Compound Semiconductors Quantum Devices given for Seminole contributions and leadership in semiconductor devices and circuits based on quantum mechanical tunneling.",
            "His current research.",
            "Interests include tunneling transistors in circuits high and transport memory devices, 2 dimensional materials and energy extraction.",
            "So Professor Anansi board the floor is yours?",
            "OK?",
            "Thank you very much.",
            "It's my pleasure to be here and I'd like to say that that.",
            "There's an introduction that Maya didn't give that she doesn't even know about a background of mine."
        ],
        [
            "And that is that.",
            "If you look at the lineages of my PhD advisors.",
            "You see that it ends or begins early with Joseph Stephen.",
            "So my friend, my PhD advisor, great great advisor.",
            "Was Joseph Steven.",
            "This is a program that one of our physics professors has devoted his device so that if you know your PhD advisor, which you do, then you can track him back to see if anybody connects famous and typically everyone connects to someone famous 'cause only the very famous people were in the universities.",
            "In the olden days."
        ],
        [
            "Some of you don't know where Notre Dame is, so I'd like to put it on the map.",
            "We're in the we call it the Midwest of the United States, but you can see it's really Middle East we."
        ],
        [
            "Formed in Notre Dame, formed around 1841 and there may be some things that you don't know about.",
            "It will just give you some numbers.",
            "It's.",
            "8000 students about 3000 graduate students, so total, about 11,000.",
            "It's more the size of a Harvard or Princeton or Rice University.",
            "Private University Catholic University.",
            "It was the site of the first wireless transmission in North America.",
            "Marconi did it in Europe and the first wireless transmission was that the electrical engineering Department at Notre Dame and here shows 1873 for that.",
            "Some of you may have heard of technology called Quantum Dot Cellular Automata that is also a concept originated at Notre Dame.",
            "And we think more concepts will be coming out of this."
        ],
        [
            "Place.",
            "There's been a very big investment by the University in building up the infrastructure at Notre Dame.",
            "So about 100 million dollars has been invested to build a new engineering building and to equip a state of the art clean room.",
            "And so we were very privileged to have this great facility to work work in here."
        ],
        [
            "We have also been able to be leaders on several important national projects.",
            "This one was announced in 2013.",
            "It's sponsored by DARPA and the semiconductor industry and looks out to provide some guidance for how the semiconductor industry should.",
            "Position itself in future years as we've reached the limits of scaling of conventional transistor technology.",
            "So this was a 200 roughly 200 million dollar 10 year investment."
        ],
        [
            "Invest in six 6 centers nationally.",
            "Each one of these centers has some 25 to 30 faculty and about 100 students, so it's about $6,000,000 per Center for these five year for a 5 year increment.",
            "You can see on the right that the companies that are behind this investment are Applied Materials and GLOBALFOUNDRIES, IBM, Intel, Micron, Raytheon, Texas Instruments, and United Technologies.",
            "So these all contribute with the Defense Department to try to.",
            "Promote the collaborative, collaborative research between universities to solve important problems, and I'll tell you about the center that I presently."
        ],
        [
            "Direct.",
            "It just just to say that it has.",
            "27 This is about 100 students and postdocs in the center.",
            "That's eleven universities, and it's about 27 faculty.",
            "So now I come to the talk.",
            "I'd like to tell you a little bit about my interest in materials and research, and maybe you heard in electrical engineering, maybe.",
            "I understand that most of you are more of you are in physics, but you also have mechanical engineering.",
            "Another set.",
            "An electrical, of course.",
            "I just met, so an electrical engineering.",
            "And I'd like to tell you a little bit about the limits of what limits are happening now in transistors and how these how some of these new transistors that we think can outperform conventional transistors operate like to tell you about the transition metal type chalcogenides transistors.",
            "Why we care about them?",
            "What motivates our selection of the ones to study?",
            "And I'll tell you, that's a new technology for doping these, and then I'd like to talk to you briefly about future directions."
        ],
        [
            "I'd like to make this a kind of introductory talk, so I hope that I can solicit your contributions to this work, because I think all the answers for the directions for future device research in transistors are not fully mapped out yet.",
            "So first I'd like to just remind you about something you may may have noticed, or you may not have noticed in your laptops around 2004.",
            "The Clock speed ended.",
            "We did.",
            "We were no longer increasing Clock speed.",
            "And this becomes comes about for variety of factors.",
            "But the laptop I have here still is about 3 GHz Clock rate, and that's what the same same as it was in 2004.",
            "However, if you think about the computer you had in 2004, it does nothing like what your computer today does.",
            "So why is this?",
            "Why are we continuing to increase the performance?"
        ],
        [
            "This.",
            "Very nice, maybe a complicated plot, but a very nice plot showing you some of the technology trends.",
            "We can see.",
            "First of all that we have something called Moores Law which has been proceeding for the last more than 40 years, 50 years now.",
            "The density of transistors, which is the green curve, has been increasing at about a rate of every doubling in the density of transistors on a chip every 18 months.",
            "That's this line down here.",
            "This is called Moores Law by Gordon.",
            "By the person Gordon Moore from Intel who first noticed this trend and you can see that even as we project out beyond year 2000.",
            "That this law is even going faster.",
            "The companies have been able to go faster than increasing this density per year and even today it's still not saturated yet.",
            "However, the sizes of transistors are getting so small that we know it can't continue forever.",
            "The reason we were able to get more transistors per chip as we make them smaller and smaller and smaller.",
            "But eventually now with gate links approaching 15 nanometers, 13 nanometers, it's almost running out of space in terms of countable numbers of atoms that can.",
            "Define the gate.",
            "So what you see here is that the Moores law is increasing.",
            "You see the Clock speed here saturated about 2004 you see that.",
            "You see, is something else happening about the same time, and this is the reason for the Clock speed.",
            "Saturation is that the power was going up on the chip.",
            "As you keep increasing the number of transistors and is the density goes up, we finally get to a point where we can't remove enough of the heat generated by the transistors to pack any more transistors on them.",
            "So you wonder how can we keep packing more transistors on here and not when we're up to this limit in chip power.",
            "This 100 Watt per centimeter squared is the limit.",
            "That you can.",
            "You can remove heat from the chip without any active cooling.",
            "In a laptop we don't have any refrigerator or any fan, so we're limited in about at about 100 Watts per centimeters squared for the chip.",
            "But still people have been able to get designers have still wanted more transistors.",
            "And how does this happen without more heat being generated and the reason the way this has happened is because primarily innovations in architecture.",
            "At the circuit level, not at the device level, and what people are doing is paralyzing the microprocessors instead of having one microprocessor on the chip, you might have four 816 is called multicore.",
            "Other things people do is they do something called dynamic voltage frequency scaling, that is, they dial the voltage down in the transistors when they don't need the speed.",
            "When you turn the voltage down, you lose speed.",
            "Turn the voltage back up, you get high speed, but so they'll put control circuits that dynamically change these things so you don't waste any power.",
            "You don't work faster than you have to.",
            "And there's a.",
            "There's something else called dark Silicon.",
            "Which is probably coming after dark energy.",
            "But dark Silicon means that you just turn off whole sections of the chip when you're not using them, they just power power them all the way off.",
            "So if there are very interesting infrared images of the microprocessors where you can see these these regions of the transistor of the microprocessor chip turning on and off, so parallelism has been the way that we're increasing performance.",
            "But of course these kinds of tricks you run out of these kinds of tricks overtime, so this is going to saturate too.",
            "So what we really need is A is a way to make the technology better, allowing us to.",
            "Generate less heat as heat generated on the chip means waste of energy so.",
            "The main way we remain up mechanism we have may nob we have to turn is this.",
            "This is power dissipated on a chip.",
            "It's related to the current and the power supply voltage.",
            "So this is the steady DC current that has to flow for the transistors to operate.",
            "And then there's another term that's corresponding to the dynamic charging and discharging of capacitance on the chip.",
            "So we have static power.",
            "We say we have dynamic power.",
            "You see, they both depend on voltage.",
            "So if we could figure out a way to lower the voltage on the device by changing the switching.",
            "Mechanism for the current control mechanism.",
            "Then we have a new tech new basis for technology, and that's what I'd like to tell you about today.",
            "There are these mechanism."
        ],
        [
            "For this.",
            "Now I'd like to say something about the fundamental limits for a transistor.",
            "How what sets the minimum voltage that the transistor can operate, and you can see here something we have in the semiconductor industry.",
            "Is this something called an international technology road map for semiconductors?",
            "It tells us that in order to keep scaling the device getting more density every 18 months, then we must do something.",
            "And in the conventional semiconductor technology, they also consider let's lower the voltage down as far as we can lower it that down without losing performance.",
            "But this is a big problem.",
            "In there is a fundamental limit that you get to here.",
            "This is the projection you hi, this is high performance transistors, low operating power transistors and around here we say that there's a limit of about 400 millivolts.",
            "We won't go below that.",
            "And why is that?",
            "And this goes, this is 'cause there's a fundamental.",
            "Voltage."
        ],
        [
            "That we have to, well, there's a fundamental voltage that we have per decade of current that.",
            "Be described by this diagram.",
            "I'll show you this.",
            "This is a. PN Junction maybe was a start here.",
            "This PN junction has the property.",
            "Maybe you remember that it's a diode.",
            "It has the property that the current can turn on in One Direction.",
            "Exponentially and turns off in the other, and Shockley showed us that this this relationship goes something like this E to the QV on Katie, where this is Boltzmann's constant absolute temperature and then the applied voltage.",
            "So you look at here and you look at this IV characteristic.",
            "You see that.",
            "In order to increase the current by a factor of 10, there's a voltage dependence that depends on this Katie Q factor.",
            "It turns out to be Katie on Q log 10 and that turns out to be 60 millivolts.",
            "And if you look at what happens in energy space for the PN junction, you see the end type material, the P type material, you see this barrier between it.",
            "And if I lower the barrier by 60 millivolts, that's what this does.",
            "When you apply this voltage, I lower the barrier by 5060 millivolts.",
            "Then I increase the current by a factor of 10 across here.",
            "So this is this basic way we control current in Diode says we just lower the barrier a little bit and then the current flows over the top and equilibrium.",
            "This at this energy there's some sort of equilibrium going on at this other current level.",
            "So this is barrier lowering we say is the basic mechanism by which we can change current.",
            "So if I want to change current by 4 orders of magnitude, I had to apply 240 millivolts.",
            "So this is if you're thinking about a switch.",
            "This isn't necessarily so good.",
            "It's been great up till now, but if you think about it light switch.",
            "I just flip the switch and turn on.",
            "It goes from some position to connect it and it's just an abrupt change.",
            "But when we have to control the.",
            "The current electrically we have this limit of 60 millivolts per decade in the diode and this term."
        ],
        [
            "Got to be the same mechanism that happens in transistors.",
            "In the bipolar transistor we have an NPN structure and what we do and we bias the base, change the voltage on the basis that we lower the barrier between the end and the P, and then we inject carriers across.",
            "At best that can also only be as good as 60 millivolts to get a factor of 10 changing current.",
            "And in the metal oxide semiconductor field effect transistor, the modern transistor we also.",
            "Put a voltage on a gate and we also move up and down a surface potential and the best we can do is a barrier lowering device.",
            "We're just lowering the barrier down.",
            "We're getting injection from source into the channel and collection at the drain.",
            "This is also a barrier lowering device.",
            "It sets the physics that sets the how that one that transistor works and in the transistor we call this 60 millivolts per decade.",
            "The subthreshold swing 'cause this was what determines how fast the transistor turns on.",
            "Below something we call the threshold voltage, which defines the turn on point for the transistor.",
            "So the point here is the barrier lowering is that is the basic mechanism here and the transistors are all limited to this.",
            "So if I trying to lower voltage in modern transistor, at best I can do 240 and we never do quite that well, so it's starting to set the limits of how small the total voltage across the device can be.",
            "We can't go lower than that.",
            "So here I'm giving you a kind of definition for this most important parameter for.",
            "For transistors, is called subthreshold swing, and it's the subthreshold swing that we need to try to optimize."
        ],
        [
            "Now that mechanism is the basis for pretty much for much of modern technology.",
            "That's bipolar transistors.",
            "That's field.",
            "The field effect transistors of all varieties.",
            "That's diodes.",
            "That's lasers.",
            "Everything is a barrier.",
            "Lowering devices we've been since the 1940s.",
            "If the discovery of these mechanisms, that's what we've been doing is optimizing transistors for using this parameter, giving them either more current or more power or lower?",
            "Lower power we optimize on this particular parameter, but it's not the only mechanism, it's just the mechanism.",
            "We've only we've been thinking about so far, and so I show you here an example of a recently discovered transistor mechanism called the tunnel FET, which can be much less than 60 millivolt per decade subthreshold swings.",
            "We look at how this one works instead of going, this is the cross section of a MOSFET if you're.",
            "For those who would be familiar with it, typically a MOSFET would have a PNP kind of a structure.",
            "We have an oxide and a gate.",
            "This is the side view.",
            "We put a positive voltage.",
            "On the gate and induce in this particular, we put a negative voltage in the gate.",
            "We induce holes here and we would get a. Conduction, that's all.",
            "The switch would work, but in this particular case this is.",
            "I'm showing it for the tunnel Fet.",
            "It's PNN.",
            "This is the band diagram you see.",
            "PU CN Region UCP and I'm showing it under some bias between source and rain.",
            "And in this particular configuration with no gate voltage on it, how does the how do the electrons get from source to drain?",
            "The electrons have to go over a very big barrier, so the thermionic current is very low.",
            "They only can go from directly across if they quantum mechanically tunnel across this base.",
            "This channel channel region and this is very much restricted by the size 'cause these distances maybe more than 20 nanometers and then.",
            "However, if I put a positive bias on this.",
            "Induce electrons in this.",
            "Channel Region I open up a region between the valence band and the conduction band where I can get current to flow.",
            "This is current by quantum mechanical tunneling from the source into the channel, and then we collect it out the drain.",
            "So this is this is the new mechanism for current control.",
            "I no longer have whole distribution of electrons that I'm letting across the Boltzmann tail of the electron distribution which has the 60 millivolt per decade behavior.",
            "I have a.",
            "Something some small energy window now that I only let current electrons in that small energy window tunnel across.",
            "So this one has a different kind of physical relation for what this looks like.",
            "It's not obvious that this is less than 60 millivolt per decade, but when you put numbers in here, you find out it is so tunneling is 1 mechanism whereby we can get this less than 60 millivolt per decade.",
            "When this was first observed around 2004, there was much speculation that there would.",
            "We would never be able to get enough current through this kind of a junction to get it to be competitive to have a certain.",
            "Current to make a high performance device.",
            "'cause in a circuit we must supply current to charge up a capacitance in the circuit and it has to reach the speed with which it a capacitor charges.",
            "Depending on how much charge per second comes in.",
            "So in order to make a fast.",
            "High performance transistor like what you need in a microprocessor.",
            "You need high current.",
            "This was the main concern in the early days of this transistor.",
            "As to whether this was even possible."
        ],
        [
            "Now I want to show you here if something is quite complicated, but it's quite it shows you about the what people are predicting for the performance of these transistors, and so I'd like to first of all realize that if I just look at this quadrant.",
            "What this is showing is the characteristics of a transistor switch.",
            "This is current on this action axis.",
            "It's normalized by the width of the transistor just to make the comparisons easy to associate with size, but so it's current per unit width of the transistor and we see current here and then the voltage.",
            "So if you make a switch, I'd like to apply some voltage and then I would like the current to turn on.",
            "But I told you that a conventional transistor, which is the one here in the dashed line.",
            "Turns on at only 60 millivolt per decade at best, and here's the 60 millivolt per decade line.",
            "So this turns out to be the.",
            "Company TSMC's High Performance 16 nanometer FinFET and you see it for a couple of different bias conditions at .75 Volt bias or .05 Volt bias and you see it turning on an.",
            "It takes more than half a Volt till it gets to be a high current.",
            "And this is what this is the thing to beat.",
            "If you want to make a more energy efficient transistor, what you would like to have is that transistor turning on like what these are doing.",
            "It takes very little voltage for, say that transistor.",
            "To go from off to high on.",
            "So what this is is a collection of predictions from the literature from different groups about what the tunnel fet's can do, and you see the shown in wide variety of materials, and there's very much there's very much not a consensus about what the material should be, although you can see things like, unfortunately, things like Silicon.",
            "This is a Silicon nanowire does not provide enough current to be anywhere near competitive with a regular Silicon transistor.",
            "In order to get these kinds of currents, you have to move to other systems, primarily 35 compound semiconductors, carbon nanotubes, and also we learn.",
            "We've been learning the transition metal dye chalcogenides can get us up into this.",
            "The 2D materials can get us up into this range.",
            "So this is this one side is showing you the what we call the N channel transistor and you can make a complementary version of this and make a P channel transistor.",
            "So there are two kinds of switches here and these are the predictions, so it's these ones here that are really quite fantastic.",
            "And this is really what's motivating industry.",
            "Interested in sponsoring center research like what I'm going to describe today is that if we can realize these kinds of things, this provides them a path forward for making a.",
            "A really energy efficient technology."
        ],
        [
            "So now I'd like to talk to you a little bit about the physics of these kinds of structures.",
            "What happens in this device?",
            "I show you just the.",
            "The source and the channel side of the device to see what happens what, what goes into a device design on this kind of thing you can take.",
            "We know what the analytic behavior of that tunnel current is.",
            "We can.",
            "Calculate the subthreshold swings an analytically from.",
            "This is just the derivative of the log of the current divided proper gate source voltage and it turns out to give you a couple of terms and these terms terms turn out to show the.",
            "Easy to show in terms of their behavior.",
            "We have this first term which basically adjusts the tunneling window if you would.",
            "Of.",
            "Make it so that the gate voltage really controls this with unity.",
            "With perfect dependence, you just see that this is just opening up and closing this tunneling window.",
            "The second thing that this relation shows you that is if you can increase the electric field in the channel, then you also increase the tunneling window to increase the tunneling.",
            "Current.",
            "Thinner barrier means more quantum mechanical tunneling."
        ],
        [
            "Here shows I mentioned that there isn't a consensus on what materials to use, but here with this kind of basic behavior, this basic relationship for the tunneling current.",
            "We can speculate on which current which materials can be give us the best performance for these devices, and so I show you this relationship here you see that the coefficients in this.",
            "In the transistor, current depend on energy, bandgap and effective mass.",
            "So these are the things that we really want to adjust and then your bias then also affects the electric field which you see showing up in this these relationships."
        ],
        [
            "So we look.",
            "We can look at what materials you might expect to be to work.",
            "Well, that's why I show you here the current versus the electric field, which I just showed you at the very end of that.",
            "You see that Silicon, germanium, Indium gallium arsenide are not so good, but as you move higher and higher, move to narrower and narrower band gaps, you get more and more current out of these devices.",
            "And this is what motivated the original choices for what channel materials to look at."
        ],
        [
            "Over the last well between 2009 two 1000 2011 2013 our group, an Penn State, developed transistors a couple of different geometry's that showed that these kinds of transistors can meet currents that are comparable to what you can get out of a MOSFET at low currents these are tunnel currents that are as high as what a MOSFET can do at low voltages so.",
            "Here is showing versus year these high on current on tunnel currents in Indium gallium arsenide materials in heterojunction materials, and.",
            "In what we call Broken gap heterojunction materials, these are materials where the heterojunction.",
            "Is such that the.",
            "Electrons can tunnel from valence band conduction band without any intrinsic depletion barrier."
        ],
        [
            "Also we have entering the scene in around 2010 or so.",
            "Intel also started looking carefully at this particular transistor technology and put out a number of papers that.",
            "Pointed out the.",
            "The fact that these transistors can outperform technology as they project, showing that these this particular paper from VLSI Symposium Symposium, very large scale integration Symposium of 2011, we see Intel projection that effects can be 8X faster at the same power than a MOSFET, and we worry very much about variation and they study the possibility.",
            "Variation dependence of these kinds of transistors T Fets against MOSFET and find no real significant problems there."
        ],
        [
            "Also, Intel and others in this semiconductor technology network that we have have been benchmarking these technologies against modern transistors, and one thing we used one way.",
            "We used to benchmark various competing technologies that people are looking at for transistors is to look at energy versus delay and you'd really like to have you really like to be in this corner of the optimization.",
            "You're like that.",
            "Like this, switching energy for the device to be as low as possible.",
            "You'd like this delay or the speed of the device to be.",
            "The shortest possible.",
            "And this is showing these green curves.",
            "These green dots show what projections are for a regular transistor at.",
            "Point regular transistor at 15 nanometer gate lengths and this is showing all these other technologies benchmarked at the same size and you can see these.",
            "Tunnel Fet's T Fets are the are the most promising of all the devices at this moment for providing a very low voltage switch."
        ],
        [
            "Now I'd like to say a little bit about transition metal Dia chalcogenides why?"
        ],
        [
            "Why?",
            "Why is there interest in these materials and what materials would we use if we work in this area?",
            "So again, I start to make we start to put together projections.",
            "This is prediction from Debbie Jenna's group showing current density through these things, sheet currents through atomically thin transition metal die chachaji nights as a function of electric field.",
            "In this electric field is electric field in a PN junction formed in these materials, which will be the tunnel junction used in the tunnel Fet.",
            "So we're looking for here is which materials will provide enough current.",
            "This is the same as the one I was showing you before, but it was for bulk materials.",
            "This is which materials will provide enough current to provide a high performance which so this.",
            "Dashed line is what you really have to get to in order to be of interest to the semiconductor community.",
            "And if you look at things like Molly disulfide, tungsten selenide and these others down here you see that we really don't have a material.",
            "Most of the materials that people are working on are not in the right, do not provide the right kinds of materials parameters to get us up there, but it just says that things like tungsten ditelluride, which is a material that has yet to be synthesized in a. Semiconducting form is the kind of material you want.",
            "It has a band gap somewhere around one electron Volt, and it can get you up into these ranges of interests.",
            "Also, other materials that you can put on here, and even more than these.",
            "But these are also look really good, but they have very low band gaps and so it's very hard to imagine how these could turn the current off, so these are not in the space which you really need, so it's really up in here where you'd like to be.",
            "However, you'll see that the research I'm going to show you right now is based on materials we now have.",
            "We're working on things like.",
            "Molly Telluride and tungsten tungsten tungsten selenide to workout.",
            "Some of the basic technology as we try to synthesize materials like tungsten Telluride."
        ],
        [
            "That prediction that I just showed you was for a basic PN junction.",
            "The tunneling through a basic PN junction in a transition metal die die chalcogenides, but we'd really like a heterojunction.",
            "We'd like to have, if you imagine, I heterojunction here of something like tungsten diselenide.",
            "On tin diselenide from these density functional theory calculations we can anticipate that these will be what we call staggered energy band alignments when when you have this kind of alignment, you'll notice that the tunneling distances can be very short because they.",
            "Tunneling can happen when you start to put a bias on it.",
            "The tunneling will be very short distance because the depletion fields or the electrostatic lengths in these materials are in.",
            "These heterojunctions are very short.",
            "This means that we can get much higher current through these and this, so this is a path that we followed in the 35 materials that we can also follow in the 2D materials.",
            "But it means we have to.",
            "Not only grow these materials, we have to be able to grow the junction.",
            "And then when we make the device, we have some device options.",
            "We can imagine that I have something like tungsten selenide here and 10 die selenide on the other side and we just conduct.",
            "We make a perfect heterojunction.",
            "We conduct between the two.",
            "We can also in these two dimensional materials, stack them and have the current go in and turn up and go through the next layer.",
            "So there's a possibility for interlayer tunneling transistors in these materials, and of course more even more exotic structures can be imagined based on the interweaving of these kinds of heterojunctions."
        ],
        [
            "So when we have to move forward and making these devices, even though all the materials aren't here, we still want to verify that we really understand how the transistors are going to operate, so we move forward and start to build these things on homojunction's, and that's what I'd like to show you a little bit about the technology that's been developed here.",
            "It's we use exfoliation and so for those electrical engineers who can't imagine this technique is.",
            "We take Scotch tape.",
            "We get a geologic crystal often.",
            "Do we take Scotch tape and we can just peel off a layer of this material and then we can take Scotch tape again and peel off another layer and keep doing this until we get down to some small number of layers and then that layer is then stuck onto a wafer and then we have to find the wafer.",
            "And under microscopes we have to write electron patterns to these things and deposit metals on these things.",
            "And So what you see is to make a device that's a field effect transistor.",
            "Here's.",
            "Source and drain.",
            "And here's our Molly Telluride layered transition metal die chalcogenides.",
            "It has oxide gate underneath and we use a back gate here.",
            "Get this as our basic transistor structure.",
            "This is what people all over the world are doing who are doing experiments in this materials in these materials right now.",
            "If you look under a microscope and see these things you see this flake which is on the scale of five 5 microns or something like that.",
            "We put these right custom pads to these things and deposit.",
            "Metals to these things, and this is our basic.",
            "This is our basic mechanism for starting to explore the properties of these new material systems.",
            "We here show that things like.",
            "The band gap of these things are known in the bulk form.",
            "They're not really that well studied in the very thin, atomic, atomically thin number of layered materials, so we do things like spectroscopic photocurrent measurements to try to determine where the band gap is.",
            "So we sweep the energy and then we start to look for where we start to get current at a particular bias, and we see that in this material this band gap of something like 1 EV for the.",
            "A little little more than one EV for the Molly Ditelluride material."
        ],
        [
            "We look at ramans spectroscopy and confirm that it has the spectrum that people observe for this.",
            "Molly Telluride.",
            "And then we look at transistor currents, drain current here versus the back gate bias and it very much depends on what you actually stuck down.",
            "This is not a.",
            "We're not.",
            "We don't have a controlled way to deposit these layers, it's just this Scotch taping method for this one.",
            "And you see that the on to off current ratio depends very much on the layer thickness, and as you get closer and closer to 1 model layer, you get higher and higher on off current ratios.",
            "And of course for a good switch we really want them to switch with a high on current and a very low orders of magnitude even below what I show here current level."
        ],
        [
            "It turns out that when you make context to these kinds of materials, unlike in three 5 materials where we were able to make ohmic context to these materials to form transistors, what we end up getting in a 2D2 D material is a Schottky barrier.",
            "We can do temperature dependence of this to find out where the barrier height is.",
            "That's what's shown on the left, and you can see for this particular contact metal .1 three.",
            "This is a kind of.",
            "We have a perfect, Contact is the basic point here.",
            "When we look at the common source transistor characteristics, it turns out that we don't see the device coming up in saturation because we're just seeing the.",
            "Barrier limited transport of the ohmic context, but we can model these things and we can predict pretty precisely what is going on in these things.",
            "We have a basic understanding for how this transistor is operating.",
            "But we really need to have a way to dope these contexts.",
            "And."
        ],
        [
            "So I'd like to.",
            "Talk to you in a minute about how we go about doping these Contacts with science to really lower resistance.",
            "But now I'd like to wrap up some of the experimental discussion here with a more recent result as we think about using these two D materials, is the semiconductor industry thinks about using these two D materials.",
            "We imagine trying to make these devices very small.",
            "We want very high density of these materials, so if you think about making this 2D material, we'd like to large area growth, provide large area growth of this material, would like to cut it down in size because we'd really like to scale this down to maybe 10 nanometer widths or smaller, 'cause I want to put a lot of transistors per unit space.",
            "So if you think about that, then your device becomes edge dominated.",
            "In the scaling limit.",
            "It means that there's.",
            "That the edge can be the dominant aspect of the conduction, because it's so.",
            "There's things are so small, so if you think about the limits, you start thinking well, what I really want is I want a tube.",
            "I really would like to have a nanotube.",
            "Which is really the why I'm here.",
            "This week is because Joseph Steven Institute is the only place in the world that I know who knows how to know how to grow nanotubes.",
            "And so my ramscar and I have been working for some years looking at some of the properties of these nanotubes, we want to put build some of these transistors in the nanotubes because then we start to approach the dimensions where these actually really going to be needed to work on this week and start to look ahead to what is possible if you go to the nanotubes.",
            "Geometry in the transition metal Deutsche cognates.",
            "And there are two papers on this subject now and the first one is from.",
            "Drag on.",
            "Mihailovich the 1st paper came out last year and then my and I published a paper here just early this year on this subject.",
            "So I'd like to show you some of the initial transport.",
            "What some of the initial findings of what transistors in these materials."
        ],
        [
            "And again I just show you some basic top views of the transistors.",
            "The tubes look beautiful from optical microscopes you so we can put the context down on these things to measure the transistor properties."
        ],
        [
            "I just summarize these things.",
            "Maybe the kind of the details of these aren't is so important to you as.",
            "Other than to say that the performance of these things in terms of context is much better than it was have been previously, was previously published, and."
        ],
        [
            "More interesting, we took these devices that we measured the.",
            "Transistor behaviors on and cut them out so we actually see what these transistors look like.",
            "The of the ones we tested.",
            "Because when you look down at these tubes you really don't know exactly what they look like.",
            "They look like round shapes on the on the top when you hold them out in space 'cause they're so small, but if you look at them and we see various things when we see this tube is really really more of an Oval.",
            "It's kind of squashed either we squashed it in the process or that it somehow is chemically or some kind of.",
            "Mechanically formed this way in the process that we provide for it, but you can see something like 11 model layers of thickness.",
            "It wraps all the way around.",
            "We also see that in some another transistor we built here, it really turns out to be a ribbon.",
            "It's not a tube.",
            "And the ribbon is really unique in terms of what people have.",
            "People have made ribbons out of these Molly disulfide structures, but then they'll have at the edges.",
            "You'll have dangling bonds at each of the layers.",
            "In this case, the.",
            "The two brip smoothly around.",
            "Now there are some discontinuity's here, but in general generally they're wrapping all the way around.",
            "So this is providing us a new look at what transistors in this?"
        ],
        [
            "These geometries can do.",
            "Finally, I just have a couple of slides I want to show you about what I said in the title that we're looking at ion doping.",
            "Unfortunately, with developing transistors in this, these material systems, it's very early on in the technology development.",
            "We don't have good methods to make context.",
            "As I pointed out, we don't have good methods to dope these things.",
            "This is what we want.",
            "This current semiconductor industry was doing in 1950 was to develop all these technologies that are part of.",
            "Technologies we have today with all these things have to be reinvented for this kind of material system.",
            "We don't want to invent these technologies because we want to get to look at an early look at the devices, so we're using ions to do the doping.",
            "This gives us a tremendous flexibility in terms of designing the transistor.",
            "So I can use this is this cartoon shows our source drain contact and here Molly Telluride that we've used on this particular one we put up with polyethylene oxide, doped with cesium.",
            "Or we use assault cesium chloride which breaks up into ions of cesium chloride chlorine.",
            "And then I can put a configuration gate over the top of it and use this to set the doping of the transistor.",
            "What happens is if I put a positive bias on this I push all the positive ions down right to the.",
            "The channel these induce electrons, so I effectively dope the channel with electrons so I can make an end channel FET.",
            "Or I can reverse the bias in the Peach and on the configuration Gate gate, drive the ions in opposite directions and induce holes and make up effects so I I can take the same one.",
            "I can turn it into an end channel Fet Oropi channel FET and I can test the test.",
            "The transistor transistors behavior and I show here just this common source characteristics.",
            "Maybe for electrical engineers you might be used to this one drain current versus drain source voltage and you see the device coming up and saturating.",
            "The device I showed you in an earlier one had a characteristic that was pretty linear.",
            "Over this we see actually we get saturation because we're able to dope these things up.",
            "In the Contacts are no longer a big problem, but this gives us a tremendous flexibility now in terms of making devices, I can make PN junctions.",
            "It turns out I don't have to position this gate up at the top.",
            "I can push the position to the gate at the side and also get the ions to move so I can test the device at one doping level.",
            "I can change the bias, tested it at another doping level.",
            "I don't have to make.",
            "End devices to try to work out all the effects of doping.",
            "I can just dynamically in the same device one day tested is this this with this particular behavior 1 one day tested at another.",
            "So this is a technology that's really taken us maybe about a year and a half to develop to understand how all the time constants for these dope these ions are, but I want to point out to you that we're not thinking of these as being part of the active device.",
            "This is just to set the doping.",
            "In order to test the device with the electronic gates.",
            "So here I just show that these these same device can be an end Fedora P fit this.",
            "Subthreshold slopes are not ideal yet, but they are 80 millivolts per decade, 100 millivolt per decade and very nice saturating device characteristics."
        ],
        [
            "And finally I just show you our approach for doing that effect based on this kind of configuration.",
            "We have this configuration gate.",
            "We can dope the regions, the region at the drain making a very low contact resistance and dope.",
            "This in the way we want to.",
            "We put a conventional gate on the.",
            "Transition metal deck job card tonight and then we can bias this on and off and this is the basic approach for making the tunnel fet of these materials and you'll see some things coming out this year on this particular device."
        ],
        [
            "So finally I just say a couple things about Future Direct."
        ],
        [
            "Since we're not the only people you know that this this particular die transition metal Die child cognize are receiving attention worldwide.",
            "Many groups are working on these things.",
            "This is an interesting result I find published last year at the International Electron Devices Meeting.",
            "We're finding that when we grow these things, they will grow conformally on variety of things that grow on all kinds of substrates.",
            "It doesn't turn out to be some kind of magic substrate that it takes for these things to grow on.",
            "This is showing a transistor with a Silicon nanowire channel that was wrapped with a.",
            "With Molly disulfide, that means when you get this device you can get on both the current through the Molly disulfide and the Silicon one, so you try to enhance the current.",
            "Under the gate of the MOSFET and they were able to show this kind of technology bumping up the current in the they called the double channel MOSFET."
        ],
        [
            "People are now.",
            "There's now three groups.",
            "This is showing the first group to demonstrate good heterojunctions between.",
            "Here, Molly disulfide and tungsten selenide, which grow nicely together.",
            "When you are done grow.",
            "This is still by mechanical exfoliation and contacting forming these junctions.",
            "A signature for PN junction.",
            "Suck PN tunnel junction.",
            "Is this negative differential resistance?",
            "So this is just showing you that the quality of the materials are coming up and so this this particular field is moving very rapidly in terms of."
        ],
        [
            "Understanding and my last.",
            "Technical slide here is just to say that I'm telling you today about the tunnel field effect transistor, which is only one of a number of mechanisms that you can use to get these steep transistor devices, and these are being worked out worldwide.",
            "In the end in the center that I'm currently directing this so I have subthreshold swing here written and also have.",
            "The term that gives you what the tunnel FET does for substantial soon, but you can also think of other things other materials affects that can be used to boost up the current one is to use ferroelectric or piezo electric gates such that at certain biases you can get a ferroelectric ordering, or a piezo electric construction that can increase your capacitance abruptly, and then use that to increase your charge as a function of bias.",
            "So this is 1 mechanism that would apply to a lot of different.",
            "Field effect transistors and another one that is receiving more and more interest is the idea that we can induce phase transitions electrically if we can.",
            "Just.",
            "For example, if we can change.",
            "Transition metal Die Chalcogenide from a metallic phase to a semiconducting phase.",
            "We can go from an on state to an offset by inducing this transition and you can imagine using inducing these transitions with with gates or double layers from ions and so on.",
            "So these are."
        ],
        [
            "Things that you'll find find happening in the future.",
            "One acknowledge my group from this is from last summer Sarfaty Por was a lot of the transistor work you saw today.",
            "Who along with you was doing a lot of the ion doping work with Professor Susan Fullerton and many others contributing to this."
        ],
        [
            "Work so it's sponsored again by SRC and by DARPA went to acknowl."
        ],
        [
            "Their support and then finally just leave you with what I hope you take away from this.",
            "This talk is that more energy efficient transistors are really needed.",
            "We're going to run out of circuit ideas and we're going to run out of achievable performance in the MOSFET in the very near term, maybe by night by 2028.",
            "Most of all of the gains in terms of scaling will be over and the circuit gains are really losing.",
            "Losing.",
            "Fuck.",
            "Effectiveness, so now we have another thing I want you to remember is that substantial swings must be lower than 60 millivolt per decade, so as you think about materials, if you can start beating.",
            "If you can think of mechanisms that do this.",
            "Place to be.",
            "Materials are really everything.",
            "All these new effects are being enabled by materials.",
            "If we if we don't have these.",
            "If we don't utilize these new materials, we're just not going to get there with set conventional something semiconductors and the best mechanisms are still wide open.",
            "I'm here this week, so I would very much like to talk to any of you who want to bounce ideas off me or tell me about your work.",
            "And with that I'd like to thank you for your attention.",
            "So I have a question regarding their mobility.",
            "When you have iron gates and introduce ions, you will worry about also mobility, right?",
            "Yeah, so how is it?",
            "I mean is it increasing or decreasing?",
            "So I presume it will decrease the mobility, so aren't you concerned about that?",
            "Yeah, I'm concerned about that, but right now we don't know how we don't have good models to calculate exactly what that does.",
            "1st, in order to understand how the ion.",
            "The coulombic effects of the ion really need to know how close it gets, how physically close and right now we don't have a good way to characterize how close the ion actually gets in the final position.",
            "We know it comes up to the surface.",
            "We can count calculated by density functional theory, where it might might line up, but we don't really know.",
            "An electrolyte, as far as I understand, yeah.",
            "So probably you could use.",
            "We can talk about, yeah, I mean we have some ways of this thing.",
            "The special dependence of these ions?",
            "OK, and perhaps that can give some.",
            "Yeah, I'd like to talk about that.",
            "So you haven't mentioned anything about the speed of or.",
            "Let's say you can't measure speed with ionic gate, but have you tried to combine it with the classical gate to see what would be the spirit of your devices?",
            "So the speed is going to be comparable to what CMOS can do, not so much higher.",
            "The ions we were just using the ions here to dope the transistor, so we fixed.",
            "We apply these external biases to put the dopants where we want and then the speeds are just what the electronic speeds are.",
            "We just moving electrons in and out of the context, that's speeds are still.",
            "CDT kinds of speeds so.",
            "We don't have measurements of the speed at this point.",
            "And I didn't show you any top gated devices yet in this result, and that's because some of them are in preparation right now for publication.",
            "So you'll see some of these things in the coming year.",
            "Thank you and other questions.",
            "No, so I would like to thank you again.",
            "Very much and welcome again when you will come to Sylvania.",
            "OK, thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's my big pleasure to introduce you, Professor Alan Seabaugh, who is visiting our Institute in a frame of international project between US and Slovenia.",
                    "label": 0
                },
                {
                    "sent": "He has kindly agreed to speak to us on the subject of iron dope transistor method teacher covenant transistors.",
                    "label": 0
                },
                {
                    "sent": "Tennessee Board is a professor of electrical engineering at the University of Notre Dame in Indiana and director of the Semiconductor Technology Advanced Research Network, which is part of the Semiconductor Research Corporation.",
                    "label": 0
                },
                {
                    "sent": "This network combines the most important research centers in the field, working on finding paths around the fundamental physical limits that threaten the long term growth of the microelectronics industry.",
                    "label": 0
                },
                {
                    "sent": "He's also technical director of the Center of Low Energy Systems Technology.",
                    "label": 0
                },
                {
                    "sent": "Professor Sebo received the PhD degree in electrical engineering from the University of Virginia in 1985 before joining the University of Notre Dame 16 years ago.",
                    "label": 1
                },
                {
                    "sent": "He had research positions at the National Bureau of Standards at Texas Instruments and in company Raytheon.",
                    "label": 0
                },
                {
                    "sent": "He has authored or coauthored more than 300 papers and given 90 inviting invited presentations at conferences and workshops.",
                    "label": 0
                },
                {
                    "sent": "His huge indexes 34.",
                    "label": 0
                },
                {
                    "sent": "He has 23 US patents and 10 foreign patents and works in a close collaboration with imported industrial partners.",
                    "label": 0
                },
                {
                    "sent": "He's an editor for the IE Transactions on Electron Devices.",
                    "label": 0
                },
                {
                    "sent": "Among many awards he has received, I would like to mention only award from 2011 at the International Symposium on Compound Semiconductors Quantum Devices given for Seminole contributions and leadership in semiconductor devices and circuits based on quantum mechanical tunneling.",
                    "label": 0
                },
                {
                    "sent": "His current research.",
                    "label": 0
                },
                {
                    "sent": "Interests include tunneling transistors in circuits high and transport memory devices, 2 dimensional materials and energy extraction.",
                    "label": 0
                },
                {
                    "sent": "So Professor Anansi board the floor is yours?",
                    "label": 0
                },
                {
                    "sent": "OK?",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "It's my pleasure to be here and I'd like to say that that.",
                    "label": 0
                },
                {
                    "sent": "There's an introduction that Maya didn't give that she doesn't even know about a background of mine.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that is that.",
                    "label": 0
                },
                {
                    "sent": "If you look at the lineages of my PhD advisors.",
                    "label": 0
                },
                {
                    "sent": "You see that it ends or begins early with Joseph Stephen.",
                    "label": 0
                },
                {
                    "sent": "So my friend, my PhD advisor, great great advisor.",
                    "label": 0
                },
                {
                    "sent": "Was Joseph Steven.",
                    "label": 0
                },
                {
                    "sent": "This is a program that one of our physics professors has devoted his device so that if you know your PhD advisor, which you do, then you can track him back to see if anybody connects famous and typically everyone connects to someone famous 'cause only the very famous people were in the universities.",
                    "label": 0
                },
                {
                    "sent": "In the olden days.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some of you don't know where Notre Dame is, so I'd like to put it on the map.",
                    "label": 0
                },
                {
                    "sent": "We're in the we call it the Midwest of the United States, but you can see it's really Middle East we.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Formed in Notre Dame, formed around 1841 and there may be some things that you don't know about.",
                    "label": 0
                },
                {
                    "sent": "It will just give you some numbers.",
                    "label": 0
                },
                {
                    "sent": "It's.",
                    "label": 0
                },
                {
                    "sent": "8000 students about 3000 graduate students, so total, about 11,000.",
                    "label": 0
                },
                {
                    "sent": "It's more the size of a Harvard or Princeton or Rice University.",
                    "label": 0
                },
                {
                    "sent": "Private University Catholic University.",
                    "label": 0
                },
                {
                    "sent": "It was the site of the first wireless transmission in North America.",
                    "label": 1
                },
                {
                    "sent": "Marconi did it in Europe and the first wireless transmission was that the electrical engineering Department at Notre Dame and here shows 1873 for that.",
                    "label": 0
                },
                {
                    "sent": "Some of you may have heard of technology called Quantum Dot Cellular Automata that is also a concept originated at Notre Dame.",
                    "label": 0
                },
                {
                    "sent": "And we think more concepts will be coming out of this.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Place.",
                    "label": 0
                },
                {
                    "sent": "There's been a very big investment by the University in building up the infrastructure at Notre Dame.",
                    "label": 0
                },
                {
                    "sent": "So about 100 million dollars has been invested to build a new engineering building and to equip a state of the art clean room.",
                    "label": 0
                },
                {
                    "sent": "And so we were very privileged to have this great facility to work work in here.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have also been able to be leaders on several important national projects.",
                    "label": 0
                },
                {
                    "sent": "This one was announced in 2013.",
                    "label": 0
                },
                {
                    "sent": "It's sponsored by DARPA and the semiconductor industry and looks out to provide some guidance for how the semiconductor industry should.",
                    "label": 0
                },
                {
                    "sent": "Position itself in future years as we've reached the limits of scaling of conventional transistor technology.",
                    "label": 0
                },
                {
                    "sent": "So this was a 200 roughly 200 million dollar 10 year investment.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Invest in six 6 centers nationally.",
                    "label": 0
                },
                {
                    "sent": "Each one of these centers has some 25 to 30 faculty and about 100 students, so it's about $6,000,000 per Center for these five year for a 5 year increment.",
                    "label": 0
                },
                {
                    "sent": "You can see on the right that the companies that are behind this investment are Applied Materials and GLOBALFOUNDRIES, IBM, Intel, Micron, Raytheon, Texas Instruments, and United Technologies.",
                    "label": 1
                },
                {
                    "sent": "So these all contribute with the Defense Department to try to.",
                    "label": 0
                },
                {
                    "sent": "Promote the collaborative, collaborative research between universities to solve important problems, and I'll tell you about the center that I presently.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Direct.",
                    "label": 0
                },
                {
                    "sent": "It just just to say that it has.",
                    "label": 0
                },
                {
                    "sent": "27 This is about 100 students and postdocs in the center.",
                    "label": 0
                },
                {
                    "sent": "That's eleven universities, and it's about 27 faculty.",
                    "label": 0
                },
                {
                    "sent": "So now I come to the talk.",
                    "label": 0
                },
                {
                    "sent": "I'd like to tell you a little bit about my interest in materials and research, and maybe you heard in electrical engineering, maybe.",
                    "label": 0
                },
                {
                    "sent": "I understand that most of you are more of you are in physics, but you also have mechanical engineering.",
                    "label": 0
                },
                {
                    "sent": "Another set.",
                    "label": 0
                },
                {
                    "sent": "An electrical, of course.",
                    "label": 0
                },
                {
                    "sent": "I just met, so an electrical engineering.",
                    "label": 0
                },
                {
                    "sent": "And I'd like to tell you a little bit about the limits of what limits are happening now in transistors and how these how some of these new transistors that we think can outperform conventional transistors operate like to tell you about the transition metal type chalcogenides transistors.",
                    "label": 1
                },
                {
                    "sent": "Why we care about them?",
                    "label": 0
                },
                {
                    "sent": "What motivates our selection of the ones to study?",
                    "label": 1
                },
                {
                    "sent": "And I'll tell you, that's a new technology for doping these, and then I'd like to talk to you briefly about future directions.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'd like to make this a kind of introductory talk, so I hope that I can solicit your contributions to this work, because I think all the answers for the directions for future device research in transistors are not fully mapped out yet.",
                    "label": 0
                },
                {
                    "sent": "So first I'd like to just remind you about something you may may have noticed, or you may not have noticed in your laptops around 2004.",
                    "label": 0
                },
                {
                    "sent": "The Clock speed ended.",
                    "label": 0
                },
                {
                    "sent": "We did.",
                    "label": 0
                },
                {
                    "sent": "We were no longer increasing Clock speed.",
                    "label": 1
                },
                {
                    "sent": "And this becomes comes about for variety of factors.",
                    "label": 0
                },
                {
                    "sent": "But the laptop I have here still is about 3 GHz Clock rate, and that's what the same same as it was in 2004.",
                    "label": 0
                },
                {
                    "sent": "However, if you think about the computer you had in 2004, it does nothing like what your computer today does.",
                    "label": 0
                },
                {
                    "sent": "So why is this?",
                    "label": 0
                },
                {
                    "sent": "Why are we continuing to increase the performance?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "Very nice, maybe a complicated plot, but a very nice plot showing you some of the technology trends.",
                    "label": 0
                },
                {
                    "sent": "We can see.",
                    "label": 0
                },
                {
                    "sent": "First of all that we have something called Moores Law which has been proceeding for the last more than 40 years, 50 years now.",
                    "label": 0
                },
                {
                    "sent": "The density of transistors, which is the green curve, has been increasing at about a rate of every doubling in the density of transistors on a chip every 18 months.",
                    "label": 1
                },
                {
                    "sent": "That's this line down here.",
                    "label": 0
                },
                {
                    "sent": "This is called Moores Law by Gordon.",
                    "label": 0
                },
                {
                    "sent": "By the person Gordon Moore from Intel who first noticed this trend and you can see that even as we project out beyond year 2000.",
                    "label": 0
                },
                {
                    "sent": "That this law is even going faster.",
                    "label": 0
                },
                {
                    "sent": "The companies have been able to go faster than increasing this density per year and even today it's still not saturated yet.",
                    "label": 0
                },
                {
                    "sent": "However, the sizes of transistors are getting so small that we know it can't continue forever.",
                    "label": 0
                },
                {
                    "sent": "The reason we were able to get more transistors per chip as we make them smaller and smaller and smaller.",
                    "label": 0
                },
                {
                    "sent": "But eventually now with gate links approaching 15 nanometers, 13 nanometers, it's almost running out of space in terms of countable numbers of atoms that can.",
                    "label": 0
                },
                {
                    "sent": "Define the gate.",
                    "label": 0
                },
                {
                    "sent": "So what you see here is that the Moores law is increasing.",
                    "label": 0
                },
                {
                    "sent": "You see the Clock speed here saturated about 2004 you see that.",
                    "label": 0
                },
                {
                    "sent": "You see, is something else happening about the same time, and this is the reason for the Clock speed.",
                    "label": 0
                },
                {
                    "sent": "Saturation is that the power was going up on the chip.",
                    "label": 0
                },
                {
                    "sent": "As you keep increasing the number of transistors and is the density goes up, we finally get to a point where we can't remove enough of the heat generated by the transistors to pack any more transistors on them.",
                    "label": 0
                },
                {
                    "sent": "So you wonder how can we keep packing more transistors on here and not when we're up to this limit in chip power.",
                    "label": 0
                },
                {
                    "sent": "This 100 Watt per centimeter squared is the limit.",
                    "label": 0
                },
                {
                    "sent": "That you can.",
                    "label": 0
                },
                {
                    "sent": "You can remove heat from the chip without any active cooling.",
                    "label": 0
                },
                {
                    "sent": "In a laptop we don't have any refrigerator or any fan, so we're limited in about at about 100 Watts per centimeters squared for the chip.",
                    "label": 0
                },
                {
                    "sent": "But still people have been able to get designers have still wanted more transistors.",
                    "label": 0
                },
                {
                    "sent": "And how does this happen without more heat being generated and the reason the way this has happened is because primarily innovations in architecture.",
                    "label": 0
                },
                {
                    "sent": "At the circuit level, not at the device level, and what people are doing is paralyzing the microprocessors instead of having one microprocessor on the chip, you might have four 816 is called multicore.",
                    "label": 0
                },
                {
                    "sent": "Other things people do is they do something called dynamic voltage frequency scaling, that is, they dial the voltage down in the transistors when they don't need the speed.",
                    "label": 0
                },
                {
                    "sent": "When you turn the voltage down, you lose speed.",
                    "label": 0
                },
                {
                    "sent": "Turn the voltage back up, you get high speed, but so they'll put control circuits that dynamically change these things so you don't waste any power.",
                    "label": 0
                },
                {
                    "sent": "You don't work faster than you have to.",
                    "label": 0
                },
                {
                    "sent": "And there's a.",
                    "label": 1
                },
                {
                    "sent": "There's something else called dark Silicon.",
                    "label": 0
                },
                {
                    "sent": "Which is probably coming after dark energy.",
                    "label": 0
                },
                {
                    "sent": "But dark Silicon means that you just turn off whole sections of the chip when you're not using them, they just power power them all the way off.",
                    "label": 0
                },
                {
                    "sent": "So if there are very interesting infrared images of the microprocessors where you can see these these regions of the transistor of the microprocessor chip turning on and off, so parallelism has been the way that we're increasing performance.",
                    "label": 0
                },
                {
                    "sent": "But of course these kinds of tricks you run out of these kinds of tricks overtime, so this is going to saturate too.",
                    "label": 0
                },
                {
                    "sent": "So what we really need is A is a way to make the technology better, allowing us to.",
                    "label": 0
                },
                {
                    "sent": "Generate less heat as heat generated on the chip means waste of energy so.",
                    "label": 0
                },
                {
                    "sent": "The main way we remain up mechanism we have may nob we have to turn is this.",
                    "label": 0
                },
                {
                    "sent": "This is power dissipated on a chip.",
                    "label": 0
                },
                {
                    "sent": "It's related to the current and the power supply voltage.",
                    "label": 0
                },
                {
                    "sent": "So this is the steady DC current that has to flow for the transistors to operate.",
                    "label": 0
                },
                {
                    "sent": "And then there's another term that's corresponding to the dynamic charging and discharging of capacitance on the chip.",
                    "label": 0
                },
                {
                    "sent": "So we have static power.",
                    "label": 0
                },
                {
                    "sent": "We say we have dynamic power.",
                    "label": 0
                },
                {
                    "sent": "You see, they both depend on voltage.",
                    "label": 0
                },
                {
                    "sent": "So if we could figure out a way to lower the voltage on the device by changing the switching.",
                    "label": 0
                },
                {
                    "sent": "Mechanism for the current control mechanism.",
                    "label": 0
                },
                {
                    "sent": "Then we have a new tech new basis for technology, and that's what I'd like to tell you about today.",
                    "label": 0
                },
                {
                    "sent": "There are these mechanism.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For this.",
                    "label": 0
                },
                {
                    "sent": "Now I'd like to say something about the fundamental limits for a transistor.",
                    "label": 0
                },
                {
                    "sent": "How what sets the minimum voltage that the transistor can operate, and you can see here something we have in the semiconductor industry.",
                    "label": 0
                },
                {
                    "sent": "Is this something called an international technology road map for semiconductors?",
                    "label": 0
                },
                {
                    "sent": "It tells us that in order to keep scaling the device getting more density every 18 months, then we must do something.",
                    "label": 0
                },
                {
                    "sent": "And in the conventional semiconductor technology, they also consider let's lower the voltage down as far as we can lower it that down without losing performance.",
                    "label": 0
                },
                {
                    "sent": "But this is a big problem.",
                    "label": 0
                },
                {
                    "sent": "In there is a fundamental limit that you get to here.",
                    "label": 0
                },
                {
                    "sent": "This is the projection you hi, this is high performance transistors, low operating power transistors and around here we say that there's a limit of about 400 millivolts.",
                    "label": 0
                },
                {
                    "sent": "We won't go below that.",
                    "label": 0
                },
                {
                    "sent": "And why is that?",
                    "label": 0
                },
                {
                    "sent": "And this goes, this is 'cause there's a fundamental.",
                    "label": 0
                },
                {
                    "sent": "Voltage.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That we have to, well, there's a fundamental voltage that we have per decade of current that.",
                    "label": 0
                },
                {
                    "sent": "Be described by this diagram.",
                    "label": 0
                },
                {
                    "sent": "I'll show you this.",
                    "label": 0
                },
                {
                    "sent": "This is a. PN Junction maybe was a start here.",
                    "label": 0
                },
                {
                    "sent": "This PN junction has the property.",
                    "label": 0
                },
                {
                    "sent": "Maybe you remember that it's a diode.",
                    "label": 0
                },
                {
                    "sent": "It has the property that the current can turn on in One Direction.",
                    "label": 0
                },
                {
                    "sent": "Exponentially and turns off in the other, and Shockley showed us that this this relationship goes something like this E to the QV on Katie, where this is Boltzmann's constant absolute temperature and then the applied voltage.",
                    "label": 0
                },
                {
                    "sent": "So you look at here and you look at this IV characteristic.",
                    "label": 0
                },
                {
                    "sent": "You see that.",
                    "label": 0
                },
                {
                    "sent": "In order to increase the current by a factor of 10, there's a voltage dependence that depends on this Katie Q factor.",
                    "label": 0
                },
                {
                    "sent": "It turns out to be Katie on Q log 10 and that turns out to be 60 millivolts.",
                    "label": 0
                },
                {
                    "sent": "And if you look at what happens in energy space for the PN junction, you see the end type material, the P type material, you see this barrier between it.",
                    "label": 0
                },
                {
                    "sent": "And if I lower the barrier by 60 millivolts, that's what this does.",
                    "label": 0
                },
                {
                    "sent": "When you apply this voltage, I lower the barrier by 5060 millivolts.",
                    "label": 0
                },
                {
                    "sent": "Then I increase the current by a factor of 10 across here.",
                    "label": 0
                },
                {
                    "sent": "So this is this basic way we control current in Diode says we just lower the barrier a little bit and then the current flows over the top and equilibrium.",
                    "label": 0
                },
                {
                    "sent": "This at this energy there's some sort of equilibrium going on at this other current level.",
                    "label": 0
                },
                {
                    "sent": "So this is barrier lowering we say is the basic mechanism by which we can change current.",
                    "label": 0
                },
                {
                    "sent": "So if I want to change current by 4 orders of magnitude, I had to apply 240 millivolts.",
                    "label": 0
                },
                {
                    "sent": "So this is if you're thinking about a switch.",
                    "label": 0
                },
                {
                    "sent": "This isn't necessarily so good.",
                    "label": 0
                },
                {
                    "sent": "It's been great up till now, but if you think about it light switch.",
                    "label": 0
                },
                {
                    "sent": "I just flip the switch and turn on.",
                    "label": 0
                },
                {
                    "sent": "It goes from some position to connect it and it's just an abrupt change.",
                    "label": 0
                },
                {
                    "sent": "But when we have to control the.",
                    "label": 0
                },
                {
                    "sent": "The current electrically we have this limit of 60 millivolts per decade in the diode and this term.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Got to be the same mechanism that happens in transistors.",
                    "label": 1
                },
                {
                    "sent": "In the bipolar transistor we have an NPN structure and what we do and we bias the base, change the voltage on the basis that we lower the barrier between the end and the P, and then we inject carriers across.",
                    "label": 0
                },
                {
                    "sent": "At best that can also only be as good as 60 millivolts to get a factor of 10 changing current.",
                    "label": 0
                },
                {
                    "sent": "And in the metal oxide semiconductor field effect transistor, the modern transistor we also.",
                    "label": 0
                },
                {
                    "sent": "Put a voltage on a gate and we also move up and down a surface potential and the best we can do is a barrier lowering device.",
                    "label": 0
                },
                {
                    "sent": "We're just lowering the barrier down.",
                    "label": 0
                },
                {
                    "sent": "We're getting injection from source into the channel and collection at the drain.",
                    "label": 0
                },
                {
                    "sent": "This is also a barrier lowering device.",
                    "label": 1
                },
                {
                    "sent": "It sets the physics that sets the how that one that transistor works and in the transistor we call this 60 millivolts per decade.",
                    "label": 0
                },
                {
                    "sent": "The subthreshold swing 'cause this was what determines how fast the transistor turns on.",
                    "label": 0
                },
                {
                    "sent": "Below something we call the threshold voltage, which defines the turn on point for the transistor.",
                    "label": 0
                },
                {
                    "sent": "So the point here is the barrier lowering is that is the basic mechanism here and the transistors are all limited to this.",
                    "label": 1
                },
                {
                    "sent": "So if I trying to lower voltage in modern transistor, at best I can do 240 and we never do quite that well, so it's starting to set the limits of how small the total voltage across the device can be.",
                    "label": 0
                },
                {
                    "sent": "We can't go lower than that.",
                    "label": 0
                },
                {
                    "sent": "So here I'm giving you a kind of definition for this most important parameter for.",
                    "label": 0
                },
                {
                    "sent": "For transistors, is called subthreshold swing, and it's the subthreshold swing that we need to try to optimize.",
                    "label": 1
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now that mechanism is the basis for pretty much for much of modern technology.",
                    "label": 0
                },
                {
                    "sent": "That's bipolar transistors.",
                    "label": 0
                },
                {
                    "sent": "That's field.",
                    "label": 0
                },
                {
                    "sent": "The field effect transistors of all varieties.",
                    "label": 0
                },
                {
                    "sent": "That's diodes.",
                    "label": 0
                },
                {
                    "sent": "That's lasers.",
                    "label": 0
                },
                {
                    "sent": "Everything is a barrier.",
                    "label": 0
                },
                {
                    "sent": "Lowering devices we've been since the 1940s.",
                    "label": 0
                },
                {
                    "sent": "If the discovery of these mechanisms, that's what we've been doing is optimizing transistors for using this parameter, giving them either more current or more power or lower?",
                    "label": 0
                },
                {
                    "sent": "Lower power we optimize on this particular parameter, but it's not the only mechanism, it's just the mechanism.",
                    "label": 0
                },
                {
                    "sent": "We've only we've been thinking about so far, and so I show you here an example of a recently discovered transistor mechanism called the tunnel FET, which can be much less than 60 millivolt per decade subthreshold swings.",
                    "label": 0
                },
                {
                    "sent": "We look at how this one works instead of going, this is the cross section of a MOSFET if you're.",
                    "label": 0
                },
                {
                    "sent": "For those who would be familiar with it, typically a MOSFET would have a PNP kind of a structure.",
                    "label": 0
                },
                {
                    "sent": "We have an oxide and a gate.",
                    "label": 0
                },
                {
                    "sent": "This is the side view.",
                    "label": 0
                },
                {
                    "sent": "We put a positive voltage.",
                    "label": 0
                },
                {
                    "sent": "On the gate and induce in this particular, we put a negative voltage in the gate.",
                    "label": 0
                },
                {
                    "sent": "We induce holes here and we would get a. Conduction, that's all.",
                    "label": 0
                },
                {
                    "sent": "The switch would work, but in this particular case this is.",
                    "label": 0
                },
                {
                    "sent": "I'm showing it for the tunnel Fet.",
                    "label": 1
                },
                {
                    "sent": "It's PNN.",
                    "label": 0
                },
                {
                    "sent": "This is the band diagram you see.",
                    "label": 0
                },
                {
                    "sent": "PU CN Region UCP and I'm showing it under some bias between source and rain.",
                    "label": 0
                },
                {
                    "sent": "And in this particular configuration with no gate voltage on it, how does the how do the electrons get from source to drain?",
                    "label": 0
                },
                {
                    "sent": "The electrons have to go over a very big barrier, so the thermionic current is very low.",
                    "label": 0
                },
                {
                    "sent": "They only can go from directly across if they quantum mechanically tunnel across this base.",
                    "label": 0
                },
                {
                    "sent": "This channel channel region and this is very much restricted by the size 'cause these distances maybe more than 20 nanometers and then.",
                    "label": 0
                },
                {
                    "sent": "However, if I put a positive bias on this.",
                    "label": 0
                },
                {
                    "sent": "Induce electrons in this.",
                    "label": 0
                },
                {
                    "sent": "Channel Region I open up a region between the valence band and the conduction band where I can get current to flow.",
                    "label": 0
                },
                {
                    "sent": "This is current by quantum mechanical tunneling from the source into the channel, and then we collect it out the drain.",
                    "label": 0
                },
                {
                    "sent": "So this is this is the new mechanism for current control.",
                    "label": 0
                },
                {
                    "sent": "I no longer have whole distribution of electrons that I'm letting across the Boltzmann tail of the electron distribution which has the 60 millivolt per decade behavior.",
                    "label": 0
                },
                {
                    "sent": "I have a.",
                    "label": 0
                },
                {
                    "sent": "Something some small energy window now that I only let current electrons in that small energy window tunnel across.",
                    "label": 0
                },
                {
                    "sent": "So this one has a different kind of physical relation for what this looks like.",
                    "label": 0
                },
                {
                    "sent": "It's not obvious that this is less than 60 millivolt per decade, but when you put numbers in here, you find out it is so tunneling is 1 mechanism whereby we can get this less than 60 millivolt per decade.",
                    "label": 0
                },
                {
                    "sent": "When this was first observed around 2004, there was much speculation that there would.",
                    "label": 0
                },
                {
                    "sent": "We would never be able to get enough current through this kind of a junction to get it to be competitive to have a certain.",
                    "label": 0
                },
                {
                    "sent": "Current to make a high performance device.",
                    "label": 0
                },
                {
                    "sent": "'cause in a circuit we must supply current to charge up a capacitance in the circuit and it has to reach the speed with which it a capacitor charges.",
                    "label": 0
                },
                {
                    "sent": "Depending on how much charge per second comes in.",
                    "label": 0
                },
                {
                    "sent": "So in order to make a fast.",
                    "label": 0
                },
                {
                    "sent": "High performance transistor like what you need in a microprocessor.",
                    "label": 0
                },
                {
                    "sent": "You need high current.",
                    "label": 0
                },
                {
                    "sent": "This was the main concern in the early days of this transistor.",
                    "label": 0
                },
                {
                    "sent": "As to whether this was even possible.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now I want to show you here if something is quite complicated, but it's quite it shows you about the what people are predicting for the performance of these transistors, and so I'd like to first of all realize that if I just look at this quadrant.",
                    "label": 0
                },
                {
                    "sent": "What this is showing is the characteristics of a transistor switch.",
                    "label": 0
                },
                {
                    "sent": "This is current on this action axis.",
                    "label": 0
                },
                {
                    "sent": "It's normalized by the width of the transistor just to make the comparisons easy to associate with size, but so it's current per unit width of the transistor and we see current here and then the voltage.",
                    "label": 0
                },
                {
                    "sent": "So if you make a switch, I'd like to apply some voltage and then I would like the current to turn on.",
                    "label": 0
                },
                {
                    "sent": "But I told you that a conventional transistor, which is the one here in the dashed line.",
                    "label": 0
                },
                {
                    "sent": "Turns on at only 60 millivolt per decade at best, and here's the 60 millivolt per decade line.",
                    "label": 0
                },
                {
                    "sent": "So this turns out to be the.",
                    "label": 0
                },
                {
                    "sent": "Company TSMC's High Performance 16 nanometer FinFET and you see it for a couple of different bias conditions at .75 Volt bias or .05 Volt bias and you see it turning on an.",
                    "label": 0
                },
                {
                    "sent": "It takes more than half a Volt till it gets to be a high current.",
                    "label": 0
                },
                {
                    "sent": "And this is what this is the thing to beat.",
                    "label": 0
                },
                {
                    "sent": "If you want to make a more energy efficient transistor, what you would like to have is that transistor turning on like what these are doing.",
                    "label": 0
                },
                {
                    "sent": "It takes very little voltage for, say that transistor.",
                    "label": 0
                },
                {
                    "sent": "To go from off to high on.",
                    "label": 0
                },
                {
                    "sent": "So what this is is a collection of predictions from the literature from different groups about what the tunnel fet's can do, and you see the shown in wide variety of materials, and there's very much there's very much not a consensus about what the material should be, although you can see things like, unfortunately, things like Silicon.",
                    "label": 0
                },
                {
                    "sent": "This is a Silicon nanowire does not provide enough current to be anywhere near competitive with a regular Silicon transistor.",
                    "label": 0
                },
                {
                    "sent": "In order to get these kinds of currents, you have to move to other systems, primarily 35 compound semiconductors, carbon nanotubes, and also we learn.",
                    "label": 0
                },
                {
                    "sent": "We've been learning the transition metal dye chalcogenides can get us up into this.",
                    "label": 0
                },
                {
                    "sent": "The 2D materials can get us up into this range.",
                    "label": 0
                },
                {
                    "sent": "So this is this one side is showing you the what we call the N channel transistor and you can make a complementary version of this and make a P channel transistor.",
                    "label": 0
                },
                {
                    "sent": "So there are two kinds of switches here and these are the predictions, so it's these ones here that are really quite fantastic.",
                    "label": 0
                },
                {
                    "sent": "And this is really what's motivating industry.",
                    "label": 0
                },
                {
                    "sent": "Interested in sponsoring center research like what I'm going to describe today is that if we can realize these kinds of things, this provides them a path forward for making a.",
                    "label": 0
                },
                {
                    "sent": "A really energy efficient technology.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now I'd like to talk to you a little bit about the physics of these kinds of structures.",
                    "label": 0
                },
                {
                    "sent": "What happens in this device?",
                    "label": 0
                },
                {
                    "sent": "I show you just the.",
                    "label": 0
                },
                {
                    "sent": "The source and the channel side of the device to see what happens what, what goes into a device design on this kind of thing you can take.",
                    "label": 0
                },
                {
                    "sent": "We know what the analytic behavior of that tunnel current is.",
                    "label": 0
                },
                {
                    "sent": "We can.",
                    "label": 0
                },
                {
                    "sent": "Calculate the subthreshold swings an analytically from.",
                    "label": 0
                },
                {
                    "sent": "This is just the derivative of the log of the current divided proper gate source voltage and it turns out to give you a couple of terms and these terms terms turn out to show the.",
                    "label": 0
                },
                {
                    "sent": "Easy to show in terms of their behavior.",
                    "label": 0
                },
                {
                    "sent": "We have this first term which basically adjusts the tunneling window if you would.",
                    "label": 0
                },
                {
                    "sent": "Of.",
                    "label": 0
                },
                {
                    "sent": "Make it so that the gate voltage really controls this with unity.",
                    "label": 0
                },
                {
                    "sent": "With perfect dependence, you just see that this is just opening up and closing this tunneling window.",
                    "label": 0
                },
                {
                    "sent": "The second thing that this relation shows you that is if you can increase the electric field in the channel, then you also increase the tunneling window to increase the tunneling.",
                    "label": 0
                },
                {
                    "sent": "Current.",
                    "label": 0
                },
                {
                    "sent": "Thinner barrier means more quantum mechanical tunneling.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here shows I mentioned that there isn't a consensus on what materials to use, but here with this kind of basic behavior, this basic relationship for the tunneling current.",
                    "label": 0
                },
                {
                    "sent": "We can speculate on which current which materials can be give us the best performance for these devices, and so I show you this relationship here you see that the coefficients in this.",
                    "label": 0
                },
                {
                    "sent": "In the transistor, current depend on energy, bandgap and effective mass.",
                    "label": 0
                },
                {
                    "sent": "So these are the things that we really want to adjust and then your bias then also affects the electric field which you see showing up in this these relationships.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we look.",
                    "label": 0
                },
                {
                    "sent": "We can look at what materials you might expect to be to work.",
                    "label": 0
                },
                {
                    "sent": "Well, that's why I show you here the current versus the electric field, which I just showed you at the very end of that.",
                    "label": 0
                },
                {
                    "sent": "You see that Silicon, germanium, Indium gallium arsenide are not so good, but as you move higher and higher, move to narrower and narrower band gaps, you get more and more current out of these devices.",
                    "label": 0
                },
                {
                    "sent": "And this is what motivated the original choices for what channel materials to look at.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Over the last well between 2009 two 1000 2011 2013 our group, an Penn State, developed transistors a couple of different geometry's that showed that these kinds of transistors can meet currents that are comparable to what you can get out of a MOSFET at low currents these are tunnel currents that are as high as what a MOSFET can do at low voltages so.",
                    "label": 0
                },
                {
                    "sent": "Here is showing versus year these high on current on tunnel currents in Indium gallium arsenide materials in heterojunction materials, and.",
                    "label": 0
                },
                {
                    "sent": "In what we call Broken gap heterojunction materials, these are materials where the heterojunction.",
                    "label": 0
                },
                {
                    "sent": "Is such that the.",
                    "label": 0
                },
                {
                    "sent": "Electrons can tunnel from valence band conduction band without any intrinsic depletion barrier.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also we have entering the scene in around 2010 or so.",
                    "label": 0
                },
                {
                    "sent": "Intel also started looking carefully at this particular transistor technology and put out a number of papers that.",
                    "label": 0
                },
                {
                    "sent": "Pointed out the.",
                    "label": 0
                },
                {
                    "sent": "The fact that these transistors can outperform technology as they project, showing that these this particular paper from VLSI Symposium Symposium, very large scale integration Symposium of 2011, we see Intel projection that effects can be 8X faster at the same power than a MOSFET, and we worry very much about variation and they study the possibility.",
                    "label": 1
                },
                {
                    "sent": "Variation dependence of these kinds of transistors T Fets against MOSFET and find no real significant problems there.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also, Intel and others in this semiconductor technology network that we have have been benchmarking these technologies against modern transistors, and one thing we used one way.",
                    "label": 0
                },
                {
                    "sent": "We used to benchmark various competing technologies that people are looking at for transistors is to look at energy versus delay and you'd really like to have you really like to be in this corner of the optimization.",
                    "label": 0
                },
                {
                    "sent": "You're like that.",
                    "label": 0
                },
                {
                    "sent": "Like this, switching energy for the device to be as low as possible.",
                    "label": 1
                },
                {
                    "sent": "You'd like this delay or the speed of the device to be.",
                    "label": 0
                },
                {
                    "sent": "The shortest possible.",
                    "label": 0
                },
                {
                    "sent": "And this is showing these green curves.",
                    "label": 0
                },
                {
                    "sent": "These green dots show what projections are for a regular transistor at.",
                    "label": 0
                },
                {
                    "sent": "Point regular transistor at 15 nanometer gate lengths and this is showing all these other technologies benchmarked at the same size and you can see these.",
                    "label": 0
                },
                {
                    "sent": "Tunnel Fet's T Fets are the are the most promising of all the devices at this moment for providing a very low voltage switch.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now I'd like to say a little bit about transition metal Dia chalcogenides why?",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Why is there interest in these materials and what materials would we use if we work in this area?",
                    "label": 0
                },
                {
                    "sent": "So again, I start to make we start to put together projections.",
                    "label": 0
                },
                {
                    "sent": "This is prediction from Debbie Jenna's group showing current density through these things, sheet currents through atomically thin transition metal die chachaji nights as a function of electric field.",
                    "label": 0
                },
                {
                    "sent": "In this electric field is electric field in a PN junction formed in these materials, which will be the tunnel junction used in the tunnel Fet.",
                    "label": 0
                },
                {
                    "sent": "So we're looking for here is which materials will provide enough current.",
                    "label": 0
                },
                {
                    "sent": "This is the same as the one I was showing you before, but it was for bulk materials.",
                    "label": 0
                },
                {
                    "sent": "This is which materials will provide enough current to provide a high performance which so this.",
                    "label": 0
                },
                {
                    "sent": "Dashed line is what you really have to get to in order to be of interest to the semiconductor community.",
                    "label": 0
                },
                {
                    "sent": "And if you look at things like Molly disulfide, tungsten selenide and these others down here you see that we really don't have a material.",
                    "label": 0
                },
                {
                    "sent": "Most of the materials that people are working on are not in the right, do not provide the right kinds of materials parameters to get us up there, but it just says that things like tungsten ditelluride, which is a material that has yet to be synthesized in a. Semiconducting form is the kind of material you want.",
                    "label": 0
                },
                {
                    "sent": "It has a band gap somewhere around one electron Volt, and it can get you up into these ranges of interests.",
                    "label": 0
                },
                {
                    "sent": "Also, other materials that you can put on here, and even more than these.",
                    "label": 0
                },
                {
                    "sent": "But these are also look really good, but they have very low band gaps and so it's very hard to imagine how these could turn the current off, so these are not in the space which you really need, so it's really up in here where you'd like to be.",
                    "label": 0
                },
                {
                    "sent": "However, you'll see that the research I'm going to show you right now is based on materials we now have.",
                    "label": 0
                },
                {
                    "sent": "We're working on things like.",
                    "label": 0
                },
                {
                    "sent": "Molly Telluride and tungsten tungsten tungsten selenide to workout.",
                    "label": 0
                },
                {
                    "sent": "Some of the basic technology as we try to synthesize materials like tungsten Telluride.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That prediction that I just showed you was for a basic PN junction.",
                    "label": 0
                },
                {
                    "sent": "The tunneling through a basic PN junction in a transition metal die die chalcogenides, but we'd really like a heterojunction.",
                    "label": 0
                },
                {
                    "sent": "We'd like to have, if you imagine, I heterojunction here of something like tungsten diselenide.",
                    "label": 0
                },
                {
                    "sent": "On tin diselenide from these density functional theory calculations we can anticipate that these will be what we call staggered energy band alignments when when you have this kind of alignment, you'll notice that the tunneling distances can be very short because they.",
                    "label": 0
                },
                {
                    "sent": "Tunneling can happen when you start to put a bias on it.",
                    "label": 0
                },
                {
                    "sent": "The tunneling will be very short distance because the depletion fields or the electrostatic lengths in these materials are in.",
                    "label": 0
                },
                {
                    "sent": "These heterojunctions are very short.",
                    "label": 0
                },
                {
                    "sent": "This means that we can get much higher current through these and this, so this is a path that we followed in the 35 materials that we can also follow in the 2D materials.",
                    "label": 0
                },
                {
                    "sent": "But it means we have to.",
                    "label": 0
                },
                {
                    "sent": "Not only grow these materials, we have to be able to grow the junction.",
                    "label": 0
                },
                {
                    "sent": "And then when we make the device, we have some device options.",
                    "label": 0
                },
                {
                    "sent": "We can imagine that I have something like tungsten selenide here and 10 die selenide on the other side and we just conduct.",
                    "label": 0
                },
                {
                    "sent": "We make a perfect heterojunction.",
                    "label": 0
                },
                {
                    "sent": "We conduct between the two.",
                    "label": 0
                },
                {
                    "sent": "We can also in these two dimensional materials, stack them and have the current go in and turn up and go through the next layer.",
                    "label": 0
                },
                {
                    "sent": "So there's a possibility for interlayer tunneling transistors in these materials, and of course more even more exotic structures can be imagined based on the interweaving of these kinds of heterojunctions.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So when we have to move forward and making these devices, even though all the materials aren't here, we still want to verify that we really understand how the transistors are going to operate, so we move forward and start to build these things on homojunction's, and that's what I'd like to show you a little bit about the technology that's been developed here.",
                    "label": 0
                },
                {
                    "sent": "It's we use exfoliation and so for those electrical engineers who can't imagine this technique is.",
                    "label": 0
                },
                {
                    "sent": "We take Scotch tape.",
                    "label": 0
                },
                {
                    "sent": "We get a geologic crystal often.",
                    "label": 0
                },
                {
                    "sent": "Do we take Scotch tape and we can just peel off a layer of this material and then we can take Scotch tape again and peel off another layer and keep doing this until we get down to some small number of layers and then that layer is then stuck onto a wafer and then we have to find the wafer.",
                    "label": 0
                },
                {
                    "sent": "And under microscopes we have to write electron patterns to these things and deposit metals on these things.",
                    "label": 0
                },
                {
                    "sent": "And So what you see is to make a device that's a field effect transistor.",
                    "label": 0
                },
                {
                    "sent": "Here's.",
                    "label": 0
                },
                {
                    "sent": "Source and drain.",
                    "label": 0
                },
                {
                    "sent": "And here's our Molly Telluride layered transition metal die chalcogenides.",
                    "label": 0
                },
                {
                    "sent": "It has oxide gate underneath and we use a back gate here.",
                    "label": 0
                },
                {
                    "sent": "Get this as our basic transistor structure.",
                    "label": 0
                },
                {
                    "sent": "This is what people all over the world are doing who are doing experiments in this materials in these materials right now.",
                    "label": 0
                },
                {
                    "sent": "If you look under a microscope and see these things you see this flake which is on the scale of five 5 microns or something like that.",
                    "label": 0
                },
                {
                    "sent": "We put these right custom pads to these things and deposit.",
                    "label": 0
                },
                {
                    "sent": "Metals to these things, and this is our basic.",
                    "label": 0
                },
                {
                    "sent": "This is our basic mechanism for starting to explore the properties of these new material systems.",
                    "label": 0
                },
                {
                    "sent": "We here show that things like.",
                    "label": 0
                },
                {
                    "sent": "The band gap of these things are known in the bulk form.",
                    "label": 0
                },
                {
                    "sent": "They're not really that well studied in the very thin, atomic, atomically thin number of layered materials, so we do things like spectroscopic photocurrent measurements to try to determine where the band gap is.",
                    "label": 0
                },
                {
                    "sent": "So we sweep the energy and then we start to look for where we start to get current at a particular bias, and we see that in this material this band gap of something like 1 EV for the.",
                    "label": 0
                },
                {
                    "sent": "A little little more than one EV for the Molly Ditelluride material.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We look at ramans spectroscopy and confirm that it has the spectrum that people observe for this.",
                    "label": 0
                },
                {
                    "sent": "Molly Telluride.",
                    "label": 0
                },
                {
                    "sent": "And then we look at transistor currents, drain current here versus the back gate bias and it very much depends on what you actually stuck down.",
                    "label": 0
                },
                {
                    "sent": "This is not a.",
                    "label": 0
                },
                {
                    "sent": "We're not.",
                    "label": 0
                },
                {
                    "sent": "We don't have a controlled way to deposit these layers, it's just this Scotch taping method for this one.",
                    "label": 0
                },
                {
                    "sent": "And you see that the on to off current ratio depends very much on the layer thickness, and as you get closer and closer to 1 model layer, you get higher and higher on off current ratios.",
                    "label": 0
                },
                {
                    "sent": "And of course for a good switch we really want them to switch with a high on current and a very low orders of magnitude even below what I show here current level.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It turns out that when you make context to these kinds of materials, unlike in three 5 materials where we were able to make ohmic context to these materials to form transistors, what we end up getting in a 2D2 D material is a Schottky barrier.",
                    "label": 0
                },
                {
                    "sent": "We can do temperature dependence of this to find out where the barrier height is.",
                    "label": 1
                },
                {
                    "sent": "That's what's shown on the left, and you can see for this particular contact metal .1 three.",
                    "label": 0
                },
                {
                    "sent": "This is a kind of.",
                    "label": 0
                },
                {
                    "sent": "We have a perfect, Contact is the basic point here.",
                    "label": 0
                },
                {
                    "sent": "When we look at the common source transistor characteristics, it turns out that we don't see the device coming up in saturation because we're just seeing the.",
                    "label": 0
                },
                {
                    "sent": "Barrier limited transport of the ohmic context, but we can model these things and we can predict pretty precisely what is going on in these things.",
                    "label": 0
                },
                {
                    "sent": "We have a basic understanding for how this transistor is operating.",
                    "label": 0
                },
                {
                    "sent": "But we really need to have a way to dope these contexts.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'd like to.",
                    "label": 0
                },
                {
                    "sent": "Talk to you in a minute about how we go about doping these Contacts with science to really lower resistance.",
                    "label": 0
                },
                {
                    "sent": "But now I'd like to wrap up some of the experimental discussion here with a more recent result as we think about using these two D materials, is the semiconductor industry thinks about using these two D materials.",
                    "label": 0
                },
                {
                    "sent": "We imagine trying to make these devices very small.",
                    "label": 0
                },
                {
                    "sent": "We want very high density of these materials, so if you think about making this 2D material, we'd like to large area growth, provide large area growth of this material, would like to cut it down in size because we'd really like to scale this down to maybe 10 nanometer widths or smaller, 'cause I want to put a lot of transistors per unit space.",
                    "label": 0
                },
                {
                    "sent": "So if you think about that, then your device becomes edge dominated.",
                    "label": 0
                },
                {
                    "sent": "In the scaling limit.",
                    "label": 0
                },
                {
                    "sent": "It means that there's.",
                    "label": 0
                },
                {
                    "sent": "That the edge can be the dominant aspect of the conduction, because it's so.",
                    "label": 0
                },
                {
                    "sent": "There's things are so small, so if you think about the limits, you start thinking well, what I really want is I want a tube.",
                    "label": 0
                },
                {
                    "sent": "I really would like to have a nanotube.",
                    "label": 0
                },
                {
                    "sent": "Which is really the why I'm here.",
                    "label": 0
                },
                {
                    "sent": "This week is because Joseph Steven Institute is the only place in the world that I know who knows how to know how to grow nanotubes.",
                    "label": 0
                },
                {
                    "sent": "And so my ramscar and I have been working for some years looking at some of the properties of these nanotubes, we want to put build some of these transistors in the nanotubes because then we start to approach the dimensions where these actually really going to be needed to work on this week and start to look ahead to what is possible if you go to the nanotubes.",
                    "label": 0
                },
                {
                    "sent": "Geometry in the transition metal Deutsche cognates.",
                    "label": 0
                },
                {
                    "sent": "And there are two papers on this subject now and the first one is from.",
                    "label": 0
                },
                {
                    "sent": "Drag on.",
                    "label": 0
                },
                {
                    "sent": "Mihailovich the 1st paper came out last year and then my and I published a paper here just early this year on this subject.",
                    "label": 0
                },
                {
                    "sent": "So I'd like to show you some of the initial transport.",
                    "label": 0
                },
                {
                    "sent": "What some of the initial findings of what transistors in these materials.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And again I just show you some basic top views of the transistors.",
                    "label": 0
                },
                {
                    "sent": "The tubes look beautiful from optical microscopes you so we can put the context down on these things to measure the transistor properties.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I just summarize these things.",
                    "label": 0
                },
                {
                    "sent": "Maybe the kind of the details of these aren't is so important to you as.",
                    "label": 0
                },
                {
                    "sent": "Other than to say that the performance of these things in terms of context is much better than it was have been previously, was previously published, and.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "More interesting, we took these devices that we measured the.",
                    "label": 0
                },
                {
                    "sent": "Transistor behaviors on and cut them out so we actually see what these transistors look like.",
                    "label": 0
                },
                {
                    "sent": "The of the ones we tested.",
                    "label": 0
                },
                {
                    "sent": "Because when you look down at these tubes you really don't know exactly what they look like.",
                    "label": 0
                },
                {
                    "sent": "They look like round shapes on the on the top when you hold them out in space 'cause they're so small, but if you look at them and we see various things when we see this tube is really really more of an Oval.",
                    "label": 0
                },
                {
                    "sent": "It's kind of squashed either we squashed it in the process or that it somehow is chemically or some kind of.",
                    "label": 0
                },
                {
                    "sent": "Mechanically formed this way in the process that we provide for it, but you can see something like 11 model layers of thickness.",
                    "label": 0
                },
                {
                    "sent": "It wraps all the way around.",
                    "label": 0
                },
                {
                    "sent": "We also see that in some another transistor we built here, it really turns out to be a ribbon.",
                    "label": 0
                },
                {
                    "sent": "It's not a tube.",
                    "label": 0
                },
                {
                    "sent": "And the ribbon is really unique in terms of what people have.",
                    "label": 0
                },
                {
                    "sent": "People have made ribbons out of these Molly disulfide structures, but then they'll have at the edges.",
                    "label": 1
                },
                {
                    "sent": "You'll have dangling bonds at each of the layers.",
                    "label": 1
                },
                {
                    "sent": "In this case, the.",
                    "label": 0
                },
                {
                    "sent": "The two brip smoothly around.",
                    "label": 0
                },
                {
                    "sent": "Now there are some discontinuity's here, but in general generally they're wrapping all the way around.",
                    "label": 0
                },
                {
                    "sent": "So this is providing us a new look at what transistors in this?",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These geometries can do.",
                    "label": 0
                },
                {
                    "sent": "Finally, I just have a couple of slides I want to show you about what I said in the title that we're looking at ion doping.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, with developing transistors in this, these material systems, it's very early on in the technology development.",
                    "label": 0
                },
                {
                    "sent": "We don't have good methods to make context.",
                    "label": 0
                },
                {
                    "sent": "As I pointed out, we don't have good methods to dope these things.",
                    "label": 0
                },
                {
                    "sent": "This is what we want.",
                    "label": 0
                },
                {
                    "sent": "This current semiconductor industry was doing in 1950 was to develop all these technologies that are part of.",
                    "label": 0
                },
                {
                    "sent": "Technologies we have today with all these things have to be reinvented for this kind of material system.",
                    "label": 0
                },
                {
                    "sent": "We don't want to invent these technologies because we want to get to look at an early look at the devices, so we're using ions to do the doping.",
                    "label": 0
                },
                {
                    "sent": "This gives us a tremendous flexibility in terms of designing the transistor.",
                    "label": 0
                },
                {
                    "sent": "So I can use this is this cartoon shows our source drain contact and here Molly Telluride that we've used on this particular one we put up with polyethylene oxide, doped with cesium.",
                    "label": 0
                },
                {
                    "sent": "Or we use assault cesium chloride which breaks up into ions of cesium chloride chlorine.",
                    "label": 0
                },
                {
                    "sent": "And then I can put a configuration gate over the top of it and use this to set the doping of the transistor.",
                    "label": 0
                },
                {
                    "sent": "What happens is if I put a positive bias on this I push all the positive ions down right to the.",
                    "label": 0
                },
                {
                    "sent": "The channel these induce electrons, so I effectively dope the channel with electrons so I can make an end channel FET.",
                    "label": 0
                },
                {
                    "sent": "Or I can reverse the bias in the Peach and on the configuration Gate gate, drive the ions in opposite directions and induce holes and make up effects so I I can take the same one.",
                    "label": 0
                },
                {
                    "sent": "I can turn it into an end channel Fet Oropi channel FET and I can test the test.",
                    "label": 0
                },
                {
                    "sent": "The transistor transistors behavior and I show here just this common source characteristics.",
                    "label": 0
                },
                {
                    "sent": "Maybe for electrical engineers you might be used to this one drain current versus drain source voltage and you see the device coming up and saturating.",
                    "label": 0
                },
                {
                    "sent": "The device I showed you in an earlier one had a characteristic that was pretty linear.",
                    "label": 0
                },
                {
                    "sent": "Over this we see actually we get saturation because we're able to dope these things up.",
                    "label": 0
                },
                {
                    "sent": "In the Contacts are no longer a big problem, but this gives us a tremendous flexibility now in terms of making devices, I can make PN junctions.",
                    "label": 0
                },
                {
                    "sent": "It turns out I don't have to position this gate up at the top.",
                    "label": 0
                },
                {
                    "sent": "I can push the position to the gate at the side and also get the ions to move so I can test the device at one doping level.",
                    "label": 0
                },
                {
                    "sent": "I can change the bias, tested it at another doping level.",
                    "label": 0
                },
                {
                    "sent": "I don't have to make.",
                    "label": 0
                },
                {
                    "sent": "End devices to try to work out all the effects of doping.",
                    "label": 0
                },
                {
                    "sent": "I can just dynamically in the same device one day tested is this this with this particular behavior 1 one day tested at another.",
                    "label": 0
                },
                {
                    "sent": "So this is a technology that's really taken us maybe about a year and a half to develop to understand how all the time constants for these dope these ions are, but I want to point out to you that we're not thinking of these as being part of the active device.",
                    "label": 0
                },
                {
                    "sent": "This is just to set the doping.",
                    "label": 0
                },
                {
                    "sent": "In order to test the device with the electronic gates.",
                    "label": 0
                },
                {
                    "sent": "So here I just show that these these same device can be an end Fedora P fit this.",
                    "label": 0
                },
                {
                    "sent": "Subthreshold slopes are not ideal yet, but they are 80 millivolts per decade, 100 millivolt per decade and very nice saturating device characteristics.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And finally I just show you our approach for doing that effect based on this kind of configuration.",
                    "label": 0
                },
                {
                    "sent": "We have this configuration gate.",
                    "label": 0
                },
                {
                    "sent": "We can dope the regions, the region at the drain making a very low contact resistance and dope.",
                    "label": 0
                },
                {
                    "sent": "This in the way we want to.",
                    "label": 0
                },
                {
                    "sent": "We put a conventional gate on the.",
                    "label": 0
                },
                {
                    "sent": "Transition metal deck job card tonight and then we can bias this on and off and this is the basic approach for making the tunnel fet of these materials and you'll see some things coming out this year on this particular device.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So finally I just say a couple things about Future Direct.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Since we're not the only people you know that this this particular die transition metal Die child cognize are receiving attention worldwide.",
                    "label": 0
                },
                {
                    "sent": "Many groups are working on these things.",
                    "label": 0
                },
                {
                    "sent": "This is an interesting result I find published last year at the International Electron Devices Meeting.",
                    "label": 0
                },
                {
                    "sent": "We're finding that when we grow these things, they will grow conformally on variety of things that grow on all kinds of substrates.",
                    "label": 0
                },
                {
                    "sent": "It doesn't turn out to be some kind of magic substrate that it takes for these things to grow on.",
                    "label": 0
                },
                {
                    "sent": "This is showing a transistor with a Silicon nanowire channel that was wrapped with a.",
                    "label": 0
                },
                {
                    "sent": "With Molly disulfide, that means when you get this device you can get on both the current through the Molly disulfide and the Silicon one, so you try to enhance the current.",
                    "label": 0
                },
                {
                    "sent": "Under the gate of the MOSFET and they were able to show this kind of technology bumping up the current in the they called the double channel MOSFET.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "People are now.",
                    "label": 0
                },
                {
                    "sent": "There's now three groups.",
                    "label": 0
                },
                {
                    "sent": "This is showing the first group to demonstrate good heterojunctions between.",
                    "label": 0
                },
                {
                    "sent": "Here, Molly disulfide and tungsten selenide, which grow nicely together.",
                    "label": 0
                },
                {
                    "sent": "When you are done grow.",
                    "label": 0
                },
                {
                    "sent": "This is still by mechanical exfoliation and contacting forming these junctions.",
                    "label": 0
                },
                {
                    "sent": "A signature for PN junction.",
                    "label": 0
                },
                {
                    "sent": "Suck PN tunnel junction.",
                    "label": 0
                },
                {
                    "sent": "Is this negative differential resistance?",
                    "label": 0
                },
                {
                    "sent": "So this is just showing you that the quality of the materials are coming up and so this this particular field is moving very rapidly in terms of.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Understanding and my last.",
                    "label": 0
                },
                {
                    "sent": "Technical slide here is just to say that I'm telling you today about the tunnel field effect transistor, which is only one of a number of mechanisms that you can use to get these steep transistor devices, and these are being worked out worldwide.",
                    "label": 0
                },
                {
                    "sent": "In the end in the center that I'm currently directing this so I have subthreshold swing here written and also have.",
                    "label": 0
                },
                {
                    "sent": "The term that gives you what the tunnel FET does for substantial soon, but you can also think of other things other materials affects that can be used to boost up the current one is to use ferroelectric or piezo electric gates such that at certain biases you can get a ferroelectric ordering, or a piezo electric construction that can increase your capacitance abruptly, and then use that to increase your charge as a function of bias.",
                    "label": 0
                },
                {
                    "sent": "So this is 1 mechanism that would apply to a lot of different.",
                    "label": 0
                },
                {
                    "sent": "Field effect transistors and another one that is receiving more and more interest is the idea that we can induce phase transitions electrically if we can.",
                    "label": 0
                },
                {
                    "sent": "Just.",
                    "label": 0
                },
                {
                    "sent": "For example, if we can change.",
                    "label": 0
                },
                {
                    "sent": "Transition metal Die Chalcogenide from a metallic phase to a semiconducting phase.",
                    "label": 0
                },
                {
                    "sent": "We can go from an on state to an offset by inducing this transition and you can imagine using inducing these transitions with with gates or double layers from ions and so on.",
                    "label": 0
                },
                {
                    "sent": "So these are.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Things that you'll find find happening in the future.",
                    "label": 0
                },
                {
                    "sent": "One acknowledge my group from this is from last summer Sarfaty Por was a lot of the transistor work you saw today.",
                    "label": 0
                },
                {
                    "sent": "Who along with you was doing a lot of the ion doping work with Professor Susan Fullerton and many others contributing to this.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Work so it's sponsored again by SRC and by DARPA went to acknowl.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Their support and then finally just leave you with what I hope you take away from this.",
                    "label": 0
                },
                {
                    "sent": "This talk is that more energy efficient transistors are really needed.",
                    "label": 1
                },
                {
                    "sent": "We're going to run out of circuit ideas and we're going to run out of achievable performance in the MOSFET in the very near term, maybe by night by 2028.",
                    "label": 0
                },
                {
                    "sent": "Most of all of the gains in terms of scaling will be over and the circuit gains are really losing.",
                    "label": 0
                },
                {
                    "sent": "Losing.",
                    "label": 0
                },
                {
                    "sent": "Fuck.",
                    "label": 0
                },
                {
                    "sent": "Effectiveness, so now we have another thing I want you to remember is that substantial swings must be lower than 60 millivolt per decade, so as you think about materials, if you can start beating.",
                    "label": 0
                },
                {
                    "sent": "If you can think of mechanisms that do this.",
                    "label": 0
                },
                {
                    "sent": "Place to be.",
                    "label": 0
                },
                {
                    "sent": "Materials are really everything.",
                    "label": 1
                },
                {
                    "sent": "All these new effects are being enabled by materials.",
                    "label": 1
                },
                {
                    "sent": "If we if we don't have these.",
                    "label": 0
                },
                {
                    "sent": "If we don't utilize these new materials, we're just not going to get there with set conventional something semiconductors and the best mechanisms are still wide open.",
                    "label": 0
                },
                {
                    "sent": "I'm here this week, so I would very much like to talk to any of you who want to bounce ideas off me or tell me about your work.",
                    "label": 0
                },
                {
                    "sent": "And with that I'd like to thank you for your attention.",
                    "label": 0
                },
                {
                    "sent": "So I have a question regarding their mobility.",
                    "label": 0
                },
                {
                    "sent": "When you have iron gates and introduce ions, you will worry about also mobility, right?",
                    "label": 0
                },
                {
                    "sent": "Yeah, so how is it?",
                    "label": 0
                },
                {
                    "sent": "I mean is it increasing or decreasing?",
                    "label": 0
                },
                {
                    "sent": "So I presume it will decrease the mobility, so aren't you concerned about that?",
                    "label": 0
                },
                {
                    "sent": "Yeah, I'm concerned about that, but right now we don't know how we don't have good models to calculate exactly what that does.",
                    "label": 0
                },
                {
                    "sent": "1st, in order to understand how the ion.",
                    "label": 0
                },
                {
                    "sent": "The coulombic effects of the ion really need to know how close it gets, how physically close and right now we don't have a good way to characterize how close the ion actually gets in the final position.",
                    "label": 0
                },
                {
                    "sent": "We know it comes up to the surface.",
                    "label": 0
                },
                {
                    "sent": "We can count calculated by density functional theory, where it might might line up, but we don't really know.",
                    "label": 0
                },
                {
                    "sent": "An electrolyte, as far as I understand, yeah.",
                    "label": 0
                },
                {
                    "sent": "So probably you could use.",
                    "label": 0
                },
                {
                    "sent": "We can talk about, yeah, I mean we have some ways of this thing.",
                    "label": 0
                },
                {
                    "sent": "The special dependence of these ions?",
                    "label": 0
                },
                {
                    "sent": "OK, and perhaps that can give some.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I'd like to talk about that.",
                    "label": 0
                },
                {
                    "sent": "So you haven't mentioned anything about the speed of or.",
                    "label": 0
                },
                {
                    "sent": "Let's say you can't measure speed with ionic gate, but have you tried to combine it with the classical gate to see what would be the spirit of your devices?",
                    "label": 0
                },
                {
                    "sent": "So the speed is going to be comparable to what CMOS can do, not so much higher.",
                    "label": 0
                },
                {
                    "sent": "The ions we were just using the ions here to dope the transistor, so we fixed.",
                    "label": 0
                },
                {
                    "sent": "We apply these external biases to put the dopants where we want and then the speeds are just what the electronic speeds are.",
                    "label": 0
                },
                {
                    "sent": "We just moving electrons in and out of the context, that's speeds are still.",
                    "label": 0
                },
                {
                    "sent": "CDT kinds of speeds so.",
                    "label": 0
                },
                {
                    "sent": "We don't have measurements of the speed at this point.",
                    "label": 0
                },
                {
                    "sent": "And I didn't show you any top gated devices yet in this result, and that's because some of them are in preparation right now for publication.",
                    "label": 0
                },
                {
                    "sent": "So you'll see some of these things in the coming year.",
                    "label": 0
                },
                {
                    "sent": "Thank you and other questions.",
                    "label": 0
                },
                {
                    "sent": "No, so I would like to thank you again.",
                    "label": 0
                },
                {
                    "sent": "Very much and welcome again when you will come to Sylvania.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you.",
                    "label": 0
                }
            ]
        }
    }
}