{
    "id": "aq7wswz373rxjft6mefljppzxzcqlhfd",
    "title": "Open educational policies and practices in the Spanish National Distance Education University: UNED Abierta (UNED OER programme)",
    "info": {
        "category": [
            "Top->Social Sciences->Education",
            "Top->Social Sciences->Society->Public Policy"
        ]
    },
    "url": "http://videolectures.net/open_education_gil_jaurena_educational_policies/",
    "segmentation": [
        [
            "I was appointed as a director of this program last September, so it's only six months I have been working in this field so specifically and is in this position.",
            "I would like to explain about what we do and what is my my analysis or my reflection after this this month."
        ],
        [
            "And 1st, it's just some context information about on Earth.",
            "Do you know on Earth?",
            "Yeah, well, that is the largest Spanish University is it was the first distance University in Spain we we celebrated our 40 years quite recently.",
            "We have at the moment more than 250,000 students in our different programs.",
            "We offer undergraduate programmes, postgraduate programs, PhD programs and also continuing education programs which aren't.",
            "I think this only happens in Spain.",
            "It's like non official programs and these are some of these.",
            "Continuing education programs are the only ones that are really open, so they don't require access.",
            "Previous studies, so we are different from open universities in other countries.",
            "The thing is that.",
            "Their reflection about about books specifically from distance education universities is.",
            "Different to the reflection from a traditional universities and this is something I had the opportunity to share with other order.",
            "European distance education universities because it is in our social mission to provide higher education to everybody regardless where they live.",
            "If they are working or not, they ate.",
            "So in some sense the develop of Moocs or open courses?",
            "It's quite natural.",
            "The reef of open or distance education universities.",
            "But at the same time, it sometimes it's more difficult for us to change, especially in universities that are not knew, like us like ours.",
            "And yesterday they called a colleague from Mexico was defining her University as a Dinosaur.",
            "Well, we call ours our elephant, so it's almost the same, so it's difficult to change the minds and provoke awareness of the necessary shift towards digitalization and towards openness.",
            "But in our University we have been producing Oy are maybe not not so cold or ER, but at least free resources and sometimes open license resources since the beginning because we have created a specifically or the salt content in our media production Center for instance, we have a weekly weekly programs in the national TV television Espanola produced by a net.",
            "And also in the radio broadcasting.",
            "We also have Open Access scientific journals and I was involved in the project.",
            "Previously this position I was in the publication Department in editorial units an we promoted the digitalization of our scientific journals to Open Access journals also.",
            "And we also have an institutional repository with scientific documents, like in doctoral, dissertations and papers, and so on.",
            "We also produce a video lessons or video classes by Professor Self Self produced not professionally produced like previous ones in the Media Center production but self recorded classes sometimes.",
            "Some of them are, oh, you're so freely and openly available.",
            "On a specifically, the Open courses month by owner Roberta."
        ],
        [
            "Well, whenever there is a very recent Department or program it was created in 2012 and the idea was to make visible all all those previous oers Ann to coordinate directly coordinate the open courseware, which was the first open course experience like in many other places, items, University content, an.",
            "The marks on the main motivation to create this specific program was Marx was a.",
            "It was created to launch a set of of marks in 2013 and now the Navigator is located in the base electric for continuing education and lifelong learning.",
            "Previously a open courseware Ann and also navier to was located until last September in the vice Rectorate for technology.",
            "I think this is an important shift an to me because I'm also a professor in the Faculty of Education.",
            "That was important to to include open courses within the frame of lifelong learning programs.",
            "Um?",
            "And I said I was saying we will directly manage the monks open courseware on iTunes University.",
            "An hour website in Sen tended to be also like a portal to exceed all the other oers.",
            "This is a project yet because the MC's are like consuming all the energy.",
            "It's the fashion thing an A.",
            "People dim and a demanders to work on mocks more than in any other thing, but to me that the project to be to have a good browser for all the Oh yeah, it's an important partner.",
            "I hope me or someone else at University can develop.",
            "The.",
            "The values or the roots of the project are those the same as in the University itself.",
            "I would say an.",
            "It's the access facilitate access to higher education to quality content.",
            "A and also open NIS as the colleague before.",
            "What do we mean by open?",
            "Well, we have different degrees of open things an I think the awareness on a debate on licensing is yet needed in.",
            "At least in our University."
        ],
        [
            "This is the well, the site we are.",
            "Designing a new one, but it's still not visible.",
            "Well, as you will see there is the bibliotecas, the library multimedia, all the video and audio visual content we have announced Channel Canal North where all our radio and TV programs are.",
            "Are available."
        ],
        [
            "And this is our open courseware site."
        ],
        [
            "The iTunes University and here we have.",
            "A very different kind of contents.",
            "They are not exactly courses but collections.",
            "For instance, we have a recorder, conferences or seminars and you can.",
            "Check all the cereal in the.",
            "In the items University.",
            "Collection"
        ],
        [
            "Anne.",
            "This is the mocks a website.",
            "At the moment we we only have two marks running now, but the next week so you won't find that information anymore."
        ],
        [
            "Um?",
            "Our mocks A they were.",
            "Prepared since the end of 2012 and launching the beginning of 2013.",
            "Anne, this movement in a Spain and also on Earth was made like very fastly.",
            "So now we are learning many things about how we should do things and how we shouldn't.",
            "I maybe some of you know media attacks which is also another platform in Spain which has a most from many different universities.",
            "We also had our courses in that platform in the 1st edition.",
            "And those were also then very rapidly so they the urgency or they needed at that moment was to be there quickly.",
            "To me now the situation has been more to stop, stop bit to see what we have done.",
            "To consider the good things and the bad things, and to establish more internal procedures at net, specially to control the quality to take care of the quality also.",
            "And well, our marks they would be qualified at Xbox so more based on information transmission, mainly with videos an we have an automatic text test for assessment and also peer assessment with.",
            "Activities to be to be advised by peers.",
            "Um?",
            "It's true that each course is different because the professors that have created the courses.",
            "We had 22 courses in the 1st edition.",
            "They were volunteer volunteer to prepare that.",
            "So they were very motivated to experiment.",
            "That was the main motivation for them to participate in the project.",
            "Some of them prepared or reused.",
            "Alot of video content materials so they were more content focus.",
            "Some of them wanted to experiment with social interaction so you see more the communication tools inside the platform, the forums and debates and also social network.",
            "For instance to be have an impact on Twitter.",
            "But we couldn't have a like a standard similar for everyone because we respected the flexibility.",
            "So each professor could suggest different things.",
            "Um?",
            "Well, we have used our own platform for that, which is the the one we have is simply an there were different certification options.",
            "We have used digital budgets, those like Mozilla budgets but this is not very popular in Spain.",
            "That is not very well known.",
            "So any student who finished the course could get the badge but not not all those that finish the course requested for the batch.",
            "OK, and also we had two different paid certification certificates.",
            "One was just the certificate of Accomplishment and the other one required to go to one of our regional centers and to take an exam there.",
            "OK."
        ],
        [
            "This is an example of one of the of the courses with the the interface."
        ],
        [
            "Some some figures in general.",
            "Where to?",
            "A well specially in the mugs we had.",
            "A.",
            "Very big impact.",
            "I think for us they well we are talking about two more than 200 registrations.",
            "Some of them were the same as student registering two or three different books, but it's almost the same as the students we have in our regular programs, which is 250,000 students.",
            "And the perception of many professors was that they were the same students.",
            "So we were reaching our own students through the most.",
            "But it was not like that I have.",
            "I will show you the data."
        ],
        [
            "So some results.",
            "Well, the expectation about mocks is very big in general.",
            "An in our case, the number of people and also the impact in in media and TV and radio and newspapers we when mass media approaches us to have an interview to ask for information.",
            "Now the top topic is monks there and we have a very communication Department is always asking us for.",
            "For data.",
            "Also the internal demand.",
            "For instance, with the open courseware, not so many professors.",
            "We approached the that in that moment it was not gonna debate about the boys rectorate of technology to prepare an open course.",
            "But now we have more demand because it's more well known.",
            "The phenomenon an about the students profile.",
            "Well, it's very different in each course, but in general these are average.",
            "There are more women, they have higher education studies.",
            "Previously so we are not written.",
            "All the people but those with previous higher education, sometimes postgraduate programs and PhD programs.",
            "Anne.",
            "They profile we have not so many full-time students.",
            "We have many unemployed people.",
            "Annina Spain.",
            "You know we are we have live in a very difficult situation so.",
            "Many unemployed people are taking our books, so this this is satisfactory for us and most of them are Spanish.",
            "All our moves are in Spanish.",
            "And they are young people and they were not previous students at on Earth.",
            "We asked them if they were our students.",
            "If they knew units but were not students, or if they didn't even know our University.",
            "And the most most of them.",
            "They knew our University but had never studied with us.",
            "And the completion rates.",
            "And there are also many differences between courses, but the average from those registers, 70% begin or start the course from those on the hammer drill bit from those who start 20% complete from those to complete 20%.",
            "Ask for certification.",
            "In general they ask for the certificate of accomplishment, not the one that requires to go to center.",
            "To take an example."
        ],
        [
            "Well, some lessons learn.",
            "A well our main concern now beyond quantity to have many courses and the first ones to have courses that that was the concern with media attacks for instance.",
            "And with the first mocks at net.",
            "And now we want to take much more care of quality and in different sensitive pedagogical quality pedagogical design and also the technical quality is not the same to have self recorded videos than to have the videos recorded in our media professional center.",
            "So there are many details to be considered.",
            "I also a.",
            "Miss more institutional reflection about all this, and I think they mock phenomenon is an opportunity to reflect about openness in general within our University.",
            "But it's very difficult.",
            "I am having a lot of problems to promote this this reflection and I would like to like Robert has had workshops internal training but also the political debate.",
            "So we really.",
            "Stab Lish procedures and policies and support services.",
            "Clear then now now we are in a. I am very definition moment.",
            "We don't really know what will happen.",
            "Um?",
            "These are.",
            "Yeah, also in Maine, a concern, an effort, and we're doing some steps on this is the integration of O yaran hooks into the regular educational offer at North.",
            "It's important.",
            "And it's quite has been quite curious for me all the time that the open courseware, the audiovisual content, and all these are like parallel structures or contents.",
            "They are not in the mainstream.",
            "So now the effort is to be.",
            "Cross curricular thing to integrate.",
            "The open within our daily work at University.",
            "Um, also something we have a we have seen is that.",
            "Our books are open only during a period of time, but the students requested to get access to the content anytime.",
            "So we have the videos in.",
            "They are available at any moment.",
            "I also now the courses are closed.",
            "And also we are we have to analyze better, analyze the information about the profiles and learning analytics.",
            "How students perceive our courses.",
            "We have a more than 35,000 service that we are analyzing with some colleagues from the Social Science Department."
        ],
        [
            "I our future steps this last slide while our we are very focused on integration.",
            "So our future mocks.",
            "We are going to give priority to those proposals we received from Professor that are related to continuing education programs.",
            "Um?",
            "Two person curricular competencies, for instance those information management competence is provided by the library an also mostly linked to research projects.",
            "So it's another way of making possible the research results, not only in scientific forum, but to disseminate to a broader audience.",
            "And also we are going to prioritize, prioritize some courses that have a specific innovative proposal.",
            "Not the same thing, but.",
            "That they produce something new in pedagogically, methodologically in the assessment tools or whatever.",
            "And we are also working on the credit recognition of our mix into the regular programs.",
            "Both the official programs and continued education programs.",
            "And also the important thing is the in general not only focus on books, but promote O ER in a broader sense and not only the creation which I think it's the main thing that professor think about to create things, but we also want to promote reuse of things.",
            "Well made from our University and from other repositories or whatever.",
            "And also we collaborate with researchers, say inside unit an in Europeans projects.",
            "For instance, look it keep on reflecting on this, that's here."
        ],
        [
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I was appointed as a director of this program last September, so it's only six months I have been working in this field so specifically and is in this position.",
                    "label": 0
                },
                {
                    "sent": "I would like to explain about what we do and what is my my analysis or my reflection after this this month.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And 1st, it's just some context information about on Earth.",
                    "label": 0
                },
                {
                    "sent": "Do you know on Earth?",
                    "label": 0
                },
                {
                    "sent": "Yeah, well, that is the largest Spanish University is it was the first distance University in Spain we we celebrated our 40 years quite recently.",
                    "label": 0
                },
                {
                    "sent": "We have at the moment more than 250,000 students in our different programs.",
                    "label": 1
                },
                {
                    "sent": "We offer undergraduate programmes, postgraduate programs, PhD programs and also continuing education programs which aren't.",
                    "label": 0
                },
                {
                    "sent": "I think this only happens in Spain.",
                    "label": 0
                },
                {
                    "sent": "It's like non official programs and these are some of these.",
                    "label": 0
                },
                {
                    "sent": "Continuing education programs are the only ones that are really open, so they don't require access.",
                    "label": 0
                },
                {
                    "sent": "Previous studies, so we are different from open universities in other countries.",
                    "label": 0
                },
                {
                    "sent": "The thing is that.",
                    "label": 0
                },
                {
                    "sent": "Their reflection about about books specifically from distance education universities is.",
                    "label": 0
                },
                {
                    "sent": "Different to the reflection from a traditional universities and this is something I had the opportunity to share with other order.",
                    "label": 0
                },
                {
                    "sent": "European distance education universities because it is in our social mission to provide higher education to everybody regardless where they live.",
                    "label": 0
                },
                {
                    "sent": "If they are working or not, they ate.",
                    "label": 0
                },
                {
                    "sent": "So in some sense the develop of Moocs or open courses?",
                    "label": 0
                },
                {
                    "sent": "It's quite natural.",
                    "label": 0
                },
                {
                    "sent": "The reef of open or distance education universities.",
                    "label": 0
                },
                {
                    "sent": "But at the same time, it sometimes it's more difficult for us to change, especially in universities that are not knew, like us like ours.",
                    "label": 0
                },
                {
                    "sent": "And yesterday they called a colleague from Mexico was defining her University as a Dinosaur.",
                    "label": 0
                },
                {
                    "sent": "Well, we call ours our elephant, so it's almost the same, so it's difficult to change the minds and provoke awareness of the necessary shift towards digitalization and towards openness.",
                    "label": 0
                },
                {
                    "sent": "But in our University we have been producing Oy are maybe not not so cold or ER, but at least free resources and sometimes open license resources since the beginning because we have created a specifically or the salt content in our media production Center for instance, we have a weekly weekly programs in the national TV television Espanola produced by a net.",
                    "label": 0
                },
                {
                    "sent": "And also in the radio broadcasting.",
                    "label": 1
                },
                {
                    "sent": "We also have Open Access scientific journals and I was involved in the project.",
                    "label": 0
                },
                {
                    "sent": "Previously this position I was in the publication Department in editorial units an we promoted the digitalization of our scientific journals to Open Access journals also.",
                    "label": 0
                },
                {
                    "sent": "And we also have an institutional repository with scientific documents, like in doctoral, dissertations and papers, and so on.",
                    "label": 0
                },
                {
                    "sent": "We also produce a video lessons or video classes by Professor Self Self produced not professionally produced like previous ones in the Media Center production but self recorded classes sometimes.",
                    "label": 0
                },
                {
                    "sent": "Some of them are, oh, you're so freely and openly available.",
                    "label": 0
                },
                {
                    "sent": "On a specifically, the Open courses month by owner Roberta.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, whenever there is a very recent Department or program it was created in 2012 and the idea was to make visible all all those previous oers Ann to coordinate directly coordinate the open courseware, which was the first open course experience like in many other places, items, University content, an.",
                    "label": 1
                },
                {
                    "sent": "The marks on the main motivation to create this specific program was Marx was a.",
                    "label": 0
                },
                {
                    "sent": "It was created to launch a set of of marks in 2013 and now the Navigator is located in the base electric for continuing education and lifelong learning.",
                    "label": 1
                },
                {
                    "sent": "Previously a open courseware Ann and also navier to was located until last September in the vice Rectorate for technology.",
                    "label": 0
                },
                {
                    "sent": "I think this is an important shift an to me because I'm also a professor in the Faculty of Education.",
                    "label": 0
                },
                {
                    "sent": "That was important to to include open courses within the frame of lifelong learning programs.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And I said I was saying we will directly manage the monks open courseware on iTunes University.",
                    "label": 0
                },
                {
                    "sent": "An hour website in Sen tended to be also like a portal to exceed all the other oers.",
                    "label": 0
                },
                {
                    "sent": "This is a project yet because the MC's are like consuming all the energy.",
                    "label": 0
                },
                {
                    "sent": "It's the fashion thing an A.",
                    "label": 0
                },
                {
                    "sent": "People dim and a demanders to work on mocks more than in any other thing, but to me that the project to be to have a good browser for all the Oh yeah, it's an important partner.",
                    "label": 0
                },
                {
                    "sent": "I hope me or someone else at University can develop.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "The values or the roots of the project are those the same as in the University itself.",
                    "label": 0
                },
                {
                    "sent": "I would say an.",
                    "label": 1
                },
                {
                    "sent": "It's the access facilitate access to higher education to quality content.",
                    "label": 0
                },
                {
                    "sent": "A and also open NIS as the colleague before.",
                    "label": 0
                },
                {
                    "sent": "What do we mean by open?",
                    "label": 0
                },
                {
                    "sent": "Well, we have different degrees of open things an I think the awareness on a debate on licensing is yet needed in.",
                    "label": 0
                },
                {
                    "sent": "At least in our University.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the well, the site we are.",
                    "label": 0
                },
                {
                    "sent": "Designing a new one, but it's still not visible.",
                    "label": 0
                },
                {
                    "sent": "Well, as you will see there is the bibliotecas, the library multimedia, all the video and audio visual content we have announced Channel Canal North where all our radio and TV programs are.",
                    "label": 0
                },
                {
                    "sent": "Are available.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is our open courseware site.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The iTunes University and here we have.",
                    "label": 0
                },
                {
                    "sent": "A very different kind of contents.",
                    "label": 0
                },
                {
                    "sent": "They are not exactly courses but collections.",
                    "label": 0
                },
                {
                    "sent": "For instance, we have a recorder, conferences or seminars and you can.",
                    "label": 0
                },
                {
                    "sent": "Check all the cereal in the.",
                    "label": 0
                },
                {
                    "sent": "In the items University.",
                    "label": 0
                },
                {
                    "sent": "Collection",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "This is the mocks a website.",
                    "label": 0
                },
                {
                    "sent": "At the moment we we only have two marks running now, but the next week so you won't find that information anymore.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Our mocks A they were.",
                    "label": 0
                },
                {
                    "sent": "Prepared since the end of 2012 and launching the beginning of 2013.",
                    "label": 0
                },
                {
                    "sent": "Anne, this movement in a Spain and also on Earth was made like very fastly.",
                    "label": 0
                },
                {
                    "sent": "So now we are learning many things about how we should do things and how we shouldn't.",
                    "label": 0
                },
                {
                    "sent": "I maybe some of you know media attacks which is also another platform in Spain which has a most from many different universities.",
                    "label": 0
                },
                {
                    "sent": "We also had our courses in that platform in the 1st edition.",
                    "label": 0
                },
                {
                    "sent": "And those were also then very rapidly so they the urgency or they needed at that moment was to be there quickly.",
                    "label": 0
                },
                {
                    "sent": "To me now the situation has been more to stop, stop bit to see what we have done.",
                    "label": 0
                },
                {
                    "sent": "To consider the good things and the bad things, and to establish more internal procedures at net, specially to control the quality to take care of the quality also.",
                    "label": 0
                },
                {
                    "sent": "And well, our marks they would be qualified at Xbox so more based on information transmission, mainly with videos an we have an automatic text test for assessment and also peer assessment with.",
                    "label": 1
                },
                {
                    "sent": "Activities to be to be advised by peers.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 1
                },
                {
                    "sent": "It's true that each course is different because the professors that have created the courses.",
                    "label": 0
                },
                {
                    "sent": "We had 22 courses in the 1st edition.",
                    "label": 0
                },
                {
                    "sent": "They were volunteer volunteer to prepare that.",
                    "label": 0
                },
                {
                    "sent": "So they were very motivated to experiment.",
                    "label": 1
                },
                {
                    "sent": "That was the main motivation for them to participate in the project.",
                    "label": 0
                },
                {
                    "sent": "Some of them prepared or reused.",
                    "label": 0
                },
                {
                    "sent": "Alot of video content materials so they were more content focus.",
                    "label": 0
                },
                {
                    "sent": "Some of them wanted to experiment with social interaction so you see more the communication tools inside the platform, the forums and debates and also social network.",
                    "label": 0
                },
                {
                    "sent": "For instance to be have an impact on Twitter.",
                    "label": 0
                },
                {
                    "sent": "But we couldn't have a like a standard similar for everyone because we respected the flexibility.",
                    "label": 0
                },
                {
                    "sent": "So each professor could suggest different things.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Well, we have used our own platform for that, which is the the one we have is simply an there were different certification options.",
                    "label": 1
                },
                {
                    "sent": "We have used digital budgets, those like Mozilla budgets but this is not very popular in Spain.",
                    "label": 0
                },
                {
                    "sent": "That is not very well known.",
                    "label": 0
                },
                {
                    "sent": "So any student who finished the course could get the badge but not not all those that finish the course requested for the batch.",
                    "label": 0
                },
                {
                    "sent": "OK, and also we had two different paid certification certificates.",
                    "label": 0
                },
                {
                    "sent": "One was just the certificate of Accomplishment and the other one required to go to one of our regional centers and to take an exam there.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is an example of one of the of the courses with the the interface.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some some figures in general.",
                    "label": 0
                },
                {
                    "sent": "Where to?",
                    "label": 0
                },
                {
                    "sent": "A well specially in the mugs we had.",
                    "label": 0
                },
                {
                    "sent": "A.",
                    "label": 0
                },
                {
                    "sent": "Very big impact.",
                    "label": 0
                },
                {
                    "sent": "I think for us they well we are talking about two more than 200 registrations.",
                    "label": 0
                },
                {
                    "sent": "Some of them were the same as student registering two or three different books, but it's almost the same as the students we have in our regular programs, which is 250,000 students.",
                    "label": 0
                },
                {
                    "sent": "And the perception of many professors was that they were the same students.",
                    "label": 0
                },
                {
                    "sent": "So we were reaching our own students through the most.",
                    "label": 0
                },
                {
                    "sent": "But it was not like that I have.",
                    "label": 0
                },
                {
                    "sent": "I will show you the data.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So some results.",
                    "label": 0
                },
                {
                    "sent": "Well, the expectation about mocks is very big in general.",
                    "label": 0
                },
                {
                    "sent": "An in our case, the number of people and also the impact in in media and TV and radio and newspapers we when mass media approaches us to have an interview to ask for information.",
                    "label": 1
                },
                {
                    "sent": "Now the top topic is monks there and we have a very communication Department is always asking us for.",
                    "label": 0
                },
                {
                    "sent": "For data.",
                    "label": 0
                },
                {
                    "sent": "Also the internal demand.",
                    "label": 0
                },
                {
                    "sent": "For instance, with the open courseware, not so many professors.",
                    "label": 0
                },
                {
                    "sent": "We approached the that in that moment it was not gonna debate about the boys rectorate of technology to prepare an open course.",
                    "label": 0
                },
                {
                    "sent": "But now we have more demand because it's more well known.",
                    "label": 1
                },
                {
                    "sent": "The phenomenon an about the students profile.",
                    "label": 0
                },
                {
                    "sent": "Well, it's very different in each course, but in general these are average.",
                    "label": 0
                },
                {
                    "sent": "There are more women, they have higher education studies.",
                    "label": 1
                },
                {
                    "sent": "Previously so we are not written.",
                    "label": 1
                },
                {
                    "sent": "All the people but those with previous higher education, sometimes postgraduate programs and PhD programs.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "They profile we have not so many full-time students.",
                    "label": 0
                },
                {
                    "sent": "We have many unemployed people.",
                    "label": 0
                },
                {
                    "sent": "Annina Spain.",
                    "label": 0
                },
                {
                    "sent": "You know we are we have live in a very difficult situation so.",
                    "label": 0
                },
                {
                    "sent": "Many unemployed people are taking our books, so this this is satisfactory for us and most of them are Spanish.",
                    "label": 0
                },
                {
                    "sent": "All our moves are in Spanish.",
                    "label": 0
                },
                {
                    "sent": "And they are young people and they were not previous students at on Earth.",
                    "label": 1
                },
                {
                    "sent": "We asked them if they were our students.",
                    "label": 0
                },
                {
                    "sent": "If they knew units but were not students, or if they didn't even know our University.",
                    "label": 0
                },
                {
                    "sent": "And the most most of them.",
                    "label": 0
                },
                {
                    "sent": "They knew our University but had never studied with us.",
                    "label": 0
                },
                {
                    "sent": "And the completion rates.",
                    "label": 0
                },
                {
                    "sent": "And there are also many differences between courses, but the average from those registers, 70% begin or start the course from those on the hammer drill bit from those who start 20% complete from those to complete 20%.",
                    "label": 0
                },
                {
                    "sent": "Ask for certification.",
                    "label": 0
                },
                {
                    "sent": "In general they ask for the certificate of accomplishment, not the one that requires to go to center.",
                    "label": 0
                },
                {
                    "sent": "To take an example.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, some lessons learn.",
                    "label": 0
                },
                {
                    "sent": "A well our main concern now beyond quantity to have many courses and the first ones to have courses that that was the concern with media attacks for instance.",
                    "label": 0
                },
                {
                    "sent": "And with the first mocks at net.",
                    "label": 1
                },
                {
                    "sent": "And now we want to take much more care of quality and in different sensitive pedagogical quality pedagogical design and also the technical quality is not the same to have self recorded videos than to have the videos recorded in our media professional center.",
                    "label": 0
                },
                {
                    "sent": "So there are many details to be considered.",
                    "label": 0
                },
                {
                    "sent": "I also a.",
                    "label": 0
                },
                {
                    "sent": "Miss more institutional reflection about all this, and I think they mock phenomenon is an opportunity to reflect about openness in general within our University.",
                    "label": 1
                },
                {
                    "sent": "But it's very difficult.",
                    "label": 0
                },
                {
                    "sent": "I am having a lot of problems to promote this this reflection and I would like to like Robert has had workshops internal training but also the political debate.",
                    "label": 0
                },
                {
                    "sent": "So we really.",
                    "label": 1
                },
                {
                    "sent": "Stab Lish procedures and policies and support services.",
                    "label": 0
                },
                {
                    "sent": "Clear then now now we are in a. I am very definition moment.",
                    "label": 0
                },
                {
                    "sent": "We don't really know what will happen.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "These are.",
                    "label": 0
                },
                {
                    "sent": "Yeah, also in Maine, a concern, an effort, and we're doing some steps on this is the integration of O yaran hooks into the regular educational offer at North.",
                    "label": 0
                },
                {
                    "sent": "It's important.",
                    "label": 0
                },
                {
                    "sent": "And it's quite has been quite curious for me all the time that the open courseware, the audiovisual content, and all these are like parallel structures or contents.",
                    "label": 0
                },
                {
                    "sent": "They are not in the mainstream.",
                    "label": 1
                },
                {
                    "sent": "So now the effort is to be.",
                    "label": 0
                },
                {
                    "sent": "Cross curricular thing to integrate.",
                    "label": 0
                },
                {
                    "sent": "The open within our daily work at University.",
                    "label": 0
                },
                {
                    "sent": "Um, also something we have a we have seen is that.",
                    "label": 1
                },
                {
                    "sent": "Our books are open only during a period of time, but the students requested to get access to the content anytime.",
                    "label": 0
                },
                {
                    "sent": "So we have the videos in.",
                    "label": 0
                },
                {
                    "sent": "They are available at any moment.",
                    "label": 0
                },
                {
                    "sent": "I also now the courses are closed.",
                    "label": 1
                },
                {
                    "sent": "And also we are we have to analyze better, analyze the information about the profiles and learning analytics.",
                    "label": 0
                },
                {
                    "sent": "How students perceive our courses.",
                    "label": 0
                },
                {
                    "sent": "We have a more than 35,000 service that we are analyzing with some colleagues from the Social Science Department.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I our future steps this last slide while our we are very focused on integration.",
                    "label": 1
                },
                {
                    "sent": "So our future mocks.",
                    "label": 0
                },
                {
                    "sent": "We are going to give priority to those proposals we received from Professor that are related to continuing education programs.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Two person curricular competencies, for instance those information management competence is provided by the library an also mostly linked to research projects.",
                    "label": 0
                },
                {
                    "sent": "So it's another way of making possible the research results, not only in scientific forum, but to disseminate to a broader audience.",
                    "label": 0
                },
                {
                    "sent": "And also we are going to prioritize, prioritize some courses that have a specific innovative proposal.",
                    "label": 0
                },
                {
                    "sent": "Not the same thing, but.",
                    "label": 0
                },
                {
                    "sent": "That they produce something new in pedagogically, methodologically in the assessment tools or whatever.",
                    "label": 1
                },
                {
                    "sent": "And we are also working on the credit recognition of our mix into the regular programs.",
                    "label": 0
                },
                {
                    "sent": "Both the official programs and continued education programs.",
                    "label": 0
                },
                {
                    "sent": "And also the important thing is the in general not only focus on books, but promote O ER in a broader sense and not only the creation which I think it's the main thing that professor think about to create things, but we also want to promote reuse of things.",
                    "label": 1
                },
                {
                    "sent": "Well made from our University and from other repositories or whatever.",
                    "label": 0
                },
                {
                    "sent": "And also we collaborate with researchers, say inside unit an in Europeans projects.",
                    "label": 0
                },
                {
                    "sent": "For instance, look it keep on reflecting on this, that's here.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}