{
    "id": "aqglqy3f2rgvhlkgcdnuzxcya3euglym",
    "title": "Open Source Intelligence",
    "info": {
        "author": [
            "Clive Best, Joint Research Centre"
        ],
        "published": "Dec. 3, 2007",
        "recorded": "September 2007",
        "category": [
            "Top->Computer Science->Data Mining"
        ]
    },
    "url": "http://videolectures.net/mmdss07_best_osi/",
    "segmentation": [
        [
            "OK, good morning this morning I want to review an area which is become known as open source intelligence.",
            "Now there's nothing really new under the sun.",
            "This is web mining or text mining or data mining with a new name, but it's coming from the application end.",
            "When I first met the term open source intelligence, I thought it had something to do with open source software.",
            "But more and more in recent years we've heard this name bandied around and the JRC is being pulled in more and more into work into this area.",
            "So I thought it was a good idea to try to review.",
            "Open source intelligence, what it means and who's."
        ],
        [
            "Asking for it.",
            "I would like to acknowledge, of course, the people in my team Europe Media Monitor.",
            "That's the URL.",
            "But please don't all go to it because I will."
        ],
        [
            "Demonstrate it later.",
            "OK, so the program this morning.",
            "First, I want to sort of define what it what is meant by this term.",
            "Open source intelligence and also to emphasize it's not just about text mining and I'm going to actually give an example which is based on satellite data.",
            "Um?",
            "And then I'm going to go into a bit of a diversion, and I want to look at.",
            "UN try to understand the developments that have happened on the on the web.",
            "And in particular also this thing the dark web, which is what all the security agencies and police and everyone is trying to monitor.",
            "How terrorists have used the web in React.",
            "If you think about it, an organization like Al Qaeda couldn't really function without the Internet today.",
            "And then the main work will then review the whole air Web mining intelligence.",
            "And since we've been working now for four, actually longer than that.",
            "Um 4 five years on building the Europe medium on, I'm going to review how you do it, how you try to detect real time.",
            "News updates on websites.",
            "How you?",
            "Classify the data and how you cluster it.",
            "How you detect breaking news and so on.",
            "I want to review how AMM works.",
            "And other and other similar systems.",
            "And then move on then to how once you've collected all this information like we've collected for years of news.",
            "How you can analyze it?",
            "How you can mine information from it and how you can visualize information.",
            "And then finally I'm going to round off with a review of open source intelligence tools, which is more like web mining.",
            "Helping an investigator to find the information he wants and how to extract information and how."
        ],
        [
            "Process it.",
            "So.",
            "OK, this term really originates from the security services CIA and all the rest of it and.",
            "It started really because.",
            "Off the 9/11 was a complete shock to the old style intelligence world.",
            "If you read the 9/11 Commission report, there's a strong criticism of the way the intelligence community functioned.",
            "There was a failure to connect the dots.",
            "All the evidence was there.",
            "There was a plotted brewing, but they had not passed the information around and there was no one who saw the pattern.",
            "So this is all to do with agency secrecy, mistrust, elitism.",
            "And this all was supposed to change.",
            "The people who did understand the Internet and how to use it well, the terrorists themselves.",
            "And this was a big eye opener to the intelligence community.",
            "And there's this quote from John Arquilla, who's the professor in the Naval College.",
            "I think in Dartmouth or.",
            "Which is the fighter network like Al Qaeda.",
            "You have to behave like a network.",
            "But it's not just about the this open source.",
            "Intelligence is not just about law enforcement security services.",
            "The business world is woken up to it as well.",
            "This area of business intelligence.",
            "You want to find out what your competitors are doing.",
            "You want to know immediately when there's an earthquake in a in some town, which where you've got a factory or whatever it is, so there's this growing need.",
            "Also, in the business world for real time intelligence."
        ],
        [
            "So pre 911.",
            "As I said, they were closed and they remained relied on human intelligence and signal intelligence, which is called humid and segeant in this jargon.",
            "And classified material.",
            "And because it's classified, they can't share it with anyone.",
            "And then there was this realization that open source, if they had looked properly, they could have foreseen that there was attacks brewing just by looking at the propaganda sites of the various organizations.",
            "So this reassessment in the use of open source software open source, sorry, hope with source intelligence.",
            "And sharing intelligence between the agencies was was started and now now nearly every national agency plus police etc are actively monitoring terrorist activities on the Internet.",
            "I mean they are.",
            "That's why it's so easy for bin Laden to put a video out because they're all looking for it.",
            "Um?",
            "At the same time, the important this 24 hour CNN effect.",
            "The first Gulf War was the first war which was covered real time by by CNN.",
            "This changed the way everything works.",
            "the Internet itself, then the Internet.",
            "The growth of news reporting on the Internet during the 9/11 terrorist attacks.",
            "A lot of people were looking at the the Internet sites.",
            "Because they couldn't get through the Internet, sites actually crashed because there was.",
            "So everyone went there to find what was what was actually happening.",
            "So we've got this.",
            "This 24 hour rapid information flowing around the world.",
            "And there's now a sort of growing group of companies researchers were working in this area, which is called you open source software, open source intelligence, and in Europe.",
            "We've now got this year's inforum which started at the end of last year.",
            "Which brings together government agencies plus companies and researchers.",
            "And then the ISI conference is in.",
            "The IEEE Conferences for Intelligence Informatics have been running since 2004, and there's even a NATO Handbook on in open source intelligence.",
            "I which I found.",
            "And they native themselves run training courses on open source for for."
        ],
        [
            "For their stuff.",
            "OK, So what is it?",
            "Well.",
            "Open source information is the is the key thing is is basically data that's publicly available.",
            "It doesn't have to be the Internet.",
            "It doesn't have to be free.",
            "It needs to be publicly available.",
            "So it could be it could be a subscription service as well, but it's something that any member of the public could get hold of.",
            "Um?",
            "Open source intelligence then is proprietary intelligence recursively derived from open source information.",
            "Intelligence means an interpretation of the data.",
            "Collecting open source information, which is what the tools what the let's say the data retrieval aspect of it is to select, retrieve the right information for the application for the need.",
            "The target catalog.",
            "It, visualize it and disseminate it.",
            "Normally open source intelligence is the result of an expert who's analyzes the data that's prepared by a collection by a researcher, if you like."
        ],
        [
            "So.",
            "The three areas of intelligence, information, human intelligence, signal signal intelligence means phone taps, radio intercepts, whatever.",
            "And in principle it could also mean email intercepts.",
            "And open source intelligence, which is getting bigger and bigger."
        ],
        [
            "And importance.",
            "So who uses it well?",
            "As I said, the security services.",
            "Police law enforcement agencies are more and more getting involved.",
            "Um?",
            "And normal government organisations.",
            "They have a need to be kept up-to-date, informed of what's going on.",
            "That's why we built EMN.",
            "We built it for the European Commission because they they need to know immediately when there is some critical report about some Commissioner or when.",
            "What if there's some crisis brewing?",
            "They want to know immediately?",
            "Um?",
            "Then the situation centers the a lot of organisations for the African Union.",
            "This is they have a situation center and they're very interested in using our software basically to keep them informed about developments, news reports in Africa.",
            "Then the the United Nations in New York have got a 24 hour manned crisis room, which is continuously monitoring news reports, news wires coming in the World Health Organization.",
            "We're going here later about Medicis, which is a eleccion medical intelligence system trying to pick up the first reports about disease outbreaks.",
            "Even NGOs and relief agencies.",
            "They need to know when there's an earthquake.",
            "They want to be prepared for it, so there's a growing need for live information, targeted information to be brought to the right people.",
            "And large companies.",
            "The big business.",
            "If your oil companies, they all of them have a team of 20 up, sometimes up to 20 people who are continuously monitoring what's happening in wherever they have oil rigs where they have.",
            "Well, they have their main offices, but also they want to look at what the competition is happening.",
            "They need to be kept continuously up-to-date and this is normally they report straight to the board, so they're writing daily reports on that.",
            "Multinational companies are the same thing and then business intelligence.",
            "Things that can affect stock prices.",
            "Etc."
        ],
        [
            "So what is this thing intelligence?",
            "It's just a word, but in reality.",
            "Intelligence is always a report of some sort.",
            "It could be classified, but it's a report.",
            "Now that is derived from the information that's collected and the tools that help them can make that life easier, and it can handle more information.",
            "The other point is, it's not just a text report, it's just as like was just as important as a map.",
            "Or image imagery or data.",
            "And of course, the intelligence.",
            "Will be from classified an open source information, but the big advantage of open source.",
            "Intelligence is that you can share it with other people because it's not classified.",
            "This is a big boon for interagency collaboration, so if you're a police force in the UK, you can share this information with the French police force because it's not.",
            "Classified or let's say the security services so one one other advantage of the open source intelligence is that you can actually share it with other people, whereas this this close down of need to know doesn't really apply.",
            "Although of course the report might end up being classified even if it only is dependent on open source."
        ],
        [
            "Information, but that's another problem.",
            "So a typical agency.",
            "Or company, what do they do?",
            "So they have they have standard open source products.",
            "The first thing is a newsflash.",
            "Something happens and everyone in the company or everyone who needs to know should be informed by email or SMS messaging.",
            "So we have, for example, a system in Brussels which he does this.",
            "So there's someone there checking the news wires as they come in.",
            "It's not being updated live if there's something particularly important for a Commissioner or something that affects the Commission in some way, then they send an SMS message.",
            "Immediately.",
            "News flashing, so that's a sort of standard thing which of which companies and which organisations have governments?",
            "Then it's always the case that there's a daily briefing, so there's a.",
            "There's a standard product which is like a daily update on what's happening on what you're interested in.",
            "If you work for the Pharmaceutical industry, this would be like, say, a daily update on developments in the Pharmaceutical industry.",
            "So this is news military again.",
            "Situation update what is happening.",
            "These normally is sort of a weekly or monthly update on a crisis.",
            "So for example darfour or a rack.",
            "I mean just a summary of what's happened in that place every month or every week.",
            "And then, of course, there's the real emergent.",
            "There's this specific studies, so then you need.",
            "Let's say this this famous report, which is which is completely wrong.",
            "Of course, this Iraq weapons of mass destruction.",
            "So Tony Blair or somebody said we need, we need a report which proves or.",
            "Let's say we need a report that shows whether Saddam Hussein is building chemical weapons.",
            "So what do they do?",
            "They end up going through search engines.",
            "Google and the and the like.",
            "They may look in subscription databases which they've got, or they may subscribe to things like Jane's Defence Weekly and then they go and collect the information and they normally have a short time period.",
            "They gotta produce together this Intelligence Report."
        ],
        [
            "The people involved in this.",
            "Classic example is like a minister or a general or a commissioner aura, the head, the CEO of the company says I need to know I want to.",
            "I want to review of what's happened in this particular area and he talks normally to what's called the analyst.",
            "The analyst is the elite person in the security services or whatever.",
            "An analyst doesn't is supposed is the expert.",
            "He is the expert in the Middle East so he knows or supposed to know he or she is supposed to know.",
            "Everything that there is to know about the, let's say, the Palestine.",
            "Israeli Palestine conflict.",
            "So he has access to classified information, but then he goes to his assistant.",
            "Let's say the research is open source intelligence researcher who is either collected information already or is then tasked to collect the information and he uses tools.",
            "And that's where we fit in here.",
            "So we are basically the technical data mining tool builders."
        ],
        [
            "And OK, this is a slide which says basically that the analyst job is very tired and he's got any can only handle at maximum 200 reports today, although he should really be reading 10,000 that a day.",
            "And if of course if you include the Internet then the whole thing explodes and he can't cope with the flux of information that's arriving.",
            "But that end they tend to do the following, which is to read is to extract information from a report, and sometimes they build a link analysis system.",
            "In this case, this is a piece of software which a lot of police forces and intelligence agencies use.",
            "It's called analyst notebook.",
            "So they do this by hand basically.",
            "And then they."
        ],
        [
            "Find the right there report.",
            "There's a cycle to list, which is the the task to do.",
            "It they collect the data you process the data, you analyze the data and then you write your report and this."
        ],
        [
            "Laminate it.",
            "Did you break that down further?",
            "Collecting information well nowadays you really need to have multilingual information, so perhaps you need some machine translation software.",
            "So you need to collect data.",
            "Obviously you're going to use a search engine.",
            "There's no point in trying to reinvent the wheel.",
            "The best search engines are the commercial search engines.",
            "Google and the like.",
            "You may want to crawl now if you want to target if you want to look at a particular website, let's say some terrorist group or some extremist group, you will want to just look at that site now.",
            "You might want to crawl and bring back all the documents from that site.",
            "News feeds of course.",
            "Now in the area you're looking for, you don't want to get all the news you want to get a specific you want to have specific news on a specific.",
            "Organization or specific place or whatever country or whatever it is, so you need targeted filtered news.",
            "When you process the information.",
            "You may have thousands of documents, so you want something that will extract information you want to extract the entities.",
            "You only extract names, organization, phone numbers.",
            "The like bank account details and so on.",
            "You want to extract information about the where the place is.",
            "So Geocodes Geo locating the information.",
            "And you want to basically, if possible classifier so cluster into topics.",
            "Then you want to analyze OK, so once you've done that, you want to kind of analyze that.",
            "So then there comes in with link analysis.",
            "Relationships between entities.",
            "Why are these two people mentioned in the document?",
            "If you can have some software which will tell you oh they're actually married, if that can be done automatically, then that's going to help you alot.",
            "Geo linking means geolocating documents, so you can put it on to GIS systems.",
            "Trend analysis is seeing how things vary overtime and statistics.",
            "And then maybe you want to visualize all that stuff on Maps or whatever.",
            "And finally, in this world of open exchange of information in this security services, then they would like to collaborate on sharing information with other agencies."
        ],
        [
            "So what is I mean really?",
            "the Internet is the most important source of information, and it's growing and we're going to look at that.",
            "We're going to review that area in a minute.",
            "Subscription services they there are.",
            "These may big aggregators of information.",
            "LexisNexis is a famous one.",
            "The news agencies themselves, of course, will give you their wires if you pay them.",
            "Factiva is a large, also a large repository aggregator of news and more.",
            "Now recently they're also having web content.",
            "Dialogue BBC monitoring they have a team of people that's watching the TV across.",
            "Across the world and writing transcripts.",
            "Trying to review what's happening.",
            "Jane's Defense Weekly is A is A is A is a subscription service for updates.",
            "They also have updates on terrorism and so on.",
            "And the other strange one is commercial satellites now.",
            "If you need to know how the Iranian nuclear program is going, you can go on the Internet with a credit card and you can buy a high resolution satellite data, which seems a bit.",
            "This is almost like.",
            "Spy military spy satellite data from.",
            "From five or ten years ago, but today you can actually buy this stuff because it's quite expensive, but you can.",
            "You can.",
            "Look at that as well and then geospatial data providers if you need Maps and so on.",
            "So."
        ],
        [
            "This is saying.",
            "But this is this is repeating the same thing which is saying that OK.",
            "The other interesting point here.",
            "The source is of course it's very easy to do a search in Google and get hundreds of thousands of documents back, but.",
            "You need to.",
            "You need to be know the validity of the source.",
            "You one of the most important things is to find the sources that you trust that you find reliable.",
            "And often on a realm, the Internet, the information comes first and the information about the source comes second, which is the exact opposite to the human intelligence.",
            "For example, where you only trust information you get from this person, but on the Internet you kind of.",
            "You don't know whether it's true or whether it's a lie.",
            "And this whole thing now, rumor, falsities propaganda events are flying across the world in minutes.",
            "A good example of that was the Danish cartoon, so.",
            "There is a rumor or an accusation, and it spreads across the world in minutes.",
            "This is why the need to know fast is so important.",
            "Oh, there's another minefield of Copyright.",
            "What exactly are you can you do with information you've taken from the Internet?",
            "What?",
            "It's a very Gray area and it's something that that we have been struggling with as well because we are monitoring news reports.",
            "The whole legality of whether you can take information from the authored by somebody else who owns that information, it's a very Gray area.",
            "Google have gotten exactly the same problem, and they've been sued about it."
        ],
        [
            "OK, so it's not just about text, I wanted to give an example here which is actually taken from work in the JRC.",
            "Um?",
            "In these cases.",
            "Which is more to do with intelligence gathering on the Iranian nuclear program?",
            "This is work that we've been doing with the IAEA, which is basically in keeping people like Solana informed as to what's happening on the in that area.",
            "So this is the area image intelligence where.",
            "The first example here is.",
            "Again buying satellite data which you can do on the Internet, and this is actually a refugee camp and the the Office of Humanitarian Aid wanted to know whether they were over overpaying for the number of they were paying.",
            "Basically, to keep this refugee camp going, they wanted to know whether they were over."
        ],
        [
            "So they wanted to count the number of tents there.",
            "And then image analysis like this automated software which will go and identify these.",
            "These are this is the resolution of the imagery.",
            "Trying to identify the which tense.",
            "The count the tents.",
            "And basically.",
            "By enhanced by using pattern recognition software, you can find that the computer is recognizing individual tense here, which you can then count.",
            "And this is something that is a procedure that you can automate.",
            "And.",
            "This is an example, but you can also use it for counting houses in cities and so on.",
            "So that would form a important information derived from.",
            "Data which you've got off the basically bought on the Internet."
        ],
        [
            "The Iranian nuclear program is and is everyone is trying to understand whether they're building a bomb and so on.",
            "So they are monitoring.",
            "Thus the Americans and everyone else that continuously so.",
            "But here you can combine information you get from the Internet with satellite data.",
            "And in fact, the original whistle blowing on the on the Iranian program was done by a dissident group, which caught everyone by surprise, and that was done through the Internet.",
            "Data mining is by Umm and conventional search engines.",
            "Now, in order to of course you need to know about the nuclear fuel structure to understand what's happening.",
            "But IEA are very the course they need to know how far the Iranians are from having enough enriched uranium to build."
        ],
        [
            "Nuclear weapon.",
            "So.",
            "This is this is a site.",
            "This is the citanest behind where they're making uranium hacks fuel.",
            "And this gives you an idea of just how accurate this satellite data is, and here you see a new building that's being put up and they wanted to know what that was.",
            "And then."
        ],
        [
            "Lo and behold, if you search on the Internet in Farsi for the right information, we had a woman working with us.",
            "Who was Iranian, you find?",
            "Exactly that tower."
        ],
        [
            "This is on a site which in English.",
            "This is why multi language is very important.",
            "the English version of the same site of course doesn't have that link because they remove all the nuclear.",
            "And they remove all the nuclear information in the English version, but only in the Farsi version will you find it.",
            "The second example here would be.",
            "This is damage assessment during the Lebanon War, so we."
        ],
        [
            "We were asked to do a damage assessment for this for the donors conference in Stockholm, so again, you buy the data.",
            "You basically can task as satellite to give you in this case.",
            "Of course you don't want you have to have the data afterwards."
        ],
        [
            "And ideally you want to have the data satellite image before and after, and then you can do change detection.",
            "And this was data that was derived in Ispra, basically from from commercial satellite data which we bought.",
            "And we found out how many."
        ],
        [
            "Others have been damaged.",
            "Trying to automate the identification that this building on the right here has been bombed.",
            "This is very difficult actually.",
            "In three dimensions.",
            "To do a pattern recognition, but there is a change detection here is much easier from higher up because you've got a problem of parallax, so the satellite the camera on the satellite is not in exactly the same position in the two pictures, so you need to do a 3D pattern match before you can take, say that there's a change detection in."
        ],
        [
            "Image.",
            "And here we've got the the airport in Beirut.",
            "This is much easier to detect the bomb sites.",
            "It just shows how accurately Israeli bombing was because they hit every single intersection on the runway."
        ],
        [
            "OK, now before we get into the web mining techniques and so on, I thought it would.",
            "I'd like to review the web.",
            "Now I think we all think we understand the Internet, but it's it's."
        ],
        [
            "Well, when you realize just how.",
            "New IT is.",
            "If you think of communication.",
            "This is a diversion for about 15 minutes.",
            "In the 1920s they, the phone was invented.",
            "It basically it's still the case that today people don't have phones.",
            "The mobile phone revolution was the one that brought phones into Africa.",
            "The the phone took.",
            "A very long time before it was brought before it was adopted, but worldwide and it has a particular thing.",
            "It's a point to point connection.",
            "It's basically you can talk to somebody at a distance.",
            "That's all it is.",
            "The next big revolution would be say, broadcasting radio.",
            "Before the war.",
            "The radio.",
            "No one had a television, so the radio took off in a slow way.",
            "Television came.",
            "In took off from the 1960s and now everyone has a television, but it took, let's say, 3040 years before it diffused out into every home.",
            "But again, but the way the tell if that is important to realize the difference, the way we communicate in phone, we have a.",
            "It's a point to point connection, whereas broadcasting is one person decides the content and we'll sit there passively and look at it.",
            "And this is very good, easy to control.",
            "The government can control what is allowed on television etc etc.",
            "And so if you think of it before the web, it was very easy for governments to control what their people learned about.",
            "It was a.",
            "It's a very phones.",
            "It was easy to tap the phone if you didn't miss trusted someone.",
            "It was quite easy to go and get a phone tap.",
            "But the web changed all that.",
            "In I remember seeing the web for the first time.",
            "I think at the end of 92 somebody downloaded Mosaic from NCSA's website and we looked at it and the impact of that first view was incredible.",
            "I you saw immediately that there was something completely new here.",
            "Um?",
            "And the whole model of communication changed overnight, so now it was possible for you to publish information and you had a situation where many people could publish information and there was a lot of other people who looked at it.",
            "Um?",
            "So round about 1993 the web started to grow.",
            "I knew it had happened when I saw a URL on a London bus that was about two or two years later.",
            "Before that it was basically just University researchers in the Internet, but.",
            "Again, it's it was basically a passive thing.",
            "Web surfing, the term web surfing was basically people looking at other people's content.",
            "Few people were publishing.",
            "Then they say the E Commerce the e.the.net.com boom and bust they actually had already got most of the technology for ecommerce running, but why did it all go?"
        ],
        [
            "Lost.",
            "The real reason was because they didn't have the bandwidth.",
            "Now we talk about this new buzzword thing Web 2.",
            "But what is it?",
            "And you can read papers on the Internet which will tell you OK, web two is all about social networking.",
            "It's all about.",
            "Ajax let's say this new technology, which is actually just JavaScript.",
            "It was nothing new at all.",
            "Ajax for special clients like Google Maps, Google, Gmail and so on.",
            "And easy syndication RSS.",
            "There are three things that they kind of get lumped together in this web.",
            "Two connection, which is social network sites, RSS and Ajax.",
            "And all these things are nice."
        ],
        [
            "But really, that what changed is.",
            "What really changed was the widespread deployment of broadband.",
            "Because it only became possible at that moment for you to really get involved and publish yourself.",
            "So user user interaction on the Internet only really became feasible when broadband was in everyone's house.",
            "Today, there's about a billion users of the Internet.",
            "And and 80% of them have got broadband.",
            "So now is that.",
            "That's why now there's this sudden boom up in in the in the web again.",
            "An interesting fact there was a survey done in February this year, and to estimate how much data is on online.",
            "And we came up this this.",
            "This estimate, which was done basically by sampling various sites and doing a rough estimate came up with this figure of 1.6 * 10 to the 20 bytes, which is I believe, 1.6 exabytes.",
            "It's about 1000 million thousand.",
            "It's about a billion.",
            "Terabytes.",
            "Now it sounds a huge number, but if you think about it, Avogadro's number, which is 3 orders of magnitude bigger.",
            "Is the main number of molecules in one gram of hydrogen so.",
            "It puts things in perspective because if you wanted to, if you wanted to give the if you wanted to describe all those molecules in one gram of hydrogen gas, you'd need.",
            "Three, you'd need 6 numbers for each molecule.",
            "This is the position in the momentum, and so you'd have to end up with 18 * 10 to 23.",
            "So what we think is a huge number is is, uh is perhaps not as big as we think.",
            "However, it's growing."
        ],
        [
            "The other thing is that low the Internet is the information content is is growing was growing exponentially but it is still growing exponentially.",
            "But the number of web services also growing, so we have a different problem.",
            "It's not that there's all this information there, and it's now magically accessible.",
            "The real problem is that it's all spread over 100 million web servers and it's still we still have this number of 10 users per web server, and this is always roughly being the case.",
            "Even going back to the 90s, so we've always had this other problem, which is like 10 users per web service, so this is that's where this information jungle comes from, and This is why the search engines are so important, because we can never find anything.",
            "So.",
            "The web is only really usable because we have search engines.",
            "And the web is evolving now to to active."
        ],
        [
            "Phishing by users.",
            "This explosion in user publishing is through these social network sites.",
            "These are some numbers.",
            "120 million clips viewed on the YouTube soday.",
            "Um?",
            "The blogs the sudden.",
            "Massive Rise in blog publishing.",
            "This is measured by this site.",
            "Technorati, which is like A blog and blog search engine.",
            "Is interesting also to see where.",
            "Who's publishing?",
            "If you look here, the Japanese seem to be publishing as much as the Americans as much as all the English put together as Americans and British.",
            "So it's not.",
            "It's not a European or Western phenomenon.",
            "the Internet is exploding in China at the moment.",
            "And soon there will be as many Internet users in China as there are in the rest of the world."
        ],
        [
            "Again, this is this is this is just showing how when something happens, if there is a crisis or news crisis, there is some this flux of blogs.",
            "So if you really want to mine opinions or mine information, perhaps we should be looking at blogs so.",
            "This is this.",
            "The top one there I believe is.",
            "This is the.",
            "This spike here is the Lebanon War, so there was a huge spike in publishing of information about that now.",
            "Agreed that a lot of blogs are junk.",
            "Now if you can find the key ones of the guy who's actually in in Beirut.",
            "That is the one you need to find."
        ],
        [
            "This is just an interesting statistics on on Wikipedia.",
            "Publishing.",
            "Maybe maybe the knowledge base is getting full because if you see these, these are the number of these are total articles in different languages, so this is English.",
            "Now this is all sorry this is English.",
            "I think this is French and.",
            "German, this is.",
            "It's a German is the is the most second most published pages and French is the yellow.",
            "Is it?",
            "Yeah.",
            "So, but they're falling over, so maybe Wikipedia is getting full."
        ],
        [
            "A lot of this work actually is being monitored by a group in the GRC is looking at social.",
            "The impact of the social impact of the Internet.",
            "So I'm getting a lot of this information from this group.",
            "This shows really says cultural variations.",
            "It's interesting that.",
            "The Japanese, although they publish a lot of blogs, they're rather hesitant about putting their pictures up.",
            "This could be a cultural difference, so the Japanese actually don't put many photos or don't put many videos up.",
            "Malaysia, for some reason is the highest publisher of videos and.",
            "And photos and you see, there's a.",
            "The other thing is that the social network sites.",
            "There's a huge variation in which sites are the most popular.",
            "So Facebook is the most popular in America.",
            "Um?",
            "But awkward in India and in South Africa in South America seemed to be so.",
            "There seems to be some sort of regional preference for different social network sites."
        ],
        [
            "Of course, this this this graph just says what's obvious that today's geeks are tomorrow's.",
            "Um?",
            "SoC leaders so this change in is going to be permanent.",
            "In other words, that the change to the Internet being used as a publishing system by everybody is a permanent change."
        ],
        [
            "Edge.",
            "And it's very of course this thing about the Internet for the for governments is a nightmare because they can't.",
            "They can't control it.",
            "It's impossible to censor it.",
            "So now we move into the dark web, which is like the evil part of the Internet, where we find all sorts of.",
            "Difficult things.",
            "This is where the terrorists hang out.",
            "Let's say.",
            "So we've got things like racist and extremist propaganda.",
            "It's very.",
            "There's nothing to stop you.",
            "Publishing what you like.",
            "I mean, of course there is and there are laws in different countries, but it's very difficult if you anonymize the way you publish it and you use an offshore web hosting service for the government for let's say the police to get you."
        ],
        [
            "Al Qaeda couldn't operate without the Internet basically, and it's a very good propaganda tool for them they.",
            "Can walk over into.",
            "Pakistan and going to Internet cafe and pub."
        ],
        [
            "This video and they can communicate anonymously, so it's used for various.",
            "Purpose they the terrorists like say, all kind of use the Internet for various functions, commander control, communicating, propaganda, psychological.",
            "Let's say propaganda recruitment.",
            "Fund raising and they themselves are using it for data mining, because if they want to, if they want to find out they can use, go to Google Earth and find out if they want to sight out a target.",
            "They can find a lot of information about it."
        ],
        [
            "So at the same time that they are using the Internet, then government agencies are trying to find ways to to go back at them."
        ],
        [
            "So how do they use it for command and control?",
            "Well, they use it for the same advantages that we use it.",
            "It's very easy to communicate with someone on the other side of the world from some, let's say from the mountain top in back.",
            "It's done too.",
            "London is very easy, it's fast, it's secure, you've got global access, and it's fairly anonymous."
        ],
        [
            "Secure communication.",
            "Public encryption is available to anyone.",
            "You can encrypt your email and there's very little chance of you being able to have a.",
            "Of a intercept being able to decode that email.",
            "Um?",
            "So terrorist groups can be dispersed around the world.",
            "They can communicate on a daily basis and networks have a very much proven capacity to outperform high."
        ],
        [
            "Rock Hill institutions It supports this leaderless resistance.",
            "The itself is is a sort of.",
            "There's no central point in the Internet.",
            "the Internet is a is a amorphous communication network and the same thing for the.",
            "Terrorist groups?",
            "They can.",
            "It allows them to function independent of state sponsorship.",
            "You don't.",
            "I mean, al Qaeda doesn't need the Taliban anymore to maintain its operation ability operations.",
            "It can work on the Internet.",
            "They're pretty much, but involve removes the vulnerability to retaliation.",
            "the Americans can't go and bomb every Internet cafe in.",
            "In Pakistan, for example they, whereas when they were concentrated in training camps in in Afghanistan, they."
        ],
        [
            "Just a bit about secure communications.",
            "Cryptography.",
            "OK, you encrypt your messages, but you can't hide the fact that you've sent it, so you can still monitor in email traffic even if you can't read it.",
            "So this is this.",
            "Is it still possible to track messaging between two people on the Internet or by email?",
            "But the code Breakers got to discover the key basically before he can decode what's being written the other way.",
            "Another is stag steganography, which means you hide your message in an image.",
            "This is this goes back to Greek ancient Greek times, and of course the Internet is.",
            "So you place it in place your message inside some image you put it on a website anonymously and you can communicate to your.",
            "To the the salad and they they used."
        ],
        [
            "So these are some of it, but they're much simpler tricks if you want to be anonymous.",
            "These are tricks that have that have been used in the past.",
            "This this information actually is coming from an Israeli woman that was visited the JRC and gave us all this along introduction into this.",
            "So another trick, you open 30 anonymous email accounts on Hotmail.",
            "You change, you agree ahead of time that you're going to change email account every month you got 30 different passwords.",
            "You just change your email account and it's very difficult for the security services to understand what's happening or to follow it because.",
            "That's one.",
            "So you can send your email on public computers, in Internet cafes and it's very difficult for them to trace that communication.",
            "But there's an even easier way, which is you basically open an account on Hotmail.",
            "You send it, you draft an email, you save it in the drafts account, and the recipient on the other side of the world knows the access to the email account he logs in.",
            "He looks at the draft, and then he deletes it.",
            "Now this this is like a dead letter drop in your spy thriller.",
            "So this is impossible basically to track."
        ],
        [
            "But you could also have coded emails.",
            "The Mohamed Atta and his accomplice were basically exchanging email before 911 and talking and using code words for different for the targets."
        ],
        [
            "OK Internet cafes, as I've already said this this is a quote from one of the ideologues of al Qaeda.",
            "the Internet is a very effective tool.",
            "We use it to disseminate information quickly.",
            "People in Afghanistan go across the border and send email and now they can send.",
            "They can post videos of bin Laden."
        ],
        [
            "So on the tax though, what could the I mean?",
            "A lot of people worry about terrorists actually attacking the Internet.",
            "And so this goes under the name of electronic warfare and Hacker warfare.",
            "So the idea would be that the terrorist group would sabotage the Internet, bring down with a massive effect on the world economy.",
            "And then the cycle of the use of it for psychological warfare, ideology, etc.",
            "So a lot of there's a lot of people extremely worried and trying to protect themselves against attack."
        ],
        [
            "So how would they do that?",
            "Well, you need to disrupt the communication.",
            "You need to damage vital hardware.",
            "One thing about the Internet is it's designed to.",
            "It's exactly what it's designed to withstand.",
            "the Internet was came out of the DARPA program, so it was designed such that you could take out some links of the Internet.",
            "It would root itself around it.",
            "And these are some of the methods that you could use.",
            "You can.",
            "Electromagnetic pulsing odizor.",
            "Damage to vital Hartigan.",
            "Blow up.",
            "Or you could attack.",
            "You can send Worms hack hack into the.",
            "Into information systems and so on.",
            "But this is really what right now.",
            "I don't think myself that I mean why would the terrorist groups damage the Internet if it's so useful to them?",
            "I mean, it doesn't.",
            "I think a lot of the worries about specific attacks on the Internet infrastructure are over exaggerating there more that they do definitely behave in this."
        ],
        [
            "Mainly that area where they.",
            "They they.",
            "They perform that it's in the propaganda and the information exchange that they're really working.",
            "This is just an illustration of how recruitment happens and this is there is actually examples of this in.",
            "That there's a there's this forum.",
            "This this terrorist form Jihadi forum where you have an arm chair is not an active terrorist.",
            "He's basically going to the forum and he's he's picking up his posting and responding.",
            "He's he's talking to a some sort of idea.",
            "Log for the whatever it is and.",
            "The ideologue puts him in touch with the local operations guy.",
            "Who brings him together with other arm chair?",
            "She had his first fully connected a contact him, and he brings it out.",
            "Maybe send him on a rafting trip in the Lake District if you don't know the English to one and then you have your terrorist cell.",
            "And then they blow up some building."
        ],
        [
            "But the the psychological warfare.",
            "Aspect.",
            "When I finish this review, we're going to have a break.",
            "How terrorists manipulate public opinion.",
            "This is in Western."
        ],
        [
            "The boxes are very.",
            "What what does it mean?",
            "It means you're trying to disrupt or damage what a target population knows or thinks it knows about itself.",
            "Make it uncertain, make some get it.",
            "Unstable.",
            "But democracy is particularly vulnerable to that.",
            "Um?",
            "Because we allow opinions on different subjects, the true censorship is almost impossible on the Internet.",
            "We governments can't control what their citizens use.",
            "the Chinese have got this.",
            "This great firewall of China.",
            "They have team hundreds of people who are basically adding URLs which are blocked from entering the Chinese Internet.",
            "But of course they can't really control what is published inside China, so the growth in blogs etc.",
            "They can't check what is happening inside China.",
            "People are publishing.",
            "They can inject.",
            "They can only block external sites.",
            "OK, they can close down websites that they don't agree with, but it's extremely difficult to censor the Internet.",
            "The other thing is it provides this forum for free speech without any accountability.",
            "You can say what you like."
        ],
        [
            "You can.",
            "You can you can tailor your messages to suit your audience in different languages.",
            "And there's this thing about the web which is weightless.",
            "It's it's very difficult to tell.",
            "The authority of the person or the site that you're looking at.",
            "So the website of the terrorist group can appear just as valid as that of a serious news agency."
        ],
        [
            "So this was a this is a website which is now banned in the UK.",
            "Which looks a bit like a news site and you might and people you might be fooled into thinking that this is some."
        ],
        [
            "Authoritative news site.",
            "So what countermeasures our people are?",
            "The are being taken to counteract this.",
            "Well, there are active and passive.",
            "Attacks to disrupt the terrorist electronic network.",
            "Active tag attacks would be actually to in.",
            "In fact, their computers with a with a virus, basically.",
            "You if you can put a virus on the on the someone's computer, then you can basically track what they're doing.",
            "It's a bit like a phone tag, so you go into someones house.",
            "You you put a bug in their phone and you listen to the phone.",
            "The same thing is true for a computer.",
            "If you break into someone's house and you infect their computer with a virus, then that virus can sit there and it can send back regular email to you whenever they connect to the Internet.",
            "Saying or let's say they can transmit the information of what they've been doing.",
            "This is the.",
            "So these passive attacks will monitor the emails and transfer the data and watch the traffic patterns.",
            "And that is going on."
        ],
        [
            "So the implications of all this is that there is this huge surveillance effort going on in most most national.",
            "Security services, or, let's say most national police forces have got a team of people who are basically.",
            "Surveillance monitoring the Internet.",
            "There are some very good jobs to be had for hackers actually in these security agencies.",
            "So if you're a good hacker, you can write viruses.",
            "They will give you a good job, because that's exactly what they're looking for.",
            "Passive monitoring and data mining.",
            "So this passive monitoring and data mining tools are much in demand so.",
            "That's why the tools that can do data mining on the Internet are becoming important, and there's a big market for them and."
        ],
        [
            "That is now I'm going to move on for the second part of the talk to more technical web mining and review how you monitor the Internet with news, but I suggest we take a 5 minute break.",
            "OK, I think I'll stop.",
            "So now I'm going to go into the technical details of web mining.",
            "For real time news.",
            "And I learned out early on Tuesday last week.",
            "This is actually data stream mining 'cause the news is a stream of information that's continuously flowing through the system and you're basically trying to extract information, categorize it according to that flow of news that's coming through your."
        ],
        [
            "Of course, there's not just news that you sites that people want to monitor.",
            "That is, blogs and maybe, as I said earlier, you probably want to crawl up specific site so there's real time news monitoring, blog monitoring, site crawling, and a much more simple thing is just keep a watch on a specific web page and just tell me when it changes."
        ],
        [
            "So what is the basic problem with news monitoring?",
            "What are you trying to do and what are the difficulties?",
            "Well, in an ideal world you would want to check what you want from a system which monitors the news is I want only information from my reliable news sources and in articles that I'm interested in and are in my own language or my own 3 languages.",
            "Then Alert me when something happens in the area that I'm interested in.",
            "And then Alert me when something huge happens.",
            "So if there's a huge story, I want to know about it.",
            "So the ideal news monitoring system would.",
            "Continuously check for you send you updates on anything that happened to be of your interest.",
            "Alert you when something big happened in your area and also Alert me when something enormous happens.",
            "So we've got.",
            "We've got 4 problems.",
            "You've got an information retrieval problem.",
            "How to find that data?",
            "We've got.",
            "A real time problem, so we have to detect that person's interests very fast.",
            "We can't afford to be.",
            "We can't afford to do this in seconds.",
            "We have to do it in milliseconds.",
            "We have a search engine problem because we want to let them find any any information they want.",
            "So we got to index the data.",
            "We've got to update the index and allowed to search it really fast.",
            "And then we have for the we have a breaking news detection problem, which means I want to detect those big stories.",
            "The massive story I don't know ahead of."
        ],
        [
            "Time what it's about.",
            "It's on the news mining landscape.",
            "What there's been a lot of interest in this area over the last four or five years and.",
            "We got sort of three.",
            "We got this sort of landscape, which I drew.",
            "You've got various players in there.",
            "Moreover, Moreover, is and is a content provider.",
            "Moreover, monitor the websites and they provide a feed which you pay for and you get web news content.",
            "They really just doing the information retrieval aspect there, tagging the information, and then they're providing onto end users, one of whom would be, say, silent breaker.",
            "Who takes that further so you see, you've got a number of players in this world, including ourselves, which is the MM.",
            "And we try to do everything we try to extract.",
            "We try to retrieve the information we try to classify it.",
            "Do breaking news detection.",
            "We try to do everything.",
            "We've also got the big commercial players LexisNexis, the news agencies, and so on.",
            "They're all in this game as well.",
            "It's a big big business.",
            "And we have different levels of education as you go to the right.",
            "From just simply news portals going right through to data mining, social network derivation and as well here later on event extraction from news."
        ],
        [
            "An important thing about news, this flow of information is that people's attention span is getting shorter and shorter.",
            "They're not really interested in in the news from last week.",
            "In fact, very few of them are 9095% of people want to know what's happening now, so the attention span is really small.",
            "So whatever you're doing, you have to do it immediately.",
            "It's real time processing it's data stream mining if you like.",
            "And if you want to be effective, if you want to send alerts to people, you must do it immediately.",
            "So that's a, let's say the information extraction problem has to be really."
        ],
        [
            "Fast.",
            "There's other, if there's other characteristics of news which is unique to news.",
            "There's a weekly pattern of of publishing, and let's say if you're in France, most journalists are asleep at night, although some aren't, and you have a daily rhythm of news articles, which goes down, never falls to zero, of course, because there's people working at night.",
            "And so you have a daily pattern.",
            "Weekends, you have less news Friday afternoon.",
            "You tend to get less news because people are leaving work early or in the case in London.",
            "They are all in the pub but.",
            "The There's also a daily pattern of news, so normally from 5:00 AM onwards the websites are being updated with normal news, but then every now and again something huge happens and it can happen at anytime.",
            "And then there's a flood of news coming in.",
            "So you've got to be prepared for that flood of news which is a terrorist bomb attack or whatever it is.",
            "And then we got the different time zone problem.",
            "So although it's true for France that that there's this rhythm, if you take English, for example, you've got English news coming from the Asia, and so on.",
            "So you've got different flows of information from around the world, which is coming in, and you've got to cope with it.",
            "You don't need to update your.",
            "You don't need to check websites, you only need to check websites often that the ones that are being updated frequently.",
            "You don't need to check weekly news publications every 10 minutes because they don't get updated.",
            "They normally get daily once a day actually."
        ],
        [
            "So.",
            "Updated rapidly, we want to be multilingual because we want to have worldwide coverage with.",
            "We often have a problem with duplication because one news agency will publish an article which will be picked up by different websites and it will be a duplicant.",
            "Actually, the search engine problem on news is much simpler than the search engine problem on the web.",
            "The reason for that is that the page ranking problem is trivial.",
            "The only what people when you search for news.",
            "The only thing you're interested in is the time order.",
            "You don't want.",
            "You don't want to search in archive of news and find some article number one hit which was from 2 weeks ago.",
            "It's actually very simple, so when you search when you index news articles, you just have a time is the crucial thing.",
            "So when you bring back with search results you time order them.",
            "You might also want to rank them by source, so you want to trust the BBC more than another source.",
            "Um?"
        ],
        [
            "So the frequency of updates you need to check sites for updates every 10 minutes if they're being updated regularly, like the BBC or CNN.",
            "And there's a varying degree of that.",
            "So you need a directory of websites which allow it, which you keep, which keeps your.",
            "These are the sources that you want to monitor, and you want to have different up."
        ],
        [
            "Frequencies.",
            "Basically, you go to the website and you check for updates, which means that you're looking for new headlines on that site.",
            "We and other people use a method called scraping, now scraping.",
            "What does it mean?",
            "It means that we try to convert that headline page into XML format called RSS.",
            "Well, everyone knows RSS is is perfect for news.",
            "Blim arises because HTML is dirty and.",
            "In order to handle that, we want an automatic procedure which we can handle in milliseconds, so we ourselves are using XLT to transform X HTML into RSS.",
            "This is easy, so for every site you want to monitor, you want to produce a stylesheet.",
            "That stylesheet tells the software transformation how to convert the HTML into XML, which is RSS in this case.",
            "But the problem there is that.",
            "Web browsers are very.",
            "The web browser very dirty.",
            "I mean HTML is a dirty language.",
            "It's about how it looks on the page.",
            "It doesn't tell you anything about the content, so as such.",
            "And there's quite a bit of work involved into converting access to HTML to HTML.",
            "So what you do then is you keep a cache of the results for one website, which is an RSS feed.",
            "So for every every site you keep an RSS feed, and if there's a new item you append it to the to the end of the RSS feed, and then you process the text.",
            "Problem with the web that this method is that the excess LTS can change because the website changes, so you have a maintenance problem everyone has that problem who all the people who are monitoring websites regularly have this problem, but when they changed the design of the website it breaks the system."
        ],
        [
            "RSS get dates back to Netscape.",
            "Actually, it it was invented by Netscape when they used to have these things called channels, so the first version of RSS was called.",
            "I think it was.",
            "Site syndication original meeting today.",
            "It really means really simple syndication, and it's basically.",
            "The minimum metadata you need for a news item.",
            "Basically it tells you the source BBC, in this case title, which is a headline and.",
            "Normally the link the URL that you that points to the to the web page that you are talking about and then the new story itself, which is a short description of what the text is."
        ],
        [
            "About now, the good news about RSS is that suddenly become very popular, which means that your life should get easier because websites are now publishing providing RSS feeds.",
            "So suddenly monitoring the news is becoming much easier because you all you need to do is to check their RSS.",
            "Feed every five minutes.",
            "It's and if there's a new item, you'll pick it up.",
            "But the bad news is that they are cheating on us because often the content that you get from the RSS feed is not the live content.",
            "They're basically trying to.",
            "If you really want to be.",
            "The most up-to-date you still have to scrape in many cases because the RSS feed can actually be delayed and in some cases we found it's delayed up to 24 hours, so you think you'll get your monitoring."
        ],
        [
            "News, but you're not.",
            "This is our system AMM, which is basically the consistent scrapes the webs keeps a directory of.",
            "The Directory of sites that it's monitoring, and then it detects new articles and IT process it through our alert system.",
            "It indexes it, indexes the.",
            "Let's see.",
            "So.",
            "This is the scraper system is running 24 hours a day in multithreaded.",
            "Scraping of websites were monitoring 1200 websites.",
            "We are feeding in RSS caches of all the content of those websites.",
            "We are then going off a reading all the articles, pumping it through the alert system, indexing all the text, and we've got a breaking news detection system which we're going to talk about a minute and we go out and eventually we come out with our news brief.",
            "Now, if you want to have a peaceful life.",
            "In the MMR system is used by the European Commission and it is a they rely on it basically even at weekends all the spokespersons are relying on information that's being pumped to them by this system.",
            "Now if you want to have a peaceful life, you gotta make sure that it's fast and reliable, otherwise you're going to go in all the time and it used to happen to us.",
            "So we've paid a lot of attention in.",
            "In getting it to work as best as most efficiently as possible.",
            "Now we've tested our response against Google News and.",
            "We're not done with it.",
            "In 2004 we were at least one hour faster than Google News.",
            "Since then, we're about the same now in speed, that is.",
            "A bit more how the the software is working.",
            "So the scraper.",
            "This is the system that is keeping a cache of RSS feeds passes the information to the, grab it.",
            "So if there's a new article, if one of those websites a new articles published, this software will go to that website and extract the text from the web page.",
            "It will also bring in any news wires, so inside the Commission were also feeding news wire.",
            "Some Reuters AFP and so on.",
            "This will go in again in RSS into the alert system which is classified.",
            "Let's say this is the topic detection system which is detecting topics.",
            "It tags the content with the topics.",
            "It goes into a a system which is it is a filtering system which allows you to filter even more fine detail.",
            "And then it goes out to.",
            "Breaking news this system and indexing system for our search engine and it goes off to the News Explorer processing which you're going.",
            "You've heard about or will hear about, and then we produce a website.",
            "We produce our web interface.",
            "So we had some hard lessons to learn and basically this was a compromise between speed and efficiency.",
            "Now we've used cues to make things bad, things happen all the time on the Internet.",
            "Like a site will.",
            "Let's say there's a network problem.",
            "You need queues so that you don't flood your system.",
            "That processes don't stop, etc.",
            "So this is this illustrates really how I how are software or other people suffer.",
            "I think.",
            "Moreover, user similar technique will for example convert this BBC web page into an RSS feed.",
            "It will go in.",
            "And it will identify the headlines.",
            "This is through an X style sheet.",
            "It will pick up the short piece of text and.",
            "It will not pick up the menus.",
            "This is why crawling doesn't work OK. Why don't we crawl the website?",
            "The problem with crawlers is that they will pick up adverts.",
            "They'll pick up sidebars etc.",
            "We just want those headlines, so this is every website somebody looks at the website and they optimize the XLT so it will only pick up the news headlines.",
            "Then then we will follow the articles through this grabber software.",
            "It will go out and it'll read that text.",
            "And then there's a specific software which will extract just the pure text.",
            "Again, we have the problem that we don't want to index all this stuff at the side, so we don't want index related stories or let's say.",
            "This is this menu bar which will cause havoc with our classification system.",
            "So it is very important just to get the tech stuff.",
            "So then we we will detect.",
            "Keywords that we have cashed in our alert system and will try and classify that this article is really about Sudan.",
            "And it's we will detect 10th one of these 10,000 keywords in a .1 of a second.",
            "We have to be so we have to be.",
            "Our goal is to get the topic classification done in 100 milliseconds.",
            "Then we need to sort that out into one or more of 600 alerts, which alerts means.",
            "Alerts means that our topic like if you like.",
            "So.",
            "Our objective then, is the filters.",
            "Real time multilingual news.",
            "So multilingual is important here as well so that we have a topic which we can define in different languages now are.",
            "There's a whole area of research on topic detection and tracking, which is this DARPA program etc.",
            "Now topic detection in this context was really more related to the breaking news detection in our case or in many in the case of.",
            "Moreover as well.",
            "What we have done is to define predefined topics we have, for example, news about every country of the world.",
            "So it's not that we need to discover that there's a new topic about this country we have predefined.",
            "600 different categories which we are filtering news into.",
            "So for speed reasons we're using a finite state machine which is looking which is preloaded with these patterns, and then the text is being run through in parallel and the will pick up articles that are basically mentioning those keywords by weighted sums or Boolean combinations.",
            "This is really like fishing, so we define what we're looking for as an alert.",
            "We throw it in the River and we wait for a news item to come along and we find it.",
            "We pick it up, we throw it into our been our basket.",
            "So this is basically how topic RSS feeds are generated.",
            "All the news is flowing through and we throw it into baskets.",
            "A bit more detail what it looks like so.",
            "These are two examples on the 1st example we've got a Boolean combination.",
            "We can also have a proximity value, so we can say in this case that we want sustainable and energy to appear within 2 words of each other.",
            "So this is basically saying or three words of each other and we've got it in different languages.",
            "So our topic selection is multilingual.",
            "We support, I think we're managing about 30 languages.",
            "It's about 30 languages.",
            "The sites that we're monitoring, so we basically.",
            "Now these topics are predefined, so we need an expert too.",
            "How does we define these topics?",
            "We basically it's a trial and error problem.",
            "You have a human, he does it, he sets up.",
            "They set up an alert.",
            "We look at the results.",
            "We fine tune it according to whether you know there was a classic case of them.",
            "One of the commissioners was called burn David Byrne.",
            "I think his name was one of the he was a top guy in the Commission for working under Pro D at the time, but there was a lead singer of a pop group called David Byrne.",
            "It's I think it's.",
            "Talking heads so he was flooded with information by this this guy, which was not too happy.",
            "So we basically you need to fine tune your alert definitions to avoid embarrassment.",
            "But this is, this is basically the way.",
            "Ours and many other.",
            "Systems work.",
            "What's more related now to the topic detection, is this.",
            "Here if you think about breaking news, what is it you're trying to do?",
            "You're trying to detect the unexpected, so you don't know ahead of time what you're looking for, but something happens and you want to find it.",
            "So this is basically looking for changes in fluxes, changes in patterns of news.",
            "We have we have got two ways of doing this.",
            "This is the original way which was basically based on the idea that you've got a flow of information is like a River you've got.",
            "You've got flows of news.",
            "Coming through your pipe and suddenly you're looking for a pattern whereby suddenly a certain word is used much more frequently than than previously, so it's a it's a differential problem you're looking for.",
            "You're looking for a pattern whereby inside your news stories a new word appears and it's in our case, we decided to concentrate on capitalized words because it's always the case, and now it says bomb in Mosel or something.",
            "The word is, it's usually.",
            "Yeah exactly, we had.",
            "We actually tried.",
            "We've got this running.",
            "We have Germans another problem.",
            "So for that we still using.",
            "We're still using the capitalized word thing, but we have a much tougher problem with disambiguating noise.",
            "Let's I'm going to talk a bit about that.",
            "How that was done.",
            "The new system, which is I'm going to describe in a minute, avoids that problem completely.",
            "So this is the original system whereby we are looking for that sort of pattern.",
            "And this is completely this is this is this formula with a simple formula was developed basically.",
            "By we focused what we did is we took the the Bali bombing.",
            "This is going back into 2003.",
            "I think it was and we looked at the flight.",
            "We took that as our sample.",
            "We took all the news out about the Bali bombing and we tuned our algorithm such that it would pick that up, but it's suppressed.",
            "Other stories so that you got 2 problems with breaking news.",
            "You want to pick it up when it's growing, but you don't want to.",
            "Even if it stays remains a big story you don't want to flood people with it.",
            "So you need to have a thing that slowly decays and this is done because we're taking a.",
            "We're taking a rolling rolling average over, so we gotta figure here, which is like the rolling time average of occurrences of a monitored topic is means a keyword.",
            "Per hour, so this is this is George Bush.",
            "This is like the number of times I would expect to find Bush in the news per hour over the last.",
            "I think we take it over the three week.",
            "So.",
            "Now, if someone assassinates George Bush.",
            "Then suddenly we've got.",
            "Instead of having, let's say, let's say we expect to have ten articles an hour mentioning George Bush.",
            "But suddenly we get 1000 articles.",
            "Then we trigger that as a as a breaking news story.",
            "And but then we have another weighting factor.",
            "This beta is a language dependent factor just to bring to normalize the languages the.",
            "We we, we added, a factor which is basically saying that we insist on having.",
            "We wait things more when they come from different sources, so the more sources we've got, the more we believe it's a breaking news story.",
            "This is to avoid the situation where one I think there's an Italian newspaper who floods news articles on the stock market at a certain moment of the day.",
            "They flood the flood.",
            "The thing with new stories on stock prices.",
            "And of course we had our big problem then is the is the stop word problem.",
            "Like on Mondays the word Monday tend to appear on Tuesday is the word Tuesday appears, so there's a learning algorithm whereby you suppress the you have a stop word list which you removed from this calculation and that was that was tuned over a few months.",
            "And this kind of works fairly well now.",
            "This is basically picking up these are this is this function.",
            "And we pick up the main top stories.",
            "This is over.",
            "I think this is over some days and the first version was basically looking for these.",
            "These are the keywords that trigger those breaking news stories.",
            "Now, as well as.",
            "So this is basically monitoring the flux of news mentioning certain keywords versus time, and you're looking at the rate of change.",
            "If you're if you talk now about our topics are alerts.",
            "These are basically the subject areas that we are monitoring.",
            "This is like the OR your topic on the Pharmaceutical industry.",
            "You also want to be able to detect.",
            "Sudden stories inside your predefined topics, which is the same sort of story.",
            "You keep hourly statistics on the on the flux of articles that you're getting on each of the topics and.",
            "And so you want to measure, you want to be able to pick up this sudden increase, this is.",
            "This is an earthquake or something.",
            "This is a.",
            "Now this is the ferry disaster on, I think a ferry sunk between Saudi Arabia and Egypt.",
            "So this shows there's suddenly a flux of articles and you want to pick that up and tell people.",
            "So here it's it's basically a similar idea.",
            "You basically assume a normal distribution for articles per hour.",
            "You are the articles per day.",
            "In this case you are basically averaging that over a two week.",
            "And you have an expectation value for how many articles you normally expect on that subject for day.",
            "And you calculate the standard deviation.",
            "And basically, if so far that day you suddenly you have more articles and say I think it's about four Sigma for standard deviations.",
            "Then you trigger a red alert here and you can pick up the main topics that are happening live in different subjects and different.",
            "In this case different subjects in different countries.",
            "So this is statistical triggers on flux of news articles, so this is like keeping statistics on the article arriving per hour.",
            "Not going to be more about our new new.",
            "Version of the topic detection problem, which is real time clustering so here.",
            "We we we hesitated about using a clustering algorithm because we wanted to be absolutely sure that the algorithm itself didn't inhibit the time response because the thing about our simple breaking news detection was that it is really fast.",
            "We were monitoring 50,000 keywords but it still was a very quick and dirty way of picking up news.",
            "This one is a much more sophisticated way, which is to do real time clustering on the news as it's coming through.",
            "And we can with this new version we can also do news updates as well as triggering an alert when something happens.",
            "You can also trigger and second alert when it suddenly changes again.",
            "So this algorithm is being optimized over four months of of manual learning and checking through the articles.",
            "This algorithm works is like the like following.",
            "So we have a flow event of news coming in in each language.",
            "And we want to detect in that flow of news stories as they develop, and we want to detect sudden events.",
            "So we basically tokenized the the.",
            "Each article comes in.",
            "We tokenize the words and what we found is that we only need to keep the 1st 200 words of each article.",
            "It doesn't help you.",
            "In fact, it makes things worse if you take more.",
            "If you take the full text of a large article, it actually makes it worse.",
            "The problem gets confusing because the article will talk about something that happened three weeks ago as well, so that we already take the 1st 200 articles.",
            "We will then, uh, keeping a dynamic frequency count of words in each language, which means this is working in 18 languages, right?",
            "So for for Bulgarian or Hungarian, we're keeping a frequency count of words that appear in news articles, and we're updating that through a infinite responsibility filter every time we're getting new articles.",
            "So we're keeping a rolling count of how frequently words appear in text.",
            "In news and the thing about news is this can change because the focus of news is always changing, so this frequency distribution in principle can be changing.",
            "So we take the 1st 200 words and then we do we so we sorry I was taking a four hour rolling corpus.",
            "In the main languages, so in English, French and German, we're taking four hours of news.",
            "This is a rolling every 10 minutes.",
            "We drop off the last 10 minutes we take the next 10 minutes so it's a rolling corpus if you like.",
            "The other thing we do is we do this entropy calculation.",
            "Which is basically trying to.",
            "We're trying to get the most meaningful words to do the clustering.",
            "That's the objective.",
            "So although we've moved the very top 100 most frequent words, which is the stop list if you like in each language, we've ended this entropy calculation, which is 2.",
            "Is 2 is the only use the words with the most meaning.",
            "If a word is used in every document, it has no value at all.",
            "It may be very rare, but if it's used in all the documents, it doesn't help you with the clustering.",
            "So we remove anything with an entropy that is greater than .7.",
            "And the other.",
            "The next thing was that for the clustering algorithm to really work, you have another problem where you don't want words there only in one document.",
            "It won't help you, you need words that are in at least two documents and we for the big languages we actually insist on a word appearing twice in two documents.",
            "At the end of this, we end up with roughly with 6000 words, 400 documents.",
            "We do the clustering.",
            "We convert that into a vector space, so we're using the words is as dimensions and we each document gets we get 400 vectors out.",
            "We calculate the cosine distance between all the vectors and then we build this sort of distance matrix.",
            "So it's a 400 like a road map.",
            "It tells you the distance between London and Paris.",
            "We calculate the distance matrix in this vector space of.",
            "Um documents.",
            "And then basically the algorithm is really quite straightforward.",
            "Take the first of all.",
            "We take the two nearest ones.",
            "We always keep track of the most closest elements.",
            "We combine them into a cluster.",
            "We re calculate the distances to all the others and we carry on clustering together the closest neighbors until such time as we have a cut off in cut of cosine.",
            "So when we've got a situation whereby we no longer have two pairs which are within.",
            ".6 but this depends on the language as well.",
            "In English and French it would be .6.",
            "In languages with less documents it would be .7 Point 8 and I forgot to say that for other languages where we don't have that many documents will increase the rolling corpus to compensate.",
            "So we always have at least 200 documents to work with.",
            "OK, so once once we've got the, once we've got the cluster in a given corpus.",
            "Let's say we do this every 10 minutes, so we've got a rolling clustering algorithm running every 10 minutes throughout the continuously, and this means that we can then link classes together.",
            "This is simply because.",
            "It's very likely that if the story is about the same thing, the cluster will appear in the next 10 minutes.",
            "It's all the classic is done completely independently, but of course the overlap in the documents in the given cluster will overlap with clusters from 10 minutes ago.",
            "So then you've got a situation where you can easily track.",
            "Stories which every 10 minutes we've gotta, we've got a different set.",
            "And then we because there's an overlap here in the individual stories with within each time interval we can link them together.",
            "So then we can do this stories tracking and of course stories can merge so we can start off with two separate stories which then merged together.",
            "They can die.",
            "What we don't want is 1 story to split into two separate stories.",
            "That means our system is not.",
            "It's very unusual that that would happen.",
            "No, I won't show this this.",
            "This is just an interesting thing about entropy, that saying that different languages have different entropy distributions.",
            "So if you take Arabic and English, they have different entropy frequency distributions, which is basically saying that the language it's the richness of words that are used in languages, it's.",
            "As a offshoot of this work, we have these entropy distributions in different languages.",
            "OK, so the clustering.",
            "So we do this 10 minute clustering in 18 languages and this is what we get.",
            "So we get pretty good.",
            "Very fine grained news, development overtime.",
            "And this is in English.",
            "This is in.",
            "In Italian, and this is in.",
            "Spanish.",
            "Now the language, the clustering the software doesn't know anything about Spanish, doesn't know anything about Hungarian.",
            "It doesn't know anything about Arabic, but it works because it's using the.",
            "It's using simple statistics on words and.",
            "In the in the main language it works very well and even in small languages it works reasonably well.",
            "Um?",
            "The other thing is that we we because we've got this 10 minute interval, we can then do this business whereby we can find we find new breaking news stories of course, but we can also detect a change in the flux of news to send out what we call a NEWS UPDATE.",
            "So if a story is developing, they maybe it's gone flat for a bit then it suddenly goes up again because they arrest somebody.",
            "Then we can send out a NEWS UPDATE which is an interesting thing because the cluster the shape of the story.",
            "Changes with time so you can send out a second SMS or a second email message for an update, which is a new thing.",
            "Now I. I can quickly give you a demo.",
            "So this is our.",
            "This is live as long as no ones.",
            "As long as the Internet still working yet.",
            "And we've got the top story in Britain.",
            "Is that the manager of Chelsea's left again, you can see that this has been this has been developing overnight so it started off at.",
            "1:00 o'clock this morning we picked up.",
            "In fact, I think I read that heard on the news this morning that he resigned late last night that was put on their website.",
            "So then this is become a big story in the UK if we look in France, for example, we can find out what the French.",
            "Muses"
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, good morning this morning I want to review an area which is become known as open source intelligence.",
                    "label": 0
                },
                {
                    "sent": "Now there's nothing really new under the sun.",
                    "label": 0
                },
                {
                    "sent": "This is web mining or text mining or data mining with a new name, but it's coming from the application end.",
                    "label": 0
                },
                {
                    "sent": "When I first met the term open source intelligence, I thought it had something to do with open source software.",
                    "label": 0
                },
                {
                    "sent": "But more and more in recent years we've heard this name bandied around and the JRC is being pulled in more and more into work into this area.",
                    "label": 0
                },
                {
                    "sent": "So I thought it was a good idea to try to review.",
                    "label": 0
                },
                {
                    "sent": "Open source intelligence, what it means and who's.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Asking for it.",
                    "label": 0
                },
                {
                    "sent": "I would like to acknowledge, of course, the people in my team Europe Media Monitor.",
                    "label": 1
                },
                {
                    "sent": "That's the URL.",
                    "label": 0
                },
                {
                    "sent": "But please don't all go to it because I will.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Demonstrate it later.",
                    "label": 0
                },
                {
                    "sent": "OK, so the program this morning.",
                    "label": 0
                },
                {
                    "sent": "First, I want to sort of define what it what is meant by this term.",
                    "label": 0
                },
                {
                    "sent": "Open source intelligence and also to emphasize it's not just about text mining and I'm going to actually give an example which is based on satellite data.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And then I'm going to go into a bit of a diversion, and I want to look at.",
                    "label": 0
                },
                {
                    "sent": "UN try to understand the developments that have happened on the on the web.",
                    "label": 0
                },
                {
                    "sent": "And in particular also this thing the dark web, which is what all the security agencies and police and everyone is trying to monitor.",
                    "label": 0
                },
                {
                    "sent": "How terrorists have used the web in React.",
                    "label": 0
                },
                {
                    "sent": "If you think about it, an organization like Al Qaeda couldn't really function without the Internet today.",
                    "label": 0
                },
                {
                    "sent": "And then the main work will then review the whole air Web mining intelligence.",
                    "label": 0
                },
                {
                    "sent": "And since we've been working now for four, actually longer than that.",
                    "label": 0
                },
                {
                    "sent": "Um 4 five years on building the Europe medium on, I'm going to review how you do it, how you try to detect real time.",
                    "label": 0
                },
                {
                    "sent": "News updates on websites.",
                    "label": 0
                },
                {
                    "sent": "How you?",
                    "label": 0
                },
                {
                    "sent": "Classify the data and how you cluster it.",
                    "label": 0
                },
                {
                    "sent": "How you detect breaking news and so on.",
                    "label": 0
                },
                {
                    "sent": "I want to review how AMM works.",
                    "label": 0
                },
                {
                    "sent": "And other and other similar systems.",
                    "label": 0
                },
                {
                    "sent": "And then move on then to how once you've collected all this information like we've collected for years of news.",
                    "label": 0
                },
                {
                    "sent": "How you can analyze it?",
                    "label": 0
                },
                {
                    "sent": "How you can mine information from it and how you can visualize information.",
                    "label": 0
                },
                {
                    "sent": "And then finally I'm going to round off with a review of open source intelligence tools, which is more like web mining.",
                    "label": 0
                },
                {
                    "sent": "Helping an investigator to find the information he wants and how to extract information and how.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Process it.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "OK, this term really originates from the security services CIA and all the rest of it and.",
                    "label": 0
                },
                {
                    "sent": "It started really because.",
                    "label": 0
                },
                {
                    "sent": "Off the 9/11 was a complete shock to the old style intelligence world.",
                    "label": 1
                },
                {
                    "sent": "If you read the 9/11 Commission report, there's a strong criticism of the way the intelligence community functioned.",
                    "label": 0
                },
                {
                    "sent": "There was a failure to connect the dots.",
                    "label": 1
                },
                {
                    "sent": "All the evidence was there.",
                    "label": 0
                },
                {
                    "sent": "There was a plotted brewing, but they had not passed the information around and there was no one who saw the pattern.",
                    "label": 0
                },
                {
                    "sent": "So this is all to do with agency secrecy, mistrust, elitism.",
                    "label": 0
                },
                {
                    "sent": "And this all was supposed to change.",
                    "label": 0
                },
                {
                    "sent": "The people who did understand the Internet and how to use it well, the terrorists themselves.",
                    "label": 0
                },
                {
                    "sent": "And this was a big eye opener to the intelligence community.",
                    "label": 0
                },
                {
                    "sent": "And there's this quote from John Arquilla, who's the professor in the Naval College.",
                    "label": 1
                },
                {
                    "sent": "I think in Dartmouth or.",
                    "label": 0
                },
                {
                    "sent": "Which is the fighter network like Al Qaeda.",
                    "label": 0
                },
                {
                    "sent": "You have to behave like a network.",
                    "label": 1
                },
                {
                    "sent": "But it's not just about the this open source.",
                    "label": 0
                },
                {
                    "sent": "Intelligence is not just about law enforcement security services.",
                    "label": 0
                },
                {
                    "sent": "The business world is woken up to it as well.",
                    "label": 0
                },
                {
                    "sent": "This area of business intelligence.",
                    "label": 0
                },
                {
                    "sent": "You want to find out what your competitors are doing.",
                    "label": 0
                },
                {
                    "sent": "You want to know immediately when there's an earthquake in a in some town, which where you've got a factory or whatever it is, so there's this growing need.",
                    "label": 0
                },
                {
                    "sent": "Also, in the business world for real time intelligence.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So pre 911.",
                    "label": 0
                },
                {
                    "sent": "As I said, they were closed and they remained relied on human intelligence and signal intelligence, which is called humid and segeant in this jargon.",
                    "label": 1
                },
                {
                    "sent": "And classified material.",
                    "label": 0
                },
                {
                    "sent": "And because it's classified, they can't share it with anyone.",
                    "label": 0
                },
                {
                    "sent": "And then there was this realization that open source, if they had looked properly, they could have foreseen that there was attacks brewing just by looking at the propaganda sites of the various organizations.",
                    "label": 1
                },
                {
                    "sent": "So this reassessment in the use of open source software open source, sorry, hope with source intelligence.",
                    "label": 1
                },
                {
                    "sent": "And sharing intelligence between the agencies was was started and now now nearly every national agency plus police etc are actively monitoring terrorist activities on the Internet.",
                    "label": 0
                },
                {
                    "sent": "I mean they are.",
                    "label": 0
                },
                {
                    "sent": "That's why it's so easy for bin Laden to put a video out because they're all looking for it.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 1
                },
                {
                    "sent": "At the same time, the important this 24 hour CNN effect.",
                    "label": 0
                },
                {
                    "sent": "The first Gulf War was the first war which was covered real time by by CNN.",
                    "label": 0
                },
                {
                    "sent": "This changed the way everything works.",
                    "label": 0
                },
                {
                    "sent": "the Internet itself, then the Internet.",
                    "label": 1
                },
                {
                    "sent": "The growth of news reporting on the Internet during the 9/11 terrorist attacks.",
                    "label": 0
                },
                {
                    "sent": "A lot of people were looking at the the Internet sites.",
                    "label": 0
                },
                {
                    "sent": "Because they couldn't get through the Internet, sites actually crashed because there was.",
                    "label": 0
                },
                {
                    "sent": "So everyone went there to find what was what was actually happening.",
                    "label": 0
                },
                {
                    "sent": "So we've got this.",
                    "label": 0
                },
                {
                    "sent": "This 24 hour rapid information flowing around the world.",
                    "label": 0
                },
                {
                    "sent": "And there's now a sort of growing group of companies researchers were working in this area, which is called you open source software, open source intelligence, and in Europe.",
                    "label": 0
                },
                {
                    "sent": "We've now got this year's inforum which started at the end of last year.",
                    "label": 0
                },
                {
                    "sent": "Which brings together government agencies plus companies and researchers.",
                    "label": 0
                },
                {
                    "sent": "And then the ISI conference is in.",
                    "label": 0
                },
                {
                    "sent": "The IEEE Conferences for Intelligence Informatics have been running since 2004, and there's even a NATO Handbook on in open source intelligence.",
                    "label": 0
                },
                {
                    "sent": "I which I found.",
                    "label": 0
                },
                {
                    "sent": "And they native themselves run training courses on open source for for.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For their stuff.",
                    "label": 0
                },
                {
                    "sent": "OK, So what is it?",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "Open source information is the is the key thing is is basically data that's publicly available.",
                    "label": 0
                },
                {
                    "sent": "It doesn't have to be the Internet.",
                    "label": 0
                },
                {
                    "sent": "It doesn't have to be free.",
                    "label": 0
                },
                {
                    "sent": "It needs to be publicly available.",
                    "label": 0
                },
                {
                    "sent": "So it could be it could be a subscription service as well, but it's something that any member of the public could get hold of.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Open source intelligence then is proprietary intelligence recursively derived from open source information.",
                    "label": 1
                },
                {
                    "sent": "Intelligence means an interpretation of the data.",
                    "label": 0
                },
                {
                    "sent": "Collecting open source information, which is what the tools what the let's say the data retrieval aspect of it is to select, retrieve the right information for the application for the need.",
                    "label": 0
                },
                {
                    "sent": "The target catalog.",
                    "label": 0
                },
                {
                    "sent": "It, visualize it and disseminate it.",
                    "label": 1
                },
                {
                    "sent": "Normally open source intelligence is the result of an expert who's analyzes the data that's prepared by a collection by a researcher, if you like.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The three areas of intelligence, information, human intelligence, signal signal intelligence means phone taps, radio intercepts, whatever.",
                    "label": 0
                },
                {
                    "sent": "And in principle it could also mean email intercepts.",
                    "label": 0
                },
                {
                    "sent": "And open source intelligence, which is getting bigger and bigger.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And importance.",
                    "label": 0
                },
                {
                    "sent": "So who uses it well?",
                    "label": 1
                },
                {
                    "sent": "As I said, the security services.",
                    "label": 0
                },
                {
                    "sent": "Police law enforcement agencies are more and more getting involved.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And normal government organisations.",
                    "label": 0
                },
                {
                    "sent": "They have a need to be kept up-to-date, informed of what's going on.",
                    "label": 0
                },
                {
                    "sent": "That's why we built EMN.",
                    "label": 0
                },
                {
                    "sent": "We built it for the European Commission because they they need to know immediately when there is some critical report about some Commissioner or when.",
                    "label": 0
                },
                {
                    "sent": "What if there's some crisis brewing?",
                    "label": 0
                },
                {
                    "sent": "They want to know immediately?",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Then the situation centers the a lot of organisations for the African Union.",
                    "label": 0
                },
                {
                    "sent": "This is they have a situation center and they're very interested in using our software basically to keep them informed about developments, news reports in Africa.",
                    "label": 0
                },
                {
                    "sent": "Then the the United Nations in New York have got a 24 hour manned crisis room, which is continuously monitoring news reports, news wires coming in the World Health Organization.",
                    "label": 0
                },
                {
                    "sent": "We're going here later about Medicis, which is a eleccion medical intelligence system trying to pick up the first reports about disease outbreaks.",
                    "label": 0
                },
                {
                    "sent": "Even NGOs and relief agencies.",
                    "label": 0
                },
                {
                    "sent": "They need to know when there's an earthquake.",
                    "label": 0
                },
                {
                    "sent": "They want to be prepared for it, so there's a growing need for live information, targeted information to be brought to the right people.",
                    "label": 0
                },
                {
                    "sent": "And large companies.",
                    "label": 0
                },
                {
                    "sent": "The big business.",
                    "label": 0
                },
                {
                    "sent": "If your oil companies, they all of them have a team of 20 up, sometimes up to 20 people who are continuously monitoring what's happening in wherever they have oil rigs where they have.",
                    "label": 1
                },
                {
                    "sent": "Well, they have their main offices, but also they want to look at what the competition is happening.",
                    "label": 0
                },
                {
                    "sent": "They need to be kept continuously up-to-date and this is normally they report straight to the board, so they're writing daily reports on that.",
                    "label": 0
                },
                {
                    "sent": "Multinational companies are the same thing and then business intelligence.",
                    "label": 0
                },
                {
                    "sent": "Things that can affect stock prices.",
                    "label": 0
                },
                {
                    "sent": "Etc.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is this thing intelligence?",
                    "label": 1
                },
                {
                    "sent": "It's just a word, but in reality.",
                    "label": 1
                },
                {
                    "sent": "Intelligence is always a report of some sort.",
                    "label": 1
                },
                {
                    "sent": "It could be classified, but it's a report.",
                    "label": 0
                },
                {
                    "sent": "Now that is derived from the information that's collected and the tools that help them can make that life easier, and it can handle more information.",
                    "label": 0
                },
                {
                    "sent": "The other point is, it's not just a text report, it's just as like was just as important as a map.",
                    "label": 0
                },
                {
                    "sent": "Or image imagery or data.",
                    "label": 0
                },
                {
                    "sent": "And of course, the intelligence.",
                    "label": 0
                },
                {
                    "sent": "Will be from classified an open source information, but the big advantage of open source.",
                    "label": 1
                },
                {
                    "sent": "Intelligence is that you can share it with other people because it's not classified.",
                    "label": 0
                },
                {
                    "sent": "This is a big boon for interagency collaboration, so if you're a police force in the UK, you can share this information with the French police force because it's not.",
                    "label": 0
                },
                {
                    "sent": "Classified or let's say the security services so one one other advantage of the open source intelligence is that you can actually share it with other people, whereas this this close down of need to know doesn't really apply.",
                    "label": 0
                },
                {
                    "sent": "Although of course the report might end up being classified even if it only is dependent on open source.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Information, but that's another problem.",
                    "label": 0
                },
                {
                    "sent": "So a typical agency.",
                    "label": 0
                },
                {
                    "sent": "Or company, what do they do?",
                    "label": 0
                },
                {
                    "sent": "So they have they have standard open source products.",
                    "label": 1
                },
                {
                    "sent": "The first thing is a newsflash.",
                    "label": 0
                },
                {
                    "sent": "Something happens and everyone in the company or everyone who needs to know should be informed by email or SMS messaging.",
                    "label": 0
                },
                {
                    "sent": "So we have, for example, a system in Brussels which he does this.",
                    "label": 0
                },
                {
                    "sent": "So there's someone there checking the news wires as they come in.",
                    "label": 0
                },
                {
                    "sent": "It's not being updated live if there's something particularly important for a Commissioner or something that affects the Commission in some way, then they send an SMS message.",
                    "label": 0
                },
                {
                    "sent": "Immediately.",
                    "label": 0
                },
                {
                    "sent": "News flashing, so that's a sort of standard thing which of which companies and which organisations have governments?",
                    "label": 0
                },
                {
                    "sent": "Then it's always the case that there's a daily briefing, so there's a.",
                    "label": 0
                },
                {
                    "sent": "There's a standard product which is like a daily update on what's happening on what you're interested in.",
                    "label": 0
                },
                {
                    "sent": "If you work for the Pharmaceutical industry, this would be like, say, a daily update on developments in the Pharmaceutical industry.",
                    "label": 0
                },
                {
                    "sent": "So this is news military again.",
                    "label": 0
                },
                {
                    "sent": "Situation update what is happening.",
                    "label": 0
                },
                {
                    "sent": "These normally is sort of a weekly or monthly update on a crisis.",
                    "label": 0
                },
                {
                    "sent": "So for example darfour or a rack.",
                    "label": 0
                },
                {
                    "sent": "I mean just a summary of what's happened in that place every month or every week.",
                    "label": 0
                },
                {
                    "sent": "And then, of course, there's the real emergent.",
                    "label": 1
                },
                {
                    "sent": "There's this specific studies, so then you need.",
                    "label": 0
                },
                {
                    "sent": "Let's say this this famous report, which is which is completely wrong.",
                    "label": 0
                },
                {
                    "sent": "Of course, this Iraq weapons of mass destruction.",
                    "label": 0
                },
                {
                    "sent": "So Tony Blair or somebody said we need, we need a report which proves or.",
                    "label": 0
                },
                {
                    "sent": "Let's say we need a report that shows whether Saddam Hussein is building chemical weapons.",
                    "label": 0
                },
                {
                    "sent": "So what do they do?",
                    "label": 1
                },
                {
                    "sent": "They end up going through search engines.",
                    "label": 0
                },
                {
                    "sent": "Google and the and the like.",
                    "label": 0
                },
                {
                    "sent": "They may look in subscription databases which they've got, or they may subscribe to things like Jane's Defence Weekly and then they go and collect the information and they normally have a short time period.",
                    "label": 0
                },
                {
                    "sent": "They gotta produce together this Intelligence Report.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The people involved in this.",
                    "label": 0
                },
                {
                    "sent": "Classic example is like a minister or a general or a commissioner aura, the head, the CEO of the company says I need to know I want to.",
                    "label": 0
                },
                {
                    "sent": "I want to review of what's happened in this particular area and he talks normally to what's called the analyst.",
                    "label": 0
                },
                {
                    "sent": "The analyst is the elite person in the security services or whatever.",
                    "label": 0
                },
                {
                    "sent": "An analyst doesn't is supposed is the expert.",
                    "label": 0
                },
                {
                    "sent": "He is the expert in the Middle East so he knows or supposed to know he or she is supposed to know.",
                    "label": 0
                },
                {
                    "sent": "Everything that there is to know about the, let's say, the Palestine.",
                    "label": 0
                },
                {
                    "sent": "Israeli Palestine conflict.",
                    "label": 0
                },
                {
                    "sent": "So he has access to classified information, but then he goes to his assistant.",
                    "label": 1
                },
                {
                    "sent": "Let's say the research is open source intelligence researcher who is either collected information already or is then tasked to collect the information and he uses tools.",
                    "label": 0
                },
                {
                    "sent": "And that's where we fit in here.",
                    "label": 0
                },
                {
                    "sent": "So we are basically the technical data mining tool builders.",
                    "label": 1
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And OK, this is a slide which says basically that the analyst job is very tired and he's got any can only handle at maximum 200 reports today, although he should really be reading 10,000 that a day.",
                    "label": 0
                },
                {
                    "sent": "And if of course if you include the Internet then the whole thing explodes and he can't cope with the flux of information that's arriving.",
                    "label": 0
                },
                {
                    "sent": "But that end they tend to do the following, which is to read is to extract information from a report, and sometimes they build a link analysis system.",
                    "label": 0
                },
                {
                    "sent": "In this case, this is a piece of software which a lot of police forces and intelligence agencies use.",
                    "label": 0
                },
                {
                    "sent": "It's called analyst notebook.",
                    "label": 0
                },
                {
                    "sent": "So they do this by hand basically.",
                    "label": 0
                },
                {
                    "sent": "And then they.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Find the right there report.",
                    "label": 0
                },
                {
                    "sent": "There's a cycle to list, which is the the task to do.",
                    "label": 0
                },
                {
                    "sent": "It they collect the data you process the data, you analyze the data and then you write your report and this.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Laminate it.",
                    "label": 0
                },
                {
                    "sent": "Did you break that down further?",
                    "label": 0
                },
                {
                    "sent": "Collecting information well nowadays you really need to have multilingual information, so perhaps you need some machine translation software.",
                    "label": 0
                },
                {
                    "sent": "So you need to collect data.",
                    "label": 0
                },
                {
                    "sent": "Obviously you're going to use a search engine.",
                    "label": 0
                },
                {
                    "sent": "There's no point in trying to reinvent the wheel.",
                    "label": 0
                },
                {
                    "sent": "The best search engines are the commercial search engines.",
                    "label": 0
                },
                {
                    "sent": "Google and the like.",
                    "label": 0
                },
                {
                    "sent": "You may want to crawl now if you want to target if you want to look at a particular website, let's say some terrorist group or some extremist group, you will want to just look at that site now.",
                    "label": 0
                },
                {
                    "sent": "You might want to crawl and bring back all the documents from that site.",
                    "label": 0
                },
                {
                    "sent": "News feeds of course.",
                    "label": 0
                },
                {
                    "sent": "Now in the area you're looking for, you don't want to get all the news you want to get a specific you want to have specific news on a specific.",
                    "label": 0
                },
                {
                    "sent": "Organization or specific place or whatever country or whatever it is, so you need targeted filtered news.",
                    "label": 0
                },
                {
                    "sent": "When you process the information.",
                    "label": 0
                },
                {
                    "sent": "You may have thousands of documents, so you want something that will extract information you want to extract the entities.",
                    "label": 0
                },
                {
                    "sent": "You only extract names, organization, phone numbers.",
                    "label": 0
                },
                {
                    "sent": "The like bank account details and so on.",
                    "label": 0
                },
                {
                    "sent": "You want to extract information about the where the place is.",
                    "label": 0
                },
                {
                    "sent": "So Geocodes Geo locating the information.",
                    "label": 0
                },
                {
                    "sent": "And you want to basically, if possible classifier so cluster into topics.",
                    "label": 0
                },
                {
                    "sent": "Then you want to analyze OK, so once you've done that, you want to kind of analyze that.",
                    "label": 0
                },
                {
                    "sent": "So then there comes in with link analysis.",
                    "label": 0
                },
                {
                    "sent": "Relationships between entities.",
                    "label": 0
                },
                {
                    "sent": "Why are these two people mentioned in the document?",
                    "label": 0
                },
                {
                    "sent": "If you can have some software which will tell you oh they're actually married, if that can be done automatically, then that's going to help you alot.",
                    "label": 0
                },
                {
                    "sent": "Geo linking means geolocating documents, so you can put it on to GIS systems.",
                    "label": 0
                },
                {
                    "sent": "Trend analysis is seeing how things vary overtime and statistics.",
                    "label": 0
                },
                {
                    "sent": "And then maybe you want to visualize all that stuff on Maps or whatever.",
                    "label": 0
                },
                {
                    "sent": "And finally, in this world of open exchange of information in this security services, then they would like to collaborate on sharing information with other agencies.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is I mean really?",
                    "label": 0
                },
                {
                    "sent": "the Internet is the most important source of information, and it's growing and we're going to look at that.",
                    "label": 0
                },
                {
                    "sent": "We're going to review that area in a minute.",
                    "label": 0
                },
                {
                    "sent": "Subscription services they there are.",
                    "label": 1
                },
                {
                    "sent": "These may big aggregators of information.",
                    "label": 0
                },
                {
                    "sent": "LexisNexis is a famous one.",
                    "label": 0
                },
                {
                    "sent": "The news agencies themselves, of course, will give you their wires if you pay them.",
                    "label": 0
                },
                {
                    "sent": "Factiva is a large, also a large repository aggregator of news and more.",
                    "label": 0
                },
                {
                    "sent": "Now recently they're also having web content.",
                    "label": 0
                },
                {
                    "sent": "Dialogue BBC monitoring they have a team of people that's watching the TV across.",
                    "label": 0
                },
                {
                    "sent": "Across the world and writing transcripts.",
                    "label": 0
                },
                {
                    "sent": "Trying to review what's happening.",
                    "label": 0
                },
                {
                    "sent": "Jane's Defense Weekly is A is A is A is a subscription service for updates.",
                    "label": 0
                },
                {
                    "sent": "They also have updates on terrorism and so on.",
                    "label": 0
                },
                {
                    "sent": "And the other strange one is commercial satellites now.",
                    "label": 0
                },
                {
                    "sent": "If you need to know how the Iranian nuclear program is going, you can go on the Internet with a credit card and you can buy a high resolution satellite data, which seems a bit.",
                    "label": 0
                },
                {
                    "sent": "This is almost like.",
                    "label": 0
                },
                {
                    "sent": "Spy military spy satellite data from.",
                    "label": 0
                },
                {
                    "sent": "From five or ten years ago, but today you can actually buy this stuff because it's quite expensive, but you can.",
                    "label": 0
                },
                {
                    "sent": "You can.",
                    "label": 0
                },
                {
                    "sent": "Look at that as well and then geospatial data providers if you need Maps and so on.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is saying.",
                    "label": 0
                },
                {
                    "sent": "But this is this is repeating the same thing which is saying that OK.",
                    "label": 0
                },
                {
                    "sent": "The other interesting point here.",
                    "label": 0
                },
                {
                    "sent": "The source is of course it's very easy to do a search in Google and get hundreds of thousands of documents back, but.",
                    "label": 0
                },
                {
                    "sent": "You need to.",
                    "label": 0
                },
                {
                    "sent": "You need to be know the validity of the source.",
                    "label": 0
                },
                {
                    "sent": "You one of the most important things is to find the sources that you trust that you find reliable.",
                    "label": 0
                },
                {
                    "sent": "And often on a realm, the Internet, the information comes first and the information about the source comes second, which is the exact opposite to the human intelligence.",
                    "label": 1
                },
                {
                    "sent": "For example, where you only trust information you get from this person, but on the Internet you kind of.",
                    "label": 0
                },
                {
                    "sent": "You don't know whether it's true or whether it's a lie.",
                    "label": 0
                },
                {
                    "sent": "And this whole thing now, rumor, falsities propaganda events are flying across the world in minutes.",
                    "label": 1
                },
                {
                    "sent": "A good example of that was the Danish cartoon, so.",
                    "label": 1
                },
                {
                    "sent": "There is a rumor or an accusation, and it spreads across the world in minutes.",
                    "label": 0
                },
                {
                    "sent": "This is why the need to know fast is so important.",
                    "label": 0
                },
                {
                    "sent": "Oh, there's another minefield of Copyright.",
                    "label": 0
                },
                {
                    "sent": "What exactly are you can you do with information you've taken from the Internet?",
                    "label": 0
                },
                {
                    "sent": "What?",
                    "label": 0
                },
                {
                    "sent": "It's a very Gray area and it's something that that we have been struggling with as well because we are monitoring news reports.",
                    "label": 0
                },
                {
                    "sent": "The whole legality of whether you can take information from the authored by somebody else who owns that information, it's a very Gray area.",
                    "label": 0
                },
                {
                    "sent": "Google have gotten exactly the same problem, and they've been sued about it.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so it's not just about text, I wanted to give an example here which is actually taken from work in the JRC.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "In these cases.",
                    "label": 0
                },
                {
                    "sent": "Which is more to do with intelligence gathering on the Iranian nuclear program?",
                    "label": 0
                },
                {
                    "sent": "This is work that we've been doing with the IAEA, which is basically in keeping people like Solana informed as to what's happening on the in that area.",
                    "label": 0
                },
                {
                    "sent": "So this is the area image intelligence where.",
                    "label": 0
                },
                {
                    "sent": "The first example here is.",
                    "label": 0
                },
                {
                    "sent": "Again buying satellite data which you can do on the Internet, and this is actually a refugee camp and the the Office of Humanitarian Aid wanted to know whether they were over overpaying for the number of they were paying.",
                    "label": 0
                },
                {
                    "sent": "Basically, to keep this refugee camp going, they wanted to know whether they were over.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So they wanted to count the number of tents there.",
                    "label": 0
                },
                {
                    "sent": "And then image analysis like this automated software which will go and identify these.",
                    "label": 0
                },
                {
                    "sent": "These are this is the resolution of the imagery.",
                    "label": 0
                },
                {
                    "sent": "Trying to identify the which tense.",
                    "label": 0
                },
                {
                    "sent": "The count the tents.",
                    "label": 0
                },
                {
                    "sent": "And basically.",
                    "label": 0
                },
                {
                    "sent": "By enhanced by using pattern recognition software, you can find that the computer is recognizing individual tense here, which you can then count.",
                    "label": 0
                },
                {
                    "sent": "And this is something that is a procedure that you can automate.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "This is an example, but you can also use it for counting houses in cities and so on.",
                    "label": 0
                },
                {
                    "sent": "So that would form a important information derived from.",
                    "label": 0
                },
                {
                    "sent": "Data which you've got off the basically bought on the Internet.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The Iranian nuclear program is and is everyone is trying to understand whether they're building a bomb and so on.",
                    "label": 0
                },
                {
                    "sent": "So they are monitoring.",
                    "label": 0
                },
                {
                    "sent": "Thus the Americans and everyone else that continuously so.",
                    "label": 0
                },
                {
                    "sent": "But here you can combine information you get from the Internet with satellite data.",
                    "label": 0
                },
                {
                    "sent": "And in fact, the original whistle blowing on the on the Iranian program was done by a dissident group, which caught everyone by surprise, and that was done through the Internet.",
                    "label": 0
                },
                {
                    "sent": "Data mining is by Umm and conventional search engines.",
                    "label": 1
                },
                {
                    "sent": "Now, in order to of course you need to know about the nuclear fuel structure to understand what's happening.",
                    "label": 0
                },
                {
                    "sent": "But IEA are very the course they need to know how far the Iranians are from having enough enriched uranium to build.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nuclear weapon.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This is this is a site.",
                    "label": 0
                },
                {
                    "sent": "This is the citanest behind where they're making uranium hacks fuel.",
                    "label": 0
                },
                {
                    "sent": "And this gives you an idea of just how accurate this satellite data is, and here you see a new building that's being put up and they wanted to know what that was.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Lo and behold, if you search on the Internet in Farsi for the right information, we had a woman working with us.",
                    "label": 0
                },
                {
                    "sent": "Who was Iranian, you find?",
                    "label": 0
                },
                {
                    "sent": "Exactly that tower.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is on a site which in English.",
                    "label": 0
                },
                {
                    "sent": "This is why multi language is very important.",
                    "label": 0
                },
                {
                    "sent": "the English version of the same site of course doesn't have that link because they remove all the nuclear.",
                    "label": 0
                },
                {
                    "sent": "And they remove all the nuclear information in the English version, but only in the Farsi version will you find it.",
                    "label": 0
                },
                {
                    "sent": "The second example here would be.",
                    "label": 0
                },
                {
                    "sent": "This is damage assessment during the Lebanon War, so we.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We were asked to do a damage assessment for this for the donors conference in Stockholm, so again, you buy the data.",
                    "label": 0
                },
                {
                    "sent": "You basically can task as satellite to give you in this case.",
                    "label": 0
                },
                {
                    "sent": "Of course you don't want you have to have the data afterwards.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And ideally you want to have the data satellite image before and after, and then you can do change detection.",
                    "label": 0
                },
                {
                    "sent": "And this was data that was derived in Ispra, basically from from commercial satellite data which we bought.",
                    "label": 0
                },
                {
                    "sent": "And we found out how many.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Others have been damaged.",
                    "label": 0
                },
                {
                    "sent": "Trying to automate the identification that this building on the right here has been bombed.",
                    "label": 0
                },
                {
                    "sent": "This is very difficult actually.",
                    "label": 0
                },
                {
                    "sent": "In three dimensions.",
                    "label": 0
                },
                {
                    "sent": "To do a pattern recognition, but there is a change detection here is much easier from higher up because you've got a problem of parallax, so the satellite the camera on the satellite is not in exactly the same position in the two pictures, so you need to do a 3D pattern match before you can take, say that there's a change detection in.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Image.",
                    "label": 0
                },
                {
                    "sent": "And here we've got the the airport in Beirut.",
                    "label": 0
                },
                {
                    "sent": "This is much easier to detect the bomb sites.",
                    "label": 0
                },
                {
                    "sent": "It just shows how accurately Israeli bombing was because they hit every single intersection on the runway.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, now before we get into the web mining techniques and so on, I thought it would.",
                    "label": 1
                },
                {
                    "sent": "I'd like to review the web.",
                    "label": 0
                },
                {
                    "sent": "Now I think we all think we understand the Internet, but it's it's.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, when you realize just how.",
                    "label": 0
                },
                {
                    "sent": "New IT is.",
                    "label": 0
                },
                {
                    "sent": "If you think of communication.",
                    "label": 0
                },
                {
                    "sent": "This is a diversion for about 15 minutes.",
                    "label": 0
                },
                {
                    "sent": "In the 1920s they, the phone was invented.",
                    "label": 0
                },
                {
                    "sent": "It basically it's still the case that today people don't have phones.",
                    "label": 0
                },
                {
                    "sent": "The mobile phone revolution was the one that brought phones into Africa.",
                    "label": 0
                },
                {
                    "sent": "The the phone took.",
                    "label": 0
                },
                {
                    "sent": "A very long time before it was brought before it was adopted, but worldwide and it has a particular thing.",
                    "label": 0
                },
                {
                    "sent": "It's a point to point connection.",
                    "label": 0
                },
                {
                    "sent": "It's basically you can talk to somebody at a distance.",
                    "label": 0
                },
                {
                    "sent": "That's all it is.",
                    "label": 0
                },
                {
                    "sent": "The next big revolution would be say, broadcasting radio.",
                    "label": 0
                },
                {
                    "sent": "Before the war.",
                    "label": 0
                },
                {
                    "sent": "The radio.",
                    "label": 0
                },
                {
                    "sent": "No one had a television, so the radio took off in a slow way.",
                    "label": 0
                },
                {
                    "sent": "Television came.",
                    "label": 0
                },
                {
                    "sent": "In took off from the 1960s and now everyone has a television, but it took, let's say, 3040 years before it diffused out into every home.",
                    "label": 0
                },
                {
                    "sent": "But again, but the way the tell if that is important to realize the difference, the way we communicate in phone, we have a.",
                    "label": 0
                },
                {
                    "sent": "It's a point to point connection, whereas broadcasting is one person decides the content and we'll sit there passively and look at it.",
                    "label": 0
                },
                {
                    "sent": "And this is very good, easy to control.",
                    "label": 0
                },
                {
                    "sent": "The government can control what is allowed on television etc etc.",
                    "label": 0
                },
                {
                    "sent": "And so if you think of it before the web, it was very easy for governments to control what their people learned about.",
                    "label": 0
                },
                {
                    "sent": "It was a.",
                    "label": 0
                },
                {
                    "sent": "It's a very phones.",
                    "label": 0
                },
                {
                    "sent": "It was easy to tap the phone if you didn't miss trusted someone.",
                    "label": 0
                },
                {
                    "sent": "It was quite easy to go and get a phone tap.",
                    "label": 0
                },
                {
                    "sent": "But the web changed all that.",
                    "label": 0
                },
                {
                    "sent": "In I remember seeing the web for the first time.",
                    "label": 0
                },
                {
                    "sent": "I think at the end of 92 somebody downloaded Mosaic from NCSA's website and we looked at it and the impact of that first view was incredible.",
                    "label": 0
                },
                {
                    "sent": "I you saw immediately that there was something completely new here.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And the whole model of communication changed overnight, so now it was possible for you to publish information and you had a situation where many people could publish information and there was a lot of other people who looked at it.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So round about 1993 the web started to grow.",
                    "label": 0
                },
                {
                    "sent": "I knew it had happened when I saw a URL on a London bus that was about two or two years later.",
                    "label": 0
                },
                {
                    "sent": "Before that it was basically just University researchers in the Internet, but.",
                    "label": 0
                },
                {
                    "sent": "Again, it's it was basically a passive thing.",
                    "label": 0
                },
                {
                    "sent": "Web surfing, the term web surfing was basically people looking at other people's content.",
                    "label": 0
                },
                {
                    "sent": "Few people were publishing.",
                    "label": 0
                },
                {
                    "sent": "Then they say the E Commerce the e.the.net.com boom and bust they actually had already got most of the technology for ecommerce running, but why did it all go?",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Lost.",
                    "label": 0
                },
                {
                    "sent": "The real reason was because they didn't have the bandwidth.",
                    "label": 0
                },
                {
                    "sent": "Now we talk about this new buzzword thing Web 2.",
                    "label": 0
                },
                {
                    "sent": "But what is it?",
                    "label": 0
                },
                {
                    "sent": "And you can read papers on the Internet which will tell you OK, web two is all about social networking.",
                    "label": 0
                },
                {
                    "sent": "It's all about.",
                    "label": 0
                },
                {
                    "sent": "Ajax let's say this new technology, which is actually just JavaScript.",
                    "label": 0
                },
                {
                    "sent": "It was nothing new at all.",
                    "label": 0
                },
                {
                    "sent": "Ajax for special clients like Google Maps, Google, Gmail and so on.",
                    "label": 0
                },
                {
                    "sent": "And easy syndication RSS.",
                    "label": 0
                },
                {
                    "sent": "There are three things that they kind of get lumped together in this web.",
                    "label": 0
                },
                {
                    "sent": "Two connection, which is social network sites, RSS and Ajax.",
                    "label": 0
                },
                {
                    "sent": "And all these things are nice.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But really, that what changed is.",
                    "label": 0
                },
                {
                    "sent": "What really changed was the widespread deployment of broadband.",
                    "label": 1
                },
                {
                    "sent": "Because it only became possible at that moment for you to really get involved and publish yourself.",
                    "label": 0
                },
                {
                    "sent": "So user user interaction on the Internet only really became feasible when broadband was in everyone's house.",
                    "label": 0
                },
                {
                    "sent": "Today, there's about a billion users of the Internet.",
                    "label": 0
                },
                {
                    "sent": "And and 80% of them have got broadband.",
                    "label": 0
                },
                {
                    "sent": "So now is that.",
                    "label": 0
                },
                {
                    "sent": "That's why now there's this sudden boom up in in the in the web again.",
                    "label": 0
                },
                {
                    "sent": "An interesting fact there was a survey done in February this year, and to estimate how much data is on online.",
                    "label": 0
                },
                {
                    "sent": "And we came up this this.",
                    "label": 0
                },
                {
                    "sent": "This estimate, which was done basically by sampling various sites and doing a rough estimate came up with this figure of 1.6 * 10 to the 20 bytes, which is I believe, 1.6 exabytes.",
                    "label": 0
                },
                {
                    "sent": "It's about 1000 million thousand.",
                    "label": 0
                },
                {
                    "sent": "It's about a billion.",
                    "label": 0
                },
                {
                    "sent": "Terabytes.",
                    "label": 0
                },
                {
                    "sent": "Now it sounds a huge number, but if you think about it, Avogadro's number, which is 3 orders of magnitude bigger.",
                    "label": 0
                },
                {
                    "sent": "Is the main number of molecules in one gram of hydrogen so.",
                    "label": 0
                },
                {
                    "sent": "It puts things in perspective because if you wanted to, if you wanted to give the if you wanted to describe all those molecules in one gram of hydrogen gas, you'd need.",
                    "label": 0
                },
                {
                    "sent": "Three, you'd need 6 numbers for each molecule.",
                    "label": 0
                },
                {
                    "sent": "This is the position in the momentum, and so you'd have to end up with 18 * 10 to 23.",
                    "label": 0
                },
                {
                    "sent": "So what we think is a huge number is is, uh is perhaps not as big as we think.",
                    "label": 0
                },
                {
                    "sent": "However, it's growing.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The other thing is that low the Internet is the information content is is growing was growing exponentially but it is still growing exponentially.",
                    "label": 0
                },
                {
                    "sent": "But the number of web services also growing, so we have a different problem.",
                    "label": 0
                },
                {
                    "sent": "It's not that there's all this information there, and it's now magically accessible.",
                    "label": 0
                },
                {
                    "sent": "The real problem is that it's all spread over 100 million web servers and it's still we still have this number of 10 users per web server, and this is always roughly being the case.",
                    "label": 1
                },
                {
                    "sent": "Even going back to the 90s, so we've always had this other problem, which is like 10 users per web service, so this is that's where this information jungle comes from, and This is why the search engines are so important, because we can never find anything.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The web is only really usable because we have search engines.",
                    "label": 1
                },
                {
                    "sent": "And the web is evolving now to to active.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Phishing by users.",
                    "label": 0
                },
                {
                    "sent": "This explosion in user publishing is through these social network sites.",
                    "label": 1
                },
                {
                    "sent": "These are some numbers.",
                    "label": 0
                },
                {
                    "sent": "120 million clips viewed on the YouTube soday.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "The blogs the sudden.",
                    "label": 0
                },
                {
                    "sent": "Massive Rise in blog publishing.",
                    "label": 0
                },
                {
                    "sent": "This is measured by this site.",
                    "label": 0
                },
                {
                    "sent": "Technorati, which is like A blog and blog search engine.",
                    "label": 0
                },
                {
                    "sent": "Is interesting also to see where.",
                    "label": 0
                },
                {
                    "sent": "Who's publishing?",
                    "label": 0
                },
                {
                    "sent": "If you look here, the Japanese seem to be publishing as much as the Americans as much as all the English put together as Americans and British.",
                    "label": 0
                },
                {
                    "sent": "So it's not.",
                    "label": 0
                },
                {
                    "sent": "It's not a European or Western phenomenon.",
                    "label": 0
                },
                {
                    "sent": "the Internet is exploding in China at the moment.",
                    "label": 0
                },
                {
                    "sent": "And soon there will be as many Internet users in China as there are in the rest of the world.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Again, this is this is this is just showing how when something happens, if there is a crisis or news crisis, there is some this flux of blogs.",
                    "label": 0
                },
                {
                    "sent": "So if you really want to mine opinions or mine information, perhaps we should be looking at blogs so.",
                    "label": 0
                },
                {
                    "sent": "This is this.",
                    "label": 0
                },
                {
                    "sent": "The top one there I believe is.",
                    "label": 0
                },
                {
                    "sent": "This is the.",
                    "label": 0
                },
                {
                    "sent": "This spike here is the Lebanon War, so there was a huge spike in publishing of information about that now.",
                    "label": 0
                },
                {
                    "sent": "Agreed that a lot of blogs are junk.",
                    "label": 0
                },
                {
                    "sent": "Now if you can find the key ones of the guy who's actually in in Beirut.",
                    "label": 0
                },
                {
                    "sent": "That is the one you need to find.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is just an interesting statistics on on Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "Publishing.",
                    "label": 0
                },
                {
                    "sent": "Maybe maybe the knowledge base is getting full because if you see these, these are the number of these are total articles in different languages, so this is English.",
                    "label": 0
                },
                {
                    "sent": "Now this is all sorry this is English.",
                    "label": 0
                },
                {
                    "sent": "I think this is French and.",
                    "label": 0
                },
                {
                    "sent": "German, this is.",
                    "label": 0
                },
                {
                    "sent": "It's a German is the is the most second most published pages and French is the yellow.",
                    "label": 0
                },
                {
                    "sent": "Is it?",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "So, but they're falling over, so maybe Wikipedia is getting full.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A lot of this work actually is being monitored by a group in the GRC is looking at social.",
                    "label": 0
                },
                {
                    "sent": "The impact of the social impact of the Internet.",
                    "label": 0
                },
                {
                    "sent": "So I'm getting a lot of this information from this group.",
                    "label": 0
                },
                {
                    "sent": "This shows really says cultural variations.",
                    "label": 1
                },
                {
                    "sent": "It's interesting that.",
                    "label": 0
                },
                {
                    "sent": "The Japanese, although they publish a lot of blogs, they're rather hesitant about putting their pictures up.",
                    "label": 0
                },
                {
                    "sent": "This could be a cultural difference, so the Japanese actually don't put many photos or don't put many videos up.",
                    "label": 0
                },
                {
                    "sent": "Malaysia, for some reason is the highest publisher of videos and.",
                    "label": 0
                },
                {
                    "sent": "And photos and you see, there's a.",
                    "label": 0
                },
                {
                    "sent": "The other thing is that the social network sites.",
                    "label": 0
                },
                {
                    "sent": "There's a huge variation in which sites are the most popular.",
                    "label": 0
                },
                {
                    "sent": "So Facebook is the most popular in America.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "But awkward in India and in South Africa in South America seemed to be so.",
                    "label": 0
                },
                {
                    "sent": "There seems to be some sort of regional preference for different social network sites.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of course, this this this graph just says what's obvious that today's geeks are tomorrow's.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "SoC leaders so this change in is going to be permanent.",
                    "label": 0
                },
                {
                    "sent": "In other words, that the change to the Internet being used as a publishing system by everybody is a permanent change.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Edge.",
                    "label": 0
                },
                {
                    "sent": "And it's very of course this thing about the Internet for the for governments is a nightmare because they can't.",
                    "label": 0
                },
                {
                    "sent": "They can't control it.",
                    "label": 0
                },
                {
                    "sent": "It's impossible to censor it.",
                    "label": 0
                },
                {
                    "sent": "So now we move into the dark web, which is like the evil part of the Internet, where we find all sorts of.",
                    "label": 0
                },
                {
                    "sent": "Difficult things.",
                    "label": 0
                },
                {
                    "sent": "This is where the terrorists hang out.",
                    "label": 0
                },
                {
                    "sent": "Let's say.",
                    "label": 0
                },
                {
                    "sent": "So we've got things like racist and extremist propaganda.",
                    "label": 0
                },
                {
                    "sent": "It's very.",
                    "label": 0
                },
                {
                    "sent": "There's nothing to stop you.",
                    "label": 0
                },
                {
                    "sent": "Publishing what you like.",
                    "label": 0
                },
                {
                    "sent": "I mean, of course there is and there are laws in different countries, but it's very difficult if you anonymize the way you publish it and you use an offshore web hosting service for the government for let's say the police to get you.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Al Qaeda couldn't operate without the Internet basically, and it's a very good propaganda tool for them they.",
                    "label": 0
                },
                {
                    "sent": "Can walk over into.",
                    "label": 0
                },
                {
                    "sent": "Pakistan and going to Internet cafe and pub.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This video and they can communicate anonymously, so it's used for various.",
                    "label": 0
                },
                {
                    "sent": "Purpose they the terrorists like say, all kind of use the Internet for various functions, commander control, communicating, propaganda, psychological.",
                    "label": 0
                },
                {
                    "sent": "Let's say propaganda recruitment.",
                    "label": 0
                },
                {
                    "sent": "Fund raising and they themselves are using it for data mining, because if they want to, if they want to find out they can use, go to Google Earth and find out if they want to sight out a target.",
                    "label": 0
                },
                {
                    "sent": "They can find a lot of information about it.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So at the same time that they are using the Internet, then government agencies are trying to find ways to to go back at them.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So how do they use it for command and control?",
                    "label": 1
                },
                {
                    "sent": "Well, they use it for the same advantages that we use it.",
                    "label": 1
                },
                {
                    "sent": "It's very easy to communicate with someone on the other side of the world from some, let's say from the mountain top in back.",
                    "label": 0
                },
                {
                    "sent": "It's done too.",
                    "label": 0
                },
                {
                    "sent": "London is very easy, it's fast, it's secure, you've got global access, and it's fairly anonymous.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Secure communication.",
                    "label": 0
                },
                {
                    "sent": "Public encryption is available to anyone.",
                    "label": 1
                },
                {
                    "sent": "You can encrypt your email and there's very little chance of you being able to have a.",
                    "label": 0
                },
                {
                    "sent": "Of a intercept being able to decode that email.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 1
                },
                {
                    "sent": "So terrorist groups can be dispersed around the world.",
                    "label": 0
                },
                {
                    "sent": "They can communicate on a daily basis and networks have a very much proven capacity to outperform high.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Rock Hill institutions It supports this leaderless resistance.",
                    "label": 0
                },
                {
                    "sent": "The itself is is a sort of.",
                    "label": 0
                },
                {
                    "sent": "There's no central point in the Internet.",
                    "label": 0
                },
                {
                    "sent": "the Internet is a is a amorphous communication network and the same thing for the.",
                    "label": 0
                },
                {
                    "sent": "Terrorist groups?",
                    "label": 0
                },
                {
                    "sent": "They can.",
                    "label": 0
                },
                {
                    "sent": "It allows them to function independent of state sponsorship.",
                    "label": 0
                },
                {
                    "sent": "You don't.",
                    "label": 0
                },
                {
                    "sent": "I mean, al Qaeda doesn't need the Taliban anymore to maintain its operation ability operations.",
                    "label": 0
                },
                {
                    "sent": "It can work on the Internet.",
                    "label": 1
                },
                {
                    "sent": "They're pretty much, but involve removes the vulnerability to retaliation.",
                    "label": 1
                },
                {
                    "sent": "the Americans can't go and bomb every Internet cafe in.",
                    "label": 0
                },
                {
                    "sent": "In Pakistan, for example they, whereas when they were concentrated in training camps in in Afghanistan, they.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just a bit about secure communications.",
                    "label": 0
                },
                {
                    "sent": "Cryptography.",
                    "label": 0
                },
                {
                    "sent": "OK, you encrypt your messages, but you can't hide the fact that you've sent it, so you can still monitor in email traffic even if you can't read it.",
                    "label": 0
                },
                {
                    "sent": "So this is this.",
                    "label": 0
                },
                {
                    "sent": "Is it still possible to track messaging between two people on the Internet or by email?",
                    "label": 0
                },
                {
                    "sent": "But the code Breakers got to discover the key basically before he can decode what's being written the other way.",
                    "label": 0
                },
                {
                    "sent": "Another is stag steganography, which means you hide your message in an image.",
                    "label": 0
                },
                {
                    "sent": "This is this goes back to Greek ancient Greek times, and of course the Internet is.",
                    "label": 0
                },
                {
                    "sent": "So you place it in place your message inside some image you put it on a website anonymously and you can communicate to your.",
                    "label": 0
                },
                {
                    "sent": "To the the salad and they they used.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So these are some of it, but they're much simpler tricks if you want to be anonymous.",
                    "label": 0
                },
                {
                    "sent": "These are tricks that have that have been used in the past.",
                    "label": 0
                },
                {
                    "sent": "This this information actually is coming from an Israeli woman that was visited the JRC and gave us all this along introduction into this.",
                    "label": 0
                },
                {
                    "sent": "So another trick, you open 30 anonymous email accounts on Hotmail.",
                    "label": 1
                },
                {
                    "sent": "You change, you agree ahead of time that you're going to change email account every month you got 30 different passwords.",
                    "label": 0
                },
                {
                    "sent": "You just change your email account and it's very difficult for the security services to understand what's happening or to follow it because.",
                    "label": 0
                },
                {
                    "sent": "That's one.",
                    "label": 1
                },
                {
                    "sent": "So you can send your email on public computers, in Internet cafes and it's very difficult for them to trace that communication.",
                    "label": 0
                },
                {
                    "sent": "But there's an even easier way, which is you basically open an account on Hotmail.",
                    "label": 0
                },
                {
                    "sent": "You send it, you draft an email, you save it in the drafts account, and the recipient on the other side of the world knows the access to the email account he logs in.",
                    "label": 1
                },
                {
                    "sent": "He looks at the draft, and then he deletes it.",
                    "label": 0
                },
                {
                    "sent": "Now this this is like a dead letter drop in your spy thriller.",
                    "label": 0
                },
                {
                    "sent": "So this is impossible basically to track.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But you could also have coded emails.",
                    "label": 0
                },
                {
                    "sent": "The Mohamed Atta and his accomplice were basically exchanging email before 911 and talking and using code words for different for the targets.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK Internet cafes, as I've already said this this is a quote from one of the ideologues of al Qaeda.",
                    "label": 0
                },
                {
                    "sent": "the Internet is a very effective tool.",
                    "label": 1
                },
                {
                    "sent": "We use it to disseminate information quickly.",
                    "label": 0
                },
                {
                    "sent": "People in Afghanistan go across the border and send email and now they can send.",
                    "label": 1
                },
                {
                    "sent": "They can post videos of bin Laden.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So on the tax though, what could the I mean?",
                    "label": 0
                },
                {
                    "sent": "A lot of people worry about terrorists actually attacking the Internet.",
                    "label": 0
                },
                {
                    "sent": "And so this goes under the name of electronic warfare and Hacker warfare.",
                    "label": 1
                },
                {
                    "sent": "So the idea would be that the terrorist group would sabotage the Internet, bring down with a massive effect on the world economy.",
                    "label": 0
                },
                {
                    "sent": "And then the cycle of the use of it for psychological warfare, ideology, etc.",
                    "label": 0
                },
                {
                    "sent": "So a lot of there's a lot of people extremely worried and trying to protect themselves against attack.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So how would they do that?",
                    "label": 0
                },
                {
                    "sent": "Well, you need to disrupt the communication.",
                    "label": 1
                },
                {
                    "sent": "You need to damage vital hardware.",
                    "label": 1
                },
                {
                    "sent": "One thing about the Internet is it's designed to.",
                    "label": 0
                },
                {
                    "sent": "It's exactly what it's designed to withstand.",
                    "label": 0
                },
                {
                    "sent": "the Internet was came out of the DARPA program, so it was designed such that you could take out some links of the Internet.",
                    "label": 0
                },
                {
                    "sent": "It would root itself around it.",
                    "label": 0
                },
                {
                    "sent": "And these are some of the methods that you could use.",
                    "label": 0
                },
                {
                    "sent": "You can.",
                    "label": 0
                },
                {
                    "sent": "Electromagnetic pulsing odizor.",
                    "label": 0
                },
                {
                    "sent": "Damage to vital Hartigan.",
                    "label": 0
                },
                {
                    "sent": "Blow up.",
                    "label": 0
                },
                {
                    "sent": "Or you could attack.",
                    "label": 0
                },
                {
                    "sent": "You can send Worms hack hack into the.",
                    "label": 1
                },
                {
                    "sent": "Into information systems and so on.",
                    "label": 0
                },
                {
                    "sent": "But this is really what right now.",
                    "label": 0
                },
                {
                    "sent": "I don't think myself that I mean why would the terrorist groups damage the Internet if it's so useful to them?",
                    "label": 0
                },
                {
                    "sent": "I mean, it doesn't.",
                    "label": 0
                },
                {
                    "sent": "I think a lot of the worries about specific attacks on the Internet infrastructure are over exaggerating there more that they do definitely behave in this.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mainly that area where they.",
                    "label": 0
                },
                {
                    "sent": "They they.",
                    "label": 0
                },
                {
                    "sent": "They perform that it's in the propaganda and the information exchange that they're really working.",
                    "label": 0
                },
                {
                    "sent": "This is just an illustration of how recruitment happens and this is there is actually examples of this in.",
                    "label": 0
                },
                {
                    "sent": "That there's a there's this forum.",
                    "label": 0
                },
                {
                    "sent": "This this terrorist form Jihadi forum where you have an arm chair is not an active terrorist.",
                    "label": 0
                },
                {
                    "sent": "He's basically going to the forum and he's he's picking up his posting and responding.",
                    "label": 0
                },
                {
                    "sent": "He's he's talking to a some sort of idea.",
                    "label": 0
                },
                {
                    "sent": "Log for the whatever it is and.",
                    "label": 0
                },
                {
                    "sent": "The ideologue puts him in touch with the local operations guy.",
                    "label": 0
                },
                {
                    "sent": "Who brings him together with other arm chair?",
                    "label": 0
                },
                {
                    "sent": "She had his first fully connected a contact him, and he brings it out.",
                    "label": 0
                },
                {
                    "sent": "Maybe send him on a rafting trip in the Lake District if you don't know the English to one and then you have your terrorist cell.",
                    "label": 0
                },
                {
                    "sent": "And then they blow up some building.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But the the psychological warfare.",
                    "label": 0
                },
                {
                    "sent": "Aspect.",
                    "label": 0
                },
                {
                    "sent": "When I finish this review, we're going to have a break.",
                    "label": 0
                },
                {
                    "sent": "How terrorists manipulate public opinion.",
                    "label": 1
                },
                {
                    "sent": "This is in Western.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The boxes are very.",
                    "label": 0
                },
                {
                    "sent": "What what does it mean?",
                    "label": 0
                },
                {
                    "sent": "It means you're trying to disrupt or damage what a target population knows or thinks it knows about itself.",
                    "label": 1
                },
                {
                    "sent": "Make it uncertain, make some get it.",
                    "label": 0
                },
                {
                    "sent": "Unstable.",
                    "label": 1
                },
                {
                    "sent": "But democracy is particularly vulnerable to that.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 1
                },
                {
                    "sent": "Because we allow opinions on different subjects, the true censorship is almost impossible on the Internet.",
                    "label": 0
                },
                {
                    "sent": "We governments can't control what their citizens use.",
                    "label": 0
                },
                {
                    "sent": "the Chinese have got this.",
                    "label": 0
                },
                {
                    "sent": "This great firewall of China.",
                    "label": 0
                },
                {
                    "sent": "They have team hundreds of people who are basically adding URLs which are blocked from entering the Chinese Internet.",
                    "label": 0
                },
                {
                    "sent": "But of course they can't really control what is published inside China, so the growth in blogs etc.",
                    "label": 0
                },
                {
                    "sent": "They can't check what is happening inside China.",
                    "label": 0
                },
                {
                    "sent": "People are publishing.",
                    "label": 0
                },
                {
                    "sent": "They can inject.",
                    "label": 1
                },
                {
                    "sent": "They can only block external sites.",
                    "label": 0
                },
                {
                    "sent": "OK, they can close down websites that they don't agree with, but it's extremely difficult to censor the Internet.",
                    "label": 0
                },
                {
                    "sent": "The other thing is it provides this forum for free speech without any accountability.",
                    "label": 0
                },
                {
                    "sent": "You can say what you like.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You can.",
                    "label": 0
                },
                {
                    "sent": "You can you can tailor your messages to suit your audience in different languages.",
                    "label": 0
                },
                {
                    "sent": "And there's this thing about the web which is weightless.",
                    "label": 0
                },
                {
                    "sent": "It's it's very difficult to tell.",
                    "label": 0
                },
                {
                    "sent": "The authority of the person or the site that you're looking at.",
                    "label": 0
                },
                {
                    "sent": "So the website of the terrorist group can appear just as valid as that of a serious news agency.",
                    "label": 1
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this was a this is a website which is now banned in the UK.",
                    "label": 0
                },
                {
                    "sent": "Which looks a bit like a news site and you might and people you might be fooled into thinking that this is some.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Authoritative news site.",
                    "label": 0
                },
                {
                    "sent": "So what countermeasures our people are?",
                    "label": 0
                },
                {
                    "sent": "The are being taken to counteract this.",
                    "label": 0
                },
                {
                    "sent": "Well, there are active and passive.",
                    "label": 1
                },
                {
                    "sent": "Attacks to disrupt the terrorist electronic network.",
                    "label": 0
                },
                {
                    "sent": "Active tag attacks would be actually to in.",
                    "label": 0
                },
                {
                    "sent": "In fact, their computers with a with a virus, basically.",
                    "label": 0
                },
                {
                    "sent": "You if you can put a virus on the on the someone's computer, then you can basically track what they're doing.",
                    "label": 0
                },
                {
                    "sent": "It's a bit like a phone tag, so you go into someones house.",
                    "label": 0
                },
                {
                    "sent": "You you put a bug in their phone and you listen to the phone.",
                    "label": 0
                },
                {
                    "sent": "The same thing is true for a computer.",
                    "label": 0
                },
                {
                    "sent": "If you break into someone's house and you infect their computer with a virus, then that virus can sit there and it can send back regular email to you whenever they connect to the Internet.",
                    "label": 0
                },
                {
                    "sent": "Saying or let's say they can transmit the information of what they've been doing.",
                    "label": 0
                },
                {
                    "sent": "This is the.",
                    "label": 0
                },
                {
                    "sent": "So these passive attacks will monitor the emails and transfer the data and watch the traffic patterns.",
                    "label": 1
                },
                {
                    "sent": "And that is going on.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the implications of all this is that there is this huge surveillance effort going on in most most national.",
                    "label": 0
                },
                {
                    "sent": "Security services, or, let's say most national police forces have got a team of people who are basically.",
                    "label": 0
                },
                {
                    "sent": "Surveillance monitoring the Internet.",
                    "label": 0
                },
                {
                    "sent": "There are some very good jobs to be had for hackers actually in these security agencies.",
                    "label": 0
                },
                {
                    "sent": "So if you're a good hacker, you can write viruses.",
                    "label": 0
                },
                {
                    "sent": "They will give you a good job, because that's exactly what they're looking for.",
                    "label": 0
                },
                {
                    "sent": "Passive monitoring and data mining.",
                    "label": 0
                },
                {
                    "sent": "So this passive monitoring and data mining tools are much in demand so.",
                    "label": 1
                },
                {
                    "sent": "That's why the tools that can do data mining on the Internet are becoming important, and there's a big market for them and.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That is now I'm going to move on for the second part of the talk to more technical web mining and review how you monitor the Internet with news, but I suggest we take a 5 minute break.",
                    "label": 1
                },
                {
                    "sent": "OK, I think I'll stop.",
                    "label": 0
                },
                {
                    "sent": "So now I'm going to go into the technical details of web mining.",
                    "label": 0
                },
                {
                    "sent": "For real time news.",
                    "label": 0
                },
                {
                    "sent": "And I learned out early on Tuesday last week.",
                    "label": 1
                },
                {
                    "sent": "This is actually data stream mining 'cause the news is a stream of information that's continuously flowing through the system and you're basically trying to extract information, categorize it according to that flow of news that's coming through your.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course, there's not just news that you sites that people want to monitor.",
                    "label": 0
                },
                {
                    "sent": "That is, blogs and maybe, as I said earlier, you probably want to crawl up specific site so there's real time news monitoring, blog monitoring, site crawling, and a much more simple thing is just keep a watch on a specific web page and just tell me when it changes.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is the basic problem with news monitoring?",
                    "label": 0
                },
                {
                    "sent": "What are you trying to do and what are the difficulties?",
                    "label": 0
                },
                {
                    "sent": "Well, in an ideal world you would want to check what you want from a system which monitors the news is I want only information from my reliable news sources and in articles that I'm interested in and are in my own language or my own 3 languages.",
                    "label": 0
                },
                {
                    "sent": "Then Alert me when something happens in the area that I'm interested in.",
                    "label": 1
                },
                {
                    "sent": "And then Alert me when something huge happens.",
                    "label": 0
                },
                {
                    "sent": "So if there's a huge story, I want to know about it.",
                    "label": 0
                },
                {
                    "sent": "So the ideal news monitoring system would.",
                    "label": 0
                },
                {
                    "sent": "Continuously check for you send you updates on anything that happened to be of your interest.",
                    "label": 0
                },
                {
                    "sent": "Alert you when something big happened in your area and also Alert me when something enormous happens.",
                    "label": 0
                },
                {
                    "sent": "So we've got.",
                    "label": 0
                },
                {
                    "sent": "We've got 4 problems.",
                    "label": 1
                },
                {
                    "sent": "You've got an information retrieval problem.",
                    "label": 0
                },
                {
                    "sent": "How to find that data?",
                    "label": 0
                },
                {
                    "sent": "We've got.",
                    "label": 0
                },
                {
                    "sent": "A real time problem, so we have to detect that person's interests very fast.",
                    "label": 0
                },
                {
                    "sent": "We can't afford to be.",
                    "label": 0
                },
                {
                    "sent": "We can't afford to do this in seconds.",
                    "label": 0
                },
                {
                    "sent": "We have to do it in milliseconds.",
                    "label": 0
                },
                {
                    "sent": "We have a search engine problem because we want to let them find any any information they want.",
                    "label": 0
                },
                {
                    "sent": "So we got to index the data.",
                    "label": 0
                },
                {
                    "sent": "We've got to update the index and allowed to search it really fast.",
                    "label": 0
                },
                {
                    "sent": "And then we have for the we have a breaking news detection problem, which means I want to detect those big stories.",
                    "label": 0
                },
                {
                    "sent": "The massive story I don't know ahead of.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Time what it's about.",
                    "label": 0
                },
                {
                    "sent": "It's on the news mining landscape.",
                    "label": 0
                },
                {
                    "sent": "What there's been a lot of interest in this area over the last four or five years and.",
                    "label": 0
                },
                {
                    "sent": "We got sort of three.",
                    "label": 0
                },
                {
                    "sent": "We got this sort of landscape, which I drew.",
                    "label": 0
                },
                {
                    "sent": "You've got various players in there.",
                    "label": 0
                },
                {
                    "sent": "Moreover, Moreover, is and is a content provider.",
                    "label": 0
                },
                {
                    "sent": "Moreover, monitor the websites and they provide a feed which you pay for and you get web news content.",
                    "label": 0
                },
                {
                    "sent": "They really just doing the information retrieval aspect there, tagging the information, and then they're providing onto end users, one of whom would be, say, silent breaker.",
                    "label": 0
                },
                {
                    "sent": "Who takes that further so you see, you've got a number of players in this world, including ourselves, which is the MM.",
                    "label": 0
                },
                {
                    "sent": "And we try to do everything we try to extract.",
                    "label": 0
                },
                {
                    "sent": "We try to retrieve the information we try to classify it.",
                    "label": 0
                },
                {
                    "sent": "Do breaking news detection.",
                    "label": 0
                },
                {
                    "sent": "We try to do everything.",
                    "label": 0
                },
                {
                    "sent": "We've also got the big commercial players LexisNexis, the news agencies, and so on.",
                    "label": 0
                },
                {
                    "sent": "They're all in this game as well.",
                    "label": 0
                },
                {
                    "sent": "It's a big big business.",
                    "label": 0
                },
                {
                    "sent": "And we have different levels of education as you go to the right.",
                    "label": 0
                },
                {
                    "sent": "From just simply news portals going right through to data mining, social network derivation and as well here later on event extraction from news.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "An important thing about news, this flow of information is that people's attention span is getting shorter and shorter.",
                    "label": 1
                },
                {
                    "sent": "They're not really interested in in the news from last week.",
                    "label": 0
                },
                {
                    "sent": "In fact, very few of them are 9095% of people want to know what's happening now, so the attention span is really small.",
                    "label": 0
                },
                {
                    "sent": "So whatever you're doing, you have to do it immediately.",
                    "label": 0
                },
                {
                    "sent": "It's real time processing it's data stream mining if you like.",
                    "label": 0
                },
                {
                    "sent": "And if you want to be effective, if you want to send alerts to people, you must do it immediately.",
                    "label": 0
                },
                {
                    "sent": "So that's a, let's say the information extraction problem has to be really.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Fast.",
                    "label": 0
                },
                {
                    "sent": "There's other, if there's other characteristics of news which is unique to news.",
                    "label": 0
                },
                {
                    "sent": "There's a weekly pattern of of publishing, and let's say if you're in France, most journalists are asleep at night, although some aren't, and you have a daily rhythm of news articles, which goes down, never falls to zero, of course, because there's people working at night.",
                    "label": 0
                },
                {
                    "sent": "And so you have a daily pattern.",
                    "label": 0
                },
                {
                    "sent": "Weekends, you have less news Friday afternoon.",
                    "label": 0
                },
                {
                    "sent": "You tend to get less news because people are leaving work early or in the case in London.",
                    "label": 0
                },
                {
                    "sent": "They are all in the pub but.",
                    "label": 0
                },
                {
                    "sent": "The There's also a daily pattern of news, so normally from 5:00 AM onwards the websites are being updated with normal news, but then every now and again something huge happens and it can happen at anytime.",
                    "label": 0
                },
                {
                    "sent": "And then there's a flood of news coming in.",
                    "label": 0
                },
                {
                    "sent": "So you've got to be prepared for that flood of news which is a terrorist bomb attack or whatever it is.",
                    "label": 0
                },
                {
                    "sent": "And then we got the different time zone problem.",
                    "label": 0
                },
                {
                    "sent": "So although it's true for France that that there's this rhythm, if you take English, for example, you've got English news coming from the Asia, and so on.",
                    "label": 0
                },
                {
                    "sent": "So you've got different flows of information from around the world, which is coming in, and you've got to cope with it.",
                    "label": 0
                },
                {
                    "sent": "You don't need to update your.",
                    "label": 0
                },
                {
                    "sent": "You don't need to check websites, you only need to check websites often that the ones that are being updated frequently.",
                    "label": 0
                },
                {
                    "sent": "You don't need to check weekly news publications every 10 minutes because they don't get updated.",
                    "label": 0
                },
                {
                    "sent": "They normally get daily once a day actually.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Updated rapidly, we want to be multilingual because we want to have worldwide coverage with.",
                    "label": 1
                },
                {
                    "sent": "We often have a problem with duplication because one news agency will publish an article which will be picked up by different websites and it will be a duplicant.",
                    "label": 0
                },
                {
                    "sent": "Actually, the search engine problem on news is much simpler than the search engine problem on the web.",
                    "label": 0
                },
                {
                    "sent": "The reason for that is that the page ranking problem is trivial.",
                    "label": 1
                },
                {
                    "sent": "The only what people when you search for news.",
                    "label": 0
                },
                {
                    "sent": "The only thing you're interested in is the time order.",
                    "label": 0
                },
                {
                    "sent": "You don't want.",
                    "label": 0
                },
                {
                    "sent": "You don't want to search in archive of news and find some article number one hit which was from 2 weeks ago.",
                    "label": 0
                },
                {
                    "sent": "It's actually very simple, so when you search when you index news articles, you just have a time is the crucial thing.",
                    "label": 0
                },
                {
                    "sent": "So when you bring back with search results you time order them.",
                    "label": 0
                },
                {
                    "sent": "You might also want to rank them by source, so you want to trust the BBC more than another source.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the frequency of updates you need to check sites for updates every 10 minutes if they're being updated regularly, like the BBC or CNN.",
                    "label": 0
                },
                {
                    "sent": "And there's a varying degree of that.",
                    "label": 0
                },
                {
                    "sent": "So you need a directory of websites which allow it, which you keep, which keeps your.",
                    "label": 1
                },
                {
                    "sent": "These are the sources that you want to monitor, and you want to have different up.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Frequencies.",
                    "label": 0
                },
                {
                    "sent": "Basically, you go to the website and you check for updates, which means that you're looking for new headlines on that site.",
                    "label": 0
                },
                {
                    "sent": "We and other people use a method called scraping, now scraping.",
                    "label": 0
                },
                {
                    "sent": "What does it mean?",
                    "label": 0
                },
                {
                    "sent": "It means that we try to convert that headline page into XML format called RSS.",
                    "label": 0
                },
                {
                    "sent": "Well, everyone knows RSS is is perfect for news.",
                    "label": 1
                },
                {
                    "sent": "Blim arises because HTML is dirty and.",
                    "label": 0
                },
                {
                    "sent": "In order to handle that, we want an automatic procedure which we can handle in milliseconds, so we ourselves are using XLT to transform X HTML into RSS.",
                    "label": 0
                },
                {
                    "sent": "This is easy, so for every site you want to monitor, you want to produce a stylesheet.",
                    "label": 0
                },
                {
                    "sent": "That stylesheet tells the software transformation how to convert the HTML into XML, which is RSS in this case.",
                    "label": 0
                },
                {
                    "sent": "But the problem there is that.",
                    "label": 0
                },
                {
                    "sent": "Web browsers are very.",
                    "label": 0
                },
                {
                    "sent": "The web browser very dirty.",
                    "label": 0
                },
                {
                    "sent": "I mean HTML is a dirty language.",
                    "label": 0
                },
                {
                    "sent": "It's about how it looks on the page.",
                    "label": 0
                },
                {
                    "sent": "It doesn't tell you anything about the content, so as such.",
                    "label": 0
                },
                {
                    "sent": "And there's quite a bit of work involved into converting access to HTML to HTML.",
                    "label": 0
                },
                {
                    "sent": "So what you do then is you keep a cache of the results for one website, which is an RSS feed.",
                    "label": 0
                },
                {
                    "sent": "So for every every site you keep an RSS feed, and if there's a new item you append it to the to the end of the RSS feed, and then you process the text.",
                    "label": 0
                },
                {
                    "sent": "Problem with the web that this method is that the excess LTS can change because the website changes, so you have a maintenance problem everyone has that problem who all the people who are monitoring websites regularly have this problem, but when they changed the design of the website it breaks the system.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "RSS get dates back to Netscape.",
                    "label": 0
                },
                {
                    "sent": "Actually, it it was invented by Netscape when they used to have these things called channels, so the first version of RSS was called.",
                    "label": 0
                },
                {
                    "sent": "I think it was.",
                    "label": 0
                },
                {
                    "sent": "Site syndication original meeting today.",
                    "label": 0
                },
                {
                    "sent": "It really means really simple syndication, and it's basically.",
                    "label": 0
                },
                {
                    "sent": "The minimum metadata you need for a news item.",
                    "label": 0
                },
                {
                    "sent": "Basically it tells you the source BBC, in this case title, which is a headline and.",
                    "label": 0
                },
                {
                    "sent": "Normally the link the URL that you that points to the to the web page that you are talking about and then the new story itself, which is a short description of what the text is.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "About now, the good news about RSS is that suddenly become very popular, which means that your life should get easier because websites are now publishing providing RSS feeds.",
                    "label": 1
                },
                {
                    "sent": "So suddenly monitoring the news is becoming much easier because you all you need to do is to check their RSS.",
                    "label": 0
                },
                {
                    "sent": "Feed every five minutes.",
                    "label": 0
                },
                {
                    "sent": "It's and if there's a new item, you'll pick it up.",
                    "label": 0
                },
                {
                    "sent": "But the bad news is that they are cheating on us because often the content that you get from the RSS feed is not the live content.",
                    "label": 1
                },
                {
                    "sent": "They're basically trying to.",
                    "label": 0
                },
                {
                    "sent": "If you really want to be.",
                    "label": 0
                },
                {
                    "sent": "The most up-to-date you still have to scrape in many cases because the RSS feed can actually be delayed and in some cases we found it's delayed up to 24 hours, so you think you'll get your monitoring.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "News, but you're not.",
                    "label": 0
                },
                {
                    "sent": "This is our system AMM, which is basically the consistent scrapes the webs keeps a directory of.",
                    "label": 0
                },
                {
                    "sent": "The Directory of sites that it's monitoring, and then it detects new articles and IT process it through our alert system.",
                    "label": 0
                },
                {
                    "sent": "It indexes it, indexes the.",
                    "label": 0
                },
                {
                    "sent": "Let's see.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This is the scraper system is running 24 hours a day in multithreaded.",
                    "label": 0
                },
                {
                    "sent": "Scraping of websites were monitoring 1200 websites.",
                    "label": 0
                },
                {
                    "sent": "We are feeding in RSS caches of all the content of those websites.",
                    "label": 0
                },
                {
                    "sent": "We are then going off a reading all the articles, pumping it through the alert system, indexing all the text, and we've got a breaking news detection system which we're going to talk about a minute and we go out and eventually we come out with our news brief.",
                    "label": 0
                },
                {
                    "sent": "Now, if you want to have a peaceful life.",
                    "label": 0
                },
                {
                    "sent": "In the MMR system is used by the European Commission and it is a they rely on it basically even at weekends all the spokespersons are relying on information that's being pumped to them by this system.",
                    "label": 0
                },
                {
                    "sent": "Now if you want to have a peaceful life, you gotta make sure that it's fast and reliable, otherwise you're going to go in all the time and it used to happen to us.",
                    "label": 0
                },
                {
                    "sent": "So we've paid a lot of attention in.",
                    "label": 0
                },
                {
                    "sent": "In getting it to work as best as most efficiently as possible.",
                    "label": 0
                },
                {
                    "sent": "Now we've tested our response against Google News and.",
                    "label": 0
                },
                {
                    "sent": "We're not done with it.",
                    "label": 0
                },
                {
                    "sent": "In 2004 we were at least one hour faster than Google News.",
                    "label": 0
                },
                {
                    "sent": "Since then, we're about the same now in speed, that is.",
                    "label": 0
                },
                {
                    "sent": "A bit more how the the software is working.",
                    "label": 0
                },
                {
                    "sent": "So the scraper.",
                    "label": 0
                },
                {
                    "sent": "This is the system that is keeping a cache of RSS feeds passes the information to the, grab it.",
                    "label": 0
                },
                {
                    "sent": "So if there's a new article, if one of those websites a new articles published, this software will go to that website and extract the text from the web page.",
                    "label": 0
                },
                {
                    "sent": "It will also bring in any news wires, so inside the Commission were also feeding news wire.",
                    "label": 0
                },
                {
                    "sent": "Some Reuters AFP and so on.",
                    "label": 0
                },
                {
                    "sent": "This will go in again in RSS into the alert system which is classified.",
                    "label": 0
                },
                {
                    "sent": "Let's say this is the topic detection system which is detecting topics.",
                    "label": 0
                },
                {
                    "sent": "It tags the content with the topics.",
                    "label": 0
                },
                {
                    "sent": "It goes into a a system which is it is a filtering system which allows you to filter even more fine detail.",
                    "label": 0
                },
                {
                    "sent": "And then it goes out to.",
                    "label": 0
                },
                {
                    "sent": "Breaking news this system and indexing system for our search engine and it goes off to the News Explorer processing which you're going.",
                    "label": 0
                },
                {
                    "sent": "You've heard about or will hear about, and then we produce a website.",
                    "label": 0
                },
                {
                    "sent": "We produce our web interface.",
                    "label": 0
                },
                {
                    "sent": "So we had some hard lessons to learn and basically this was a compromise between speed and efficiency.",
                    "label": 0
                },
                {
                    "sent": "Now we've used cues to make things bad, things happen all the time on the Internet.",
                    "label": 0
                },
                {
                    "sent": "Like a site will.",
                    "label": 0
                },
                {
                    "sent": "Let's say there's a network problem.",
                    "label": 0
                },
                {
                    "sent": "You need queues so that you don't flood your system.",
                    "label": 0
                },
                {
                    "sent": "That processes don't stop, etc.",
                    "label": 0
                },
                {
                    "sent": "So this is this illustrates really how I how are software or other people suffer.",
                    "label": 0
                },
                {
                    "sent": "I think.",
                    "label": 0
                },
                {
                    "sent": "Moreover, user similar technique will for example convert this BBC web page into an RSS feed.",
                    "label": 0
                },
                {
                    "sent": "It will go in.",
                    "label": 0
                },
                {
                    "sent": "And it will identify the headlines.",
                    "label": 0
                },
                {
                    "sent": "This is through an X style sheet.",
                    "label": 0
                },
                {
                    "sent": "It will pick up the short piece of text and.",
                    "label": 0
                },
                {
                    "sent": "It will not pick up the menus.",
                    "label": 0
                },
                {
                    "sent": "This is why crawling doesn't work OK. Why don't we crawl the website?",
                    "label": 0
                },
                {
                    "sent": "The problem with crawlers is that they will pick up adverts.",
                    "label": 0
                },
                {
                    "sent": "They'll pick up sidebars etc.",
                    "label": 0
                },
                {
                    "sent": "We just want those headlines, so this is every website somebody looks at the website and they optimize the XLT so it will only pick up the news headlines.",
                    "label": 0
                },
                {
                    "sent": "Then then we will follow the articles through this grabber software.",
                    "label": 0
                },
                {
                    "sent": "It will go out and it'll read that text.",
                    "label": 0
                },
                {
                    "sent": "And then there's a specific software which will extract just the pure text.",
                    "label": 0
                },
                {
                    "sent": "Again, we have the problem that we don't want to index all this stuff at the side, so we don't want index related stories or let's say.",
                    "label": 0
                },
                {
                    "sent": "This is this menu bar which will cause havoc with our classification system.",
                    "label": 0
                },
                {
                    "sent": "So it is very important just to get the tech stuff.",
                    "label": 0
                },
                {
                    "sent": "So then we we will detect.",
                    "label": 0
                },
                {
                    "sent": "Keywords that we have cashed in our alert system and will try and classify that this article is really about Sudan.",
                    "label": 0
                },
                {
                    "sent": "And it's we will detect 10th one of these 10,000 keywords in a .1 of a second.",
                    "label": 0
                },
                {
                    "sent": "We have to be so we have to be.",
                    "label": 0
                },
                {
                    "sent": "Our goal is to get the topic classification done in 100 milliseconds.",
                    "label": 0
                },
                {
                    "sent": "Then we need to sort that out into one or more of 600 alerts, which alerts means.",
                    "label": 0
                },
                {
                    "sent": "Alerts means that our topic like if you like.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Our objective then, is the filters.",
                    "label": 0
                },
                {
                    "sent": "Real time multilingual news.",
                    "label": 0
                },
                {
                    "sent": "So multilingual is important here as well so that we have a topic which we can define in different languages now are.",
                    "label": 0
                },
                {
                    "sent": "There's a whole area of research on topic detection and tracking, which is this DARPA program etc.",
                    "label": 0
                },
                {
                    "sent": "Now topic detection in this context was really more related to the breaking news detection in our case or in many in the case of.",
                    "label": 0
                },
                {
                    "sent": "Moreover as well.",
                    "label": 0
                },
                {
                    "sent": "What we have done is to define predefined topics we have, for example, news about every country of the world.",
                    "label": 0
                },
                {
                    "sent": "So it's not that we need to discover that there's a new topic about this country we have predefined.",
                    "label": 0
                },
                {
                    "sent": "600 different categories which we are filtering news into.",
                    "label": 0
                },
                {
                    "sent": "So for speed reasons we're using a finite state machine which is looking which is preloaded with these patterns, and then the text is being run through in parallel and the will pick up articles that are basically mentioning those keywords by weighted sums or Boolean combinations.",
                    "label": 0
                },
                {
                    "sent": "This is really like fishing, so we define what we're looking for as an alert.",
                    "label": 0
                },
                {
                    "sent": "We throw it in the River and we wait for a news item to come along and we find it.",
                    "label": 0
                },
                {
                    "sent": "We pick it up, we throw it into our been our basket.",
                    "label": 0
                },
                {
                    "sent": "So this is basically how topic RSS feeds are generated.",
                    "label": 0
                },
                {
                    "sent": "All the news is flowing through and we throw it into baskets.",
                    "label": 0
                },
                {
                    "sent": "A bit more detail what it looks like so.",
                    "label": 0
                },
                {
                    "sent": "These are two examples on the 1st example we've got a Boolean combination.",
                    "label": 0
                },
                {
                    "sent": "We can also have a proximity value, so we can say in this case that we want sustainable and energy to appear within 2 words of each other.",
                    "label": 0
                },
                {
                    "sent": "So this is basically saying or three words of each other and we've got it in different languages.",
                    "label": 0
                },
                {
                    "sent": "So our topic selection is multilingual.",
                    "label": 0
                },
                {
                    "sent": "We support, I think we're managing about 30 languages.",
                    "label": 0
                },
                {
                    "sent": "It's about 30 languages.",
                    "label": 0
                },
                {
                    "sent": "The sites that we're monitoring, so we basically.",
                    "label": 0
                },
                {
                    "sent": "Now these topics are predefined, so we need an expert too.",
                    "label": 0
                },
                {
                    "sent": "How does we define these topics?",
                    "label": 0
                },
                {
                    "sent": "We basically it's a trial and error problem.",
                    "label": 0
                },
                {
                    "sent": "You have a human, he does it, he sets up.",
                    "label": 0
                },
                {
                    "sent": "They set up an alert.",
                    "label": 0
                },
                {
                    "sent": "We look at the results.",
                    "label": 0
                },
                {
                    "sent": "We fine tune it according to whether you know there was a classic case of them.",
                    "label": 0
                },
                {
                    "sent": "One of the commissioners was called burn David Byrne.",
                    "label": 0
                },
                {
                    "sent": "I think his name was one of the he was a top guy in the Commission for working under Pro D at the time, but there was a lead singer of a pop group called David Byrne.",
                    "label": 0
                },
                {
                    "sent": "It's I think it's.",
                    "label": 0
                },
                {
                    "sent": "Talking heads so he was flooded with information by this this guy, which was not too happy.",
                    "label": 0
                },
                {
                    "sent": "So we basically you need to fine tune your alert definitions to avoid embarrassment.",
                    "label": 0
                },
                {
                    "sent": "But this is, this is basically the way.",
                    "label": 0
                },
                {
                    "sent": "Ours and many other.",
                    "label": 0
                },
                {
                    "sent": "Systems work.",
                    "label": 0
                },
                {
                    "sent": "What's more related now to the topic detection, is this.",
                    "label": 0
                },
                {
                    "sent": "Here if you think about breaking news, what is it you're trying to do?",
                    "label": 0
                },
                {
                    "sent": "You're trying to detect the unexpected, so you don't know ahead of time what you're looking for, but something happens and you want to find it.",
                    "label": 0
                },
                {
                    "sent": "So this is basically looking for changes in fluxes, changes in patterns of news.",
                    "label": 0
                },
                {
                    "sent": "We have we have got two ways of doing this.",
                    "label": 0
                },
                {
                    "sent": "This is the original way which was basically based on the idea that you've got a flow of information is like a River you've got.",
                    "label": 0
                },
                {
                    "sent": "You've got flows of news.",
                    "label": 0
                },
                {
                    "sent": "Coming through your pipe and suddenly you're looking for a pattern whereby suddenly a certain word is used much more frequently than than previously, so it's a it's a differential problem you're looking for.",
                    "label": 0
                },
                {
                    "sent": "You're looking for a pattern whereby inside your news stories a new word appears and it's in our case, we decided to concentrate on capitalized words because it's always the case, and now it says bomb in Mosel or something.",
                    "label": 0
                },
                {
                    "sent": "The word is, it's usually.",
                    "label": 0
                },
                {
                    "sent": "Yeah exactly, we had.",
                    "label": 0
                },
                {
                    "sent": "We actually tried.",
                    "label": 0
                },
                {
                    "sent": "We've got this running.",
                    "label": 0
                },
                {
                    "sent": "We have Germans another problem.",
                    "label": 0
                },
                {
                    "sent": "So for that we still using.",
                    "label": 0
                },
                {
                    "sent": "We're still using the capitalized word thing, but we have a much tougher problem with disambiguating noise.",
                    "label": 0
                },
                {
                    "sent": "Let's I'm going to talk a bit about that.",
                    "label": 0
                },
                {
                    "sent": "How that was done.",
                    "label": 0
                },
                {
                    "sent": "The new system, which is I'm going to describe in a minute, avoids that problem completely.",
                    "label": 0
                },
                {
                    "sent": "So this is the original system whereby we are looking for that sort of pattern.",
                    "label": 0
                },
                {
                    "sent": "And this is completely this is this is this formula with a simple formula was developed basically.",
                    "label": 0
                },
                {
                    "sent": "By we focused what we did is we took the the Bali bombing.",
                    "label": 0
                },
                {
                    "sent": "This is going back into 2003.",
                    "label": 0
                },
                {
                    "sent": "I think it was and we looked at the flight.",
                    "label": 0
                },
                {
                    "sent": "We took that as our sample.",
                    "label": 0
                },
                {
                    "sent": "We took all the news out about the Bali bombing and we tuned our algorithm such that it would pick that up, but it's suppressed.",
                    "label": 0
                },
                {
                    "sent": "Other stories so that you got 2 problems with breaking news.",
                    "label": 0
                },
                {
                    "sent": "You want to pick it up when it's growing, but you don't want to.",
                    "label": 0
                },
                {
                    "sent": "Even if it stays remains a big story you don't want to flood people with it.",
                    "label": 0
                },
                {
                    "sent": "So you need to have a thing that slowly decays and this is done because we're taking a.",
                    "label": 0
                },
                {
                    "sent": "We're taking a rolling rolling average over, so we gotta figure here, which is like the rolling time average of occurrences of a monitored topic is means a keyword.",
                    "label": 0
                },
                {
                    "sent": "Per hour, so this is this is George Bush.",
                    "label": 0
                },
                {
                    "sent": "This is like the number of times I would expect to find Bush in the news per hour over the last.",
                    "label": 0
                },
                {
                    "sent": "I think we take it over the three week.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Now, if someone assassinates George Bush.",
                    "label": 0
                },
                {
                    "sent": "Then suddenly we've got.",
                    "label": 0
                },
                {
                    "sent": "Instead of having, let's say, let's say we expect to have ten articles an hour mentioning George Bush.",
                    "label": 0
                },
                {
                    "sent": "But suddenly we get 1000 articles.",
                    "label": 0
                },
                {
                    "sent": "Then we trigger that as a as a breaking news story.",
                    "label": 0
                },
                {
                    "sent": "And but then we have another weighting factor.",
                    "label": 0
                },
                {
                    "sent": "This beta is a language dependent factor just to bring to normalize the languages the.",
                    "label": 0
                },
                {
                    "sent": "We we, we added, a factor which is basically saying that we insist on having.",
                    "label": 0
                },
                {
                    "sent": "We wait things more when they come from different sources, so the more sources we've got, the more we believe it's a breaking news story.",
                    "label": 0
                },
                {
                    "sent": "This is to avoid the situation where one I think there's an Italian newspaper who floods news articles on the stock market at a certain moment of the day.",
                    "label": 0
                },
                {
                    "sent": "They flood the flood.",
                    "label": 0
                },
                {
                    "sent": "The thing with new stories on stock prices.",
                    "label": 0
                },
                {
                    "sent": "And of course we had our big problem then is the is the stop word problem.",
                    "label": 0
                },
                {
                    "sent": "Like on Mondays the word Monday tend to appear on Tuesday is the word Tuesday appears, so there's a learning algorithm whereby you suppress the you have a stop word list which you removed from this calculation and that was that was tuned over a few months.",
                    "label": 0
                },
                {
                    "sent": "And this kind of works fairly well now.",
                    "label": 0
                },
                {
                    "sent": "This is basically picking up these are this is this function.",
                    "label": 0
                },
                {
                    "sent": "And we pick up the main top stories.",
                    "label": 0
                },
                {
                    "sent": "This is over.",
                    "label": 0
                },
                {
                    "sent": "I think this is over some days and the first version was basically looking for these.",
                    "label": 0
                },
                {
                    "sent": "These are the keywords that trigger those breaking news stories.",
                    "label": 0
                },
                {
                    "sent": "Now, as well as.",
                    "label": 0
                },
                {
                    "sent": "So this is basically monitoring the flux of news mentioning certain keywords versus time, and you're looking at the rate of change.",
                    "label": 0
                },
                {
                    "sent": "If you're if you talk now about our topics are alerts.",
                    "label": 0
                },
                {
                    "sent": "These are basically the subject areas that we are monitoring.",
                    "label": 0
                },
                {
                    "sent": "This is like the OR your topic on the Pharmaceutical industry.",
                    "label": 0
                },
                {
                    "sent": "You also want to be able to detect.",
                    "label": 0
                },
                {
                    "sent": "Sudden stories inside your predefined topics, which is the same sort of story.",
                    "label": 0
                },
                {
                    "sent": "You keep hourly statistics on the on the flux of articles that you're getting on each of the topics and.",
                    "label": 0
                },
                {
                    "sent": "And so you want to measure, you want to be able to pick up this sudden increase, this is.",
                    "label": 0
                },
                {
                    "sent": "This is an earthquake or something.",
                    "label": 0
                },
                {
                    "sent": "This is a.",
                    "label": 0
                },
                {
                    "sent": "Now this is the ferry disaster on, I think a ferry sunk between Saudi Arabia and Egypt.",
                    "label": 0
                },
                {
                    "sent": "So this shows there's suddenly a flux of articles and you want to pick that up and tell people.",
                    "label": 0
                },
                {
                    "sent": "So here it's it's basically a similar idea.",
                    "label": 0
                },
                {
                    "sent": "You basically assume a normal distribution for articles per hour.",
                    "label": 0
                },
                {
                    "sent": "You are the articles per day.",
                    "label": 0
                },
                {
                    "sent": "In this case you are basically averaging that over a two week.",
                    "label": 0
                },
                {
                    "sent": "And you have an expectation value for how many articles you normally expect on that subject for day.",
                    "label": 0
                },
                {
                    "sent": "And you calculate the standard deviation.",
                    "label": 0
                },
                {
                    "sent": "And basically, if so far that day you suddenly you have more articles and say I think it's about four Sigma for standard deviations.",
                    "label": 0
                },
                {
                    "sent": "Then you trigger a red alert here and you can pick up the main topics that are happening live in different subjects and different.",
                    "label": 0
                },
                {
                    "sent": "In this case different subjects in different countries.",
                    "label": 0
                },
                {
                    "sent": "So this is statistical triggers on flux of news articles, so this is like keeping statistics on the article arriving per hour.",
                    "label": 0
                },
                {
                    "sent": "Not going to be more about our new new.",
                    "label": 0
                },
                {
                    "sent": "Version of the topic detection problem, which is real time clustering so here.",
                    "label": 0
                },
                {
                    "sent": "We we we hesitated about using a clustering algorithm because we wanted to be absolutely sure that the algorithm itself didn't inhibit the time response because the thing about our simple breaking news detection was that it is really fast.",
                    "label": 0
                },
                {
                    "sent": "We were monitoring 50,000 keywords but it still was a very quick and dirty way of picking up news.",
                    "label": 0
                },
                {
                    "sent": "This one is a much more sophisticated way, which is to do real time clustering on the news as it's coming through.",
                    "label": 0
                },
                {
                    "sent": "And we can with this new version we can also do news updates as well as triggering an alert when something happens.",
                    "label": 0
                },
                {
                    "sent": "You can also trigger and second alert when it suddenly changes again.",
                    "label": 0
                },
                {
                    "sent": "So this algorithm is being optimized over four months of of manual learning and checking through the articles.",
                    "label": 0
                },
                {
                    "sent": "This algorithm works is like the like following.",
                    "label": 0
                },
                {
                    "sent": "So we have a flow event of news coming in in each language.",
                    "label": 0
                },
                {
                    "sent": "And we want to detect in that flow of news stories as they develop, and we want to detect sudden events.",
                    "label": 0
                },
                {
                    "sent": "So we basically tokenized the the.",
                    "label": 0
                },
                {
                    "sent": "Each article comes in.",
                    "label": 0
                },
                {
                    "sent": "We tokenize the words and what we found is that we only need to keep the 1st 200 words of each article.",
                    "label": 0
                },
                {
                    "sent": "It doesn't help you.",
                    "label": 0
                },
                {
                    "sent": "In fact, it makes things worse if you take more.",
                    "label": 0
                },
                {
                    "sent": "If you take the full text of a large article, it actually makes it worse.",
                    "label": 0
                },
                {
                    "sent": "The problem gets confusing because the article will talk about something that happened three weeks ago as well, so that we already take the 1st 200 articles.",
                    "label": 0
                },
                {
                    "sent": "We will then, uh, keeping a dynamic frequency count of words in each language, which means this is working in 18 languages, right?",
                    "label": 0
                },
                {
                    "sent": "So for for Bulgarian or Hungarian, we're keeping a frequency count of words that appear in news articles, and we're updating that through a infinite responsibility filter every time we're getting new articles.",
                    "label": 0
                },
                {
                    "sent": "So we're keeping a rolling count of how frequently words appear in text.",
                    "label": 0
                },
                {
                    "sent": "In news and the thing about news is this can change because the focus of news is always changing, so this frequency distribution in principle can be changing.",
                    "label": 0
                },
                {
                    "sent": "So we take the 1st 200 words and then we do we so we sorry I was taking a four hour rolling corpus.",
                    "label": 0
                },
                {
                    "sent": "In the main languages, so in English, French and German, we're taking four hours of news.",
                    "label": 0
                },
                {
                    "sent": "This is a rolling every 10 minutes.",
                    "label": 0
                },
                {
                    "sent": "We drop off the last 10 minutes we take the next 10 minutes so it's a rolling corpus if you like.",
                    "label": 0
                },
                {
                    "sent": "The other thing we do is we do this entropy calculation.",
                    "label": 0
                },
                {
                    "sent": "Which is basically trying to.",
                    "label": 0
                },
                {
                    "sent": "We're trying to get the most meaningful words to do the clustering.",
                    "label": 0
                },
                {
                    "sent": "That's the objective.",
                    "label": 0
                },
                {
                    "sent": "So although we've moved the very top 100 most frequent words, which is the stop list if you like in each language, we've ended this entropy calculation, which is 2.",
                    "label": 0
                },
                {
                    "sent": "Is 2 is the only use the words with the most meaning.",
                    "label": 0
                },
                {
                    "sent": "If a word is used in every document, it has no value at all.",
                    "label": 0
                },
                {
                    "sent": "It may be very rare, but if it's used in all the documents, it doesn't help you with the clustering.",
                    "label": 0
                },
                {
                    "sent": "So we remove anything with an entropy that is greater than .7.",
                    "label": 0
                },
                {
                    "sent": "And the other.",
                    "label": 0
                },
                {
                    "sent": "The next thing was that for the clustering algorithm to really work, you have another problem where you don't want words there only in one document.",
                    "label": 0
                },
                {
                    "sent": "It won't help you, you need words that are in at least two documents and we for the big languages we actually insist on a word appearing twice in two documents.",
                    "label": 0
                },
                {
                    "sent": "At the end of this, we end up with roughly with 6000 words, 400 documents.",
                    "label": 0
                },
                {
                    "sent": "We do the clustering.",
                    "label": 0
                },
                {
                    "sent": "We convert that into a vector space, so we're using the words is as dimensions and we each document gets we get 400 vectors out.",
                    "label": 0
                },
                {
                    "sent": "We calculate the cosine distance between all the vectors and then we build this sort of distance matrix.",
                    "label": 0
                },
                {
                    "sent": "So it's a 400 like a road map.",
                    "label": 0
                },
                {
                    "sent": "It tells you the distance between London and Paris.",
                    "label": 0
                },
                {
                    "sent": "We calculate the distance matrix in this vector space of.",
                    "label": 0
                },
                {
                    "sent": "Um documents.",
                    "label": 0
                },
                {
                    "sent": "And then basically the algorithm is really quite straightforward.",
                    "label": 0
                },
                {
                    "sent": "Take the first of all.",
                    "label": 0
                },
                {
                    "sent": "We take the two nearest ones.",
                    "label": 0
                },
                {
                    "sent": "We always keep track of the most closest elements.",
                    "label": 0
                },
                {
                    "sent": "We combine them into a cluster.",
                    "label": 0
                },
                {
                    "sent": "We re calculate the distances to all the others and we carry on clustering together the closest neighbors until such time as we have a cut off in cut of cosine.",
                    "label": 0
                },
                {
                    "sent": "So when we've got a situation whereby we no longer have two pairs which are within.",
                    "label": 0
                },
                {
                    "sent": ".6 but this depends on the language as well.",
                    "label": 0
                },
                {
                    "sent": "In English and French it would be .6.",
                    "label": 0
                },
                {
                    "sent": "In languages with less documents it would be .7 Point 8 and I forgot to say that for other languages where we don't have that many documents will increase the rolling corpus to compensate.",
                    "label": 0
                },
                {
                    "sent": "So we always have at least 200 documents to work with.",
                    "label": 0
                },
                {
                    "sent": "OK, so once once we've got the, once we've got the cluster in a given corpus.",
                    "label": 0
                },
                {
                    "sent": "Let's say we do this every 10 minutes, so we've got a rolling clustering algorithm running every 10 minutes throughout the continuously, and this means that we can then link classes together.",
                    "label": 0
                },
                {
                    "sent": "This is simply because.",
                    "label": 0
                },
                {
                    "sent": "It's very likely that if the story is about the same thing, the cluster will appear in the next 10 minutes.",
                    "label": 0
                },
                {
                    "sent": "It's all the classic is done completely independently, but of course the overlap in the documents in the given cluster will overlap with clusters from 10 minutes ago.",
                    "label": 0
                },
                {
                    "sent": "So then you've got a situation where you can easily track.",
                    "label": 0
                },
                {
                    "sent": "Stories which every 10 minutes we've gotta, we've got a different set.",
                    "label": 0
                },
                {
                    "sent": "And then we because there's an overlap here in the individual stories with within each time interval we can link them together.",
                    "label": 0
                },
                {
                    "sent": "So then we can do this stories tracking and of course stories can merge so we can start off with two separate stories which then merged together.",
                    "label": 0
                },
                {
                    "sent": "They can die.",
                    "label": 0
                },
                {
                    "sent": "What we don't want is 1 story to split into two separate stories.",
                    "label": 0
                },
                {
                    "sent": "That means our system is not.",
                    "label": 0
                },
                {
                    "sent": "It's very unusual that that would happen.",
                    "label": 0
                },
                {
                    "sent": "No, I won't show this this.",
                    "label": 0
                },
                {
                    "sent": "This is just an interesting thing about entropy, that saying that different languages have different entropy distributions.",
                    "label": 0
                },
                {
                    "sent": "So if you take Arabic and English, they have different entropy frequency distributions, which is basically saying that the language it's the richness of words that are used in languages, it's.",
                    "label": 0
                },
                {
                    "sent": "As a offshoot of this work, we have these entropy distributions in different languages.",
                    "label": 0
                },
                {
                    "sent": "OK, so the clustering.",
                    "label": 0
                },
                {
                    "sent": "So we do this 10 minute clustering in 18 languages and this is what we get.",
                    "label": 0
                },
                {
                    "sent": "So we get pretty good.",
                    "label": 0
                },
                {
                    "sent": "Very fine grained news, development overtime.",
                    "label": 0
                },
                {
                    "sent": "And this is in English.",
                    "label": 0
                },
                {
                    "sent": "This is in.",
                    "label": 0
                },
                {
                    "sent": "In Italian, and this is in.",
                    "label": 0
                },
                {
                    "sent": "Spanish.",
                    "label": 0
                },
                {
                    "sent": "Now the language, the clustering the software doesn't know anything about Spanish, doesn't know anything about Hungarian.",
                    "label": 0
                },
                {
                    "sent": "It doesn't know anything about Arabic, but it works because it's using the.",
                    "label": 0
                },
                {
                    "sent": "It's using simple statistics on words and.",
                    "label": 0
                },
                {
                    "sent": "In the in the main language it works very well and even in small languages it works reasonably well.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "The other thing is that we we because we've got this 10 minute interval, we can then do this business whereby we can find we find new breaking news stories of course, but we can also detect a change in the flux of news to send out what we call a NEWS UPDATE.",
                    "label": 0
                },
                {
                    "sent": "So if a story is developing, they maybe it's gone flat for a bit then it suddenly goes up again because they arrest somebody.",
                    "label": 0
                },
                {
                    "sent": "Then we can send out a NEWS UPDATE which is an interesting thing because the cluster the shape of the story.",
                    "label": 0
                },
                {
                    "sent": "Changes with time so you can send out a second SMS or a second email message for an update, which is a new thing.",
                    "label": 0
                },
                {
                    "sent": "Now I. I can quickly give you a demo.",
                    "label": 0
                },
                {
                    "sent": "So this is our.",
                    "label": 0
                },
                {
                    "sent": "This is live as long as no ones.",
                    "label": 0
                },
                {
                    "sent": "As long as the Internet still working yet.",
                    "label": 0
                },
                {
                    "sent": "And we've got the top story in Britain.",
                    "label": 0
                },
                {
                    "sent": "Is that the manager of Chelsea's left again, you can see that this has been this has been developing overnight so it started off at.",
                    "label": 0
                },
                {
                    "sent": "1:00 o'clock this morning we picked up.",
                    "label": 0
                },
                {
                    "sent": "In fact, I think I read that heard on the news this morning that he resigned late last night that was put on their website.",
                    "label": 0
                },
                {
                    "sent": "So then this is become a big story in the UK if we look in France, for example, we can find out what the French.",
                    "label": 0
                },
                {
                    "sent": "Muses",
                    "label": 0
                }
            ]
        }
    }
}