{
    "id": "aul77msqofah6avyu6whior6rjbniamy",
    "title": "Keynote Speech",
    "info": {
        "author": [
            "Maja Brenčič Makovec, Ministry of Education, Science and Sport, Government of the Republic of Slovenia"
        ],
        "published": "Oct. 12, 2017",
        "recorded": "September 2017",
        "category": [
            "Top->Social Sciences->Society",
            "Top->Social Sciences->Education",
            "Top->Technology"
        ]
    },
    "url": "http://videolectures.net/oercongress2017_makovec_brencic_keynote/",
    "segmentation": [
        [
            "Thank you for being here in Ljubljana in Slovenia.",
            "Thank you for understanding that some parts of the world even being small.",
            "Have to be seen and our mayor usually says welcome to the most beautiful city in the world.",
            "Thank you for coming.",
            "Dear Excellencies ministers there director general Deputy of UNESCO.",
            "Their commissioner, their friends from Ovr, their friends from all over the world, and they are believers in open, accessible, inclusive education.",
            "This is the main reason why in Slovenia we believe in public accessible and high quality system of education.",
            "This is also the reason why we believe in open education, and this is also the reason why we have supported all our.",
            "Very knowledge based, scientifically based and also true believers in O ER when I came to the ministry level and when I seen what everything has been done in Slovenia in open educational resources.",
            "So thank you to a Nesco thank you to Commonwealth of learning.",
            "Thank you to all of you to trust us to be one of the leading countries and to believe in the references.",
            "Which are created together with all of you to lead the world further, not only for today but especially for tomorrow for our youth and having 7 billion people around us, us among them.",
            "It's practically and predominantly the highest goal we have to achieve.",
            "In education in science and also in all Accessibility of any kind of information which can help all these 7 billion people to understand WHI the knowledge base driven societies are those in which we all believe and trust for.",
            "So thank you for being here and thank you for sharing all the knowledge, good practices, understandings and also highly scientific based achievements.",
            "To each other.",
            "This is not always so and since our Istanbul experience yesterday, an on Thursday showed that the team spirit is something that counts.",
            "Believe me, I trust most that in oh, we are.",
            "The team spirit is here.",
            "Therefore again, thank you for coming."
        ],
        [
            "Ljubljana is really a small capital in comparison to large big cities, but is truly the capital which now presents more and more of Europe.",
            "More and more curious, more and more people are coming to discover what Slovenia is and also Congress is like these are helping to open the door of Slovenia, Slovenia in Ovr level is a country which has been involved in the happenings from.",
            "Last 15 years since everything started and Paris and all other very important milestones where those who attracted also our not only schools and public institutions but also some very hearty people who still believe in that.",
            "And this is the moment where I would truly like to thank the whole of my team.",
            "Every Member Institute of Years of Stephen schools kindergartens.",
            "High education institutions who have supported that we could go through the milestones and be here today and please applause to everyone who has contributed that the Congress can bring something to all of us.",
            "To raise awareness among 7 billion people is not an easy job.",
            "To make education knowledge all over inclusive.",
            "Ask Commissioner pointed out, and this is the worth and the concept in which we all believe.",
            "It's not an easy task and therefore gatherings like this meetings, regional chapters, everything, what it has been done in this last 15 years, has a challenge to all of us.",
            "Why?",
            "Not because that we believe in the content site, but because it's so hard sometimes to bring us together for the same goals.",
            "And on this path it's really important who we are and why and where we're heading, and my trust, and I'm sure you're also, is that this Congress can brings completing some new milestones too.",
            "Therefore we call action.",
            "And we call action to reality so that it truly happens.",
            "It's not only about the commitment, we would not be here if we wouldn't be committed, but it's about implementation.",
            "It's about delivery.",
            "And this is.",
            "Well, I really hope that in these three days.",
            "We can not only bring together new ideas, but especially the plan how we will implement these ideas and commitments we already have done and proved, and at the same time already started to be in action.",
            "So thank you to all of you, and this is a big community and big family which have been and who has been on long run.",
            "And on long term challenge of how to bring real action together so."
        ],
        [
            "Again, thank you to UNESCO again.",
            "Thank you to Commonwealth of learning.",
            "Again, thank you to the Slovenian National National Commission for a Nesco Creative Commons ICDO ER chairs Institute of Fears of Stephen William and Flora Hewlett Foundation.",
            "We would not be here today without your support.",
            "Thank you and definitely.",
            "To all of you."
        ],
        [
            "New numbers are here.",
            "They have informed me that this 111 Member States being present at the Congress that more than five 50,000 visitors are already on the website.",
            "More than 500 actually, 510 participants are here and that we have also satellites who know how to spread the word around the world.",
            "So this is the identity card to fall of us.",
            "Here in ljubljana."
        ],
        [
            "And why you?",
            "And why in Slovenia we are one world and knowledge pertains to all humanity.",
            "Sometimes we do not really understand that, but bringing all we are together and creating new milestones will definitely help.",
            "For inclusive equitable quality education to be flexible and dynamic enough that it can be spread around the world.",
            "And this is one of the Motors.",
            "One of the motives also, which I think will bring new results out of this Congress.",
            "And create new steps to action.",
            "Partnerships.",
            "Strategies scenarios.",
            "Solutions.",
            "This is why we're all here.",
            "From commitment to action, from action to reality and for fulfilling of 2030 agenda of Nesco.",
            "Education as the highest value of UNESCO and is the highest value of all of us who are believers in knowledge and.",
            "Definitely understanding of whatever information can bring to each citizen in the world.",
            "This is why we are here today.",
            "Slovenia has had quite a story and quite the history.",
            "Also in this area.",
            "Starting in 1993.",
            "Bringing 2 steps forward and finalizing it at our government in 2014 with a strategy of open education resources and support of the government to create new ways new path and supports to our institutions to our people to our kids.",
            "Why?"
        ],
        [
            "We are here because we truly like to be recognized as a reference country in this area, and I hope that up till now my colleagues experts, all those who developed lots of knew.",
            "Highly accessible and methodologically pedagogically not only convenient and user friendly, but also content based solutions are those who create references for all of us.",
            "And Accessibility and inclusiveness is something what we should truly implement within all we are.",
            "Why Slovenia?",
            "Generally?",
            "Because we are long-term oriented.",
            "Here we know that nothing can be done just over the night, but sometimes we have to persuade teachers, business, cross area ministerial levels.",
            "Lots of those who are not true believers that these solutions bring the world together.",
            "And being small is sometimes an advantage because it's easier to say.",
            "Will you try?",
            "And you address everyone.",
            "And therefore I'm still a strong believer and supporter.",
            "That long term orientation will bring lots of results for everyone in whole system, not only in a school agenda, science or any other very commonly spread area which we tackle every day.",
            "Few examples E learning in schools.",
            "Ministry has supported more than 50 materials, being didactically pedagogically developed, also examined, and now they are used in schools.",
            "We have truly lots of knew.",
            "Approaches in technology methodology are being already used, either in kindergartens, schools, hospitals, even in public institutions, some of my colleagues ministers serve well.",
            "This was developed by Institute.",
            "Listen that yes, and I say yes because of the OE our agenda because of the digital modernization we have to bring in because of the digital strategy of Slovenia.",
            "And this is the crucial part.",
            "Learning out of it.",
            "Bringing best practices to each other.",
            "And those photos.",
            "These photos just little illustrations show that not only through the websites, but also in life in team spirit, at home, in schools, in any institution.",
            "Or we are can bring differences and Accessibility."
        ],
        [
            "Therefore we see OR as a driver of digital transformation of education of its modernization, sometimes as ministers and as government.",
            "We are asked, Hum, what will you do with your education in Slovenia?",
            "We believe we believe in our public, strong public quality, assured education.",
            "And this is what we will support also through ovr and therefore.",
            "No matter that we again and again say iaccessible inclusive, we have to repeat it again and again.",
            "And.",
            "What is my strong wish for this Congress?",
            "Today we start with everything what we know and what we have done and you have done in this 15 years.",
            "But definitely what we have to commit to and at the same time implement is.",
            "That we bring.",
            "Through UNESCO, the recommendation to OR.",
            "And that we are those who are committed to fulfill that.",
            "That we work regionally and I will start with the Balkans Initiative and that we work in coalitions.",
            "Bing Dynamic being opened and being here for those who would really like to contribute to the development.",
            "Sometimes when I hear young people hits speaking about their education, their schools life, they leave in their schools.",
            "They don't even know that so much of that is happening around them.",
            "But when we see the results when we compare them, then we know that we are the right way and a little girl singing at the beginning of this Congress.",
            "She sank about the friendship.",
            "About understanding.",
            "And being persistent on the path of the friendship.",
            "And therefore difference.",
            "I'm sure that this possible belong.",
            "Productive opened dynamic.",
            "And highly contributed to the whole world.",
            "Thank you to all of you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you for being here in Ljubljana in Slovenia.",
                    "label": 0
                },
                {
                    "sent": "Thank you for understanding that some parts of the world even being small.",
                    "label": 1
                },
                {
                    "sent": "Have to be seen and our mayor usually says welcome to the most beautiful city in the world.",
                    "label": 0
                },
                {
                    "sent": "Thank you for coming.",
                    "label": 0
                },
                {
                    "sent": "Dear Excellencies ministers there director general Deputy of UNESCO.",
                    "label": 0
                },
                {
                    "sent": "Their commissioner, their friends from Ovr, their friends from all over the world, and they are believers in open, accessible, inclusive education.",
                    "label": 1
                },
                {
                    "sent": "This is the main reason why in Slovenia we believe in public accessible and high quality system of education.",
                    "label": 0
                },
                {
                    "sent": "This is also the reason why we believe in open education, and this is also the reason why we have supported all our.",
                    "label": 1
                },
                {
                    "sent": "Very knowledge based, scientifically based and also true believers in O ER when I came to the ministry level and when I seen what everything has been done in Slovenia in open educational resources.",
                    "label": 0
                },
                {
                    "sent": "So thank you to a Nesco thank you to Commonwealth of learning.",
                    "label": 0
                },
                {
                    "sent": "Thank you to all of you to trust us to be one of the leading countries and to believe in the references.",
                    "label": 0
                },
                {
                    "sent": "Which are created together with all of you to lead the world further, not only for today but especially for tomorrow for our youth and having 7 billion people around us, us among them.",
                    "label": 0
                },
                {
                    "sent": "It's practically and predominantly the highest goal we have to achieve.",
                    "label": 0
                },
                {
                    "sent": "In education in science and also in all Accessibility of any kind of information which can help all these 7 billion people to understand WHI the knowledge base driven societies are those in which we all believe and trust for.",
                    "label": 0
                },
                {
                    "sent": "So thank you for being here and thank you for sharing all the knowledge, good practices, understandings and also highly scientific based achievements.",
                    "label": 0
                },
                {
                    "sent": "To each other.",
                    "label": 0
                },
                {
                    "sent": "This is not always so and since our Istanbul experience yesterday, an on Thursday showed that the team spirit is something that counts.",
                    "label": 0
                },
                {
                    "sent": "Believe me, I trust most that in oh, we are.",
                    "label": 0
                },
                {
                    "sent": "The team spirit is here.",
                    "label": 0
                },
                {
                    "sent": "Therefore again, thank you for coming.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ljubljana is really a small capital in comparison to large big cities, but is truly the capital which now presents more and more of Europe.",
                    "label": 0
                },
                {
                    "sent": "More and more curious, more and more people are coming to discover what Slovenia is and also Congress is like these are helping to open the door of Slovenia, Slovenia in Ovr level is a country which has been involved in the happenings from.",
                    "label": 0
                },
                {
                    "sent": "Last 15 years since everything started and Paris and all other very important milestones where those who attracted also our not only schools and public institutions but also some very hearty people who still believe in that.",
                    "label": 0
                },
                {
                    "sent": "And this is the moment where I would truly like to thank the whole of my team.",
                    "label": 0
                },
                {
                    "sent": "Every Member Institute of Years of Stephen schools kindergartens.",
                    "label": 0
                },
                {
                    "sent": "High education institutions who have supported that we could go through the milestones and be here today and please applause to everyone who has contributed that the Congress can bring something to all of us.",
                    "label": 0
                },
                {
                    "sent": "To raise awareness among 7 billion people is not an easy job.",
                    "label": 0
                },
                {
                    "sent": "To make education knowledge all over inclusive.",
                    "label": 0
                },
                {
                    "sent": "Ask Commissioner pointed out, and this is the worth and the concept in which we all believe.",
                    "label": 0
                },
                {
                    "sent": "It's not an easy task and therefore gatherings like this meetings, regional chapters, everything, what it has been done in this last 15 years, has a challenge to all of us.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Not because that we believe in the content site, but because it's so hard sometimes to bring us together for the same goals.",
                    "label": 0
                },
                {
                    "sent": "And on this path it's really important who we are and why and where we're heading, and my trust, and I'm sure you're also, is that this Congress can brings completing some new milestones too.",
                    "label": 0
                },
                {
                    "sent": "Therefore we call action.",
                    "label": 0
                },
                {
                    "sent": "And we call action to reality so that it truly happens.",
                    "label": 0
                },
                {
                    "sent": "It's not only about the commitment, we would not be here if we wouldn't be committed, but it's about implementation.",
                    "label": 0
                },
                {
                    "sent": "It's about delivery.",
                    "label": 0
                },
                {
                    "sent": "And this is.",
                    "label": 0
                },
                {
                    "sent": "Well, I really hope that in these three days.",
                    "label": 0
                },
                {
                    "sent": "We can not only bring together new ideas, but especially the plan how we will implement these ideas and commitments we already have done and proved, and at the same time already started to be in action.",
                    "label": 0
                },
                {
                    "sent": "So thank you to all of you, and this is a big community and big family which have been and who has been on long run.",
                    "label": 0
                },
                {
                    "sent": "And on long term challenge of how to bring real action together so.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Again, thank you to UNESCO again.",
                    "label": 0
                },
                {
                    "sent": "Thank you to Commonwealth of learning.",
                    "label": 0
                },
                {
                    "sent": "Again, thank you to the Slovenian National National Commission for a Nesco Creative Commons ICDO ER chairs Institute of Fears of Stephen William and Flora Hewlett Foundation.",
                    "label": 0
                },
                {
                    "sent": "We would not be here today without your support.",
                    "label": 0
                },
                {
                    "sent": "Thank you and definitely.",
                    "label": 0
                },
                {
                    "sent": "To all of you.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "New numbers are here.",
                    "label": 0
                },
                {
                    "sent": "They have informed me that this 111 Member States being present at the Congress that more than five 50,000 visitors are already on the website.",
                    "label": 1
                },
                {
                    "sent": "More than 500 actually, 510 participants are here and that we have also satellites who know how to spread the word around the world.",
                    "label": 0
                },
                {
                    "sent": "So this is the identity card to fall of us.",
                    "label": 0
                },
                {
                    "sent": "Here in ljubljana.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And why you?",
                    "label": 0
                },
                {
                    "sent": "And why in Slovenia we are one world and knowledge pertains to all humanity.",
                    "label": 0
                },
                {
                    "sent": "Sometimes we do not really understand that, but bringing all we are together and creating new milestones will definitely help.",
                    "label": 0
                },
                {
                    "sent": "For inclusive equitable quality education to be flexible and dynamic enough that it can be spread around the world.",
                    "label": 0
                },
                {
                    "sent": "And this is one of the Motors.",
                    "label": 0
                },
                {
                    "sent": "One of the motives also, which I think will bring new results out of this Congress.",
                    "label": 0
                },
                {
                    "sent": "And create new steps to action.",
                    "label": 0
                },
                {
                    "sent": "Partnerships.",
                    "label": 0
                },
                {
                    "sent": "Strategies scenarios.",
                    "label": 0
                },
                {
                    "sent": "Solutions.",
                    "label": 0
                },
                {
                    "sent": "This is why we're all here.",
                    "label": 0
                },
                {
                    "sent": "From commitment to action, from action to reality and for fulfilling of 2030 agenda of Nesco.",
                    "label": 0
                },
                {
                    "sent": "Education as the highest value of UNESCO and is the highest value of all of us who are believers in knowledge and.",
                    "label": 0
                },
                {
                    "sent": "Definitely understanding of whatever information can bring to each citizen in the world.",
                    "label": 0
                },
                {
                    "sent": "This is why we are here today.",
                    "label": 0
                },
                {
                    "sent": "Slovenia has had quite a story and quite the history.",
                    "label": 0
                },
                {
                    "sent": "Also in this area.",
                    "label": 0
                },
                {
                    "sent": "Starting in 1993.",
                    "label": 0
                },
                {
                    "sent": "Bringing 2 steps forward and finalizing it at our government in 2014 with a strategy of open education resources and support of the government to create new ways new path and supports to our institutions to our people to our kids.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We are here because we truly like to be recognized as a reference country in this area, and I hope that up till now my colleagues experts, all those who developed lots of knew.",
                    "label": 0
                },
                {
                    "sent": "Highly accessible and methodologically pedagogically not only convenient and user friendly, but also content based solutions are those who create references for all of us.",
                    "label": 0
                },
                {
                    "sent": "And Accessibility and inclusiveness is something what we should truly implement within all we are.",
                    "label": 0
                },
                {
                    "sent": "Why Slovenia?",
                    "label": 0
                },
                {
                    "sent": "Generally?",
                    "label": 0
                },
                {
                    "sent": "Because we are long-term oriented.",
                    "label": 0
                },
                {
                    "sent": "Here we know that nothing can be done just over the night, but sometimes we have to persuade teachers, business, cross area ministerial levels.",
                    "label": 0
                },
                {
                    "sent": "Lots of those who are not true believers that these solutions bring the world together.",
                    "label": 0
                },
                {
                    "sent": "And being small is sometimes an advantage because it's easier to say.",
                    "label": 0
                },
                {
                    "sent": "Will you try?",
                    "label": 0
                },
                {
                    "sent": "And you address everyone.",
                    "label": 0
                },
                {
                    "sent": "And therefore I'm still a strong believer and supporter.",
                    "label": 0
                },
                {
                    "sent": "That long term orientation will bring lots of results for everyone in whole system, not only in a school agenda, science or any other very commonly spread area which we tackle every day.",
                    "label": 0
                },
                {
                    "sent": "Few examples E learning in schools.",
                    "label": 0
                },
                {
                    "sent": "Ministry has supported more than 50 materials, being didactically pedagogically developed, also examined, and now they are used in schools.",
                    "label": 0
                },
                {
                    "sent": "We have truly lots of knew.",
                    "label": 0
                },
                {
                    "sent": "Approaches in technology methodology are being already used, either in kindergartens, schools, hospitals, even in public institutions, some of my colleagues ministers serve well.",
                    "label": 0
                },
                {
                    "sent": "This was developed by Institute.",
                    "label": 0
                },
                {
                    "sent": "Listen that yes, and I say yes because of the OE our agenda because of the digital modernization we have to bring in because of the digital strategy of Slovenia.",
                    "label": 0
                },
                {
                    "sent": "And this is the crucial part.",
                    "label": 0
                },
                {
                    "sent": "Learning out of it.",
                    "label": 0
                },
                {
                    "sent": "Bringing best practices to each other.",
                    "label": 0
                },
                {
                    "sent": "And those photos.",
                    "label": 0
                },
                {
                    "sent": "These photos just little illustrations show that not only through the websites, but also in life in team spirit, at home, in schools, in any institution.",
                    "label": 0
                },
                {
                    "sent": "Or we are can bring differences and Accessibility.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Therefore we see OR as a driver of digital transformation of education of its modernization, sometimes as ministers and as government.",
                    "label": 1
                },
                {
                    "sent": "We are asked, Hum, what will you do with your education in Slovenia?",
                    "label": 0
                },
                {
                    "sent": "We believe we believe in our public, strong public quality, assured education.",
                    "label": 0
                },
                {
                    "sent": "And this is what we will support also through ovr and therefore.",
                    "label": 0
                },
                {
                    "sent": "No matter that we again and again say iaccessible inclusive, we have to repeat it again and again.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "What is my strong wish for this Congress?",
                    "label": 0
                },
                {
                    "sent": "Today we start with everything what we know and what we have done and you have done in this 15 years.",
                    "label": 0
                },
                {
                    "sent": "But definitely what we have to commit to and at the same time implement is.",
                    "label": 0
                },
                {
                    "sent": "That we bring.",
                    "label": 0
                },
                {
                    "sent": "Through UNESCO, the recommendation to OR.",
                    "label": 0
                },
                {
                    "sent": "And that we are those who are committed to fulfill that.",
                    "label": 0
                },
                {
                    "sent": "That we work regionally and I will start with the Balkans Initiative and that we work in coalitions.",
                    "label": 0
                },
                {
                    "sent": "Bing Dynamic being opened and being here for those who would really like to contribute to the development.",
                    "label": 0
                },
                {
                    "sent": "Sometimes when I hear young people hits speaking about their education, their schools life, they leave in their schools.",
                    "label": 0
                },
                {
                    "sent": "They don't even know that so much of that is happening around them.",
                    "label": 0
                },
                {
                    "sent": "But when we see the results when we compare them, then we know that we are the right way and a little girl singing at the beginning of this Congress.",
                    "label": 0
                },
                {
                    "sent": "She sank about the friendship.",
                    "label": 0
                },
                {
                    "sent": "About understanding.",
                    "label": 0
                },
                {
                    "sent": "And being persistent on the path of the friendship.",
                    "label": 0
                },
                {
                    "sent": "And therefore difference.",
                    "label": 0
                },
                {
                    "sent": "I'm sure that this possible belong.",
                    "label": 0
                },
                {
                    "sent": "Productive opened dynamic.",
                    "label": 0
                },
                {
                    "sent": "And highly contributed to the whole world.",
                    "label": 0
                },
                {
                    "sent": "Thank you to all of you.",
                    "label": 0
                }
            ]
        }
    }
}