{
    "id": "auphd5kfzrlxwgfmxwfmtw5w6abixv5q",
    "title": "MOOCs: the power of collaborative learning and communities of knowledge",
    "info": {
        "author": [
            "Marta Caceres-Piñuel, Universidad Nacional de Educación a Distancia (UNED) Madrid"
        ],
        "published": "June 23, 2014",
        "recorded": "April 2014",
        "category": [
            "Top->Social Sciences->Education",
            "Top->Social Sciences->Society->Public Policy"
        ]
    },
    "url": "http://videolectures.net/ocwc2014_caceres_pinuel_collaborative_learning/",
    "segmentation": [
        [
            "Good afternoon, thank you.",
            "Thank you everybody for coming, especially people who has arrived yesterday for or CW Global event.",
            "An I'm going to present some preliminary result of my PhD research.",
            "I would like to share with you a little bit, allow about my background.",
            "My academic background is sociology and science politics, but I have been working for more than 10 years in ICT in education and specifically I have been working developing looks with different Spanish and Latin American universities since three years ago.",
            "And during this time I had always the same question how to.",
            "To demonstrate or how to give half a empirical evidence is about what works and what doesn't work in books and who is behind on how interact.",
            "People in MC platforms with this question in mind.",
            "Few months ago I started with my research Ann.",
            "Is for that the title of this presentation I'm going to give you some.",
            "I don't know some data and some preliminary evidence is how people interact in this kind of environment.",
            "An maybe possible scenarios for a communities of knowledge in the digital digital age.",
            "Anne."
        ],
        [
            "My aim in my PhD is to analyze Moocs and beyond.",
            "I think I know is quite ambitious, but I would like to analyze books not only like knew online spaces for open knowledge.",
            "But also like GNU Open Communities of Knowledge, I would like to to to analyze this knew online environment, not just like a scalable online course, but also like a new environmental framework for education.",
            "My generally processes about how monks, mooks enable much more than massive open space for scalable online courses will create new online spaces for community.",
            "First, knowledge marks Camper meet, Remove borders in formal and informal education an in large open knowledge sharing into the action they offer solution for lucrative educational institution, secondary schools, University College and so on also.",
            "Other kinds of stakeholders, like companies, institutions, individuals and so on.",
            "Anne.",
            "My my last, a prothesis is MC Sarah powerful tool in combination with other social ICT tools like PETA.",
            "P2P activities for a another kind of tools an can create a open knowledge networks.",
            "An my theoretical."
        ],
        [
            "Framework has a double prospective.",
            "From my sociological background I I have put in the top there networking analysis theory.",
            "As you know is a theory based on assumption of the importance between relationship of individuals much more than isolated units.",
            "Ann from the educational prospective my My theoretical approaches, Connectivism a.",
            "Like I bought it for off learning which emphasized the role of social and cultural context.",
            "Your Siemens and Downes has written very much about this theoretical framework."
        ],
        [
            "So we have in our second meeting for PhD researcher.",
            "I would like to share with you.",
            "And some data regarding the behavior of these students in this kind of in this kind of environments I have use.",
            "Two tools and.",
            "I have use surveys to move students.",
            "And learning analytics not only from one platform, but I have two different platforms.",
            "The data comes from Unit MC platform crew called Unit Coma.",
            "A.",
            "The other data come from Unix is an open Latin American flat platform for in their partnership.",
            "A main difference difference between this platform is this one is a typical Academical MC platform.",
            "Much more focus on Xbox.",
            "And this order is a community itself, and it adds other kind of services, resources and tools in order to create communities.",
            "Much, much more, um?",
            "Focusing Simix and the rationale of this kind of analysis is.",
            "Moocs collect value valuable data on student learning behavior.",
            "Essentially, to complete records of police students interaction in self contained in learning environments.",
            "And the Lord knows value of the simple sample size."
        ],
        [
            "Both platform analyzer are quite big.",
            "Unit, has nowadays.",
            "260 One 1480 students.",
            "Um Unix environment has almost 40,000 students.",
            "But just to see how.",
            "Are they how?",
            "People interacting there in these different environments I have I have selects are kaseva study the same look.",
            "The same book is available in both in both platforms.",
            "The book is about transversal competences for entrepreneurship.",
            "And the content is the same.",
            "Activities are the same.",
            "The professor is S actually the same content, but.",
            "One uses 1 use.",
            "X platform less social tools, less a community dynamics less a.",
            "List share spaces and the other one use Unix that have a.",
            "Different features because it has not only a MC liar but also a community liar.",
            "Anne.",
            "The other difference between both environment is this is just in Spanish.",
            "And this is also in Portuguese.",
            "Anne.",
            "Well, it's.",
            "Then if I if somebody is interesting, we can.",
            "We can explain in more deeper how it works, but we use system of voting for Karma anfora a tool for friendship and content content uploads by users.",
            "But all that kind of social tools."
        ],
        [
            "The question for analysis.",
            "Are the following who is behind the MC social demographic profile of students who participates in these in this course while they register?",
            "What's the motivation?",
            "What's the level of dropout completion rate and certification availability?",
            "Uh, what's the level of social participation in the online environment?",
            "This question is key.",
            "Four analyzed interaction of.",
            "The behavior of the individuals in the online environment.",
            "How students learn in amook environment.",
            "Tools used and learning style associated is the style changing depending on the platform and depending on the design of the environment.",
            "Anne.",
            "How to measure the success?",
            "I propose go beyond the scalability of the online learning experience.",
            "I propose measuring other kind of variables like level of satisfaction and outputs not only for students, but also what institution who deliver which deliver this kind of dynamics.",
            "Last question, where are they mix borders?",
            "A desk I tried to analyze if language enable the internationalization and how important is this?",
            "It is this variable for four remove barriers."
        ],
        [
            "And it's important to note after the analysis in both environments and also comparing with the global data from the both platforms, there is no significant sociodemographic differences between platforms or with other books.",
            "So we have quite, let's say, general description or how who is behind a mock.",
            "Each of his students we can see here.",
            "What are the group more more important from 15 to 45 but especially important for 31245?",
            "It make us think how important is leg long learning a?",
            "Lyle on Learning a for this kind of dynamics of learning, and six of students, mainly men.",
            "Yeah."
        ],
        [
            "So from an education.",
            "We have seen in other different analytics studies most part have previous studies, especially post graduate studies.",
            "Is people with high.",
            "Is important to notice this course is very basic.",
            "You don't need previous background in in.",
            "I don't know in management or in economics or someone is very very generally just transversal competences from psychological competences or.",
            "Precondition to analyze a business but a business case, but it's not very.",
            "High level a course, but most part of a student has a very very high education.",
            "Anne.",
            "Place of residence.",
            "A mainly urban.",
            "Anne."
        ],
        [
            "Let's go to job situation.",
            "A.",
            "Worker on self employed.",
            "This is quite a mess.",
            "Amazing because it's a course about entrepreneurship.",
            "We suppose these people who try to I don't know, establish their own enterprise.",
            "Maybe is employed unemployed.",
            "There is a big rate of unemployed people, of course, but big.",
            "Part of the group are workers or self-employed.",
            "So.",
            "This is a quite strange that, at least for me, becausw A.",
            "This is the average of the profile of the other books.",
            "That means don't matter the subject, but the profile remains more or less.",
            "Well, somebody mom mutilate with in their 30s higher education worker and orb."
        ],
        [
            "And let's go to motivation.",
            "Here we can find differences between between environments.",
            "In this environment.",
            "Let's call it more academical environment.",
            "The motivation is much more.",
            "A.",
            "Interesting subject.",
            "Let's say curiosity, let's say interest in the topic, but in the other environment this mathematical environment focused on entrepreneurship.",
            "There are many people interested in the subject, let's say curiosity or someone.",
            "But there are people very focused on the aim of the of the community.",
            "They want to enterpreneur.",
            "To find a job or to improve their current job so.",
            "May be too simple to to to make generalization, but in communities of knowledge we can find more.",
            "That get it.",
            "Collective An in academic mocks or general.",
            "MC Platforms these people with.",
            "Curiosity A maybe a chemical interest or so on.",
            "So here we have.",
            "Some ideas to reflect the importance to create specific thematic communities of knowledge, because maybe it has more sense for people how to select.",
            "I don't know how to select MC so well just just to mention."
        ],
        [
            "Rate of completion.",
            "I have to say it's just the same content, the same evaluation, the same, all the same test.",
            "I have to mention the the dropout if we compare with the average MC is quite low because the average is 90% of dropout.",
            "And here we can see.",
            "Quite high percentage of completion or completion of both, but.",
            "There is no certification here.",
            "There is certification here.",
            "But this is a curious percentage, just one point 3.",
            "Percent of people ask for certification, maybe because they have to pay.",
            "I have no idea, but the completion is is high but is higher in this environment.",
            "And this is the path.",
            "Of drop out so just to have a look here.",
            "People is very motivated.",
            "First assessment, Second assessment, third assessment, and then the most interesting people remains.",
            "This is more or less the path of most part of.",
            "Off smokes."
        ],
        [
            "Let's assess participation.",
            "How is the level of interaction between peers in their different environments?",
            "Let's go to the X MOOC platform.",
            "No participation, just observers.",
            "They only see the videos they make this self assessment test.",
            "They complete the assignment but they don't participate, mainly enfora because the social tools are quite reduced.",
            "Majority no participation.",
            "Here is true.",
            "We have more tools for participation.",
            "Almost 80%.",
            "Has allowed participation through.",
            "But most part participate only 20% don't participate at all with other peers."
        ],
        [
            "This is just to show you the level of use of social tools here.",
            "They have peer support.",
            "Peer to peer assessment.",
            "They use if they have the possibility they use, but not so intensive that then other activities and hear people who has more social tools they use.",
            "They use them very much, especially peer to peer.",
            "Activities.",
            "We can say in this environment we can identify a very autonomous style of learning here.",
            "And they asked also for academical support in the facilitator, and correct or support in this environment.",
            "Yeah, very eight autonomous, but they use very much or their kind of tools for social support."
        ],
        [
            "Let's go to level of success.",
            "A quite interesting level of satisfaction is very, very similar.",
            "There is no difference.",
            "There is no difference of satisfaction.",
            "People who participate in a moves.",
            "It is not looking for very powerful technology or very I.",
            "It makes me think very much.",
            "Because the level of satisfaction is very very very similar.",
            "But let's think about this success for providers OK.",
            "Normally when we say that he has been very, very successful, when many people has register.",
            "But at the end of the day, what's the success for for the institution who has organized?",
            "For University, I imagine we have to put attention in this kind of measuring of variables of success for simple, what's happened after the sperian's.",
            "Happens, oh.",
            "Help University can a take advance of this students?",
            "We asked the students after the MC Esperience I will not participate in formal course in unit.",
            "In this case nobody.",
            "Nobody nobody experience that.",
            "That means I would like to participate in formal courses in unit.",
            "Big percentage of people would like after this experience be involved in other, more formal a courses.",
            "Many people want to repeat the experience with, uh, with Elder MC.",
            "That means this style of education engage the people.",
            "Knowing sense of certification or complexion but is hostile who people likes.",
            "Anne.",
            "After the Sperian's this is.",
            "At least.",
            "After experience I know better unit University.",
            "Make us think about if books are a marketing tool for universities is well.",
            "Yes.",
            "See.",
            "So 5 minutes OK. And let's evaluate the success for other kind of environments.",
            "Let's let's think about Unix is on a community for entrepreneurship.",
            "And at the end of the experience, the students say.",
            "Do you feel capable to enterpreneur after?",
            "This book totally capable, very capable, partially capable.",
            "Nobody says no, it's not useful for me.",
            "This is permanent experience, doesn't give me any A.",
            "Any advantage any?",
            "Ask me no value at all so.",
            "The aim of the with the aim of the of the community.",
            "One last question."
        ],
        [
            "Languages.",
            "Anne.",
            "This course is.",
            "Have been organized for a Spanish institutions both.",
            "A Unix has latinoamericana scope.",
            "But you need is on Spanish distance University.",
            "Their language is in mainly in Spain.",
            "But it's true, this University has has different centers.",
            "Not only in the country, but also in different continents.",
            "But this is a Spanish institution.",
            "So let's go to the.",
            "To the student who has participates in the.",
            "In the in the book.",
            "In this platform, which is Justin's in Spanish.",
            "More students come from Spanish speaking countries.",
            "Spank Colombia, Mexico cantina, Peru.",
            "Let's go to the other environment.",
            "This environment is in Portuguese also, so the 2nd.",
            "Group comes from from Brazil.",
            "That means.",
            "Languages and naval knew public knew collective and so on.",
            "So so.",
            "They mean.",
            "One of the main we have, of course we have to continue analyzing the environments and so on, but.",
            "The language is one of the main enable of this kind.",
            "For internationalization of this kind of experiences."
        ],
        [
            "Just to finalize preliminary findings, typical summer morphic profile mom.",
            "It's in between their 30s.",
            "Hi location work around one motivation, interesting academic subject and job purpose.",
            "Purpose for long flights that we mainly.",
            "Level of dropout cinema could be LinkedIn.",
            "Some cases we certification availability.",
            "Especially.",
            "In academic MC environments, people who is participating in other kind of environments are not so interested in certification because we have seen in the other environment.",
            "Xbox.",
            "Of course promotes less interaction between peers than other than communities of knowledge that use simix.",
            "Learning style in books is mainly autonomous but ICT and social tools can enable more collectible collaborative learning style.",
            "A6 MacBook success must be measured beyond the scalability of the online learning experience.",
            "Level of satisfaction and outputs for students and for institutions must be taken in account.",
            "Language is the main enable for internal internationalization of monks.",
            "Lesson learn after the analysis.",
            "Despite the same team has the below.",
            "Both environment is very complicated when standardized a framework assessment and compare learning analytics so.",
            "Standardized framework for assessment is needed for more in depth analysis.",
            "Anne."
        ],
        [
            "Is it a intuition without data or your opinions?",
            "Thank you so much."
        ],
        [
            "Yeah."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good afternoon, thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you everybody for coming, especially people who has arrived yesterday for or CW Global event.",
                    "label": 0
                },
                {
                    "sent": "An I'm going to present some preliminary result of my PhD research.",
                    "label": 0
                },
                {
                    "sent": "I would like to share with you a little bit, allow about my background.",
                    "label": 0
                },
                {
                    "sent": "My academic background is sociology and science politics, but I have been working for more than 10 years in ICT in education and specifically I have been working developing looks with different Spanish and Latin American universities since three years ago.",
                    "label": 0
                },
                {
                    "sent": "And during this time I had always the same question how to.",
                    "label": 0
                },
                {
                    "sent": "To demonstrate or how to give half a empirical evidence is about what works and what doesn't work in books and who is behind on how interact.",
                    "label": 0
                },
                {
                    "sent": "People in MC platforms with this question in mind.",
                    "label": 0
                },
                {
                    "sent": "Few months ago I started with my research Ann.",
                    "label": 0
                },
                {
                    "sent": "Is for that the title of this presentation I'm going to give you some.",
                    "label": 0
                },
                {
                    "sent": "I don't know some data and some preliminary evidence is how people interact in this kind of environment.",
                    "label": 0
                },
                {
                    "sent": "An maybe possible scenarios for a communities of knowledge in the digital digital age.",
                    "label": 1
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "My aim in my PhD is to analyze Moocs and beyond.",
                    "label": 0
                },
                {
                    "sent": "I think I know is quite ambitious, but I would like to analyze books not only like knew online spaces for open knowledge.",
                    "label": 1
                },
                {
                    "sent": "But also like GNU Open Communities of Knowledge, I would like to to to analyze this knew online environment, not just like a scalable online course, but also like a new environmental framework for education.",
                    "label": 1
                },
                {
                    "sent": "My generally processes about how monks, mooks enable much more than massive open space for scalable online courses will create new online spaces for community.",
                    "label": 1
                },
                {
                    "sent": "First, knowledge marks Camper meet, Remove borders in formal and informal education an in large open knowledge sharing into the action they offer solution for lucrative educational institution, secondary schools, University College and so on also.",
                    "label": 0
                },
                {
                    "sent": "Other kinds of stakeholders, like companies, institutions, individuals and so on.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 1
                },
                {
                    "sent": "My my last, a prothesis is MC Sarah powerful tool in combination with other social ICT tools like PETA.",
                    "label": 0
                },
                {
                    "sent": "P2P activities for a another kind of tools an can create a open knowledge networks.",
                    "label": 0
                },
                {
                    "sent": "An my theoretical.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Framework has a double prospective.",
                    "label": 0
                },
                {
                    "sent": "From my sociological background I I have put in the top there networking analysis theory.",
                    "label": 1
                },
                {
                    "sent": "As you know is a theory based on assumption of the importance between relationship of individuals much more than isolated units.",
                    "label": 1
                },
                {
                    "sent": "Ann from the educational prospective my My theoretical approaches, Connectivism a.",
                    "label": 1
                },
                {
                    "sent": "Like I bought it for off learning which emphasized the role of social and cultural context.",
                    "label": 1
                },
                {
                    "sent": "Your Siemens and Downes has written very much about this theoretical framework.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we have in our second meeting for PhD researcher.",
                    "label": 0
                },
                {
                    "sent": "I would like to share with you.",
                    "label": 0
                },
                {
                    "sent": "And some data regarding the behavior of these students in this kind of in this kind of environments I have use.",
                    "label": 1
                },
                {
                    "sent": "Two tools and.",
                    "label": 0
                },
                {
                    "sent": "I have use surveys to move students.",
                    "label": 0
                },
                {
                    "sent": "And learning analytics not only from one platform, but I have two different platforms.",
                    "label": 1
                },
                {
                    "sent": "The data comes from Unit MC platform crew called Unit Coma.",
                    "label": 0
                },
                {
                    "sent": "A.",
                    "label": 0
                },
                {
                    "sent": "The other data come from Unix is an open Latin American flat platform for in their partnership.",
                    "label": 0
                },
                {
                    "sent": "A main difference difference between this platform is this one is a typical Academical MC platform.",
                    "label": 0
                },
                {
                    "sent": "Much more focus on Xbox.",
                    "label": 0
                },
                {
                    "sent": "And this order is a community itself, and it adds other kind of services, resources and tools in order to create communities.",
                    "label": 0
                },
                {
                    "sent": "Much, much more, um?",
                    "label": 0
                },
                {
                    "sent": "Focusing Simix and the rationale of this kind of analysis is.",
                    "label": 1
                },
                {
                    "sent": "Moocs collect value valuable data on student learning behavior.",
                    "label": 1
                },
                {
                    "sent": "Essentially, to complete records of police students interaction in self contained in learning environments.",
                    "label": 0
                },
                {
                    "sent": "And the Lord knows value of the simple sample size.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Both platform analyzer are quite big.",
                    "label": 0
                },
                {
                    "sent": "Unit, has nowadays.",
                    "label": 0
                },
                {
                    "sent": "260 One 1480 students.",
                    "label": 0
                },
                {
                    "sent": "Um Unix environment has almost 40,000 students.",
                    "label": 0
                },
                {
                    "sent": "But just to see how.",
                    "label": 0
                },
                {
                    "sent": "Are they how?",
                    "label": 0
                },
                {
                    "sent": "People interacting there in these different environments I have I have selects are kaseva study the same look.",
                    "label": 0
                },
                {
                    "sent": "The same book is available in both in both platforms.",
                    "label": 1
                },
                {
                    "sent": "The book is about transversal competences for entrepreneurship.",
                    "label": 1
                },
                {
                    "sent": "And the content is the same.",
                    "label": 0
                },
                {
                    "sent": "Activities are the same.",
                    "label": 0
                },
                {
                    "sent": "The professor is S actually the same content, but.",
                    "label": 0
                },
                {
                    "sent": "One uses 1 use.",
                    "label": 0
                },
                {
                    "sent": "X platform less social tools, less a community dynamics less a.",
                    "label": 0
                },
                {
                    "sent": "List share spaces and the other one use Unix that have a.",
                    "label": 0
                },
                {
                    "sent": "Different features because it has not only a MC liar but also a community liar.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "The other difference between both environment is this is just in Spanish.",
                    "label": 0
                },
                {
                    "sent": "And this is also in Portuguese.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Well, it's.",
                    "label": 0
                },
                {
                    "sent": "Then if I if somebody is interesting, we can.",
                    "label": 0
                },
                {
                    "sent": "We can explain in more deeper how it works, but we use system of voting for Karma anfora a tool for friendship and content content uploads by users.",
                    "label": 1
                },
                {
                    "sent": "But all that kind of social tools.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The question for analysis.",
                    "label": 0
                },
                {
                    "sent": "Are the following who is behind the MC social demographic profile of students who participates in these in this course while they register?",
                    "label": 1
                },
                {
                    "sent": "What's the motivation?",
                    "label": 0
                },
                {
                    "sent": "What's the level of dropout completion rate and certification availability?",
                    "label": 1
                },
                {
                    "sent": "Uh, what's the level of social participation in the online environment?",
                    "label": 0
                },
                {
                    "sent": "This question is key.",
                    "label": 0
                },
                {
                    "sent": "Four analyzed interaction of.",
                    "label": 0
                },
                {
                    "sent": "The behavior of the individuals in the online environment.",
                    "label": 1
                },
                {
                    "sent": "How students learn in amook environment.",
                    "label": 0
                },
                {
                    "sent": "Tools used and learning style associated is the style changing depending on the platform and depending on the design of the environment.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "How to measure the success?",
                    "label": 0
                },
                {
                    "sent": "I propose go beyond the scalability of the online learning experience.",
                    "label": 1
                },
                {
                    "sent": "I propose measuring other kind of variables like level of satisfaction and outputs not only for students, but also what institution who deliver which deliver this kind of dynamics.",
                    "label": 0
                },
                {
                    "sent": "Last question, where are they mix borders?",
                    "label": 0
                },
                {
                    "sent": "A desk I tried to analyze if language enable the internationalization and how important is this?",
                    "label": 0
                },
                {
                    "sent": "It is this variable for four remove barriers.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And it's important to note after the analysis in both environments and also comparing with the global data from the both platforms, there is no significant sociodemographic differences between platforms or with other books.",
                    "label": 1
                },
                {
                    "sent": "So we have quite, let's say, general description or how who is behind a mock.",
                    "label": 0
                },
                {
                    "sent": "Each of his students we can see here.",
                    "label": 0
                },
                {
                    "sent": "What are the group more more important from 15 to 45 but especially important for 31245?",
                    "label": 0
                },
                {
                    "sent": "It make us think how important is leg long learning a?",
                    "label": 0
                },
                {
                    "sent": "Lyle on Learning a for this kind of dynamics of learning, and six of students, mainly men.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So from an education.",
                    "label": 0
                },
                {
                    "sent": "We have seen in other different analytics studies most part have previous studies, especially post graduate studies.",
                    "label": 0
                },
                {
                    "sent": "Is people with high.",
                    "label": 0
                },
                {
                    "sent": "Is important to notice this course is very basic.",
                    "label": 0
                },
                {
                    "sent": "You don't need previous background in in.",
                    "label": 0
                },
                {
                    "sent": "I don't know in management or in economics or someone is very very generally just transversal competences from psychological competences or.",
                    "label": 0
                },
                {
                    "sent": "Precondition to analyze a business but a business case, but it's not very.",
                    "label": 0
                },
                {
                    "sent": "High level a course, but most part of a student has a very very high education.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Place of residence.",
                    "label": 0
                },
                {
                    "sent": "A mainly urban.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's go to job situation.",
                    "label": 0
                },
                {
                    "sent": "A.",
                    "label": 0
                },
                {
                    "sent": "Worker on self employed.",
                    "label": 0
                },
                {
                    "sent": "This is quite a mess.",
                    "label": 0
                },
                {
                    "sent": "Amazing because it's a course about entrepreneurship.",
                    "label": 0
                },
                {
                    "sent": "We suppose these people who try to I don't know, establish their own enterprise.",
                    "label": 0
                },
                {
                    "sent": "Maybe is employed unemployed.",
                    "label": 0
                },
                {
                    "sent": "There is a big rate of unemployed people, of course, but big.",
                    "label": 0
                },
                {
                    "sent": "Part of the group are workers or self-employed.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This is a quite strange that, at least for me, becausw A.",
                    "label": 0
                },
                {
                    "sent": "This is the average of the profile of the other books.",
                    "label": 1
                },
                {
                    "sent": "That means don't matter the subject, but the profile remains more or less.",
                    "label": 0
                },
                {
                    "sent": "Well, somebody mom mutilate with in their 30s higher education worker and orb.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And let's go to motivation.",
                    "label": 0
                },
                {
                    "sent": "Here we can find differences between between environments.",
                    "label": 0
                },
                {
                    "sent": "In this environment.",
                    "label": 0
                },
                {
                    "sent": "Let's call it more academical environment.",
                    "label": 0
                },
                {
                    "sent": "The motivation is much more.",
                    "label": 0
                },
                {
                    "sent": "A.",
                    "label": 0
                },
                {
                    "sent": "Interesting subject.",
                    "label": 0
                },
                {
                    "sent": "Let's say curiosity, let's say interest in the topic, but in the other environment this mathematical environment focused on entrepreneurship.",
                    "label": 0
                },
                {
                    "sent": "There are many people interested in the subject, let's say curiosity or someone.",
                    "label": 0
                },
                {
                    "sent": "But there are people very focused on the aim of the of the community.",
                    "label": 0
                },
                {
                    "sent": "They want to enterpreneur.",
                    "label": 0
                },
                {
                    "sent": "To find a job or to improve their current job so.",
                    "label": 1
                },
                {
                    "sent": "May be too simple to to to make generalization, but in communities of knowledge we can find more.",
                    "label": 0
                },
                {
                    "sent": "That get it.",
                    "label": 0
                },
                {
                    "sent": "Collective An in academic mocks or general.",
                    "label": 0
                },
                {
                    "sent": "MC Platforms these people with.",
                    "label": 0
                },
                {
                    "sent": "Curiosity A maybe a chemical interest or so on.",
                    "label": 0
                },
                {
                    "sent": "So here we have.",
                    "label": 0
                },
                {
                    "sent": "Some ideas to reflect the importance to create specific thematic communities of knowledge, because maybe it has more sense for people how to select.",
                    "label": 0
                },
                {
                    "sent": "I don't know how to select MC so well just just to mention.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Rate of completion.",
                    "label": 0
                },
                {
                    "sent": "I have to say it's just the same content, the same evaluation, the same, all the same test.",
                    "label": 0
                },
                {
                    "sent": "I have to mention the the dropout if we compare with the average MC is quite low because the average is 90% of dropout.",
                    "label": 0
                },
                {
                    "sent": "And here we can see.",
                    "label": 0
                },
                {
                    "sent": "Quite high percentage of completion or completion of both, but.",
                    "label": 1
                },
                {
                    "sent": "There is no certification here.",
                    "label": 0
                },
                {
                    "sent": "There is certification here.",
                    "label": 0
                },
                {
                    "sent": "But this is a curious percentage, just one point 3.",
                    "label": 0
                },
                {
                    "sent": "Percent of people ask for certification, maybe because they have to pay.",
                    "label": 0
                },
                {
                    "sent": "I have no idea, but the completion is is high but is higher in this environment.",
                    "label": 0
                },
                {
                    "sent": "And this is the path.",
                    "label": 1
                },
                {
                    "sent": "Of drop out so just to have a look here.",
                    "label": 0
                },
                {
                    "sent": "People is very motivated.",
                    "label": 0
                },
                {
                    "sent": "First assessment, Second assessment, third assessment, and then the most interesting people remains.",
                    "label": 0
                },
                {
                    "sent": "This is more or less the path of most part of.",
                    "label": 0
                },
                {
                    "sent": "Off smokes.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's assess participation.",
                    "label": 0
                },
                {
                    "sent": "How is the level of interaction between peers in their different environments?",
                    "label": 0
                },
                {
                    "sent": "Let's go to the X MOOC platform.",
                    "label": 0
                },
                {
                    "sent": "No participation, just observers.",
                    "label": 0
                },
                {
                    "sent": "They only see the videos they make this self assessment test.",
                    "label": 0
                },
                {
                    "sent": "They complete the assignment but they don't participate, mainly enfora because the social tools are quite reduced.",
                    "label": 0
                },
                {
                    "sent": "Majority no participation.",
                    "label": 0
                },
                {
                    "sent": "Here is true.",
                    "label": 0
                },
                {
                    "sent": "We have more tools for participation.",
                    "label": 0
                },
                {
                    "sent": "Almost 80%.",
                    "label": 0
                },
                {
                    "sent": "Has allowed participation through.",
                    "label": 0
                },
                {
                    "sent": "But most part participate only 20% don't participate at all with other peers.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is just to show you the level of use of social tools here.",
                    "label": 1
                },
                {
                    "sent": "They have peer support.",
                    "label": 0
                },
                {
                    "sent": "Peer to peer assessment.",
                    "label": 0
                },
                {
                    "sent": "They use if they have the possibility they use, but not so intensive that then other activities and hear people who has more social tools they use.",
                    "label": 0
                },
                {
                    "sent": "They use them very much, especially peer to peer.",
                    "label": 0
                },
                {
                    "sent": "Activities.",
                    "label": 0
                },
                {
                    "sent": "We can say in this environment we can identify a very autonomous style of learning here.",
                    "label": 0
                },
                {
                    "sent": "And they asked also for academical support in the facilitator, and correct or support in this environment.",
                    "label": 1
                },
                {
                    "sent": "Yeah, very eight autonomous, but they use very much or their kind of tools for social support.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's go to level of success.",
                    "label": 1
                },
                {
                    "sent": "A quite interesting level of satisfaction is very, very similar.",
                    "label": 0
                },
                {
                    "sent": "There is no difference.",
                    "label": 0
                },
                {
                    "sent": "There is no difference of satisfaction.",
                    "label": 0
                },
                {
                    "sent": "People who participate in a moves.",
                    "label": 0
                },
                {
                    "sent": "It is not looking for very powerful technology or very I.",
                    "label": 0
                },
                {
                    "sent": "It makes me think very much.",
                    "label": 0
                },
                {
                    "sent": "Because the level of satisfaction is very very very similar.",
                    "label": 0
                },
                {
                    "sent": "But let's think about this success for providers OK.",
                    "label": 0
                },
                {
                    "sent": "Normally when we say that he has been very, very successful, when many people has register.",
                    "label": 0
                },
                {
                    "sent": "But at the end of the day, what's the success for for the institution who has organized?",
                    "label": 0
                },
                {
                    "sent": "For University, I imagine we have to put attention in this kind of measuring of variables of success for simple, what's happened after the sperian's.",
                    "label": 0
                },
                {
                    "sent": "Happens, oh.",
                    "label": 0
                },
                {
                    "sent": "Help University can a take advance of this students?",
                    "label": 0
                },
                {
                    "sent": "We asked the students after the MC Esperience I will not participate in formal course in unit.",
                    "label": 1
                },
                {
                    "sent": "In this case nobody.",
                    "label": 0
                },
                {
                    "sent": "Nobody nobody experience that.",
                    "label": 0
                },
                {
                    "sent": "That means I would like to participate in formal courses in unit.",
                    "label": 1
                },
                {
                    "sent": "Big percentage of people would like after this experience be involved in other, more formal a courses.",
                    "label": 0
                },
                {
                    "sent": "Many people want to repeat the experience with, uh, with Elder MC.",
                    "label": 0
                },
                {
                    "sent": "That means this style of education engage the people.",
                    "label": 0
                },
                {
                    "sent": "Knowing sense of certification or complexion but is hostile who people likes.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "After the Sperian's this is.",
                    "label": 0
                },
                {
                    "sent": "At least.",
                    "label": 0
                },
                {
                    "sent": "After experience I know better unit University.",
                    "label": 0
                },
                {
                    "sent": "Make us think about if books are a marketing tool for universities is well.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "See.",
                    "label": 0
                },
                {
                    "sent": "So 5 minutes OK. And let's evaluate the success for other kind of environments.",
                    "label": 0
                },
                {
                    "sent": "Let's let's think about Unix is on a community for entrepreneurship.",
                    "label": 1
                },
                {
                    "sent": "And at the end of the experience, the students say.",
                    "label": 0
                },
                {
                    "sent": "Do you feel capable to enterpreneur after?",
                    "label": 0
                },
                {
                    "sent": "This book totally capable, very capable, partially capable.",
                    "label": 0
                },
                {
                    "sent": "Nobody says no, it's not useful for me.",
                    "label": 0
                },
                {
                    "sent": "This is permanent experience, doesn't give me any A.",
                    "label": 0
                },
                {
                    "sent": "Any advantage any?",
                    "label": 0
                },
                {
                    "sent": "Ask me no value at all so.",
                    "label": 0
                },
                {
                    "sent": "The aim of the with the aim of the of the community.",
                    "label": 0
                },
                {
                    "sent": "One last question.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Languages.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "This course is.",
                    "label": 0
                },
                {
                    "sent": "Have been organized for a Spanish institutions both.",
                    "label": 0
                },
                {
                    "sent": "A Unix has latinoamericana scope.",
                    "label": 0
                },
                {
                    "sent": "But you need is on Spanish distance University.",
                    "label": 0
                },
                {
                    "sent": "Their language is in mainly in Spain.",
                    "label": 0
                },
                {
                    "sent": "But it's true, this University has has different centers.",
                    "label": 0
                },
                {
                    "sent": "Not only in the country, but also in different continents.",
                    "label": 0
                },
                {
                    "sent": "But this is a Spanish institution.",
                    "label": 0
                },
                {
                    "sent": "So let's go to the.",
                    "label": 0
                },
                {
                    "sent": "To the student who has participates in the.",
                    "label": 0
                },
                {
                    "sent": "In the in the book.",
                    "label": 0
                },
                {
                    "sent": "In this platform, which is Justin's in Spanish.",
                    "label": 0
                },
                {
                    "sent": "More students come from Spanish speaking countries.",
                    "label": 0
                },
                {
                    "sent": "Spank Colombia, Mexico cantina, Peru.",
                    "label": 1
                },
                {
                    "sent": "Let's go to the other environment.",
                    "label": 0
                },
                {
                    "sent": "This environment is in Portuguese also, so the 2nd.",
                    "label": 0
                },
                {
                    "sent": "Group comes from from Brazil.",
                    "label": 0
                },
                {
                    "sent": "That means.",
                    "label": 0
                },
                {
                    "sent": "Languages and naval knew public knew collective and so on.",
                    "label": 0
                },
                {
                    "sent": "So so.",
                    "label": 0
                },
                {
                    "sent": "They mean.",
                    "label": 0
                },
                {
                    "sent": "One of the main we have, of course we have to continue analyzing the environments and so on, but.",
                    "label": 0
                },
                {
                    "sent": "The language is one of the main enable of this kind.",
                    "label": 0
                },
                {
                    "sent": "For internationalization of this kind of experiences.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just to finalize preliminary findings, typical summer morphic profile mom.",
                    "label": 0
                },
                {
                    "sent": "It's in between their 30s.",
                    "label": 0
                },
                {
                    "sent": "Hi location work around one motivation, interesting academic subject and job purpose.",
                    "label": 1
                },
                {
                    "sent": "Purpose for long flights that we mainly.",
                    "label": 1
                },
                {
                    "sent": "Level of dropout cinema could be LinkedIn.",
                    "label": 0
                },
                {
                    "sent": "Some cases we certification availability.",
                    "label": 0
                },
                {
                    "sent": "Especially.",
                    "label": 0
                },
                {
                    "sent": "In academic MC environments, people who is participating in other kind of environments are not so interested in certification because we have seen in the other environment.",
                    "label": 0
                },
                {
                    "sent": "Xbox.",
                    "label": 0
                },
                {
                    "sent": "Of course promotes less interaction between peers than other than communities of knowledge that use simix.",
                    "label": 1
                },
                {
                    "sent": "Learning style in books is mainly autonomous but ICT and social tools can enable more collectible collaborative learning style.",
                    "label": 1
                },
                {
                    "sent": "A6 MacBook success must be measured beyond the scalability of the online learning experience.",
                    "label": 1
                },
                {
                    "sent": "Level of satisfaction and outputs for students and for institutions must be taken in account.",
                    "label": 1
                },
                {
                    "sent": "Language is the main enable for internal internationalization of monks.",
                    "label": 0
                },
                {
                    "sent": "Lesson learn after the analysis.",
                    "label": 0
                },
                {
                    "sent": "Despite the same team has the below.",
                    "label": 0
                },
                {
                    "sent": "Both environment is very complicated when standardized a framework assessment and compare learning analytics so.",
                    "label": 0
                },
                {
                    "sent": "Standardized framework for assessment is needed for more in depth analysis.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is it a intuition without data or your opinions?",
                    "label": 0
                },
                {
                    "sent": "Thank you so much.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        }
    }
}