{
    "id": "auz2jzohypx7zpqkz3xfumhlqvkynn3u",
    "title": "Introduction: Presentations of Different Views on Clustering by the Workshop Organizers",
    "info": {
        "author": [
            "Ulrike von Luxburg, Max Planck Institute for Biological Cybernetics, Max Planck Institute",
            "Shai Ben-David, David R. Cheriton School of Computer Science, University of Waterloo",
            "Avrim Blum, School of Computer Science, Carnegie Mellon University"
        ],
        "published": "Jan. 19, 2010",
        "recorded": "December 2009",
        "category": [
            "Top->Computer Science->Machine Learning->Clustering"
        ]
    },
    "url": "http://videolectures.net/nipsworkshops09_luxburg_ben_david_blum_intro/",
    "segmentation": [
        [
            "So let me start by telling you how in fact we came to organize this workshop, so of course everybody knows there are lots of unsolved questions on clustering, and I think if I ask each of you, probably if you can come up with five different questions which are sort of unsolved in clustering.",
            "One prominent question, for example, is how can you evaluate different clustering algorithms and how can you compare different clustering algorithms across certain, like not just in one framework but across frameworks.",
            "So that's one question we started with and the helpful exercise if you think about this question is to imagine organizing a clustering competition.",
            "So glad spring competitions have turned out to be a very useful tool in machine learning.",
            "Research is a baby on it's organized quite a lot of them on semi supervised learning and on causality and so on, and they're very good for focusing research to get results which are really useful in practice.",
            "So we started thinking about this question.",
            "How could you organize a clustering competition?",
            "And of course you have to answer all these questions like which.",
            "Kind of tasks.",
            "Do you choose?",
            "How do you evaluate the tasks?",
            "Which kind of datasets do you choose?",
            "And of course, all this is completely non obvious in clustering and we started thinking about this and at some point Isabel in practice.",
            "And then we decided to merge our workshops, and that's where we are now.",
            "And we decided that the workshop should contain three different tracks, so."
        ],
        [
            "The first track is the one which we call from theory to practice.",
            "Here we want to discuss like what kind of theoretically results should we prove, or in which framework should be approved and such that the results will be will be important and have an impact on practical application of clustering.",
            "The second track is from practice to theory and then we want to know like what questions do practitioners have which they would like the theoreticians to answer.",
            "The third question is this.",
            "From art to science, or is clustering science or ads and I'm going to explain in a second, but this question is about So what we're going to do in this introduction now is I will present this third part from art to science, and then we will have two other talks one by by Shyam on the FM which will talk more about this part from theory to practice and this introduction, Surface sources, sort of giving ideas of what direction should be about and what kind of questions we want to discuss."
        ],
        [
            "So during our discussions about about the workshop is about organizing clustering competitions, we exchange lots of emails, and here's one slide to which for me was really the essence of all these emails.",
            "So I always asked Isabel.",
            "OK, So what should I do if you organize a clustering competition?",
            "For example, say I have a. I have a nice clustering algorithm.",
            "What should I do to convince you to use my clustering algorithm in practice?",
            "And what you said?",
            "And in fact that's exactly how she how she wrote it in her email.",
            "Actually, what should the practitioner expect?",
            "I have K means and I have.",
            "Linkage clustering's in my toolbox.",
            "If I use something else, what could be better?",
            "I don't believe that an algorithm can find my address wrong anyway, so in fact she just says well.",
            "I don't really care what kind of theoretical results you prove I I sort of consider clustering more is an ad to find sort of the clusterings I've been looking for, but it's not.",
            "I'm not interested in any scores or anything like this, so if you try to prove something about scores and probably not interested in and, I won't use your algorithm anyway.",
            "And that was sort of the.",
            "And that's shows very nicely.",
            "This art versus science aspect.",
            "So is a very treats clustering more like an arch.",
            "So she says it's a tool, but she's the artist and she needs to use this tool to find the clustering.",
            "She wants to find.",
            "And I thought clustering is sort of.",
            "It's a scientific discipline.",
            "I write nice purpose, I develop algorithms, I prove something, I make experience, and some of these two things don't seem to fit together, and that's what this part of the workshop is about."
        ],
        [
            "We've also found, and we've been looking for a lot of literature, and we found a very nice quotation which I want to tell you about 'cause I really like it.",
            "Yeah, so the quotation goes as follows.",
            "The theoretical theoreticians of numerical taxonomy have enjoyed themselves immensely over the past decade.",
            "The mushrooming literature is quite fascinating and new developments tumbled each after each other.",
            "Anyone who's prepared to learn learn quite a deal of matrix algebra, some classical mathematical statistics, some advanced geometry, and set theory.",
            "Perhaps a little information theory and graph theory, and some computer technique, and who has access to a good computer and enjoys mathematics.",
            "As he must, if he gets that far, will probably find the development of new new taxi metric methods much more rewarding, more up-to-date, much general, intense, more prestigious than merely classifying plants or animals are working out their fellow attorneys, so this has been written by biologists already in the year in 1986.",
            "Sixty eight so.",
            "So it's quite it's so it's sort of the same inside as I had in my discussion with Isabel.",
            "So he just says, well, I want to workout this clustering.",
            "I don't really care what kind of theorems you prove.",
            "I really don't care and you can play around with your mathematics, but I can't be bothered and I think this is really a very nice citation, which exactly summarizes the situation in which we seem to be in the moment."
        ],
        [
            "So what is missing in the in this literature on clustering what we are supply and so we believe that the point is that in the scientific literature clustering is mostly treated as.",
            "Problem which is so as a method which is independent of problems of why use clustering in the end and we believe that this is and it's quite obvious that this is not the case, but we believe that this is the reason why I sort of the clustering literature doesn't really fit to what the applied people really want us to do.",
            "So if you just look at a certain problem, for example, you want to cluster different kinds of crop and you say you're a biologist and you workout, you want to work out there that there are genetic dependencies.",
            "This is one way how you can cluster crop, but if you are far more you run, I don't know farming company and you want to cluster crops according to how the resistance they outputted routes.",
            "For example then this is a completely different thing and unless you specify what you want to do in the end with your clustering, there's no way how you could evaluate a clustering algorithm on such a data set without telling me before and what you want to do with it."
        ],
        [
            "And so, in our opinion, this is really a very important gap in the classroom literature.",
            "So everybody just treats clustering as one standard problem once they're not set up.",
            "Here's my objective function.",
            "I solve it done, and people don't really look at what the what is the what do I want to do with my clustering afterwards?",
            "So what we believe should be done is one has to take into account how useful a given clustering is for the application I want to solve.",
            "So first of all I tell you what do I want to do with my clustering.",
            "Then you can go around, fiddle with the algorithms and.",
            "I tell you how useful is what you found for my application, and this is the way in which we should evaluate clustering algorithms.",
            "The problem, of course is this as opposed to classification, we don't have something like a general loss function, so it's hard off and it's very hard to quantify what this utility is and the IT will be an important aspect in this research to try to come up with methods to quantify and to measure the utility of certain solutions to clustering problems."
        ],
        [
            "Why do we believe that?",
            "What is kinda done is not what should be done.",
            "So if we look at the standard clustering paper which maybe appears at NIPS save, somebody suggests a new clustering algorithm.",
            "How do they evaluate it?",
            "First of all, they evaluated on artificial datasets.",
            "OK, maybe it shows that the classroom algorithm finds blocks in your letter, but it doesn't really show much more.",
            "It's a baseline test to show that it's not a complete rubbish, maybe.",
            "Then what many people do is to evaluate it on classification data set.",
            "So you're given a data set which already has class labels, and then they run their clustering algorithm and they say the result is good if the result of your algorithm coincides with a given class labels.",
            "In my personal opinion, but it's not.",
            "We're not an agreement about this on the between all the organizers, but my personal opinion is that this doesn't make sense because as in the example beforehand, there are different ways how you could cluster your data.",
            "You could cluster your crop according to.",
            "To genetic dependencies or to properties of the plant, and this leads to different clusterings and then it's meaningless to say that the label links are different from each other.",
            "It might just be that both are useful clusterings.",
            "And the third thing that many people then do is they have one data set where they apply clustering, which is a real world data set, whatever that means and they just show.",
            "I find a classroom which makes sense to the people who look at this data.",
            "And this is off.",
            "It's not very meaningful.",
            "So because we didn't know what we've been looking for before, so just finding something which which looks useful or which looks sort of not stupid to someone who knows the data is not very meaningful at all."
        ],
        [
            "So what do we believe should be done instead?",
            "I will show it to two different examples.",
            "The first one is.",
            "So what is important is really we need to take into account what we want to cluster for.",
            "So the example I want to present first is some kind of object detection system where we use clustering as a preprocessing step.",
            "So say were given our images, we extract features, we cluster features.",
            "We do lots of different steps and in the end we want to detect faces in an image.",
            "So here we have a very clear goal.",
            "The goal is to detect faces in the image and we want maybe to label say this is a phase or this is not a phase.",
            "So we have a clear objective function.",
            "In this case, it's the error of our face detection system and to evaluate what capturing should do in this.",
            "In this setting is very simple, we could just do something like a cross validation over clustering algorithms.",
            "So we could just we just try out different clustering algorithms and we measure how good is the performance of the overall system in the end and this tells us how useful the clustering is for this particular application.",
            "What is important in this context is that it is completely meaningless for this application, for example to measure something like.",
            "To say the clusters have a high within cluster similarity, intense is useful, so measuring within cluster similarities maybe a tool which I can use to find my classes, but it really doesn't tell me anything about how useful it is and it can be there.",
            "Find a great clustering with great score function, but it's not useful for my image classification system and the same holds for many other score functions I can."
        ],
        [
            "How about this?",
            "The second example is used clustering in a completely different context that's also often cited in the literature.",
            "Clustering is a tool for exploratory data analysis.",
            "And if we if one reads out what exploratory data analysis means, in fact there's a citation by good, which says the goal of exploratory data analysis is to present the data to the analysts such that he can see patterns and formulate interesting hypothesis about the data.",
            "So this is a pretty clear, defined goal.",
            "There you have your data set and you should use explore your data, whatever the However you do that, but in the end we should come up with a hypothesis about your data.",
            "And of course you hope that the hypothesis is correct.",
            "So you could later on test your hypothesis and figure out whether you've come up with a good hypothesis or not.",
            "If you want to evaluate clustering in such a scenario, there's no way you can get around doing real user studies because it's going to be the human who sits there, looks maybe has lots of visualization techniques.",
            "He looked looks at these images.",
            "And tries to find patterns in the data, and there's another clustering is useful in this application or not can only be measured if we look at whether the human can use this clustering to evaluate to find nice hypothesis about our data.",
            "And of course it's not easy how to do that and it might turn out that in this context a clustering algorithm is not important anyway.",
            "Maybe that's also what Isabel in my first slide was pointing towards that in such a situation it's not so important.",
            "What algorithm I use anyway."
        ],
        [
            "So now we're in a setting where when things OK, they're like 5 million different classroom problems.",
            "So what we should do is we come up with a table on the left hand side.",
            "We have clustering problem on the right.",
            "Inside we have evaluation and then we can run tests for each of these methods.",
            "For each of these problems and sort of find out whether there are certain algorithms which work better or more words, But this is not very satisfactory because it's just not a very systematic approach and the question is whether we can do something which is a bit more systematic in this setting."
        ],
        [
            "And we have some suggests and what we what we could try to do so our suggestion is to try to build something like a catalog of clustering problems.",
            "And the point here is that we're talking about a problem.",
            "So problem in our sense is always like you define what the end goal is.",
            "That's the problem and we now try to build a catalog of such problems and try to identify important properties of problems which we could use them to evaluate.",
            "Groups of algorithms, right?",
            "Or to design strategies to evaluate groups of algorithms rather than individual algorithms in my table."
        ],
        [
            "And we spend some time brainstorming about what could be useful categories, and this is just one one suggestion.",
            "There are lots of different ways how we could do this, and we haven't really worked on trying to do the theory in this case, but So what we mean by properties is something like a classroom can be qualified like a problem, can search for qualitative or quantitative clustering.",
            "So qualitative clustering is more some or something like in the exploratory data analysis case you were just interested in what is in your class.",
            "It's not really.",
            "There's no hard number you can measure.",
            "In this sense, there is a quantitative clustering might maybe be something like data compression.",
            "You have compression rate, it's a number, and that's very easy to evaluate.",
            "There are lots of other properties which we could use.",
            "It's like there are different levels of supervision in different clustering problems.",
            "So many people say that it's very rare that you have a completely unsupervised clustering.",
            "Often you already know what you're looking for, at least in a bit bit.",
            "Inductive bias, which is really important, so as in classification you can't just expect to find like.",
            "First of all you have to do.",
            "You have sort of to reduce your hypothesis class if you want to find useful clusters and if you don't want to fit noise.",
            "So the question is how do you reduce your hypothesis class?",
            "And this is sort of the inductive inductive bias you're looking at.",
            "For example one which is really important is what I called peak based versus gap based on the slide peak based means your interest.",
            "So this refers to the underlying density.",
            "So peak base means.",
            "We're interested in whether two points are really in the same high density region of our space, so we're interested in the peaks of the density, and that's something completely different than the gap based approach where I'm interested in whether two points are in different clusters, and we would probably need different evaluation strategies for these different properties.",
            "OK, so."
        ],
        [
            "Main suggestion is.",
            "To try to build this such a catalog of clustering problems and try to find useful evaluation evaluation strategies for all these problems.",
            "What is really important in our pointers that classroom research should not focus on developing new algorithms or new objective functions?",
            "Because what is currently more important is to try to figure out how we can measure the usefulness of a clustering, and the usefulness cannot measure be something like normal S cut, but it needs to really be problem dependent.",
            "And if we have such A and to evaluate clustering algorithm, so we really need to look at what what is what does the user want to do with his clustering in this measures how useful the clustering is in the end.",
            "OK, so this is sort of what you're interested in.",
            "This first part of the workshop, which is sort of the formats to science perspective, and now I'm heading over to Shai, who's going to talk about the theory to practice part.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me start by telling you how in fact we came to organize this workshop, so of course everybody knows there are lots of unsolved questions on clustering, and I think if I ask each of you, probably if you can come up with five different questions which are sort of unsolved in clustering.",
                    "label": 0
                },
                {
                    "sent": "One prominent question, for example, is how can you evaluate different clustering algorithms and how can you compare different clustering algorithms across certain, like not just in one framework but across frameworks.",
                    "label": 0
                },
                {
                    "sent": "So that's one question we started with and the helpful exercise if you think about this question is to imagine organizing a clustering competition.",
                    "label": 0
                },
                {
                    "sent": "So glad spring competitions have turned out to be a very useful tool in machine learning.",
                    "label": 0
                },
                {
                    "sent": "Research is a baby on it's organized quite a lot of them on semi supervised learning and on causality and so on, and they're very good for focusing research to get results which are really useful in practice.",
                    "label": 0
                },
                {
                    "sent": "So we started thinking about this question.",
                    "label": 0
                },
                {
                    "sent": "How could you organize a clustering competition?",
                    "label": 1
                },
                {
                    "sent": "And of course you have to answer all these questions like which.",
                    "label": 0
                },
                {
                    "sent": "Kind of tasks.",
                    "label": 0
                },
                {
                    "sent": "Do you choose?",
                    "label": 1
                },
                {
                    "sent": "How do you evaluate the tasks?",
                    "label": 0
                },
                {
                    "sent": "Which kind of datasets do you choose?",
                    "label": 0
                },
                {
                    "sent": "And of course, all this is completely non obvious in clustering and we started thinking about this and at some point Isabel in practice.",
                    "label": 0
                },
                {
                    "sent": "And then we decided to merge our workshops, and that's where we are now.",
                    "label": 0
                },
                {
                    "sent": "And we decided that the workshop should contain three different tracks, so.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The first track is the one which we call from theory to practice.",
                    "label": 0
                },
                {
                    "sent": "Here we want to discuss like what kind of theoretically results should we prove, or in which framework should be approved and such that the results will be will be important and have an impact on practical application of clustering.",
                    "label": 0
                },
                {
                    "sent": "The second track is from practice to theory and then we want to know like what questions do practitioners have which they would like the theoreticians to answer.",
                    "label": 1
                },
                {
                    "sent": "The third question is this.",
                    "label": 0
                },
                {
                    "sent": "From art to science, or is clustering science or ads and I'm going to explain in a second, but this question is about So what we're going to do in this introduction now is I will present this third part from art to science, and then we will have two other talks one by by Shyam on the FM which will talk more about this part from theory to practice and this introduction, Surface sources, sort of giving ideas of what direction should be about and what kind of questions we want to discuss.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So during our discussions about about the workshop is about organizing clustering competitions, we exchange lots of emails, and here's one slide to which for me was really the essence of all these emails.",
                    "label": 0
                },
                {
                    "sent": "So I always asked Isabel.",
                    "label": 0
                },
                {
                    "sent": "OK, So what should I do if you organize a clustering competition?",
                    "label": 0
                },
                {
                    "sent": "For example, say I have a. I have a nice clustering algorithm.",
                    "label": 0
                },
                {
                    "sent": "What should I do to convince you to use my clustering algorithm in practice?",
                    "label": 1
                },
                {
                    "sent": "And what you said?",
                    "label": 0
                },
                {
                    "sent": "And in fact that's exactly how she how she wrote it in her email.",
                    "label": 1
                },
                {
                    "sent": "Actually, what should the practitioner expect?",
                    "label": 0
                },
                {
                    "sent": "I have K means and I have.",
                    "label": 1
                },
                {
                    "sent": "Linkage clustering's in my toolbox.",
                    "label": 1
                },
                {
                    "sent": "If I use something else, what could be better?",
                    "label": 0
                },
                {
                    "sent": "I don't believe that an algorithm can find my address wrong anyway, so in fact she just says well.",
                    "label": 0
                },
                {
                    "sent": "I don't really care what kind of theoretical results you prove I I sort of consider clustering more is an ad to find sort of the clusterings I've been looking for, but it's not.",
                    "label": 0
                },
                {
                    "sent": "I'm not interested in any scores or anything like this, so if you try to prove something about scores and probably not interested in and, I won't use your algorithm anyway.",
                    "label": 0
                },
                {
                    "sent": "And that was sort of the.",
                    "label": 0
                },
                {
                    "sent": "And that's shows very nicely.",
                    "label": 0
                },
                {
                    "sent": "This art versus science aspect.",
                    "label": 0
                },
                {
                    "sent": "So is a very treats clustering more like an arch.",
                    "label": 0
                },
                {
                    "sent": "So she says it's a tool, but she's the artist and she needs to use this tool to find the clustering.",
                    "label": 0
                },
                {
                    "sent": "She wants to find.",
                    "label": 0
                },
                {
                    "sent": "And I thought clustering is sort of.",
                    "label": 0
                },
                {
                    "sent": "It's a scientific discipline.",
                    "label": 0
                },
                {
                    "sent": "I write nice purpose, I develop algorithms, I prove something, I make experience, and some of these two things don't seem to fit together, and that's what this part of the workshop is about.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We've also found, and we've been looking for a lot of literature, and we found a very nice quotation which I want to tell you about 'cause I really like it.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so the quotation goes as follows.",
                    "label": 0
                },
                {
                    "sent": "The theoretical theoreticians of numerical taxonomy have enjoyed themselves immensely over the past decade.",
                    "label": 1
                },
                {
                    "sent": "The mushrooming literature is quite fascinating and new developments tumbled each after each other.",
                    "label": 0
                },
                {
                    "sent": "Anyone who's prepared to learn learn quite a deal of matrix algebra, some classical mathematical statistics, some advanced geometry, and set theory.",
                    "label": 1
                },
                {
                    "sent": "Perhaps a little information theory and graph theory, and some computer technique, and who has access to a good computer and enjoys mathematics.",
                    "label": 1
                },
                {
                    "sent": "As he must, if he gets that far, will probably find the development of new new taxi metric methods much more rewarding, more up-to-date, much general, intense, more prestigious than merely classifying plants or animals are working out their fellow attorneys, so this has been written by biologists already in the year in 1986.",
                    "label": 0
                },
                {
                    "sent": "Sixty eight so.",
                    "label": 0
                },
                {
                    "sent": "So it's quite it's so it's sort of the same inside as I had in my discussion with Isabel.",
                    "label": 0
                },
                {
                    "sent": "So he just says, well, I want to workout this clustering.",
                    "label": 0
                },
                {
                    "sent": "I don't really care what kind of theorems you prove.",
                    "label": 0
                },
                {
                    "sent": "I really don't care and you can play around with your mathematics, but I can't be bothered and I think this is really a very nice citation, which exactly summarizes the situation in which we seem to be in the moment.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is missing in the in this literature on clustering what we are supply and so we believe that the point is that in the scientific literature clustering is mostly treated as.",
                    "label": 1
                },
                {
                    "sent": "Problem which is so as a method which is independent of problems of why use clustering in the end and we believe that this is and it's quite obvious that this is not the case, but we believe that this is the reason why I sort of the clustering literature doesn't really fit to what the applied people really want us to do.",
                    "label": 1
                },
                {
                    "sent": "So if you just look at a certain problem, for example, you want to cluster different kinds of crop and you say you're a biologist and you workout, you want to work out there that there are genetic dependencies.",
                    "label": 0
                },
                {
                    "sent": "This is one way how you can cluster crop, but if you are far more you run, I don't know farming company and you want to cluster crops according to how the resistance they outputted routes.",
                    "label": 0
                },
                {
                    "sent": "For example then this is a completely different thing and unless you specify what you want to do in the end with your clustering, there's no way how you could evaluate a clustering algorithm on such a data set without telling me before and what you want to do with it.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so, in our opinion, this is really a very important gap in the classroom literature.",
                    "label": 1
                },
                {
                    "sent": "So everybody just treats clustering as one standard problem once they're not set up.",
                    "label": 0
                },
                {
                    "sent": "Here's my objective function.",
                    "label": 1
                },
                {
                    "sent": "I solve it done, and people don't really look at what the what is the what do I want to do with my clustering afterwards?",
                    "label": 0
                },
                {
                    "sent": "So what we believe should be done is one has to take into account how useful a given clustering is for the application I want to solve.",
                    "label": 0
                },
                {
                    "sent": "So first of all I tell you what do I want to do with my clustering.",
                    "label": 0
                },
                {
                    "sent": "Then you can go around, fiddle with the algorithms and.",
                    "label": 0
                },
                {
                    "sent": "I tell you how useful is what you found for my application, and this is the way in which we should evaluate clustering algorithms.",
                    "label": 0
                },
                {
                    "sent": "The problem, of course is this as opposed to classification, we don't have something like a general loss function, so it's hard off and it's very hard to quantify what this utility is and the IT will be an important aspect in this research to try to come up with methods to quantify and to measure the utility of certain solutions to clustering problems.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Why do we believe that?",
                    "label": 0
                },
                {
                    "sent": "What is kinda done is not what should be done.",
                    "label": 0
                },
                {
                    "sent": "So if we look at the standard clustering paper which maybe appears at NIPS save, somebody suggests a new clustering algorithm.",
                    "label": 0
                },
                {
                    "sent": "How do they evaluate it?",
                    "label": 0
                },
                {
                    "sent": "First of all, they evaluated on artificial datasets.",
                    "label": 0
                },
                {
                    "sent": "OK, maybe it shows that the classroom algorithm finds blocks in your letter, but it doesn't really show much more.",
                    "label": 0
                },
                {
                    "sent": "It's a baseline test to show that it's not a complete rubbish, maybe.",
                    "label": 1
                },
                {
                    "sent": "Then what many people do is to evaluate it on classification data set.",
                    "label": 0
                },
                {
                    "sent": "So you're given a data set which already has class labels, and then they run their clustering algorithm and they say the result is good if the result of your algorithm coincides with a given class labels.",
                    "label": 0
                },
                {
                    "sent": "In my personal opinion, but it's not.",
                    "label": 0
                },
                {
                    "sent": "We're not an agreement about this on the between all the organizers, but my personal opinion is that this doesn't make sense because as in the example beforehand, there are different ways how you could cluster your data.",
                    "label": 0
                },
                {
                    "sent": "You could cluster your crop according to.",
                    "label": 0
                },
                {
                    "sent": "To genetic dependencies or to properties of the plant, and this leads to different clusterings and then it's meaningless to say that the label links are different from each other.",
                    "label": 0
                },
                {
                    "sent": "It might just be that both are useful clusterings.",
                    "label": 1
                },
                {
                    "sent": "And the third thing that many people then do is they have one data set where they apply clustering, which is a real world data set, whatever that means and they just show.",
                    "label": 1
                },
                {
                    "sent": "I find a classroom which makes sense to the people who look at this data.",
                    "label": 0
                },
                {
                    "sent": "And this is off.",
                    "label": 0
                },
                {
                    "sent": "It's not very meaningful.",
                    "label": 0
                },
                {
                    "sent": "So because we didn't know what we've been looking for before, so just finding something which which looks useful or which looks sort of not stupid to someone who knows the data is not very meaningful at all.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what do we believe should be done instead?",
                    "label": 0
                },
                {
                    "sent": "I will show it to two different examples.",
                    "label": 0
                },
                {
                    "sent": "The first one is.",
                    "label": 0
                },
                {
                    "sent": "So what is important is really we need to take into account what we want to cluster for.",
                    "label": 0
                },
                {
                    "sent": "So the example I want to present first is some kind of object detection system where we use clustering as a preprocessing step.",
                    "label": 1
                },
                {
                    "sent": "So say were given our images, we extract features, we cluster features.",
                    "label": 0
                },
                {
                    "sent": "We do lots of different steps and in the end we want to detect faces in an image.",
                    "label": 0
                },
                {
                    "sent": "So here we have a very clear goal.",
                    "label": 0
                },
                {
                    "sent": "The goal is to detect faces in the image and we want maybe to label say this is a phase or this is not a phase.",
                    "label": 0
                },
                {
                    "sent": "So we have a clear objective function.",
                    "label": 0
                },
                {
                    "sent": "In this case, it's the error of our face detection system and to evaluate what capturing should do in this.",
                    "label": 0
                },
                {
                    "sent": "In this setting is very simple, we could just do something like a cross validation over clustering algorithms.",
                    "label": 1
                },
                {
                    "sent": "So we could just we just try out different clustering algorithms and we measure how good is the performance of the overall system in the end and this tells us how useful the clustering is for this particular application.",
                    "label": 0
                },
                {
                    "sent": "What is important in this context is that it is completely meaningless for this application, for example to measure something like.",
                    "label": 0
                },
                {
                    "sent": "To say the clusters have a high within cluster similarity, intense is useful, so measuring within cluster similarities maybe a tool which I can use to find my classes, but it really doesn't tell me anything about how useful it is and it can be there.",
                    "label": 0
                },
                {
                    "sent": "Find a great clustering with great score function, but it's not useful for my image classification system and the same holds for many other score functions I can.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How about this?",
                    "label": 0
                },
                {
                    "sent": "The second example is used clustering in a completely different context that's also often cited in the literature.",
                    "label": 0
                },
                {
                    "sent": "Clustering is a tool for exploratory data analysis.",
                    "label": 0
                },
                {
                    "sent": "And if we if one reads out what exploratory data analysis means, in fact there's a citation by good, which says the goal of exploratory data analysis is to present the data to the analysts such that he can see patterns and formulate interesting hypothesis about the data.",
                    "label": 1
                },
                {
                    "sent": "So this is a pretty clear, defined goal.",
                    "label": 0
                },
                {
                    "sent": "There you have your data set and you should use explore your data, whatever the However you do that, but in the end we should come up with a hypothesis about your data.",
                    "label": 0
                },
                {
                    "sent": "And of course you hope that the hypothesis is correct.",
                    "label": 0
                },
                {
                    "sent": "So you could later on test your hypothesis and figure out whether you've come up with a good hypothesis or not.",
                    "label": 0
                },
                {
                    "sent": "If you want to evaluate clustering in such a scenario, there's no way you can get around doing real user studies because it's going to be the human who sits there, looks maybe has lots of visualization techniques.",
                    "label": 0
                },
                {
                    "sent": "He looked looks at these images.",
                    "label": 0
                },
                {
                    "sent": "And tries to find patterns in the data, and there's another clustering is useful in this application or not can only be measured if we look at whether the human can use this clustering to evaluate to find nice hypothesis about our data.",
                    "label": 0
                },
                {
                    "sent": "And of course it's not easy how to do that and it might turn out that in this context a clustering algorithm is not important anyway.",
                    "label": 0
                },
                {
                    "sent": "Maybe that's also what Isabel in my first slide was pointing towards that in such a situation it's not so important.",
                    "label": 0
                },
                {
                    "sent": "What algorithm I use anyway.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now we're in a setting where when things OK, they're like 5 million different classroom problems.",
                    "label": 0
                },
                {
                    "sent": "So what we should do is we come up with a table on the left hand side.",
                    "label": 0
                },
                {
                    "sent": "We have clustering problem on the right.",
                    "label": 0
                },
                {
                    "sent": "Inside we have evaluation and then we can run tests for each of these methods.",
                    "label": 0
                },
                {
                    "sent": "For each of these problems and sort of find out whether there are certain algorithms which work better or more words, But this is not very satisfactory because it's just not a very systematic approach and the question is whether we can do something which is a bit more systematic in this setting.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we have some suggests and what we what we could try to do so our suggestion is to try to build something like a catalog of clustering problems.",
                    "label": 1
                },
                {
                    "sent": "And the point here is that we're talking about a problem.",
                    "label": 0
                },
                {
                    "sent": "So problem in our sense is always like you define what the end goal is.",
                    "label": 1
                },
                {
                    "sent": "That's the problem and we now try to build a catalog of such problems and try to identify important properties of problems which we could use them to evaluate.",
                    "label": 1
                },
                {
                    "sent": "Groups of algorithms, right?",
                    "label": 0
                },
                {
                    "sent": "Or to design strategies to evaluate groups of algorithms rather than individual algorithms in my table.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we spend some time brainstorming about what could be useful categories, and this is just one one suggestion.",
                    "label": 1
                },
                {
                    "sent": "There are lots of different ways how we could do this, and we haven't really worked on trying to do the theory in this case, but So what we mean by properties is something like a classroom can be qualified like a problem, can search for qualitative or quantitative clustering.",
                    "label": 0
                },
                {
                    "sent": "So qualitative clustering is more some or something like in the exploratory data analysis case you were just interested in what is in your class.",
                    "label": 0
                },
                {
                    "sent": "It's not really.",
                    "label": 0
                },
                {
                    "sent": "There's no hard number you can measure.",
                    "label": 0
                },
                {
                    "sent": "In this sense, there is a quantitative clustering might maybe be something like data compression.",
                    "label": 0
                },
                {
                    "sent": "You have compression rate, it's a number, and that's very easy to evaluate.",
                    "label": 0
                },
                {
                    "sent": "There are lots of other properties which we could use.",
                    "label": 0
                },
                {
                    "sent": "It's like there are different levels of supervision in different clustering problems.",
                    "label": 1
                },
                {
                    "sent": "So many people say that it's very rare that you have a completely unsupervised clustering.",
                    "label": 0
                },
                {
                    "sent": "Often you already know what you're looking for, at least in a bit bit.",
                    "label": 0
                },
                {
                    "sent": "Inductive bias, which is really important, so as in classification you can't just expect to find like.",
                    "label": 0
                },
                {
                    "sent": "First of all you have to do.",
                    "label": 0
                },
                {
                    "sent": "You have sort of to reduce your hypothesis class if you want to find useful clusters and if you don't want to fit noise.",
                    "label": 0
                },
                {
                    "sent": "So the question is how do you reduce your hypothesis class?",
                    "label": 1
                },
                {
                    "sent": "And this is sort of the inductive inductive bias you're looking at.",
                    "label": 0
                },
                {
                    "sent": "For example one which is really important is what I called peak based versus gap based on the slide peak based means your interest.",
                    "label": 0
                },
                {
                    "sent": "So this refers to the underlying density.",
                    "label": 0
                },
                {
                    "sent": "So peak base means.",
                    "label": 0
                },
                {
                    "sent": "We're interested in whether two points are really in the same high density region of our space, so we're interested in the peaks of the density, and that's something completely different than the gap based approach where I'm interested in whether two points are in different clusters, and we would probably need different evaluation strategies for these different properties.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Main suggestion is.",
                    "label": 0
                },
                {
                    "sent": "To try to build this such a catalog of clustering problems and try to find useful evaluation evaluation strategies for all these problems.",
                    "label": 1
                },
                {
                    "sent": "What is really important in our pointers that classroom research should not focus on developing new algorithms or new objective functions?",
                    "label": 1
                },
                {
                    "sent": "Because what is currently more important is to try to figure out how we can measure the usefulness of a clustering, and the usefulness cannot measure be something like normal S cut, but it needs to really be problem dependent.",
                    "label": 0
                },
                {
                    "sent": "And if we have such A and to evaluate clustering algorithm, so we really need to look at what what is what does the user want to do with his clustering in this measures how useful the clustering is in the end.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is sort of what you're interested in.",
                    "label": 0
                },
                {
                    "sent": "This first part of the workshop, which is sort of the formats to science perspective, and now I'm heading over to Shai, who's going to talk about the theory to practice part.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}