{
    "id": "ayb672hkyzklad3nm6gcqgqwkcyvjgfa",
    "title": "Efficient Decoding of Ternary Error-Correcting Output Codes for Multiclass Classification",
    "info": {
        "author": [
            "Sang-Hyeun Park, Darmstadt University of Technology"
        ],
        "published": "Oct. 20, 2009",
        "recorded": "September 2009",
        "category": [
            "Top->Computer Science->Machine Learning"
        ]
    },
    "url": "http://videolectures.net/ecmlpkdd09_park_edtecocmc/",
    "segmentation": [
        [
            "Hello, my name is hung in Park and this is joint work with you on this phone cons.",
            "Um?",
            "I will talk about our work on efficient decoding of 10 error correcting output codes for multiclass classification."
        ],
        [
            "Can you use this?",
            "Yep.",
            "Hello.",
            "So do it OK.",
            "I use this.",
            "OK.",
            "Yes, OK, my name is Sonia Park.",
            "And yes, the talk is about efficient decoding of Canary error correcting output codes for multiclass classification.",
            "Um?",
            "I will start with an introduction and a brief description recapitalisation of error correcting output codes and then talk about our work to make the decoding step a bit more efficient, followed by experiments, Anna conclude."
        ],
        [
            "So error correcting output codes are well known technique for handling multi class classification.",
            "They belong to the group of decomposition algorithms like pairwise classification an.",
            "One against all which transform a multiclass problem into a set of binary problems.",
            "So typically, the number of classifiers exceeds the number of classes.",
            "Which uses a better error correcting and detection ability.",
            "So again, an increase in prediction accuracy comes in general with an increase in the computational demand at training and testing.",
            "And we focused only on the testing phase to make it more efficient.",
            "And in principle it is just a generalization of a previously proposed algorithm.",
            "Which was called cool with it, which I will talk a bit later on to the case to work with the Xbox.",
            "So first to the equals."
        ],
        [
            "Um?",
            "They can be seen as a general framework for multiclass classification and consists of a decomposition scheme.",
            "Yeah, from a multiclass problem to a set of binary problems and it comes with a decoding method which combines these binary predictors to a unified multiclass prediction.",
            "And all relevant information is summarized in a so called coding matrix.",
            "An example is shown here.",
            "So it consists of ones and minus ones and the rows correspond to a specific class.",
            "Here C1 to C4.",
            "And the columns describe essentially the decomposition of the classifiers.",
            "In this case 6 and the ones in minus one means that, for example, this the training instances for C1 are regarded as positive examples.",
            "And the examples of CS 3 and 3 four as negative examples.",
            "And you may be notice that in this case in this example.",
            "The composition schemes like pairwise classification, which ignores some classes, cannot be modeled in this framework.",
            "This was later possible, but the generalization to the ternary case, which just means that a new symbol was introduced there zero symbol.",
            "Which has exactly this meaning that these classes are ignored during the training."
        ],
        [
            "And the traditional way of decoding uses the Hamming distance.",
            "I will show it again an example here.",
            "This let this be the vector of predictions which receive the individual classifiers.",
            "Then we just compare it to each code word of the matrix and choose the one with minimal Hamming distance with the most agreement so to say.",
            "And if you switch the distance measure, you get just other decoding methods.",
            "For example, if you use the archadian distance or the attenuated versions of occlusion and Hemming distance.",
            "Which just treat the zero symbol in a special way.",
            "Or you can use logspace decoding.",
            "Or that plus strategy.",
            "Anna so called better density strategy."
        ],
        [
            "And what was left was the code types.",
            "So here's a list of possible code types.",
            "And part of them were used actually our experiments.",
            "The first one one could consider to use exhaustive ternary codes.",
            "Which, as the name suggests, generate just all possible classifier with the restriction that.",
            "Exactly L classes have to be involved per classifier, so pairwise classification is a.",
            "So to say K2 exhaustive code in this framework.",
            "And we can also consider to use a communitive version, which just subsume exhaustive codes to a specific level.",
            "And.",
            "Then we considered random codes which are probably not really used in practice, but we use them in for analysis purposes.",
            "First one we could specify the probability of the O symbol.",
            "Which means that we can control the sparsity of the icoke metrics.",
            "The second type is just to select random subset of all possible classifiers.",
            "Were those positives fixed and we vary the length?",
            "And coding theory provides a lot of different code types and is.",
            "In principle, the field where the original idea of error correcting output codes originated, and we picked PCH codes as a representative.",
            "Because it has been studied in depth and there's practical advantages like that, the minimum Hamming distance can be pre specified.",
            "Which is an important factor for the error correcting and detection ability.",
            "In this echo framework.",
            "So."
        ],
        [
            "So previously said we wanted to make the decoding step more efficiently and it is a generalization of the KU weighted algorithm which was which was tailored for the pairwise classification setting.",
            "With voting as aggregation method.",
            "And.",
            "If it's helpful to recap, it'll it shortly.",
            "Cool with it and then go to quick Echo.",
            "Um?",
            "An important important point is maybe that the results we gain from cool with it and also the quickie cock produced the same results as the original decoding.",
            "We just reduce the number of classified evaluations.",
            "And the basic idea for Kuwait it was that.",
            "Usually not all pairwise comparisons are needed for determining only the winner class.",
            "And it's easy to see if you imagine the voting process as a tournament of two player games, two player because it's pairwise classification and then often you see situations where there's one dominant player and maybe also early already early in the tournament, which cannot be overtaking anymore.",
            "And.",
            "This observation was just exploited in an algorithm.",
            "Which can be formulated in one sentence to evaluate always the classifier of the of the two best classes.",
            "Until the best class has no evaluations left.",
            "The rationale behind it is just that.",
            "If the current favorite is the true winner, we want to quickly emerge.",
            "The favorite is a winner by playing the dominant players as often as possible and avoiding the games with the.",
            "Which are not.",
            "Good candidates for the top winner.",
            "And the other case is if it's not the true winner, then it's reasonable to assume that among the strongest competitors there is maybe the true winner.",
            "So it's basically the whole Ristic.",
            "And the important point is that this many ideas and concepts also apply.",
            "Then for the echo case."
        ],
        [
            "And the algorithm is shown you very simplified, and these are essentially the most important steps.",
            "First one, the selection of the next classifier as we imagine.",
            "As you can imagine in tournaments.",
            "If if the games had been in a different order, it may be possible that the dominant player maybe.",
            "At me had been determined more faster.",
            "So the order seems to be, it seems to be a bit seems too important.",
            "And the second step is just when we have the classifier we're related and update some relevant statistics.",
            "The third step is then another important step.",
            "The stopping criterion, which tells us when we can stop, and it's obvious that we want to stop as soon as possible or that or that we can determine.",
            "When to stop as tight as possible.",
            "And if you cannot stop right now, we just repeat the process.",
            "And I will go for step one and three more in detail so."
        ],
        [
            "So again, for created, the simple eristic was to select the classifier with the favorite class against the strongest competitor class.",
            "And what is nice about that is the selection is unique or deterministic.",
            "This was not the case anymore for the equal case, so we had to do something different.",
            "We just.",
            "Use the score based approach.",
            "Which is very similar.",
            "And very easy.",
            "We still look at all remaining classifiers from the current favorite class sister.",
            "And then sum up just the strongness of the classes which are on the other side which we are discriminating against.",
            "This means the air I that should be the ranking with respect to accumulated voting up till now.",
            "And then we select just the classifier with a high score.",
            "And again, simply said what we do is to select the classifier which discriminates the favorite class against the greatest number of strong competitors.",
            "And one point maybe.",
            "If, if the.",
            "If we consider only two classes, then it's equivalent to the Kuwaiti touristics.",
            "There was another important point we had."
        ],
        [
            "Find.",
            "And are not the other important step?",
            "Was the stopping criteria.",
            "As I said, it's fairly obvious, I think why it's important and but here concrete in the echo case, it means that.",
            "The worst case of the Hamming distance of the C star class, the current favorite class.",
            "So we can stop if the worst case of the Hamming distance of the star is smaller than all current Hamming distances of all other classes.",
            "And the way we did the worst case scenario was first.",
            "One could first use a native version where we were.",
            "You just consider all remaining classifiers.",
            "Then assume the worst case, which would mean to add 1 to the Hamming distance.",
            "And that would therefore again mean just count the remaining classifiers.",
            "This is a problem.",
            "Because if you consider an example AB versus CD classifier.",
            "You assume that.",
            "So A and let a be the current favorite class.",
            "Then you add 1 to the Hamming distance of a, but nothing to the Hamming distance of B, so it's slightly too pessimistic.",
            "And.",
            "The.",
            "A small improvement.",
            "A simple improvement is to make it class based for each other class you can.",
            "Assume the worst case scenario specific for this class.",
            "And therefore we maintain, for each class separate bound, which should mean the worst case increase.",
            "And we still look at all remaining classifiers with the star and then check if in this classifier see Star is discriminated against CI.",
            "Then we can use even the worst case at one to the Hamming distance.",
            "If C star is nice, CI is not involved in the classifier.",
            "We adjust 0.5 which is according to the Hamming distance.",
            "And what is important, we ignore the case where see star and see I are on the same side.",
            "And the stopping criterion is then essentially the same, which was written here as a text.",
            "If for all classes it holds that the worst case increase added to the current Hamming distance of the current favorite class is smaller than.",
            "The Hamming distance of all other classes we can stop.",
            "Because it's regardless how bad the current class fares in the remaining classifiers.",
            "It will be at the end better with respect to the Hamming distance."
        ],
        [
            "And that was basically the main important simply points to the algorithm.",
            "We of course did some experiments.",
            "It consists of five encoding strategies, the PCH codes, and exhaustive and random codes.",
            "Then seven decoding methods were used.",
            "Which were shortly noted in the previous slides and we are related to them on 7 multiclass datasets.",
            "Which were rather small and the number of classes were up to 8."
        ],
        [
            "And this table shows the first experiment.",
            "First 4 so the columns described the datasets.",
            "An L is the parameter for the exhaustive ternary codes, which they say how many classes have to be involved per classifier.",
            "So these two cases, the purpose classification.",
            "And the number in the cells means or the left small number is the average number of classifier evaluations.",
            "The algorithm used, and the right one in italic means the ratio from this number to the full number of classifiers which was generated and learned and are typically evaluated in the testing step.",
            "So number smaller 1 means reduction, simply set.",
            "And the first observation is that in all cases here, the number is smaller one.",
            "There was reduction possible.",
            "And.",
            "Maybe another point is that if you fix L an go from left to right cause the datasets are sorted according to the class number of classes from small to big.",
            "You see?",
            "That the algorithm seems to benefit from an increased number of classifiers.",
            "Yeah."
        ],
        [
            "This is this is more clearly visible in this table.",
            "Here the table for the PCH codes.",
            "This column describes the use bit length, which corresponds to.",
            "Also, to the number of classifiers which will be generated.",
            "So here it's more clearly visible that.",
            "More classifiers seems to favor the algorithm."
        ],
        [
            "And in this graph shows the experiments with random codes.",
            "Where we varied the sparsity of the generated econometrics, which is shown on the X axis.",
            "And the Y axis describes the quick echo performance an you can clearly and the colors describe the different datasets and you can clearly see a trend that the higher sparsity seems to benefit seems to favor the algorithm."
        ],
        [
            "And this is a short table to show just that quick echo also works with other decoding methods.",
            "And which I couldn't go into detail because of the time.",
            "So to sum it up, we presented a general algorithm for reducing the classifier evaluations.",
            "For seemingly arbitrary ternary cock, mattress is.",
            "Which is applicable to a broad spectrum of code types and decoding methods.",
            "And we identified sparsity and the code length or dimension of the econometrics.",
            "As an indicator, and we believe that their relationship.",
            "If one of these indicators increases that the performance also benefits from it.",
            "And the resulting predictions are guaranteed to be equivalent with originally calling strategy, so we have no loss in accuracy or something.",
            "Um?",
            "And for future work we see improvement potential.",
            "In this phase where we select the next classifier.",
            "For example, ideas of from the active learning setting seems to fit in this case.",
            "And we also want to do more deeper analysis of fast decoding methods in coding theory.",
            "I have to know that the faster coding methods in coding theory have a different goal than our setting, but there seems to be some similarities which could be helpful for our setting.",
            "Um?",
            "That was all.",
            "Thank you."
        ],
        [
            "Yes.",
            "Mason the number of test points.",
            "Yes.",
            "Overhead.",
            "Yes.",
            "We did some small tests and this is really weak point of the of this work.",
            "If the number of classes goes very high or.",
            "The number.",
            "So at some point, the computation for the next classifiers gets very big.",
            "That's true.",
            "But I don't have any results here for presentation, but.",
            "We have to say it may be that we didn't really don't really optimal."
        ],
        [
            "This phase we just used the concept at this place maybe.",
            "There's some room to improve more, but that's right at some point.",
            "It's critical it's not so efficient, yes.",
            "But again, we also had in mind the idea of.",
            "We just want to minimize the classified evaluations and.",
            "That has any idea could be imagined as to be very big in relative, but we use this view so to say."
        ],
        [
            "Question.",
            "After you run with this pen.",
            "I mean.",
            "The number of classifiers you learn.",
            "OK. We use for testing at this time.",
            "Five years.",
            "Who said with a select the body parts of classes were using during the between pathways?",
            "That's a good idea you.",
            "You mean to learn from our evaluations which were selected, and if there is a relation to some kind of instances?",
            "Not be considered, not really.",
            "Maybe another way to go, yes.",
            "Speaker."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hello, my name is hung in Park and this is joint work with you on this phone cons.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "I will talk about our work on efficient decoding of 10 error correcting output codes for multiclass classification.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Can you use this?",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "Hello.",
                    "label": 0
                },
                {
                    "sent": "So do it OK.",
                    "label": 0
                },
                {
                    "sent": "I use this.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Yes, OK, my name is Sonia Park.",
                    "label": 0
                },
                {
                    "sent": "And yes, the talk is about efficient decoding of Canary error correcting output codes for multiclass classification.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "I will start with an introduction and a brief description recapitalisation of error correcting output codes and then talk about our work to make the decoding step a bit more efficient, followed by experiments, Anna conclude.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So error correcting output codes are well known technique for handling multi class classification.",
                    "label": 1
                },
                {
                    "sent": "They belong to the group of decomposition algorithms like pairwise classification an.",
                    "label": 1
                },
                {
                    "sent": "One against all which transform a multiclass problem into a set of binary problems.",
                    "label": 0
                },
                {
                    "sent": "So typically, the number of classifiers exceeds the number of classes.",
                    "label": 1
                },
                {
                    "sent": "Which uses a better error correcting and detection ability.",
                    "label": 0
                },
                {
                    "sent": "So again, an increase in prediction accuracy comes in general with an increase in the computational demand at training and testing.",
                    "label": 1
                },
                {
                    "sent": "And we focused only on the testing phase to make it more efficient.",
                    "label": 0
                },
                {
                    "sent": "And in principle it is just a generalization of a previously proposed algorithm.",
                    "label": 0
                },
                {
                    "sent": "Which was called cool with it, which I will talk a bit later on to the case to work with the Xbox.",
                    "label": 0
                },
                {
                    "sent": "So first to the equals.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "They can be seen as a general framework for multiclass classification and consists of a decomposition scheme.",
                    "label": 1
                },
                {
                    "sent": "Yeah, from a multiclass problem to a set of binary problems and it comes with a decoding method which combines these binary predictors to a unified multiclass prediction.",
                    "label": 1
                },
                {
                    "sent": "And all relevant information is summarized in a so called coding matrix.",
                    "label": 0
                },
                {
                    "sent": "An example is shown here.",
                    "label": 0
                },
                {
                    "sent": "So it consists of ones and minus ones and the rows correspond to a specific class.",
                    "label": 0
                },
                {
                    "sent": "Here C1 to C4.",
                    "label": 0
                },
                {
                    "sent": "And the columns describe essentially the decomposition of the classifiers.",
                    "label": 0
                },
                {
                    "sent": "In this case 6 and the ones in minus one means that, for example, this the training instances for C1 are regarded as positive examples.",
                    "label": 0
                },
                {
                    "sent": "And the examples of CS 3 and 3 four as negative examples.",
                    "label": 0
                },
                {
                    "sent": "And you may be notice that in this case in this example.",
                    "label": 0
                },
                {
                    "sent": "The composition schemes like pairwise classification, which ignores some classes, cannot be modeled in this framework.",
                    "label": 0
                },
                {
                    "sent": "This was later possible, but the generalization to the ternary case, which just means that a new symbol was introduced there zero symbol.",
                    "label": 0
                },
                {
                    "sent": "Which has exactly this meaning that these classes are ignored during the training.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the traditional way of decoding uses the Hamming distance.",
                    "label": 1
                },
                {
                    "sent": "I will show it again an example here.",
                    "label": 0
                },
                {
                    "sent": "This let this be the vector of predictions which receive the individual classifiers.",
                    "label": 0
                },
                {
                    "sent": "Then we just compare it to each code word of the matrix and choose the one with minimal Hamming distance with the most agreement so to say.",
                    "label": 0
                },
                {
                    "sent": "And if you switch the distance measure, you get just other decoding methods.",
                    "label": 0
                },
                {
                    "sent": "For example, if you use the archadian distance or the attenuated versions of occlusion and Hemming distance.",
                    "label": 0
                },
                {
                    "sent": "Which just treat the zero symbol in a special way.",
                    "label": 0
                },
                {
                    "sent": "Or you can use logspace decoding.",
                    "label": 0
                },
                {
                    "sent": "Or that plus strategy.",
                    "label": 0
                },
                {
                    "sent": "Anna so called better density strategy.",
                    "label": 1
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And what was left was the code types.",
                    "label": 0
                },
                {
                    "sent": "So here's a list of possible code types.",
                    "label": 0
                },
                {
                    "sent": "And part of them were used actually our experiments.",
                    "label": 0
                },
                {
                    "sent": "The first one one could consider to use exhaustive ternary codes.",
                    "label": 1
                },
                {
                    "sent": "Which, as the name suggests, generate just all possible classifier with the restriction that.",
                    "label": 0
                },
                {
                    "sent": "Exactly L classes have to be involved per classifier, so pairwise classification is a.",
                    "label": 0
                },
                {
                    "sent": "So to say K2 exhaustive code in this framework.",
                    "label": 0
                },
                {
                    "sent": "And we can also consider to use a communitive version, which just subsume exhaustive codes to a specific level.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Then we considered random codes which are probably not really used in practice, but we use them in for analysis purposes.",
                    "label": 0
                },
                {
                    "sent": "First one we could specify the probability of the O symbol.",
                    "label": 1
                },
                {
                    "sent": "Which means that we can control the sparsity of the icoke metrics.",
                    "label": 1
                },
                {
                    "sent": "The second type is just to select random subset of all possible classifiers.",
                    "label": 0
                },
                {
                    "sent": "Were those positives fixed and we vary the length?",
                    "label": 0
                },
                {
                    "sent": "And coding theory provides a lot of different code types and is.",
                    "label": 0
                },
                {
                    "sent": "In principle, the field where the original idea of error correcting output codes originated, and we picked PCH codes as a representative.",
                    "label": 1
                },
                {
                    "sent": "Because it has been studied in depth and there's practical advantages like that, the minimum Hamming distance can be pre specified.",
                    "label": 1
                },
                {
                    "sent": "Which is an important factor for the error correcting and detection ability.",
                    "label": 0
                },
                {
                    "sent": "In this echo framework.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So previously said we wanted to make the decoding step more efficiently and it is a generalization of the KU weighted algorithm which was which was tailored for the pairwise classification setting.",
                    "label": 0
                },
                {
                    "sent": "With voting as aggregation method.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "If it's helpful to recap, it'll it shortly.",
                    "label": 0
                },
                {
                    "sent": "Cool with it and then go to quick Echo.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "An important important point is maybe that the results we gain from cool with it and also the quickie cock produced the same results as the original decoding.",
                    "label": 0
                },
                {
                    "sent": "We just reduce the number of classified evaluations.",
                    "label": 0
                },
                {
                    "sent": "And the basic idea for Kuwait it was that.",
                    "label": 0
                },
                {
                    "sent": "Usually not all pairwise comparisons are needed for determining only the winner class.",
                    "label": 1
                },
                {
                    "sent": "And it's easy to see if you imagine the voting process as a tournament of two player games, two player because it's pairwise classification and then often you see situations where there's one dominant player and maybe also early already early in the tournament, which cannot be overtaking anymore.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "This observation was just exploited in an algorithm.",
                    "label": 1
                },
                {
                    "sent": "Which can be formulated in one sentence to evaluate always the classifier of the of the two best classes.",
                    "label": 1
                },
                {
                    "sent": "Until the best class has no evaluations left.",
                    "label": 0
                },
                {
                    "sent": "The rationale behind it is just that.",
                    "label": 0
                },
                {
                    "sent": "If the current favorite is the true winner, we want to quickly emerge.",
                    "label": 0
                },
                {
                    "sent": "The favorite is a winner by playing the dominant players as often as possible and avoiding the games with the.",
                    "label": 0
                },
                {
                    "sent": "Which are not.",
                    "label": 0
                },
                {
                    "sent": "Good candidates for the top winner.",
                    "label": 0
                },
                {
                    "sent": "And the other case is if it's not the true winner, then it's reasonable to assume that among the strongest competitors there is maybe the true winner.",
                    "label": 0
                },
                {
                    "sent": "So it's basically the whole Ristic.",
                    "label": 0
                },
                {
                    "sent": "And the important point is that this many ideas and concepts also apply.",
                    "label": 0
                },
                {
                    "sent": "Then for the echo case.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the algorithm is shown you very simplified, and these are essentially the most important steps.",
                    "label": 0
                },
                {
                    "sent": "First one, the selection of the next classifier as we imagine.",
                    "label": 1
                },
                {
                    "sent": "As you can imagine in tournaments.",
                    "label": 0
                },
                {
                    "sent": "If if the games had been in a different order, it may be possible that the dominant player maybe.",
                    "label": 0
                },
                {
                    "sent": "At me had been determined more faster.",
                    "label": 0
                },
                {
                    "sent": "So the order seems to be, it seems to be a bit seems too important.",
                    "label": 0
                },
                {
                    "sent": "And the second step is just when we have the classifier we're related and update some relevant statistics.",
                    "label": 0
                },
                {
                    "sent": "The third step is then another important step.",
                    "label": 0
                },
                {
                    "sent": "The stopping criterion, which tells us when we can stop, and it's obvious that we want to stop as soon as possible or that or that we can determine.",
                    "label": 0
                },
                {
                    "sent": "When to stop as tight as possible.",
                    "label": 0
                },
                {
                    "sent": "And if you cannot stop right now, we just repeat the process.",
                    "label": 0
                },
                {
                    "sent": "And I will go for step one and three more in detail so.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So again, for created, the simple eristic was to select the classifier with the favorite class against the strongest competitor class.",
                    "label": 1
                },
                {
                    "sent": "And what is nice about that is the selection is unique or deterministic.",
                    "label": 0
                },
                {
                    "sent": "This was not the case anymore for the equal case, so we had to do something different.",
                    "label": 0
                },
                {
                    "sent": "We just.",
                    "label": 0
                },
                {
                    "sent": "Use the score based approach.",
                    "label": 0
                },
                {
                    "sent": "Which is very similar.",
                    "label": 0
                },
                {
                    "sent": "And very easy.",
                    "label": 1
                },
                {
                    "sent": "We still look at all remaining classifiers from the current favorite class sister.",
                    "label": 0
                },
                {
                    "sent": "And then sum up just the strongness of the classes which are on the other side which we are discriminating against.",
                    "label": 0
                },
                {
                    "sent": "This means the air I that should be the ranking with respect to accumulated voting up till now.",
                    "label": 0
                },
                {
                    "sent": "And then we select just the classifier with a high score.",
                    "label": 0
                },
                {
                    "sent": "And again, simply said what we do is to select the classifier which discriminates the favorite class against the greatest number of strong competitors.",
                    "label": 1
                },
                {
                    "sent": "And one point maybe.",
                    "label": 0
                },
                {
                    "sent": "If, if the.",
                    "label": 0
                },
                {
                    "sent": "If we consider only two classes, then it's equivalent to the Kuwaiti touristics.",
                    "label": 0
                },
                {
                    "sent": "There was another important point we had.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Find.",
                    "label": 0
                },
                {
                    "sent": "And are not the other important step?",
                    "label": 0
                },
                {
                    "sent": "Was the stopping criteria.",
                    "label": 0
                },
                {
                    "sent": "As I said, it's fairly obvious, I think why it's important and but here concrete in the echo case, it means that.",
                    "label": 0
                },
                {
                    "sent": "The worst case of the Hamming distance of the C star class, the current favorite class.",
                    "label": 0
                },
                {
                    "sent": "So we can stop if the worst case of the Hamming distance of the star is smaller than all current Hamming distances of all other classes.",
                    "label": 1
                },
                {
                    "sent": "And the way we did the worst case scenario was first.",
                    "label": 0
                },
                {
                    "sent": "One could first use a native version where we were.",
                    "label": 0
                },
                {
                    "sent": "You just consider all remaining classifiers.",
                    "label": 0
                },
                {
                    "sent": "Then assume the worst case, which would mean to add 1 to the Hamming distance.",
                    "label": 0
                },
                {
                    "sent": "And that would therefore again mean just count the remaining classifiers.",
                    "label": 0
                },
                {
                    "sent": "This is a problem.",
                    "label": 0
                },
                {
                    "sent": "Because if you consider an example AB versus CD classifier.",
                    "label": 0
                },
                {
                    "sent": "You assume that.",
                    "label": 0
                },
                {
                    "sent": "So A and let a be the current favorite class.",
                    "label": 0
                },
                {
                    "sent": "Then you add 1 to the Hamming distance of a, but nothing to the Hamming distance of B, so it's slightly too pessimistic.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "A small improvement.",
                    "label": 0
                },
                {
                    "sent": "A simple improvement is to make it class based for each other class you can.",
                    "label": 0
                },
                {
                    "sent": "Assume the worst case scenario specific for this class.",
                    "label": 0
                },
                {
                    "sent": "And therefore we maintain, for each class separate bound, which should mean the worst case increase.",
                    "label": 0
                },
                {
                    "sent": "And we still look at all remaining classifiers with the star and then check if in this classifier see Star is discriminated against CI.",
                    "label": 0
                },
                {
                    "sent": "Then we can use even the worst case at one to the Hamming distance.",
                    "label": 0
                },
                {
                    "sent": "If C star is nice, CI is not involved in the classifier.",
                    "label": 0
                },
                {
                    "sent": "We adjust 0.5 which is according to the Hamming distance.",
                    "label": 0
                },
                {
                    "sent": "And what is important, we ignore the case where see star and see I are on the same side.",
                    "label": 0
                },
                {
                    "sent": "And the stopping criterion is then essentially the same, which was written here as a text.",
                    "label": 0
                },
                {
                    "sent": "If for all classes it holds that the worst case increase added to the current Hamming distance of the current favorite class is smaller than.",
                    "label": 0
                },
                {
                    "sent": "The Hamming distance of all other classes we can stop.",
                    "label": 0
                },
                {
                    "sent": "Because it's regardless how bad the current class fares in the remaining classifiers.",
                    "label": 0
                },
                {
                    "sent": "It will be at the end better with respect to the Hamming distance.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And that was basically the main important simply points to the algorithm.",
                    "label": 0
                },
                {
                    "sent": "We of course did some experiments.",
                    "label": 0
                },
                {
                    "sent": "It consists of five encoding strategies, the PCH codes, and exhaustive and random codes.",
                    "label": 1
                },
                {
                    "sent": "Then seven decoding methods were used.",
                    "label": 1
                },
                {
                    "sent": "Which were shortly noted in the previous slides and we are related to them on 7 multiclass datasets.",
                    "label": 0
                },
                {
                    "sent": "Which were rather small and the number of classes were up to 8.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this table shows the first experiment.",
                    "label": 1
                },
                {
                    "sent": "First 4 so the columns described the datasets.",
                    "label": 1
                },
                {
                    "sent": "An L is the parameter for the exhaustive ternary codes, which they say how many classes have to be involved per classifier.",
                    "label": 0
                },
                {
                    "sent": "So these two cases, the purpose classification.",
                    "label": 0
                },
                {
                    "sent": "And the number in the cells means or the left small number is the average number of classifier evaluations.",
                    "label": 1
                },
                {
                    "sent": "The algorithm used, and the right one in italic means the ratio from this number to the full number of classifiers which was generated and learned and are typically evaluated in the testing step.",
                    "label": 1
                },
                {
                    "sent": "So number smaller 1 means reduction, simply set.",
                    "label": 0
                },
                {
                    "sent": "And the first observation is that in all cases here, the number is smaller one.",
                    "label": 0
                },
                {
                    "sent": "There was reduction possible.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Maybe another point is that if you fix L an go from left to right cause the datasets are sorted according to the class number of classes from small to big.",
                    "label": 0
                },
                {
                    "sent": "You see?",
                    "label": 1
                },
                {
                    "sent": "That the algorithm seems to benefit from an increased number of classifiers.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is this is more clearly visible in this table.",
                    "label": 0
                },
                {
                    "sent": "Here the table for the PCH codes.",
                    "label": 0
                },
                {
                    "sent": "This column describes the use bit length, which corresponds to.",
                    "label": 0
                },
                {
                    "sent": "Also, to the number of classifiers which will be generated.",
                    "label": 0
                },
                {
                    "sent": "So here it's more clearly visible that.",
                    "label": 0
                },
                {
                    "sent": "More classifiers seems to favor the algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And in this graph shows the experiments with random codes.",
                    "label": 1
                },
                {
                    "sent": "Where we varied the sparsity of the generated econometrics, which is shown on the X axis.",
                    "label": 0
                },
                {
                    "sent": "And the Y axis describes the quick echo performance an you can clearly and the colors describe the different datasets and you can clearly see a trend that the higher sparsity seems to benefit seems to favor the algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is a short table to show just that quick echo also works with other decoding methods.",
                    "label": 0
                },
                {
                    "sent": "And which I couldn't go into detail because of the time.",
                    "label": 0
                },
                {
                    "sent": "So to sum it up, we presented a general algorithm for reducing the classifier evaluations.",
                    "label": 0
                },
                {
                    "sent": "For seemingly arbitrary ternary cock, mattress is.",
                    "label": 0
                },
                {
                    "sent": "Which is applicable to a broad spectrum of code types and decoding methods.",
                    "label": 0
                },
                {
                    "sent": "And we identified sparsity and the code length or dimension of the econometrics.",
                    "label": 0
                },
                {
                    "sent": "As an indicator, and we believe that their relationship.",
                    "label": 0
                },
                {
                    "sent": "If one of these indicators increases that the performance also benefits from it.",
                    "label": 0
                },
                {
                    "sent": "And the resulting predictions are guaranteed to be equivalent with originally calling strategy, so we have no loss in accuracy or something.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And for future work we see improvement potential.",
                    "label": 0
                },
                {
                    "sent": "In this phase where we select the next classifier.",
                    "label": 0
                },
                {
                    "sent": "For example, ideas of from the active learning setting seems to fit in this case.",
                    "label": 0
                },
                {
                    "sent": "And we also want to do more deeper analysis of fast decoding methods in coding theory.",
                    "label": 0
                },
                {
                    "sent": "I have to know that the faster coding methods in coding theory have a different goal than our setting, but there seems to be some similarities which could be helpful for our setting.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "That was all.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Mason the number of test points.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Overhead.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "We did some small tests and this is really weak point of the of this work.",
                    "label": 0
                },
                {
                    "sent": "If the number of classes goes very high or.",
                    "label": 0
                },
                {
                    "sent": "The number.",
                    "label": 0
                },
                {
                    "sent": "So at some point, the computation for the next classifiers gets very big.",
                    "label": 0
                },
                {
                    "sent": "That's true.",
                    "label": 0
                },
                {
                    "sent": "But I don't have any results here for presentation, but.",
                    "label": 0
                },
                {
                    "sent": "We have to say it may be that we didn't really don't really optimal.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This phase we just used the concept at this place maybe.",
                    "label": 0
                },
                {
                    "sent": "There's some room to improve more, but that's right at some point.",
                    "label": 0
                },
                {
                    "sent": "It's critical it's not so efficient, yes.",
                    "label": 0
                },
                {
                    "sent": "But again, we also had in mind the idea of.",
                    "label": 0
                },
                {
                    "sent": "We just want to minimize the classified evaluations and.",
                    "label": 0
                },
                {
                    "sent": "That has any idea could be imagined as to be very big in relative, but we use this view so to say.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Question.",
                    "label": 0
                },
                {
                    "sent": "After you run with this pen.",
                    "label": 0
                },
                {
                    "sent": "I mean.",
                    "label": 0
                },
                {
                    "sent": "The number of classifiers you learn.",
                    "label": 0
                },
                {
                    "sent": "OK. We use for testing at this time.",
                    "label": 0
                },
                {
                    "sent": "Five years.",
                    "label": 0
                },
                {
                    "sent": "Who said with a select the body parts of classes were using during the between pathways?",
                    "label": 0
                },
                {
                    "sent": "That's a good idea you.",
                    "label": 0
                },
                {
                    "sent": "You mean to learn from our evaluations which were selected, and if there is a relation to some kind of instances?",
                    "label": 0
                },
                {
                    "sent": "Not be considered, not really.",
                    "label": 0
                },
                {
                    "sent": "Maybe another way to go, yes.",
                    "label": 0
                },
                {
                    "sent": "Speaker.",
                    "label": 0
                }
            ]
        }
    }
}